{
 "name": "\"Frog Lady\"",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Unidentified frog-like anthropoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.45 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  }
 ],
 "content": "\"Frog Lady\" was the nickname of an amphibious female being who was escorted by Din Djarin.\nIn 9 ABY, Frog Lady was on Tatooine in Chalmun's Spaceport Cantina when Mandalorian Din Djarin entered the cantina in search of work. Some time later she talked to Peli Motto about getting an escort from the desert planet to the estuary moon of Trask because she had eggs that needed to be fertilized by her husband. Peli enlisted Djarin to escort her. Djarin helped but asked for information regarding other Mandalorians seen on Trask. During their journey, Frog Lady slept in the cockpit, unaware that Grogu took an interest in her eggs and ate some of them.\nAfter crashing on Maldo Kreis, Frog Lady and Djarin clashed regarding what to do next, in part due to their language barrier. Frog Lady seemed able to speak only her native tongue, and unable to speak Basic. Frog Lady did prove to be technically adept, however, as she was able to repair the remnants of Q9-0 well enough to use his vocabulator as a translation device, enabling her to persuade Din Djarin to keep his word.\nWith their resolve renewed, Frog Lady later ventured out into the surrounding ice caves. There, she located and bathed in a natural hot spring, which allowed her to incubate her remaining eggs. The peace did not last however, as their presence eventually roused the many ice spiders in the den, including the menacingly large parents of the hatchlings. In fleeing the spiders, Frog Lady revealed a prehensile tongue, that could be used to grasp objects. She was also able to move more speedily by leaping using all four legs, so as to better flee knobby white ice spiders.\nAfter escaping Maldo Kreis, Frog Lady assisted Din Djarin in a landing attempt on Trask by pulling a lever to stabilize the thrusters, but it didn't work and they ended up in the water. Once they got pulled out, Frog Lady was able to leave the ship. Shortly after she heard her husband's voice at the docks, the couple finally managed to reunite, with both husband and wife thanking Din for his aid.\nAfter Din Djarin agreed to help Bo-Katan Kryze hijack a Gozanti-class Assault Carrier, Frog Lady looked after Grogu for a time while her eggs began to hatch. Frog Lady and her husband were later playing with Grogu and one of their hatched offspring when Din returned to fetch Grogu. He thanked her for looking after the Foundling. Frog Lady and her husband continued to bond over their offspring as Djarin and Grogu departed.\nFrog Lady was an excellent shot and a skilled droidsmith.\nFrog Lady wielded a Shard-3A holdout cluster blaster.\n\"Frog Lady\" first appeared in Chapter 5: The Gunslinger the fifth episode of season one of The Mandalorian, and she played a larger role in Chapter 10: The Passenger, the second episode of season two. She was portrayed in costume by Misty Rosas. Voice performance was provided by Dee Bradley Baker. During the scene in which Frog Lady hopped away from the attacking ice spiders, a digital CGI version of the character was instead used to give a feeling of sloppiness instead of athleticism.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Frog_Lady",
  "/wiki/Unidentified_frog-like_anthropoid",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Amphibian",
  "/wiki/Din_Djarin",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Mandalorian",
  "/wiki/Cantina",
  "/wiki/Peli_Motto",
  "/wiki/Planet",
  "/wiki/Water",
  "/wiki/Moon",
  "/wiki/Trask",
  "/wiki/Egg",
  "/wiki/Frog_Man",
  "/wiki/Mission_to_Trask",
  "/wiki/Grogu",
  "/wiki/Maldo_Kreis",
  "/wiki/Language",
  "/wiki/Q9-0",
  "/wiki/Vocabulator",
  "/wiki/Tongue",
  "/wiki/Knobby_white_ice_spider",
  "/wiki/Razor_Crest",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Gozanti-class_Assault_Carrier",
  "/wiki/Droidsmith",
  "/wiki/Shard-3A_holdout_cluster_blaster",
  "/wiki/Chapter_5:_The_Gunslinger",
  "/wiki/The_Mandalorian_Season_One",
  "/wiki/The_Mandalorian",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/Misty_Rosas",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Category:Images_of_Frog_Lady",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/Chapter_11:_The_Heiress",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_Two",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/The_Eyes_Have_It",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Going_in_for_the_Kuiil",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/%22Do_You_Speak_Bocce%3F%22",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}