{
 "name": "002",
 "display_name": "CT-43/002",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Muunilinst"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "The Muunilinst 10",
      "The Muunilinst 10"
     ]
    }
   ]
  }
 ],
 "content": "CT-43/002 was a clone trooper and member of The Muunilinst 10, a mixed group of elite Advanced Recon Commandos and regular clone troopers that participated in a battle on the planet Muunilinst in 22 BBY during the Clone Wars. The commandos were tasked with capturing a Confederate artillery emplacement, but the clones' LAAT/i gunship was shot down by a B1-Series battle droid, and battle droid assassins opened fire at the clone trooper survivors of the ship's crash. In the ensuing firefight, CT-43/002 was killed; however, the rest of the squad survived the droid attack and eventually completed their mission without sustaining any more casualties. Later, The Muunilinst 10 leader, Captain ARC-77, transferred his Chancellor's Service Medal to CT-43/002 posthumously.\nA clone of bounty hunter Jango Fett, clone trooper CT-43/002 was born on the planet of Kamino to serve in the Grand Army of the Republic. In 22 BBY, during the Clone Wars, Jedi General Obi-Wan Kenobi led Galactic Republic forces to the planet Muunilinst, where the InterGalactic Banking Clan was manufacturing substantial droid armies for the Confederacy of Independent Systems. CT-43/002 was among the troops dispatched to Muunilinst and was chosen as a member of The Muunilinst 10, a special task force of seven clone troopers and two Advanced Recon Commandos led by Captain ARC-77. Acting independently from the rest of the clone troopers, The Muunilinst 10 was supposed to aid the Republic in achieving a swift victory by capturing a Separatist artillery emplacement on the surface of the planet. Before the Republic fleet reached its destination, Kenobi personally reminded the task force of the utmost importance of its mission.\nAfter arriving at Muunilinst, Jedi Commander Anakin Skywalker and his pilots engaged the Banking Clan's Nantex-class starfighters above the planet, while Kenobi's ground troops utilized LAAT/i gunships to reach the planet's surface. As the Republic forces headed toward the city of Harnaidan, Kenobi ordered CT-43/002 and The Muunilinst 10 to break off and proceed with their mission. Once in Harnaidan, however, their gunship was shot down by a B1-Series battle droid with a rocket launcher and crashed in one of the city's streets. All members of The Muunilinst 10 survived the crash and, following ARC-77's order, disembarked from the downed ship.\nAt that moment, battle droid assassins who had been hiding in the nearby buildings opened fire on the clone troopers. The clones quickly started shooting back in retaliation, but CT-43/002 was soon killed by enemy fire. The other members of his unit survived the attack and managed to destroy the droids. ARC-77 and his surviving men then proceeded to destroy the Confederate artillery cannon, rendezvoused with Kenobi, and helped him to capture the Banking Clan leader, San Hill. By the end of the battle, CT-43/002 was the squad's only casualty. Later, ARC-77 was awarded the Chancellor's Service Medal for his actions at the Battle of Hypori, but transferred the award posthumously to CT-43/002.\nLike all of Jango Fett's clones, CT-43/002 stood 1.83 meters tall. He wore Phase I clone trooper armor and wielded a DC-15A blaster rifle in combat. The trooper was chosen to be a member of The Muunilinst 10, a unit considered to be elite by General Kenobi.\nCT-43/002 first appeared as one of the unnamed clones in the second episode of Genndy Tartakovsky's Star Wars: Clone Wars animated television series, originally aired on November 10, 2003 on Cartoon Network. He was killed shortly after his introduction, in the third episode of the series. The Guide to the Grand Army of the Republic article, written by Karen Traviss and published in Star Wars Insider 84, later identified him as CT-43/002.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Muunilinst/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/The_Muunilinst_10",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Battle_of_Muunilinst/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Commando/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Artillery/Legends",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Battle_droid_assassin",
  "/wiki/Trooper/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Lightfight",
  "/wiki/Death/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/ARC-77",
  "/wiki/Chancellor%27s_Service_Medal",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/InterGalactic_Banking_Clan/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Nantex-class_territorial_defense_starfighter/Legends",
  "/wiki/City/Legends",
  "/wiki/Harnaidan",
  "/wiki/Gunship/Legends",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Harnaidan_defensive_cannon",
  "/wiki/San_Hill/Legends",
  "/wiki/Battle_of_Hypori/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/DC-15A_blaster_rifle/Legends",
  "/wiki/Clone_Wars_Chapter_2",
  "/wiki/Genndy_Tartakovsky",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/November_10",
  "/wiki/2003",
  "/wiki/Cartoon_Network",
  "/wiki/Clone_Wars_Chapter_3",
  "/wiki/Guide_to_the_Grand_Army_of_the_Republic",
  "/wiki/Karen_Traviss",
  "/wiki/Star_Wars_Insider_84",
  "/wiki/Star_Wars:_Clone_Wars_(PhotoComic)",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Clone_Wars_Chapter_1"
 ]
}