{
 "name": "1047",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Zeta Squadron",
      "Zeta Squadron"
     ]
    }
   ]
  }
 ],
 "content": "1047 was a Human male stormtrooper who served as a sergeant in the Galactic Empire's Desert Sands unit by 0 BBY. In that year, he was among the Desert Sands troopers dispatched to the planet Tatooine to search for the fugitive Rebel Alliance droids C-3PO and R2-D2, who carried stolen plans for the Empire's Death Star battlestation. 1047 was among Desert Sands' Zeta Squadron detachment, who conducted their search in the spaceport city of Mos Eisley. Ultimately, Desert Sands' search led 1047 and others in the unit to Mos Eisley's Docking Bay 94, where they attempted to apprehend the Millennium Falcon, the YT-1300 light freighter that the droids had boarded for escape, but the troopers were unable to prevent the ship from fleeing.\n1047 was a Human male who served in the Galactic Empire's Stormtrooper Corps by 0 BBY. By that year, he had become a sandtrooper sergeant, attached to the Desert Sands unit under Captain Mod Terrik's command.\nIn 0 BBY, Desert Sands was dispatched to the planet Tatooine to search for the fugitive Alliance to Restore the Republic droids C-3PO and R2-D2, who were wanted for carrying the stolen plans for the Empire's first Death Star battlestation. 1047 was among the Desert Sands troopers assigned to the unit's Zeta Squadron detachment, tasked with searching the planet's spaceport city of Mos Eisley for the droids, serving as the backup to fellow trooper Davin Felth.\nAt one point, 1047 and Felth were outside Mos Eisley's Chalmun's Spaceport Cantina when one of the cantina's patrons, Garouf Lafoe, approached to inform them of a fight that had occurred within the cantina. Felth used his comlink to inform Terrik that he would investigate the cantina disturbance, and the latter requested that 1047 back up Felth. The pair entered the cantina and left after failing to find anything out of the ordinary, not knowing that two of the occupants, Tatooine locals Obi-Wan Kenobi and Luke Skywalker, they had seen were in fact trying to sneak the droids off of Tatooine.\nFelth and 1047 departed the cantina, and were approached by others in their squadron marching toward them. Before they knew it, the Jawa Het Nkik approached them, firing a DL-44 heavy blaster pistol multiple times at the troopers with no effect. Upon Nkik's unsuccessful attack, 1047 casually killed the Jawa with a single shot.\n1047 and Felth joined Zeta Squadron in their subsequent march, when Terrik alerted them that the droids were spotted trying to escape in Docking Bay 94, and requested all units to assist. 1047 and Felth ran to the docking bay, where they spotted smuggler Han Solo defending his starship, the YT-1300 light freighter Millennium Falcon, from other Desert Sands stormtroopers. Terrik was killed in the resulting lightfight, and the Millennium Falcon departed the docking bay with the fugitive droids. The stormtroopers retreated after the freighter's escape to avoid being irradiated by exhaust from the Millennium Falcon. Already demoralized, the troopers' morale was only further reduced by the discovery of Terrik's death.\n1047 was hesitant to investigate the disturbance at Chalmun's Cantina, believing it would detract from their search for R2-D2 and C-3PO, and directly stating that droids were not served by places like the cantina and that Zeta Squadron was needed elsewhere. He muttered that Het Nkik was a \"crazy Jawa,\" and had no hesitation to kill the Jawa even when the latter was harmless, viewing Nkik's death as just one less Jawa slime.\nAs with all members of Desert Sands, 1047 was equipped with the standard modified stormtrooper armor issued to sandtroopers. He also carried a long-range comlink, a blaster pistol, a heavy blaster rifle, and a food/water pack. 1047 had a white shoulder pauldron, and was individually armed with a T-21 light repeating blaster.\n1047 first appeared in the 1976 novelization of Star Wars: Episode IV A New Hope, before he later appeared in the film itself, released the next year as the first film of the original trilogy, in scenes filmed from April 12 to April 22, 1976 at Elstree Studios's Stage 6. 1047 was also in the second issue of Marvel Comics's A New Hope adaptation, released on August 1, 1977. Unlike in the film, both he and Davin Felth are shown wearing standard stormtrooper armor instead of sandtrooper armor. 1047 was first named in Doug Beason's short story \"When the Desert Wind Turns: The Stormtrooper's Tale\" as part of the 1995 anthology book Tales from the Mos Eisley Cantina.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/TD-787",
  "/wiki/1047",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Zeta_Squadron",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Desert_Sands",
  "/wiki/0_BBY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battlestation",
  "/wiki/Spaceport/Legends",
  "/wiki/City/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Docking_Bay_94/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Desert_stormtrooper/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Mod_Terrik",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Davin_Felth/Legends",
  "/wiki/Chalmun%27s_Spaceport_Cantina/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Garouf_Lafoe/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Het_Nkik/Legends",
  "/wiki/DL-44_heavy_blaster_pistol/Legends",
  "/wiki/Death/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Lightfight",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Water/Legends",
  "/wiki/Backpack/Legends",
  "/wiki/Color/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Pauldron/Legends",
  "/wiki/T-21_light_repeating_blaster/Legends",
  "/wiki/1976",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/April_12",
  "/wiki/April_22",
  "/wiki/Elstree_Studios",
  "/wiki/Star_Wars_(1977)_2",
  "/wiki/Marvel_Comics",
  "/wiki/August_1",
  "/wiki/Armor/Legends",
  "/wiki/Doug_Beason",
  "/wiki/When_the_Desert_Wind_Turns:_The_Stormtrooper%27s_Tale",
  "/wiki/1995",
  "/wiki/Tales_from_the_Mos_Eisley_Cantina",
  "/wiki/A_Hunter%27s_Fate:_Greedo%27s_Tale",
  "/wiki/Hammertong:_The_Tale_of_the_%22Tonnika_Sisters%22",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(junior_novelization)",
  "/wiki/Star_Wars_Manga:_A_New_Hope_2",
  "/wiki/Be_Still_My_Heart:_The_Bartender%27s_Tale",
  "/wiki/Nightlily:_The_Lovers%27_Tale",
  "/wiki/Nightlily:_The_Lovers%27_Tale_(audio)",
  "/wiki/At_the_Crossroads:_The_Spacer%27s_Tale",
  "/wiki/Swap_Meet:_The_Jawa%27s_Tale",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Premiere_Limited",
  "/wiki/A_New_Hope_Limited",
  "/wiki/The_Art_of_Star_Wars_Episode_IV:_A_New_Hope",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_16",
  "/wiki/The_Official_Star_Wars_Fact_File_22",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/Battle_of_Yavin_(TCG)",
  "/wiki/The_Official_Star_Wars_Fact_File_79",
  "/wiki/Inside_the_Worlds_of_Star_Wars_Trilogy",
  "/wiki/The_Official_Star_Wars_Fact_File_140",
  "/wiki/Star_Wars:_Complete_Locations_(2005)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_32",
  "/wiki/Star_Wars_A%E2%80%93Z",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Category:Images_of_1047",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Databank_(original)",
  "/wiki/Galaxy_Guide_1:_A_New_Hope",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film"
 ]
}