{
 "name": "17786",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Zaarin coup forces"
     ]
    }
   ]
  }
 ],
 "content": "17786 was the designation given to one of the Galactic Empire's stormtroopers. He was the offspring of Nial Declann, and as such was himself Force-sensitive. At some point, he had been recruited into the Emperor's Hand Arden Lyn's ranks to be trained in Ter채s K채si. Officially, Lyn did this as part of her mission to take out the \"Heroes of Yavin,\" but in actuality, she did this as part of her plan to launch an attempted coup against Emperor Palpatine. However, he later went into hiding with his mentor alongside his fellow student, the Gamorrean Thok, after Lyn's plot had been exposed to Palpatine via Mara Jade. He later resurfaced during the Zaarin insurrection, having participated alongside Thok and Lyn in capturing the Emperor alongside Zaarin's forces by using their combined Force abilities to subdue the mighty Sith Lord.\n17786 first appeared in the fighting game Star Wars: Masters of Ter채s K채si, as a secret character. However, he was never given a name nor appeared in any other Star Wars-related works until the release of the second part of the blog Barely Tolerable: Alien Henchmen of the Empire. Similarly, because he was a secret character, it was left ambiguous as to whether he was aligned with Lyn or not, as well as whether he was canonical, until the same blog established that he was one of Lyn's students. He had at least two skins, the standard Stormtrooper attire and the Scout trooper uniform.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Zaarin_coup_forces",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Nial_Declann",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Arden_Lyn",
  "/wiki/Ter%C3%A4s_K%C3%A4si/Legends",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Thok_(Gamorrean_guard)",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Zaarin_insurrection",
  "/wiki/Demetrius_Zaarin",
  "/wiki/The_Force/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Star_Wars:_Masters_of_Ter%C3%A4s_K%C3%A4si",
  "/wiki/Star_Wars",
  "/wiki/Barely_Tolerable:_Alien_Henchmen_of_the_Empire",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Scout_trooper_armor/Legends",
  "/wiki/StarWars.com"
 ]
}