{
 "name": "35  (Ando Prime)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicGrand Army of the RepublicExcelsior Company",
      "Grand Army of the RepublicExcelsior Company",
      "Excelsior Company"
     ]
    }
   ]
  }
 ],
 "content": "\"35\" was the nickname of a rookie clone trooper who served in Excelsior Company under the command of Clone Commander Vargus.\n\"35\" was the nickname of a clone trooper that served in Excelsior Company. He was one of six clones to be selected for Clone Commander Vargus's special mission to Ando Prime. The mission was to find the whereabouts of the 313th Legion, which had gone missing during a routine attack on a Confederate base there. While traveling to the base, 35 and several other clones asked the sergeant, 18, if they could use the podracers to get there faster, as they had discovered several abandoned Pods in a canyon. However, 18 turned down their request due to the danger of a Human trying to drive a Pod. Upon entering the base, they found a Skakoan engineer who was employed by the Separatist to create a hyperspace warping device, which General Terrus planned to use for a surprise attack on Coruscant. When learning that the scientist, Vylagos, would die if his helmet was removed, Vargus struck a deal with him, the terms being that if Vylagos could bring the 313th Legion back, Vargus would not take off the Skakoan's helmet.\nVylagos then calibrated the device to transport all living things within one kilometer of the device to be transported back to Ando Prime. While he was calibrating it, they met Clone Commander Cody and Jedi Master Obi-Wan Kenobi, who were also looking for the legion. 35 went through with Falco, Dom, 44, 36, 57, Cody, Kenobi, and 18. They were transported to a rocky, barren world that was, according to Vylagos, in the far reaches of the Outer Rim. 18 told Jedi General Po Bandis to gather all the troops into a one-kilometer radius, then the general sent them to destroy a Confederacy listening post, located nearby. The clones hijacked a modified hailfire droid, which was now a manned tank, and used its missiles to destroy the listening post. When they drove back, with Dom tossing out pulse grenades the whole way, the legion was gathered in the one-kilometer radius, so they were transported back.\n35 first appeared in The Clone Wars: Decide Your Destiny: The Lost Legion, which has approximately thirty-five different endings, branching out from four different beginnings. 35 appears if the reader chooses 18 to become a sergeant, and depending on some of the reader's choices, 35 may not even appear.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Three-Five",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Excelsior_Company",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/Vargus",
  "/wiki/The_Clone_Wars:_Decide_Your_Destiny:_The_Lost_Legion",
  "/wiki/Canon",
  "/wiki/Ando_Prime/Legends",
  "/wiki/313th_Legion",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/18",
  "/wiki/Podracing/Legends",
  "/wiki/Skakoan/Legends",
  "/wiki/Hyperspace_warping_device",
  "/wiki/General/Legends",
  "/wiki/Terrus",
  "/wiki/Coruscant/Legends",
  "/wiki/Vylagos",
  "/wiki/Kilometer/Legends",
  "/wiki/CC-2224/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Falco",
  "/wiki/Dom",
  "/wiki/44",
  "/wiki/36",
  "/wiki/57",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Po_Bandis",
  "/wiki/Confederacy_listening_post",
  "/wiki/IG-227_Hailfire-class_droid_tank/Legends",
  "/wiki/Pulse_grenade"
 ]
}