{
 "name": "36",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grand Army of the RepublicExcelsior Company",
      "Excelsior Company"
     ]
    }
   ]
  }
 ],
 "content": "36 was a rookie clone trooper who served in Excelsior Company under the command of Clone Commander Vargus.\n36 was assigned to Excelsior Company for a mission to Ando Prime to find the 313th Legion, which had gone missing during a routine attack on a Confederacy of Independent Systems outpost. While traveling to the base, 35 and several other clones discovered several abandoned podracers in a canyon. 18 denied the request use the podracers for faster travel, due to the high risk for humans attempting to pilot the high-speed machines. Upon entering the base, they found a Skakoan engineer who was employed by the Separatist to create a hyperspace warping device, which General Terrus planned to use for a surprise attack on Coruscant. When learning that the scientist, Vylagos, would die if his helmet was removed, Vargus struck a deal with him: if Vylagos could bring the 313th Legion back, Vargus would not take off the Skakoan's helmet. Vylagos then calibrated a device to transport all living beings within one kilometer of the device back to Ando Prime. While he was calibrating the device, the group met Clone Commander Cody and Obi-Wan Kenobi, who were also looking for the legion. 36 went through with Falco, Dom, 44, 35, 57, Clone Commander Cody, Jedi General Obi-Wan Kenobi, and 18. They were transported to a rocky, barren world that was, according to Vylagos, in the far reaches of the Outer Rim. 18 told Jedi General Po Bandis to gather all the troops into a one-kilometer radius, then the general sent them to destroy a Confederacy listening post, located nearby. The clones hijacked a Hailfire droid that had been modified into a non-droid tank, and used its missiles to destroy the listening post. As they drove back, Dom tossed out pulse grenades, forcing the legion to gather in the one-kilometer radius, so they were transported back.\n36 was created for the book, The Clone Wars: Decide Your Destiny: The Lost Legion. There are about 35 different endings for the book, so the true ending that is canonical is yet to be determined.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Excelsior_Company",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/Vargus",
  "/wiki/Ando_Prime/Legends",
  "/wiki/313th_Legion",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Podracer/Legends",
  "/wiki/18",
  "/wiki/Skakoan/Legends",
  "/wiki/Hyperspace_warping_device",
  "/wiki/General/Legends",
  "/wiki/Terrus",
  "/wiki/Coruscant/Legends",
  "/wiki/Vylagos",
  "/wiki/Kilometer/Legends",
  "/wiki/CC-2224/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Falco_(clone_trooper)",
  "/wiki/Dom",
  "/wiki/44",
  "/wiki/35_(Ando_Prime)",
  "/wiki/57",
  "/wiki/Jedi_General/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Po_Bandis",
  "/wiki/Confederacy_listening_post",
  "/wiki/IG-227_Hailfire-class_droid_tank/Legends",
  "/wiki/Pulse_grenade",
  "/wiki/The_Clone_Wars:_Decide_Your_Destiny:_The_Lost_Legion"
 ]
}