{
 "name": "44",
 "display_name": "44",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicGrand Army of the RepublicExcelsior Company",
      "Grand Army of the RepublicExcelsior Company",
      "Excelsior Company"
     ]
    }
   ]
  }
 ],
 "content": "44 was a clone trooper who served in Excelsior Company under the command of Clone Commander Vargus.\n44 was one of the six rookie clones, the others being 18, 23, 35, 36, and 57, sent from Kamino that was selected for a special mission to Ando Prime to investigate the disappearance of the 313th Legion and its leader, Jedi General Po Bandis. Upon arriving, Vargus sent out the Advanced Recon Force trooper, Falco, along with all the rookies, to do recon. During that recon, 44 earned the nickname \"Slug\", given to him by Falco, for lagging behind the group. When they got a visual on the Confederacy base, Falco told the rookies to wait for him to return from the base. After waiting for over an hour, 18 contacted Commander Vargus, and was ordered to wait for the rest of the squad. When the rest of the squad arrived, they all entered the outpost and discovered Falco talking with Obi-Wan Kenobi and Clone Commander Cody. Kenobi and Cody were also investigating the disappearance of the legion. When Vargus had the base searched, they found a Skakoan engineer by the name of Vylagos and a strange machine. Vylagos was threatened by Vargus with the removal of the scientist's helmet, which would kill him. Due to the threat, Vylagos sent the rookies, along with Falco and Dom to rescue the legion. Upon arriving at the remote Outer Rim world that the legion was transported to, they met up with General Bandis. He told the squad to destroy a Confederacy listening post. Upon arriving at the listening post, the clones hijacked a modified hailfire droid that was not a droid, but a tank. Falco used the missiles to destroy the listening post, while Dom was tossing out pulse grenades at any group of droids he saw. When the squad returned, the legion was gathered within the one-kilometer radius to be transported back to Ando Prime.\n44 was created for the book, The Clone Wars: Decide Your Destiny: The Lost Legion, which had about 35 different endings. Several involved the death of the entire squad, one involved the squad being attacked and killed by the Talid native to Ando Prime. However, 44 was featured in all of the possible endings.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Excelsior_Company",
  "/wiki/Clone_trooper_commander",
  "/wiki/Vargus",
  "/wiki/18",
  "/wiki/23",
  "/wiki/35_(Ando_Prime)",
  "/wiki/36",
  "/wiki/57",
  "/wiki/Ando_Prime/Legends",
  "/wiki/313th_Legion",
  "/wiki/Jedi_General/Legends",
  "/wiki/Po_Bandis",
  "/wiki/Advanced_Recon_Force_trooper",
  "/wiki/Falco_(clone_trooper)",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/CC-2224/Legends",
  "/wiki/Skakoan/Legends",
  "/wiki/Vylagos",
  "/wiki/Dom",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Pulse_grenade",
  "/wiki/The_Clone_Wars:_Decide_Your_Destiny:_The_Lost_Legion",
  "/wiki/Talid/Legends"
 ]
}