{
 "name": "6/298",
 "display_name": "6/298",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Born",
     "values": [
      "32 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "6/298 was a clone trooper in the Grand Army of the Republic. 6/298 participated in the First Battle of Geonosis, and was one of the troopers who assisted in the rescue of Jedi Mace Windu's strike team from the Petranaki arena.\nBorn on the aquatic planet of Kamino as a clone of the Mandalorian bounty hunter Jango Fett, 6/298 was created to fight as a clone trooper for the Grand Army of the Republic.\nIn 22 BBY, following the capture of Senator Padmé Amidala, Jedi Knight Obi-Wan Kenobi, and Padawan Anakin Skywalker, a strike team of 212 Jedi were deployed to the rocky world of Geonosis to rescue the three captives, and investigate reports of a growing Separatist droid army on the planet. To aid in the Jedi's efforts, Grand Master Yoda deployed an army of 190,000 clone troopers to assist in destroying the Separatist threat.\nAs one of the many clone troopers sent to Geonosis, 6/298 was assigned to escort Master Yoda aboard a LAAT/i gunship. Upon breaking through the Geonosian blockade, 6/298's ship headed towards the Petranaki arena to rescue the Jedi strike team sent there. Once they had reached the arena, Yoda ordered the gunship to form a perimeter around the few remaining Jedi who had survived the battle. 6/298 exited the LAAT/i, and provided covering fire for fleeing Jedi. While covering the Jedi's escape, 6/298 managed to destroy a droideka before re-entering his gunship. After rescuing Jedi Masters Mace Windu, Kit Fisto, and Ki-Adi-Mundi, 6/298's gunship headed skyward to regroup with the rest of the Republic fleet invading the planet.\nFlying towards the current battle, 6/298's LAAT/i began taking heavy fire from CIS forces on the ground. 6/298's gunship changed its course and began heading towards a cluster of Hardcell-class interstellar transports. After taking out the Separatist transport vessels with the help of Kenobi's LAAT/i, 6/298 travelled aboard his gunship until it passed the Im'g'twe Hills. Witnessing one of the other gunships getting destroyed by Separatist fire, Mace Windu ordered the pilot to land in a nearby Republic assembly area. Once all three rescued Jedi had left the ship to go fight in the ongoing battle, 6/298's gunship took off once again and headed towards the forward command center, under Grand Master Yoda's orders. Having dropped off the General, 6/298 headed skyward one last time, and went to assist the rest of the clone army.\nBorn as a clone of the bounty hunter known as Jango Fett, 6/298 stood at a height of 1.83 meters. During the First Battle of Geonosis, 6/298 wore standard issue phase 1 clone trooper armor with no discernible markings. He also carried a DC-15A blaster rifle, which he used to destroy a W-series droideka.\n6/298 originally appeared in the 2002 film Star Wars: Episode II Attack of the Clones, where he appeared as an unidentified clone trooper. In July 2002, Wizards of the Coast released an expansion for their Star Wars Trading Card Game called Sith Rising. In the expansion, a card by the name of \"Clone Trooper 6/298\" was released, which gave the previously unidentified clone a number. Like all other clone troopers in Star Wars: Episode II Attack of the Clones, 6/298 is voiced by Temuera Morrison, and portrayed entirely through computer-generated imagery.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Geonosis_strike_team",
  "/wiki/Petranaki_arena",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Clone_trooper_pilot/Legends",
  "/wiki/Waterworld/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Droid_Army",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Geonosian/Legends",
  "/wiki/Petranaki/Legends",
  "/wiki/Droideka/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Hardcell-class_interstellar_transport/Legends",
  "/wiki/Im%27g%27twe_Hills/Legends",
  "/wiki/Forward_Command_Center",
  "/wiki/Jedi_General/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/Clone_trooper_armor/Legends",
  "/wiki/DC-15A_blaster_rifle/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/W-series_droideka/Legends",
  "/wiki/Lama_Su/Legends",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/July",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/Sith_Rising",
  "/wiki/Temuera_Morrison",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Inside_the_Worlds_of_Star_Wars:_Attack_of_the_Clones"
 ]
}