{
 "name": "91-6210",
 "display_name": "CT-65/91-6210",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "K Company",
      "K Company"
     ]
    }
   ]
  }
 ],
 "content": "CT-65/91-6210, also known as \"Deviss,\" was a clone trooper captain who led K Company, a unit within Clone Commander Bly's 327th Star Corps. In 22 BBY, Deviss served in the first battle of the Clone Wars on the Outer Rim planet Geonosis. During the battle, Deviss risked his life to protect two injured soldiers from Confederate spider droids and received a medal after being rescued from behind enemy lines by Republic troops. He went on to fight in the Battle of Altyr V, after which he was promoted to commander for his actions. He also participated in a battle on Cato Neimoidia. In 19 BBY, Deviss was dispatched to support Jedi General Nem Bees on Orto. During the ensuing battle on the planet, the commander received Order 66—which called for all clone troopers to execute their Jedi officers—and personally shot down Bees on the front lines.\nLike all clone troopers, CT-65/91-6210, nicknamed \"Deviss,\" was born on the planet Kamino as a clone of the Mandalorian bounty hunter Jango Fett. After flash training on Kamino, Deviss was given the rank of captain and became the leader of K Company, a unit within the Hawkbat Battalion of the 327th Star Corps. In 22 BBY, when the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems broke out on the Outer Rim planet Geonosis, Deviss served in the ensuing battle. During the fight, Deviss and Hawkbat Battalion were ordered to march directly into the withering fire of Separatist spider droids. The battalion was almost completely wiped out, and Deviss risked his life to stay behind in a shallow bomb crater, tending to two critically injured soldiers. He defended their position as spider droids passed overhead, and, after three hours, a rescue casevac team arrived. After his men were rescued, Deviss received a medal and a new mission.\nLater during the war, Deviss took part in the Battle of Altyr V, during which Deviss' Jedi General was killed by enemy fire, leaving Deviss to improvise a new plan of attack. Deviss rallied the remaining clone trooper companies before destroying a Separatist ion cannon emplacement, opening the battlefield to aerial bombardment and winning the battle for the Republic. For this act of bravery and initiative, Clone Commander CC-5052, nicknamed \"Bly,\" promoted Deviss to the rank of commander. His promotion allowed Deviss to wear the red ARC pauldron and a kama, as well as a special macrobinocular helmet attachment. In 19 BBY, Deviss served in the raid of the Separatist-controlled Colonies world Cato Neimoidia, which ended with a Republic victory.\nAs the war neared its end, Deviss was dispatched to the planet Orto to support Jedi Knight Nem Bees in the upcoming battle there. Bees managed to gain access to a HoloNet transceiver, with which he established contact with the Republic forces, and Deviss was ordered to arrive with his battalion of clone soldiers in-system at a designated time. Bees disabled the planet's shield generator just as the Republic strike force emerged from hyperspace. Deviss rendezvoused with Bees as the Republic forces landed, and together they began the task of removing the entrenched droid armies. After a week of fighting, Order 66—a command for all clone troopers to execute their Jedi officers—was issued. While Bees led an attack on the enemy lines, Deviss carried out the order, shooting and killing the Jedi Knight.\nDeviss survived many battles during the Clone Wars and was a capable leader. Even after his Jedi General was killed on Altyr V, he managed to rally his troops and win the battle for the Republic. The commander also showed his bravery when he defended wounded comrades on Geonosis by himself, receiving a medal for his actions. Deviss was loyal to Supreme Chancellor Palpatine and the Republic, as he gunned down his commanding Jedi General during Order 66. As a clone of Jango Fett, Deviss stood 1.83 meters tall.\nDeviss wore red-striped Phase II clone armor and, after his promotion, was allowed to use a kama, polarized macrobinoculars as a helmet attachment, and a red pauldron. His quick-release holster held two DC-17 hand blasters, and he also carried a DC-15A blaster rifle. Additionally, Deviss was equipped with a rope and a grappling hook.\nFor George Lucas' 2005 film, Star Wars: Episode III Revenge of the Sith, the digital model of Clone Commander Bly was originally slated to have red armor markings, but his design was changed to yellow to better match the Felucia environment in which he appears. The \"red Bly\" model was nonetheless featured, without name, in Star Wars: Revenge of the Sith: The Visual Dictionary and became the basis for a clone trooper action figure in Hasbro's Revenge of the Sith toy line despite never appearing in the film.\nThe article Guide to the Grand Army of the Republic, written by authors Karen Traviss and Ryan Kaufman for Star Wars Insider 84 in September 2005, first provided the \"red Bly\" character with a unique name and clone designation number—\"Deviss\" and CT-65/91-6210. Kaufman revealed through the Star Wars: Blogs feature that he named Deviss after Traviss herself. For the StarWars.com What's The Story? writing contest, Hyperspace member \"Lord Hydronium\" established Deviss' role in Order 66. The story was published in the Nem Bees StarWars.com Databank entry. Deviss also received a subsequent character entry in the 2008 The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Deviss",
  "/wiki/CT-65/91-6210",
  "/wiki/Clone_trooper_commander",
  "/wiki/Naboo_(people)/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Vedd_Deviss",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/K_Company",
  "/wiki/Clone_trooper_captain",
  "/wiki/Company/Legends",
  "/wiki/CC-5052/Legends",
  "/wiki/327th_Star_Corps/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/DSD1_dwarf_spider_droid/Legends",
  "/wiki/Medal/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Battle_of_Altyr_V",
  "/wiki/Commander/Legends",
  "/wiki/Battle_of_Cato_Neimoidia/Legends",
  "/wiki/Cato_Neimoidia/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Nem_Bees",
  "/wiki/Orto/Legends",
  "/wiki/Battle_of_Orto",
  "/wiki/Order_66/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Flash_training",
  "/wiki/Military_rank/Legends",
  "/wiki/Hawkbat_Battalion",
  "/wiki/Battalion/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Spider/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Unidentified_Jedi_General_(Altyr_V)",
  "/wiki/Trooper/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Color/Legends",
  "/wiki/Advanced_Recon_Force_trooper",
  "/wiki/Pauldron/Legends",
  "/wiki/Kama/Legends",
  "/wiki/Macrobinoculars/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Colonies/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Orto_system",
  "/wiki/Time/Legends",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Altyr_V",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Phase_II_clone_trooper_armor/Legends",
  "/wiki/Holster/Legends",
  "/wiki/DC-17_hand_blaster/Legends",
  "/wiki/DC-15A_blaster_rifle/Legends",
  "/wiki/Rope/Legends",
  "/wiki/Grappling_hook/Legends",
  "/wiki/George_Lucas",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Felucia/Legends",
  "/wiki/Star_Wars:_Revenge_of_the_Sith:_The_Visual_Dictionary",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_Revenge_of_the_Sith_(toy_line)",
  "/wiki/Guide_to_the_Grand_Army_of_the_Republic",
  "/wiki/Karen_Traviss",
  "/wiki/Ryan_Kaufman_(author)",
  "/wiki/Star_Wars_Insider_84",
  "/wiki/September",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/StarWars.com",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Kyle_Jewhurst",
  "/wiki/Databank_(original)",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Galaxy_at_War",
  "/wiki/Star_Wars:_The_Ultimate_Action_Figure_Collection",
  "/wiki/Star_Wars:_Saga_Legends",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Labyrinth_of_Evil",
  "/wiki/The_Clone_Wars_Campaign_Guide"
 ]
}