{
 "name": "926",
 "display_name": "926",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "Batch Eight",
      "Stormtrooper Corps",
      "Batch Eight",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "926 was a human male stormtrooper who served the First Order during its war with the Resistance. During his time aboard the Mega-class Star Dreadnought Supremacy, 926 encountered Finn—an ex-stormtrooper who once served with 926 in Batch Eight. Unaware of Finn's desertion from the military, the trooper assumed that his former comrade had become an officer due to the latter's disguise. Believing that a fellow member of Batch Eight had risen to the officers' ranks, 926 congratulated Finn on his promotion.\n926 was a stormtrooper who once served with FN-2187 in Batch Eight prior to the latter's defection from the First Order. During their time in induct camp, 926 gave FN-2187 a run for top spot in target practice. They would ultimately meet again during the war between the First Order and the Resistance, albeit under different circumstances. By then 926 was stationed aboard the Supremacy, a Mega-class Star Dreadnought which served as the flagship of Supreme Leader Snoke. It was on the Dreadnought where 926 encountered \"Finn,\" a Resistance operative whom he recognized as FN-2187. However, he was unaware of the former stormtrooper's defection from the military as well as his mission to infiltrate the Supremacy and disable its hyperspace tracker. He also mistook Finn's stolen uniform as a sign that his former comrade had been promoted to the officers' ranks.\nTrooper 926 was a human male. His skills as a marksman were comparable to FN-2187—another stormtrooper whose own skills were considered exceptional by his instructors. Upon encountering FN-2187, later known as Finn, once more after their time in induct camp, 926 remembered him as a fellow member of Batch Eight. Unlike their trainers, who thought that Finn had the potential of becoming an officer one day, 926 never took him for captain material. However, he was pleased to see that someone from Batch Eight had evidently risen in the First Order hierarchy.\nAlthough troopers were not permitted to converse with officers, 926 broke this rule to congratulate Finn and to express pride in Batch Eight. Before parting ways, he gave Finn a friendly swat on the posterior.\n926 first appeared in Jason Fry's Star Wars: The Last Jedi: Expanded Edition simultaneously with the Star Wars: The Last Jedi: A Junior Novel by Michael Kogge, both of which were novelizations for the sequel trilogy's 2017 film Star Wars: Episode VIII The Last Jedi. Tom Hardy portrayed 926 in the scene in which he encountered Finn on the Supremacy, although that scene was ultimately cut from The Last Jedi. The cut material is available in a deleted scene on the 2018 Blu-ray release of the film.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/First_Order",
  "/wiki/Batch_Eight",
  "/wiki/Stormtrooper_Corps_(First_Order)",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Resistance",
  "/wiki/Time",
  "/wiki/Mega-class_Star_Dreadnought",
  "/wiki/Supremacy",
  "/wiki/Finn",
  "/wiki/Treason",
  "/wiki/First_Order_military",
  "/wiki/Trooper",
  "/wiki/First_Order_officer",
  "/wiki/First_Order_military_uniforms",
  "/wiki/Officer",
  "/wiki/Military_rank",
  "/wiki/FN_Corps",
  "/wiki/Flagship",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Star_Dreadnought",
  "/wiki/Hyperspace_tracker",
  "/wiki/Standard_day",
  "/wiki/Captain",
  "/wiki/Jason_Fry",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Michael_Kogge",
  "/wiki/Sequel_trilogy",
  "/wiki/2017",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Tom_Hardy",
  "/wiki/2018",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/2016",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/The_Force_Awakens:_Finn%27s_Story",
  "/wiki/December_21",
  "/wiki/June_18",
  "/wiki/March_14",
  "/wiki/March_16",
  "/wiki/2020"
 ]
}