{
 "name": "99",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.68 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "99 was a malformed clone of the Mandalorian bounty hunter Jango Fett who served the cloning facilities and performed janitorial duties at Tipoca City on the planet Kamino during the Clone Wars. He died during the Battle of Kamino in 21 BBY.\n99 was deemed unfit for service in the Grand Army of the Republic because of his limited physical abilities and overly rapid aging and was assigned to perform janitorial duties in Kamino's cloning facilities, such as transporting blasters.\nHe befriended the members of Domino Squad—cadets Hevy, Droidbait, Cutup, Echo and Fives—during their final exam to become clone troopers. However, Domino Squad lacked proper teamwork, which caused it to fail the Citadel Challenge.\nThough Jedi Master Shaak Ti decided to give Domino Squad a second chance, 99 later caught Hevy attempting to go absent without leave in the middle of the night. 99 pleaded with Hevy, not to leave and taught him the importance of teamwork and brotherhood. Deciding to take 99's advice and name to heart, Hevy led his squad to finish its final exam. Later, Hevy decided to give his graduation medal to 99, with the promise that they would meet again. However, Hevy would later sacrifice himself to destroy Rishi Outpost and prevent an invasion of Kamino, which 99 would learn when Echo and Fives returned to Kamino.\nDuring an attack launched against Tipoca City by the Confederacy of Independent Systems, 99 assisted clone troopers Echo, Fives, and a group of cadets against the invading droid forces. After meeting with Captain Rex and Commander Cody, 99 assisted the captain and commander in defending the city. 99 was shot and killed by a battle droid while attempting to retrieve explosives for use in combating the droids. Once the Confederacy was pushed back, 99 was mourned by his brothers and commended as a true soldier.\n99 was a kind, gentle, compassionate, dedicated and loyal member of the maintenance division of the Grand Army of the Republic, but was often looked down upon because of his deformity—while 99 always respected his brothers. 99 was also a source of wisdom and was able to develop a deep friendship with Hevy and the other members of Domino Squad after talking him out of going AWOL.\nDespite his limitations—which included a walking disability—99 was proud of his basic soldier's heritage which his brothers were able to execute, and was determined to be useful in combat. When Kamino was invaded by the Confederacy of Independent Systems, 99 helped out as best he could by delivering needed weaponry to the clone troopers. He also wanted to prove himself as a soldier like his brothers, seen when he risked his life to try and retrieve more grenades but was shot and killed instead.\n99 was created for the third season of the television series Star Wars: The Clone Wars. He was first featured on an online assortment of trading cards on the website StarWars.com, and debuted in the episodes \"Clone Cadets\" and \"ARC Troopers\", both of which premiered on September 17, 2010. 99 was voiced by actor Dee Bradley Baker, who provides voicework for most of the series' clone characters.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Clone_99",
  "/wiki/99",
  "/wiki/Kamino/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/File:ThisIsWhatIWasBredFor-ARCT.ogg",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Janitor/Legends",
  "/wiki/Tipoca_City/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Battle_of_Kamino/Legends",
  "/wiki/File:ComeCleanUp-CC.ogg",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Domino_Squad/Legends",
  "/wiki/Clone_cadet/Legends",
  "/wiki/CT-782/Legends",
  "/wiki/CT-00-2010/Legends",
  "/wiki/CT-4040/Legends",
  "/wiki/CT-21-0408",
  "/wiki/CT-5555/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Citadel_Challenge/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/CT-7567/Legends",
  "/wiki/CC-2224/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/Clone_trooper_commander",
  "/wiki/City/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/File:OneOfUs-ARCT.ogg",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/StarWars.com",
  "/wiki/Clone_Cadets",
  "/wiki/ARC_Troopers",
  "/wiki/September_17",
  "/wiki/2010",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Category:Audio_files_of_99",
  "/wiki/Category:Images_of_99",
  "/wiki/The_Clone_Wars:_Defenders_of_the_Republic",
  "/wiki/Cartoon_Network",
  "/wiki/Star_Wars_Insider",
  "/wiki/50_Great_Reasons_to_Rewatch_Star_Wars:_The_Clone_Wars_Season_Three",
  "/wiki/Star_Wars_Insider_125",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.20",
  "/wiki/Star_Wars:_The_Clone_Wars_Magazine_5",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.45",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_62"
 ]
}