{
 "name": "A%27kazz",
 "display_name": "A'kazz",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Schenor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  }
 ],
 "content": "A'kazz was a male member of the Schenor species. He was the sole survivor of an Imperial-backed mercenary attack on a Schenor research station. A'kazz was returned to the Schenor homeworld of Rhamsis Callo by Alliance operatives at the urging of Commander Luke Skywalker.\nA'kazz was a young male Schenor living with his parents and several dozen colonists aboard a research station. Sometime during the Galactic Civil War, the station was attacked by a group of mercenaries in the employ of the Galactic Empire. The station sent out a distress call, and Alliance High Command authorized a mission to investigate. As they arrived, they found the mercenaries in combat with the Schenor, and joined the fight until an Imperial gunboat pinned down the Alliance operatives and evacuated the mercenaries. When the Alliance force investigated the scene, they found near total destruction and single survivor; A'kazz. Rendered mute by witnessing the death of his parents and everyone else, the Alliance operatives took him to an Alliance base when he was questioned by Commander Luke Skywalker in a private session. After the meeting, Skywalker believed that if A'kazz returned to the Schenor homeworld of Rhamsis Callo, then his testimony to his nest-guild could encourage the Schenor to abandon their neutrality in the Galactic Civil War and side with the Alliance. The operatives who had rescued A'kazz were directed to take him to Rhamsis Callo.\nLanding at Chafflock on Rhamsis Callo, the operatives took A'Kazz to his nest-guildmaster, B'karitz, by reaction car, encountering several Imperial attempts at stopping them along the way, including vehicle chases and ambushes at their overnight lodgings. At first, B'karitz believed that the Alliance team were hostile, and were ransoming A'kazz to them. Once convinced of their good intentions, he interrogated A'kazz via a telepathic trance and learned the truth of the Imperials' involvement in the attack on the research station. With A'kazz's testimony, B'kartiz took his nest-warriors to an under-construction base that was being built under the aegis of a treaty signed by the Empire and the Schenor government. As an influential noble from a powerful province, B'kartiz declared the treaty null and void and ordered the Empire off Rhamsis Callo.\nA'kazz was a juvenile member of the Schenor species who was shocked into muteness by witnessing the murder of the entire Schenor colony at the research station he lived at, including his parents. He formed an attachment with one of the Alliance operatives who rescued him, who happened to be the most cynical and hard-hearted of the team. He would stare at the operative with his big yellow eyes.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Schenor",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Species/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Massacre_at_the_Schenor_research_station",
  "/wiki/Schenor_research_station",
  "/wiki/Homeworld/Legends",
  "/wiki/Rhamsis_Callo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Operative",
  "/wiki/Commander/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Colonist/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Distress_signal/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Lightfight",
  "/wiki/Gunboat/Legends",
  "/wiki/Nest-guild",
  "/wiki/Chafflock",
  "/wiki/Nest-guildmaster",
  "/wiki/B%27karitz",
  "/wiki/Reaction_car",
  "/wiki/Telepathy/Legends",
  "/wiki/Nest-warrior",
  "/wiki/Unidentified_Imperial_base_(Rhamsis_Callo)",
  "/wiki/Schenor/Imperial_treaty",
  "/wiki/West_End_Games",
  "/wiki/The_Silent_Witness",
  "/wiki/Star_Wars:_The_Roleplaying_Game_(first_edition)"
 ]
}