{
 "name": "A._Rahring",
 "display_name": "A. Rahring",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dorin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Doctor A. Rahring was a Kel Dor xenobiologist living in the last decades of the Galactic Republic.\nRahring led a research team to Dorumaa, the only moon of Almas and, a long time previously, a planet itself. The team was trying to study the Dorumaan leviathan, a strange, almost extinct, oceanic mammal. In previous years, two young leviathans had been born, but their mother had disappeared strangely. Some believed that the youngsters were the last leviathans, but others thought the mother was frozen or hibernating somewhere under the surface of Dorumaa.\nHe discovered that the leviathan was similar to the Mon Calamari Star Cruiser, which made some believe that the leviathans had been imported to Dac long ago, and then became extinct there. Later, Rahring hosted the documentary A Galaxy Befuddled, showing the strange life of the leviathan.\nSoon after that, one of the young leviathans disappeared. It was suspected that it had been kidnapped by smuggler Rufus Trammel, who likely tried to sell it to one of Rahring's fans.\nRahring's portrait, as shown in Wizards' webpage, had been previously used in Star Wars Roleplaying Game: Revised Core Rulebook to depict a generic Jedi investigator, in the prestige class description.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dorin/Legends",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Xenobiologist/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dorumaa",
  "/wiki/Moon/Legends",
  "/wiki/Almas",
  "/wiki/Planet/Legends",
  "/wiki/Dorumaan_leviathan",
  "/wiki/Mon_Calamari_Star_Cruiser",
  "/wiki/Dac",
  "/wiki/A_Galaxy_Befuddled",
  "/wiki/Smuggler/Legends",
  "/wiki/Rufus_Trammel",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Jedi_investigator/Legends",
  "/wiki/Dorumaa%27s_Children",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Wizards.com",
  "/wiki/Rebirth_(article)"
 ]
}