{
 "name": "Aach Een",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Iridonia; raised on Raxus Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dusty yellow"
     ]
    }
   ]
  }
 ],
 "content": "Aach Een was a male Zabrak treasure hunter who was friends with Oolak Goyl.\nAach was born on Iridonia, the homeworld of his species, though he and his parents shortly moved to Raxus Prime on a reclamation problem, and Aach spent much of his childhood sifting through debris, utterly fascinated by the variety of technology from other cultures.\nAach realized that he had reached the limit of information he could obtain via garbage. He joined a local police force where he learned how to survive and underwent basic weapons training. Aach learned to understand foreign cultures perfectly, and could integrate himself like a native without ever arousing suspicion.\nAfter traveling the galaxy, Aach applied to several esteemed universities for a job as a historian, though he was rejected over a lack of formal training. Annoyed, he took up a career of collecting historical artifacts by any means necessary, which included grave robbing and stealing from museums.\nSometime along this line of crime Aach met up with Oolak Goyl, who funded all of Aach's excursions for an occasional artifact or piece of information. Aach also managed to obtain a Firespray-31 starship Unearthed, which he used for his explorations.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Iridonia/Legends",
  "/wiki/Raxus_Prime/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Oolak_Goyl",
  "/wiki/Homeworld/Legends",
  "/wiki/Species/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Firespray-31-class_patrol_and_attack_craft/Legends",
  "/wiki/Unearthed",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Aach_Een",
  "/wiki/Ultimate_Adversaries"
 ]
}