{
 "name": "Aaida",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Aaida was a Human female who lived on Telos IV during the Jedi Civil War. A survivor of the Sith bombardment of the world in 3958 BBY, she was separated from her husband, Lootra, during evacuation. Seven years later, Aaida was present on Nar Shaddaa, where the Jedi Exile Meetra Surik reunited her with Lootra.\nAaida lived with her husband Lootra on the Outer Rim planet of Telos IV during the early stages of the Jedi Civil War, a conflict between the Galactic Republic and Darth Revan's Sith Empire.\nIn 3958 BBY, Republic Navy Rear Admiral Saul Karath defected to the Sith. Soon after, he led a fleet against Telos IV and called for the planet's surrender. When the inhabitants refused, Darth Malak ordered an orbital bombardment of the planet. Aaida and Lootra survived the assault, but the two were separated during evacuation. Aaida made it onto a civilian ship and escaped, while her husband boarded another. The Sith did not destroy the ship, and Aaida belied that it was because they wanted living witnesses to the attack. The ship, loaded with refugees, jumped from system to system, just ahead of the Sith's warships.\nOn the run for years, Aaida began to think she would never see her husband again. Seven years later, in 3951 BBY during the First Jedi Purge, Aaida found herself living in the Refugee Sector on Nal Hutta's ecumenopolis moon, Nar Shaddaa.\nDuring this time, Lootra had been moving from planet to planet in search of her. Coincidentally, he arrived on Nar Shaddaa during Aaida's time there. The Jedi Exile Meetra Surik, who was on Nar Shaddaa in search of Jedi Master Zez-Kai Ell, approached him. Lootra asked Surik to help find his wife, and she agreed. Surik was able to locate Aaida within the Refugee Sector and tell her of her husband, but Aaida was unable to leave due to the Exchange guards blocking the exit. The Exile was able to deal with the guards, and Aaida left the Refugee Sector to be reunited with her husband. Surik later approached the couple, who thanked her profusely and gave her a reward.\nAaida appeared as a non-player character in the 2004 video game Star Wars: Knights of the Old Republic II: The Sith Lords, developed by Obsidian Entertainment. Talking to Lootra begins the quest \"Intergalactic Reunification,\" which is completed by talking to Lootra after the two have reunited. After beginning the quest, Aaida gains new dialogue which allows you to progress. The quest is not absolutely necessary to progress the plot, but increases the Exchange's notice of the Exile, which must be increased to progress. The Complete Star Wars Encyclopedia states that Surik reunited the couple, an ending which gives the player light side points.\nAaida's entries in both The Complete Star Wars Encyclopedia and the now defunct Databank on StarWars.com state that she was kidnapped by the exchange to force Lootra to join them; a description of events contradicted by the game itself.\nPlayers can avoid the \"Intergalactic Reunification\" quest altogether, and instead use other quests to increase the Exchange's notice of the Exile.\nThe player can convince Lootra to give up his search and join the Exchange, which increases influence with Kreia and prompts dialogue if she is in your party. Alternatively, the player can decide to kill Lootra, which grants dark side points.\nOnce the quest has been initiated, the player can decide to lie to Aaida and tell her that the guards have been taken care of when they have not. This prompts Aaida to attempt to escape the Refugee Sector, dying in the process and giving the player dark side points.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Telos_IV",
  "/wiki/Jedi_Civil_War",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Planet/Legends",
  "/wiki/3958_BBY",
  "/wiki/Marriage/Legends",
  "/wiki/Lootra",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Rear_Admiral/Legends",
  "/wiki/Saul_Karath",
  "/wiki/Sith/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Starship/Legends",
  "/wiki/3951_BBY",
  "/wiki/First_Jedi_Purge",
  "/wiki/Refugee_Sector",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Ecumenopolis/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Time/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Zez-Kai_Ell",
  "/wiki/Exchange",
  "/wiki/2004",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Obsidian_Entertainment",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/Kreia",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Bombing_of_Telos_IV",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/The_Essential_Atlas",
  "/wiki/3956_BBY"
 ]
}