{
 "name": "Aarno Dering",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "27 BBY",
      "Euceron"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Aarno Dering was a tall humanoid male who served as a sports \"timing\" official for the swoop obstacle race during the Galactic Games on Euceron during the Separatist Crisis. The information dealer Fligh gave Dering the false alias \"Quentor,\" in order to protect him.\nDuring the Galactic Games of 26 BBY, Dering altered the swoop obstacle race time logs so it would appear that Alderaan had won. However, a fast-moving airspeeder piloted by former local athlete and Games Council member Maxo Vista killed Dering moments before Anakin Skywalker and Obi-Wan Kenobi could interrogate him.\nAs Skywalker, his face gone pale, paused in a moment of solemnity over Dering's body , Kenobi was grateful to see his Padawan so affected, still, by death. For there had been a time when he had wondered if Anakin failed to connect, a time when he had witnessed a curious blankness on the boy's face after he had killed in battle . He was glad, now, and reassured, after having watched Anakin since that time, to see his Padawan feel via the Living Force that connection, the enormity of a life lost. And he hoped that Anakin would never lose that particular vulerability.\nThe Jedi discovered postmortem that Dering had in his possession a false text doc ID and secret alias—Ak Duranc . Investigating the corrupt timing judge's room  at the official Games quarters, Kenobi and Skywalker discovered on Dering's dropped datapad that he had information on the \"fixing\" of the illegal Podrace at the Great Dordon Caves also, suggesting that all the rigging during the Games came from the same source.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/27_BBY/Legends",
  "/wiki/Euceron",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Games/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Fligh",
  "/wiki/Quentor",
  "/wiki/26_BBY/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Games_Council",
  "/wiki/Maxo_Vista",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Krayn",
  "/wiki/Living_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Great_Dordon_Caves",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Aarno_Dering",
  "/wiki/Jedi_Quest:_The_Dangerous_Games",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jedi_Quest:_Path_to_Truth"
 ]
}