{
 "name": "Aayla Secura",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Felucia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "55 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi assault team",
      "Jedi assault team",
      "Galactic Republic",
      "Aayla Secura's unit",
      "327th Star Corps",
      "Aayla Secura's unit",
      "327th Star Corps"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Quinlan Vos"
     ]
    }
   ]
  }
 ],
 "content": "Aayla Secura , a Force-sensitive Rutian Twi'lek female, was a Jedi Master who served as a Jedi General of the Grand Army of the Republic during the Clone Wars. Prior to the Clone Wars, Secura learned the ways of the Force as the Padawan of Jedi Master Quinlan Vos. With the outbreak of civil war between the Galactic Republic and the Confederacy of Independent Systems, Secura and her fellow Jedi supported the Republic by becoming officers in its newly-formed military. As a general, she commanded the clone troopers of the 327th Star Corps, with Commander CC-5052 \"Bly\" serving at Secura's side.\nThroughout the conflict, Secura fought alongside her soldiers in multiple battles across the galaxy, from Geonosis to Quell, Coruscant, and Felucia. As the war drew to an end, the clones were instructed by Supreme Chancellor Sheev Palpatine to execute Order 66, resulting in a sudden purge of the Jedi Order at the hands of their own troopers. As a result, Secura was among the first casualties of the purge, having been shot in the back repeatedly by Bly and several other clone troopers.\nThe demise of Secura and many other Jedi was sensed through the Force by Grand Master Yoda, who survived the purge and ultimately escaped into exile, while the Galactic Empire rose to power in place of the Republic. Secura's death was also witnessed in a Force vision by Depa Billaba and her apprentice, Caleb Dume, on Kaller. Decades after her death, Secura's voice joined those of her fellow fallen Jedi offering inspiration to Rey in her climactic battle against Darth Sidious on Exegol.\nAayla Secura was born on the planet Ryloth during the Republic Era. Secura came from the disreputable side of her homeworld, until she was rescued by Jedi Knight Quinlan Vos who brought the Force-sensitive youngling to the Jedi Temple on Coruscant. Vos personally saw to Secura's training in the Jedi Order, taking her as his Padawan. Secura was close with her mentor during their time together; under Vos' guidance, she ascended to the rank of Jedi Knight.\nSecura was on Coruscant during the last days of the Separatist Crisis. Jedi Knight Obi-Wan Kenobi walked past her as he made his way to a class of Jedi younglings, intending to confer with their instructor, Grand Master Yoda about his investigation into the plot to assassinate Senator Padmé Amidala. Following Kenobi's discovery of the Separatist Droid Army on Geonosis, Jedi Master Mace Windu assembled a strike team of all available Jedi, including Secura. The Jedi infiltrated the Petranaki Arena during the attempted execution of Kenobi as well as his apprentice, Anakin Skywalker, and Senator Amidala.\nIgniting her blue-bladed lightsaber, Secura and her fellow Jedi fought against waves of battle droids in the Geonosian arena. Though the Jedi succeeded in destroying many droids, with Secura dispatching a B2-series super battle droid, the Jedi were overwhelmed while trying to defend the sheer number of droids and blaster fire. Secura and her comrades were herded into the center of the arena where they formed a defensive circle. Count Dooku, a former Jedi who assumed command of the Confederacy of Independent Systems, signaled his forces to kill the remaining Jedi. However, with the arrival of Yoda and the newly-formed Grand Army of the Republic, Secura and her allies managed to escape aboard several Low Altitude Assault Transports before their execution could be carried out.\nThe First Battle of Geonosis commenced with the armies of the Confederacy and the Galactic Republic pitted against each other on the field of Geonosis. Given charge of her own unit, Secura fought on the front lines along with Windu, Ki-Adi-Mundi, Kit Fisto, and others and led clone troopers in a direct assault that ultimately forced the Confederacy military into full retreat. While the efforts of Secura, her fellow Jedi, and the clones secured the first victory for the Republic, Yoda sensed the rise of the dark side of the Force, noting that the Clone Wars had begun. Due to Secura's efforts during Geonosis, Secura was given her own clone corps, the 327th Star Corps, as well as her own fleet group. Secura was assigned Clone Commander CC-5052, known as \"Bly,\" as her second in command.\nDuring the Clone Wars, after Quinlan Vos discovered intelligence about a new Separatist droid, Aayla Secura, Clone Commander CC-5052 \"Bly,\" and the 327th Star Corps were sent to the muddy planet of Escander, where the Separatists had a base. After arriving, the droids attacked them resulting in Bly being wounded, because of his injuries another clone trooper took command of the unit. Secura ordered the clone to stay put, and she went alone to the Separatist base. After a long radio silence, the clone contacted her, but accidentally caused the droids to detect her. The clone, having ignored the command, went into the base looking to help Secura. During the search he found evidence Secura's capture in a research lab. Eventually the clone discovered Secura being interrogated by Asajj Ventress, who revealed that they leaked the intelligence to lure and capture Jedi. At the end, the clone distracted Ventress by activating the remaining droids and freed Secura. The two escaped the base safely.\nAt some point during the Clone Wars, Secura and her fleet came under attack at Quell. Damaged in the battle, her flagship, the Liberty, began falling through the atmosphere. The situation was made worse when rocket droids started boarding her ship. She and Bly managed to fight them off until Anakin Skywalker, his apprentice Ahsoka Tano, and Captain Rex arrived to rescue her and Bly. Secura and the others then fought their way to Skywalker's frigate. However, en route, Secura and the others were pushed out of the way of an explosion by Skywalker, who tried to hold it back with the Force. However, it was too strong for him and he was flung against the bulkhead and badly injured. Secura then helped Tano get Skywalker aboard the frigate. As they tried to dock with the Resolute, the hyperdrive was activated when the ship was struck by laser fire and Secura ordered Admiral Yularen to detach. She then ordered Tano to assist Bly in flying the frigate before it could collide with one of the stars. Secura then ordered the power to be turned off, despite the risk to Skywalker's life. However, during the chaos, she was pushed away from the switch but was able to use the Force to turn the power back on. The ship then crashed on the planet Maridun.\nAfter the crash, Secura then decided to find help and ordered Tano to accompany her, Bly, Cameron, Lucky, and Flash to do so. En route, Secura began sensing Tano's doubt and confusion. Worried about her master, she started questioning the Jedi philosophy concerning attachments. Secura assured her that it was nothing to be ashamed of as she went through the same thing with her own master, but in time she learnt to let go. Secura and her group then came under attack by Mastiff phalones that killed three of her troopers. She, Ahsoka and Bly then found a village of Lurmen. There, Secura asked the village elder Tee Watt Kaa for aid but he refused to help them. However, upon hearing of their friends' plight, he allowed his son to go with Ahsoka and Bly to treat them as long as Secura stayed at the village. Secura and Tee Watt Kaa began discussing the Jedi's involvement in the war and how she believed it was their intention not to spark conflict but to restore peace to the galaxy.\nSecura, Skywalker, Tano, Rex and Bly were then forced to leave the village when Separatist General Lok Durd arrived and searched the village for contraband. Secura destroyed a scout droid and found Durd's base. There she witnessed Durd's secret weapon, the Defoliator tank, and rescued Bly from its effects. Despite Tee Watt Kaa's wishes, Secura and Skywalker decide to steal Durd's shuttle and stop him from using it on the Lurmen village. Secura and Tano snuck into the base, destroyed the droids and took the shield generators. Secura and the others made their way back to the village and set up a barrier and shield around its periphery, despite Tee Watt Kaa's objections. She and the others fought against Durd's Squad until Skywalker disabled Durd and his weapon. With the Lurmen finally deciding to defend their village, they along with the remainder of the republic forces were able to destroy the rest of the Separatist droid army. Secura then took Durd and the Defoiliator's gunner into custody aboard their shuttle just as the Republic fleet arrived.\nSecura was in the Jedi Temple's communications center when Cad Bane infiltrated the Temple to steal a Holocron. Secura then aided Yoda in distracting the Zillo Beast while Skywalker worked on a plan to save himself, the Chancellor, Senator Amidala, C-3PO, and R2-D2. After realizing that their efforts weren't amounting to much, Yoda and Secura leapt off the beast and joined the others as it was assailed with gas bombs, holding the cloud back with the Force to protect themselves.\nSecura and her astromech droid QT-KT were sent on a mission to the Secret Research Facility on an unmapped moon in order to locate a \"big secret.\" But Secura was stopped by the assassin Asajj Ventress who engaged with Secura in a lightsaber duel.\nBetween 20 BBY and 19 BBY, Secura returned to Quell with the 327th and led them into a fight on the planet's surface. Secura's astromech droid was chosen to join D-Squad for a special mission. She dropped off QT for the mission briefing.\nSecura attended the funeral service for the victims of the Jedi Temple's hangar bombing.\nSecura later went with Masters Windu, Kenobi, Tiplee, and Commander Wolffe to investigate the recent battle on Ord Mantell. She and Master Windu then assisted Masters Kenobi and Tiplee in fighting Maul and Count Dooku. After Tiplee was killed, Secura then left Maul's ship with prisoners.\nBy the end of the Clone Wars, Secura had achieved the rank of Jedi Master.\nDuring the final days of the war, Secura was sent to the exotic Outer Rim planet of Felucia, along with Clone Commander Bly, where she and her troops fought against the Separatist forces stationed there. During her time posted there, Secura attended a meeting via hologram along with Windu, Yoda, Skywalker and Mundi, where they learned of Master Kenobi's engagement with General Grievous on Utapau and discussed the Supreme Chancellor's abuse of emergency powers, with Mundi advocating removing him from office if he did not yield his powers upon the destruction of Grievous, with Secura remaining silent. The meeting was then joined by Ahsoka Tano, who had left the Order after being wrongfully accused of the Temple hangar bombing and who reported on the successful capture of Maul on Mandalore. Secura acknowledged Tano with a quick glance but again remained silent during the meeting before signing off to resume her campaign on Felucia.\nAs she and her troops prepared to engage Separatist spider tanks, Supreme Chancellor Sheev Palpatine issued Order 66, calling for the extermination of all Jedi throughout the galaxy. Bly, having received the orders, ordered his fellow clones to open fire on the Twi'lek Jedi. Secura, who was distracted at the time by a bird suddenly taking flight, was unable to even draw her lightsaber before being shot twice in the back by the same clones she had trusted and even risked her life for. As she crumpled beneath a large fungal tree, the clones continued to hammer her body with blaster fire, killing her.\nYoda felt the death of Secura and many other fellow Jedi while on Kashyyyk, which allowed him to defend himself and escape. Master Depa Billaba, who was meditating at the time, witnessed Secura as one of those killed in her Force vision which she shared with her Padawan Caleb Dume on Kaller. She sacrificed herself soon after so Dume could survive.\nIn 35 ABY, during the Battle of Exegol, Secura's voice was heard by Rey among the voices of many Jedi of the past who aided her with killing Darth Sidious. She advised Rey to let the Force guide her.\nAn athletic and agile Rutian Twi'lek female, Aayla Secura had blue skin, hazel eyes, and stood at 1.7 meters . Intelligent and occasionally mischievous, Secura was also compassionate and sympathetic with Tano about her bond with her master. She compared it to her own bond with her own master, Quinlan Vos, who she saw as a father figure. However, knowing she had to let go of him for the greater good, Secura told Tano that she would have to let go of Skywalker for the same reason. In addition, Secura prioritized the safety of the majority over the few, warning Tano to not jeopardize a thousand lives in order to save one individual.\nLike any Jedi, Secura grieved over her homeworld, Ryloth, when it fell under Separatist occupation. However, she was raised at the Jedi Temple on Coruscant from a young age, and as such, lacked a deep connection to her home planet. As a member of the Jedi Order, Secura felt duty-bound to serve not just Ryloth but all worlds within the Galactic Republic.\nHailed as one of the Jedi Order's most skilled fighters during her time, Secura possessed skills in martial arts and was a capable lightsaber duelist who was a master of Form IV but also practiced Form V. Her style of fighting included combining her exceptional athletic skills and lightsaber skills to outwit her opponents. Secura was also known to use the nexu-stance evasive roll.\nShe wielded a blue-bladed lightsaber during her time as a Jedi Knight and later Jedi Master.\nAayla Secura was portrayed by Lucasfilm Ltd. employee Amy Allen in the 2002 film Star Wars: Episode II Attack of the Clones and the 2005 film Star Wars: Episode III Revenge of the Sith. She was voiced by Jennifer Hale in Star Wars: The Clone Wars TV series with a French-type accent in order to resemble a post-World War II veteran's speeches, as per the request of Dave Filoni. Another source states that, according to Dave Filoni, George Lucas specifically requested Secura to have a French-inspired accent.Hale reprised the role for a vocal cameo in Star Wars: Episode IX The Rise of Skywalker as one of many voices that give Rey encouragement.\nUnlike many Jedi Knights from the prequel trilogy, Secura wasn't originally created for the films. She was created by artist Jan Duursema and writer John Ostrander for the Star Wars Legends comic book series Star Wars: Republic.\nIn early concept art for the character by artist Dermot Power, she was a fish-like creature rather than a Twi'lek, but the\nconcept later evolved into the character of Kit Fisto. After seeing a piece of comic book cover art of the final character, George Lucas decided to place her in Attack of the Clones.\nSecura's cone-shaped hearing organs were made from foam rubber so that they would be malleable in a way similar to earlobes.\nWhile Aayla Secura made non-speaking appearances in the films, the illustrated screenplay of Revenge of the Sith shows that Secura was meant to have at least two lines of dialogue during the Order 66 sequence, where she assured her troops of the stability of the area before asking Commander Bly if he thought there were hostiles nearby, only to be shot at by Bly and his troops moments after.\nOn May 4, 2015, a costume of Aayla Secura was added to The Sims 4 for playable Sims to wear in-game. The costume is purely cosmetic and offers no gameplay changes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Aayla_Secura",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Jedi:_Aayla_Secura",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Choose_Your_Destiny:_A_Clone_Trooper_Mission",
  "/wiki/Tales_of_Villainy:_Give_%26_Take",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_3",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_21",
  "/wiki/Star_Wars_Lightsabers:_A_Guide_to_Weapons_of_the_Force",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Eta-2_Actis_Expansion_Pack",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Ryloth",
  "/wiki/19_BBY",
  "/wiki/Felucia",
  "/wiki/Twi%27lek",
  "/wiki/Rutian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_assault_team",
  "/wiki/Galactic_Republic",
  "/wiki/Aayla_Secura%27s_unit",
  "/wiki/327th_Star_Corps",
  "/wiki/Quinlan_Vos",
  "/wiki/File:ItTakesCourage_DoP.ogg",
  "/wiki/File:AaylaSecuraJediCrash.ogg",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Master",
  "/wiki/Jedi_General",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Cloning",
  "/wiki/The_Force",
  "/wiki/Padawan",
  "/wiki/Jedi",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Officer",
  "/wiki/Republic_Military",
  "/wiki/General",
  "/wiki/Clone_trooper",
  "/wiki/Clone_Commander",
  "/wiki/CC-5052",
  "/wiki/Soldier",
  "/wiki/The_galaxy",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Battle_of_Quell",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Battle_of_Felucia_(Outer_Rim_Sieges)",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Order_66",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Trooper",
  "/wiki/Death",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Exile_(punishment)",
  "/wiki/Galactic_Empire",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Force_vision",
  "/wiki/Depa_Billaba",
  "/wiki/Kanan_Jarrus",
  "/wiki/Kaller",
  "/wiki/Rey_Skywalker",
  "/wiki/Exegol",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Republic_Era",
  "/wiki/Homeworld",
  "/wiki/Jedi_Knight",
  "/wiki/Youngling",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Jedi_training",
  "/wiki/Time",
  "/wiki/File:AaylaSecura-TSWB.png",
  "/wiki/Standard_day",
  "/wiki/Separatist_Crisis",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Initiate",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Geonosis",
  "/wiki/Mace_Windu",
  "/wiki/Petranaki_Arena",
  "/wiki/Anakin_Skywalker",
  "/wiki/Aayla_Secura%27s_lightsaber",
  "/wiki/Battle_droid",
  "/wiki/Geonosian",
  "/wiki/Droid",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Blaster",
  "/wiki/Count_of_Serenno",
  "/wiki/Dooku",
  "/wiki/Low_Altitude_Assault_Transport",
  "/wiki/Army",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Kit_Fisto",
  "/wiki/Confederacy_military",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Aayla_Secura%27s_task_force",
  "/wiki/Asajj_Ventress",
  "/wiki/File:Aayla_Secura_SWZ_Jake_Murray.png",
  "/wiki/Liberty_(Venator-class)",
  "/wiki/B2-RP_super_battle_droid",
  "/wiki/Ahsoka_Tano",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Resolute",
  "/wiki/Admiral",
  "/wiki/Wullf_Yularen",
  "/wiki/Telekinesis",
  "/wiki/Maridun",
  "/wiki/File:Epguide014.png",
  "/wiki/Cameron",
  "/wiki/Lucky",
  "/wiki/Flash",
  "/wiki/Mastiff_phalone",
  "/wiki/Lurmen_village",
  "/wiki/Lurmen",
  "/wiki/Tee_Watt_Kaa",
  "/wiki/File:Jedi_and_clones.png",
  "/wiki/Lok_Durd",
  "/wiki/Viper_recon_droid",
  "/wiki/Defoliator",
  "/wiki/Defoliator_Deployment_Tank",
  "/wiki/File:SecuraYodaZilloBeast.png",
  "/wiki/Raid_on_the_Jedi_Temple",
  "/wiki/Zillo_Beast",
  "/wiki/Astromech_droid",
  "/wiki/QT-KT",
  "/wiki/Mission_to_the_Secret_Research_Facility",
  "/wiki/Secret_Research_Facility",
  "/wiki/Unidentified_unmapped_moon",
  "/wiki/Project_Stardust",
  "/wiki/Assassin",
  "/wiki/Lightsaber_combat",
  "/wiki/20_BBY",
  "/wiki/D-Squad",
  "/wiki/Funeral_of_the_Jedi_Temple_bombing_victims",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/File:SecuraMandalorianHelmet-SoD3.jpg",
  "/wiki/Tiplee",
  "/wiki/Commander",
  "/wiki/Wolffe",
  "/wiki/Battle_of_Ord_Mantell",
  "/wiki/Ord_Mantell",
  "/wiki/Assault_on_Vizsla_Keep_09",
  "/wiki/Maul",
  "/wiki/Count",
  "/wiki/File:Execute_Order_66.ogg",
  "/wiki/File:AaylaSecuraEta2-SWZ.png",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Battle_of_Utapau",
  "/wiki/Grievous",
  "/wiki/Utapau",
  "/wiki/Emergency_Powers_Act",
  "/wiki/Siege_of_Mandalore",
  "/wiki/Mandalore",
  "/wiki/File:BlyShootsAayla.png",
  "/wiki/Bird",
  "/wiki/Tree",
  "/wiki/Kashyyyk",
  "/wiki/Meditation",
  "/wiki/35_ABY",
  "/wiki/Battle_of_Exegol",
  "/wiki/File:Aayla_Secura-WotG.jpg",
  "/wiki/Eye",
  "/wiki/Foot",
  "/wiki/Martial_arts",
  "/wiki/Form_IV",
  "/wiki/Form_V",
  "/wiki/File:SWPicsMissFisto.jpg",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Amy_Allen",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/2005",
  "/wiki/Jennifer_Hale",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Dave_Filoni",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Prequel_trilogy",
  "/wiki/Jan_Duursema",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Republic",
  "/wiki/Dermot_Power",
  "/wiki/Fish",
  "/wiki/Star_Wars_Episode_III_Revenge_of_the_Sith:_Illustrated_Screenplay",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Jedi_Crash",
  "/wiki/Defenders_of_Peace",
  "/wiki/Holocron_Heist",
  "/wiki/The_Zillo_Beast_Strikes_Back",
  "/wiki/R2_Come_Home",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_Adventures_(2020)_12",
  "/wiki/Secret_Weapons",
  "/wiki/A_Sunny_Day_in_the_Void",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/Voices",
  "/wiki/Destiny_(episode)",
  "/wiki/Shattered",
  "/wiki/Kanan_2",
  "/wiki/Star_Wars_Rebels_(webcomic)",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Star_Wars_(2020)_5",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Aayla_Secura",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Hera:_A_New_Breed_of_Hero",
  "/wiki/Star_Wars_Insider_151",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_6",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_15",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Star_Wars_Helmet_Collection_48",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Way_of_the_Force",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Star_Wars_Helmet_Collection_68",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_31",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/LAAT/i_Gunship_Expansion_Pack",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Bust_Collection_1",
  "/wiki/Star_Wars:_The_Clone_Wars:_The_Final_Countdown",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Inside_Intel:_Quinlan_Vos",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Water_War",
  "/wiki/Armor",
  "/wiki/Standard_year",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Force_Awakens:_Head-to-Head",
  "/wiki/Star_Wars_(1998)_19",
  "/wiki/August_19",
  "/wiki/2013",
  "/wiki/File:JanDuursema-AaylaSecura-August-19-2013.png",
  "/wiki/May_4",
  "/wiki/2015",
  "/wiki/August_28",
  "/wiki/2020"
 ]
}