{
 "name": "Aban",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Aban was a male Human military officer in the Imperial Starfleet who served as captain and commanding officer of the Star Destroyer Bellicose during Grand Admiral Thrawn's campaign against the New Republic.\nEarly in the Galactic Civil War, Aban oversaw the construction of the prefabricated garrison base posted on Sedri as a commander after the Galactic Empire discovered the planet. He was then put in charge of the base, but not before losing several other ships crashed in different mishaps making Imperial command reluctant to send more ships, leaving the base heavily understaffed. Karak the Sedrian Renegade leader made a deal with Aban to trade his weapons for half of the Golden Sun and for the rebel diplomat Mors Odrion. His agreement observed by Rebel agents who would foil Karak and Aban's plot and defeat his invasion force.\nAfter the Battle of Endor he was reassigned to the Imperial Starfleet, as commanding officer of the Bellicose. Aban was a part of Thrawn's personal armada and as such was placed in command of Thrawn's operations in the Taanab system following the failure at the Battle of Sluis Van. During this operation, the Dark Jedi Joruus C'baoth disobeyed Aban's orders and did as he pleased with the gunnery controls.\nAban later commanded the Bellicose in an assault operation against the New Republic base on Ord Pardron in an effort to allow the Empire's capture of the Ukio system. Like most of the commanders under Thrawn, Aban was last reported in combat operations commanding the Bellicose at the Battle of Bilbringi.\nAban was eager to take the fight to the New Republic as he and the rest of Grand Admiral Thrawn's forces prepared their assault on the Ukio system, but he was able to mostly conceal these emotions with his military demeanor.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Battle_at_Ukio",
  "/wiki/Ukio",
  "/wiki/Captain/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Bellicose_(Imperial_I-class)",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/IM-455_modular_garrison",
  "/wiki/Sedri/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Karak",
  "/wiki/Golden_Sun",
  "/wiki/Mors_Odrion",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Taanab_operation",
  "/wiki/Taanab_system/Legends",
  "/wiki/Battle_of_Sluis_Van",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Joruus_C%27baoth",
  "/wiki/Ord_Pardron/Legends",
  "/wiki/Ukio_system",
  "/wiki/Battle_of_Bilbringi_(9_ABY)",
  "/wiki/Battle_for_the_Golden_Sun",
  "/wiki/Dark_Force_Rising",
  "/wiki/Dark_Force_Rising_(unabridged_audiobook)",
  "/wiki/The_Last_Command",
  "/wiki/The_Last_Command_(unabridged_audiobook)",
  "/wiki/The_Last_Command_1",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}