{
 "name": "Abaron",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Abaron was a Sith Lord of the reconstituted Sith Empire during the Cold War with the Galactic Republic. A member of the Sith species, he was present in the Sith Academy on the planet Korriban in 3643 BBY. There, he assigned a promising acolyte to scan several elevated Sith due to his concerns about them lacking the blood of the original Sith, a trait he deemed necessary. The acolyte completed the task with the results confirming Abaron's worries, so the Sith Lord promised to report them to the Sith's ruling body, the Dark Council.\nA Force-sensitive male member of the Sith species, Abaron became a Sith Lord of the reconstituted Sith Empire by 3643 BBY. During the later years of the Cold War, a proxy conflict between the Sith Empire and Galactic Republic, Abaron was present in the Sith Academy on the planet Korriban, and he eventually grew concerned about the dilution of the ancient Sith blood among his fellow Sith.\nTherefore, working as an agent of both the Sith Emperor and the Empire's ruling Dark Council, Abaron assigned a promising Sith Acolyte to scan four of the academy's Overseers—Sith Inquisitor Arzanon, Sith Lords Solence and Cestus, and Sith Overseer Ragate—inside the Sith Academy and in its vicinity. In order to accomplish this task, Abaron provided the acolyte with an ancient holocron that could measure the purity of a nearby target's blood. The acolyte finished the assignment and later returned to Abaron, who concluded that the blood purity was lacking, as he suspected. Abaron then decided he would bring the results to the attention of the Dark Council.\nAbaron was red-skinned and had red eyes and dark-brown hair. As a descendant of the original Sith species, Abaron was deeply worried with the dilution of his species' blood within the ranks of the Sith. He thought that those with strong enough heritage—though not necessarily of the Sith species—should be uplifted, while the others should be made their slaves.\nAbaron first appeared in Star Wars: The Old Republic, a massively multiplayer online role-playing video game released by BioWare on December 20, 2011. He starts and ends the side quest \"Purity,\" which can be taken by players of the Sith Warrior and Sith Inquisitor classes during the Prologue stage. Although the player may choose to reply between choices for light-side or dark-side points, the outcome always remains the same.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Planet/Legends",
  "/wiki/Korriban",
  "/wiki/3643_BBY",
  "/wiki/Sith_Acolyte",
  "/wiki/Sith/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Dark_Council",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Tenebrae",
  "/wiki/Overseer_(Sith)",
  "/wiki/Sith_Inquisitor",
  "/wiki/Arzanon",
  "/wiki/Lord/Legends",
  "/wiki/Solence",
  "/wiki/Cestus_(Overseer)",
  "/wiki/Ragate",
  "/wiki/Holocron/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Species/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Sith_Warrior",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Template:TOR_dates"
 ]
}