{
 "name": "Abin-Ral-Xufush",
 "display_name": "Abin-Ral-Xufush",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tiss'sharl"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tiss'shar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Shadow Wing",
      "Fa-Loh-Sui"
     ]
    }
   ]
  }
 ],
 "content": "Abin-Ral-Xufush was a ruthless and cunning sil-ar Tiss'shar trader who turned to piracy.\nAbin-Ral-Xufush was commander of the pirate fleet known as the Shadow Wing , which plied the Perlemian Trade Route and other major spacelanes, hunting anything the predatory Abin-Ral-Xufush could track. He held a strong anti-Human prejudice, and was approximately 15% more likely to strike Human-populated worlds.\nHowever, Abin's prejudice only extended to his prey; all Shadow Wing members were treated equally, regardless of species or homeworld. He rarely accepted new crew without first checking their trustworthiness and value to the organization, testing them first with trivial assignments, then increasing their difficulty until Abin was satisfied with their worthiness. He showed no tolerance for insubordinate or treacherous crew, and ran a disciplined ship. His crew respected his leadership skill and tactical savvy, and demonstrated great loyalty to him.\nAbin absorbed all takings from his raids directly into the Shadow Wing; combat-capable ships were put to use in the fleet, other ships were cannibalized for components, slaves were recruited, and cargoes were rarely sold, instead being used to support the ships and crews. He built up a fleet capable of invading and looting entire planets, descending like a swarm of insects, employing overwhelming force to take what it wanted, and departing. His own ship, the Fa-Loh-Sui, was named for a beautiful Tiss'shar assassin of the same name he once courted.\nThe Galactic Empire charged Abin-Ral-Xufush with piracy, flight to avoid Imperial prosecution, and conspiracy. He was the target of a 300,000-credit galaxywide bounty, a rare honor for a nonpolitical criminal during the Galactic Civil War.\nAbin was in his early thirties during the War, with a red diamond pattern on his back and white belly scales. He typically wore a green baldric.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tiss%27sharl",
  "/wiki/Tiss%27shar",
  "/wiki/Gender/Legends",
  "/wiki/Shadow_Wing",
  "/wiki/Fa-Loh-Sui_(corvette)",
  "/wiki/Pirate/Legends",
  "/wiki/Perlemian_Trade_Route/Legends",
  "/wiki/Human/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Fa-Loh-Sui",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Baldric",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Wizards.com",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}