{
 "name": "Able-472",
 "display_name": "Able-472",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "The Muunilinst 10",
      "The Muunilinst 10"
     ]
    }
   ]
  }
 ],
 "content": "Able-472 was a clone trooper who fought at the Battle of Muunilinst as a member of The Muunilinst 10. During the battle, he was put in charge of the artillery bombarding the city of Harnaidan.\nBorn on the aquatic planet of Kamino as a clone of the Mandalorian bounty hunter Jango Fett, Able-472 was one of the many clones created to fight in the Grand Army of the Republic.\nIn 21.66 BBY, 4 months after the First Battle of Geonosis, wanting to to stop the InterGalactic Banking Clan from assisting the Confederacy of Independent Systems any futher, the Chancellor enlisted Jedi Master Obi-Wan Kenobi and his Padawan Anakin Skywalker to launch an assault on the IGBC's headquarters on Muunilinst. Accepting the mission, and promoting his padawan to the rank of commander, Obi-Wan Kenobi assembled a large invasion force on Coruscant.\nAmong this invasion force was Able-472, who was assigned to a squad of ARC troopers known as the Muunilinst 10. After departing from Coruscant, Able-472 and the rest of the Muunilinst 10 were given the mission to infiltrate the city of Harnaidan and disable key enemy defences to allow for the main clone forces to safely invade the city. Once they had learned of their mission and geared up, Able-472 and his squad were assembled by Obi-Wan Kenobi and informed of the importance of their mission's success.\nUpon exiting hyperspace, Able-472 loaded up in a modified LAAT with blue markings, and headed down to the planet's surface while Skywalker's fighter squadrons distracted the CIS fleet. Once they had reached the planet's surface, Able-472's gunship broke off from the main force and headed towards the centre of the city with little to no opposition. During their flight through the city; however, a B1-series battle droid launched a rocket towards the LAAT and destroyed its engine which caused it to crash. Able-472, now stranded, formed a defensive perimeter around the crashed gunship with the rest of the Muunilinst 10. While waiting on his next set of orders, a group of battle droid assassins opened fire on Able's squad, killing one of his squadmates. ARC-77, Able-472's captain, ordered the squad to retreat behind the crashed LAAT, and sent two of his men to draw the droids' fire, while one of his troopers scanned the area for the enemy's position. After finding out where the droids were located, one of the ARC troopers used a PLX-1 portable missile launcher to destroy the droid snipers hiding within the buildings. The battle won, ARC-77 ordered Able-472 and the rest of his squad to keep moving towards their objective. On their way to the main Separatist artillery emplacement, Able-472 was told to hold his position by ARC-77, as an Armored Assault Tank began firing on the squad's position. Having planned for this; however, one of Able-472's squadmates, an ARC Lieutenant, slid down a rope behind the AAT and climbed inside of it to destroy it. The repulsor tank destroyed, Able-472 and his squad continued their march towards the emplacement. Having finally reached the artillery cannon's location, Able-472 grappled up the side of the tower with his squad and helped destroy the battle droids guarding it. Once all of the droids were dispatched, Able helped place explosive charges all over the main cannon, and destroyed it from a safe distance.\nWith the main Separatist cannon destroyed, the Republic began breaking through the CIS's forward positions. Terrified, the Muun leaders of the Banking Clan sent the renown bounty hunter Durge to deal with the approaching army. Alongside an army of lancer droids, Durge decimated a large portion of the Republic's clone army, including their Self-Propelled Heavy Artillery walkers. Witnessing this destruction, Able-472, having been recently put in charge of the artillery, informed General Obi-Wan Kenobi, who told him and his squadmates to mount up for battle. While Kenobi and a battalion of clone lancer troopers were fighting off Durge and his droids, Able-472, the Muunilinst 10, and another unit of clone troopers headed to the InterGalactic Banking Clan's main command tower to wait for General Kenobi. Once the General had arrived, Able-472 and the other clones stormed the command center, destroying the battle droids guarding it, while also capturing the leader of the Banking Clan, San Hill. However, before they could bring San Hill back, Durge came flying through one of the windows and was immediately shot down and blown up by Able-472 and the rest of the clone forces. Thinking that he was dead, the clones were shocked to find that Durge was still alive, unscathed. After a small skirmish between Obi-Wan and the bounty hunter, a group of clone troopers attempted to grapple onto the Gen'Dai, but were knocked away before they could reach him. Soon after, Obi-Wan Kenobi was consumed by the bounty hunter's body, but was rescued by ARC-77's distraction, which gave the Jedi Master enough time to destroy Durge from the inside using The Force. Victorious, Able-472 and the rest of the clone forces rounded up the members of the Banking Clan and brought them back to their Acclamator.\nBorn as a clone of the Mandalorian bounty hunter Jango Fett, Able-472 stood at a height of 1.83 meters. During the Battle of Muunilinst, Able-472 wore phase 1 clone trooper armor with no discernible markings. He was also equipped with a DC-15A blaster rifle which he used to a great extent. Able-472 was shown to be a capable leader, as he was put in charge of overseeing the artillery destroying the CIS's forward positions. On top of being able to lead others, Able-472 was also shown to be an exceptional soldier, as he was assigned to the Muunilinst 10, a clone unit that Jedi General Obi-Wan Kenobi considered to be the best.\nAble-472 was created by Genndy Tartakovsky for the 2003 animated television series Star Wars: Clone Wars, where he appeared as one of the members of the elite Muunilinst 10. Able-472 wouldn't receive a name until June 27, 2006, when The New Essential Guide to Droids was released and gave the previously unidentified trooper the name \"Able-472\". Like all clones in Star Wars: Clone Wars, Able-472 is voiced by André Sogliuzzo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Abel_(disambiguation)",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/The_Muunilinst_10",
  "/wiki/Jedi_General/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Battle_of_Muunilinst/Legends",
  "/wiki/Artillery/Legends",
  "/wiki/City/Legends",
  "/wiki/Harnaidan",
  "/wiki/ARC-77",
  "/wiki/Alpha-class_Advanced_Recon_Commando",
  "/wiki/Lieutenant/Legends",
  "/wiki/Waterworld/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/InterGalactic_Banking_Clan/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Muunilinst/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/CT-43/002",
  "/wiki/Battle_droid_assassin",
  "/wiki/Hyperspace/Legends",
  "/wiki/Low_Altitude_Assault_Transport/Legends",
  "/wiki/V-19_Torrent_starfighter/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Confederacy_of_Independent_Systems_Navy",
  "/wiki/Gunship/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/E-60R_missile_launcher",
  "/wiki/Missile/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Target_Imager",
  "/wiki/PLX-1_portable_missile_launcher",
  "/wiki/Armored_Assault_Tank",
  "/wiki/Repulsorlift",
  "/wiki/Tank_(vehicle)/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Explosive_charge",
  "/wiki/Clone_Captain",
  "/wiki/Muun/Legends",
  "/wiki/Durge/Legends",
  "/wiki/IG_lancer_combat_droid",
  "/wiki/Self-Propelled_Heavy_Artillery",
  "/wiki/Walker/Legends",
  "/wiki/General/Legends",
  "/wiki/Lancer_Battalion",
  "/wiki/Clone_lancer_trooper",
  "/wiki/San_Hill/Legends",
  "/wiki/Gen%27Dai",
  "/wiki/The_Force/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/DC-15A_blaster_rifle/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Genndy_Tartakovsky",
  "/wiki/2003",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/June_27",
  "/wiki/2006",
  "/wiki/The_New_Essential_Guide_to_Droids",
  "/wiki/Andr%C3%A9_Sogliuzzo",
  "/wiki/Clone_Wars_Chapter_2",
  "/wiki/Clone_Wars_Chapter_3",
  "/wiki/Clone_Wars_Chapter_8",
  "/wiki/Clone_Wars_Chapter_9",
  "/wiki/Star_Wars:_Clone_Wars_(PhotoComic)",
  "/wiki/Clone_Wars_Chapter_20",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Clone_Wars_Chapter_1",
  "/wiki/Clone_Wars_Chapter_4"
 ]
}