{
 "name": "Abominelle",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vena"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Prior to 2 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Abominelle was a Venan Human female, and the Royal Margravine of Vena. While touring Fornax Station on the eve of her wedding, she was interrupted by Han Solo and the plan concocted by the station's security officer, Smurdap, to capture the smuggler. Her wedding was called off after she fell in love with Solo.\nAround 2 BBY, on the eve of her wedding, Abominelle was touring the Fire Rings of Fornax on Fornax Station when she was interrupted by the smuggler Han Solo and his co-pilot Chewbacca. During their interaction, Solo insulted Abominelle and walked off, leaving the Royal Margravine speechless.\nLater that night, her Tyrian shimmersilk wedding dress was stolen by the station's security officer, Smurdap, as part of his plot to blackmail Chewbacca and Solo into turning over their contraband. While Solo remained oblivious, he was alerted to the plan after his attention was drawn by Abominelle's screaming. He, again, walked away after insulting her for making a scene.\nHer dress was returned after Smurdap was outwitted and under custody. The next time that she saw Solo, she told him that she had called off her wedding because she was in love with someone else, implying that she was attracted to him. He politely took her hand when she offered it, before telling her that Chewbacca wanted to know whether there was a reward for returning her dress. Infuriated, Abominelle began screaming again.\nAs a member of Venan royalty, she appeared to be extremely spoiled. Abominelle was prone to screaming when she was inconvenienced, and tended to accost those who interfered with her plans.\nAbominelle made her first and only appearance so far in the 2010 young reader novel Adventures in Hyperspace: Fire Ring Race by Ryder Windham.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Vena/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Venan",
  "/wiki/Margravine",
  "/wiki/Han_Solo/Legends",
  "/wiki/Smurdap",
  "/wiki/Fire_Rings_of_Fornax",
  "/wiki/Chewbacca/Legends",
  "/wiki/Shimmersilk/Legends",
  "/wiki/Adventures_in_Hyperspace:_Fire_Ring_Race",
  "/wiki/Ryder_Windham"
 ]
}