{
 "name": "Abso_Bar_Binks",
 "display_name": "Abso Bar Binks",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Otolla Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Abso Bar Binks was the son of Jar Jar Binks.\nAbso's father would often try to bring presents home to his son and wife, but because of checkpoints that the Galactic Empire had set up he was often unable to do so, which led Abso to join the Rebel Alliance. Abso learned how to fight both with Gungan weaponry as well as unarmed, and later became a crew member of the Tantive V.\nWhile chasing Princess Leia Organa, Darth Vader captured the Tantive V which had been set up as a decoy ship in order to allow the princess more time to escape. As soon as the hatch was opened by stormtroopers, Abso—disguised as Leia Organa—sent through a smoke grenade which was of Gungan design and proceeded to use his unarmed combat skills to take out several of the stormtroopers. It was only when Darth Vader himself stated that the being was not the ambassador that Abso removed the disguise.\nThough at first Vader believed that it was Jar Jar himself, Abso soon corrected him and, while dodging blaster bolts and taking out further stormtroopers, had a conversation with Vader himself. Abso believed that, as the Gungan spirit could never be broken, the Empire could never win; Vader informed Abso that a certain \"shriveled little green man\" had thought the same way and, though Abso may think it was deep, it was in fact not. Abso countered by stating that Vader would never understand as he could not ever feel the kind of feelings that a family would bring him. It is possible this, like other certain minor incidents, caused Anakin Skywalker to stir slightly within Darth Vader, and to mourn the loss of his wife and  his unborn child.\nVader then ordered the stormtroopers to tear the ship apart and search for the ambassador. As soon as they left to follow his orders, he grabbed Abso in a Force grip and demanded that Abso tell him where the stolen plans were. When the stormtroopers returned, reporting that they could only find unarmed Gungans aboard, Abso let Vader know that Leia was not even on the ship as the Tantive V had been set up to allow Leia to escape and that his job was simply to stall them; a task at which had succeeded.\nThough the stormtroopers wanted to kill Abso, Vader ordered them to simply lock him up with the other Gungans as they were not worth the blaster bolts that would be taken to kill them. A stormtrooper quickly informed Vader that they had located the Tantive IV and so Vader set course for it, letting the Tantive V drift free. An hour later, Leia was a captive of the Empire but Abso's job was not in vain as he bought enough time for Leia to get R2-D2 to Tatooine with the Death Star Plans, which eventually led to its destruction.\nAbso Bar Binks only appears in the story Tantive IV, published in Star Wars Manga: Black issue of Tokyopop's Star Wars Manga. Originally published in Japan, those stories were considered to be of \"fuzzy\" continuity by Lucasfilm. Since then, they have been republished in English in the United Kingdom under Infinities label, which established the material in them as non-canonical.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Abso_Bar_Binks",
  "/wiki/Otolla/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Jar_Jar_Binks/Legends",
  "/wiki/Abso_Bar_Binks%27s_mother",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Tantive_V_(CR90_corvette)",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Tantive_IV/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Tantive_IV_(comic)",
  "/wiki/Star_Wars_Manga:_Black",
  "/wiki/Tokyopop%27s_Star_Wars_Manga",
  "/wiki/Star_Wars_Insider",
  "/wiki/We_Need_to_Talk_About_Jar_Jar",
  "/wiki/Star_Wars_Insider_131",
  "/wiki/Star_Wars_Insider_Special_Edition_2014",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Leland_Chee",
  "/wiki/November_6",
  "/wiki/2006"
 ]
}