{
 "name": "Acaadi",
 "display_name": "Acaadi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Iridonia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Revanchists",
      "Sith",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Acaadi was a Zabrak male Jedi during the time of the Galactic Republic's war against the Mandalorian Neo-Crusaders. During the war, he served alongside fellow Zabrak Duqua Dar, allying himself with the Revanchists—a group of Jedi led by then-Jedi Knight Revan—who went against the orders of the Jedi Council and took an active role in the war. Revan led the Republic forces during the war but came to accept Sith teachings in the process. Acaadi's dedication to Revan likewise eventually turned him to the dark side, and he became a Sith agent at the start of the Jedi Civil War, which began when Dark Lord of the Sith Darth Revan and his apprentice Darth Malak led an invasion of the Republic. While working as a Sith agent, Acaadi developed a reputation as a skilled corrupter of Jedi and Republic citizens.\nOn Iridonia, Acaadi was tasked with sabotaging Republic forces on and in orbit of the planet, in preparation for a Sith raid against the Republic fleet there. He infiltrated a group of Mandalorian mercenaries, using them to destroy a Republic communications center, and later in a plot to turn Duqua Dar to the dark side. Acaadi was pursued by a group of Jedi and spacers working as agents for the Republic, who attempted to thwart his plans. The Republic agents followed Acaadi to the flagship of the Republic fleet, the Hammerhead-class cruiser Champion of Iridonia, which was situated in orbit. There, they engaged Acaadi, as well as a team of Sith commandos under his command, with the fate of the Republic fleet hanging in the balance.\nDuring his time as a Jedi, the Zabrak male Acaadi traveled to the Draethos and Miraluka homeworlds to study the Keetael and Luka Sene Force traditions, respectively. He served in the Galactic Republic's war against the Mandalorian Neo-Crusaders, allying himself with the Revanchists—a group of Jedi led by then-Jedi Knight Revan—who went against the orders of the Jedi Council and took an active role in the conflict. Leading the Republic forces in the war, Revan discovered ancient Sith teachings and came to embrace them. During the early part of the Mandalorian Wars, Acaadi served alongside fellow Zabrak Jedi Duqua Dar, before Acaadi's dedication to Revan eventually turned him to the dark side. Dar, however, resisted the call of the dark side and remained on the Zabrak homeworld of Iridonia, though he believed that his destiny lay elsewhere.\nAcaadi became a Sith agent at the beginning of the Jedi Civil War, which began when Dark Lord of the Sith Darth Revan and his apprentice Darth Malak led an invasion of the Galactic Republic in 3959 BBY. In this role, Acaadi developed a reputation as a corrupter of Jedi and Republic citizens or supporters alike.\nAt the start of the Jedi Civil War, Acaadi infiltrated a group of Mandalorian mercenaries on Iridonia, disguising himself in red Rally Master armor, which was worn by the middle ranks of the Neo-Crusaders. Convincing them to follow his leadership, Acaadi ultimately used the Mandalorians to attack a Republic communications center in order to destroy it in advance of a planned Sith attack on Iridonia. Having succeeded in their task, the Mandalorians became a liability to Acaadi, so he planned to remove them in such a way as to benefit him. He used his ability to peer into the future to set up a situation where he could remove the Mandalorians while working to divide Duqua Dar from the Jedi Order, and potentially turn him to the dark side to join the Sith cause.\nAs the Mandalorians retreated from the communications center, they split into two groups while heading for a rendezvous near the town of Wortan; one of which was encountered by Dar, while the other was ambushed and eliminated by a group of Jedi and spacers, who were under orders from the Republic. Acaadi saved Dar from the Mandalorians and used the encounter to persuade Dar to join him. Dar was convinced that the Jedi Order had been holding him back, preventing him from using his natural aggressive feelings. The conversation between the two Zabrak was overheard via comlink by the Republic agents. They were unaware that Dar had agreed to join Acaadi, however, and so they decided to go to Dar's aid.\nAcaadi and Dar traveled to Acaadi's private hangar in Wortan, with the Republic agents in pursuit. Reaching Wortan, the Republic agents searched the town for the two Zabrak, and in the process they met two unexpected allies: the male Draethos Darok-Tho and the female Miraluka Jirany Sha, who were practitioners of Keetael and Luka Sene, respectively, the very Force traditions Acaadi had studied earlier in his travels as a Jedi. The two Force-sensitives had been ordered to Iridonia because of their masters' Force visions, so that they could help the Republic agents stop Acaadi. They believed the Sith agent was using techniques he'd learned while studying their respective Force traditions to corrupt Jedi and further Darth Revan's Sith Empire.\nWith the help of Darok-Tho and Sha, the Republic agents managed to locate Acaadi's hangar. Acaadi detected the group as they approached and ordered the hangar's guards to withdraw from the hangar's exterior, as he preferred to rather have the Republic agents meet with Dar in the hangar, which was being watched by a squad of his Sith commandos hidden among nearby debris. Just as the agents arrived, Acaadi left the planet in his personal shuttle with another group of Sith commandos, heading for the flagship of the Republic fleet in Iridonia's orbit, the Hammerhead-class cruiser Champion of Iridonia. He planned to sabotage the ship in preparation for the surprise Sith raid against the Republic fleet. After the Republic agents attempted to convince Dar to reject the dark side and were forced to battle the Sith commandos who attacked at Acaadi's command, they discovered Acaadi's plan and raced to the Champion of Iridonia to warn Admiral Rokon, the commander of the Republic fleet.\nAs the Republic agents approached the Champion of Iridonia, the Sith fleet arrived to begin its attack. Acaadi boarded the Champion of Iridonia, wearing an ill-fitting Republic naval lieutenant's uniform, and took his commandos to an engineering station. The crew of the Champion of Iridonia discovered the Sith agent's location through security feeds, as Acaadi and his commandos sabotaged the ship. Acaadi turned to one of the cameras and spoke to Admiral Rokon, telling him he was too late. At that moment, Acaadi's group sent a burst of electrical energy through the bridge control panels, killing the crew and wounding the admiral. Moving to take over the ship, Acaadi and his commandos attacked the bridge, but the Republic agents, who had also arrived aboard, engaged Acaadi and his commandos in an attempt to save the Champion of Iridonia, with the fate of the Republic fleet resting on their shoulders.\nAcaadi was a male Zabrak who had whitish skin covered in a complex pattern of black, flowing tattoos of stylized knots and strands, which encircled the eight small horns on his head. The pattern of the tattoos made it look as if he had a mask across his piercing red eyes. He used a similar entwined black-and-white pattern on the hilt of his red-bladed lightsaber.\nAcaadi had a charismatic personality that he combined with his knowledge of the Force to corrupt others. Jirany Sha's Luka Sene mentor would tell her tales that as a young Jedi, Acaadi was always secretive and disruptive, despite his interest in non-Jedi Force knowledge. In addition to Basic, Acaadi could speak Draethos and Zabraki. He possessed a low, smooth voice, and spoke with a classic Iridonian accent\nAcaadi was a knowledgeable Force-user who had learned many techniques as both a Jedi and Sith, as well as through his studies with various Force-using groups. He was capable of seeing glimpses of other places and other times through the use of farseeing, and he could also use Force lightning. Acaadi could hide his Force presence from other Force-users at will, as well as influence the minds of others, allowing him to escape detection.\nIn combat, Acaadi preferred to focus on using Force powers rather than lightsaber combat. He was skilled in telekinetic applications of the Force, able to lift beings into the air during engagements.\nAcaadi was the primary villain for Iridonian Darkness, an online Wizards of the Coast adventure written by Sterling Hershey for the Star Wars Roleplaying Game, which was made available as a free download from Wizards.com in October 2008.\nAs a roleplaying adventure, Iridonian Darkness allows the actions of those involved in the game to affect the actions of Acaadi. When the Republic agents meet with Duqua Dar in Acaadi's hangar, Acaadi's words when ordering his commandos to attack depends on whether or not Dar is redeemed. If Dar chooses the dark side, Acaadi orders him to dispatch with the Republic agents and join him in destroying the Republic fleet. However, if Dar is redeemed, Acaadi orders his commandos to kill them all. During the final encounter aboard the Champion of Iridonia, if Jirany Sha and Darok-Tho are with the Republic agents, Acaadi will taunt them about how he has used what he learned from their traditions to corrupt Jedi and others across the galaxy. The fate of Acaadi is determined by the actions of those involved in the game, making it possible for him to both die in the final encounter or flee in an escape pod.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Iridonia/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Revanchist",
  "/wiki/Sith/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Jedi/Legends",
  "/wiki/Time/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Duqua_Dar",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Orbit/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Mission_on_Iridonia",
  "/wiki/Iridonia_communications_center",
  "/wiki/Spacer/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Hammerhead-class_cruiser",
  "/wiki/Champion_of_Iridonia",
  "/wiki/Sith_trooper_(Sith_Empire)",
  "/wiki/Draethos",
  "/wiki/Miraluka/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Keetael",
  "/wiki/Luka_Sene",
  "/wiki/The_Force/Legends",
  "/wiki/3959_BBY",
  "/wiki/Rally_Master",
  "/wiki/Armor/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Farsight/Legends",
  "/wiki/Wortan",
  "/wiki/Comlink/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Darok-Tho",
  "/wiki/Jirany_Sha",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Rokon",
  "/wiki/Commander/Legends",
  "/wiki/Battle_of_Iridonia_(Jedi_Civil_War)",
  "/wiki/Republic_Navy",
  "/wiki/Lieutenant/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Lightsaber/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Draethos_(language)",
  "/wiki/Zabraki/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Force_stealth",
  "/wiki/Mind_trick/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Iridonian_Darkness",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Sterling_Hershey",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Wizards.com",
  "/wiki/October",
  "/wiki/2008",
  "/wiki/Roleplaying_game",
  "/wiki/The_galaxy/Legends",
  "/wiki/Death/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}