{
 "name": "Acantha",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nephran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Norikus gang"
     ]
    }
   ]
  }
 ],
 "content": "Acantha was a Nephran female youth who was a member of the criminal Norikus gang on the planet Coruscant. In around 232 BBY, she, a Lepi, and the gang's leader, Norikus, attempted to rob the thief Nittel Karkson on level four thousand of Galactic City, but after being confronted by Jedi Master Stellan Gios, Acantha fled.\nAcantha was a Nephran female member of the criminal Norikus gang, which was led by the Octeroid Norikus and operated on the lower levels of the planet Coruscant. On Solstice Tide in around 232 BBY, Norikus, Acantha, and a Lepi member of the gang attempted to rob the young thief Nittel Karkson in a litter strewn alleyway on level four thousand of Galactic City. Acantha snapped her pincers ominously and then lifted Karkson—who had been pickpocketing on Republic Avenue—by his jacket and emptied his pockets out onto the ground while growling in Nepotisian.\nNorikus complained the boy had not gathered enough, but the group were then interrupted by the arrival of Jedi Master Stellan Gios. Acantha whirled round to face the Jedi, dropping Karkson in surprise, but upon seeing his activated lightsaber she fled along with the Lepi, leaving Norikus to face him alone. Gios let Karkson go, but when he later visited the boy's hovel, the thief heard him approach and thought it might be Acantha or Norikus come to confront him and so grabbed a ladle for defense, despite knowing it would have been useless against Acantha's pincers.\nAcantha was a youth when she encountered Stellan Gios, but still loomed over Karkson and was at least twice his height. Her pincers were tattooed.\nAcantha first appeared in \"A Coruscant Solstice,\" a short story written by Cavan Scott and published in the 2021 Life Day Treasury anthology.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nephran",
  "/wiki/Gender",
  "/wiki/Norikus_gang",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/232_BBY",
  "/wiki/Lepi",
  "/wiki/Thief",
  "/wiki/Nittel_Karkson",
  "/wiki/Galactic_City",
  "/wiki/Jedi_Master",
  "/wiki/Stellan_Gios",
  "/wiki/Octeroid",
  "/wiki/Solstice_Tide",
  "/wiki/Limb",
  "/wiki/Republic_Avenue",
  "/wiki/Clothing",
  "/wiki/Nepotisian",
  "/wiki/Jedi",
  "/wiki/Stellan_Gios%27s_lightsaber",
  "/wiki/Tattoo",
  "/wiki/A_Coruscant_Solstice",
  "/wiki/Cavan_Scott",
  "/wiki/2021",
  "/wiki/Life_Day_Treasury",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/32_BBY"
 ]
}