{
 "name": "Ace Merrick",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Belt of Arah"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Captain Ace Merrick was a Human male pilot in the Alliance to Restore the Republic during the Galactic Civil War. As leader of Rascal Squadron, he led his cousin Ina Rece and Rookie One to the Belt of Arah in 3 ABY to locate and disable a hidden mining facility being used by the Galactic Empire. The Rebels successfully destroyed the mining facility, but Merrick was killed in a surprise attack by three TIE Phantoms before he could return to the Alliance Fleet.\nAce Merrick joined the Alliance to Restore the Republic during the Galactic Civil War as a starfighter pilot. By 3 ABY, Merrick held the rank of captain and was assigned to Rascal Squadron alongside his friend and cousin Ina Rece. After the Rebels were driven from their main base on the remote ice world of Hoth in 3 ABY, they learned that the Galactic Empire was processing oridium ore at a hidden mining facility in the Belt of Arah to fuel the TIE Phantom, a new cloaking device-equipped starfighter which the Dark Lord of the Sith Darth Vader intended to use to destroy the scattered Alliance Fleet. In an attempt to learn more about the new threat, Admiral Gial Ackbar dispatched Merrick to lead pilots Rece and Rookie One in T-65 X-wing starfighters to the Dreighton Nebula to locate and disable the mining facility.\nWhen Rascal Squadron arrived at the Belt of Arah, they found the perimeter protected by derillium mines. Merrick led the Rebels through the asteroid field, destroying any mines they encountered along the way, but no sooner had they cleared the perimeter than the group came under attack from numerous TIE interceptors. During the ensuing skirmish, two of the Imperial starfighters were able to get behind Merrick; unable to shake his pursuers, Merrick had to rely on his wingmates to clear the interceptors from his tail. The Rebels soon cleared the Imperial fighters and proceeded on to the mining facility, built into one of the larger asteroids. Merrick led the group into the facility through a transport corridor designed for shuttles and cargo drones. Once inside, Rookie One destroyed the shield emitters at an exchange junction, providing access to the reactor core. Evading fire from sentry guns, the Rebels destroyed the reactor's cooling system and Merrick led them to safety through an exhaust vent moments before the reactor went critical, destroying the facility.\nWith their mission complete, Merrick ordered Rascal Squadron to return to the Alliance Fleet. As he prepared to jump to hyperspace, however, three TIE Phantoms decloaked behind the Rascals and opened fire, killing Merrick with their opening salvo and destroying Rece's X-wing before Rookie One managed to escape. Rookie One later proved instrumental in ending the threat of the TIE Phantoms.\nMerrick was a light-skinned, overweight Human male who believed that life should be entertaining and tried to live it to the fullest. He enjoyed his work with the Rebel Alliance and could think of no more enjoyable activity than engaging in combat against the Empire. As flight leader of Rascal Squadron during their mission to the Arah mining facility, Merrick used his experience to help his younger wingmates safely navigate the asteroids and the derillium minefield. When engaged by enemy starfighters, Merrick designated targets for his wingmates and helped to drive the Imperials into their sights.\nAce Merrick was created for the 1995 LucasArts video game Star Wars: Rebel Assault II: The Hidden Empire, in which he was portrayed by actor Roy Conrad. Merrick appears in the levels \"The Asteroid Field\", \"Interceptor Attack\" and \"The Mining Facility.\" If the player as Rookie One is killed during any of these levels, a game over cutscene shows Merrick and Rece continuing the mission without him. Although he is called \"Ace\" by Rece, the character is listed on the credits only as \"Captain Merrick.\" 2008's The Complete Star Wars Encyclopedia confirmed that his full name is Ace Merrick.\nRebel Assault II designer Vincent Lee's storyboards and scripts document, dated November 16, 1994, included a brief description of Merrick. Though not included in the game or its manual, the biography was adapted for use on the LucasArts website and the document was later printed in Rob Smith's Rogue Leaders: The Story of LucasArts. Lee's original version describes Merrick as \"early to mid thirties\" but this was not included in the online biography. Lee also made notes on the actors he thought most resembled each character in the game, choosing John Rhys-Davies to represent Merrick.\nProps and costumes created for the original trilogy of Star Wars movies were used during the filming of Rebel Assault II. The flight helmet worn by Merrick is the same design as that worn by the pilot of Red Four, John D. Branon, in Star Wars: Episode IV A New Hope.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Merrick",
  "/wiki/3_ABY/Legends",
  "/wiki/Arah_asteroid_belt",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/File:AceMerrick1-RAII.ogg",
  "/wiki/Captain/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Flight_leader",
  "/wiki/Rascal_Squadron",
  "/wiki/Ina_Rece",
  "/wiki/Rookie_One",
  "/wiki/Arah_mining_facility",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Arah",
  "/wiki/Mining/Legends",
  "/wiki/Death/Legends",
  "/wiki/TIE/ph_phantom",
  "/wiki/Alliance_Fleet",
  "/wiki/File:AceMerrick2-RAII.ogg",
  "/wiki/Starfighter/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Oridium",
  "/wiki/Ore/Legends",
  "/wiki/Fuel/Legends",
  "/wiki/Cloaking_device/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Dreighton_Nebula/Legends",
  "/wiki/Derillium_mine",
  "/wiki/Asteroid_belt",
  "/wiki/Flight_group/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Wingmate/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Drone/Legends",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Reactor/Legends",
  "/wiki/Thermal_exhaust_port/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Mission_to_Imdaar",
  "/wiki/File:InaRece3-RAII.ogg",
  "/wiki/Derillium",
  "/wiki/Mine/Legends",
  "/wiki/File:AceMerrick3-RAII.ogg",
  "/wiki/1995",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Rebel_Assault_II:_The_Hidden_Empire",
  "/wiki/Roy_Conrad",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Vincent_Lee",
  "/wiki/November_16",
  "/wiki/1994",
  "/wiki/Rob_Smith",
  "/wiki/Rogue_Leaders:_The_Story_of_LucasArts",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars",
  "/wiki/Flight_helmet/Legends",
  "/wiki/Red_Four/Legends",
  "/wiki/John_D._Branon/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Category:Audio_files_of_Ace_Merrick",
  "/wiki/Category:Images_of_Ace_Merrick",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Cyber_Notes",
  "/wiki/Star_Wars_Galaxy_Magazine_6",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy"
 ]
}