{
 "name": "Ackmena",
 "display_name": "Ackmena",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chalmun's Spaceport Cantina"
     ]
    }
   ]
  }
 ],
 "content": "Ackmena was a human female who worked as the nighttime bartender in Chalmun's Spaceport Cantina in the Tatooine spaceport of Mos Eisley. She operated a \"side hustle\" with two local pickpockets, Kabe and Muftak.\nAckmena, a human female, lived on the Delkin Ridge on the Outer Rim world of Tatooine, along with her wife, Sorschi. During the night, she worked as bartender in Chalmun's Spaceport Cantina, a cantina in the spaceport of Mos Eisley owned by the Wookiee Chalmun. She shared this job with Wuher, who tended the bar during the daytime. However, she possessed a friendly manner, and this made her more popular than Wuher.\nAs part of her own \"side hustle,\" Ackmena charged \"rent\" to Kabe and Muftak, two pickpockets that lived in the cavernous stone pipeways of the cantina's underground and that often made their earnings off inebriated regulars of the bar. She would forward the pay to Chalmun, the proprietor, while keeping some of the proceeds for herself.\nDespite their racket, the Talz and Chadra-Fan duo often fell behind on their payments, eliciting sympathy from Ackmena but also the threat that Chalmun would take the opportunity of removing the \"infestation in his pipes.\" This happened on one day in 0 BBY, and Ackmena warned the duo that she would need the money by that night, hinting at the consequences. That same day, Ackmena was present in Chalmun's office, requesting better working hours. Later that night, after taking over the bar from Wuher, she received the money from Kabe and Muftak, who had sold the kloo horn of Lirin Car'n, a member of the in-house cantina band, and then proceeded to serve Muftak several drinks with his remaining earnings until finally cutting him off.\nAckmena was respected by many, even by the gruff and unapproachable Wuher, as a \"tough old broad.\" However, even when confronted with Kabe and Muftak's bankruptcy, she seemed sympathetic to their plight, despite the unspoken knowledge that Chalmun would be very unhappy, and allowed them a day of respite for them to accrue the money to pay off their debt. She had a friendly manner, and this made her more popular than Wuher. Ackmena was attracted to women, and took a wife named Sorschi, with whom she lived with out on the Delkin Ridge.\nThe character of Ackmena first appeared in 1978, during The Star Wars Holiday Special, where she was played by Bea Arthur. Her first mention in canon was in the 2016 reference book Star Wars: Complete Locations, and she eventually made an appearance in the short story \"The Kloo Horn Cantina Caper\" from the 2017 short-story anthology From a Certain Point of View.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ackmena",
  "/wiki/Ackmena/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Bartender",
  "/wiki/Tatooine",
  "/wiki/Spaceport",
  "/wiki/Mos_Eisley",
  "/wiki/Thief",
  "/wiki/Kabe",
  "/wiki/Muftak",
  "/wiki/Delkin_Ridge",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Sorschi",
  "/wiki/Cantina",
  "/wiki/Wookiee",
  "/wiki/Chalmun",
  "/wiki/Wuher",
  "/wiki/File:Ackmena_and_Chalmun.png",
  "/wiki/Talz",
  "/wiki/Chadra-Fan",
  "/wiki/Standard_day",
  "/wiki/0_BBY",
  "/wiki/Standard_hour",
  "/wiki/Kloo_horn",
  "/wiki/Lirin_Car%27n",
  "/wiki/Figrin_D%27an_and_the_Modal_Nodes",
  "/wiki/1978",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/Bea_Arthur",
  "/wiki/2016",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/The_Kloo_Horn_Cantina_Caper",
  "/wiki/2017",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/We_Don%27t_Serve_Their_Kind_Here",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope"
 ]
}