{
 "name": "Acros-Krik",
 "display_name": "Acros-Krik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ongree"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Acros-Krik was the corrupt Ongree male mayor of Coruscant's Uscru Entertainment District. Granted his position by the galaxy-wide crime syndicate Black Sun, he served as an informant for them, gathering valuable intelligence on the denizens of the district. Uscru attracted people from all walks of life, from senators to shady characters, as the district covered a significant amount of altitude, from the upper levels to the underworld. Acros-Krik would guide and treat those with a kindly financial disposition, accepting bribes from corrupt officials.\nHe kept his hand in both the high life and the criminal underworld, hiring the Nalle triplet spies to keep an eye on those he wanted monitored. He had associations with felons such as the Baath brothers, but he kept a presence amongst the more reputable citizens, painting for himself the image of a kindly father figure who was striving for a better Uscru Entertainment District. This stance, in Black Sun's opinion, garnered unwanted attention.\nHome to the world Coruscant, Acros-Krik lived in the last decades of the Galactic Republic and was affiliated with the Black Sun crime syndicate. Intending to gain a new resource of political Republic information, Black Sun inserted Acros-Krik as the mayor of Coruscant's Uscru Entertainment District; since the district was in close proximity to the Senate District, Black Sun would be able to gain access to the upper echelons of the galactic capital's political cadre. With a rigged election, Acros-Krik was installed by Black Sun as the District's mayor. In return for this service, he would work as an informer, passing along valuable nuggets of information to his criminal superiors. Uscru, covering both the physical upper and lower portions of Coruscant, allowed Acros-Krik to meet with all walks of life. Eventually, it was understood that if a being wanted preferential treatment in Uscru, they would go to the mayor.\nUscru wallowed in crime and corruption, and Acros-Krik was far from having his hands clean in both matters. However, instead of keeping a low profile like his affiliates, he made sure he was visible to all of his citizens, and painted himself as a benevolent and boisterous leader. Utilizing his connections with both the Black Sun and the Republic, he was confident enough to walk the city streets amongst the denizens, and in time, he came to be viewed as a father figure whom others could look to for guidance. He came under potential threat when, in 22 BBY, an airspeeder piloted by the bounty hunter Zam Wesell crashed near him in the lower levels, but he emerged unscathed.\nThe truth of Acros-Krik's administration was far less glamorous. He had ties to the notorious Baath brothers and other assorted lowlifes, and would constantly monitor his guests. He enlisted the services of the Nalle triplet spies for monitoring operations, which aided his primary mission: gathering information for Black Sun. In time, however, Black Sun grew wary of his disposition and lack of subtlety, and became concerned with their Uscru mayor.\nAlthough he was enlisted and bonded to the shady and secretive Black Sun crime syndicate, Acros-Krik had a gregarious disposition, and deliberately got close to his people. In turn, they regarded him with great affection, possibly dissuading any thoughts they may have had in regards to his less kindly side. Acros-Krik would enlist the services of locals to do his bidding, as in the case of the Nalle triplets, and would personally aid any politicians hoping to enjoy a favorable experience in Uscru. Though his modus operandi clashed with Black Sun technique, his connections in high places afforded him a great deal of confidence in his work. Acros-Krik was a patron of Dex's Diner, a dining establishment that was located in the CoCo Town district of Coruscant, and he liked eating the diner's nerfsteak sandwiches. The Ongree male had yellow eyes.\nThe character of Acros-Krik first appeared in George Lucas's 2002 film Star Wars: Episode II Attack of the Clones, wherein the computer-generated character model of Jedi Knight Pablo-Jill was inserted into a crowd for the \"Coruscant Chase\" sequence. The character was later fleshed out and given a name by Gregory Walker through the StarWars.com Hyperspace feature What's The Story? Walker was inspired by the anime television series Macross, for which he named the character. The name was also partly derived from that of Austin, Texas mayor Kirk Watson. Walker additionally established a conclusion for Acros-Krik's story, involving Black Sun ousting him and the Ongree taking up residence in the Oseon system, but this was cut from the final entry.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Coruscant/Legends",
  "/wiki/Ongree/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Dex%27s_Diner/Legends",
  "/wiki/Mayor/Legends",
  "/wiki/Uscru_Entertainment_District/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Nalle_triplets",
  "/wiki/Spy/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Baath_brothers/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Senate_District",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Time/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Zam_Wesell/Legends",
  "/wiki/CoCo_Town/Legends",
  "/wiki/Nerfsteak_sandwich",
  "/wiki/George_Lucas",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Pablo-Jill/Legends",
  "/wiki/Gregory_Walker",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/Oseon_system",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Dining_at_Dex%27s",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Blogs"
 ]
}