{
 "name": "Ada",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Ada was a Human female who was sold as a slave to the Black Vulkars on the planet Taris to settle her father's debt. In 3956 BBY, during the Jedi Civil War, she encountered Revan, who freed her from slavery.\nAda was a Human female who lived during the Jedi Civil War between the Galactic Republic and Sith Empire. Her father owed money to Davik Kang, the local crime-lord for the Exchange, a powerful and galaxy spanning criminal organization. To settle the debt, Kang had Ada's father killed and sold Ada into slavery to the Black Vulkars, a swoop gang that operated in the Lower City on the Outer Rim city world of Taris. She was forced to work as a waitress in the swoop gang's compound, where she was regularly harassed by the Vulkars.\nIn 3956 BBY, the former Sith Lord Revan, who lost his memories and believed himself to be a Republic soldier, entered the Vulkar base searching for a prototype swoop bike accelerator that had been stolen from the Hidden Beks, a rival swoop gang. Revan killed many of the guards in the base and eventually encountered Ada. She begged Revan not to kill her, but he assured her he wouldn't and instead wanted to ask questions. Ada told Revan about her father's debt and her ensuing slavery. Revan asked her about the prototype engine and the location of the Jedi Bastila Shan, captured and assumed by the Vulkars to be a Republic officer. Ada was unable to offer much information, but overheard some of the gang members talk about Shan being held off-base. After giving as much information as she could, Ada was allowed to leave. With the Vulkars guarding her now dead, she was able to find her way out of the base and fled into the Lower City, now a free woman.\nAda appeared as a non-player character in the 2003 video game Star Wars: Knights of the Old Republic, developed by BioWare, where she was voiced by Tara Strong. Interactions with her are optional and do not affect quests. If the player completes the \"Search for Bastila\" quest, Ada will disappear and can not be interacted with. When the player speaks to her, they may choose to free her and receive light side points or kill her and shift towards the dark side. If Carth Onasi is in the player's party when they attempt to kill her, he will prevent them from doing so and allow Ada to flee.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Black_Vulkars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Ada%27s_father",
  "/wiki/Currency/Legends",
  "/wiki/3956_BBY",
  "/wiki/Jedi_Civil_War",
  "/wiki/Revan/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Davik_Kang",
  "/wiki/Crime_lord/Legends",
  "/wiki/Exchange",
  "/wiki/The_galaxy/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Death/Legends",
  "/wiki/Swoop_gang/Legends",
  "/wiki/Lower_City",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Ecumenopolis/Legends",
  "/wiki/Waiter/Legends",
  "/wiki/Black_Vulkar_Base",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Amnesia/Legends",
  "/wiki/Republic_soldier",
  "/wiki/Prototype_accelerator",
  "/wiki/Swoop/Legends",
  "/wiki/Hidden_Beks",
  "/wiki/Bek%E2%80%93Vulkar_gang_war",
  "/wiki/Swoop_racing/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Republic_officer/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Tara_Strong",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/The_Essential_Atlas"
 ]
}