{
 "name": "Adana_(Human)",
 "display_name": "Adana  (Human)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nar Shaddaa refugees"
     ]
    }
   ]
  }
 ],
 "content": "Adana was a Human female refugee who lived in the Refugee Sector with her mother, Nadaa, on Nar Shaddaa, a moon of the planet Nal Hutta, in 3951 BBY. She and her mother were both displaced by the Jedi Civil War and Mandalorian Wars. At some point during this time, she was kidnapped by the Exchange criminal organization's overseer of the sector, a Quarren named Saquesh. While visiting the Refugee Sector, a former Jedi Knight, Meetra Surik, met Nadaa, who begged Surik to save her daughter. Surik went to meet with the overseer and attempted to intimidate him into releasing Adana. Surik was unsuccessful and was forced to slay the Quarren and his guards in order to free Adana from her prison. The young girl was overjoyed to be free and returned to her mother. Adana's mother was ecstatic to have her daughter back and thanked Surik profusely for her help.\nIn 3951 BBY, the Human female Adana lived as a refugee with her mother, Nadaa, in the Refugee Sector of Nar Shaddaa, a moon of the planet Nal Hutta covered entirely by a single city. Adana and Nadaa were refugees of the Mandalorian Wars and the Jedi Civil War. At some point during this time, Adana was kidnapped by the sector's Exchange crime boss and overseer, a male Quarren named Saquesh. Saquesh took Adana due to Nadaa's inability to pay a tribute of 600 credits to him and planned to sell Adana to the Hutts to recoup the debt.\nWhile visiting the moon in search of Jedi Master Zez-Kai Ell, Meetra Surik, a former Jedi Knight, spoke with Adana's mother, Nadaa. She told Surik that Adana was being held by the Exchange and begged Surik to help her. Surik agreed to help Nadaa rescue Adana and went to meet with Saquesh. Surik attempted to intimidate Saquesh into releasing Adana, but Saquesh was not swayed and immediately attacked Surik. The former Jedi Knight slew the Quarren and his guards and released Adana from her cell. Adana thanked her rescuer and ran off to reunite with her mother. Surik returned to Nadaa, who thanked Surik profusely for her help.\nAdana had a sarcastic streak and was fully willing to verbally abuse those she thought were Saquesh's henchmen. She had a special resentment for her captor, Saquesh, wishing to see him physically hurt. While she loved her mother and wished she could be with her again, she also thought being sold into slavery would not be so bad. She believed that anywhere was better than living in the Refugee Sector of Nar Shaddaa.\nAdana appears as a non-player character in the 2004 video game Star Wars: Knights of the Old Republic II: The Sith Lords. The reward for freeing her is a random weapon or armor upgrade component. The game offers two additional ways to rescue Adana, either through the use of Force persuasion on Saquesh, or by paying the debt. Alternatively, the player can convince Nadaa to sell herself to Saquesh to be with her daughter. This results in dark side points. Additionally, the player can convince Saquesh to sell Adana immediately. This also results in dark side points. If this path is followed, the refugee leader, Hussef, will later note that Nadaa went mad and vanished.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Refugee/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Adana/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Refugee_Sector",
  "/wiki/Parent/Legends",
  "/wiki/Nadaa",
  "/wiki/Moon/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/3951_BBY",
  "/wiki/Jedi_Civil_War",
  "/wiki/Mandalorian_Wars",
  "/wiki/Time/Legends",
  "/wiki/Exchange",
  "/wiki/Sector/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Saquesh",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Death/Legends",
  "/wiki/Prison/Legends",
  "/wiki/City/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Hutt/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Canon",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Zez-Kai_Ell",
  "/wiki/Jedi/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/2004",
  "/wiki/Video_game",
  "/wiki/Armor/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Hussef",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide"
 ]
}