{
 "name": "Adan_Dooku",
 "display_name": "Adan Dooku",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Serenno"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Dooku"
     ]
    }
   ]
  }
 ],
 "content": "Adan Dooku was a male Human who served as count of House Dooku. When his father died, Adan was too young to become Count so his mother became the regent of the House Dooku. This position was short-lived; Adan's uncle, the former Jedi Master Dooku, claimed the title, and he and his mother were forced into self-exile on the planet Alderaan. He lived for many years on the planet, even becoming a good friend of Bail Organa, and returned to Serenno in order to claim his hereditary title only when his uncle was killed during the Clone Wars. Later, Adan had a son named Bron before widowed from his wife Maite. However, Dooku's appointment as the Count of Serenno conflicted with the interests of rival families, such as the House Borgin; Adan would eventually be murdered on Alderaan by Imperial Intelligence agent Jahan Cross under the orders of the Galactic Empire, who worked in the interest of Rodas Borgin.\nAdan Dooku was born into the House Dooku, a powerful and influential family on the planet Serenno. Dooku was next in line to be the Count following his father; however, when Dooku's father passed away, he was still too young to inherit the title. Thus, Dooku's mother opted to hold to position of regent in the absence of a proper male Count. This was disrupted by the return of her brother-in-law, a fallen Jedi Master now known as the Sith apprentice Darth Tyranus, to Serenno. Dooku sought the title for himself, which led to the exile of Adan and his mother to the planet Alderaan, where they were taken in by the House of Organa.\nAs Serenno was now in line with the Confederacy of Independent Systems, Dooku remained on Alderaan through the Clone Wars until 19 BBY, becoming friends with Viceroy Bail Organa. After Dooku's uncle was killed by the Jedi Knight, Anakin Skywalker, during the final stages of the Clone Wars, Dooku returned to Serenno to claim the vacant title of Count, much to the disdain of the other Serenno houses, who saw no value in a Count that was raised on another planet.\nShortly after the Clone Wars ended and Dooku returned to his homeworld, however, the servant of the new Emperor, Dark Lord of the Sith Darth Vader, arrived with a complement of stormtroopers. Vader had previously discussed the Galactic Empire's role with Serenno, but had not told the young Count of his true intentions. Vader declared that since all of the other great houses had allied themselves with the deceased Dooku, they must purge the traitors in their midst by executing the current heads of every house. Dooku vehemently protested, but could do nothing as Vader revealed the final part of the deal—the sons must kill their own fathers, in order to ascend, and if anyone resisted, all of them would be killed. Rodas Borgin was the first to act, stabbing his own father in the back. As Dooku watched in horror, the rest of the sons followed suit, massacring the assembled nobles. Afterward, the lot of them were forced to kneel in their parents' blood and swear fealty to Lord Vader and the Empire.\nIn time, Dooku bore an heir, Bron Dooku, with his wife, Maite.\nEventually, Dooku was branded as a target for assassination by an individual within the Imperial hierarchy, in cooperation with Borgin of House Borgin. Imperial agent Jahan Cross was sent to complete the job. Around 3 BBY, Dooku attended the twenty-fifth anniversary of the Alderaan Ascendancy Contention in Aldera. Cross, a native of Alderaan, used this opportunity to his advantage, attending the celebration under the guise of reacquainting with Viceroy Bail Organa, who was also a close friend of Dooku's. During the event, Organa found some time to speak to Dooku in solitude, attempting to persuade the Count to join the growing insurrection against the Galactic Empire. Organa believed the Count had great influence, despite the second guesses of the Count himself due to his upbringing on Alderaan and the conflict his origins had caused with the other Houses of Serenno.\nMeanwhile, Cross, donning a fake suit of Mandalorian armor created by Imperial Intelligence to impersonate Boba Fett, positioned himself on an adjacent rooftop with a sniper rifle and took aim at the Count through one of the room's windows. Candra Tymon—the head of Dooku's private security force—who had been ordered outside while Organa presented his plea of rebellion, saw the laser sight on the rifle and attempted to warn Dooku, but she was too late. The shot hit Dooku directly in the heart after narrowly passing Tymon's right shoulder and breaching the room's window. Dooku's young son, Bron, witnessed the murder, as he had been awoken by the arguing between his father and Organa. Tymon pursued Dooku's assailant across the rooftops, ordering emergency medics to his room as she exchanged fire with the faux Mandalorian. Cross fled, disposing of the Mandalorian armor in a local pond, where it dissolved, effectively eliminating any evidence of the perpetrator.\nAfter his sudden murder, Dooku's son, Bron, was appointed the new Count of Serenno. However, as he was too young to fulfill his duty, a regent was to be put in place. The Galactic Empire continued to work in the interest of the House Borgin to ensure Rodas Borgin's appointment as the temporary ruler.\nCount Dooku believed himself to have minimal influence; however, his friends in the Galactic Senate, including Bail Organa, saw his worth as a powerful and influential potential ally. Dooku was neutral to Imperial rule during his time as Count; he continually rejected his peers' notion of rebellion against Galactic Emperor Palpatine's growing influence, despite making himself out to be what Bail Organa deemed a coward.\nAdan Dooku first appeared in the second story arc of Agent of the Empire, Hard Targets, in 2012. The series, which stars suave Imperial agent Jahan Cross, is modeled after the James Bond franchise, containing many of the tropes featured throughout that franchise's twenty-three films. Christopher Lee, who portrayed Adan's uncle in the Star Wars prequel trilogy, portrayed the titular character in the Bond film The Man With the Golden Gun.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Serenno/Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_Dooku",
  "/wiki/Count/Legends",
  "/wiki/Dooku%27s_brother",
  "/wiki/Kostanza_Dooku",
  "/wiki/Regent/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Bron_Dooku",
  "/wiki/Maite_Dooku",
  "/wiki/House_Borgin/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Jahan_Cross",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Rodas_Borgin",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Viceroy/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Cleansing_of_Serenno",
  "/wiki/Assassin/Legends",
  "/wiki/House_Borgin",
  "/wiki/25th_anniversary_of_the_settling_of_the_Alderaan_Ascendancy_Contention",
  "/wiki/Alderaan_Ascendancy_Contention",
  "/wiki/Aldera/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Mandalorian_armor/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Sniper_rifle/Legends",
  "/wiki/Candra_Tymon",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Rise_of_the_Empire_era",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Star_Wars:_Agent_of_the_Empire%E2%80%94Iron_Eclipse",
  "/wiki/Star_Wars:_Agent_of_the_Empire%E2%80%94Hard_Targets",
  "/wiki/2012",
  "/wiki/Christopher_Lee",
  "/wiki/Prequel_trilogy",
  "/wiki/Category:Images_of_Adan_Dooku",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_1",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_2",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_4",
  "/wiki/Count_of_Serenno/Legends",
  "/wiki/Orom_Malvern",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_5"
 ]
}