{
 "name": "Adaroo",
 "display_name": "Adaroo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Khorm"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Khormai"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Khormai resistance"
     ]
    }
   ]
  }
 ],
 "content": "Adaroo was a male Khormai from Khorm who served as leader of the Khormai resistance during the Clone Wars. He assisted Jedi Masters Plo Koon and Kit Fisto during the Battle of Khorm.\nAround 22 BBY, Adaroo decided to help the Republic after Jedi Master Plo Koon promised to free the trapped Khormai and reclaim the planet from the Separatists. Adaroo told Master Koon that his personal nemesis, Unger Gout had allied with Count Dooku in order to gain more power and enslave the Khormai in the mines of agrocite.\n\nThe Separatists controlled a climate-control station which caused the extreme storms in the planet. Adaroo, Jedi Master Plo Kloon, Jedi Master Kit Fisto and a squad of the 44th Special Operations Division where assigned to seek and destroy the station. When they passed through a Khormai village, Adaroo stopped and noticed that some of the villagers were killed due to the extreme changes in weather. Adaroo mourned the lost and decided to give them a proper burial. When they were done with the funeral, they continued their mission on foot and Adaroo guided them across the vast mountains to where the station was located. On the way there, they where ambushed by Asajj Ventress and her squad of droids. After they survived the ambush, Adaroo used an aelid horn and called several aelids to be used as mounts for him and the rest of the group. The mounts provided a faster way to cross the mountains in order to get to the climate-control station as fast as possible. Once they arrived at the station, it was successfully destroyed and the storm ceased.\nWhen they reached the mines, Kit Fisto and Sharp went to destroy the guns that fired on the clone transport ships, while Adaroo, Plo Kloon and the other two troopers that survived, went to free the Khormai. Once inside the mines, they encountered Asajj Ventress again. Plo Kloon stayed and fought the dark acolyte and they three continued further into the mine until the Khormai prisoners were found. When all the droids that guarded the prisoners withdrew to Kit Fisto and Sharp's location, Adaroo took the opportunity and freed the Khormai people. Once the battle was over, he thanked the Jedi for the aid they provided.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Khorm/Legends",
  "/wiki/Khormai/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Khormai_resistance",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Battle_of_Khorm/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Unger_Gout",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Agrocite/Legends",
  "/wiki/44th_Special_Operations_Division",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Aelid_horn",
  "/wiki/Aelid",
  "/wiki/Sharp",
  "/wiki/Transport_Ship",
  "/wiki/Dark_Acolyte/Legends",
  "/wiki/The_Clone_Wars_7",
  "/wiki/The_Clone_Wars_8",
  "/wiki/The_Clone_Wars_9",
  "/wiki/Star_Wars:_The_Clone_Wars:_In_Service_of_the_Republic",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}