{
 "name": "Adari_Vaal",
 "display_name": "Adari Vaal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 4975 BBY and 2975 BBY",
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Keshiri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Silver",
      "later white"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Violet"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Keshiri resistance"
     ]
    }
   ]
  }
 ],
 "content": "Adari Vaal was a Keshiri female geologist who led a resistance movement against the Lost Tribe of Sith on the planet Kesh in the years after the Great Hyperspace War. A widow with two sons, in 5000 BBY, Vaal was vilified by the Keshiri public for teaching that the Keshiri landscape was created by volcanic eruptions, not by the gods as was commonly believed. Placed on trial for heresy by the Neshtovar ruling council, Vaal's home was besieged by angry mobs, forcing her to flee into the mountains. There, she stumbled upon a group of stranded Sith who had crash-landed on Kesh, led by their captain, Yaru Korsin. Korsin convinced Vaal to help them escape their dire predicament—Vaal acquiesced and led the Neshtovar to the Sith's mountain encampment. The Sith posed as the Keshiri gods known as the \"Skyborn\" and gained the complete allegiance of the Keshiri masses, while Vaal became an honored member of the new Sith government. Forging a close relationship with Korsin, Vaal became known as the Daughter of the Skyborn and served as a liaison between the new Lost Tribe of Sith and their Keshiri subjects.\nHowever, all that changed in 4987 BBY when Vaal's son Finn was killed in an accident while working for the Sith, and Korsin failed to save his life. A new opposition to the Lost Tribe regime awoke in Vaal, and she became the leader of a covert resistance group dedicated to bringing down the Lost Tribe's rule. The resistance worked in secret for a dozen years, and in 4975 BBY, Vaal decided it was time to strike. She formulated a plan of attack that would ensure her own death, as she and thousands of other riders would sacrifice the avian uvak beasts that were essential for the Tribe's hold over Kesh, setting up an armed uprising. However, when zero hour came, the number of riders was much lower than expected—Vaal's son Tona, who was privy to the plan, had fallen for Korsin's daughter Nida and had divulged the details of the plot. Vaal gravely soldiered on with her plan, but instead of leading the uvak to a watery grave, she instead ended up with about 300 surviving riders on an uninhabited island far off the coast. From there, she eventually made her way across the ocean to the previously unknown continent of Alanciar, where she spent her final days. Vaal, who became known there as the Rock of Kesh or as The Herald, went on to be a respected author and leader in Alanciar, who warned of the Sith threat across the sea.\nThe Keshiri female known as Adari was born to a mother named Eulyn on the remote, isolated Wild Space planet, Kesh. As a younger woman, Adari discovered an interest in rocks and made geology her profession. At some point, she married a man named Zhari Vaal, a member of the Keshiri ruling council, the Neshtovar. Although she consented to the marriage and took the name \"Adari Vaal,\" she had no real interest in her husband—the union had only come about after years of lobbying by Eulyn, who hoped to secure their future position. As Keshiri property descended matrilineally, Vaal became very well-off, gaining possession of uvak beasts and a wooden house in the capital city of Tahv. However, her marriage with Zhari was an unhappy one, lasting nine years and producing two sons, Tona and Finn. Vaal was content to leave the children to be cared for by Eulyn while she pursued her geology work. Her marriage came to an abrupt end when Zhari died in an uvak-riding accident, when the family uvak, Nink, dropped him into the ocean. Believing that she had done her duty by marrying and having children, furthering the Keshiri bloodline, Vaal was now free to pursue her true passion, her geology work.\nVaal went on to study rocks from all over Kesh, and by comparing samples found in the Sessal Spire volcano with those commonly found near her home, she made a startling discovery. Although it was commonly believed by Keshiri that, in ancient times, a Great Battle between the divine groups known as the Skyborn and the Otherside resulted in the creation of Kesh's landmass, the striking similarity between the two samples indicated to her that it was lava flow that had created the land. She began to teach these findings to students, but word soon reached the general public, and she was called to defend her views in front of the Neshtovar. Ironically, Vaal's findings were partially as a result of Neshtovari help, as a sympathetic rider had volunteered to bring her samples from the nearby Cetajan Mountains. Denounced as a heretic—even by her own mother—Vaal became a pariah in Keshiri society, and groups of angry citizens descended upon her home and showered it with projectiles. Her trial lasted three days, and although she passionately defended her work, her ideas were dismissed and ridiculed by Neshtovar leader Izri Dazh. On the third day, as she argued with Dazh, a massive explosion rocked the Cetajan Mountains. Like most in attendance, Vaal fled to her home at first, but her domicile was soon surrounded by angry Keshiri who had decided that her blasphemous words had brought the anger of the Skyborn upon them. Vaal sent Eulyn and her children to stay at her uncle's house, but she soon saw the townsfolk brandishing torches. Fearing for her life, Vaal fled on Nink's back, flying the uvak away from the crowd and into the mountains.\nAlthough completely inexperienced on the back of an uvak, Vaal was able to evade pursuit by the Neshtovar, aided by Nink's insistence on flying far out over the ocean. Nink stopped at a seaside mountain roost, where Vaal collapsed with exhaustion—when she awoke, she was astounded to find that the uvak was still by her side. She realized that she was close to the source of the explosion and felt compelled to examine the mountain up close. When she flew over the range on Nink, instead of finding a volcanic crater, she discovered something completely different. A massive metallic shell had slammed into the side of the mountain, and below it, she saw a man holding some sort of red light. Shocked and confused, Vaal doubled back, only to find the man dropping something over the side of the precipice. The airborne object fell by at a tremendous speed, startling Nink and causing Vaal to lose her balance. Although she fell off Nink's back, Vaal was able to grab hold of the uvak's foot and held on until the beast reached their seaside perch. Later that night, as she gazed toward the mountains, she saw a cluster of fires that had clearly been set. Although she initially feared that the Neshtovar had found her, she received a strange calming message from the mountains and felt compelled to come closer. As she traversed a gully toward the fires, she started to make out figures not far away. Suddenly, an unknown force hoisted her into the air and slammed her into a tree, and the figures revealed themselves to be people like the man she had seen before on the mountain. Dazed and frightened, Vaal was carried back to their camp.\nUpon reaching the source of the bonfires, Vaal's abductors set upon her, attacking her mind in an attempt to extract information about Kesh. One attacker in particular, a woman carrying her child, was especially relentless, driving Vaal to immense pain and distress. The attack subsided upon the arrival of a man, obviously their leader. Although Vaal was initially struck by his resemblance to her late husband Zhari, she soon recognized him as the man whom she had seen previously on the mountain. He introduced himself as Yaru Korsin, just as Vaal blacked out. Over the next few days, Vaal was nursed back to health by the strange visitors, though for a time she was so traumatized that she could not speak. Eventually, she began to converse with Korsin through a translator named Hestus. The two shared information about their respective situations, and Vaal learned that Korsin was the leader of a group of Sith who had crashed on Kesh in their starship, the silver shell that Vaal had seen before. In exchange, Vaal told Korsin all she knew about Kesh and the Keshiri, even once sheepishly mentioning the Skyborn. Korsin soon made it clear to her that the Sith needed to reach the mainland, as they were in an extremely perilous situation in the mountains. Vaal offered to take her leave on Nink and return with help, and though the mother that had attacked her so viciously, Seelah, argued against the idea, her proposal was accepted by Korsin.\nVaal's mission lasted only a day. After she took off, Vaal stopped below the mountain to examine what it was that she had seen Korsin throw over the side of the cliff. There, Vaal saw the dead body of a Human, just like the other Sith. She proceeded on, finding some nearby uvak-riders and leading them into the mountains. Backed by 240 Sith armed with lightsabers, Vaal had effectively forced the end of the Neshtovar's pursuit, and she journeyed to Tahv with the group. The Sith, ever-cunning, found a way to exert their will over the Keshiri—they posed as the Skyborn, returned to Kesh, and through use of their powers with the Force, gained the complete support and adulation of the Keshiri people. Korsin honored Vaal as the \"Daughter of the Skyborn,\" and although she knew that they were not gods, she went along with the ruse. In the days after the arrival of the \"Skyborn,\" the Neshtovar moved out of their homes, yielding them to the Sith. All left but Vaal, who was allowed to stay in Zhari's house, which kept her close to Korsin as she took on an informal role of ambassador and aide. She spent much time with Korsin, eventually accompanying him on a dig for precious metals needed to repair their ship, the Omen. Vaal humored Korsin's optimism for an escape from Kesh, knowing that the metals that he sought would not be found anywhere on the planet. However, Vaal knew she had unfinished business with Korsin—she needed to know what happened when she first saw him on the mountain, and whom he had tossed over the cliff. She confronted Korsin with this information and realized that the dead man was Korsin's brother, the father of Seelah's child. Korsin defended his actions and asked Vaal to forget about what she had seen while promising her a great future among the Sith. Indeed, Vaal's legacy seemed to be secure: as the \"Discoverer,\" she would be remembered for all-time by the Keshiri.\nOver the ensuing years, Vaal became quite close to Korsin, although Seelah, now Korsin's wife, never lost her distrust of the Keshiri. The two went on frequent walks together in the mountains, initially due to her status as ambassador and intermediary for the new Lost Tribe of Sith. Even after her duties ebbed, their jaunts continued, including the occasional uvak-flight. Although there was nothing romantic about their relationship, Vaal made an effort to improve her appearance, including wearing vor'shandi face markings. Though the topics of their conversations were generally mindless, Vaal learned much about the galaxy and the Force from Grand Lord Korsin. In 4987 BBY, her relationship with Korsin was altered irrevocably. In general, the Keshiri were completely devoted to the Sith and constantly labored to create homages to them—although he did not have to work, Vaal's son Finn insisted on joining one of these crews upon reaching his teens. A shabbily-constructed scaffold collapsed, mortally wounding Finn. In a desperate attempt to save her son, Vaal brought him to Korsin, hoping that he could heal him with his Sith magic. Despite his best efforts, Korsin failed. Although she had previously enjoyed their friendship, Finn's death rattled her conscience, and she became wholly opposed to the rule of the Sith. Soon after the family tragedy, Vaal started a resistance group with other like-minded Keshiri. She employed a network of informants, including Seelah Korsin's personal aide Tilden Kaah, in order to gather information on the doings of the Lost Tribe, as well as commanding a large amount of Yaru Korsin's time. Vaal worked covertly to further the resistance's goals—for example, in 4985 BBY, she secretly supported a Seelah Korsin–engineered purge of the pureblood Sith from the Lost Tribe.\nBy 4975 BBY, after a dozen years of scheming and plotting, Vaal and her Keshiri resistance were finally ready to act. That year, the Sith announced their intention to live among the Keshiri for good with a massive celebration at Tahv's Circle Eternal plaza, where Vaal, the Daughter of the Skyborn, was honored. By then her movement had grown to include dozens of Keshiri, ranging from commoners to Neshtovar, and included her only surviving son, Tona. After the ceremony, a select few gathered at Izri Dazh's old home to discuss their final plan to destroy the Lost Tribe's hold over Kesh. Vaal had come to realize that the uvak were the key to the Sith's power, allowing them to be highly mobile so they could unleash their considerable wrath upon any dissenters. Kesh's sprawling landmass worked against them, and would completely cripple the Sith should the uvak be eliminated. Many affiliated with the resistance worked as stable hands or laborers, giving them access to uvak—when the day came, instead of tending to the uvak, they would steal them. Led by Vaal on the back of Nink, they would fly into the jet stream near the Sessal Spire, which would send them all to a watery grave in the ocean below. The Sith, bereft of their transportation, would then be vulnerable. The resistance planned to seize this opportunity, attacking the Lost Tribe with shikkar blades in the night. They believed that the Sith would likely engage in open warfare, but the Keshiri would have a massive advantage in both terrain and numbers, and hopefully would reclaim control of Kesh.\nThe day after their meeting in Dazh's home, Vaal took to the skies, her plan underway. At the Kesh Sith Temple high in the mountains, stablehands stole the Lost Tribe's uvak, just as planned. However, although many uvak joined her group, the huge wave of beasts she expected never appeared. The riders settled at the foot of the Spire, and at nightfall a lone rider arrived from Tahv with bad news. Tona, who had been tasked with keeping tabs on Korsin's daughter Nida, had instead fallen for her, and had revealed the resistance's plan. Vaal, despondent, flew toward the jet stream, followed by the thousand or so riders who had arrived by then. Vaal fell asleep, expecting Nink to surrender to gravity. Instead, she awoke with about 300 surviving riders on a barren island, Nink having collapsed from exhaustion during the night. With no way back, Vaal and the others committed to living on the island, although with little vegetation, she did not expect them to survive the year. Yet she eventually made her way across the sea to the previously unknown continent of Alanciar, populated by other Keshiri tribes. Vaal found Alanciar, technologically advanced and with considerable natural resources, preferable to her home on the land of Keshtah. She warned the Keshiri there of the dangers of the Sith waiting on the other side of the world.\nVaal's teachings were compiled in a tome known as the Keshtah Chronicles, which became a popular and seminal work in Alanciari culture. She also produced other writings during her time in Alanciar, including biographical works on the Sith, a detailed description of Keshtah, and a comparison of the minerals of both continents, which included her theory that a Great Cataclysm severed access between Keshtah and Alanciar. Before the end of her life, Vaal also put together her personal memoirs, written sometime before her death. The memoirs contained a wealth of personal information written from Vaal's own perspective, deeply describing her family, her interactions with the Korsins, and the shock of being contacted through the Force for the very first time. Privately, Vaal admitted that her strength had failed her when she first met Korsin—these private thoughts contradicted her public image as an unyielding pinnacle of inner fortitude.\nAfter her eventual death, Vaal became a revered figure among the residents of Alanciar, who honored her as the \"Herald\" and the \"Rock of Kesh.\" To honor Vaal, the people of Alanciar celebrated her in a festival called Observance Day, held once every ten years. Back home, Vaal was remembered as Yaru Korsin's confidante and plaything, who disappeared to a watery grave. But in 2975 BBY, two thousand years after Vaal's ill-fated uprising, Alanciar was visited for the first time by the Lost Tribe, who had learned of its existence from an ancient map drawn by Yaru Korsin himself. The Sith incursion happened to come on Observance Day, revealing Vaal's further exploits as the Herald to the Lost Tribe. By then, long after her death, Vaal was a heroic figure in Alanciar. Much like Korsin in Keshtah, her name graced buildings and monuments such as Vaal Hall in the city of Sus'mintri, and she was portrayed in plays celebrating her life in Alanciar. Within Vaal Hall, her secret library was hidden behind a tapestry bearing her likeness. Among the writings found there included her personal memoirs—her admittance of private weakness caused disappointment when revealed to the masses by Alanciar native Jogan Halder, who was subsequently proclaimed as the new Herald.\nAdari Vaal held a strong conviction to her beliefs, never bending even when she found them to be extremely unpopular or even offensive to others. As such, she was not given to compromise, never ending her fight with the Neshtovar for scientific truth, or for freedom from the Sith. She would not be easily intimidated, though she was not completely indomitable—her inner strength did fail her when she first faced Yaru Korsin. Although she held no affection for her late husband Zhari, Vaal loved her children, but was dismissive of their intelligence, privately believing that they reminded her too much of Zhari. Above all, she was most focused on her work as a geologist, regarding it as the most important thing in her life. Vaal had a keen eye for rocks, which served her well in her field and eventually helped her to finish her groundbreaking work on the origin of Kesh's landmass. In turn, she was not nearly as religious or superstitious as most Keshiri, preferring science over tradition. Vaal despised Izri Dazh and the Neshtovar, seeing them as an outdated, useless entity. At first, she was terrified by the Sith and their seemingly impossible power, and revolted by the appearance of the pureblood Sith. However, she found herself calmed by Yaru Korsin, with whom she would forge a complicated, to say the least, relationship. Vaal very much admired his sharp mind, but though she saw him as smart, charming, and clever, she also believed him to be vain, ruthless, and sadistic, and she pledged her life to defeating him. Vaal's ire for Korsin, and the Sith in general, was partially fueled by his failure to save her son Finn's life—it was not until that event that she began truly fighting against them.\nAlthough Vaal was in awe of the Sith's power, she never truly believed in their infallibility—part of the reason that she had so much hope that they could be defeated. By having stumbled across the Sith weak and dying in the mountains, Vaal had a perspective different from the other Keshiri, who merely knew of the Sith as the Skyborn mysteriously returned from on high. Aiding Vaal in her quest to overthrow the Sith was her cunning and craftiness; she was able to hide her covert activities from the Sith for decades. She was also driven by an anger and hatred of the Sith, and a sense of responsibility as the person who had brought the \"plague\" of the Sith upon Kesh. Possessed of a certain sense of sarcasm, Vaal had a very nimble mind and, as Korsin put it, the will of a Sith, even if she did not share their beliefs. Indeed, despite her hatred of the Sith, she never lost her awe of their power, and even as late as the time of her son Finn's death had faith that they could do anything. Vaal, like all Keshiri, had violet skin and silver hair that later turned white in her old age.\nThe character of Adari Vaal was created by John Jackson Miller for his eBook series Lost Tribe of the Sith. Although Vaal made her first appearance in 2009's Lost Tribe of the Sith: Precipice, she was not named until the following installment, Skyborn. She went on to make appearances in two subsequent sequels, Paragon and Savior. Substantial information on her later life was also given in the series finale, Pandemonium. Adari Vaal was originally named \"Adair,\" but that was changed by Miller, as he believed it sounded too earthly. In 2012, Vaal was first pictured in Pablo Hidalgo's reference book The Essential Reader's Companion, in which she was illustrated by Darren Tan.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Keshiri",
  "/wiki/Gender/Legends",
  "/wiki/Vaal_(disambiguation)",
  "/wiki/Kesh",
  "/wiki/4975_BBY",
  "/wiki/2975_BBY",
  "/wiki/Color/Legends",
  "/wiki/Keshiri_resistance",
  "/wiki/Geology",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Zhari_Vaal",
  "/wiki/Finn_Vaal",
  "/wiki/Tona_Vaal",
  "/wiki/5000_BBY/Legends",
  "/wiki/Volcano/Legends",
  "/wiki/Skyborn",
  "/wiki/Keshiri_religion",
  "/wiki/Neshtovar",
  "/wiki/Vaal_family_home",
  "/wiki/Takara_Mountains",
  "/wiki/Sith/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Yaru_Korsin",
  "/wiki/Mountain/Legends",
  "/wiki/Deity/Legends",
  "/wiki/4987_BBY",
  "/wiki/Death/Legends",
  "/wiki/Time/Legends",
  "/wiki/Uvak",
  "/wiki/Keshiri_uprising_in_Keshtah",
  "/wiki/Standard_hour/Legends",
  "/wiki/Nida_Korsin",
  "/wiki/Water/Legends",
  "/wiki/Unidentified_Kesh_island",
  "/wiki/Ocean/Legends",
  "/wiki/Alanciar",
  "/wiki/Standard_day/Legends",
  "/wiki/Author/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Eulyn",
  "/wiki/Wild_Space/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Tahv",
  "/wiki/Nink_(uvak)",
  "/wiki/Blood/Legends",
  "/wiki/Sessal_Spire",
  "/wiki/Great_Battle",
  "/wiki/Otherside",
  "/wiki/Magma/Legends",
  "/wiki/Unidentified_Neshtovar_rider",
  "/wiki/Izri_Dazh",
  "/wiki/Adari_Vaal%27s_uncle",
  "/wiki/Sleep/Legends",
  "/wiki/Omen",
  "/wiki/Sith_lightsaber/Legends",
  "/wiki/Devore_Korsin",
  "/wiki/Limb/Legends",
  "/wiki/Fire/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Human/Legends",
  "/wiki/Seelah_Korsin",
  "/wiki/Jariad_Korsin",
  "/wiki/Hestus",
  "/wiki/Starship/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Aide/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Vor%27shandi",
  "/wiki/The_galaxy/Legends",
  "/wiki/Grand_Lord",
  "/wiki/Force_healing/Legends",
  "/wiki/Sith_magic",
  "/wiki/Tilden_Kaah",
  "/wiki/4985_BBY",
  "/wiki/Red_Sith_Purge",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Circle_Eternal",
  "/wiki/Shikkar",
  "/wiki/Kesh_Sith_Temple",
  "/wiki/Unidentified_Keshiri_rider",
  "/wiki/Gravity/Legends",
  "/wiki/Plant/Legends",
  "/wiki/Keshtah_Minor",
  "/wiki/Book/Legends",
  "/wiki/Keshtah_Chronicles",
  "/wiki/Great_Cataclysm",
  "/wiki/Adari%27s_personal_memoirs",
  "/wiki/Unidentified_Keshiri_actress",
  "/wiki/Observance_Day",
  "/wiki/Map/Legends",
  "/wiki/Vaal_Hall",
  "/wiki/Sus%27mintri",
  "/wiki/Library_of_Adari_Vaal",
  "/wiki/Tapestry_of_Adari_Vaal",
  "/wiki/Jogan_Halder",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/John_Jackson_Miller",
  "/wiki/EBook",
  "/wiki/Star_Wars:_Lost_Tribe_of_the_Sith",
  "/wiki/2009",
  "/wiki/Lost_Tribe_of_the_Sith:_Precipice",
  "/wiki/Lost_Tribe_of_the_Sith:_Skyborn",
  "/wiki/Lost_Tribe_of_the_Sith:_Paragon",
  "/wiki/Lost_Tribe_of_the_Sith:_Savior",
  "/wiki/Lost_Tribe_of_the_Sith:_Pandemonium",
  "/wiki/2012",
  "/wiki/Pablo_Hidalgo",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Darren_Tan",
  "/wiki/Lost_Tribe_of_the_Sith:_Secrets",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/July_21",
  "/wiki/September_22",
  "/wiki/2017"
 ]
}