{
 "name": "Addath_Gadan",
 "display_name": "Addath Gadan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vannix"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Addath Gadan was a female Human senator of the New Republic. She represented Vannix, serving from 8 ABY until 27 ABY, when she lost an election to Apelben Werl.\nDuring the Battle of Coruscant, Senator Gadan fled the planet, eventually turning up again on Vannix in the middle of a power vacuum left when Presider Sakins heard news of the fall of Coruscant at the hands of the Yuuzhan Vong, fleeing the planet with his family, mistresses, and most of the treasury. An election was held for the vacant post of planetary Presider between Senator Gadan and Apelben Werl, a naval officer. In the campaign, Addath Gadan ran on a policy of appeasement and capitulation with the Yuuzhan Vong, while Admiral Werl advocated resistance.\nLeia Organa Solo visited the planet to set up a resistance movement after the fall of Coruscant. Though Senator Gadan was ahead in the polls at time of Leia's arrival, Leia worked behind the scenes to shift public opinion in favor of Admiral Werl. She planted a recording in R2-D2 and then took him in for repairs, in such a way so that the recording would be sure to fall into the hands of Gadan's political operatives. The recording strongly implied that a backroom deal had been made between Leia and Werl, promising starships for the war effort in exchange for political support. In Gadan's eagerness to outbid Werl's purported bribe, she exposed a counter-bribe of her own in front of holojournalist Fasald Ghem. Rather than endure the scandal, she followed former Presider Sakins into self-imposed exile.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Addath_Gadan",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Addath_Gadan",
  "/wiki/Vannix",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Senator/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/27_ABY/Legends",
  "/wiki/Apelben_Werl",
  "/wiki/Battle_of_Coruscant_(Yuuzhan_Vong_War)",
  "/wiki/Planet/Legends",
  "/wiki/Presider",
  "/wiki/Sakins",
  "/wiki/Coruscant/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Admiral/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/R2-D2/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Holojournalist/Legends",
  "/wiki/Fasald_Ghem",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_II:_Rebel_Stand",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}