{
 "name": "Adea_Rite",
 "display_name": "Adea Rite",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Chandrila"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Adea Rite was a female human who served as Admiral Rae Sloane's personal assistant after the Battle of Endor. She was present during the abortive Imperial emergency summit on the planet Akiva. Rite was taken captive by New Republic forces during the Rebellion on Akiva. However, Fleet Admiral Gallius Rax arranged her escape and Rite found herself serving Admiral Sloane again. In secret, Rite was an undercover agent of Rax, whose agenda for the Empire clashed with Sloane's personal beliefs. Rite died while attempting to kill Sloane during the attack on Chandrila.\nDuring the Age of the Empire, Adea Rite served as Admiral Rae Sloane's personal assistant. Her job was to hand Sloane papers, fetch cups of caf, ask for signatures, and deliver communications, but she longed to be more, to deepen her service to the Galactic Empire. She worked closely with Sloane and the two grew to respect each other, with Sloane wishing there were more Imperials like her and Rite admiring Sloane greatly. She found that there was no better time to be alive, because in the cracks of the Empire there was room for advancement for people like her.\nOn Akiva, during the meeting of the Imperial Future Council, Rite kept Sloane up to date on the events taking place on the planet, which were growing more tumultuous by the day. When Captain Wedge Antilles escaped their custody on Akiva, she went to chase him down personally, but was ambushed and injured by the Rebel pilot. She continued to serve Sloane, and was on the Golden Harp, their escape vessel, when it crash landed on the Vigilance. She was then captured by the New Republic.\nFleet Admiral Gallius Rax saw to it personally that she never found herself in a prison cell on Chandrila, the capital world of the New Republic. Rite returned to assist Sloane once again, aboard the Executor-class Star Dreadnought Ravager. Because Sloane did not trust Rax, who served as her new advisor, she asked Rite to investigate his past as well as to catalog all ships in the Imperial service at the time of Emperor Sheev Palpatine. Rite was also tasked with writing a proposal for a new breeding program.\nUnknown to Sloane, Rite was monitoring all of Sloane's activities and reporting them to Rax, her secret lover. Rite accompanied Sloane to the Liberation Day Peace Talks on Chandrila. As Sloane discovered that the intended peace initiative on Chandrila, orchestrated by Rax, was a ploy for using prisoners of war to attack Chancellor Mon Mothma and the Galactic Senate, she was furious and vowed to destroy Rax. Hearing this, Rite attempted to assassinate Sloane, who had realized that her own assistant betrayed her. Sloane shot Rite in the chest and fled the planet.\nAdea Rite was a young Corellian human female who grew up on Coruscant and served in the Imperial Navy following the Battle of Endor. She served as a personal assistant to Admiral Sloane but longed to deepen her service to the Empire. She grew to respect Sloane for her selfless service and commitment to the Empire. Rite regarded the chaotic aftermath following Endor as an opportunity to advance her career in the Empire. As a staunch Imperial loyalist, Rite opposed the New Republic and sought to make a name for herself by recapturing the starfighter pilot Wedge Antilles. Despite her training in unarmed combat, she was defeated by Antilles.\nWhile outwardly loyal and devoted to Admiral Sloane, Rite was a secret agent of Fleet Admiral Gallius Rax, who had differences of opinion with Sloane on Imperial strategy and tactics. She had a romantic relationship with her secret benefactor and was loyal to him. Rite was even willing to kill her employer Admiral Sloane to prove her loyalty to Rax.\nAdea Rite first appeared as a minor antagonist in Chuck Wendig's 2015 novel Aftermath. She also appeared in the novel's 2016 sequel Aftermath: Life Debt.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Corellia",
  "/wiki/5_ABY",
  "/wiki/Chandrila",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Aide",
  "/wiki/Battle_of_Endor",
  "/wiki/Emergency_summit_on_Akiva",
  "/wiki/Planet",
  "/wiki/Akiva",
  "/wiki/Prisoner",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/Fleet_Admiral",
  "/wiki/Gallius_Rax",
  "/wiki/Agent",
  "/wiki/Death",
  "/wiki/Attack_on_Chandrila",
  "/wiki/Imperial_Era",
  "/wiki/Paper",
  "/wiki/Caf",
  "/wiki/Time",
  "/wiki/Imperial_Future_Council",
  "/wiki/Standard_day",
  "/wiki/Captain",
  "/wiki/Wedge_Antilles",
  "/wiki/Rebel_pilot",
  "/wiki/Golden_Harp",
  "/wiki/Starship",
  "/wiki/Vigilance_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Prison",
  "/wiki/Capital",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Ravager",
  "/wiki/Advisor",
  "/wiki/Imperial_Military",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Writing",
  "/wiki/Liberation_Day_(New_Republic)",
  "/wiki/Imperial%E2%80%93Republic_peace_talks",
  "/wiki/Chancellor_(New_Republic)",
  "/wiki/Mon_Mothma",
  "/wiki/New_Republic_Senate",
  "/wiki/Assassin",
  "/wiki/Corellian",
  "/wiki/Imperial_Navy",
  "/wiki/Endor",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Chuck_Wendig",
  "/wiki/2015",
  "/wiki/Aftermath_(novel)",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}