{
 "name": "Adelade",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3630 BBY",
      "Makeb"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Cult of Gethul"
     ]
    }
   ]
  }
 ],
 "content": "Adelade was a Human female Jedi Master of the Galactic Republic. Following the death of the Eternal Empire's Empress Vaylin and the formation of the Eternal Alliance in 3631 BBY, she received precise coordinates to a location on Makeb from an anonymous source. The mysterious intel claimed that one of the Force's greatest mysteries was buried there and Adelade took a team to investigate. What they found, however, was Gethul, a creature of an unknown origin and immense power that hibernated beneath the planet's surface for millenia. Hearing Gethul's \"song\", Adelade and her followers fell under Gethul's sway, forming a Cult of Gethul and attempting to fully awaken the creature. Learning of this and fearing that in its full power Gethul could destabilize Makeb's core and obliterate the planet, Alliance military Admiral Bey'wan Aygo sent a strike team to stop Adelade's plan. The team was engaged by the cultists of Gethul, as well as Chief Engineer Penzaren and local wildlife, which Adelade and Gethul were also able to control. Eventually they reached Adelade herself and after defeating her in combat, detonated the D-5X probe droid loaded with explosives inside Gethul's maw, killing the abomination and stopping the threat.\nJedi Master Adelade appears in Star Wars: The Old Republic: Knights of the Eternal Throne as the final boss of the \"Destroyer Of Worlds\" Uprising.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3630_BBY",
  "/wiki/Makeb",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Cult_of_Gethul",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Emperor/Legends",
  "/wiki/Vaylin",
  "/wiki/Eternal_Alliance",
  "/wiki/3631_BBY",
  "/wiki/Gethul",
  "/wiki/Admiral/Legends",
  "/wiki/Bey%27wan_Aygo",
  "/wiki/Cult_of_Gethul_uprising",
  "/wiki/Penzaren",
  "/wiki/D-5X",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/2017",
  "/wiki/3629_BBY",
  "/wiki/3628_BBY",
  "/wiki/Galactic_Standard_Calendar"
 ]
}