{
 "name": "Adi Gallia",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 20 BBY and 19 BBY",
      "Florrum"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tholothian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.74 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic",
      "Lok Revenants"
     ]
    }
   ]
  }
 ],
 "content": "Adi Gallia, a Force-sensitive Tholothian female, was a Jedi Master and member of the Jedi High Council during the last years of the Galactic Republic. During the Clone Wars, she served as a Jedi General in the Grand Army of the Republic and fought several battles over the course of the Republic–Separatist conflict. In particular, she allied herself with the Lok Revenants pirate gang.\nIn 21 BBY, Gallia rescued Eeth Koth—a fellow Jedi Master who had been captured by General Grievous—with the help of Jedi Knights Obi-Wan Kenobi and Anakin Skywalker during the Battle of Saleucami. She was killed two years later on the planet Florrum where Gallia and Kenobi confronted the Dathomirian renegade Sith Maul and Savage Opress.\nFollowing her demise, Gallia's cousin, Stass Allie, took her place on the Jedi Council. In 35 ABY, Gallia's voice was heard by the Jedi Rey, where she extolled the young girl to rise and defeat Darth Sidious during the Battle of Exegol.\nAdi Gallia was born into a high-ranking, diplomatic family stationed on Coruscant. A Force-sensitive individual, she was discovered by the Jedi Order and became a Jedi Master. Gallia earned a position on the Jedi High Council, and she became famed for her skills as a diplomat. She was also the cousin to fellow Tholothian Jedi Stass Allie, who was inspired to showcase her own skills after Gallia distinguished herself. Like her cousin, Allie would go on to become an exceptional diplomat.\nDuring the Naboo Crisis, Gallia warned her colleagues of the Trade Federation's suspicious activities in the Naboo system. Prior to the Invasion of Naboo, Gallia lost her first lightsaber in a mission and constructed a replacement with a blue blade and a durasteel hilt that she would wield for the remainder of her life.\nGallia was present when Qui-Gon Jinn went to the Jedi Temple to report an attack by a mysterious warrior whom he believed to be a Sith Lord to the Jedi Council. Jinn also requested that a boy he found on Tatooine, Anakin Skywalker, be trained as a Jedi, as Jinn believed he was the Chosen One. Gallia, along with the rest of the Jedi Council, was skeptical of this claim, and even though agreeing to test Skywalker, denied him training because he was too old and has had relationships and is vulnerable to the Dark side of the Force. After Jinn's death at the hands of Darth Maul during the Battle of Naboo, Gallia and the Council agreed to allow Obi-Wan Kenobi to train Skywalker as his apprentice to fulfill Jinn's dying wish. Gallia also was present at Jinn's funeral.\nGallia still served on the Council ten years after the invasion of Naboo. During this time thousands of star systems joined a secessionist movement who wanted independence from the Galactic Republic. The council feared that if a pan-galactic war to break out they wouldn't have enough manpower to defend the Republic from the Separatist threat. Around this time the life of Senator Padmé Amidala was threatened by an assassination attempt, causing the Council to assign Obi-Wan Kenobi and Anakin Skywalker as protection for the Senator. This eventually lead to Obi-Wan discovering that a Clone army was being manufactured in secret on the world of Kamino at the request of Jedi Master Sifo-Dyas, who had perished some years prior. Gallia was present on Coruscant when the Council was brought this news, troubled by this information the council sent Obi-Wan to Geonosis to track down the bounty hunter Jango Fett, who was the man responsible for the attempts on Amidala's life as well as providing the genetic template for the clone Army. This request ultimately led to the beginning of the pan-galactic conflict known as the Clone Wars, as the Separatist army and the new Grand Army of the Republic fought each other in what would become known as the first battle of Geonosis.\nIn 22 BBY, Gallia was present in the Jedi Council chamber when Senator Amidala contacted the Republic for support on a diplomatic mission to the Moon of Staggec. Generals Kenobi and Skywalker were eventually sent to assist her. During the war, Gallia compromised on her ideals to work alongside the Lok Revenants, an anti-Trade Federation pirate group.\nGallia attended a meeting alongside several other Jedi to watch a taunting message sent by Confederacy General Grievous. Grievous had captured Jedi Master and Gallia's fellow Council member Eeth Koth, and in his message he tortured Koth and told the recipient Jedi how he only sought to see their Order fall. Several younglings witnessed the recording and were quickly went out of the room. The remaining Jedi found resolve to bring Grievous to justice, but were at a loss as they had no way of identifying Koth's location. Clone Commander Wolffe found a hidden message in the transmission, a series of hand signals from the captive Koth. Kenobi read Koth's message, finding that he was being held in the Saleucami system. Gallia was surprised at this, as Republic Intelligence had shown there to be no signs of Grievous' ships near the sector. Knowing where Koth was being held, Kenobi, Skywalker, and Gallia decided to mount a rescue mission to rescue Koth and take down Grievous.\nKenobi's plan was that he and his forces would enter battle with Grievous' fleet above Saleucami, then send the coordinates of the command ship to Skywalker and Gallia, who would jump into the battle from hyperspace, undetected, and infiltrate Grievous' ship. Gallia asked Kenobi how he planned to stray Grievous away from his ship, to which Kenobi replied that he would be enough bait for the General to take. Kenobi and his forces entered hyperspace, upon which exiting they quickly came under fire from Grievous' fleet. Clone Captain Rex, part of Gallia and Skywalker's team, received the coordinates from Kenobi. Gallia questioned how close Skywalker would near Grievous' ship once exiting hyperspace. Skywalker landed their ship underneath Grievous', undetected as planned, and Gallia remarked that had they been any closer they would be flying down hallways.\nGallia, Skywalker, and their team of clones entered Grievous' ship, and split up. Gallia and Skywalker began towards the bridge, where Koth was being held. Kenobi, meanwhile, managed to bait Grievous onto his ship. The two Jedi entered the bridge, where they were soon surrounded by several commando droids. The tactical droid in charge of the ship began torturing Koth to near-death, but Skwalker severed the droid's arm to keep it from killing Koth. Gallia and Skywalker fought against the commando droids, destroying both them and the tactical droid. They released Koth from his restraints, but as the trio began making their way back to their ship, Kenobi reported that Grievous was making an escape back to his command ship. Skywalker took Koth back to their ship while Gallia left to help Kenobi in stopping Grievous.\nGrievous managed to escape from Kenobi's cruiser to the docking tube between their two ships, where Kenobi caught up to him. The Republic cruiser was fired upon by Grievous' ship, however, destroying the stabilizers and causing the ship to start exploding. The docking tube started breaking as the ships pulled away from each other, and Grievous made it back to his ship. Gallia began fighting Grievous before he could close the entrance to his ship. The docking tube split, however, and Grievous made his escape as Gallia, Kenobi, and the clones held on to the damaged docking tube to keep from entering space. Gallia managed to pull herself aboard Grievous' ship, where she fired a grappling hook for Kenobi and the remaining clones to grab onto. Once they were all on board, Gallia closed the door. Kenobi planned to continue his attempt to capture Grievous, but Gallia told him that Skywalker was leaving and they would be left behind if they were to stay. Skywalker told them to head towards a hangar near them, where they boarded his craft to escape the destruction of Grievous' flagship. Grievous himself had fled to the planet's surface, and Kenobi decided to pursue him further. Skywalker landed in the hangar of a Republic flagship, where Gallia and the injured Koth departed for a medical frigate.\nIn 20 BBY, along with Plo Koon, Saesee Tiin, and Obi-Wan Kenobi, Adi Gallia examined the corpses of Jedi Master Halsey and his Padawan, Knox, after Delta Squad returned them to the Jedi Temple. Gallia theorized the deaths were caused by Asajj Ventress, but she knew Dooku's assassin was believed to have been killed during the battle of Sullust.\nWhen the attempted rescue of Jedi Master Even Piell and Captain Wilhuff Tarkin from the Separatist Citadel on Lola Sayu went awry, Gallia was assembled as part of a rescue team to save the survivors of the initial rescue mission from being captured themselves. Gallia, Plo Koon, Saesee Tiin, and Kit Fisto met aboard one of their flagships to discuss the plan. Tiin, Gallia, and Fisto were to draw the attention of the Separatist blockade while Koon slipped onto the planet's surface with a group of gunships to pick up the survivors, among which were Kenobi, Skywalker, and Rex. Gallia noted that the plan was heavily dependent on the timing of the rescue, as if the survivors were not at the extraction point in time then Koon would have to either abandon them or put the entire mission and everyone involved as risk. Koon assured her that the survivors would be ready.\nUpon arriving to Lola Sayu, Gallia, Tiin, and Fisto entered into battle in their respective interceptor ships. The battle was slow from the start, as they were unable to break through the blockade and quickly became overwhelmed by droid fighters. Koon urged Tiin to break through himself, which he agreed to do. Tiin ordered that Gallia and Fisto form up behind him, and together they managed to escort Koon's gunship and slip through the blockade. The survivors, meanwhile, had managed to reach the extraction point, but had lost Master Piell along the way. They held off Separatist forces long enough for Koon to reach them in time, and with the escort of Gallia, Tiin, and Fisto the gunship to escape from the planet's surface. Koon ordered the flagships to prepare to make their escape to Coruscant, and all Republic fighters were recalled to the cruisers. Gallia held up the rear of the gunship as they pushed through Separatist forces to reach the flagships. Once Gallia had landed and the survivors were safe, Koon had the cruisers jump into hyperspace. Gallia, along with the rescue team and the survivors of the first rescue mission, later met together at the Jedi Temple to discuss the battle with Jedi Grand Master Yoda and Master Mace Windu.\nShortly after Commander Wolffe's relief mission to the earthquake-ravaged world of Aleen, he and Gallia rendezvoused their cruisers, where he unloaded the droids C-3PO and R2-D2. Gallia's ship, headed for Republic space, neared the planet Patitite Pattuna, where it came under a surprise attack by a fleet of Separatist ships led by Grievous. The bombardment quickly destroyed the main reactor, and Gallia ordered that the ship be evacuated. Grievous himself led a boarding party onto Gallia's ship, where she dueled with him as his forces advanced onward. Despite putting up a good fight with the general, she was ultimately defeated and captured by the cyborg. She was held captive on the bridge of his flagship, where she watched him order a random attack on a pirate ship.\nGallia was not held prisoner for long, as Plo Koon and Wolffe led a rescue party to free her. Koon took charge of facing the droid soldiers as Wolffe freed Gallia from her captors. The two met in the hallways of the ship, where she thanked him for rescuing her as they finished off the remaining droids. Wolffe informed them that Grievous had once again escaped before he could have been brought into custody. Koon ordered that any remaining droids on the ship be destroyed. C-3PO and R2-D2, who had been on their own series of bizarre adventures in conjunction to Gallia's capture, had ended up on Grievous' ship. The two droids revealed themselves, and they began relaying their mishaps to an unwilling Wolffe as Gallia and Koon led the rescue party away.\nAt some point prior to her death, Gallia, alongside Obi-Wan Kenobi, traveled to the planet of Bray to investigate the plight of its inhabitants. Upon their arrival, they were attacked by Lord Ravna, who had begun to infect other inhabitants and Clone Troopers with vampyric abilities. In an attempt to stop the threat, Gallia and Kenobi traveled to the Citadel of Light on Bray, confronting Count Dooku. Though the two Jedi were briefly overpowered by Lord Ravna and Dooku, they managed to escape when Ravna attempted to betray Dooku, ending the threat and breaking the infected from their curse.\nGallia later joined Kenobi in tracking the renegade Sith Lords Maul and Savage Opress. The pair had been running rampage and pillaging various Outer Rim worlds, killing Jedi Finn Ertay along the way. Gallia and Kenobi, close on the brothers' trail, responded to a distress signal from a space station in the Cybloc system. Gallia believed that the distress call could have been caused by the brothers as the station was not far from their previous attack. They met with a the station's Snivvian supervisor, who told them of the recent raid by the brothers, who had destroyed several security droids and stolen a safe filled with credits. The supervisor questioned if the brothers were rogue Jedi and asked Kenobi to ignite his lightsaber. Upon seeing the blue blade, the supervisor stated that the security droids had seen the brothers with red lightsabers. He told Gallia and Kenobi that the brothers had stolen a cargo ship and headed in the direction of the Sertar sector. Gallia asked Kenobi what was in the Sertar sector. He told her that the planet Florrum was located there, as were a group of pirates he had met before.\nUpon arriving to Florrum, Gallia found a match on the stolen cargo ship in the space above the planet. She guessed that the brothers had sought out the pirates to unload their stolen cargo, but Kenobi believed that the pirate leader, Hondo Ohnaka, would not have had an allegiance to the duo. Kenobi contacted Ohnaka on the planet below, learning that Maul and Savage had been recruiting Ohnaka's pirates to their side. Ohnaka asked that the Jedi aid him, but Kenobi assured them that he and Gallia could only deal with the Sith.\nMaul and Savage, now with a pirate escort, began a raid on Ohnaka's stronghold as Gallia and Kenobi landed on a cliff nearby. The brothers quickly went to fight the Jedi upon noticing their landing. Gallia was separated from Kenobi during the duel and battled against the giant Savage Opress alone, using her agility and speed to outmaneuver him. As they fought she aimed a kick at his left knee, a move which would normally be crippling but which failed to even faze the hulking Zabrak. Caught off-guard, Gallia was slammed against the side of a wrecked ship with the Force and then gored through the stomach with Savage's horns, mortally wounding her before Savage dealt the final blow with his lightsaber.\nHer murder was witnessed by Kenobi, who attacked Savage in a rage but was forced to retreat as the two brothers ganged up on him, though not before recovering Gallia's lightsaber. Kenobi escaped into Ohnaka's fortress with the pirate's remaining forces, and the two devised a plan to separate the brothers from their new allies. Obi-Wan drew the brothers away from Ohnaka and proceeded to duel them wielding Gallia's lightsaber in conjunction with his own. After a bout of aggressive swordplay and physical blows to the same knee Gallia had struck earlier before her death, Obi-Wan managed to sever Savage's left arm with Gallia's lightsaber, forcing the brothers to flee as Ohnaka and his now-reunited forces began a counterattack against the retreating Sith, who barely managed to survive.\nAllie took her cousin's place on the Jedi Council after her death. Shortly after the Battle of Fortress Vader, Vader entered a portal constructed by Darth Momin to resurrect his wife Padmé Amidala. While walking through visions, he encountered Gallia along with many Jedi with their lightsabers ready to battle him. However, Vader killed all the illusions, severing Gallia's torso as the words \"Let the past die\" resounded in his mind.\nIn 35 ABY, during the Battle of Exegol, Gallia's voice was heard by Rey among the voices of many Jedi of the past who aided her with killing the resurrected Darth Sidious.\nAdi Gallia had blue eyes and dark skin with blue patches around her eyes and cranium. Her scalp was scaled, and several long, fleshy tendrils hung down from the back of her head. She stood 1.74 meters  tall. She had a reputation for aggression and was a strict, focused woman. Gallia criticized the outrageous tactics of others, such as Anakin Skywalker and Obi-Wan Kenobi, although she rarely condemned them as their actions were mostly effective. Although she did not see eye-to-eye with Skywalker tactically, she appreciated his quick-thinking and decisiveness in combat. Though stoic and no-nonsense for the most part, Gallia was known to possess a sarcastic and dry wit, at one point remarking that if Anakin Skywalker had been flying any closer to Grievous' ship then they would have \"been flying down hallways.\" Gallia's sarcasm and cynicism were not without detractors, with even Grand Master Yoda having spoken to her about her callous remarks.\nAlthough Gallia lived on Coruscant, she was very attune with galactic events. Her powers of intuition and intelligence were revered and respected amongst the Jedi. She was the first to notice suspicious activities from the Trade Federation regarding what eventually became an Invasion of Naboo. She was also a valuable intelligence source for various Senate leaders.\nIn addition to being a skilled pilot, Adi Gallia was well versed in diplomacy and a skilled user of the Form V. Her skills allowed her to take on General Grievous twice and survive, though she was beaten and captured on the second occasion. When facing Savage Opress, she was no match for his sheer brute strength and was killed after a short duel.\nGallia was a skilled starfighter pilot in addition to her lightsaber prowess.\nAdi Gallia wielded two lightsabers over the course of her career as a Jedi. Her first one was lost on a mission some time prior to the Clone Wars and was replaced with a lightsaber that had a blue blade. She also wore Jedi robes and a tunic. Her scaled scalp was adorned with a headdress of linked chain and a brown fabric which framed her face. During the Clone Wars, Gallia used Coruscant Guard armor on her forearms, and was adorned with the unit's symbol. Gallia also wore a belt pouch and long travel boots, common for Jedi Knights.\nAdi Gallia was played by Gin Clarke in Star Wars: Episode I The Phantom Menace, and voiced by Angelique Perrin in Star Wars: The Clone Wars and Star Wars: Episode IX The Rise of Skywalker.\nThere are two conflicting sources regarding Gallia's home world: Ultimate Star Wars claims she hails from Tholoth, while Star Wars: Absolutely Everything You Need to Know and Star Wars Character Encyclopedia: Updated and Expanded state she is from Coruscant. At the same time, the old Encyclopedia on StarWars.com and Star Wars: The Clone Wars: Character Encyclopedia - Join the Battle! listed Gallia's height as 1.74 meters. Star Wars Character Encyclopedia: Updated and Expanded says she stands at 1.84 meters. Although the Encyclopedia on StarWars.com is no longer readily available, this article assumes the newer source, that being Star Wars: The Clone Wars: Character Encyclopedia - Join the Battle!, is correct.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Adi_Gallia",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Adi_Gallia",
  "/wiki/Coruscant",
  "/wiki/20_BBY",
  "/wiki/19_BBY",
  "/wiki/Florrum",
  "/wiki/Tholothian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Inch",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Lok_Revenants",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Master",
  "/wiki/Republic_Era",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_General",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Pirate",
  "/wiki/21_BBY",
  "/wiki/Eeth_Koth",
  "/wiki/Jedi",
  "/wiki/Prisoner",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Battle_of_Saleucami",
  "/wiki/Death",
  "/wiki/Planet",
  "/wiki/Skirmish_on_Florrum",
  "/wiki/Dathomirian",
  "/wiki/Maul",
  "/wiki/Savage_Opress",
  "/wiki/Stass_Allie",
  "/wiki/35_ABY",
  "/wiki/Rey_Skywalker",
  "/wiki/Darth_Sidious",
  "/wiki/Battle_of_Exegol",
  "/wiki/Reproduction",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Trade_Federation",
  "/wiki/Naboo",
  "/wiki/Naboo_system",
  "/wiki/Adi_Gallia%27s_first_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Imperial_Palace",
  "/wiki/Sith_Lord",
  "/wiki/Tatooine",
  "/wiki/Chosen_One",
  "/wiki/Separatist_Crisis",
  "/wiki/The_galaxy",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Clone_trooper",
  "/wiki/Cloning",
  "/wiki/Kamino",
  "/wiki/Sifo-Dyas",
  "/wiki/Geonosis",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Confederacy_military",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/22_BBY",
  "/wiki/Moon_of_Staggec",
  "/wiki/Youngling",
  "/wiki/Clone_army",
  "/wiki/Commander",
  "/wiki/Wolffe",
  "/wiki/Saleucami_system",
  "/wiki/Republic_Intelligence",
  "/wiki/Hyperspace",
  "/wiki/Captain",
  "/wiki/Rex",
  "/wiki/BX-series_droid_commando",
  "/wiki/TV-94",
  "/wiki/Docking_tube",
  "/wiki/Plo_Koon",
  "/wiki/Saesee_Tiin",
  "/wiki/Halsey",
  "/wiki/Padawan",
  "/wiki/Knox",
  "/wiki/Delta_Squad",
  "/wiki/Asajj_Ventress",
  "/wiki/Battle_of_Sullust",
  "/wiki/Sullust",
  "/wiki/Even_Piell",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Citadel",
  "/wiki/Lola_Sayu",
  "/wiki/Kit_Fisto",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Mace_Windu",
  "/wiki/Mission_to_Aleen",
  "/wiki/Aleen",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/Patitite_Pattuna",
  "/wiki/Battle_of_Patitite_Pattuna",
  "/wiki/Marauder_(Weequay_pirate_ship)",
  "/wiki/Bray",
  "/wiki/Mission_to_Bray",
  "/wiki/Ravna_(Lord)",
  "/wiki/Citadel_of_Light",
  "/wiki/Finn_Ertay",
  "/wiki/Cybloc_Transfer_Station",
  "/wiki/Cybloc_system",
  "/wiki/Snivvian",
  "/wiki/Raid_on_the_Cybloc_Transfer_Station",
  "/wiki/Police_droid",
  "/wiki/Sertar_sector",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Hondo%27s_Salvage",
  "/wiki/Zabrak",
  "/wiki/Battle_of_Fortress_Vader",
  "/wiki/Portal",
  "/wiki/Darth_Momin",
  "/wiki/Ben_Solo",
  "/wiki/Eye",
  "/wiki/Adi_Gallia%27s_Delta-7B_Aethersprite-class_light_interceptor",
  "/wiki/Form_V",
  "/wiki/Pilot",
  "/wiki/Adi_Gallia%27s_second_lightsaber",
  "/wiki/Jedi_robes",
  "/wiki/Coruscant_Guard",
  "/wiki/Armor",
  "/wiki/Boot",
  "/wiki/Gin_Clarke",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Angelique_Perrin",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_1",
  "/wiki/Hyperspace_Stories_1",
  "/wiki/Grievous_Intrigue",
  "/wiki/The_Deserter",
  "/wiki/R2_Come_Home",
  "/wiki/Witches_of_the_Mist",
  "/wiki/Overlords",
  "/wiki/Citadel_Rescue",
  "/wiki/Gungan_Attack",
  "/wiki/Mercy_Mission_(episode)",
  "/wiki/Nomad_Droids",
  "/wiki/Kidnapped",
  "/wiki/Deception",
  "/wiki/Crisis_on_Naboo",
  "/wiki/A_War_on_Two_Fronts",
  "/wiki/The_Gathering_(episode)",
  "/wiki/Secret_Weapons",
  "/wiki/Revival_(episode)",
  "/wiki/Destiny_(episode)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Darth_Vader_(2017)_25",
  "/wiki/Star_Wars_Rebels_(webcomic)",
  "/wiki/Star_Wars_Adventures:_Tales_from_Vader%27s_Castle_2",
  "/wiki/Crimson_Reign_3",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Journey_Through_Space_(2015)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_64",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_28",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Helmets",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_27",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Databank_(website)",
  "/wiki/Revival",
  "/wiki/The_Gathering",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/32_BBY",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Yarael_Poof",
  "/wiki/Oppo_Rancisis",
  "/wiki/Yaddle",
  "/wiki/Depa_Billaba",
  "/wiki/Coleman_Trebor",
  "/wiki/Shaak_Ti",
  "/wiki/Coleman_Kcaj"
 ]
}