{
 "name": "Admiral  (soldier)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Admiral was a Human male who lived during the reign of the New Republic. He was active as a soldier during 5 ABY and 10 ABY. Admiral had brown hair, fair skin, and brown eyes, and a scar crossed down from the top of his forehead, over his right eye, and onto his right cheek.\nAdmiral wore a black uniform with a shirt that bore a red band past his right shoulder. The uniform also had a red collar and a set of symbols on the front and back of the shirt. Admiral wielded numerous weapons throughout his time as a soldier, including an E-11 blaster rifle, a rail detonator, and thermal detonators.\nAdmiral was introduced in the 1997 video game Star Wars: Jedi Knight: Dark Forces II as a character who only appeared in the game's multiplayer addition as one of the playable character models. He later appeared in Jedi Knight's 1998 expansion pack, Mysteries of the Sith, which introduced \"multiplayer personalities,\" a form of character creation that put different character models under different professions. Each profession had its own set of starting weapons for a match, with Admiral being categorized as a soldier. Admiral's face texture is the same one used for Santiago, another multiplayer character in the game. Neither game states whether \"Admiral\" is the character's name or an indicator of his rank.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Soldier/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Weapon/Legends",
  "/wiki/Time/Legends",
  "/wiki/E-11_blaster_rifle",
  "/wiki/Rail_detonator",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/1997",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/1998",
  "/wiki/Star_Wars:_Jedi_Knight:_Mysteries_of_the_Sith",
  "/wiki/Santiago",
  "/wiki/Military_rank/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}