{
 "name": "Adraas",
 "display_name": "Adraas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3653 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Sith Order",
      "Sith Order"
     ]
    }
   ]
  }
 ],
 "content": "Adraas was a Human male Sith Lord around the time of the Great Galactic War and a rival of Darth Malgus. He was instrumental in the Battle of Ord Radama and the Sacking of Coruscant.\nThe Sith Lord Adraas was sent to the battle on Ord Radama by the Emperor's advisory Dark Council, to provide Darth Malgus with assistance on the siege of the planet's capital, Livien Magnus. Malgus was angered by Adraas' presence on the planet and when Adraas suggested that they send some Mark I and Mark II Sith war droids to clear a path to the city, Malgus and Darth Venemal did nothing to dissuade him, despite having misgivings about the droids' abilities.\nUnder Adraas' orders, the droids attacked the city's southern gate and Malgus watched on as the droids were destroyed by the Republic defenders. However, the failure of the droids sufficiently distracted the Republic forces to allow Venemal and his commandos to enter the city and blast a hole in the wall. Livien Magnus quickly fell to Malgus' troops and Adraas subsequently tried to take all of the credit for the victory, which led Malgus to further despise his rival.\nAdraas was chosen by Darth Angral to lead the fifty Sith warriors on board a stolen Republic shuttle for an attack on the Jedi Temple during the Sacking of Coruscant. All of these were Sith handpicked by Angral himself. The warriors ranged from Sith apprentices to Sith and were led by two Sith Lords, Adraas being one of them. His rival, Malgus, was to assist in the assault. Malgus had wished to lead the attack on the Temple alone, but was overruled by Angral, resulting in Adraas' being assigned to accompany Malgus. During the battle, Adraas used the Force to generate a shockwave, throwing back several Jedi and damaging the Temple floor on which they fought.\nIn the struggle, Adraas attempted to duel Jedi Master Ven Zallow, but was knocked out of the battle by his foe, allowing Darth Malgus to battle and ultimately kill Zallow. Following the success of their mission, Adraas was one of the many survivors of the strike force of Sith Warriors—much to the disappointment of Malgus. Adraas did not initially participate in the victory cries from the Sith Warriors, but ultimately did so. When Malgus retrieved his lover, Eleena Daru, he ordered Adraas to personally bring a medical team to tend to her wounds. Adraas also reported the success of the strike force's assault to Angral before Malgus dismissed him.\nAfter the Imperial Medical Corps tended to the wounded and the dead were loaded onto their transport, Adraas approached Malgus on the matter of the Jedi's dead. Lord Malgus ultimately decided that they had fought bravely and that the Temple would become their tomb. When Adraas was ready to call an Imperial bomber to attack the Jedi Temple, Malgus ordered that explosives from the dropship be used to destroy the Temple. After the detonators were placed, Adraas believed they were too close to the blast radius. In response, Darth Malgus showed his contempt of Adraas protest and triggered the explosives using the Force to shield himself from the blast.\nIn defiance of Darth Malgus' orders to have his lover Daru immediately transported to the Steadfast, Lord Adraas instead redirected her to a local hospital overtaken by Sith soldiers. There she was left behind by other Imperials present who eventually moved their operation to a medical ship. Meanwhile, Darth Angral attempted to raise Malgus on his comlink, and when he failed to respond, Angral sought out Adraas, instead, and asked him to speak in Malgus' place. Elsewhere, Malgus was confronted twice by rogue Jedi Knight Aryn Leneer, and then later discovered the location of Eleena, as well as Adraas' treachery.\nUpon finding Eleena, Malgus killed her—having understood that she was his weakness but not forgetting his feelings for her. Thereafter, upon leaving Coruscant, Darth Malgus cornered Adraas in his personal estate. Then, Adraas was overpowered in a lightsaber duel by his rival. Adraas then attempted to strike back using a variety of Force Powers, including Force Lightning as well, even though he was aware of Malgus's mastery of the Force. His attack was ultimately cut off by Malgus's barrage of Lightning attacks, which left the Sith Lord dying on the floor. With his final words, along with the pain the attack had inflicted upon him, a dying Adraas pleaded Malgus to kill him. Malgus complied, and after removing his gloves, ended the life of his long-time rival by choking him to death with his bare hands.\nAdraas was an arrogant man and a rival of Darth Malgus. He enjoyed taunting Malgus, openly revealing his aspirations to take Malgus' position in the Sith hierarchy.\nAdraas was skilled at political manipulation, drawing favor from Darth Angral, using it to impair Malgus' ability to act freely, then taunting him, knowing he could not strike back without open conflict.\nLike many other Sith Lords, Adraas had misgivings about aliens.\nAdraas was a skilled Sith warrior, though his favor of politics over combat would see his defeat and death at the hands of Malgus. He was more powerful than many of the Jedi at the Temple at Coruscant proven by his survival. However, this may be an assumption because little was known about his condition after the battle or how many he killed, but giving that he survived proved that he must have had some considerable skill.\nIt could be said that he had developed some skill in the use of the Force as well. This can be seen from the shockwave he created during the Sacking of Coruscant, as well as his lightning attacks during his battle with Malgus. His abilities with a lightsaber were considerable as well, because even though he was defeated, he appeared to be able to hold his own against both Master Zallow and Darth Malgus. He also killed several Jedi defenders during the attack.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3653_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Order_(Sith_Empire)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Time/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Darth_Malgus",
  "/wiki/Battle_of_Ord_Radama",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Venemal",
  "/wiki/Ord_Radama/Legends",
  "/wiki/Tenebrae",
  "/wiki/Dark_Council",
  "/wiki/Livien_Magnus",
  "/wiki/Sith_war_droid_Mark_I",
  "/wiki/Sith_war_droid_Mark_II",
  "/wiki/Sith/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Darth_Angral",
  "/wiki/NR2_gully_jumper",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Ven_Zallow",
  "/wiki/Sith_Warrior",
  "/wiki/Eleena_Daru",
  "/wiki/Imperial_Medical_Corps",
  "/wiki/The_Force/Legends",
  "/wiki/Steadfast_(Sith_Empire)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Aryn_Leneer",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Special:EditPage/:Adraas",
  "/wiki/Politics/Legends",
  "/wiki/Deceived",
  "/wiki/The_Old_Republic:_Deceived",
  "/wiki/The_Old_Republic:_Deceived_(audiobook)",
  "/wiki/Category:Images_of_Adraas",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Book_of_Sith:_Secrets_from_the_Dark_Side",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}