{
 "name": "Adrick",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Imperial Army"
     ]
    }
   ]
  }
 ],
 "content": "Adrick was a male Human, who served in the Ground Forces of the Galactic Empire.\nHolding the rank of a captain, Adrick was involved in a large operation with a purpose to obtain the Codex of Tython, an ancient Jedi Holocron discovered by the agent of the Alliance to Restore the Republic. The agent's landspeeder crashed in a remote area of Dantooine, and Adrick and his troopers were sent out to capture him. They were able to find the crash site and discovered a cache of Jedi relics hidden nearby, but it was already empty. After a day's search, the Imperials were able to located the Rebel agent, who was carrying the Codex. A group of stormtroopers surrounded the Rebel and Adrick demanded the relic from the Rebel, promising to let him go. The Rebel refused and Adrick simply ordered his troops to kill him and take the relic. However, in the ensuing firefight the Rebel received aid from the Jedi Knight Drakka Judarrl, who created an illusion, which distracted the Imperials and allowed the Rebel to escape into the night.\nAdrick continued to follow the Rebel, who managed to escape the planet and headed for Dathomir. There, Adrick dispatched another squad to ambush him and capture the Codex, but the troopers were all slaughtered by a Dark Jedi Mellichae and his minions. Adrick returned to the Star Destroyer Blackguard to report to the Grand Admiral Andal Sait on his progress. Sait wanted the Codex looking for the plans of new weapons, but Adrick developed his own agenda. Understanding the value of the Jedi relics, he stole a fragment of the holocron, which belonged to Andal Sait himself. However, this fragment was in turn taken from him, when the Rebel agent infiltrated the Blackguard and ambushed Adrick, which allowed him to complete and finally activate the Codex.\nAround 2 ABY a small Rebel outpost was discovered on a remote Outer Rim world of Hoth by ISB agents looking for an exiled Nightsister. Adrick, now holding the rank of colonel, was leading the group sent by Maximilian Veers to reinforce the Imperial presence on the planet and wipe out the outpost. He led a strike force consisting of one AT-ST, two AT-PTs and a squad of snowtroopers to the outpost, mistakenly believing that the Nightsister Kyrisa was in there and hoping to capture her. However, their approach was spotted by Rebel scouts, which gave the Rebels time to mount a defense. Adrick ordered his troopers to attack the outpost, but the initial assault was met with heavy blaster fire, forcing them to fall back. Then, the AT-ST arrived at the battlefield and provided cover for the snowtroopers by blazing away at Rebel positions. Eventually, the Alliance managed to cripple the walkers, but the snowtroopers were still putting up a good fight regardless. The battle ended when a blizzard began, engulfing both armies and making it impossible for them to continue. After the storm the Rebels examined the battlefield and found several Imperial bodies and discovered that one of the light AT-PTs was missing, but no signs of the Imperials were found in the nearby area.\nAdrick was created for the Star Wars Galaxies Trading Card Game, where he serves as one of the recurring antagonists in the Light Side scenario campaigns.\nWhile the campaign of The Nightsister's Revenge, told from the Rebel point of view, suggests that all Imperials on Hoth were either killed in the battle or perished in a snowstorm, Chuck Kallenbach, one of the game's designers, teased the players with the possibility that Adrick might have survived.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Codex_of_Tython",
  "/wiki/Jedi/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Landspeeder/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Drakka_Judarrl",
  "/wiki/Planet/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Mellichae",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Blackguard_(Star_Destroyer)",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Andal_Sait",
  "/wiki/2_ABY/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Maximilian_Veers/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/All_Terrain_Personal_Transport/Legends",
  "/wiki/Cold_assault_stormtrooper",
  "/wiki/Kyrisa",
  "/wiki/Battle_of_Hoth_(2_ABY)",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Chuck_Kallenbach",
  "/wiki/Champions_of_the_Force_(SWGTCG)",
  "/wiki/Template:SWGTCG",
  "/wiki/December_17",
  "/wiki/2009",
  "/wiki/November_9",
  "/wiki/2011"
 ]
}