{
 "name": "Adum_Larp",
 "display_name": "Adum Larp",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown and green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Khoonda"
     ]
    }
   ]
  }
 ],
 "content": "Adum Larp was a Rodian male who lived on Dantooine during the Jedi Civil War and the Dark Wars.\nLarp was an arms dealer and general salesman who lived on the plains east of the Jedi Enclave. He declared that it was his \"mission\" to provide the local settlers and farmers with the supplies that they needed to stave off attacks by kath hounds and the occasional Mandalorian raiders. He was a very passionate salesman, and when asked questions he would try to somehow promote his wares during his replies. At some point, Larp came into possession of the battle armor of Cassus Fett, which he sold for the price of 15,000 credits. He may have done business with Revan during the latter's time on Dantooine.\nLarp stayed on the planet even after the Attack on Dantooine and the resulting destruction of the Enclave. During the subsequent process of recovery, he ran a general store in Khoonda, where he encountered and may have dealt with Meetra Surik.\nIn Star Wars: Knights of the Old Republic II: The Sith Lords, the player—as the Jedi Exile—can ask Adum Larp to join the Khoonda Militia before the Battle of Khoonda, but he declines. He disappears from Khoonda after the battle, but it is not known whether or not he died during the battle.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Khoonda",
  "/wiki/Dantooine/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Dark_Wars",
  "/wiki/Jedi_Enclave",
  "/wiki/Kath_hound/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Cassus_Fett%27s_Battle_Armor",
  "/wiki/Cassus_Fett",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Revan/Legends",
  "/wiki/Attack_on_Dantooine_(Jedi_Civil_War)",
  "/wiki/Meetra_Surik",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Khoonda_Militia",
  "/wiki/Battle_of_Khoonda",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}