{
 "name": "Aeliar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Aeliar was a human female officer of the Rebel Alliance. In order to acquire weapons for the Rebellion, Aeliar intended to purchase from the Hidden Hand crime syndicate while Darth Vader was distracted by a group of bounty hunters hunting him down. Aeliar's operative, Gita, infiltrated the team of bounty hunters, led by Beilert Valance, but when the mission went awry and Gita was forced to escape, Aeliar abandoned the purchase. The rebels were approached by Valance, who proposed to make a deal with the rebels—he would lead the Empire to the Hidden Hand while the rebels evacuated his homeworld of Chorin, allowing Valance to then betray Vader without the threat of his people being punished. In return, Valance used the credits he had been given by the Hidden Hand to hunt down Vader to purchase weapons for the Rebel Alliance.\nDuring the Galactic Civil War against the Galactic Empire, Aeliar served as an officer in the Rebel Alliance. Attempting to equip the Rebellion with weapons and supplies, Aeliar intended to purchase from the crime syndicate known as the Hidden Hand, who were being hunted down by Darth Vader, a Sith Lord and enforcer of Emperor Palpatine. When the Hidden Hand began to hire a number of bounty hunters to hunt down Vader, Aeliar sent one of her operatives, the agent Gita, to infiltrate the team disguised as \"Urrr'k,\" a Tusken Raider sniper. Stationed at a rebel base in the Fellio Asteroid Belt, Aeliar received a message from Gita, informing her that the hunt had began, and Aeliar planned to purchase the weapons while Vader was distracted.\nHowever, the hunt was ultimately unsuccessful, and the team of bounty hunters were killed—aside from Dengar, who betrayed the team to the Empire; Gita, who managed to escape and return to the Rebellion; and Beilert Valance, who was captured by Vader.\nAeliar returned to a secret outpost on the jungle planet Lowik, where she met up with Gita. Gita suggested that she go back undercover as Urrr'k, but as the Hidden Hand had gone silent, Aeliar was forced to find another weapons dealer. As they talked, Valance, who had been tasked by Vader to destroy the Hidden Hand, entered the outpost, to Aeliar's surprise. Valance suggested making a deal, in which the Rebellion gave him the location of the Hidden Hand, and Valance gave them the weapons they required in return.\nAeliar was reluctant to trust Valance, but, with no other option, she decided to work with the bounty hunter. At Valance's request, Aeliar evacuated the population of a village on Valance's homeworld of Chorin, including his former lover, Yuralla Vega, preventing the Empire from punishing them when Valance helped the Rebellion. When Valance abandoned the Empire after helping to capture the Hidden Hand's leader, Gwi, the rebels managed to rescue the inhabitants of Chorin. Aeliar and Gita met with Valance on Lowik, where Gita asked Valance to continue working with the Rebellion. The bounty hunter declined the offer, departing from Lowik. In return for assisting him, Valance spent the credits he received from the Hidden Hand when he was hired to buy weapons for the Rebellion, delivering them to Aeliar. Years later, around 3 ABY, Aeliar and Gita no longer operated on Lowik, having been succeeded by Lieutenant Kondra.\nA human female, Aeliar had blonde hair, blue eyes, and light skin. She was dedicated to the cause of the Rebel Alliance, working with crime syndicates to acquire weapons. Aeliar prevented Gita from going undercover for a second time after the hunt for Vader ended in failure, knowing she would not be able to kill Vader on her own. She was shocked when Valance discovered the secret rebel outpost on Lowik, and was reluctant to work with and trust the bounty hunter, but she followed through with their plan. Aeliar believed in the Force, using the phrase \"May the Force be with you\" when Valance left Lowik.\nAeliar wore a gray shirt, brown pants and a dark jacket, over which she wore a black cape. She wore goggles on her head, and gloves on her hands. When evacuating the inhabitants of Chorin, Aeliar and Gita used a Theta-class T-2c shuttle.\nAeliar first appeared in Target Vader 1, a comic written by Robbie Thompson, illustrated by Marc Laming and Cris Bolson, and published by Marvel Comics on July 3, 2019 Aeliar was not named until the series' final issue, Target Vader 6, also written by Thompson and published on December 11, 2019.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Officer",
  "/wiki/Hidden_Hand",
  "/wiki/Anakin_Skywalker",
  "/wiki/Bounty_hunter",
  "/wiki/Hunt_for_Vader",
  "/wiki/Gita",
  "/wiki/Beilert_Valance%27s_crew",
  "/wiki/Beilert_Valance",
  "/wiki/Homeworld",
  "/wiki/Chorin",
  "/wiki/Credit",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Tusken_Raider",
  "/wiki/Sniper",
  "/wiki/Rebel_base_(Fellio_Asteroid_Belt)",
  "/wiki/Fellio_Asteroid_Belt",
  "/wiki/Death",
  "/wiki/Dengar",
  "/wiki/Rebel_outpost_(Lowik)",
  "/wiki/Jungle",
  "/wiki/Planet",
  "/wiki/Lowik",
  "/wiki/Arms_dealer",
  "/wiki/Yuralla_Vega",
  "/wiki/Gwi",
  "/wiki/Standard_year",
  "/wiki/3_ABY",
  "/wiki/Lieutenant",
  "/wiki/Kondra",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/The_Force",
  "/wiki/May_the_Force_be_with_you",
  "/wiki/Jacket",
  "/wiki/Cape",
  "/wiki/Goggles",
  "/wiki/Glove",
  "/wiki/Limb",
  "/wiki/Theta-class_T-2c_shuttle",
  "/wiki/Target_Vader_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Robbie_Thompson",
  "/wiki/Marc_Laming",
  "/wiki/Cris_Bolson",
  "/wiki/Marvel_Comics",
  "/wiki/July_3",
  "/wiki/2019",
  "/wiki/Target_Vader_6",
  "/wiki/December_11",
  "/wiki/Category:Images_of_Aeliar",
  "/wiki/Target_Vader_5",
  "/wiki/Bounty_Hunters_7",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Target_Vader_4",
  "/wiki/Bounty_Hunters_3",
  "/wiki/Bounty_Hunters_1",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}