{
 "name": "Aelta",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 0 BBY and 3 ABY",
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Singing Mountain Clan"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Djo family",
      "Singing Mountain Clan"
     ]
    }
   ]
  }
 ],
 "content": "Aelta was a female Human witch who lived on the planet Dathomir during the time of the Galactic Civil War. She was adopted by Augwynne Djo, leader of the Singing Mountain Clan, following the deaths of two of Djo's biological daughters, Allaya and Kara'Teel, and the loss of yet two other daughters, Barukka and Gethzerion, to the dark side Nightsisters sect. When Gethzerion learned that her mother had adopted Aelta into her family and turned her into a Sister of the Singing Mountain Clan, she became enraged, and ordered an assassin of hers to eliminate the Dathomiri Witch.\nA female Human witch by the name of Aelta lived on the Outer Rim Territories world of Dathomir during the time of the Galactic Civil War. Elsewhere on Dathomir, Augwynne Djo, leader of the Singing Mountain Clan of Dathomiri Witches, mothered three daughters, including Gethzerion, Barukka, Kara'Teel, and Allaya. However, Gethzerion and Barukka betrayed the Singing Mountain Clan, turned to the dark side, and became Nightsisters. Djo's other two daughters ended up dying by the time following the Battle of Yavin in 0 BBY. Allaya ended up getting killed in battle, while Djo's youngest child, Kara'Teel, died while trying to protect her mother. Following the deaths of these two children, Augwynne Djo decided to adopt Aelta as a new daughter. Meanwhile, Gethzerion sought refuge in Dathomir's Nightsister Stronghold.\nWhen Gethzerion learned that her mother had adopted Aelta into her family and turned her into a Sister of the Singing Mountain Clan, she became enraged, and ordered an assassin of hers to eliminate the adopted daughter, who also held the title of Arch Witch. Gethzerion's personal assassin was a spacer turned slave. After having proved themselves to the Nightsisters sect, Gethzerion released her assassin from slavery and assigned the individual the title of Dagger. After one of Gethzerion's scouts returned with Sister Aelta's location, the Dagger set forth to eliminate her in the wilds of Dathomir. When Aelta saw Gethzerion's assassin approach her, she was surprised, as the individual did not appear like a Nightsister. Nevertheless, Aelta recognized that the individual was sent by Gethzerion, and prepared to defend herself. Although Aelta put up a fight using her melee combat skills, she was ultimately killed by the assassin. This was a source of much delight to Gethzerion, who reveled in her suffering. Gethzerion hoped that Aelta's demise would serve as a warning to the Singing Mountain Clan, that Augwynne Djo should never attempt to replace her daughters again.\nHowever, the death of Aelta did not yet spell the end for Augwynne Djo's family. After Aelta's demise, Gethzerion learned that Djo had adopted yet another daughter, a former friend of Gethzerion's by the name of Chastina. To add insult to injury, Djo had even given Chastina a necklace that Gethzerion believed belonged to her. Enraged by this perceived slight, Gethzerion ordered her Dagger to rip Chastina's heart out and retrieve her necklace. In the end, Chastina met a similar fate as Aelta, thus snuffing out Augwynne Djo's adopted family.\nAelta had blue skin, black hair, and blue colored eyes. Referred to as a \"harlot\" by Gethzerion, Aelta was a capable fighter skilled in melee combat. She put these skills to the test against Gethzerion's assassin, however it was not enough to save her from an untimely demise.\nAs she was skilled in melee combat, Aelta possessed a number of bladed weapons, including a basic sword and a curved sword intended for single handed use. She also possessed a power hammer and a two handed Nyax Sword, commonly used by followers of Lord Nyax. During her final moments alive, Aelta wore a gray Singing Mountain Clan mask with violet details, and a blue Dawn Wrap with a black corset piece, red collar, and violet highlights. Additional clothing included a light pink Shredder Skirt with a silver colored medallion piece, and blue colored boots. She was also equipped with a large magenta colored backpack.\nSister Aelta was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. She was included in the third quest given by Gethzerion, an NPC located at the Nightsister Stronghold on the planet Dathomir. In the quest, players were instructed by Gethzerion to approach Aelta and kill her. Although the player could refuse to kill Aelta, or avoid partaking in the Nightsister quests altogether, this article assumes 100% game completion. Aelta was removed from the game when the Witches of Dathomir theme park was revamped as part of Game Update 18.2 on November 4, 2010, and Game Update 19 on December 14, 2010.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Singing_Mountain_Clan",
  "/wiki/Djo_family",
  "/wiki/Witch/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Augwynne_Djo",
  "/wiki/Death/Legends",
  "/wiki/Allaya_Djo",
  "/wiki/Kara%27Teel",
  "/wiki/Barukka",
  "/wiki/Gethzerion",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Sister_(Witches_of_Dathomir)",
  "/wiki/Assassin/Legends",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Nightsister_Stronghold",
  "/wiki/Canon",
  "/wiki/Arch_Witch",
  "/wiki/Spacer/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Chastina",
  "/wiki/Necklace/Legends",
  "/wiki/Heart/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Sword/Legends",
  "/wiki/Curved_sword",
  "/wiki/Limb/Legends",
  "/wiki/Power_hammer",
  "/wiki/Cult_of_Lord_Nyax",
  "/wiki/Lord_Nyax",
  "/wiki/Shirt",
  "/wiki/Clothing/Legends",
  "/wiki/Silver/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Backpack/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_4",
  "/wiki/2010",
  "/wiki/December_14",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Everything_You_Always_Wanted_to_Know_about_the_Nightsisters_but_Were_Afraid_to_Ask",
  "/wiki/Star_Wars_Insider_122",
  "/wiki/Holocron_continuity_database",
  "/wiki/Leland_Chee",
  "/wiki/Dathomirian/Legends",
  "/wiki/Cracken%27s_Threat_Dossier"
 ]
}