{
 "name": "Aerin_Dlarit",
 "display_name": "Aerin Dlarit",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Thyferra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dlarit family",
      "Xucphra Corporation",
      "Thyferran Home Defense Corps"
     ]
    }
   ]
  }
 ],
 "content": "Aerin Dlarit was a Human male and the father of former New Republic Rogue Squadron pilot Erisi Dlarit. After his family's faction, the Xucphra Corporation, ousted its rival, the Zaltin Corporation, and took over the planet Thyferra, Dlarit was appointed as a general in the Thyferran Home Defense Corps, the local military created by former Director of Imperial Intelligence Ysanne Isard to help augment the forces she had brought to Thyferra after fleeing from Coruscant.\nDuring the Bacta War, Dlarit was a target for assassination by the Ashern, a resistance movement of the native species of Thyferra, the Vratix. An Ashern strike team infiltrated his estate, and Dlarit was almost killed by strike team leader Elscol Loro. He was only spared when Iella Wessiri, another member of the strike team, suggested a change to Loro's plan. Dlarit was instead stunned and stripped of his Thyferran Home Defense Corps uniform, leaving him naked. A hologram of Dlarit was then circulated by the rebels.\nAerin Dlarit was a Human male hailing from the planet Thyferra and the father of Erisi Dlarit, formerly a starfighter pilot for Rogue Squadron, an elite New Republic starfighter squadron. In 7 ABY, former Director of Imperial Intelligence Ysanne Isard supported the Xucphra Corporation—the bacta producing company of which the Dlarit family was a part of—in ousting its rival, Zaltin Corporation, and taking control of Thyferra. For her efforts, Isard was installed as the world's Head of State and Chief Operating Officer of the Xucphra Corporation.\nUnder her rule, one of Isard's first actions was to establish the Thyferran Home Defense Corps, a military force made up of Xucphran personnel to fight the Ashern, a resistance movement led by the planet's original inhabitants, the Vratix. Dlarit was among the high-ranking Xucphran officials who joined the Defense Corps, receiving the rank of general despite having no military expertise. In his daily duties with the Defense Force, Dlarit had to defer to Major Barst Roite. However, Dlarit made up for his military shortcomings by attending several social functions and assuring the general public that the Ashern threat was being taken care of.\nIn the same year, Dlarit was selected as a target for assassination by Elscol Loro, a resistance fighter experienced in toppling planetary governments held by the Galactic Empire. With her were former CorSec investigator Iella Wessiri, former Imperial Special Intelligence operative Sixtus Quin, and Quin's troopers. When Wessiri objected that Dlarit was hardly a notable military target, Loro countered that as a public figure, Dlarit's death would be integral in frightening the planet's populace, thereby forcing them to choose between Isard's forces and the Ashern.\nOn the night Loro's strike team infiltrated his estate, Dlarit fell asleep on his office chair while gazing at a hologram of a statue that bore his likeness, surrounded by a group of adoring admirers and well-wishers. The strike team found him in that state and Loro was about to shoot him with her blaster when Wessiri intervened. Proposing her own plan, Wessiri managed to convince Loro that rather than kill Dlarit, they could humiliate him instead, an action that would still serve their original goal of destabilizing Isard's regime.\nOblivious to how he almost died, Dlarit was stunned with a blaster shot from Wessiri. The strike team then stripped him of his Thyferran Home Defense Corps uniform and took a hologram of their deed, which they circulated throughout Thyferra and reaching as far as the Victory-class Star Destroyer Corrupter, which at that time was en route to the colony world of Halanit to punish the inhabitants for accepting free bacta from Wedge Antilles, the leader of the coalition of pilots opposing Isard. Aboard the Corrupter, Dlarit's daughter Erisi was mortified when she saw his image slumped naked on his chair. The humiliating holo also led the Imperials to treat their Thyferran Home Defense Corps counterparts with open contempt.\nA native of Thyferra and a high official of the Xucphra Corporation, Dlarit was a product of the corporation's culture. Owing to the guaranteed profits of bacta sales, Xucphra never had the need for diversification or expansion. Hence, promotions were given to people according to their tenure, not their skills or merit. Dlarit dreamed of being famous and sought admiration from everyone, as shown by the holo inside his office depicting a statue of his own likeness, surrounded by a throng of enthusiastic supporters.\nAerin Dlarit was a character created by author Michael A. Stackpole for his 1997 novel X-Wing: The Bacta War, the fourth volume in the Star Wars: X-Wing series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Thyferra/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Dlarit_family",
  "/wiki/Xucphra_Corporation",
  "/wiki/Thyferran_Home_Defense_Corps",
  "/wiki/Parent/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/New_Republic_pilot/Legends",
  "/wiki/Erisi_Dlarit",
  "/wiki/Zaltin_Corporation",
  "/wiki/Planet/Legends",
  "/wiki/General/Legends",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Ysanne_Isard",
  "/wiki/Coruscant/Legends",
  "/wiki/Bacta_War",
  "/wiki/Assassin/Legends",
  "/wiki/Ashern",
  "/wiki/Homeworld/Legends",
  "/wiki/Species/Legends",
  "/wiki/Vratix/Legends",
  "/wiki/Ashern_strike_team",
  "/wiki/Raid_on_the_Dlarit_estate",
  "/wiki/Dlarit_estate",
  "/wiki/Death/Legends",
  "/wiki/Elscol_Loro",
  "/wiki/Iella_Wessiri_Antilles",
  "/wiki/Stun/Legends",
  "/wiki/Thyferran_Home_Defense_Corps_uniform",
  "/wiki/Hologram/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/New_Republic_pilot",
  "/wiki/Squadron/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Head_of_State/Legends",
  "/wiki/Chief_Operating_Officer",
  "/wiki/Military_rank/Legends",
  "/wiki/Major/Legends",
  "/wiki/Barst_Roite",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Special_Intelligence",
  "/wiki/Operative",
  "/wiki/Sixtus_Quin",
  "/wiki/Trooper/Legends",
  "/wiki/Local_day/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/Corrupter/Legends",
  "/wiki/Time/Legends",
  "/wiki/Colonist/Legends",
  "/wiki/Halanit",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Michael_A._Stackpole",
  "/wiki/1997",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/Star_Wars:_X-Wing_(novel_series)",
  "/wiki/X-Wing:_The_Bacta_War_(abridged_audiobook)",
  "/wiki/X-Wing:_The_Bacta_War_(unabridged_audiobook)",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/X-Wing:_The_Krytos_Trap",
  "/wiki/7_ABY"
 ]
}