{
 "name": "Affie_Hollow",
 "display_name": "Affie Hollow",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "249 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Byne Guild"
     ]
    }
   ]
  }
 ],
 "content": "Affie Hollow was a human female who operated for the Byne Guild as the co-pilot of Leox Gyasi aboard the starship Vessel. Hollow was the adopted daughter of Scover Byne, the leader of the Guild. She and Gyasi transported Jedi Master Cohmac Vitus, Jedi Knights Orla Jareni and Dez Rydan, Padawan Reath Silas, from the planet Coruscant to the Starlight Beacon during the High Republic Era. During the journey, the Vessel was forced to exit hyperspace due to debris from the Great Hyperspace Disaster.\nAffie Hollow was born in approximately 249 BBY, growing up with her parents who were, unbeknownst to her, indentured pilots working for Scover Byne, owner of the Byne Shipping Guild. Her parents often took risky and dangerous jobs for Byne with the promise of lowering the length of their indentured servitude. When Hollow was very young, her parents took a job smuggling to the Amaxine Station, a station built by the ancient Amaxine warriors that was periodically used by smugglers and other indentured pilots. They were killed while attempting to make use of the helix rings on board the station, and Byne kept the details of their deaths classified so that the Byne Guild did not come under legal scrutiny. She adopted Hollow, becoming her foster mother, and Hollow grew up loving Byne just as much as her biological parents, completely unaware that Byne was indirectly responsible for their deaths.\nWhen Hollow was 14 years old , Byne had her start learning the family business in the hopes that she might one day take over the Byne Guild. Hollow was sent from ship to ship for months in order to learn how to pilot and how to trade, but most pilots she travelled with looked down on her because of her age and didn't teach her much. This changed a year later, when she joined the crew of the Vessel, a ship piloted by Captain Leox Gyasi and his navigator Geode. Neither of the crew members looked down on Hollow, and she learned more from them than all the previous Byne Guild pilots combined. She ended up asking Byne to stay on the Vessel, and Byne reluctantly accepted, knowing that Hollow would never see anything she was too young for due to Gyasi's asexuality.\nDuring the start of the Nihil conflict, Hollow and the rest of the Vessel's crew, along with the team of Jedi they were bringing to Starlight Beacon, were knocked out of hyperspace by the Great Hyperspace Disaster. Staying aboard the same Amaxine station were parents died on with other survivors of the disaster, Hollow came to realize the station was used by the guild and, after looking through Byne's datapad while on the Republic capital Coruscant, learned of her parents' fate. Determined to bring an end to the guild's exploitation of indentured workers, she returned to the Amaxine station to uncover more evidence, parting ways with the Jedi who had also returned due to inadvertently unleashing the Drengir during their initial visit. Fleeing as the Nihil and Drengir fought over the station, Hollow and the Jedi escaped with Geode and Gyasi aboard the Vessel. Back on Coruscant, she presented her findings to the Republic, which arrested Byne and shut down the guild.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/249_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Byne_Guild",
  "/wiki/Pilot",
  "/wiki/Leox_Gyasi",
  "/wiki/Starship",
  "/wiki/Vessel",
  "/wiki/Scover_Byne",
  "/wiki/Jedi_Master",
  "/wiki/Cohmac_Vitus",
  "/wiki/Jedi_Knight",
  "/wiki/Orla_Jareni",
  "/wiki/Dez_Rydan",
  "/wiki/Padawan",
  "/wiki/Reath_Silas",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Starlight_Beacon",
  "/wiki/High_Republic_Era",
  "/wiki/Hyperspace",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Affie_Hollow",
  "/wiki/Amaxine_space_station",
  "/wiki/Amaxine_warriors",
  "/wiki/235_BBY",
  "/wiki/Geode",
  "/wiki/Nihil_conflict",
  "/wiki/Jedi",
  "/wiki/Datapad",
  "/wiki/Capital",
  "/wiki/Drengir",
  "/wiki/Nihil",
  "/wiki/Category:Images_of_Affie_Hollow",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_6",
  "/wiki/The_High_Republic_Adventures_(2021)_7",
  "/wiki/No_Stone_Unturned",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/232_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/234_BBY",
  "/wiki/The_High_Republic:_Out_of_the_Shadows"
 ]
}