{
 "name": "Aftab_Ackbar",
 "display_name": "Aftab Ackbar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    },
    {
     "name": "Born",
     "values": [
      "16 ABY",
      "Mon Cala"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Beige"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Calamari monarchy",
      "Mon Cala fleet",
      "Mon Cala fleet",
      "Resistance",
      "Exegol air team",
      "Exegol air team"
     ]
    }
   ]
  }
 ],
 "content": "Aftab Ackbar was a Mon Calamari male who was the son of Admiral Gial Ackbar. Ackbar only saw his father once after his spawning where he begged him to retire from Resistance service. Gial refused as the Admiral's focus was elsewhere. However, Aftab still felt he knew his father through study of his military service. In the aftermath of the Battle of Crait, whilst the Resistance was in need of help, Aftab supplied them with a number of starships from Mon Cala. But his planet's freedom soon came to end when First Order spies contacted General Hux about the Resistance taking refuge on the planet, sparking a race for Leia and her band to quickly escape the water planet with the starships provided. The Resistance made a close and daring escape, leaving the planet vulnerable to the First Order. Later, Aftab served as Colonel in the Resistance, and was referred to as \"Junior\" amicably by Commander Poe Dameron, whom the Mon Calamari aided as a Y-wing pilot during the encounter with the Sith Eternal forces on Exegol. After the battle he celebrated on the jungle moon Ajan Kloss.\nAftab Ackbar was born on the planet Mon Cala in 16 ABY. He was born to legendary rebel leader Gial Ackbar, although Gial only saw his son once since his spawning due to his being recruited by Resistance leader General Leia Organa, who created the movement in an effort to resist the First Order. In his father's absence, Aftab studied every battle and victory of his, and eventually, after his father had been with the Resistance for a short time, Aftab begged him to come back into retirement. At some point, Aftab met Organa.\nIn 34 ABY, Resistance members Rey, Leia Organa, Chewbacca, C-3PO, and Rose Tico went on a mission to Mon Cala with the intent of paying respects to Admiral Gial Ackbar, who had recently died during the Battle of Oetchi. Organa, who knew Aftab, intended to meet him on Mon Cala, but to her and her group's surprise, they were greeted with weapons pointed at them by several Quarren and Mon Calamari as soon as they landed in their light freighter, the Millennium Falcon.\nThe tension escalating, Aftab stepped in, proclaiming Organa to be a war hero who should be treated with respect. He threatened to feed the instigators to many-teethed fish if they were to continue to aggress the Resistance members. The Quarren Chadkol Gee, who had been the one quarreling with them, told Aftab that he was in over his head and that just because his father was a war hero did not mean he was too. Ackbar responded in a similar manner—just because his ancestors were traitors would not necessarily make him one too, referring to Quarren who had been considered traitors in the past.\nThe Quarren left after the exchange, leaving Ackbar free to welcome General Organa. Ackbar shared that he was glad to see her, but warned that this would not be the sentiment among many others on Mon Cala. When he asked what brought her there, Organa explained that she had come to honor Ackbar's father, Gial. The pair swam—with Organa utilizing a helmet that allowed her to breathe underwater—to the Mourning Shrines of Mon Cala, where many tributes to Mon Calamari were located, including one to Gial Ackbar. Organa commented that Gial would have been proud of his son. Aftab felt that his father's focus had been elsewhere, as he had only seen him once since his spawning. He also mentioned to Organa that he had heard that she had been with Gial when he died, which Organa confirmed, telling Ackbar that his father had been a hero until the very end and that she wished she could have brought his body back to his home of Mon Cala.\nOrgana explained that the real reason she had come to Mon Cala—on top of honoring the legacy of Gial Ackbar—was to ask for starships and pilots from the Mon Calamari people, who were known for making fine ships. Aftab Ackbar cautioned that King of Mon Cala Ech-Char might not give up all the supplies that Organa was hoping for. Organa insisted that even though the ones they were about to meet were politicians, she knew how to handle them. Organa stepped up to the king and made her case as Ackbar watched, although she was quickly shot down by Chadkol Gee, who claimed that the Mon Calamari and Quarren had suffered under her father, Darth Vader, and that they had already given everything to her cause. Although Ech-Char did not dismiss Organa's request as Gee had, he admitted that she was asking a lot of a people who were still nursing old wounds. He adjourned the meeting until the next day.\nShortly thereafter, the Resistance representatives were attacked by Quarren. Tico, Rey, and Chewbacca defeated a few in hand-to-hand combat, but they, along with C-3PO, were captured and detained in pods. Ackbar and Organa were next to Ech-Char when the pods were brought in. The Quarren Nossor Ri proclaimed that the honorable Ech-Char would decide their fate. After Ech-Char told Organa that her people had gone too far, Ackbar accused Ri of being involved with the attack on Organa's companions, saying that it had to be more than a coincidence that an angry mob of his supporters gathered where the guests' ship was docked. He also claimed that for someone who advocated for peace as much as he did, he associated himself with surprisingly violent individuals.\nRi swam over to Ackbar and reminded him that even his father showed respect to Ri. Ackbar reminded Ri that his father died fighting the First Order and doubted that he would respect one who simply hid, hoping the First Order would pass by. Organa shut down the argument, saying that their infighting was exactly what the First Order wanted. Gee suggested that the debate could be settled by the Ancient Rite of Challenge, which C-3PO explained was a fight to the death. Gee's personal security droid, an AQ-series battle droid, would fight on his behalf, a relic from the Battle of Mon Cala during the Clone Wars, fought between the Galactic Republic and the Confederacy of Independent Systems.\nRey defeated the droid only with the assistance of Rose Tico. Ech-Char exiled the visitors, as the law required of those who interfered with combat between two opponents. Ackbar went to see Organa and the others off in their shuttle that would take them to the Millennium Falcon, and apologized that they had to take such a shuttle to avoid the streets, which had no guarantee of safety. Organa assured him that it was not his fault, and told him that his father would have been proud of who he had become. Ackbar insisted that his father would not have been outmaneuvered by the likes of Ri or Gee the way he had been. As Organa and the others prepared to leave, a Quarren snuck a crate onto the shuttle, which resulted in an explosion that destroyed the shuttle.\nA nearby Mon Calamari cried out, unable to bear the apparent loss of Ackbar. However, Rey used the Force to levitate several crates to keep them safe. While Chewbacca, C-3PO, and Ackbar stayed behind with Organa, Rey and Tico ran after the Quarren saboteur. The former group went back to King Ech-Char, where Ackbar demanded that Organa be shown the proper respect. Organa convinced Ech-Char to give ships to the Resistance as Ackbar stood by her side. Above Mon Cala, Resistance and Mon Calamari ships alike faced a large armada of First Order Star Destroyers, with Ackbar commanding an MC95 Star Cruiser. Ackbar then jumped to hyperspace in his Star Cruiser to avoid disastrous losses.\nAckbar supplied the Resistance with several starships. He personally joined the movement to uphold his father's legacy, although his recruitment was part of the Resistance's efforts to bring more Mon Calamari to the cause as well as due to his family's connection to rebel efforts. In 35 ABY, Ackbar was stationed on the Resistance base on the moon of Ajan Kloss. When the Millennium Falcon returned from a mission, he was standing nearby with a datapad in hand as he conversed with a dark-skinned human. Later that night, he was present at a meeting where intel from the mission was discussed. When Commander Poe Dameron revealed that Darth Sidious had returned, he insisted that it was impossible due to the Emperor being dead.\nHe was later one of the few individuals allowed close to Leia Organa's bed after she died, mourning her when the Resistance said their goodbyes to her. He then stood behind his father's old comrade the human General Lando Calrissian when the Resistance was briefed prior to the Battle of Exegol. Their plan was to destroy the navigation tower that the Xyston-class Star Destroyers of the Sith Eternal's fleet, the Final Order, needed in order to take off, and thus, allow their cannons to be easily knocked out along with their main reactors. Although Ackbar agreed with Captain Beaumont Kin's idea of pulling Holdo maneuvers, the idea was shot down by former stormtrooper Finn.\nAckbar joined the Resistance in journeying to the planet Exegol. They did so by following a path to the Unknown Regions sent to them by Rey. During the battle, Ackbar piloted a Y-wing starfighter. When General Poe Dameron wondered aloud whether any reinforcements would arrive, Ackbar asked him what they should do. Dameron responded that they would have to hit the Sith Star Destroyers themselves. The reinforcements eventually arrived, and the battle resulted in the defeat of the Sith Eternal and the death of Sidious.\nAftab Ackbar greatly admired his father, Gial, and implored him to retire after a brief stint with the Resistance. When Gial was killed, Aftab felt a deep personal loss, and took it upon himself to live up to his father's legacy.\nAckbar was a Mon Calamari male with brown eyes. His eyes were bulbous and provided him a 180-degree arc of vision.\nAftab Ackbar was created for the December 2019 film Star Wars: Episode IX The Rise of Skywalker, the third and final installment of the Star Wars sequel trilogy. He was voiced by Chris Terrio, the film's screenwriter, and was played in costume by Tom Wilton. The character was first mentioned in the 2019 junior novel Spark of the Resistance, and was first pictured on the cover for Allegiance 1, illustrated by Marco Checchetto, though the Mon Calamari did not appear in the comic itself. The character pictured on the cover of Allegiance 1 was identified as Aftab Ackbar in Allegiance 2, written by Ethan Sacks, illustrated by Luke Ross, and published on October 16, 2019.\nEarly in the filmmaking process for The Rise of Skywalker, director J.J. Abrams and screenwriter Chris Terrio discussed Admiral Ackbar's death and wondered if the character could have had a child, resulting in Aftab Ackbar. Originally, Terrio was only temporarily used to voice Ackbar, but Abrams decided to keep it. In development, Aftab was referred to as \"Minibar.\" He originated in an October 2017 version of the story where he was going to appear on the planet that became Pasaana.\nAccording to merchandise released prior to The Rise of Skywalker's release, Ackbar held the rank of general. This is contradicted by the film's credits, which list him as a colonel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Aftab_Ackbar",
  "/wiki/Mon_Cala",
  "/wiki/16_ABY",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Mon_Calamari_monarchy",
  "/wiki/Mon_Cala_fleet",
  "/wiki/Resistance",
  "/wiki/Exegol_air_team",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Parent",
  "/wiki/Reproduction",
  "/wiki/Galactic_Civil_War",
  "/wiki/Battle_of_Crait",
  "/wiki/Starship",
  "/wiki/First_Order",
  "/wiki/General",
  "/wiki/Armitage_Hux",
  "/wiki/Colonel",
  "/wiki/Commander",
  "/wiki/Poe_Dameron",
  "/wiki/BTA-NR2_Y-wing_starfighter",
  "/wiki/Battle_of_Exegol",
  "/wiki/Sith_Eternal_military",
  "/wiki/Exegol",
  "/wiki/Ajan_Kloss",
  "/wiki/Planet",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Cold_War",
  "/wiki/34_ABY",
  "/wiki/Rey_Skywalker",
  "/wiki/Chewbacca",
  "/wiki/C-3PO",
  "/wiki/Rose_Tico",
  "/wiki/Mission_to_Mon_Cala",
  "/wiki/Time",
  "/wiki/Death",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Quarren",
  "/wiki/Light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Tooth",
  "/wiki/Fish",
  "/wiki/Chadkol_Gee",
  "/wiki/Quarren_Isolation_League",
  "/wiki/Helmet",
  "/wiki/Water",
  "/wiki/Mourning_Shrines",
  "/wiki/Pilot",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Ech-Char",
  "/wiki/Politics",
  "/wiki/King",
  "/wiki/Anakin_Skywalker",
  "/wiki/Standard_day",
  "/wiki/Nossor_Ri",
  "/wiki/Ancient_Rite_of_Challenge",
  "/wiki/Security_droid",
  "/wiki/AQ-series_battle_droid",
  "/wiki/Battle_of_Mon_Cala",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Droid",
  "/wiki/Shuttle",
  "/wiki/Unidentified_Quarren_saboteur",
  "/wiki/Unidentified_Mon_Calamari_(Mon_Cala)",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Mon_Calamari_system",
  "/wiki/Fleet",
  "/wiki/Star_Destroyer",
  "/wiki/MC95_Star_Cruiser",
  "/wiki/Hyperspace",
  "/wiki/Star_Cruiser",
  "/wiki/35_ABY",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Moon",
  "/wiki/Mission_to_Sinta_Glacier_Colony",
  "/wiki/Datapad",
  "/wiki/Limb",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Emperor",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Navigation_tower",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Sith_Eternal",
  "/wiki/Final_Order",
  "/wiki/Cannon",
  "/wiki/Reactor",
  "/wiki/Captain",
  "/wiki/Beaumont_Kin",
  "/wiki/Holdo_maneuver",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Finn",
  "/wiki/Unknown_Regions",
  "/wiki/BTL_Y-wing_starfighter",
  "/wiki/Eye",
  "/wiki/Neal_Scanlan",
  "/wiki/December",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/Chris_Terrio",
  "/wiki/Tom_Wilton",
  "/wiki/Spark_of_the_Resistance",
  "/wiki/Allegiance_1",
  "/wiki/Marco_Checchetto",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Allegiance_2",
  "/wiki/Ethan_Sacks",
  "/wiki/Luke_Ross",
  "/wiki/October_16",
  "/wiki/J.J._Abrams",
  "/wiki/2017",
  "/wiki/Pasaana",
  "/wiki/Category:Images_of_Aftab_Ackbar",
  "/wiki/Allegiance_3",
  "/wiki/Allegiance_4",
  "/wiki/Spark_of_the_Resistance_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2019_Topps_Star_Wars:_The_Rise_of_Skywalker_Series_1",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Eyes_Have_It",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_12",
  "/wiki/Pilots_and_Crew",
  "/wiki/Dominic_Monaghan:_Decoding_the_Dark_Side",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Allegiance",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Template:Galaxy%27s_Edge_Date",
  "/wiki/Galactic_calendar",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Water_War",
  "/wiki/Star_Wars_49",
  "/wiki/StarWarsKids.com",
  "/wiki/Battle_of_Yavin",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY",
  "/wiki/The_Skywalker_Legacy",
  "/wiki/Marvel_Comics",
  "/wiki/December_19",
  "/wiki/February_20",
  "/wiki/2020",
  "/wiki/October_6"
 ]
}