{
 "name": "Aggadeen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Sometime after the Assault on Cymoon",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Aggadeen was a male human who served as an officer in the Galactic Empire. Shortly after the Battle of Yavin, he acted as the Imperial Overseer of Weapons Factory Alpha on Cymoon 1.\nA few weeks after the Battle of Yavin, Overseer Aggadeen was stationed at Weapons Factory Alpha on the moon Cymoon 1, in the Corellian Industrial Cluster. While Aggadeen was in charge of the weapons factories on the moon, he had particular responsibly for Factory Alpha. An envoy was sent from the Outer Rim planet Tatooine. The envoy was employed by the crime lord Jabba the Hutt, and was to negotiate terms of shipping raw materials from Hutt controlled space to Imperial factories, to produce more Imperial war machines—such as TIE/ln space superiority starfighters and All Terrain Armored Transport walkers.\nAggadeen and a squad of stormtroopers awaited the shuttle that carried the Outer Rim envoy on one of the factory's landing platforms. The Overseer ordered the stormtroopers to kill the members of the envoy if they felt in any way suspicious. Three humans and an astromech droid emerged, and Aggadeen greeted them in the name of Emperor Palpatine and asked who he had the honor of addressing. The clear leader of the group called himself the official emissary of Jabba the Great, Mightiest of all Hutts, but his name was Han Solo. The pair shook hands as Solo dubbed the Overseer \"Aggie.\" The Imperials' LOM-series protocol droid confirmed Solo's identity, and Aggadeen invited them into the factory—after they had left their weapons outside. The two parties walked through the factory where Solo and \"Aggie\" conversed about the imminent negotiations. Solo told him that they should be prepared for the negotiations to be vigorous, but Aggadeen revealed to the small time smuggler that there would be no negotiations. The negotiator would state the Empire's demands and they would be accepted by the Hutt's envoy—the Empire was huge, they had no time to negotiate with criminals or anyone who could possibly slow down the Empire. Solo, unimpressed, reminded him that negotiating with criminals from the Outer Rim was not the Empire's style. The Death Star battle station undoubtedly cost billions of credits to build—many years to construct, had been destroyed, running the Empire's resources dry.\nThey soon arrived at the room where the negotiations were to be held, Aggadeen invited them inside to await the negotiator. But Solo professed to hold the negotiations on the noisy factory floor. Aggadeen questioned Solo's sanity and asked why. Solo smoothly replied that they were not there to negotiate. Solo's astromech droid, R2-D2 began leaking fluids onto the floor—the droid then electrocuted the liquid; and the stormtroopers who now found themselves standing in it. Solo and his \"bodyguards\" defeated the remaining stormtroopers in hand-to-hand combat. Aggadeen had decided that Solo truly was insane, and when he was asked for directions to the main power core, Aggadeen refused to tell them, saying that Weapons Factory Alpha was the most heavily guarded base in the galaxy. Solo ignored him and repeated his question; the proud Imperial officer refused to cooperate—until the astromech droid threatened to electrocute him as well. He pointed them in the right direction and was thanked by the female bodyguard with right hook across his jaw.\nThe Rebels moved on and rigged the power core to explode as the negotiator, Darth Vader, arrived and was alerted to the Rebel's presence when he was attacked by a sniper. Vader put the entire moon on alert. The rebels freed several slaves and commandeered an AT-AT walker. They used the walker to wreak havoc in their escape of the factory that was now a bomb. Aggadeen and other Imperials attempted to halt the power core's meltdown—but the Rebels had done their work well—the meltdown could not be stopped. Aggadeen contacted Lord Vader and requested permission to evacuate the facility. Vader vetoed his request and told him \"If this factory explodes, you had best explode with it.\" Aggadeen obeyed and was again cautioned by Vader that further failure would not be tolerated and that the Rebel invaders had to die. Vader did not want Luke Skywalker dead, however, as the Sith Lord had other plans for him.\nAfter the assault ended, Vader returned to the Imperial Palace on Coruscant, the capital of the Empire. The Sith Lord held Aggadeen responsible for the Rebel's infiltration and destruction of the factory. He brought Aggadeen to the Palace with him, where the Dark Lord had the Overseer tortured as a consequence for the assault on Cymoon 1. Vader wanted to make sure Aggadeen was not withholding any more information on the Rebel attack that he could possibly use to find Skywalker. Vader brought Emperor Palpatine before the Overseer, and Vader told his master that Aggadeen would never fail the Empire again. Ultimately, the Overseer was tortured to death.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Assault_on_Cymoon",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Imperial_officer",
  "/wiki/Battle_of_Yavin",
  "/wiki/Overseer_(assignment)",
  "/wiki/Weapons_Factory_Alpha",
  "/wiki/Cymoon_1",
  "/wiki/Standard_week",
  "/wiki/Moon",
  "/wiki/Corellian_Industrial_Cluster",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Realspace",
  "/wiki/Factory",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Walker",
  "/wiki/Squad",
  "/wiki/Stormtrooper",
  "/wiki/Shuttle",
  "/wiki/Weapons_factory",
  "/wiki/Death",
  "/wiki/Astromech_droid",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Emissary",
  "/wiki/Han_Solo",
  "/wiki/Unidentified_LOM-series_protocol_droid",
  "/wiki/Time",
  "/wiki/Smuggler",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/Credit",
  "/wiki/Standard_year",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/Bodyguard",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Reactor",
  "/wiki/The_galaxy",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Sniper",
  "/wiki/Slavery",
  "/wiki/Lord",
  "/wiki/Luke_Skywalker",
  "/wiki/Sith_Lord",
  "/wiki/Imperial_Palace",
  "/wiki/Capital",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Torture",
  "/wiki/Sith_Master",
  "/wiki/Star_Wars_(2015)_1",
  "/wiki/Star_Wars_(2015)_2",
  "/wiki/Star_Wars_(2015)_3",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy"
 ]
}