{
 "name": "Agira",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Imroosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Organa"
     ]
    }
   ]
  }
 ],
 "content": "Agira was an Imroosian female who served as a handmaiden of the House of Organa on the planet Alderaan. In 9 BBY, Princess Leia Organa convinced Agira to wear her clothing as a disguise, claiming that Queen Breha Organa would find it amusing. When the queen came to collect Leia in the Royal Palace of Alderaan, she was initially fooled by Agira's disguise but ultimately saw through the ruse when she felt the scales on the Imroosian's hands.\nAgira was an Imroosian female who served the House of Organa, the royal house of the planet Alderaan, as a handmaiden. In 9 BBY, Princess Leia Organa persuaded Agira and three other handmaidens that her mother, Queen Breha Organa, would find it amusing if Agira was disguised as Leia. The other handmaidens then dressed Agira in the princess's clothing in one of the rooms of the Royal Palace of Alderaan.\nThe queen then entered the room and, believing that the handmaiden was her daughter, began briefing Agira on an upcoming meeting with Breha's sister, Celly Organa, and her family. The queen took Agira's hand and began leading her toward the door, but she stopped when she felt the scales on the Imroosian's hands. Breha pulled back the hood concealing Agira's smiling face, after which the handmaiden revealed that Leia had come up with the ruse. The queen then left to find her daughter, who had snuck out to go shipspotting in the nearby forest.\nAgira had scaled white skin, brown eyes, and brown hair, which was intricately braided as part of her disguise.\nWhile disguised as Organa, Agira wore a white blouse, pink pants, a pair of brocaded velvet shoes, and an embroidered pink tunic and matching hooded scarf.\nAgira was portrayed by Molly Miller in the first episode of the Obi-Wan Kenobi television series, which aired on May 27, 2022. Agira's name is not spoken in the episode but appears in the credits. The character's makeup was done by Gabriel De Cunto and Scott Wheeler and took several hours to apply. Miller also served as a stunt double for young Leia Organa in the series, effectively making her Organa's double in two ways.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Agira_(disambiguation)",
  "/wiki/Imroosian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/House_of_Organa",
  "/wiki/File:Agira-OBK1.ogg",
  "/wiki/Handmaiden",
  "/wiki/Planet",
  "/wiki/Alderaan",
  "/wiki/9_BBY",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Clothing",
  "/wiki/Queen",
  "/wiki/Breha_Organa",
  "/wiki/Royal_Palace_of_Alderaan",
  "/wiki/Limb",
  "/wiki/File:Breha-Ready-OBK1.ogg",
  "/wiki/Parent",
  "/wiki/Celly_Organa",
  "/wiki/Shipspotter",
  "/wiki/Forest",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Velvet",
  "/wiki/Scarf",
  "/wiki/Molly_Miller",
  "/wiki/Part_I",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/May_27",
  "/wiki/2022",
  "/wiki/Gabriel_De_Cunto",
  "/wiki/Scott_Wheeler",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Agira",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Standard_year",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/June_23"
 ]
}