{
 "name": "Agluk",
 "display_name": "Agluk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Forest Moon of Endor"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dulok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gorneesh's tribe"
     ]
    }
   ]
  }
 ],
 "content": "Agluk was a male Dulok who lived on the Forest Moon of Endor during the Galactic Civil War. In 3 ABY, he was captured along with his tribe by a legion of Imperial stormtroopers, who they called \"Skull Ones\". Despite having had his right arm cut off, Agluk managed to escape the Imperials, but he was trapped by a band of Ewoks soon after. The Ewoks, namely Wicket Warrick, Paploo, and Princess Kneesaa a Jari Kintaka, agreed to free Agluk if he show them his village. The Dulok accepted, and the three Ewoks freed him from their trap.\nThey kept Agluk with a rope around his neck, in order to walk with him to the Dulok village. Agluk took the Ewoks through a secret cave, and since it was too dark to see, Agluk used an imprisoned Wistie named Zrani to light the way. Warrick tried to free Zrani by taking the key to unlock her cage that was wrapped around Agluk's neck as he slept. This woke Agluk, who then chased the Ewoks through the cave with a \"fire stick\" that he had stolen from the stormtroopers. Once Agluk had chased the Ewoks to the entrance of the cave, all of the blaster noise had awoken the mythical Griagh. The Griagh killed the unsuspecting Agluk, which allowed the Ewoks to get away.\nAgluk was a character in Star Wars: Ewoks—Shadows of Endor. The name \"Agluk\" was initially used for the press summary for the comic, which led to some confusion by fans on TheForce.Net forums, due to them apparently replacing the Duloks as being the Ewoks' main rivals. Zack Gilliangno later confirmed that he meant the Duloks, and the summary was edited to reflect this.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Endor/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Dulok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Gorneesh%27s_tribe",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Paploo/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Rope/Legends",
  "/wiki/Dulok_Swamp",
  "/wiki/Wistie/Legends",
  "/wiki/Zrani",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Griagh",
  "/wiki/Star_Wars:_Ewoks%E2%80%94Shadows_of_Endor"
 ]
}