{
 "name": "Ahleazah",
 "display_name": "Ahleazah",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dac"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ahleazah was a female Mon Calamari healer who served in the Alliance to Restore the Republic and later the New Republic during the Galactic Civil War.\nCaptured during the Galactic Empire's occupation of Dac, Ahleazah's skills as a healer earned her work with medical staff, while her family was put to forced labor. Ahleazah put her skills to use helping whomever she could as the occupation authority moved her from camp to camp. Her actions in saving a low level Imperial Starfleet officer earned her escape from the enslaved world. She was placed aboard his starship where she was able to make use of and learn from the advanced Imperial medical technologies.\nWhile aboard the Imperial vessel, Ahleazah tended to a captured Rebel Alliance pilot who was slated to undergo interrogation. Ahleazah aided the pilot and seized the opportunity to escape the Empire. Together the pair stowed away in an escape pod and launched just as the ship exited the Anoat system. An Alliance convoy picked up the drifting pod, and Ahleazah went on to serve the Alliance and New Republic as a healer.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Anoat_system/Legends",
  "/wiki/Heroes_%26_Rogues",
  "/wiki/Platt%27s_Smugglers_Guide"
 ]
}