{
 "name": "Ahn Rasi Tuum",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "137 ABY",
      "Daluuj"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cathar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Ahn was a Cathar male and a member of the Rasi Tuum family who served the New Jedi Order as a Jedi Master around the time of the Sith–Imperial War. Years before, he was born along with two other male littermates, Zho and a Cathar who went by their family's surname. All three brothers survived an attack against the Jedi Academy on the planet Ossus by the One Sith in 130 ABY, with the Jedi Order being dispersed across the galaxy. Seven years later, Tuum traveled to the planet Daluuj to rendezvous with Jedi Master Wolf Sazen, Jedi Knight Shado Vao, and a Human female Jedi. As Tuum and the group were discussing the possibility of searching for Sazen's former Padawan Cade Skywalker, a group of Sith revealed themselves by impaling Ahn with a spear and throwing him from the bridge where the meeting was taking place into a ravine, killing the Cathar. Vao and Sazen ultimately defeated the Sith, and resolved to find Cade Skywalker.\nAhn was a Cathar male who was born into the Rasi Tuum family. His littermates included his brother Zho and a Cathar who only went by their family's surname. Tuum and his brothers were found to be sensitive to the Force, and were subsequently trained as Jedi in the New Jedi Order, with Ahn eventually ascending to the rank of Master. Near the end of the Sith–Imperial War in 130 ABY, the One Sith attacked the Jedi Temples on the planets Ossus and Coruscant in order to fracture the Jedi. Tuum and his brothers ultimately survived the massacre, spending the next seven years hiding from the Sith, who were on a campaign to hunt down the Jedi Knights.\nIn 137 ABY, during the Second Imperial Civil War, Tuum traveled to the planet Daluuj after Jedi Knight Shado Vao convinced him to meet with Master Wolf Sazen to discuss the status of the fractured Jedi Order. Tuum and Vao rendezvoused with a Human female Jedi and Sazen over one of Daluuj's bridges and began discussing matters, including that of locating Sazen's former Padawan Cade Skywalker, whom most believed was deceased—including Tuum. Unbeknownst to Tuum and his fellow Jedi, a team of five Sith were hiding in the shadows, preparing to ambush the four Jedi. As Sazen finished expressing his belief that successfully finding Skywalker was vital, Tuum was impaled through his chest by a spear, which was thrown by one of the Sith. The Cathar Jedi was then thrown over the bridge into the ravine by the Sith, killing Tuum. Although the female Jedi was also slain by the Sith, Vao and Sazen ultimately defeated the Sith that had killed Tuum, resolving to find Cade Skywalker.\nTuum, unlike most Jedi, believed that the prospect of Jedi survivors meeting with each other was dangerous due to the bounty hunters and Sith that were searching for them. However, that did not stop him from agreeing to go with Shado Vao and meet with Wolf Sazen on Daluuj. At the beginning of the meeting with Sazen, Tuum expressed his doubts about meeting with each other. He also opined that the Zabrak's former Padawan, Cade Skywalker, was deceased and refused to believe Sazen when he insisted that Skywalker was alive. Tuum wore a brown set of Jedi robes and allowed his long brown hair to flow past his shoulders. His eyes were green, and he also sported a necklace. Tuum was similar in appearance to his two brothers.\nAhn, along with his brothers, managed to survive the Sith's initial assault against the Jedi Order. After the Massacre of Ossus, Tuum avoided detection by the Sith and bounty hunters until his death at the hands of the Sith at the ambush on Daluuj.\nAhn, along with his two brothers, was created by John Ostrander and Jan Duursema for the Star Wars: Legacy comic series. He was first featured, along with his brothers, in an image in the resource comic Legacy  0. Because Ahn's character perished in the series' second issue, the authors of The Complete Star Wars Encyclopedia used Ahn's biography in their entry for the character of Rasi Tuum. However, Legacy's twenty-fifth issue, which was released a few months before The Complete Star Wars Encyclopedia, revealed that Rasi Tuum and Ahn were two separate individuals. The issue established \"Rasi Tuum\" as Ahn's family name, but so far, no source has indicated in which order his family and given names should be placed. Ahn Rasi Tuum was penciled by Duursema in both the resource comic and Broken, Part 2.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Cathar/Legends",
  "/wiki/Ahn_Krantarium",
  "/wiki/137_ABY",
  "/wiki/Daluuj/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Rasi_Tuum_family",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Time/Legends",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Standard_year/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Litter_(biology)",
  "/wiki/Zho_Rasi_Tuum",
  "/wiki/Rasi_Tuum",
  "/wiki/Massacre_at_Ossus",
  "/wiki/Jedi_Academy_(Ossus)",
  "/wiki/Planet/Legends",
  "/wiki/Ossus/Legends",
  "/wiki/One_Sith",
  "/wiki/130_ABY",
  "/wiki/Jedi/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Ambush_on_Daluuj",
  "/wiki/Wolf_Sazen",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Shado_Vao",
  "/wiki/Human/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Sith/Legends",
  "/wiki/Spear/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Bridge",
  "/wiki/Death/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/New_Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Third_Jedi_Purge",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Jedi_apparel",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Necklace/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_0",
  "/wiki/Legacy_(2006)_2",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Legacy_(2006)_25",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Battle_of_Coruscant_(Sith%E2%80%93Imperial_War)",
  "/wiki/Legacy_(2006)_1"
 ]
}