{
 "name": "Ahnjai Rahmma",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Srrors'tok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Golden"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Antinnis Tremayne"
     ]
    }
   ]
  }
 ],
 "content": "Ahnjai Rahmma was a Srrors'tok warrior. He worked for High Inquisitor Antinnis Tremayne for a time onboard the Imperial II-class Star Destroyer Interrogator. As Tremayne's servant, Rahmma acted as a personal bodyguard and assassin.\nRahmma, like others of his species, was a bipedal felinoid with large ears, short golden fur, sharp fangs, and a long tail. He generally wore only a body pouch, containing an Imperial ID, a few credits, and a simple toolkit. His muscular build and predatory appearance made him an intimidating figure, often able to force an opponent to his knees simply by growling a command. Like other Srrors'tok, he spoke Basic with difficulty, able only to slowly speak simple words. As a mark of forced servitude, he usually remained silent, and refused to use the native gestural language of his people.\nThrough a series of as-yet unrevealed events, High Inquisitor Tremayne earned Rahmma's service through a life debt. Under Srrors'tok law, Rahmma was forced to completely fulfill this life debt, or take his own life. While Rahmma's honor forced him to serve Tremayne loyally and diligently, the Srrors'tok found both Tremayne and the Empire to be distasteful and immoral. He was particularly angered by Tremayne's habit of treating him like a pet, and by the taunts Tremayne frequently directed at Rahmma in front of others.\nThere only two ways for Rahmma to end the humiliation: to die in the Empire's service, or to somehow find himself similarly indebted to one of the Empire's enemies. Of course, his honor forbade him to seek out the latter possibility. If he were ever freed, however, he would have tried to kill Tremayne.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Srrors%27tok",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Antinnis_Tremayne",
  "/wiki/High_Inquisitor",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Interrogator/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Life_debt/Legends",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}