{
 "name": "Ahr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "During the Imperial Era",
      "Kankalo Belt Containment Zone"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Imperial Navy",
      "Imperial Officer Corps",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Ahr was a human male Moff and governor of a Mid Rim sector who commanded a Venator-class Star Destroyer in the Galactic Empire's navy. Along with the Sith Lord Darth Vader, he was assigned to neutralize a threat on Namzor. However, during the Namzor counter-insurgency, Vader committed insubordination, resulting in Ahr contacting Emperor Palpatine, who ordered Vader to abide by all the governor's directives.\nAhr and Vader went on to liquidate threats on Ahn Krantarium and Phelzepham, both of which resulted in successes. After dealing with the three problems, the Moff wanted Vader to kill a creature as a test, but the Sith Lord had other plans. After seeing the creature from his starship, Vader turned around and made it rupture the bridge, grasping and killing Ahr in space.\nAhr served as the Moff and governor of a Mid Rim sector in the Galactic Empire as well as the commanding officer of a Venator-class Star Destroyer in the Imperial Navy. During the Imperial Era, as part of a pacification operation, he was sent to deal with insurgents on the Mid Rim astronomical object Namzor with the Dark Lord of the Sith Darth Vader. However, the insurgents had set up their base over a coaxium hypermatter deposit. Ahr, who had been instructed to obtain the coaxium, ordered all starfighters to return to the Star Destroyer to avoid damaging the coaxium. The Alpha-3 Nimbus-class V-wing starfighters withdrew, but Vader, in his starship, did not. Despite the Moff ordering the Sith Lord to pull back, Vader continued attacking the base until he destroyed both the insurgents and the coaxium deposit.\nA very displeased Ahr contacted Emperor Palpatine via hologram to report Vader's failure to follow orders, his arriving unannounced, and his destruction of the valuable coaxium. However, Vader disagreed, stating that he had destroyed the insurgents so that they could not escape. Palpatine questioned Vader about his awareness of the governor's orders and then commanded Vader to follow all of Ahr's orders as if they were from Palpatine himself until he had learned his lesson. Vader was angry about the outcome, seeing himself as nothing more than a slave to others.\nAfterward, the Moff traveled to the Mid Rim astronomical object Ahn Krantarium to eliminate a dangerous group of self-rebuilding droids. He sent out a stormtrooper patrol, but all of them perished, so instead of deploying more of them, Ahr sent out Vader. The Sith Lord destroyed all the droids in the vicinity, surprising Ahr, who ate some food after the completion of Vader's mission. Next, the governor went to the Mid Rim moon Phelzepham to liquidate more insurgents. Ahr deployed Vader and multiple stormtroopers, who captured the moon within an hour. The stormtroopers were withdrawn by Ahr beforehand while he left Vader to finish the work.\nThe governor decided to head to the Kankalo Belt Containment Zone despite the protests of a subordinate of his. He sent out Vader in his starship to destroy the greatest threat there—the Kankalo Belt creature. Since Vader saw Ahr as his biggest threat, when he saw the creature, he turned back toward the Star Destroyer—with the creature following him—to eliminate the Moff. When Vader returned, Ahr was angry with him and ordered that he kneel before him as the Emperor commanded. When Vader kneeled, the creature clawed into the Star Destroyer's bridge to grab Ahr away, killing him and multiple other personnel in the vacuum of space. The Emperor then sensed the governor's death and saw that Vader had learned his lesson.\nAhr was a human male with gray hair, brown eyes, and light skin. He tested Vader for pleasure by sending him on dangerous missions to see if the Sith Lord would be killed.\nAhr wore a gray-green Imperial officer's uniform with the rank insignia of Moff and four code cylinders.\nAhr appeared in the comic Age of Rebellion - Darth Vader 1, the final one-shot in the anthology series Star Wars: Age of Rebellion, which was written by Greg Pak, penciled by Ramon Bachs, and published by Marvel Comics on June 26, 2019.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Imperial_Era",
  "/wiki/Kankalo_Belt_Containment_Zone",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Imperial_Navy",
  "/wiki/Moff",
  "/wiki/Governor",
  "/wiki/Unidentified_Mid_Rim_sector",
  "/wiki/Commanding_officer",
  "/wiki/Ahr%27s_Venator-class_Star_Destroyer",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Attack_on_Namzor",
  "/wiki/Namzor",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Pacification_of_Ahr%27s_sector",
  "/wiki/Ahn_Krantarium",
  "/wiki/Phelzepham",
  "/wiki/Death",
  "/wiki/Unidentified_creature_(Kankalo_Belt_Containment_Zone)",
  "/wiki/Vader%27s_starship",
  "/wiki/Bridge_(starship)",
  "/wiki/Realspace",
  "/wiki/Namzor_insurgents",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Coaxium",
  "/wiki/Hypermatter",
  "/wiki/Starfighter",
  "/wiki/Star_Destroyer",
  "/wiki/Alpha-3_Nimbus-class_V-wing_starfighter",
  "/wiki/Hologram",
  "/wiki/Slavery",
  "/wiki/Attack_on_Ahn_Krantarium",
  "/wiki/Droid",
  "/wiki/Stormtrooper",
  "/wiki/Foodstuff",
  "/wiki/Moon",
  "/wiki/Attack_on_Phelzepham",
  "/wiki/Phelzepham_insurgents",
  "/wiki/Standard_hour",
  "/wiki/Ahr%27s_subordinate",
  "/wiki/Starship",
  "/wiki/Vacuum",
  "/wiki/Force_sense",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Code_cylinder",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Age_of_Rebellion_-_Darth_Vader_1",
  "/wiki/Star_Wars:_Age_of_Rebellion_(comic_series)",
  "/wiki/Greg_Pak",
  "/wiki/Ram%C3%B3n_F._Bachs",
  "/wiki/Marvel_Comics",
  "/wiki/June_26",
  "/wiki/2019",
  "/wiki/Category:Images_of_Ahr"
 ]
}