{
 "name": "Aimee_Kraeff",
 "display_name": "Aimee Kraeff",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ord Mantell"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Between 30-20 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Aimee Kraeff, better known by her stage name, Flutterplume, was a female Human native to the Mid Rim world Ord Mantell during the Galactic Civil War.\nThe daughter of Corellian settlers, Aimee Kraeff was raised in the farming village of Redlake, a small settlement on the edge of the Scraplands near Worlport. Working to support her family, Kraeff eventually abandoned her home in the Scraplands in hope of finding a better existence elsewhere. A teenager alone in the wastes, Kraeff was beset by Savrips in an attack that left her severely scarred and half-dead. Rescued by nomads, she was nursed back to health in the village before being taken to Worlport.\nWhile participating in underground blood sports to survive on the streets, Kraeff discovered a knack for fighting and eventually earned a reputation for herself. Going by the stage name \"Flutterplume\", so called for her exotic outfit and feathered mask and its resemblance to the bird of the same name, Kraeff managed to get a stable income to support herself and her apartment in Westwall District. Taking on four fights a week, Flutterplume hoped to make herself a small fortune so as to better help her parents, whom she sent credits to on a regular basis. When not fighting, Kraeff used a pair of vibroknucklers for her own protection on the streets.\nDuring the Galactic Civil War, the gambler Illo Vandin wanted to see Kraeff throw her match to bring shame upon one of her avid fans and the Herglic's rival, the Pirate Queen of the Veiled Sorority. Sending agents to speak with her on three occasions, Vandin had grown impatient with her commitment to winning the bout. At the same time, Kraeff was concerned with the well-being of her family, who unbeknownst to her, had been abducted by slavers and taken to the town Rusty Reach.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/30_BBY/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Redlake",
  "/wiki/Scraplands/Legends",
  "/wiki/Worlport/Legends",
  "/wiki/Mantellian_Savrip/Legends",
  "/wiki/Mantellian_flutterplume/Legends",
  "/wiki/Vibroknuckler/Legends",
  "/wiki/Gambler/Legends",
  "/wiki/Illo_Vandin",
  "/wiki/Herglic/Legends",
  "/wiki/Pirate_King",
  "/wiki/Veiled_Sorority/Legends",
  "/wiki/Rusty_Reach",
  "/wiki/Mask_of_the_Pirate_Queen"
 ]
}