{
 "name": "Aimi_Loto",
 "display_name": "Aimi Loto",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 26 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Aimi Loto was a female Human, who worked as a droid mechanic and was a member of the Alliance to Restore the Republic during the Galactic Civil War.\nAimi's mother was called M'lay Loto and disappeared many years before the Galactic Civil War. Loto worked as a droid mechanic and along with her partner, MdZ-BLK, she traveled from system to system carrying out acts of sabotage, to destroy Imperial equipment and personnel. When Moff Nile Owen organized a wedding for his daughter, Loto and MdZ-BLK reprogrammed protocol droids belonging to attendants of the wedding, so that they would explode or attack stormtroopers during the celebration. As short time afterwards, she encountered General Airen Cracken on Karvoss II, when his R2 unit malfunctioned. Cracken planned to attend the wedding of Owens' daughter, to help aide in the defection of the Moff's assistant, so Loto warned him to stay away from the protocol droids. Somewhen afterwards, she traveled with MdZ-BLK to Kwenn Space Station, to carry out some more sabotage.\nLoto was more comfortable around droids than she was around organic beings. She was warm and friendly when dealing with droids, but became quiet and withdrawn when she spoke to organics. She wore armor and a blast helmet, to make herself appear more mechanical. She also believed that droids should have the same rights as other beings and felt very guilty about how she was destroying droids during her work for the Alliance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/26_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/M%27lay_Loto",
  "/wiki/MdZ-BLK",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Nile_Owen",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Karvoss_II",
  "/wiki/R2-series_astromech_droid",
  "/wiki/Kwenn_Space_Station/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Blast_helmet/Legends",
  "/wiki/Cracken%27s_Rebel_Operatives"
 ]
}