{
 "name": "Ait Convarion",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "7 ABY",
      "The Graveyard"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ait Convarion was a Human male who was a commander in the Imperial Navy, and captain of the Victory II-class Star Destroyer, Corrupter. He was described as a small, lean man with thick black hair and blue eyes, and the most aggressive of Ysanne Isard's four Star Destroyer captains during the Bacta War. He believed strongly in the Galactic Empire, and was very loyal to Isard.\nPart of Rogue Squadron's strategy was to hijack bacta convoys during the Bacta War and give the bacta away to anyone who needed it. The Thyferran Minister of Trade, Fliry Vorru had been raising the price of bacta to strangle the New Republic and hamper their efforts in fighting the Krytos virus. Isard sent Convarion after the Rogues as he had success in the Outer Rim chasing down pirate gangs. During one mission, he discovered three of the freighters in the convoy were missing. He had his officers plot possible coordinates for the rogue freighters. Upon arriving at the destination, he found Rogue Squadron making off with the third  freighter, the Xucphra Alazhi. He opened fire, destroying the Xucphra Alazhi, one of Rogue Squadron's fighters piloted by the Shistavanen, Riv Shiel. It was believed Gavin Darklighter was also killed, but the pilot managed to escape to hyperspace first. Also killed were two Twi'lek pilots from the Chir'daki squadron.\nIsard was impressed by his actions although she was angry that Convarion had made up his mind to attack the convoy before assessing the situation. She demoted him to captain and gave him another job to do. She ordered him to exact vengeance on worlds who hadn't paid for the bacta they'd received from Wedge Antilles. He followed orders, and picked his first target, the colony world Halanit. He bombarded the planet from orbit, and allowed his TIE Interceptors and stormtroopers to finish the job.\nThrough the efforts of a spy Fliry Vorru had planted in Talon Karrde's organization by the name of Melina Carniss, Isard discovered there would be a secret rendezvous in the Graveyard—the name used for the asteroid belt which was all that was left of the planet Alderaan, after it was destroyed by the Death Star I. Here, along with the help of the Interdictor Cruiser, Aggregator, he trapped Rogue Squadron, intending to finish them. Before he could kill them, the Valiant arrived after responding to Tycho Celchu who was running the IFF transponder of the Another Chance. The ship took Convarion completely by surprise and Wedge Antilles was able to destroy Convarion's ship bridge by firing two proton torpedoes at him through the Corrupter's viewport. Convarion was instantly killed and the Corruptor was chewed up by the Graveyard.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/The_Graveyard",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Victory_II-class_Star_Destroyer/Legends",
  "/wiki/Corrupter/Legends",
  "/wiki/Ysanne_Isard",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Bacta_War",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Thyferra/Legends",
  "/wiki/Minister_of_Trade",
  "/wiki/Fliry_Vorru",
  "/wiki/New_Republic/Legends",
  "/wiki/Krytos_virus",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Xucphra_Alazhi",
  "/wiki/Pilot/Legends",
  "/wiki/Shistavanen/Legends",
  "/wiki/Riv_Shiel",
  "/wiki/Gavin_Darklighter",
  "/wiki/Hyperspace/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Chir%27daki",
  "/wiki/Planet/Legends",
  "/wiki/Halanit",
  "/wiki/Destruction_of_Halanit",
  "/wiki/Orbit/Legends",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Talon_Karrde",
  "/wiki/Melina_Carniss",
  "/wiki/Asteroid_belt",
  "/wiki/Alderaan/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Immobilizer_418_cruiser/Legends",
  "/wiki/Aggregator",
  "/wiki/Valiant_(Thranta-class_War_Cruiser)",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Transponder_code",
  "/wiki/Another_Chance",
  "/wiki/Proton_torpedo/Legends",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}