{
 "name": "Aja_Sen",
 "display_name": "Aja Sen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown with gray topknot"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tansarii Point Station"
     ]
    }
   ]
  }
 ],
 "content": "Doctor Aja Sen was a female Bothan medic who lived during the Galactic Civil War.\nFollowing the Battle of Yavin, Aja Sen resided aboard Tansarii Point Station, in the Bright Jewel system. During that time, she worked in the medical bay of Tansarii Point Station, along with the nurse Alisia and the 2-1B surgical droid Billingsly, treating injured and sick beings on the station.\nIn 1 ABY, the health situation on Tansarii Point Station had become very problematic due to voracious beasts present in the station's atrium and Hutt thugs active in lower levels of the station. In addition, a war erupted between the Car'das controlling Tansarii Point Station and the Rak'qua living in the neighboring Station Gamma. This led to an abnormal number of hurt people that required care and the medical staff of the station barely handled the situation.\nAround the same time, a medic arrived on Tansarii Point Station with Han Solo and Chewbacca aboard the Millennium Falcon. Solo recommended the medic who was looking for work to visit the medical bay of the station. The medic first helped Aja to treat an injured mechanic who burned his hand while repairing a starfighter. The medic was then dispatched to handle a medical emergency on the lower level of the station. An accident took place in Storage Room 01 and a technician was poisoned as he inhaled too much smoke. Billingsly was able to prepare an antitoxin and the medic successfully treated the injured technician. The droid eventually granted the medic a Polis Massan bracelet and a medic uniform as a reward for the assistance provided to the medical staff of Tansarii Point Station.\nIn the meantime, Aja Sen grew increasingly concerned about the hostilities between Tansarii Point Station and Station Gamma. She therefore hired a spacer involved in the fightings to kill several Rak'qua warriors in Station Gamma and bring her back Rak'qua blood samples. The spacer succeeded in the mission and Aja then performed tests to analyze Rak'qua DNA.\nAja Sen appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Aja Sen was added to the game as part of the \"New Player Tutorial\", introduced with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Inaldra/Legends",
  "/wiki/Inaldra%27s_Lieutenant",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Doctor/Legends",
  "/wiki/Medic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Billingsly",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/Sick_bay",
  "/wiki/Nurse/Legends",
  "/wiki/Alisia_(Gran)",
  "/wiki/2-1B_surgical_droid",
  "/wiki/1_ABY/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Car%27das/Legends",
  "/wiki/Rak%27qua",
  "/wiki/Station_Gamma",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Kallidahin/Legends",
  "/wiki/Blood/Legends",
  "/wiki/DNA/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}