{
 "name": "Ajai Fel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ajai Fel was the wife of Todr Fel and the mother of Fyric Fel. Her brother-in-law was Baron Soontir Fel, and she lived on the estate Soontir had gained through his barony. Nearly five years after the Battle of Yavin, her son Fyric was kidnapped by Ilir Post as part of an Imperial Intelligence-backed plot to force the Fels to reveal the location of Wynssa Starflare, Soontir Fel's wife, as Soontir had defected to the New Republic. Rather than betray her family, Fel and her husband used the Corellian Security Force investigators assigned to the kidnapping case and three Rogue Squadron pilots sent by Wedge Antilles, Starflare's brother, to expose Post so that Todr could kill him and rescue Fyric. They accepted the Rogues' offer to join Soontir in the New Republic, where their family would be safer.\nAs a young woman, Ajai married Todr Fel, the younger brother of Imperial fighter ace Soontir Fel. She became part of the Fel family, which was defined by deep loyalty to each other and a sense of duty. Around late 2 ABY, she gave birth to their son, Fyric.\nIn 3 ABY, the Fels moved into far more luxurious conditions when Soontir, who had achieved great fame as an Imperial pilot, was made a Baron of the Empire and given a massive estate on Corellia. All Soontir's relatives were moved to the estate, where they lived comfortably. The Fels were joined there by Wynssa Starflare, Soontir's wife, and her two children, Chak and Davin. Fel and the rest of her family were trusted with the dangerous knowledge that Starflare had been born Syal Antilles, and was the brother of Rebel Alliance hero Wedge Antilles. For that reason, Starflare had plans to flee if her identity was ever exposed to Ysanne Isard, the Director of Imperial Intelligence and a nemesis of Soontir Fel.\nAround nine months after the Battle of Endor, Soontir was captured by the New Republic in an engagement over Brentaal IV. Starflare, fearful of Imperial retaliation, took Chak and Davin and went into hiding.\nAround ten months after the Battle of Endor, Fyric was kidnapped from the estate. The Fels were given a notice to meet the kidnappers at an alley rendezvous, but resolved to resist. They understood that it was an attempt by Imperial Intelligence to pressure them into disclosing Starflare's location, and would not turn on a family member. Corellian Security Force investigators Corran Horn and Iella Wessiri were sent to investigate and began inspecting the estate and interviewing the Fels. Later that day, three strangers came by the estate, claiming to be friends. Before Horn turned them away, Todr was able to deduce that they had been sent by Wedge Antilles, and got the location of their docking bay.\nThe Fels concocted a ploy to find the kidnappers and rescue Fyric. Fel took a hologram of her son, with a tracking device embedded, and went to see the three New Republic pilots. She claimed that the rest of the family refused to betray Starflare to help Fyric. She demanded that they rescue her son, and offered to give up Starflare's location for her. They were uneasy with her willingness to turn over Starflare, but as Fel knew that she would be safe in the New Republic, she did not see an issue. They agreed, and Fel gave the three—Isplourrdacartha Estillo, Wes Janson, and Derek Klivian—the location of the meeting that the kidnappers had set up.\nIn the meeting, the New Republic pilots passed the hologram to Ilir Post, the leader of the Imperial Intelligence-backed kidnappers. Todr used the tracking signal to trace Post to his hideout, and when the New Republic pilots, working with Horn and Wessiri, stormed it and drew out Post, Todr shot him and retrieved Fyric. The Rogue Squadron pilots offered all the Fels safe haven in the New Republic, to which Soontir had defected, and Todr came back to the Fel estate to consider it. Fel and her husband decided to take Fyric to safety in the New Republic, and packed up to leave with the Rogues. Their starship came under attack by mercenaries hired by Imperial Intelligence, but timely intervention by Horn allowed the group to leave the system safely.\nAjai Fel was extremely loyal to the rest of the Fels, and was willing to take great risks for them, as when she participated in the dangerous plot to rescue Fyric without giving up her sister-in-law. She remained collected and able to carry out the plan despite her worry over her missing son. Fel was able to convincingly deceive the pilots of Rogue Squadron into believing her a distraught mother when in fact she was manipulating them into aiding her, suggesting she had some talent at dissembling as well.\nThe character of Ajai Fel was created by Michael A. Stackpole, who wrote Star Wars: X-Wing Rogue Squadron: Family Ties, the only source in which Fel appears.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Todr_Fel",
  "/wiki/Fyric_Fel",
  "/wiki/Baron_of_the_Empire/Legends",
  "/wiki/Soontir_Fel/Legends",
  "/wiki/Fel_estate",
  "/wiki/5_ABY/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Ilir_Post",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Syal_Antilles_Fel",
  "/wiki/Corellian_Security_Force",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Ace/Legends",
  "/wiki/Fel_dynasty",
  "/wiki/2_ABY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Chak_Fel",
  "/wiki/Davin_Fel",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Ysanne_Isard",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Battle_of_Brentaal_IV_(Galactic_Civil_War)",
  "/wiki/Brentaal_IV/Legends",
  "/wiki/Mission_to_Corellia_(Rogue_Squadron)",
  "/wiki/Corran_Horn",
  "/wiki/Iella_Wessiri_Antilles",
  "/wiki/Hangar/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Isplourrdacartha_Estillo",
  "/wiki/Wes_Janson/Legends",
  "/wiki/Derek_Klivian/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Corellian_system",
  "/wiki/Michael_A._Stackpole",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Family_Ties",
  "/wiki/X-Wing_Rogue_Squadron_26",
  "/wiki/X-Wing_Rogue_Squadron_27",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/X-Wing_Rogue_Squadron_25",
  "/wiki/The_Official_Star_Wars_Fact_File_122",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_In_the_Empire%27s_Service"
 ]
}