{
 "name": "Ajuur",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Mottled brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Taris dueling ring"
     ]
    }
   ]
  }
 ],
 "content": "Ajuur was a Hutt who found work as a bookmaker for the Exchange, a criminal syndicate, in the Upper City Cantina of the planet Taris. He also owned a combat arena where duels to the death were broadcast as a spectator sport.\nIn 3956 BBY, the Sith Empire conquered Taris from the Galactic Republic and outlawed death matches, forcing Ajuur to make battles non-lethal. Nevertheless, the sport remained popular, with gladiators such as Ice, Gerlon Two-Fingers, Marl, Twitch, and Deadeye Duncan rising to fame.\nAjuur, however, held no qualms about organizing illegal duels for the most famed and mightiest of warriors. When the amnesiac Republic soldier Revan quickly rose as the new champion, Ajuur was ecstatic and offered to have him engage in a death match against the legendary champion Bendak Starkiller. Though Bendak himself was thrilled at this prospect, Revan ultimately refused.\nDuring the Clone Wars, a clone trooper made a joke about Ajuur: \"The Captain put you on the test in Ajuur the Hutt's arena, are you ready to fight?\" When another asked \"Why\", he answered \"because you laugh!\" \nAjuur first appeared as a non-player character in Star Wars: Knights of the Old Republic, a 2003 video game produced by BioWare. In the game, the player, Revan, can choose to fight in his arena. However, the nature of the encounter is such that it does not progress any plot, nor does it change the player's alignment. Therefore, it is undetermined whether Revan ever interacted with him and, if so, what form that interaction took.\nIf the player defeats all other duelists in the ring, Ajuur offers to set up a death match with Starkiller in a non-canonical dark side outcome. Upon successfully defeating Starkiller, Ajuur gives the player their pay along with Bendak's blaster. Ajuur can also be persuaded or threatened to increase the reward. Additionally, there is a bug in the game that can result in him giving the player Bendak's blaster twice.\nHis voicework was provided by Neil Kaplan. Unlike most non-Basic speaking characters in the game, he would speak his name if it was in the subtitles. He would also say Bendak Starkiller's name under similar circumstances. He shares this trait with Gluupor and Motta.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ajuur-class_heavy_cruiser",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Taris",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Taris_dueling_ring",
  "/wiki/Exchange",
  "/wiki/Upper_City_Cantina",
  "/wiki/Planet/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Death/Legends",
  "/wiki/3956_BBY",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ice_(duelist)",
  "/wiki/Gerlon_Two-Fingers",
  "/wiki/Marl",
  "/wiki/Twitch_(Rodian)",
  "/wiki/Deadeye_Duncan",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Revan/Legends",
  "/wiki/Gorse_Bendak",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Mandalorian_blaster",
  "/wiki/Neil_Kaplan",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Gluupor",
  "/wiki/Motta",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(video_game)",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}