{
 "name": "Ak'ghal Usar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Urkupp"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Before 3996 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dashade"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Various implants on his back and his torso"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eternal Alliance"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "The Commander"
     ]
    }
   ]
  }
 ],
 "content": "Ak'ghal Usar, titled as the Last Lord of Urkupp, was a Dashade warrior that survived the destruction of his homeworld, Urkupp.\nSometime during the Great Sith War, Urkupp was rendered lifeless and the entire Dashade species was nearly destroyed. Usar was among the handful of survivors, and blamed the Dark Lord Exar Kun for the destruction of his home. With the thought of revenge in his mind, Usar followed Kun to Yavin Four. However, the Dashade found most of the moon in ruin, with only a handful of Kun's Massassi worshipers still alive. They spoke of Kun's ascension to an immortal spirit, deeply angering the Dashade, who realized that his vengeance was out of reach. However, Usar eventually located the Temple of Sacrifice on Yavin, which he believed could restore Kun's body and allow for an attack. But when attempting to use the Temple, a \"black-eyed Sith\" approached and subdued the vengeful monster, imprisoning Usar in stasis within a cave on the moon.\nSometime later, around 3631 BBY, a research team led by Talos Drellik came to Yavin Four to understand the mechanisms of the Temple of Sacrifice. After meeting with the legendary Outlander, the team made significant progress in their findings, uncovering a group of artifacts and tablets with unknown origins and purposes. When the Outlander returned to the moon, they were able to solve the mystery of the tablets and unlock a hidden chamber within a cave: the chamber where Usar was imprisoned. Unlocking the chamber also subsequently freed the Dashade warrior from stasis, who confronted the Outlander. After admitting to being hungry for his long years of imprisonment, Usar attacked his liberator, only to be bested. Beaten, Usar demanded his life, saying he still required revenge on Kun and the \"Black-eyed Sith\".\nThe Outlander was intrigued by the Dashade, and allowed him to explain his brief past. When realizing that the \"Black-eyed Sith\" was the Immortal Emperor, Valkorion, the Outlander revealed that both he and Kun were already dead. Usar was enraged, believing that he could never truly avenge the countless Dashade lives lost to Kun. But the Dashade warrior still hungered for blood, and promised to serve the Outlander as long as they fought mutual enemies. But the Outlander was concerned of Usar's blood thirst and motives, being forced to make a choice: recruit the Dashade into the Alliance, keep him imprisoned, or let him roam freely.\nAk'ghal Usar is a character in Star Wars: The Old Republic, a massive multiplayer online role-playing game. Appearing in the game's fifth expansion, Star Wars: The Old Republic: Knights of the Fallen Empire, Usar can be recruited by the player in the side-mission, \"Reclaimed Treasure\", only after completing \"Chapter 12: Visions in the Dark\" and another side mission, \"Fighting Power with Knowledge\". The mission itself involves the player completing a small puzzle before meeting the Dashade, in which the player can decide to recruit Usar as an accessible companion, or reject him entirely.\nWhen meeting the Sith Inquisitor class, Usar might make mention of Khem Val, another Dashade companion who has previous ties with the Inquisitor.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Urkupp",
  "/wiki/3996_BBY",
  "/wiki/Dashade/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Eternal_Alliance",
  "/wiki/Alliance_Commander",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Species/Legends",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Massassi/Legends",
  "/wiki/Temple_of_Sacrifice",
  "/wiki/Tenebrae",
  "/wiki/3631_BBY",
  "/wiki/Talos_Drellik",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith_Inquisitor",
  "/wiki/Khem_Val",
  "/wiki/The_New_Essential_Chronology"
 ]
}