{
 "name": "Akaavi Spar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamar"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3670 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Spar"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Eternal Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Akaavi Spar was a Zabrak female and a Mandalorian warrior of Clan Spar, who lived during the tumultuous time of the Great Galactic War and the subsequent Cold War between the Galactic Republic and reconstituted Sith Empire. While away with a lover, Spar's clan was destroyed by the Sith Empire on false criminal charges, and when her lover's clan refused to rally to the aid of hers, Spar set out alone to seek revenge. Joining the crew of an up-and-coming smuggler on Balmorra, Spar traced the conspiracy against her clan through the Imperial hierarchy, confronting Moff Tyrak and Major Stanwu in pursuit of the truth, before discovering that the attack on her clan had come as the result of lies told to the Empire by the Mandalorian pretender, Tayari Rook. Spar tracked Rook and his false clan to the planet Nal Hutta, where she struck down Rook and any of his criminal compatriots that didn't flee, claiming vengeance for the death of her clan.\nBorn a member of the respected Mandalorian Clan Spar, Akaavi Spar was a female Zabrak. At the age of three, Spar left her mother to begin her Mandalorian training under her father; this was tradition in the Mandalorian culture, though Spar began several years prior to the more typically accepted age of eight years old. Trained in the use of a blaster and jetpack from youth, Spar possessed few if any friends during her childhood, but quickly became one of her clan's best warriors. When she was only eight years old, Spar killed an abusive Abyssin mercenary with an improvised flamethrower, earning her the nickname of \"Firehand\" among her clan mates. At the age of thirteen, Spar completed her Mandalorian right of passage known as the verd'goten, ascending into adulthood. She embarked on a career as a bounty hunter, working with the Sith Empire the Mandalorians under Mandalore the Vindicated had allied with during the Great Galactic War, capturing or killing individuals ranging from common criminals to Jedi.\nAs an adult, Akaavi Spar met and fell in love with fellow Mandalorian warrior, Zadik Lone, and left Clan Spar to join Lone's clan. Her departure spared Spar from the fate of her clan, destroyed by the Sith Empire on false charges of treason. When Spar learned of this, she called upon her lover's clan for assistance in rallying support for Clan Spar, but the members of Clan Lone refused to provide help, despite the culture's traditional expectation to offer aid to any other Mandalorian in need. Disgusted by their inaction, Spar ended her relationship with Zadik and abandoned Clan Lone in order to seek out vengeance against those within the Empire who were responsible for her clan's demise.\nEventually, Akaavi and another survivor of her clan became mercenaries employed by the Empire. In 3642 BBY, they were stationed in Balmorra during the battle that raged there, between Empire and the Balmorran resistance, the latter directly supported by the Galactic Republic. Akaavi and an Imperial troop contingent encountered the smuggler later known as Voidhound during his infiltration in the Okara Droid Factory. She refused to accept the Imperials' order to attack the smuggler, joining forces with Voidhound instead, slaying the entire squad of Imperial soldiers. She then asked the Smuggler to give her access to Moff Tyrak, since she wanted to know why the Moff was working with the Resistance and against Imperial interests.\nAkaavi joined forces with the smuggler once again to infiltrate Camp Vigil so the smuggler would help her rescue her fellow Mandalorian, a captive of the Empire after her betrayal. However, when they arrived in the cell block the Mandalorian had already been executed. With this turn of events, Akaavi, now the sole survivor of Clan Spar, unleashed her anger at the Imperial forces by destroying the entire base with Voidhound's support.\nAkaavi later assisted the smuggler at the Balmorran Arms Factory during an Imperial ambush. Once all the attackers were dispatched, Akaavi confronted Tyrak over the execution of her clan. However, to her surprise, the man standing before her was not the sadistic Moff she had imagined. Tyrak explained he had only ordered Clan Spar's destruction because he was just given an execution order and he signed it without knowing if her clan was guilty or not. Though Akaavi wanted to kill the Moff still, the smuggler encouraged her to give Tyrak to the Republic so his information can be used against the Empire. Akaavi accepted the Voidhound's reasoning and mentioned that without a clan, she suggested that she join the smuggler's crew as an extra gun.\nLater, when the Voidwolf revealed that Darmas Pollaran and Senator Bevera Dodonna were working with the Empire, Akaavi realized that half the Imperial leadership on Balmorra executed by the Voidwolf were the enemies of Rogun the Butcher.\nBefore long, Akaavi discovered the identity of the Imperial officer who sent the order for her clan's execution: Major Stanwu, a liaison for bounty hunters. Upon hearing that Stanwu was on Nar Shaddaa for recruitment, she decided it was time to set herself up as a hunter-for-hire and wait for the right moment to shoot the Major on sight. However, as he was laid at Akaavi's mercy, Stanwu panicked and confessed that he had been given evidence of Clan Spar's \"crimes\" by a fellow Mandalorian named Tayari Rook. Akaavi, angered even further, left Stanwu alive to report her findings to the Voidhound.\nAkaavi spent time digging up information on Tayari Rook, but could not find anything on how he had earned the name \"Mandalorian.\" Further investigation showed that Rook was nothing more than a conman, setting himself as the head of his criminal enterprise under the guise of \"Clan Rook.\" Even worse was that the disgraced Clan Lone, including Akaavi's former lover Zadik, had joined forces with Rook and his crew. Akaavi had tracked all her enemies down to Nal Hutta, where they were doing business with the Hutt Cartel. Finding Clan Rook's discipline seriously lacking, she had an easy time killing all those who stood in her way one by one; some of Clan Lone, however, were smart enough to escape. Before Akaavi killed Tayari Rook, he confessed that he only sold Clan Rook to the Empire to gain a profitable contract.\nWith her clan avenged, Akaavi decided to stay with the Voidhound, grateful for the the assistance they had given her. At one point, she had some trouble with Languss Tuno, who was staring at her in an \"inappropriate way\" thrice. She threatened to gouge his eyes out if he didn't stop. Tuno decided to keep a respectful distance after that.\nDuring the Eternal Empire's Conquest, the smuggler went missing. Some time afterward, Mandalore summoned all of the Mandalorians to him. Akaavi went back to bounty hunting before eventually teaming up with the tech slicer Mako, after they both tracked a target to Hoth. The two became a bounty hunting duo, specifically only taking contracts for criminals and other bad guys. The two would later be recruited into the Eternal Alliance by the Outlander while they were hunting down Les Madrin, who they were hired to kill.\nAs an adult, Akaavi Spar wore a set of cobalt blue Mandalorian armor with dark gold accents over a largely gray flight suit. The helmet she carried had belonged to her deceased father. One of her armor's gauntlets featured a whipcord launcher with a grappling hook, allowing her to latch on to tall structures and use the device to hoist herself up. In addition to her armor, Spar wore boots, gloves over each hand, and a multi-strap utility belt. She owned at least one blaster pistol in addition to a tech staff which she wielded in battle, and was known to make use of grenades to engage large groups of enemies. Spar also carried a personal datapad.\nAkaavi would eventually switch her armor with to that of a black and silver Mandalorian Seeker armor that had become increasingly popular with the Mandalorians.\nAkaavi Spar first appeared in the 2011 BioWare-made MMORPG, Star Wars: The Old Republic. In the game, Spar acts as a companion character and potential romance option to a Smuggler-class player, and was voiced by actress Stacy Haiduk. Haiduk enjoyed the experience of portraying Spar, and has expressed her support of both Akaavi's exotic appearance and tough attitude.\nSpar can be romanced by a male smuggler player, though marriage isn't conclusive due to her loyalty to Mandalorian culture.\nThe mission to recruit Akaavi and Mako into the Alliance is only available to the smuggler and the bounty hunter.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Spar",
  "/wiki/Mandalore_(title)",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Akaavi_Spar",
  "/wiki/Kamar/Legends",
  "/wiki/3670_BBY",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Clan_Spar",
  "/wiki/Eternal_Alliance",
  "/wiki/Captain/Legends",
  "/wiki/File:NoSmallTalk-AkaaviSpaar-TOR.ogg",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Soldier/Legends",
  "/wiki/Time/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Zadik_Lone",
  "/wiki/Death/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Clan_Lone",
  "/wiki/Voidhound",
  "/wiki/Balmorra/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Tyrak",
  "/wiki/Major/Legends",
  "/wiki/Stanwu",
  "/wiki/Tayari_Rook",
  "/wiki/Clan_Rook/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/File:LeftMyMother-AkaaviSpar-TOR.ogg",
  "/wiki/Parent/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Abyssin/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Flamethrower/Legends",
  "/wiki/Verd%27goten",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Mandalore_the_Vindicated",
  "/wiki/Jedi/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Unidentified_Mandalorian_(Clan_Spar)",
  "/wiki/3642_BBY",
  "/wiki/Battle_of_Balmorra_(Great_Galactic_Wars)",
  "/wiki/Balmorran_resistance",
  "/wiki/Smuggler/Legends",
  "/wiki/Okara_Droid_Factory",
  "/wiki/Imperial_soldier",
  "/wiki/Camp_Vigil",
  "/wiki/Balmorran_Arms_Factory",
  "/wiki/Harridax_Kirill",
  "/wiki/Darmas_Pollaran",
  "/wiki/Senator/Legends",
  "/wiki/Bevera_Dodonna",
  "/wiki/Rogun_Matt%27rik",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Languss_Tuno",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Mako_(slicer)",
  "/wiki/Hoth/Legends",
  "/wiki/Outlander",
  "/wiki/Les_Madrin",
  "/wiki/Blue",
  "/wiki/Mercenary_Elite_Prototype_Armor",
  "/wiki/Gold/Legends",
  "/wiki/Gray",
  "/wiki/Flight_suit/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Gauntlet/Legends",
  "/wiki/Whipcord_launcher/Legends",
  "/wiki/Grappling_hook/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Utility_belt/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Electrostaff/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Mandalorian_Seeker_armor",
  "/wiki/Stacy_Haiduk",
  "/wiki/2011",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Actor/Legends",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Category:Audio_files_of_Akaavi_Spar",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Mandalorians:_People_and_Culture",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/Boba_Fett:_A_Practical_Man",
  "/wiki/March_17",
  "/wiki/2018",
  "/wiki/June_17",
  "/wiki/2012"
 ]
}