{
 "name": "Akial",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jawa"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Akial was a Jawa male who was a member of the Jedi Order during the years of the Galactic Republic. He trained at the Almas Academy, a Jedi academy that was located on the planet Almas, where he specialized as a Jedi Consular. After participating in the Jedi Trials, he graduated from the Academy, becoming a Jedi Knight. A short time afterward, Akial and the Kel Dor Jedi Guardian Krin D'bis were sent to represent the Academy at a celebration that was being held at Greentree Pointe resort on Dorumaa, the moon of Almas.\nAkial was born during the waning years of the Galactic Republic. He became a member of the Jedi Order and attended the Almas Academy, a Jedi academy that was located on the planet Almas, in the Cularin system. While there, he trained to become a Jedi Consular, a Jedi specialization that focused on studying the mysteries of the Force. During the time of the Clone Wars, Akial undertook the Jedi Trials, which he passed and he became a Jedi Knight.\nA short time after his graduation, Akial was picked to be an official representative of the Academy at a celebration that was being held on Dorumaa, the moon of Almas. The celebration had been organized by the Metatheran Cartel, a trade organization that was jointly run by members of the Caarite and Filordus species. They had organized the event to thank a group of freelance agents for preventing the release of a dangerous virus on the Caarite homeworld.\nThe Kel Dor Jedi Guardian Krin D'bis was chosen to accompany Akial. Due their different specializations within the order, they could represent different approaches to being a Jedi and show that the order was not single-minded. They traveled to Greentree Pointe resort on Dorumaa, where the celebration was being held and they set up a booth there, to try and recruit potential students for the Academy. While at the celebration, Akial and D'bis debated the threat posed by the Believers, a Sith cult that operated in the Cularin system. They both agreed that the Believers were a major problem for the system, but disagreed over how to deal with the cult. D'bis suggested that the Believers should be hunted down, but Akial thought that it would be better to investigate the capabilities of the cult, as little was known about what their goals were. They also discussed the Metatheran Cartel, which had committed many past transgressions in the Cularin system, such as destroying the sacred ch'hala tree grove. Akial believed that the Cartel should be forgiven if it re-established its diplomatic position in the system and demonstrated itself to be trustworthy.\nAkial was a Jawa, a diminutive sentient species that was native to the planet Tatooine, in the Outer Rim Territories. He disliked it when people acknowledged his heritage by saying \"Utinni,\" a common word in the Jawa language, to him, as he could speak Basic without an accent.\nAkial was created by Morrie Mullins and made his only appearance in Paarty On!, a scenario in the Living Force campaign. The campaign was a supplement to the Star Wars Roleplaying Game, and Paarty On! was an interactive scenario, which was intended for use at roleplaying events. The scenario outlined how event staff would play the roles of the various non-player characters, such as Akial, and interact with players of the campaign. It encouraged the people playing Akial and D'bis to involve the players in their debate about the Believers and the Cartel, and to also discuss the nature of the Force with them.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Jawa/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Jedi_academy",
  "/wiki/Planet/Legends",
  "/wiki/Almas",
  "/wiki/Jedi_Consular",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Time/Legends",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Krin_D%27bis",
  "/wiki/Greentree_Pointe",
  "/wiki/Dorumaa",
  "/wiki/Moon/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Cularin_system",
  "/wiki/The_Force/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Metatheran_Cartel",
  "/wiki/Caarite",
  "/wiki/Filordus",
  "/wiki/Species/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Anti-Caarite_virus",
  "/wiki/Caarimon",
  "/wiki/Believers",
  "/wiki/Sith_cult/Legends",
  "/wiki/Sacred_ch%27hala_tree_grove",
  "/wiki/Sentience/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Jawaese/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Morrie_Mullins_(person)",
  "/wiki/Paarty_On!",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Star_Wars_Roleplaying_Game_Revised_Core_Rulebook",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Belly_of_the_Beaast",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Galactic_Phrase_Book_%26_Travel_Guide_(real-life_book)"
 ]
}