{
 "name": "Akimbo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dac"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Doctor Akimbo was the male Mon Calamari and the chief medical officer for the Rebel Alliance's Reginard Base during the Galactic Civil War.\nWhile serving at Reginard Base, although he had less authority than other senior base officers, Akimbo was always consulted on any medical or scientific matters. As well as running the sick bay, Akimbo also had a small laboratory. He often wore a white lab coat and carried a variety of scientific instruments in it. Like most other Mon Calamari, he was peaceful and gentle but had a passion for obtaining more knowledge.\nWhen the base's Chief Technician Adonar Dellox was found dead it was Akimbo who examined the body, coming straight from the medical lab. Akimbo immediately ordered everyone away from the body and quarantined anybody who had touched it to the sick bay straight away, calling in a detox team to deal with the body. Once the area was clear, and the detox team had began an air decontamination of the room, Akimbo approached General Corros and informed him who the body belonged to. He left with the detox team and let Corros know that he would inform him of anything he found in the autopsy.\nHe soon discovered that Dellox had in fact died from the deadly triflexia virus and soon grouped everyone in the base's lounge for testing. When a group of Rebels on the base decided to investigate Dellox's death, they asked Akimbo what he knew about triflexia and so he informed them of everything he knew. However, Akimbo did not know that the strain of triflexia had been bioengineered by the Galactic Empire for use as a poison.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Dac",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Reginard_Base",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Chief_Technician",
  "/wiki/Adonar_Dellox",
  "/wiki/Death/Legends",
  "/wiki/General/Legends",
  "/wiki/Halomar_Corros",
  "/wiki/Triflexia",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Challenge_(magazine)",
  "/wiki/Death_by_Triflexia",
  "/wiki/Challenge_76"
 ]
}