{
 "name": "Akris_Ur%27etu",
 "display_name": "Akris Ur'etu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "24 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Shadow gray/brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Skar'kla Consortium"
     ]
    }
   ]
  }
 ],
 "content": "Akris Ur'etu was a wealthy male Bothan crime lord who, at a relatively young age, became head of the criminal organization known as the Skar'kla Consortium. The consortium had several Hutt rivals, one of whom arranged for an enforcer to dress as a Jedi and interfere with Skar'kla operations before hunting down and killing the Bothan without anyone suspecting the Hutts. Ur'etu hired the Duros Bounty hunter Cad Bane to stop the imposter; Bane, however, allowed the hunter to find and kill Ur'etu using several pieces of technology designed to mimic Force abilities.\nAkris Ur'etu was a male Bothan crime lord who gained control of the criminal syndicate known as the Skar'kla Consortium at a fairly young age. Whilst he controlled the consortium, several Hutts attempted to take over portions of its territory. Shortly before the Clone Wars, one of the Hutts hired an enforcer to assassinate Ur'etu while disguised as a Jedi so as to draw suspicion away from the Hutt and onto the Jedi Order.\nThe Jedi imposter first interfered in a number of Skar'kla operations, which caused Ur'etu to hire the Duros bounty hunter Cad Bane to kill the man whom he believed to be a real Jedi. The imposter, however, tracked down the Bothan to a Skar'kla base and attacked him. Ur'etu managed to take cover inside the building with a number of thugs and sealed its blast doors. The false Jedi, however, cut through them with a stolen lightsaber and killed several thugs with a thermal detonator before finishing off the rest with the lightsaber.\nWhile the imposter and thugs fought, Ur'etu managed to escape through a hidden passageway concealed behind his Greel wood desk. The passage lead to the base's security center where he was greeted by his Weequay security chief. The pair prepared to battle the imposter together, but the assassin used a mono-filament cable with a magnetic grapple to pull the crime lord's hold-out blaster from his grasp, as though using the Force, and then used it to shoot and kill the Weequay. Ur'etu attempted to plead for his life, but the imposter released gas from an emitter on his wrist, which began to choke the Bothan—to the crime lord, it seemed as though he being killed through the Force. Bane, who had been watching the entire encounter from afar, then arrived in the security center but, to Ur'etu's horror, told the imposter he could finish his job and allowed the Bothan to choke to death.\nBane had only taken the job from Ur'etu due to his interest in the Jedi imposter's equipment. After Ur'etu was dead, Bane quickly defeated the imposter and then made an agreement with him, allowing him to live if he would show the Duros how to make each piece of equipment. Bane also demanded that the imposter allow him to collect the bounty on Ur'etu, as it would be high, and he desired the reputation boost that would come with it.\nUr'etu was greatly scared of the Jedi imposter while being pursued. He could not conceal his fear from others, as his gray and brown fur stood on end and his voice changed pitch whenever he felt afraid. While being chased, he swore continuously in Bothese and once the imposter corned him he begged to make an arrangement with him to spare his life. Ur'etu's fear was replaced by anger on occasion; first at the Jedi as he attempted to enter the compound, then at the ineptitude of his Weequay security chief and finally as he died at Cad Bane for letting him be killed.\nAkris Ur'etu first appeared in the short story Reputation, written by Ari Marmell and drawn by Thomas Hodges which was published in Star Wars Insider 136 in 2012. The story states that he has shadow gray colored fur although in both illustrations of him it appears brown.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/24_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Skar%27kla_Consortium",
  "/wiki/Reputation",
  "/wiki/Crime_lord/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Unidentified_Hutt_enforcer",
  "/wiki/Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cad_Bane/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Blast_door/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Greel_wood",
  "/wiki/Weequay/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Gray",
  "/wiki/Brown",
  "/wiki/Bothese",
  "/wiki/Ari_Marmell",
  "/wiki/Tom_Hodges",
  "/wiki/Star_Wars_Insider_136",
  "/wiki/2012",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com",
  "/wiki/So_Uncivilized:_Great_Gunslingers_in_Star_Wars"
 ]
}