{
 "name": "Aks Moe",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Malastare"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 28 BBY and 22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange-yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Congress of Malastare",
      "Galactic Republic",
      "Malastare delegation",
      "Loyalist Committee",
      "Malastare delegation",
      "Loyalist Committee"
     ]
    }
   ]
  }
 ],
 "content": "Aks Moe was a Gran male who served in the Galactic Senate during the waning years of the Galactic Republic. Part of the Malastare delegation, he represented the Congress of Malastare. A well-connected and wealthy senator, Moe held influence over the bureaucracy of the Republic and profited from the ignorance of crime on the Republic capital, Coruscant. He served during the Invasion of Naboo, where he supported the Trade Federation's motion to create a commission to investigate the matter. Moe was assassinated sometime later, and was replaced as senator by Ask Aak.\nAks Moe was a Senator who represented the Congress of Malastare in the waning years of the Galactic Republic. Alongside Senator Ainlee Teem, who represented the planet as a whole, and Baskol Yeesrim, who represented the Gran Protectorate, Moe was part of the Malastare delegation. Well-connected and wealthy, Moe held significant influence over the bureaucracy of the Republic, with numerous politicians, courts, and lobbyists under his sway and payroll.\nDuring the early career of Coruscant Security Force Lieutenant Tanivos Exantor Divo, the inspector championed sprawling reforms to how law enforcement agencies and judicial branches of the Republic went about their business. Divo had a particular interest in bringing rampant crime in the Coruscant underworld to a halt, namely stemming the rivers of illicit activity that traversed across the Republic homeworld, via a network of cross-jurisdictional information sharing. Senator Moe, who profited from this ignorance of underworld crime, used his connections and credit lines to gear his line of judges, lobbyists, and other politicians to thwart Lieutenant Divo's attempts at rectification. Moe himself used his platform to petition against Divo, faulting his police procedures of being responsible for allowing narcotics from the deeper levels of Coruscant to reach the halls of the Senate. Moe's accusations warranted a deposition hearing, where the senator questioned Divo on his work. Moe, outraged at the supposed crimes committed by Divo, colorfully interrogated the inspector on the matter. Divo, in contrast to Moe, spoke plainly and to the point, and simply stated that it was the Republic's complacency which had bred the crime throughout Coruscant.\nThough Divo was not charged with any misdeed, his drive to enact his reforms was weakened significantly by Moe's network of bureaucracy. Divo, knowing that he wouldn't be able to achieve justice upstream with men like Moe in his way, deferred from his early goals and instead chose to focus on smaller cases in the hopes that they could build up and form larger ones against the crime lords that ran free on Coruscant and the politicians who did business with them.\nAfter a dispute over the taxation of trade routes to outlying star systems, the droid armies of the Trade Federation invaded the planet Naboo. Hoping to receive help from the Republic's government, Queen Padmé Amidala of Naboo addressed the Senate and explained that the Federation had invaded her world. Lott Dod, the senator for the Trade Federation, strenuously objected to the claims and recommended that a commission to be sent to Naboo to ascertain the truth of the queen's claims. Moe supported Dodd's recommendation to have a commission be sent. Having little faith in the bureaucracies of the Senate, Amidala instead called for a Vote of No Confidence against Supreme Chancellor Finis Valorum. One of the candidates to replace Valorum was Senator Ainlee Teem, but he was defeated and Senator Palpatine of Naboo was elected in his place. After leaving Coruscant, Amidala led a battle against the Federation that liberated her world. As a result of Teem's loss Malastare entered a period of backsliding and waning political power.\nIn 28 BBY, the Mid Rim Territories planet Bromlarch fell into crisis when the planet's aqueduct system collapsed. After a motion to respond to the crisis failed in the Senate, now-Senator Padmé Amidala of Naboo, along with Senator Rush Clovis of Scipio, drafted the Mid Rim Cooperation Motion, a plan to not only rebuild Bromlarch's failing infrastructure but create a new system of trade and commerce for several Mid Rim planets, including Malastare. After Senator Amidala presented the motion before the Senate, Chancellor Palpatine acknowledged Moe, who became the first in the Senate to support it, commenting that there was wisdom in its plan. After a moment where he and his delegation calculated how much credits Malastare would profit from the new trades, Moe stated before the Senate that the Congress of Malastare seconded the motion. Following Moe's support, the representatives of the Mid Rim world Kashyyyk added theirs, and the motion was brought to a vote. Only a few seconds after voting began, the results were tallied and the motion passed.\nSome time later, Moe was assassinated; he was replaced by a fellow Gran senator, Ask Aak.\nAks Moe appeared briefly in the 1999 film Star Wars: Episode I The Phantom Menace and was portrayed by Mark Coulier. The character's voice was provided by Marc Silk.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Aks_Moe",
  "/wiki/Aks_Moe/Legends",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Chancellors,_Senators_and_Other_Statesmen_of_the_Republic",
  "/wiki/Malastare",
  "/wiki/28_BBY",
  "/wiki/22_BBY",
  "/wiki/Gran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Congress_of_Malastare",
  "/wiki/Galactic_Republic",
  "/wiki/Malastare_delegation",
  "/wiki/Loyalist_Committee",
  "/wiki/Galactic_Senate",
  "/wiki/Standard_year",
  "/wiki/Coruscant",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Trade_Federation",
  "/wiki/Death",
  "/wiki/Ask_Aak",
  "/wiki/Senator",
  "/wiki/Ainlee_Teem",
  "/wiki/Baskol_Yeesrim",
  "/wiki/Gran_Protectorate",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Lieutenant",
  "/wiki/Tanivos_Exantor_Divo",
  "/wiki/Star_system",
  "/wiki/Planet",
  "/wiki/Naboo",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Lott_Dod",
  "/wiki/Vote_of_No_Confidence",
  "/wiki/Supreme_Chancellor",
  "/wiki/Finis_Valorum",
  "/wiki/Darth_Sidious",
  "/wiki/Battle_of_Naboo",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Bromlarch",
  "/wiki/Bromlarch_planetary_aqueduct_system",
  "/wiki/Rush_Clovis",
  "/wiki/Scipio",
  "/wiki/Mid_Rim_Cooperation_Motion",
  "/wiki/Kashyyyk",
  "/wiki/Time",
  "/wiki/Assassin",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Mark_Coulier",
  "/wiki/Marc_Silk",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Coruscant_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/32_BBY",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones"
 ]
}