{
 "name": "Akshaya_Ponta",
 "display_name": "Akshaya Ponta",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Skuhl"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Around 4 BBY",
      "above Skuhl"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark brown with red undertones"
     ]
    }
   ]
  }
 ],
 "content": "Akshaya Ponta was a human female cargo pilot that lived on the planet Skuhl. She was the mother of two children, Tanith and Hadder Ponta. When Jyn Erso was looking for transportation, Akshaya took her to Skuhl for the price of fixing her broken droid.\nFor many years, Akshaya lived on Skuhl with her husband, her daughter Tanith, and her son Hadder. She worked as a freelance cargo pilot, often carrying ore for mining operations.\nWhen Akshaya's husband died, she started letting Tanith pilot the family's shuttle. Tanith's flying later resulted in the terminal illness Bloodburn. To keep her disease in check, Tanith took Hadeira serum, and became addicted to the substance. Tanith died of an overdose in 15 BBY. After Tanith's death, Akshaya became paranoid of Hadder contracting the disease. She began forbidding her son from flying, and developed the idea that no young person should, either.\nWhile Akshaya was on a cargo run, she encountered the sixteeen-year old Jyn Erso. Unknown to Akshaya, the girl had recently been abandoned on Tamsye Prime by Saw Gerrera. Jyn was desperate for a ride offworld, and lied that she could fix Ponta's broken droid. She proved completely unable to repair the astromech, but payed for her passage by forging clearance codes. Akshaya pitied Jyn, and allowed her to stay at her home on Skuhl.\nWhen the Galactic Empire arrived on Skuhl, Akshaya together with Hadder and Jyn prepared to leave the planet. The same day as they were going to leave, stormtroopers showed up at their house searching for Jyn. She had just managed to escape undetected but the stormtroopers took Akshaya and Hadder as prisoners instead, while setting their house on fire. Jyn had taken the family's planet hopper, and attacked the stormtroopers holding Akshaya and Hadder, rescuing them. Akshaya and Hadder then took the family's other ship, the freighter Ponta One. Together they flew up in the sky past a dogfight between rebels and TIE Fighters intending to fly to Five Points Station. Unknown to Jyn, Akshaya's and Hadder's ship was destroyed right before she flew into hyperspace, killing both of them.\nAkshaya Ponta was a firm pacifist, disapproving of all weaponry. When Jyn first entered her ship with a blaster in her pack, Akshaya insisted on confiscating it, saying she was \"a peaceful operation.\" She was also known to be very forgiving and motherly, ignoring Jyn's checkered history and sympathizing with her.\nAkshaya was known for her hobby of painting mandalas on floors, ceilings, and any spare surface. She stopped this practice for a period of time after her daughter died, but eventually started again, saying it was calming.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Skuhl",
  "/wiki/4_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Pilot",
  "/wiki/Planet",
  "/wiki/Parent",
  "/wiki/Tanith_Ponta",
  "/wiki/Hadder_Ponta",
  "/wiki/Jyn_Erso",
  "/wiki/Droid",
  "/wiki/Standard_year",
  "/wiki/Hadder_Ponta%27s_father",
  "/wiki/Ore",
  "/wiki/Mining",
  "/wiki/Marriage",
  "/wiki/Death",
  "/wiki/Shuttle",
  "/wiki/Bloodburn",
  "/wiki/Hadeira_serum",
  "/wiki/15_BBY",
  "/wiki/Tamsye_Prime",
  "/wiki/Saw_Gerrera",
  "/wiki/Astromech_droid",
  "/wiki/Galactic_Empire",
  "/wiki/Standard_day",
  "/wiki/Stormtrooper",
  "/wiki/Prisoner",
  "/wiki/Fire",
  "/wiki/Planet_hopper",
  "/wiki/Freighter",
  "/wiki/Ponta_One",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Five_Points",
  "/wiki/Space_station",
  "/wiki/Starship",
  "/wiki/Hyperspace",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Akshaya_Ponta",
  "/wiki/Blaster",
  "/wiki/Time",
  "/wiki/Rebel_Rising",
  "/wiki/Rebel_Rising_(audiobook)"
 ]
}