{
 "name": "Akul_Witig",
 "display_name": "Akul Witig",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Outdoor Survival School",
      "Twilight Class",
      "Twilight Class",
      "Alliance to Restore the Republic",
      "Alliance Special Forces",
      "Eclipse Team",
      "Task Force on Alliance Security",
      "Alliance Special Forces",
      "Eclipse Team",
      "Eclipse Team",
      "Task Force on Alliance Security",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Akul Witig was a male Quarren who served as a scout and officer in the Rebel Alliance during the Galactic Civil War.\nWitig began his career as a scout student at the Galactic Outdoor Survival School, being a member of the prestigious Twilight Class. He also noticed Stren Grier, a member of the GOSS staff who joined during his graduation year: Grier almost defeated Witig during a crucial exercise and, due to his Imperial-aligned ideology, Witig considered Grier a threat to the Rebel Alliance.\nAs most of his classmates, Witig joined the Rebel Alliance after graduation.\nIn the early years of the Galactic Civil War, Akul Witig joined the Alliance with the rank of Lieutenant and was placed in the security force charged with protecting the vital Mon Calamari shipyards at Dac. An energetic officer, he stopped different schemes of Imperial collaborators, obtaining the respect of his superiors.\nAkul Witig's performance earned him a place on Ma'w'shiye's Eclipse Team as an aquatic wilderness fighter, and served with the unit on the infamous campaign on Karideph and other Rebel operations.\nWitig and his unit fought in the Battle of Archais against a a faction of Imperial-backed Assassin's Guild's forces and Imperial forces led by lieutenant colonel Freja Covell. When the Rebel forces were having a hard time, the untimely desertion of Rebel officer Mosara Thiirn led to an amount of damage and the death of many members of the three Rebel units. Witig's unit only survived thanks to fast thinking of Norrion Glidamir and Shaparo, but many of his friends died during the battle; due to this, Witig felt a hatred towards Thiirn.\nLieutenant Witig was a member of the Task Force on Alliance Security. As such, he wrote interesting reports about threats to the Rebel Alliance he knew, such as Stren Grier and Moshara Tiirn. He also wrote on Dr. Tolum Harous, explaining that the Alliance had no idea of Harous's beliefs and that they should try to recruit him and put him to work on Dac. Another of Witig's reports covered Ubese bounty hunter Arcuse.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Outdoor_Survival_School/Legends",
  "/wiki/Twilight_Class",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Eclipse_Team",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/New_Republic/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Stren_Grier",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Dac",
  "/wiki/Ma%27w%27shiye",
  "/wiki/Karideph/Legends",
  "/wiki/Battle_of_Archais",
  "/wiki/Assassin%27s_Guild/Legends",
  "/wiki/Freja_Covell",
  "/wiki/Mosara_Thiirn",
  "/wiki/Norrion_Glidamir",
  "/wiki/Shaparo",
  "/wiki/Tolum_Harous",
  "/wiki/Ubese/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Arcuse",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Atin_Attan",
  "/wiki/Buran_Borsil",
  "/wiki/Adazian_Liebke",
  "/wiki/Maashan",
  "/wiki/Xenon_Nnaksta",
  "/wiki/Sisquoc",
  "/wiki/Derembus_Sitnalta",
  "/wiki/Larq_Thur",
  "/wiki/Kiras_Torla"
 ]
}