{
 "name": "Alani",
 "display_name": "Alani",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "New Apsolon"
     ]
    },
    {
     "name": "Born",
     "values": [
      "57 BBY",
      "New Apsolon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New ApsolonThe Absolutes",
      "The Absolutes"
     ]
    }
   ]
  }
 ],
 "content": "Alani was a Human female who was the daughter of Ewane and twin sister of Eritha.\nAlani was born in 57 BBY on New Apsolon. At this time a totalitarian system of government ruled the planet. The Civilized received all the benefits, while the Workers lived in poverty. Alani's father, Ewane, was a leader of the resistance against this social system. Due to this activity he spent many years in the prison and saw his daughters rarely. Alani and Eritha were raised mostly by friends of their father, since their mother had died around the time they were born. One of those friends was Lenz.\nWith the first elections after the fall of the regime in the year 47 BBY, their father was selected to be Supreme Governor of New Apsolon. At that time, the Jedi Knights were sent to supervise the election, and they were represented by Qui-Gon Jinn and Tahl, who developed a bond with Alani and her twin sister Eritha.\nEwane held the office for five years, but was murdered shortly into his second term. Roan, a close friend of their father and his successor, adopted them. At that time, Alani and Eritha conceived a plan to gain the power on New Apsolon. That plan included killing Roan and kidnapping Tahl, who died as a result of the injuries suffered. However, the plan failed with no small part due to the actions of Qui-Gon Jinn and Obi-Wan Kenobi who came to New Apsolon looking for the missing Tahl. Because Alani wasn't as clever as Eritha, she had bragged to Obi-Wan that Qui-Gon would die in a trap elaborated by her sister, leading Obi-Wan to rescue Qui-Gon. After the failed plan, both Alani and Eritha, along with their associate Balog were arrested.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/New_Apsolon/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Ar%27alani/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Alani",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Alani",
  "/wiki/57_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Absolutes",
  "/wiki/Ewane",
  "/wiki/Eritha",
  "/wiki/Civilized",
  "/wiki/Workers",
  "/wiki/Lenz",
  "/wiki/47_BBY/Legends",
  "/wiki/Supreme_Governor",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Tahl",
  "/wiki/Roan",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Balog_(Human)",
  "/wiki/Jedi_Apprentice:_The_Ties_That_Bind",
  "/wiki/Jedi_Apprentice:_The_Death_of_Hope",
  "/wiki/Jedi_Apprentice:_The_Call_to_Vengeance",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}