{
 "name": "Alana_Walden",
 "display_name": "Alana Walden",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian Security Force",
      "Tactical Response Team",
      "Tactical Response Team"
     ]
    }
   ]
  }
 ],
 "content": "Alana Walden was a female Corellian officer of the CorSec security division during the Galactic Civil War.\nBy the time of the Battle of Yavin, Alana Walden held the rank of major in the Corellian Security Force and was stationed in Tyrena. She was also part of the CorSec Tactical Response Team.\nAfter the Battle of Yavin, Major Walden investigated the surge in the number of missing persons on Corellia. Via Corellia News Service, she announced Bandor Mokk and Faye Patrick as dangerous suspects, and encouraged citizens to contact CorSec if they had any information. In 1 ABY, a spacer finally discovered that all those missing persons were captured and enslaved by Corellian slavers. The spacer managed to infiltrate the Corellian Slaver Bunker and sliced the bunker's main computer. The spacer broadcasted the slavers' records on the CorSec emergency request channels, leading dozens of CorSec agents to quickly move to the slaver bunker and free all the slaves.\nLater the same year, she received news that the kidnapping case had been solved. Lieutenant Jasper sent her the independent agent who had helped solve the case to help Walden with her backlog of recent cases. The first case she gave the adventurer was the alleged theft of a Corellian Medal of Honor from retired CorSec officer Wilfred Quelsh. The agent found out that Quelsh had taken money from smugglers to ignore their activities and framed a fellow officer, Kal Braggan, for the crime. When Braggan confronted Quelsh, Quelsh killed him. Walden was very grateful that the case had been solved and promised that Quelsh would have to pay for his crime. The next case she gave the independent agent was an attack on the starship captain Osto Grissom by members of the Meatlump gang. The adventurer tracked the Meatlumps to a cave near Tyrena and found out that Grissom had been attacked because he transported electronics.\nThen Walden received a message from her colleague, Lieutenant Lon Cope, that needed the independent agent's help in a murder investigation. So Walden sent the adventurer to Cope in Kor Vella.\nWhen sighting of a smuggler with a warrant on his arrest on Corellia was reported on Tatooine, Major Walden and several CorSec operatives were dispatched to the remote Outer Rim planet to bring the criminal to justice. They tracked him down and confronted him in a dead-end alley in the Mos Eisley. What the CorSec agents did not know, however, was that the smuggler was in fact an agent of Imperial Security Bureau, operating undercover. The ISB agent could not afford to break his cover, so he engaged in a firefight with Walden and her men. Having set his blaster for stun, he put up the fierce defense and knocked all operatives, including Walden, unconscious. After taking Walden's datapad with information about her next contact, the ISB had left her bleeding in the alley.\nAlana Walden appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Alana Walden was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Tactical_Response_Team",
  "/wiki/Agents_of_Deception",
  "/wiki/Corellian/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Mack_Jasper",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Major/Legends",
  "/wiki/Tyrena/Legends",
  "/wiki/Corellia_News_Service",
  "/wiki/Bandor_Mokk",
  "/wiki/Faye_Patrick",
  "/wiki/1_ABY/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Corellian_slavers",
  "/wiki/Corellian_Slaver_Bunker",
  "/wiki/Corellian_Medal_of_Honor",
  "/wiki/Wilfred_Quelsh",
  "/wiki/Smuggler/Legends",
  "/wiki/Kal_Braggan",
  "/wiki/Osto_Grissom",
  "/wiki/Meatlumps",
  "/wiki/Meatlump_Cave",
  "/wiki/Lon_Cope",
  "/wiki/Kor_Vella/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/Template:SWGTCG",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}