{
 "name": "Alaric  (Sephi)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Thustra"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Thustra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sephi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Alaric was a male Sephi and the king of Thustra during the Clone Wars. He was a friend of Jedi Grand Master Yoda for some 200 years, despite their friendship being somewhat strained by the demanding nature of their positions. When the war between the Republic and the Separatists erupted, Alaric chose to leave the Republic, seeing corruption in the government and believed that joining with the Separatist Alliance would restore order.\nWhen the Republic sent a force to Thustra, Alaric's friend, Grand Master Yoda, wanted to negotiate with the monarch for a peaceful solution. In the ensuing talks, Alaric tried to convince Yoda to join him on his side, since he stated that he was on the wrong side of the war. However, Alaric's nephew Navi manipulated both the Republic and the Jedi, resulting in a battle. Alaric forced his old friend to kill him in self-defense. The death of the king caused the neighboring worlds to send their armies to Thustra, so that the Republic had to retire.\nKing Alaric grew disgusted by his nephew's behavior in the Senate and the corruption in the Galactic Republic. He thus contacted Count Dooku and offered to join the Confederacy of Independent Systems. Alaric was not disloyal to the Republic and intended to rejoin when the corruption was gone.\nYoda arrived on the planet with troops and, together with Jedi Padawan Cal, tried to persuade Alaric to leave the CIS. The King placed them under house arrest, believing that the Republic would try to take the world back by force. Eventually, King Alaric was forced into a confrontation with Yoda during the Battle of Thustra by the machinations of his nephew. The monarch forced Yoda to kill him with a blaster in order to incite the Sephi to fight against the Republic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Thustra/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Sephi/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/King/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Thustra",
  "/wiki/Navi",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Cal_(Jedi)",
  "/wiki/Death/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Jedi:_Yoda",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides"
 ]
}