{
 "name": "Alayus_Bolandin",
 "display_name": "Alayus Bolandin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.88 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "224th Imperial Armored Division",
      "Imperial Officer Corps",
      "224th Imperial Armored Division",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Alayus Bolandin was a human male who served as a lieutenant in the 224th Imperial Armored Division of the Galactic Empire during the Mimban Campaign. Following the death of Major Staz, Bolandin was given a field promotion to the military rank of captain by General Falk. A veteran, he regarded Corporal Han Solo as a troublemaker, and when Solo was captured as an alleged deserter, Bolandin ordered him to be fed to \"the beast.\"\nAlayus Bolandin was a human male who served as an Imperial officer in the 224th Imperial Armored Division of the Imperial Army and the Imperial Officer Corps. By 10 BBY, he was a veteran with the rank of lieutenant stationed on the planet Mimban, where the Galactic Empire was fighting the Mimbanese natives over mining the world's heavy mineral deposits. After Major Staz perished during the fighting, Bolandin took over command of the 224th at Camp Forward.\nBolandin called the forces in the camp to attention and announced that they would be moving out to the Southern Marshlands in three hours and that he wanted to send an advance party of ten men ahead of them. In response to the announcement, Corporal Han Solo mutter sarcastically about heading to a location with more mud and caught Bolandin's attention. The lieutenant asked Solo to repeat himself, but the corporal instead questioned their objectives. Bolandin listed what he saw as the Empire's aims on Mimban, and, after another snarky comment from Solo, approached the corporal menacingly to ask if there was a problem. Solo backed down and replied in the negative, after which Bolandin dispersed the gathering.\nBolandin was later talking to a group of other officers and two TIE pilots by the Camp Forward airfield when he was summoned over by Tobias Beckett, a criminal disguised as an Imperial captain. Beckett informed the lieutenant that he and his companions had caught a deserter, and presented Solo, who had been trying to blackmail his way into Beckett's gang. Bolandin accepted the lie and told his men to feed Solo to \"the beast,\" a nickname given to Chewbacca, a Wookiee prisoner being held at Camp Forward. Bolandin was then given a field promotion to captain by General Falk before redeploying to the Southern Marshlands.\nAlayus Bolandin was unerringly loyal to the Galactic Empire, and believed the objectives of the Imperial forces on Mimban was to bring peace and prosperity to the galaxy and effect regime change on the world to a group loyal to the Galactic Emperor by eradicating the enemy. Having long regarded Solo as a troublemaker with a big mouth and believing that his men already had enough problems to deal with, Bolandin readily accept Beckett's deceitful claim that Solo was a deserter. Bolandin stood 1.88 meters tall and had light skin, brown hair, and blue eyes.\nOn Mimban, Bolandin wore a gray Imperial kepi with an officer's disk as well as a gray greatcoat with a brown fur collar that also bore his rank insignia plaque, which showed two red pips and one blue. Under the coat he wore an armor breastplate that also bore the plaque and a brown neck guard. He also wore a brown belt with four pouches attached, black boots and black gloves.\nAlayus Bolandin was portrayed by Hal Fowler in the 2018 Anthology Series film, Solo: A Star Wars Story, who was credited as only \"Mimban Lieutenant.\" The character was first identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo and provided the surname Bolandin. The 2021 reference book Star Wars: Battles that Changed the Galaxy then established his first name as Alayus.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/224th_Imperial_Armored_Division",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Lieutenant",
  "/wiki/Mimban_Campaign",
  "/wiki/Death",
  "/wiki/Major",
  "/wiki/Staz",
  "/wiki/Military_rank",
  "/wiki/Captain",
  "/wiki/General",
  "/wiki/Falk",
  "/wiki/Corporal",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Imperial_officer",
  "/wiki/Imperial_Army",
  "/wiki/10_BBY",
  "/wiki/Planet",
  "/wiki/Mimban",
  "/wiki/Mimbanese",
  "/wiki/Mining",
  "/wiki/Camp_Forward",
  "/wiki/Imperial_Military",
  "/wiki/Southern_Marshlands",
  "/wiki/Standard_hour",
  "/wiki/Officer",
  "/wiki/TIE_pilot",
  "/wiki/Camp_Forward_airfield",
  "/wiki/Tobias_Beckett",
  "/wiki/Beckett%27s_gang",
  "/wiki/Wookiee",
  "/wiki/The_galaxy",
  "/wiki/Galactic_Emperor",
  "/wiki/Mouth",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Imperial_kepi",
  "/wiki/Officer%27s_disk",
  "/wiki/Greatcoat",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Armor",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Glove",
  "/wiki/Hal_Fowler",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2021",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_1",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}