{
 "name": "Albrekh",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Symeong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.52 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "Knights of Ren",
      "Sith"
     ]
    }
   ]
  }
 ],
 "content": "Albrekh was a Symeong male metalsmith and Sith alchemist who served Supreme Leader Kylo Ren and the Knights of Ren during the war between the First Order and the Resistance. He worked on board the Knights' transport, the Night Buzzard, and was responsible for repairing their armor.\nThis included the armor of Kylo Ren, and in 35 ABY he used a Sith forge to repair the Supreme Leader's helmet, reattaching the different pieces using sarrassian iron.\nAlbrekh was a Symeong male Sith alchemist and metalsmith who served Supreme Leader of the First Order, Kylo Ren, and his Knights of Ren during their war against the Resistance. Albrekh served on board the Knights' personal Oubliette-class transport, the Night Buzzard, where he repaired their armor. In 35 ABY, Ren brought Albrekh the many shards of his mask, some of which were warped beyond recognition after being carefully scavenged from the Mega-class Star Dreadnought Supremacy following the Battle of Crait.\nAfter assuring Ren the mask would be stronger, Albrekh lay out the pieces on his stone table and moved them into the correct places. As Ren and his knights watched, he then hammered them into shape with a special mallet, propped them together using magnetic forceps, and used molten sarrassian iron to solder them together. Once the helmet was completely restored, he poured water over it repeatedly to cool it. Once finished, he turned the completed helmet toward Kylo Ren, who silently took it and donned it before attending a meeting of his Supreme Council on board the Resurgent-class Star Destroyer Steadfast. Ren and all his knights perished on the planet Exegol not long after the helmet was repaired.\nAn eccentric Symeong, Albrekh was trained in classical metallurgy and was capable of smithing feats unheard of by the time he repaired Ren's mask. When beginning work on the object, he rubbed his hands together in anticipation then solved the puzzle of the fitting the pieces together with uncanny perception and speed. When soldering the pieces, Albrekh painstakingly applied the iron and worked with severe patience, focus, and precision.\nAlbrekh had dexterous, steady hands and long, pointed, wide-spaced ears that twitched at every sound or movement of air and were sensitive enough to tell the temperature of metal based on the sound it made when struck. The alchemist was small and thin, with a jutting jaw, fair skin, and brown hair.\nWhen repairing Kylo Ren's helmet, Albrekh made use of a Sith forge and a series of four poseable arm mechanisms with magnetic forceps and reverse-repulsorlift grav-focused bases in order to hold the pieces in place. The metalsmith also used a hammer, then a tool that could apply molten sarrassian iron and a compressed air cooling nozzle during the process. The Symeong wore a dark brown robe with a tool kit attached to the chest, a brown belt and boots, and a pair of magnification electro-goggles. He wore gloves that Ren assumed must be made from a secret Sith fabric that stopped the Symeong's hands burning, but removed them at the end of the process.\nAlbrekh first appeared in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, in which he was portrayed by Lynn Robertson Bruce. The character was first identified in the film's accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo. The 2020 novelization of the film written by Rae Carson has Albrekh speak when handing Ren the helmet, but as Albrekh is silent in the film this article assumes the latter to be correct. Chief costume concept artist Glyn Dillon created concept art of Albrekh for the film titled \"Blacksmith Monkey Version 4A\" and creature concept designer and senior sculptor Louis Wiltshire created a piece titled \"Wizard 52.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Symeong",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/First_Order",
  "/wiki/Knights_of_Ren",
  "/wiki/Sith",
  "/wiki/Metalsmith",
  "/wiki/Sith_alchemist",
  "/wiki/Supreme_Leader",
  "/wiki/Ben_Solo",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Resistance",
  "/wiki/Oubliette-class_transport",
  "/wiki/Night_Buzzard",
  "/wiki/Armor",
  "/wiki/35_ABY",
  "/wiki/Sith_forge",
  "/wiki/Helmet",
  "/wiki/Sarrassian_iron",
  "/wiki/Mega-class_Star_Dreadnought",
  "/wiki/Supremacy",
  "/wiki/Battle_of_Crait",
  "/wiki/Water",
  "/wiki/Supreme_Council",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Death",
  "/wiki/Planet",
  "/wiki/Exegol",
  "/wiki/Time",
  "/wiki/Limb",
  "/wiki/Ear",
  "/wiki/Mouth",
  "/wiki/Hair",
  "/wiki/Repulsorlift",
  "/wiki/Gravity",
  "/wiki/Hammer_(tool)",
  "/wiki/Iron",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Sith_alchemist_gloves",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Lynn_Robertson_Bruce",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2020",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Rae_Carson",
  "/wiki/Glyn_Dillon",
  "/wiki/Louis_Wiltshire",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Kylo_Ren_and_Other_Followers_of_the_Dark_Side",
  "/wiki/Star_Wars_Insider",
  "/wiki/Neal_Scanlan:_A_Force_Reawakended",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/General_Equipment_(I)",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY"
 ]
}