{
 "name": "Alcida-Auka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ahch-To"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lanai"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray and white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Caretakers"
     ]
    }
   ]
  }
 ],
 "content": "Alcida-Auka was a Lanai female who served as the matron of the Caretakers of Temple Island on the planet Ahch-To. In the year 34 ABY, she encountered the former scavenger Rey in the Jedi village on the island. The Lanai was scaling a fingerlip garpon with a knife when Rey emerged from the stone hut she was residing in while receiving training from Jedi Master Luke Skywalker, another resident of the island.\nAlcida-Auka was a Lanai female who lived in the Caretaker village on Temple Island on the planet Ahch-To. She inherited the position of matron of the Caretakers from her mother, which had previously been held by many of her ancestors, and in turn would someday pass that on to her eldest daughter. The Caretakers were responsible for the upkeep of the ancient Jedi village on the island, and during Alcida-Auka's tenure as matron, the Jedi Master Luke Skywalker lived as a resident of the village. The Caretakers tolerated his presence, though he insisted on doing most of their duties to care for him himself, something which puzzled Alcida-Auka.\nIn the year 34 ABY, the scavenger Rey traveled to Ahch-To to recruit Skywalker to the Resistance and receive training from him. After Skywalker reluctantly agreed to train Rey, the student began sleeping in one of the stone huts of the Jedi village. After seeing a vision of her adversary Kylo Ren, Rey accidentally blew a hole in the side of the hut and then emerged to find Alcida-Auka and the other Caretakers outside. While two of the other Lanais fussed over trying to repair the hut, the matron scaled a fingerlip garpon using a fish-scaling knife on a clay chopping board in order to prepare a meal for the village as part of her daily routine. When she asked Skywalker about Rey's identity, he responded that she was his niece, though she was doubtful.\nLater, Rey was training with her lightsaber on a cliff, where the young Force-user chopped a rock in half. The rock fell down the cliff and onto a wheelbarrow that Alcida-Auka and a fellow Lanai were using for transport, completely destroying their cart. Surprised, Alcida-Auka and the other Lanai spotted Rey and glared at her in dismay. Not long after this, the matron participated in the Festival of Return, a monthly ceremony in which the male Lanais returned from their fishing trips and old relationships were mended. Alcida-Auka was dancing with a Visitor when Rey burst in with her lightsaber, having been led to believe the Visitors were in fact marauders coming to pillage the Caretakers, surprising the Lanais. After a moment of awkward silence, Alcida-Auka indicated for the girl to join in, cheering and dancing when she did.\nAfter Rey's departure and Skywalker's death, Alcida-Auka did not pay them much heed, instead turning her mind towards the many things that needed fixing in their aftermath. In addition to their daily chores and the gathering of supplies for winter, the ancient uneti tree had been destroyed by a lightning strike, a hut needed rebuilding and another required a new lightning rod. In regards to Skywalker, she had her fellow Caretakers gather up his possessions, including his lightsaber, and place them into a repository of other such items left by visitors. After ensuring these things were done, the matron took a moment to reflect on the history and duties of the Caretakers, recalling previous outside visitors who either lived alongside the Lanais or treated them cruelly and wondering if Luke would be the last. After this moment of reflection, Alcida-Auka decided it did not matter but if anyone did come, they would find everything in order for them because the Caretakers would do their duty, as always.\nAlcida-Auka had gray and white skin with blue eyes. She referred to the other Caretakers as her \"daughters,\" instilling the virtues of cleanliness, orderliness and decorum in each of them. She was a simple being, devoted to her duty as matron and a Caretaker, and was annoyed with Rey when she inadvertently complicated these duties by damaging the island and the Caretakers' equipment. However, she was occasionally given to moments where she reflected on her place in the galaxy and contemplated what the future might bring. One of these moments led her to briefly wonder if Luke Skywalker and Rey would be the last to visit their isolated planet, but she quickly decided that it did not matter because she and her fellow Caretakers, as well as their descendants, would continue to carry out their sacred duties.\nAlcida-Auka wore a white habit with a gray rope fastened around her waist as a belt. A necklace bearing a circular stone with an off-center hole in it hung around her neck. She used a clay chopping board and a fish-scaling knife to prepare fish for meals. She and another Caretaker also made use of a wheelbarrow on at least one occasion to transport supplies, which was accidentally destroyed by a rock that Rey had sliced loose with her lightsaber.\nAlcida-Auka first appeared in the film Star Wars: Episode VIII The Last Jedi, which was released on December 15, 2017. and was portrayed by Nikki Bond with animatronics performed by Patrick Comerford and Adrian Parish who also built the mechanical head. The character was not named in the film, but received identification in Star Wars: The Last Jedi: The Visual Dictionary, a reference book written by Pablo Hidalgo and released in conjunction with the film.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Ahch-To",
  "/wiki/Lanai",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Caretakers",
  "/wiki/Clan_Matron",
  "/wiki/Temple_Island",
  "/wiki/Planet",
  "/wiki/Standard_year",
  "/wiki/34_ABY",
  "/wiki/Scavenger",
  "/wiki/Rey_Skywalker",
  "/wiki/Jedi_village",
  "/wiki/Fingerlip_garpon",
  "/wiki/Knife",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/Caretaker_village",
  "/wiki/Alcida-Auka%27s_mother",
  "/wiki/Resistance",
  "/wiki/Jedi_training",
  "/wiki/Sleep",
  "/wiki/Stone",
  "/wiki/Jedi",
  "/wiki/Force-bond",
  "/wiki/Ben_Solo",
  "/wiki/Fish",
  "/wiki/Clay",
  "/wiki/Skywalker_lightsaber",
  "/wiki/The_Force",
  "/wiki/Force-sensitive",
  "/wiki/Transport",
  "/wiki/Festival_of_Return",
  "/wiki/Standard_month",
  "/wiki/Visitors",
  "/wiki/Fishing",
  "/wiki/Death",
  "/wiki/Uneti_tree",
  "/wiki/Rey%27s_hut",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/December_15",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_The_Last_Jedi:_Ultimate_Sticker_Collection",
  "/wiki/Star_Wars:_The_Last_Jedi_Activity_Book_with_Stickers",
  "/wiki/Star_Wars:_The_Last_Jedi:_Heroes_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Saga_of_Rey",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/StarWars.com"
 ]
}