{
 "name": "Aldar Beedo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ploo II"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Glymphid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow",
      "blue",
      "gray",
      "beige"
     ]
    }
   ]
  }
 ],
 "content": "Aldar Beedo was a Glymphid male podracer from the planet Ploo II who participated in the Boonta Eve Classic podrace on the planet Tatooine in 32 BBY. Beedo flew a podracer with Mk IV Flat Twin Turbojet engines and began on the front row of the starting grid in the Mos Espa Grand Arena.\nThroughout the first lap he moved up and down within the group of racers leading the race, but was overtaken by the Human pilot Anakin Skywalker in the second lap before dropping into the Ebe Crater Valley. Ultimately, he finished in a respectable third place behind the racers Gasgano and Skywalker.\nHailing from the planet Ploo II, the Glymphid male Aldar Beedo had become a podracer by 32 BBY, when he was one of the participants in the Boonta Eve Classic podrace on the planet Tatooine. He was given the left-most position on the front row of the race's starting grid in the Mos Espa Grand Arena, but after the crime lord Jabba Desilijic Tiure signaled for the race to begin he was not initially in the lead pack of vehicles as they flew through the Mushroom Mesa.\nAfter the Dug podracer Sebulba caused the racer Mawhonic to crash, Beedo moved up into fourth place behind fellow racers Elan Mak and Ratts Tyerell, with Sebulba in the lead as they entered the Notch. By the time they reached Arch Canyon, Beedo had moved up to third behind his opponent Teemto Pagalies and then Sebulba, although the Glymphid fell behind again before they entered the Laguna Caves, but was still following closely behind the Dug. Beedo sat in fifth place as the lead racers crossed the Hutt Flats before finishing the first lap.\nIn the second lap the Human podracer Anakin Skywalker overtook Beedo just before they dropped into the Ebe Crater Valley and by the third lap Skywalker and Sebulba were well out in front of the other racers competing for the lead. Ultimately Sebulba crashed and Skywalker claimed first place, with Beedo finishing in a respectable third place behind the Xexto pilot Gasgano despite the Glymphid's best efforts. Beedo finished with a time of 15.52:108 and averaged 845 kilometers per hour  during the race.\nAldar Beedo was a long-snouted Glymphid who was devious and skilful. He had mottled green and yellow skin with some blue coloring on the skin around his orange eyes.\nAldar Beedo flew a 22.5 meter  long podracer, the longest vehicle participating in the Boonta Eve Classic. It used Manta RamAir Mk IV Flat Twin Turbojet engines with blue and red coloring. Beedo's flag consisted of a blue background with a green emblem in the middle and green corners on the upper left and lower right.\nAldar Beedo was created for the prequel trilogy film Star Wars: Episode I The Phantom Menace, which was released on May 19, 1999. The character's name appeared as early as the revised rough draft of the film's script, which listed Beedo as coming from Kamar. A least four pieces of concept art of the character were created in 1996, with concept artist Terryl Whitlatch creating anatomical sketches dated March 19 and March 27.\nAfter the concept sketches established Beedo's look, a maquette of the character was built in order to fully realize his three-dimensional shape and color scheme. Despite the level of detailed provided by the maquette, the racer only appeared in the film as a low-resolution computer generated model visible in distant shots of the cockpit of his podracer during the race.\nIn the new Star Wars canon, Beedo's name was first used in the 2015 reference book Star Wars: Absolutely Everything You Need to Know. In the Star Wars Legends continuity, Beedo appeared prior to the release of the film in its novelization, which was written by Terry Brooks and released on April 21, 1999.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Aldar_Beedo",
  "/wiki/Aldar_Beedo/Legends",
  "/wiki/Ploo_II",
  "/wiki/Glymphid",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Podracer_(profession)",
  "/wiki/Planet",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Podracing",
  "/wiki/Tatooine",
  "/wiki/32_BBY",
  "/wiki/Mk_IV_Flat_Twin_Turbojet",
  "/wiki/Podracer_engine",
  "/wiki/Mos_Espa_Grand_Arena",
  "/wiki/Human",
  "/wiki/Pilot",
  "/wiki/Anakin_Skywalker",
  "/wiki/Ebe_Crater_Valley",
  "/wiki/Gasgano",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Mushroom_Mesa",
  "/wiki/Dug",
  "/wiki/Sebulba",
  "/wiki/Mawhonic",
  "/wiki/Elan_Mak",
  "/wiki/Ratts_Tyerell",
  "/wiki/The_Notch",
  "/wiki/Arch_Canyon",
  "/wiki/Teemto_Pagalies",
  "/wiki/Laguna_Caves",
  "/wiki/Hutt_Flats",
  "/wiki/Xexto",
  "/wiki/Time",
  "/wiki/Kilometer_per_hour",
  "/wiki/Mile_per_hour",
  "/wiki/Eye",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Podracer",
  "/wiki/Manta_RamAir",
  "/wiki/Engine",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/May_19",
  "/wiki/1999",
  "/wiki/Kamar",
  "/wiki/1996",
  "/wiki/Terryl_Whitlatch",
  "/wiki/March_19",
  "/wiki/March_27",
  "/wiki/Star_Wars",
  "/wiki/2015",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Terry_Brooks",
  "/wiki/April_21",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_51",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/LEGO_Star_Wars:_Rogues_and_Villains",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Naboo_Crisis",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Holidays_of_the_Galaxy",
  "/wiki/Star_Wars_Inside_Intel:_Podracing",
  "/wiki/Category:Images_of_Aldar_Beedo",
  "/wiki/Endless_Vigil",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide",
  "/wiki/Databank_(original)"
 ]
}