{
 "name": "Alecia_Beck",
 "display_name": "Alecia Beck",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic left eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Officer Corps",
      "Imperial Security Bureau",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Alecia Beck was a female human who served as a senior commander in the Imperial Security Bureau. In the aftermath of the Battle of Yavin, she was tasked with hunting down Lieutenant Caluan Ematt, a member of the enemy Alliance to Restore the Republic.\nBorn a female human, Alecia Beck came to serve in the Imperial Security Bureau, the largest of the two intelligence agencies of the Galactic Empire. During her first tour with the ISB, Beck, then a mere lieutenant, caught her training officer selling secrets for credits. Although he was a full captain, Beck confronted him in the maintenance bay aboard the Star Destroyer Vehement. The captain attempted to kill her, using a laser cutter he had found on a nearby workbench. The two then engaged in a fight. Beck managed to get the upper hand, although she lost her left eye in the confrontation. Consequently, Beck received a promotion and a commendation.\nAround the time of the Battle of Yavin, Beck had been made a Senior Commander in the ISB, making her one of the few women holding high ranks in the Empire. She was tasked with hunting down the Shrikes, a special recon unit of the enemy Alliance to Restore the Republic. When word came out that the Empire's Death Star battle station had been destroyed by the Alliance in the Yavin system, all senior commanders of the ISB were ordered to move on their current targets immediately.\nBeck and her men ambushed the Shrikes on Taanab. All Shrikes were killed, with the exception of their leader, Caluan Ematt, who managed to escape. Ematt got a burst transmission to the Alliance, letting his allies know of the Tanaab incident. Eventually, Beck and the ISB discovered that Ematt had made his way to Cyrkon, in Hutt Space. By capturing Ematt, Commander Beck hoped she would learn where the Alliance had relocated after the Battle of Yavin. The Vehement was positioned to block all flight traffic to and from Cyrkon, while Beck herself deployed to the surface, accompanied by four squads of white-clad stormtroopers. Upon searching the planetary starport, Beck identified the Millennium Falcon, a battered freighter that belonged to Corellian smuggler Han Solo, a known member of the Alliance. When Solo, Ematt and the Wookiee Chewbacca entered the docking bay that housed the Falcon, Beck and her men were waiting for them. However, Beck had underestimated the sheer audacity of Han Solo. The Corellian smuggler destroyed the magnetic shield that protected the docking bay from Cyrkon's polluted air. In the ensuing chaos, Solo, Chewbacca and Ematt managed to board the Falcon and escape. Commander Beck gave a report on the situation to Admiral J. Ras-Teker, and immediately began to calculate their possible destinations, determined not to let Ematt escape her a third time. As a result of her failure during the mission, Beck lost a promotion.\nDuring a mission to Vetine with Luke Skywalker, Alliance pilot Shara Bey impersonated Commander Beck in an attempt to infiltrate the secret Imperial labs there – however they were unaware that Beck was missing her left eye, and their cover was blown, forcing them to fight their way out.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Alecia_Beck",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Senior_Commander",
  "/wiki/Commander",
  "/wiki/Battle_of_Yavin",
  "/wiki/Lieutenant",
  "/wiki/Caluan_Ematt",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Reproduction",
  "/wiki/Credit",
  "/wiki/Captain",
  "/wiki/Star_Destroyer",
  "/wiki/Vehement",
  "/wiki/Death",
  "/wiki/Laser_cutter",
  "/wiki/Eye",
  "/wiki/Shrikes",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/Yavin_system",
  "/wiki/Ambush_on_Taanab",
  "/wiki/Taanab",
  "/wiki/Cyrkon",
  "/wiki/Hutt_Space",
  "/wiki/Stormtrooper",
  "/wiki/Millennium_Falcon",
  "/wiki/Corellian",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Deflector_shield",
  "/wiki/Admiral",
  "/wiki/J._Ras-Teker",
  "/wiki/Mission_to_Vetine",
  "/wiki/Luke_Skywalker",
  "/wiki/Shara_Bey",
  "/wiki/Imperial_base_(Vetine)",
  "/wiki/Category:Images_of_Alecia_Beck",
  "/wiki/Dave_Seeley",
  "/wiki/Smuggler%27s_Run:_A_Han_Solo_%26_Chewbacca_Adventure",
  "/wiki/Smuggler%27s_Run:_A_Han_Solo_%26_Chewbacca_Adventure_(audiobook)",
  "/wiki/Smuggler%27s_Run_(animated_comic)",
  "/wiki/Smuggler%27s_Run,_Part_1",
  "/wiki/Star_Wars_Adventures:_Smuggler%27s_Run_1",
  "/wiki/Star_Wars_Adventures:_Smuggler%27s_Run_2",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Shattered_Empire_4",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Onager-class_Star_Destroyer_Expansion_Pack",
  "/wiki/Upgrade_Card_Collection"
 ]
}