{
 "name": "Aleco Stusea",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3959 BBY–3956 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Dantooine Jedi Enclave Council",
      "Dantooine Jedi Enclave Council"
     ]
    }
   ]
  }
 ],
 "content": "Aleco Stusea was a female Near-Human Jedi Master who served on the Dantooine Jedi Enclave Council in the years after the Great Sith War. Stusea was one of several Masters who led the Jedi Enclave on the planet of Dantooine, joining the likes of Vrook Lamar, Bala Nisi, and Qual. After the official end of the Great Hunt, the Jedi Order's endeavor to eradicate Sith-created beasts galaxy-wide in the aftermath of the Great Sith War, in 3993 BBY, Stusea informed Jedi Knights Duron Qel-Droma, Shaela Nuur, and Guun Han Saresh that they were being sent to wipe out terentateks on the Sith homeworld of Korriban. Although some of the Jedi Enclave Council disagreed with the mission, Stusea trusted in the abilities of the three Jedi and in the wisdom of the Jedi High Council, which had chosen them for the task. However, Qel-Droma, Nuur, and Saresh would never return. Stusea served on the Enclave Council until the time of the Jedi Civil War, in which she was presumed killed.\nA female Near-Human, Aleco Stusea was, by 3993 BBY, a Jedi Master and a member of the Jedi Council of the planet Dantooine's Jedi Enclave. In the years after the Great Sith War, the Jedi Order launched the Great Hunt, aimed to eradicate the Sith-created monstrosities that still inhabited a number of worlds across the galaxy. In 3993 BBY, three years after the end of the war, the Great Hunt was declared officially over. However, shortly afterward, Stusea and the Jedi Enclave Council were told by Jedi High Council on Coruscant that there was still one remaining mission to complete. According to the High Council's wishes, Stusea and the Enclave Council called three Jedi Knights—Humans Duron Qel-Droma and Shaela Nuur, and Twi'lek Guun Han Saresh, together believed to be the very best hunters in the entire Order—and informed them that they had been chosen to cleanse the Sith homeworld of Korriban, a planet deeply steeped in the dark side, of the vicious and highly dangerous terentatek beast. Stusea was the one who directly broke the news to the three Jedi, and the Knights were sent away on their mission.\nAfter Qel-Droma, Nuur, and Saresh left, Stusea discussed the matter in the council chambers with the other Masters of the Enclave Council, including Humans Vrook Lamar and Bala Nisi, and the Selkath Qual. Despite the decree of the Jedi High Council, Lamar and Nisi disagreed with the Council ordering only the three Jedi to Korriban. Although acknowledging that sending the Jedi to Korriban was risky due to the strong dark side temptation of the world, Stusea expressed faith in the Jedi High Council's wisdom, believing that together the three hunters could resist the pull of the dark side. However, despite their reputations, Qel-Droma, Nuur, and Saresh would all perish battling terentateks—Qel-Droma and Nuur on Korriban, and Saresh on Kashyyyk, after a dispute that ended in the Twi'lek leaving the group. Stusea went on to serve on the Jedi Enclave Council for many more years, finally leaving the august body after the outbreak of the Jedi Civil War in 3959 BBY. It was believed that Stusea was killed at some point in the war, which ended with the Battle of Rakata Prime in 3956 BBY.\nHolding a position of leadership on the Jedi Enclave Council, Aleco Stusea was welcoming and understanding of viewpoints counter to her own, and was quick to acknowledge when someone made a valid point. Stusea had faith in the wisdom of the Jedi High Council, although she admittedly did not always agree with its decisions. She also believed in Qel-Droma, Nuur, and Saresh, thinking that they could resist the Korriban's dark temptation by relying on one another. Stusea had red hair and light skin.\nWhile serving on the Dantooine Jedi Enclave Council, Stusea wore a white dress along with a golden necklace.\nAleco Stusea first appeared in \"Shadows and Light,\" one of the stories featured in Star Wars Tales 23, written by Joshua Ortega and released in 2005. In the comic, she was illustrated by Dustin Weaver. Although she was only named as \"Aleco\" in \"Shadows and Light,\" Ortega gave her full name in a post on the Dark Horse Comics message boards. In 2013, this name was confirmed as canon within the Star Wars Legends continuity by Leland Chee, who is in charge of the official Holocron continuity database.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3959_BBY",
  "/wiki/3956_BBY",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Dantooine_Jedi_Enclave_Council",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Planet/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Vrook_Lamar",
  "/wiki/Bala_Nisi",
  "/wiki/Qual",
  "/wiki/Great_Hunt_(Jedi)",
  "/wiki/Sith/Legends",
  "/wiki/Species/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/3993_BBY",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Duron_Qel-Droma",
  "/wiki/Shaela_Nuur",
  "/wiki/Guun_Han_Saresh",
  "/wiki/Terentatek/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Korriban",
  "/wiki/Jedi/Legends",
  "/wiki/Cleansing_of_Korriban",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Time/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Death/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Selkath/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Battle_of_Rakata_Prime",
  "/wiki/Hair/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Necklace/Legends",
  "/wiki/Shadows_and_Light",
  "/wiki/Star_Wars_Tales_23",
  "/wiki/Joshua_Ortega",
  "/wiki/2005",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Dustin_Weaver",
  "/wiki/Dark_Horse_Comics",
  "/wiki/2013",
  "/wiki/Canon",
  "/wiki/Leland_Chee",
  "/wiki/Holocron_continuity_database",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/June_11",
  "/wiki/February_9"
 ]
}