{
 "name": "Aleyna_Hark",
 "display_name": "Aleyna Hark",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Olive"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Nefarid"
     ]
    }
   ]
  }
 ],
 "content": "Aleyna Hark was a Mirialan female who served as a double agent for the Sith Empire during the Cold War.\nIn 3643 BBY, Aleyna was secretly sent by Lord Nefarid to eliminate Count Alde. After meeting the Jedi Knight, she told the Knight her tale, after marking him a small red light appeared on the back of the Count's neck and killed him. After the Count's death, the guards rushed in after hearing the commotion, and Captain Yils attempted to arrest Hark, the Knight, and the Knight's companion when he found the Count dead on the floor. Hark offered herself in the Knight's place, asking the captain to let the Jedi complete their mission, and was taken away by the guards.\nAleyna was able to escape and enter the facility's bunker to meet Horis Thul. However, she encountered the Jedi Knight again. She lied to the Duke, claiming that the Jedi had come to assassinate him and ordered his guards to attack. But she underestimated her opponent and was defeated. When the Duke and the Jedi demanded the targeting device, Hark spitefully destroyed it and revealed that she had marked them too. Before he fled for the spaceport, the Duke demanded that Aleyna die, but the Knight convinced the Duke to arrest her and put her on trial instead. Thul subsequently interrogated Aleyna, learning of many spies within his house, before turning her to House Organa as a sign of good faith.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mirialan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Blue",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Nefarid",
  "/wiki/Vibroblade/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3643_BBY",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Captain/Legends",
  "/wiki/Yils",
  "/wiki/Horis_Thul",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}