{
 "name": "Alfren_Cheno",
 "display_name": "Alfren Cheno",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Alfren Cheno was a human male commander in the Imperial Navy in the years before the Galactic Civil War. He commanded the Thunder Wasp during the battle over Umbara with his first officer Captain Thrawn. With Thrawn's help, Cheno and the crew of the Thunder Wasp were able to turn the tide of the battle despite the direction of Admiral Carlou Gendling. He was forced to retire afterwards due to Gendling's insecurity about the battle.\nYears later, Moff Haveland told Grand Admiral Balanhai Savit rumors that a secret advisor responsible for Thrawn's many achievements. Haveland mentioned Commander Cheno as one of the names possibly behind that advisor, a notion that Savit dismissed out of hand.\nCheno was noted to be a good but not great officer by Wullf Yularen, and was by his own admission merely an \"adequate officer.\" He was very self aware of his limitations as a commander and displayed a benign and friendly attitude towards his crew. However, unlike most officers in the navy, he was smart enough to recognize his first officer Thrawn's brilliance and humble enough to openly admire and encourage him. In the end he sacrificed his own career to save Thrawn's, knowing the navy needed Thrawn more than himself.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Commander",
  "/wiki/Imperial_Navy",
  "/wiki/Standard_year",
  "/wiki/Galactic_Civil_War",
  "/wiki/Thunder_Wasp",
  "/wiki/Battle_over_Umbara",
  "/wiki/Executive_officer",
  "/wiki/Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Admiral",
  "/wiki/Carlou_Gendling",
  "/wiki/Moff",
  "/wiki/Haveland",
  "/wiki/Grand_Admiral",
  "/wiki/Balanhai_Savit",
  "/wiki/Advisor",
  "/wiki/Eli_N._Vanto",
  "/wiki/Imperial_officer",
  "/wiki/Navy",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Alfren_Cheno",
  "/wiki/Thrawn_(novel)",
  "/wiki/Thrawn_(audiobook)",
  "/wiki/Thrawn:_Treason",
  "/wiki/Thrawn:_Treason_(audiobook)"
 ]
}