{
 "name": "Alianna Slen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zakuul"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eternal Empire"
     ]
    }
   ]
  }
 ],
 "content": "Alianna Slen was a female Human citizen of the Eternal Empire of Zakuul. Daughter of Tayvor Slen, the Overwatch administrator, she joined up with the Flamechasers, who idolized the anarchist known as Firebrand. As a mark of pride, Alianna acquired large prominent scarring on her face. In 3630 BBY BBY Firebrand used her proximity to Overwatch and persuaded Alianna to obtain Overwatch access data from her father and assist her in planting explosives throughout the city. Alianna met up with Firebrand one last time to hand over the data and inform her that the rest of the Flamechasers have left the following and were getting their scars fixed.\nFirebrand and the Commander eventually stormed the Overwatch, killed Tayvor and destroyed the droid controls, disabling thousands of droids that enabled Zakuulan life. Aware that Firebrand's full plan involved detonating the bombs planted throughout the city as well, Alianna was grateful that the bigger disaster was averted.\nAlianna Slen appears in Star Wars: The Old Republic: Knights of the Fallen Empire Chapter 10: Anarchy in Paradise. If the player picks the Dark Side options and detonates the bombs, Alianna is accused of being Firebrand by Eternal Empire and is executed.\nHer surname is misspelled as Slenn in a Zakuul News Bulletin announcement.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zakuul",
  "/wiki/Human/Legends",
  "/wiki/Zakuulan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Tayvor_Slen",
  "/wiki/Overwatch",
  "/wiki/Flamechasers",
  "/wiki/Kaliyo_Djannis",
  "/wiki/3630_BBY",
  "/wiki/Alliance_Commander",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire"
 ]
}