{
 "name": "Alif",
 "display_name": "Alif",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red-brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Alif was a former male Human Sith Acolyte during the Cold War between the reconstituted Sith Empire and the Republic. During the war, Alif was a failed student in the became Sith Academy since he was afraid of the dark side, and was considered to be one of the weak ones. Alif planned to leave the academy until he became involved in an \"unauthorized murder\" by Esorr Kayin. Alif was scared since he witnessed the murder, but Kayin told him not to tell the Sith for what happened, or he would kill him for his betrayal. Alif nervously complied, but he was deceived when he was accused to the murder and was interrogated by Inquisitor Zyn.\nOverseer Harkun assigned one of his students to assist Zyn with the interrogation. After using Force lightning on Alif, the acolyte was forced to reveal that Esorr Kayin committed the murder\nAlif is a non-player character in the Star Wars: The Old Republic video game, featured in the Sith Inquisitor Korriban mission, \"The Plight of the Acolyte\".\nThe player can choose to torture Alif with Force lightning, earning dark side points, or coax a confession out of him, earning light side points. Afterwards, the player can suggest to Zyn to try and protect Alif by keeping him in the cells until Kayin's master had dealt with his apprentice, either through neutral or light side dialogues. Alternatively, the player can suggest that Zyn requisitions guards to protect Alif. In both cases, Alif will send a message to the player that he had been shipped off to Dromund Kaas to serve under a female Darth. If Alif was kept in the cells, he mentions that he testified against Esorr Kayin in the mail he sends to the player. If he instead received protection from the guards, he will mention that in the mail.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Blue",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Acolyte",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Esorr_Kayin",
  "/wiki/Sith_Inquisitor",
  "/wiki/Zyn",
  "/wiki/Canon",
  "/wiki/Overseer_(Sith)",
  "/wiki/Harkun",
  "/wiki/Darth_Nox",
  "/wiki/Force_lightning/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Dromund_Kaas",
  "/wiki/Darth/Legends"
 ]
}