{
 "name": "Alilia",
 "display_name": "Alilia",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "White Maw"
     ]
    }
   ]
  }
 ],
 "content": "Alilia was a Lethan Twi'lek female who was a slave to the White Maw boss Shai Tenna during the Cold War and the Galactic War between the Galactic Republic and the resurgent Sith Empire.\nAlilia became a slave and a wife to the White Maw Weequay boss Shai Tenna in the year 3649 BBY. She remained in this position for seven years, keeping the facade of a dim-witted woman who adored her Master. While this appearance was pleasing to Tenna, Alilia had in fact not only despised him, but did much of the work he claimed to be doing herself, such as picking up supplies at drop points and otherwise participating in the pirate gang management. When the White Maw discovered Trick, a young male Kitonak with a weak connection to the Force, they found that when frightened he could use it to disguise not only himself, but the entire fleet nearby. Trying to get him to cooperate, they bashed him in the skull, causing permanent brain damage. Alilia nursed and nurtured Trick as best she could, but his mind never came back. Because he was unable to use the Force consciously, the pirates tortured the child to keep him in a constant state of fear, a practice Alilia found disgusting, but was unable to stop.\nIn 3642 BBY Alilia was with the rest of the White Maw on Hoth when a smuggler later known as Voidhound approached the gang. After he survived an attempt by Shai Tenna to kill him, Alilia started to view the newcomer as a chance to escape her situation. On board of the Star of Coruscant she explained the situation with Trick and begged the smuggler for help.\nAfter the Voidhound killed Shai Tenna, Alilia agreed to send Trick to the Jedi Order where he could be fixed and would become a Jedi.\nThe other options for the player are to take control over the White Maw crew and convince Alilia to continue using Trick's ability or to encourage her to take over the gang herself, forbidding any future abuse of the Kitonak. A male smuggler may flirt with Alilia.\nIf the player convinces her to keep using Trick, Alilia will later send them a message informing them of a successful attack on tibanna mining ships on Bespin. She says she is considering hitting luxury liners next, and claims Trick is having fun.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/White_Maw",
  "/wiki/Lethan",
  "/wiki/Shai_Tenna",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Weequay/Legends",
  "/wiki/3649_BBY",
  "/wiki/Pirate/Legends",
  "/wiki/Trick",
  "/wiki/Kitonak/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/3642_BBY",
  "/wiki/Hoth/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Voidhound",
  "/wiki/Star_of_Coruscant",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Luxury_liner/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}