{
 "name": "Alinka_Aloo",
 "display_name": "Alinka Aloo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Aloo family",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Lady Alinka Aloo was a human female and the daughter of Sim Aloo, one of Emperor Palpatine's closest advisers. Along with her father, she collected Sith artifacts from across the galaxy for the Emperor, and it was she who ran the Aloo family's business when the adviser was too busy. She lived in a tower on one of the highest levels of Coruscant.\nAt one point, the Emperor expressed interest in an ancient evil book housed in a temple on the planet Ushruu. Both Sim Aloo and his fellow adviser Janus Greejatus hoped to fetch it for their master, but Greejatus rushed the job, sending in a team of Trandoshan mercenaries who all ended up eaten by Ushruu's snarler creatures. Alinka Aloo, however, devised a plan to help her father succeed where the other adviser had failed. Thinking the mission's requirements through, she determined that such a job needed a Wookiee to get through Ushruu's exotic forest, a librarian to fetch the book, and a cargo droid to carry it.\nThe librarian she chose was Mayvlin Trillick, an Oktarian girl who had been caught trying to steal from one of Sim Aloo's warehouses on Coruscant. Lady Alinka kept Trillick on a leash using the Mola Oktaro, the Oktarans' most treasured book. For the Wookiee of the team, the lady chose Chewbacca, the co-pilot of the Corellian smuggler Han Solo. As for the cargo droid, the Aloos did not pay much attention to robots, so the mission went to a K-2SB, who reported for duty on his own.\nIn order to recruit Chewbacca, Lady Alinka went to Level 1329 of the Coruscant Underworld, where she knew the Wookiee and Solo had docked a week earlier. Handing them her card, she told them to visit her at the Aloo family's tower that night. When they did, the lady pretended that she needed Chewbacca to transport her pet tookas to Centax 3, agreeing to pay 25,000 credits for the job. She insisted, however, that Solo should stay on Coruscant to keep her company during the mission. In fact, she planned on keeping Solo hostage to make sure that his co-pilot would perform the actual mission no matter the dangers.\nOnce Trillick, Chewbacca and K-2SB were aboard the cargo ship, Lady Alinka revealed the real location and purpose of the mission, which Chewbacca reluctantly decided to follow to protect his friend's life. Although everything seemingly went according to plan, little did the lady know that her cargo droid was in fact K-2SO, an Imperial security droid that had been reprogrammed by Cassian Andor of the anti-Empire Alliance to Restore the Republic. The droid's mission was to get a hold of the Ushruu book and bring it back to the Alliance.\nWhen her crew finally came back, Alinka Aloo made a run for the landing pad, but when the cargo ship's doors opened, a group of angry, hungry snarlers from Ushruu lunged toward her and her bodyguards. Solo took advantage of the situation to escape, taking the promised credits, a precious Junarian vase, and the Mola Oktaro with him. As Lady Alinka was running toward her apartments, pursued by a snarler, Solo, Chewbacca, Trillick and K-2SO flew away in the cargo ship. Not only did Lady Alinka never obtain the book, but it ultimately fell into the hands of Cassian Andor.\nAlinka Aloo first appeared in Tom Angleberger's junior novel The Mighty Chewbacca in the Forest of Fear!, which was published by Disney–Lucasfilm Press on May 25, 2018.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Aloo_family",
  "/wiki/Galactic_Empire",
  "/wiki/Lord",
  "/wiki/Sim_Aloo",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Emperor%27s_adviser",
  "/wiki/Parent",
  "/wiki/Sith",
  "/wiki/Sith_artifact",
  "/wiki/The_galaxy",
  "/wiki/Alinka_Aloo%27s_tower",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Book",
  "/wiki/Planet",
  "/wiki/Ushruu",
  "/wiki/Janus_Greejatus",
  "/wiki/Trandoshan",
  "/wiki/Mercenary",
  "/wiki/Corellian_hound",
  "/wiki/Wookiee",
  "/wiki/Forest",
  "/wiki/Librarian/Legends",
  "/wiki/Cargo_droid",
  "/wiki/Mayvlin_Trillick",
  "/wiki/Oktarian",
  "/wiki/Mola_Oktaro",
  "/wiki/Chewbacca",
  "/wiki/Pilot",
  "/wiki/Corellian",
  "/wiki/Han_Solo",
  "/wiki/K-2SO",
  "/wiki/Level_1329",
  "/wiki/Coruscant_Underworld",
  "/wiki/Standard_week",
  "/wiki/Tooka",
  "/wiki/Centax_3",
  "/wiki/Credit",
  "/wiki/Freighter",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Bodyguard",
  "/wiki/Junarian_vase",
  "/wiki/Tom_Angleberger",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!",
  "/wiki/Disney%E2%80%93Lucasfilm_Press",
  "/wiki/May_25",
  "/wiki/2018",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)"
 ]
}