{
 "name": "Alin Eerin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Data Seekers"
     ]
    }
   ]
  }
 ],
 "content": "Alin Eerin was a female Mon Calamari and a member of the Data Seekers, a secretive organization that sought to unravel the mysteries of the Anoat sector's shrouded history during the reign of the Galactic Empire. Caught behind the Iron Blockade enacted by Imperial Governor Ubrik Adelhard in the wake of the second Death Star's destruction, Eerin operated in the sector on worlds such as Bespin and Burnin Konn, where she publicly posed as a traveling merchant, while covertly trading in a variety of secrets stored on holodiscs. She directed the acquisition specialists, whose role was to travel to locations and acquire any data, cargo, or artifacts that would further expand the Seeker's archives.\nDuring a period of rebellious unrest in the sector, the Mon Calamari merchant came into contact with an up-and-coming young smuggler from Burnin Konn. On a number of occasions, Eerin passed along information and tips leading to opportunities for work to the smuggler, and the two colleagues forged a friendly working relationship. Eerin ensured her associate got a good deal on needed droid parts, and even asked the smuggler out several times for drinks after work.\nAlin Eerin first appeared in Star Wars canon in the multiplayer mobile game Star Wars: Uprising, created by the Kabam company and released on September 10, 2015 for iOS and Android platforms. Within the scope of the game, Eerin acts as one of several quest givers for the player character.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Data_Seekers",
  "/wiki/Anoat_sector",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Iron_Blockade",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_of_Endor",
  "/wiki/Sector",
  "/wiki/Planet",
  "/wiki/Bespin",
  "/wiki/Burnin_Konn",
  "/wiki/Merchant",
  "/wiki/Hologram_disc",
  "/wiki/Uprising",
  "/wiki/The_Smuggler",
  "/wiki/Smuggler",
  "/wiki/Credit",
  "/wiki/Droid",
  "/wiki/Alcohol",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Kabam",
  "/wiki/September_10",
  "/wiki/2015",
  "/wiki/IPhone",
  "/wiki/Android_(operating_system)"
 ]
}