{
 "name": "Alirra_Semhess",
 "display_name": "Alirra Semhess",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3631 BBY",
      "X7-Cratus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Alirra Semhess was a female Human Doctor of the Galactic Republic living during the war against Zakuul. Following the death of the Eternal Empire Empress Vaylin and the formation of the Eternal Alliance in 3631 BBY, she led a rogue group of Republic scientists to work on a secret project on the X7-Cratus space station. Falsely obtaining funding from a Republic endowment for disease research and treatment development, the group instead worked on developing experimental adrenals. Doctor Rahser Poth received encrypted communications fron an anonymous scientist that allowed him to develop RAK-5 serum, which in turn was refined into RS-33 adrenal. The adrenal greatly enhanced subject's strength and agility at the expense of metal faculties, but in truth both RAK-5 and RS-33 were derived from the Rakghoul plague, which put them into highly unstable state.\nEternal Alliance operatives under Theron Shan eventually discovered Semhess and her project and a strike team was dispatched to X7-Cratus to stop RS-33 from becoming a galactic threat. Semhess attempted to use RS-33 enhanced subjects to stop the invaders, but during their fight with Marlon Fenn the station's containment systems were damaged and RAK-5 serum started leaking into atmosphere. It soon turned both RS-33 test subjects and personnel such as Icarr Ko and Nyris Ko into Rakghouls. When the Alliance strike team reached Alirra Semhess herself, she blamed the contanimation on them and tried to fight them off, but succumbed to the infection and turned into rakghoul herself. After killing her new form, the Eternal Alliance secured the station's containment systems and put an end to the project.\nAlirra Semhess appears in Star Wars: The Old Republic: Knights of the Eternal Throne as the final boss of the \"Trial and Error\" Uprising.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3631_BBY",
  "/wiki/X7-Cratus",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/War_against_Zakuul",
  "/wiki/Eternal_Empire",
  "/wiki/Vaylin",
  "/wiki/Eternal_Alliance",
  "/wiki/Rahser_Poth",
  "/wiki/RAK-5_serum",
  "/wiki/Rakghoul_plague",
  "/wiki/Theron_Shan",
  "/wiki/Attack_on_the_X7-Cratus",
  "/wiki/Marlon_Fenn",
  "/wiki/Icarr_Ko",
  "/wiki/Nyris_Ko",
  "/wiki/Rakghoul",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}