{
 "name": "Alisia  (Gran)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tansarii Point Station"
     ]
    }
   ]
  }
 ],
 "content": "Alisia was a male Gran who worked as a station nurse in the medical bay of Tansarii Point Station during the time of the Galactic Civil War. Alisia and a 2-1B surgical droid named Billingsly worked alongside a Bothan Medic Master named Aja Sen by helping to treat injured and sick beings aboard the station.\nA male Gran by the name of Alisia served as a station nurse in the medical bay of Tansarii Point Station during the time of the Galactic Civil War. Tansarii Point Station was a space station built by Nova Orion Industries by the time following the Battle of Yavin in 0 BBY. Located near Ord Mantell in the Bright Jewel system, the station was owned and operated by the Car'das, and was headed by a Twi'lek named Inaldra. Shortly after Station Master Inaldra assumed command, the station was riddled with problems. Wild animals ran freely in the station's atrium, dysfunctional droids roamed the droid repair center, and representatives of Black Sun and Genesis Red were present on the station. This dire situation resulted in more and more injured workers being sent to the station's sick bay, much to Alisia's chagrin, who remarked that Inaldra was losing control of the station.\nAlisia tended to this influx of patients with the help of a couple of his associates, including a 2-1B surgical droid named Billingsly, and the Bothan Medic Master Aja Sen. Despite this valued assistance, Alisia still lamented the lack of qualified medics. Alisia recognized the dangers that were present on the upper and lower levels of the station, including their infestation by voracious beasts and thugs loyal to the Hutts. However, not all of Alisia's patients were injured onboard Tansarii Point Station. At least one patient found their way back from Station Gamma, a nearby research facility similarly plagued with violent thugs and out of control droids.\nAlisia had tan skin and black colored eyes. Alisia was opinionated, and criticized Inaldra for failing to keep the peace aboard Tansarii Point Station. He also bemoaned the lack of qualified medics willing and able to handle the sudden influx of injured station workers. Regardless, Alisia remained committed to the goal of healing his patients.\nAs a station nurse aboard Tansarii Point Station, Alisia wore a white and grey reinforced jumpsuit. Additional clothing included a pair of grey casual shoes.\nAlisia was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Alisia was added to the game as part of the \"New Player Tutorial\", introduced with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005. In the game, Alisia could be found wandering the station's medical bay tending to patients. This character was not involved in any quest but would divulge details about the station to players who conversed with him.\nAlisia's gender was not explicitly revealed in any kind of dialogue, however using an in-game text command identified Alisia as a male. However, it should be noted that due to game mechanics, all Gran character models in Star Wars Galaxies were male by default, regardless of the developers' intentions.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alisia_(Human)",
  "/wiki/Gran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Nurse/Legends",
  "/wiki/Sick_bay",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/2-1B_surgical_droid",
  "/wiki/Billingsly",
  "/wiki/Bothan/Legends",
  "/wiki/Medic/Legends",
  "/wiki/Aja_Sen",
  "/wiki/Nova_Orion_Industries",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/Car%27das/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Inaldra/Legends",
  "/wiki/Station_Master",
  "/wiki/Droid/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Genesis_Red_(gang)",
  "/wiki/Hutt/Legends",
  "/wiki/Station_Gamma",
  "/wiki/Eye/Legends",
  "/wiki/Jumpsuit/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit"
 ]
}