{
 "name": "Allana Solo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Hapes"
     ]
    },
    {
     "name": "Born",
     "values": [
      "36 ABY",
      "Hapes"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dyed black as Amelia"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hapes Consortium",
      "New Jedi Order",
      "Djo family",
      "Hapan Royal House",
      "Skywalker family",
      "House of Solo"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Leia Organa Solo"
     ]
    }
   ]
  }
 ],
 "content": "Allana Djo Solo was the daughter of Jedi Knight Jacen Solo and Jedi Knight Tenel Ka Chume'Ta Djo, Queen Mother of Hapes. In addition to her Force-sensitivity, she was by the blood of her father, the niece of the Jedi Master Jaina Solo, the granddaughter of the heroes of the Rebellion, Leia and Han Solo, the grand niece of legendary Jedi Grand Master Luke Skywalker, and the great-granddaughter of the Jedi Knight turned Sith Lord, Anakin Skywalker. As the Chume'da of the Hapes Consortium, Allana was expected to ascend to the Hapan throne in succession to her mother. She was purported to have died in 41 ABY during the Battle of Uroro Station, after the Moff Council sanctioned the use of a nanokiller, designed to target the royal Hapan bloodline, of which Allana was a direct matrilineal member.\nIn reality, posing as a war orphan named Amelia, Allana was placed by Tenel Ka in the custody of her grandparents who officially adopted her as \"Amelia Solo\", after her mother received a warning through the Force from Darth Caedus of the Moff's plan. Tenel Ka hoped that the arrangement would keep Allana safe, while allowing the child to learn the ways of the Jedi.\nLater, several individuals, including Allana's great-uncle, Luke Skywalker, received a vision similar to one that Jacen Solo had had before, in which an older Allana was a queen seated upon a throne. As the Sith wanted to conquer the galaxy for themselves, they saw the potentially enthroned Allana as a threat to their plans.\nWhen Jacen negotiated with Tenel Ka about borrowing a Hapan fleet to help the Killiks in their battle against the Chiss, she agreed - on the condition that he spend one night with her; they did spend the night together, resulting in Jacen impregnating Tenel Ka.\nTenel Ka carried and concealed the baby for twelve months by using the Force, and one week after Allana was born, an assassination attempt was made on her life. Due to this assassination attempt, the couple decided to keep the identity of the baby's father a secret, in order to protect her from angered Hapan nobles. Ben Skywalker, who was still joined to the Gorog nest, accidentally discovered Allana's paternity; all mention of Allana and the visit to Hapes was wiped from his mind by Jacen.\nEven during the Jedi convocation at Ossus, Jacen and Tenel Ka would not reveal that Jacen was Allana's father to Han and Leia Solo, Allana's paternal grandparents. Leia surmised her son knew who the father was, but did not suspect Jacen. Luke Skywalker speculated that Tenel Ka's reluctance to talk about Allana meant that she was blemished in some way—a fate the Hapans considered to be worse than death.\nDuring the Second Galactic Civil War, Allana and her mother were marked for death—first by Jacen Solo, as a sacrifice for his Sith training, although he later chose his parents for that role instead, and then by Corellian leaders, as part of a plot to remove Tenel Ka and her heir from the Hapan throne in order to let a pro-Corellian relative take control. Her paternal grandparents, still unaware of their blood ties to Allana, were propelled to act on account of their relationship with Tenel Ka.\nAllana served as the primary motivation for Jacen's extreme actions, a reason owing to his love for her, which was considerably more heartfelt than his love for any other being, including Tenel Ka. After a near-successful assassination attempt on Allana and Tenel Ka by the assassin Aurra Sing—then under the alias \"Nashtah\"—Tenel Ka decided to leave Allana with her father on the Anakin Solo until it was safe enough for her to return to Hapes.\nHowever, even as a dangerous battle raged over Hapes, the Star Destroyer's security was not enough to deter Sing, who easily infiltrated the ship and defeated Allana's security droid. Only the personal intervention of her father Jacen saved the young Chume'da, as he kept the assassin from reaching Allana despite many personal injuries. When Sing was momentarily incapacitated, Allana injected her with a personal defense drug, knocking her out. She was later reunited with her mother on Hapes, although she again had to be hidden from the Skywalkers and Solos.\nDuring a private moment, Jacen discovered he actually cared more about Allana than Tenel Ka, as he thought of his daughter's welfare on a daily basis. Shortly after becoming co-Chief of State and leaving Coruscant, Jacen visited Allana to determine if Allana and Tenel Ka were meant to be his sacrifice. He gave Allana a stuffed tauntaun, which she named \"Jacen,\" and he left shortly thereafter, only to kill Mara Skywalker and take the name Darth Caedus.\nLater after Tenel Ka turned against Caedus by withdrawing all Hapan military support from the Galactic Alliance, Caedus vowed to kill anyone, including Tenel Ka, if she stood between him and his daughter. Caedus then kidnapped Allana from Tenel Ka in an effort to blackmail her into again pledging Hapes' support to the GA. Allana was replaced by a young orphan girl, Tika, who strongly resembled Allana in her looks. Caedus told Allana that people were trying to kill her so as to prevent her from complaining about being taken away from her mother. Tenel Ka had told Allana that anyone who took care of her would first have to provide a secret phrase, that together, they made up. Caedus never provided the words, frightening her in the process. Allana woke up from unconsciousness, telling Caedus that she hated him, after she hit him with a pass out gas dart that Tenel Ka had given her; it wasn't strong enough, though.\nCaedus then revealed to Allana that he was her father, calming her down, quickly forgiving him, and she embraced him, saying that she loved him.\nTenel Ka went to Luke Skywalker for help, and Luke agreed to rescue Allana from Caedus, leading a strike team to the Anakin Solo, where he, Ben, and Saba Sebatyne distracted Caedus, while Han and Leia rescued Allana. While returning Allana to Hapes, Han and Leia finally discovered their blood relationship between themselves and Allana; they were her grandparents.\nCaedus, meanwhile, angered that he had lost his daughter, targeted his rage at Patra Tebut, Force-choking her until her neck snapped.\nAfter the Jedi Order abandoned Endor as their base of operations, moving their headquarters to Shedu Maad, in the Transitory Mists, Leia later commented on how the proximity to Hapes would make visiting Allana much easier and more convenient.\nDuring the last stages of the war, Allana was kept close to her mother at all times, as a security precaution. When the nanokiller designed by the Moff Council targeting all those with Hapan royal blood was released on the Dragon Queen, Tenel Ka's flagship, most of the crew was killed, including Allana, apparently.\nHowever, Allana's \"death\" was actually a cover story concocted by Tenel Ka, in order to provide a safer environment for her daughter. She had faked Allana's death, sending out a message over the Holonet that Allana was one of the nanokiller's victims.\nIn reality, she released Allana into the care of her grandparents, Leia Organa Solo, and Han Solo, and Allana began training at the Jedi Academy, under the guise of a war orphan named Amelia. She was introduced under her alias to her aunt, Jaina Solo, after Jaina had killed Allana's father in a lightsaber duel over Shedu Maad.\nAs a tribute to Allana's \"death\", the Moff Council, under new High Moff Jagged Fel founded the Imperial Mission, as suggested by Allana's grandfather, Han Solo.\nIn 43 ABY, the eager, inquisitive, and Force-strong Allana discovered a strange object resembling an antiquated transponder aboard her grandfather's beloved spacecraft, and went with her grandparents on a journey to uncover the past of the Millennium Falcon. On Taris, during her trip with Solos, Allana was kidnapped, but saved by the rogue Jedi Seff Hellin; after this event, she noticed similarities between the way Jacen and Seff felt in the Force.\nLater in the same year, as Han and Leia journeyed into Kessel's caverns to save Lando Calrissian's mining facility from destruction, C-3PO and R2-D2 were charged with Allana's welfare; however, she managed to convince Threepio to let her outside onto the planet's surface, and when she moved out of the droids' range, she made her way to a mysterious tomb; there, she used the Force to reach out to it and heard a voice telling her that it could \"feel her\". The voice asked her who was there, begging her to respond and requesting her name. She later left the tomb and reunited with the droids.\nAllana later accompanied her grandparents on a mission to halt the destruction of Kessel, and was present for an encounter with a Kessel energy spider.\nThe Solos later attended the Coruscant Livestock Exchange and Exhibition, partially on the basis that Leia believed it would be beneficial for Allana to have a pet. Jedi Knights Natua Wan and Radd Minker tagged along for security. Allana wanted a tauntaun, but Han denied her, stating the creature's unpleasant smell. Allana decided she wanted to go to the Dangerous Animal level, and her grandparents reluctantly agreed. While viewing animals such as Nexu and a rancor, Natua Wan succumbed to Force psychosis. Natua made her way to the control room, where she locked the doors to the exhibit and disabled the forcefields and corrals holding the animals in the complex. As Radd Minker cut a hole through the door, Han held Allana, and together, they managed to escape the madness.\nLater that night, when the animals had been captured, and Natua Wan apprehended, Allana told Han and Leia that she had witnessed Leia killing a Nexu with a litter of cubs. Allana suggested that they adopt one of the cubs; otherwise, they would have no being to care for them. Her grandparents were once more reluctant, but they adopted a cub, which they named Anji.\nShortly thereafter, Allana was left in the care of Bazel Warv while Han and Leia went to meet with Jedi Master Cilghal about the insane Jedi. This alarmed Cilghal, since one of the few patterns noticed in the insane Jedi was that they had all stayed at Shelter during the Yuuzhan Vong invasion, like Warv. Cilghal's fears were realized later that day, although Allana had already left his presence.\nThat night, the Solos and Anji were watching The Perre Needmo Newshour when the broadcast concerned the events occurring earlier that day, specifically the insanity of Warv and Yaqeel Saav'etu. Leia listened to the stories and the Solos' conversation, and reflected that she and Han should not try to shelter Allana, as she was the future Queen Mother of Hapes. She then had a vision of Allana on a white throne, mirroring the visions experienced by Darth Caedus and Luke Skywalker.\nAfter receiving word of Luke and Ben Skywalker's experiences in the Maw, Leia and Han hurried to Dathomir to help them, reluctantly bringing Allana along. They ordered her to stay in the Falcon, watched over by C-3PO, R2-D2, Zekk, and Taryn Zel. Allana quickly got bored, and after Artoo disappeared, helped rescue him from the devious mechanic Monarg.\nShortly after they got back from Dathomir, Allana caught C-3PO behaving uncharacteristically, and discovered that he was helping Luke translate the Keshiri language spoken by the Sith that Luke was teamed up with. Allana needed significant comforting to assure her that Luke was not going to the dark side - or joining the Sith.\nFollowing the defeat of the Lost Tribe of Sith and Abeloth, Allana's true identity of Chume'da was revealed publicly during the marriage of her aunt, Jaina Solo, while the beginning of her Jedi training on Shedu Maad was planned.\nAllana was mentioned by Han Solo as part of the memories her grandmother had lost after she merged with the Force at the monolith.\nIn 41 ABY, shortly before his death, Darth Caedus had a vision of his daughter Allana as a tall young woman standing in the middle of a large crowd of mixed species in front of a large white throne, unifying the galaxy. This contrasted his previous vision at the Pool of Knowledge during his travels, where he saw the Dark Man on the Throne of Balance—with Allana standing at his side. This vision was the catalyst for Jacen's eventual transformation into Caedus: Jacen ended his travels immediately after the vision, determined to change what he saw. The vision he had of Allana on the white throne was proof that Caedus succeeded in changing the future, but by doing so he released Abeloth, the Bringer of Chaos.\nTwo years later, Leia Organa Solo had a similar vision of the young girl standing in front of a mix of species, looking to her for guidance and peace. In Leia's vision, Allana was also standing beside a large white throne, but no one was standing beside her.\nIn 43.5 ABY, Luke Skywalker had a similar vision to those of his sister and nephew, only this time Allana was surrounded by what looked to be her friends, in front of a white throne. When Ben looked into the Pool of Knowledge, he saw that he was among the friends who surrounded her. However, when the Sith High Lord Sarasu Taalon also looked into the Pool of Knowledge, he was very displeased to see a Jedi queen, whom he did not know was a relative of the Skywalkers, because he believed that if a Jedi queen rose to power, the Sith could not take over the galaxy. After Abeloth was defeated, Jacen revealed that the Dark Man on the throne with Allana standing at his side was the reason for his turn.\nAs the daughter of Jacen Solo and Tenel Ka Djo, and the great-granddaughter of Anakin Skywalker, the Chosen One, Allana possessed a very strong connection to the Force and survived deadly encounters. From an early age, her father taught her the power of Force stealth for her protection and she was able to heal herself as her grandfather noted that she was a fast healer, like her mother. Allana demonstrated the powers of Precognition and the Jedi Mind trick, and used Force bellow to escape her attacker by stunning him. Allana also exercised a natural ability for Animal friendship like her father in her relationship with her pet Nexu and received a Force vision of the Barabel nest being uncovered by the Lost Tribe of Sith on Coruscant.\nWhen upset, she could emanate the dark side against perceived threats. She also employed the power of Force flight.\nShe was a skilled markswoman and her father believed, should she have fallen to the dark side, she would have been such a powerful servant to Darth Krayt that he would have achieved lasting victory.\nAccording to Troy Denning , in his official thread on TheForce.net forums, Allana was named after the founder of the Force-sensitive Witches of Dathomir, Allya, and the brother of Jacen Solo, Anakin Solo . She was not named in The Unseen Queen because Tenel Ka wanted Jacen to have a part in choosing her name.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Good_Hunting",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Allana_Solo",
  "/wiki/Hapes/Legends",
  "/wiki/36_ABY",
  "/wiki/Human/Legends",
  "/wiki/Hapan",
  "/wiki/Gender/Legends",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Djo_family",
  "/wiki/Hapan_Royal_House",
  "/wiki/Skywalker_family/Legends",
  "/wiki/House_of_Solo",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Queen_Mother",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Chume%27da",
  "/wiki/Death/Legends",
  "/wiki/41_ABY",
  "/wiki/Battle_of_Uroro_Station",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/Nanovirus",
  "/wiki/Jedi_training/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Throne_of_Balance",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/The_galaxy/Legends",
  "/wiki/File:Tenelka-nec.jpg",
  "/wiki/Killik/Legends",
  "/wiki/Swarm_War",
  "/wiki/Chiss/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Attempted_assassination_of_Allana_Solo",
  "/wiki/Ben_Skywalker",
  "/wiki/Joiner",
  "/wiki/Gorog",
  "/wiki/Memory_rub",
  "/wiki/Ossus/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/File:Allana_Solo.jpg",
  "/wiki/Jacen_(stuffed_creature)",
  "/wiki/Stuffed_Tauntaun_Toy",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Anakin_Solo_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Battle_of_Hapes_(Second_Galactic_Civil_War)",
  "/wiki/Coruscant/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Saba_Sebatyne",
  "/wiki/Patra_Tebut",
  "/wiki/Endor/Legends",
  "/wiki/Shedu_Maad",
  "/wiki/Transitory_Mists",
  "/wiki/Dragon_Queen",
  "/wiki/High_Moff",
  "/wiki/Jagged_Fel",
  "/wiki/Imperial_Mission",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Allana_Solo",
  "/wiki/File:Allana_Solo_Standefer.jpg",
  "/wiki/43_ABY",
  "/wiki/Transponder",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Seff_Hellin",
  "/wiki/Kessel/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Calrissian-Nunb_Mines",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Mission_to_save_Kessel",
  "/wiki/Energy_spider",
  "/wiki/Coruscant_Livestock_Exchange_and_Exhibition",
  "/wiki/Natua_Wan",
  "/wiki/Radd_Minker",
  "/wiki/Tauntaun/Legends",
  "/wiki/Nexu/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Force_psychosis",
  "/wiki/Anji",
  "/wiki/File:Allanasolo.jpg",
  "/wiki/Bazel_Warv",
  "/wiki/Cilghal",
  "/wiki/Shelter",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/The_Perre_Needmo_Newshour",
  "/wiki/Yaqeel_Saav%27etu",
  "/wiki/Dathomir/Legends",
  "/wiki/Zekk",
  "/wiki/Taryn_Zel",
  "/wiki/Monarg",
  "/wiki/Abeloth",
  "/wiki/Wedding_of_Jagged_Fel_and_Jaina_Solo",
  "/wiki/Golden_flash",
  "/wiki/File:Anjiandme.jpg",
  "/wiki/Galaxy/Legends",
  "/wiki/Pool_of_Knowledge",
  "/wiki/Darth_Krayt",
  "/wiki/High_Lord",
  "/wiki/Sarasu_Taalon",
  "/wiki/Chosen_One/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Force_stealth",
  "/wiki/Force_healing/Legends",
  "/wiki/Precognition/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Force_bellow",
  "/wiki/Animal_bond",
  "/wiki/Barabel/Legends",
  "/wiki/Hatred",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Troy_Denning",
  "/wiki/TheForce.net",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Allya/Legends",
  "/wiki/Anakin_Solo",
  "/wiki/Millennium_Falcon_(novel)",
  "/wiki/Millennium_Falcon_(audiobook)",
  "/wiki/Dark_Nest_II:_The_Unseen_Queen",
  "/wiki/Dark_Nest_III:_The_Swarm_War",
  "/wiki/Legacy_of_the_Force:_Bloodlines",
  "/wiki/Legacy_of_the_Force:_Tempest",
  "/wiki/Legacy_of_the_Force:_Exile",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/Legacy_of_the_Force:_Inferno",
  "/wiki/Legacy_of_the_Force:_Fury_(audiobook)",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/Legacy_of_the_Force:_Invincible",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/Fate_of_the_Jedi:_Omen_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Backlash",
  "/wiki/Fate_of_the_Jedi:_Backlash_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_142",
  "/wiki/Crucible_(novel)",
  "/wiki/Crucible_(audiobook)",
  "/wiki/Jedi_Library_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_90",
  "/wiki/Jawa%27s_Corner",
  "/wiki/Star_Wars_Insider_95",
  "/wiki/Star_Wars_Insider_98",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_105",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Fate_of_the_Jedi:_Dramatis_Personae",
  "/wiki/Galaxy_at_War",
  "/wiki/Apocalypse..._Now!",
  "/wiki/Star_Wars_Insider_132",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/Jedi_Council_Forums"
 ]
}