{
 "name": "Allania Jakien",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bespin"
     ]
    },
    {
     "name": "Born",
     "values": [
      "8 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Allania Jakien was an eleven-year-old female Human who lived in Cloud City on Bespin. In 3 ABY, she witnessed the climactic battle there between Luke Skywalker and Darth Vader.\nThe daughter of a tibanna gas refiner and an employee of the Holiday Towers restaurant, Jakien had befriended an Ugnaught child and had learned from this companion the layout of the maze of Ugnaught tunnels beneath in the depths of the city. On the day that Baron Administrator Lando Calrissian ordered the evacuation of Cloud City, several friends and she submitted sick messages to school, and had chosen to play in the Ugnaught tunnels; when they heard the message, they turned to her for guidance. She led them toward her father in the gas refinery, but despite her experience, managed to get lost and encounter a stormtrooper squad.\nThe squad captured her friends, but Jakien managed to slip through their legs and enter a ventilation shaft. Now completely lost, she heard an unusual buzzing and, investigating, discovered two men fighting with lightsabers. She followed the two at a distance as they fought, watching in amazement as the larger, armored man used the Force to throw heavy objects at his opponent, knocking him through a viewport.\nWanting to learn what happened to the fallen hero, she found a shaft with a grating that looked into Cloud City's central wind tunnel. From there, she observed the continuation of the conflict, culminating in the armored man severing the hero's hand with his lightsaber. This brought her to tears, but she still listened to their words that echoed through the tunnel. She was shocked to hear that the armored man had killed the hero's father, but even more shocked when the armored man revealed the truth to the hero—that he was the hero's father. At this, the hero jumped, and Jakien lost sight of him; the armored man made a barely noticeable sigh, but then stopped in his tracks and looked directly at Jakien. Panicked, she fled upward, regardless of the threat that the stormtroopers might represent above.\nFortunately, upon arriving at the upper plaza, she ran into Bent Gavler, a family friend, who consoled her sobbing and reunited her with her family. The Jakiens left Bespin on a crowded transport, and from its window she spotted a light freighter fly past, which, for some reason, calmed her and reassured her that the hero had survived.\nEventually, Jakien was interviewed by Rebel historian Voren Na'al, who corroborated her story with other witnesses.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bespin/Legends",
  "/wiki/8_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Duel_on_Cloud_City/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Tibanna/Legends",
  "/wiki/Holiday_Towers",
  "/wiki/Ugnaught/Legends",
  "/wiki/City/Legends",
  "/wiki/Baron_Administrator/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Bent_Gavler",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Voren_Na%27al/Legends",
  "/wiki/West_End_Games",
  "/wiki/Little_Girl_Lost",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back",
  "/wiki/The_Movie_Trilogy_Sourcebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}