{
 "name": "Alma",
 "display_name": "Alma",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Imperial Intelligence",
      "Imperial Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Alma was a Human female who served the reconstituted Sith Empire as a spy working for Imperial Intelligence during the Cold War, a conflict between the Empire and the Galactic Republic.\nAlma was a Human female who served the Sith Empire during the Cold War as part of Imperial Intelligence. During the war Alma was sent to the Republic held planet of Ord Mantell where she acted as a spy. She went under cover as an occupant of Talloran village and spied on the nearby Republic Fort Garnik. However a Civil war broke out on Ord Mantell during her time there. The Mantellian Separatist Movement opposed the corrupt planetary government which was supported by the Republic. The separatists managed to capture Talloran village and Alma was forced to flee.\nAlma ended up in a refugee camp outside of Fort Garnik where she realized in her rush to escape Talloran she had left behind a necklace which she used to communicate with Imperial intelligence.\nShe asked a smuggler named Ace and a member of Havoc Squad whom she met in the camp to recover the amulet claiming it was an heirloom that had belonged to her great great Grandmother.\nThe pair traveled to Taloran to recover it but there encountered a member of the Republic Strategic Information Service named Ebenga whom informed them of Alma's true nature as he had been observing her for several months suspecting she was a spy. He asked them to bring the amulet to him instead as he needed it to confirm his suspicions which they did. He thanked them and later arrested Alma using the amulet as evidence against her.\nAlma was a Non-player character in the MMORPG Star Wars: The Old Republic released by BioWare in 2011. She gives players of the smuggler and Republic trooper class an optional quest on their starting planet of Ord Mantell. During the quest players can choose to either give the amulet they recover back to Ebenga or to Alma as a dark side option. This article assumes the light side option was chosen. Despite being an Imperial there is no way for players of the Imperial faction to interact with her as they cannot currently travel to Ord Mantell.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Ebenga",
  "/wiki/Spy/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Talloran_village",
  "/wiki/Fort_Garnik",
  "/wiki/Separatist_War",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Canon",
  "/wiki/Smuggler/Legends",
  "/wiki/Voidhound",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Havoc_Squad",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Republic_trooper",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}