{
 "name": "Almar_Varangi_Ferd",
 "display_name": "Almar Varangi Ferd",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.10 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Navy",
      "Imperial Navy",
      "PiratesProvidence",
      "Providence"
     ]
    }
   ]
  }
 ],
 "content": "Almar Varangi Ferd was a male Human criminal who operated as a pirate captain during the Galactic Civil War.\nFerd was a colossal man, tall and muscular, who would often wear bounty hunter attire with the Mo'ork skull, his coat of arms, on his handles and chest. He wore a colonel's cap from the Imperial Army and a BlasTech 8000 heavy blaster.\nHis two Gamorrean bodyguards never left his side, and he regularly used his position to abuse others, which prevented his numerous crew as well as the citizens of Providence from truly liking him.\nColonel Viyenah of Imperial Intelligence suspected him to be of Corellian birth and to have been part of the Imperial Navy, where he would have acquired his leadership qualities. After his retirement, he became a cargo pilot before becoming a pirate, with a crew mainly composed of renegade soldiers, traitors and brutish men.\nFerd was sentenced to death on more than twenty planets, and had bounties on his head all over the galaxy, since he dedicated his operations to attacks on merchant ships and planetary facilities. He also practiced slavery, and always killed useless prisoners.\nHe nourished a feud with Han Solo ever since Solo caused him to lose a cargo.\nFerd was brutal and impulsive, readily tyrannical and dominating. Viyenah compared him to a dictator.\nThis attitude led his crew to both show him admiration and fear him, as he didn't hesitate to execute those who broke his rules.\nVulgar and repulsive, he was nonetheless smart and capable, able to deploy intelligence and cunning in perilous situations. He was an exceptional pilot.\nAlmar Varangi Ferd was created by Jean-Michel Ringuet for the ambiguously canon roleplaying aid \"Providence,\" which appeared in the French magazine Avalon 1. He was illustrated by Jean-Marc Emy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Providence",
  "/wiki/Pirate/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Viyenah",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Jean-Michel_Ringuet",
  "/wiki/Canon",
  "/wiki/Roleplaying_game",
  "/wiki/Providence_(Avalon)",
  "/wiki/Avalon_1",
  "/wiki/Jean-Marc_Emy"
 ]
}