{
 "name": "Almudin",
 "display_name": "Almudin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Almudin was a human male who served as a commodore in the Galactic Empire. In 10 BBY, Almudin was part of a military tribunal and oversaw the court martial of Imperial cadet Han Solo, who had disobeyed orders during an attack by raiders on Onyx Squadron, which he was flying in at the time, to save the life of Cadet Lyttan Dree.\nThe court martial resulted in Solo's expulsion from the flight academy at Carida and the Imperial Navy, thereafter reassigning him to the 224th Imperial Armored Division on Mimban. It was rumored that Almudin had an amazing flight record before his assignment on the tribunal.\nCommodore Almudin was a human male who served in the Imperial Navy of the Galactic Empire. In 10 BBY, Almudin had the job of sentencing Navy pilots at military tribunals and was one of the Imperial officers present for the tribunal of Imperial cadet Han Solo, a student at the Imperial flight academy on the planet Carida and a member of Onyx Squadron. Solo had disobeyed a direct order during a dogfight with raiders in order to save fellow cadet Lyttan Dree, who was flying under the callsign Onyx Two.\nAt the tribunal, Almudin had Solo recount the events of the mission in which he had saved Onyx Two, even though the details were all included in the cadet's report. Almudin and the other officers present, including Warrant Officer Ardwyl Hercho, proceeded to find Solo guilty of disobeying a direct order and reassigned him to the 224th Imperial Armored Division of the Imperial Army, which was fighting on the planet Mimban. Solo later deserted and became a criminal and wished that Almudin was with him while he was making a record breaking Kessel Run with a cargo of unrefined coaxium. The former cadet doubted that the commodore would have been impressed with his skills, but would have prefered to have had Almudin there to die with him if the coaxium exploded, although ultimately, Solo successfully completed the run with the coaxium intact.\nAlmudin had a particularly round face, which Han Solo found distracting and irritating during his military tribunal. Almudin spoke to the cadet with a tone of less than disgust and, upon sentencing, made sure to note that he in particular found Solo guilty. When Solo forgot the commodore's rank, Almudin initially did not change his expression as Solo tried to correct himself but finally broke as the cadet finished.\nInterpreting the cadet's words as mockery, Almudin warned him that being a \"smart ass\" would not help his cause. Solo had heard rumor that Almudin had an amazing flight record prior to his tribunal assignments. The commodore had tan skin, graying black hair, and brown eyes. He spoke Galactic Basic Standard with an aristocratic accent.\nAlmudin wore a gray Imperial officer's uniform with four code cylinders and a rank insignia plaque.\nAlmudin was created for the 2018 Anthology film, Solo: A Star Wars Story; however, the sole scene including the character was cut from the final release. Despite this, the scene appeared in various adaptations of the film, starting with Solo: A Star Wars Story: Expanded Edition, a novelization written by Mur Lafferty and released on September 4, 2018. The novel adaptation of the scene bore only slight differences in dialogue from the film's script. The audiobook of the novel also differs slightly from both the film and novel, as Almudin's use of the term \"smart-ass\" is removed.\nThe scene was depicted for the first time in the first issue of the comic adaptation of Solo, released on October 10, 2018, and written by Robbie Thompson with illustrations by Will Sliney. The depiction of the military tribunal in the comic adaptation differs in several ways from the film script and novelization, including Almudin's dialogue. This article assumes that the dialogue from novelization takes precedence in canon over the comic adaption. The scene itself, in which Almudin was portrayed by Ramon Tikaram, was then included as a deleted scene on the home-video release of the film. Due to its inclusion in the novelization, this article treats the deleted scene as also being canonical.\nThe novelization and the 2018 junior novelization of the film by Joe Schreiber both include Solo thinking of Almudin while making the Kessel Run; however, in the novelization the mention is presented as Solo merely thinking of the commodore, whereas in the junior novel he mentions Almudin to his allies Chewbacca and Tobias Beckett in dialogue, incorrectly calling Almudin a captain rather than a commodore. This article makes no assumptions about which of these versions of events is canon beyond the fact that Solo wished Almudin was there.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/File:Almudin_and_Solo-Maverick.ogg",
  "/wiki/Commodore",
  "/wiki/10_BBY",
  "/wiki/Imperial_Military",
  "/wiki/Tribunal_of_Han_Solo",
  "/wiki/Imperial_cadet",
  "/wiki/Han_Solo",
  "/wiki/Attack_on_Onyx_Squadron",
  "/wiki/Onyx_Squadron",
  "/wiki/Pilot",
  "/wiki/Time",
  "/wiki/Cadet",
  "/wiki/Lyttan_Dree",
  "/wiki/Carida_Academy",
  "/wiki/Carida",
  "/wiki/Imperial_Navy",
  "/wiki/224th_Imperial_Armored_Division",
  "/wiki/Mimban",
  "/wiki/File:Almudin-Guilty.ogg",
  "/wiki/Imperial_officer",
  "/wiki/Planet",
  "/wiki/Callsign",
  "/wiki/Onyx_Two",
  "/wiki/Officer",
  "/wiki/Warrant_Officer",
  "/wiki/Ardwyl_Hercho",
  "/wiki/Imperial_Army",
  "/wiki/Mimban_Campaign",
  "/wiki/Kessel_Run",
  "/wiki/Coaxium",
  "/wiki/Death",
  "/wiki/File:Almudin_and_Solo-Smart_ass.ogg",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Mur_Lafferty",
  "/wiki/September_4",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_1",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation",
  "/wiki/October_10",
  "/wiki/Robbie_Thompson",
  "/wiki/Will_Sliney",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ramon_Tikaram",
  "/wiki/Star_Wars_home_video_releases",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Joe_Schreiber",
  "/wiki/Chewbacca",
  "/wiki/Tobias_Beckett",
  "/wiki/Captain",
  "/wiki/Category:Audio_files_of_Almudin",
  "/wiki/Category:Images_of_Almudin",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Marvel_Comics",
  "/wiki/September_14",
  "/wiki/December_8",
  "/wiki/2019"
 ]
}