{
 "name": "Alph  (Rogue)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "secret armada"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Rogue Squadron",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Alph was a Human male pilot in the Rebel Alliance's Rogue Squadron in the year 3 ABY. When the Alliance learned that a massive Imperial armada was transporting a communications-amplifying Teezl creature to the Empire's capital planet of Coruscant, Alph was one of four Rogues selected to fly captured Imperial TIE fighters into the heart of the armada and take the creature out. After obtaining the recognition codes needed to enter the fleet, the four set off in their TIEs as Flying Bantha Squadron and successfully joined the armada. Their attack on the armada's Star Destroyers prompted a counterattack that killed Alph, but his mission commander, Luke Skywalker, was able to destroy the Teezl.\nAlph was a Human male member of the Rebel Alliance in the year 3 ABY, during the Alliance's war against the Galactic Empire. He served the Rebels as a starfighter pilot in Rogue Squadron. Alph was stationed at the Alliance's Haven Base on the planet Arbra in the first half of 3 ABY, around the time the Rebels learned that the Empire was building a secret armada. The armada—one of the largest in Imperial history—was transporting a Teezl, a unique creature that could naturally amplify hyperspace communications, to the Empire's capital world of Coruscant.\nA strike at the armada was planned, and the Alliance initiated Operation Earplug by acquiring four Imperial TIE fighters from the weapons trader Orion Ferret. The TIEs were then used to seize an Imperial base on the planet Spindrift and obtain the armada's route coordinates. The Alliance was finally ready to infiltrate the enemy fleet, and Alph was chosen to be one of the mission's pilots. Alph and a group of other Rebels made their way to an uninhabited planetoid near the armada's route and sent out a distress signal, which was picked up by a far reconnaissance patrol of four Imperial TIE fighters. After Rebel X-wing fighters destroyed them, their sole survivor was forced to reveal the recognition codes for entrance into the armada.\nAlph and three other Rogues—Shira Brie, Hanc Thorben, and mission commander Luke Skywalker—then boarded their TIE fighters and became Flying Bantha Squadron. The TIEs had been modified to fire only six laser bursts at standard strength, after which they would release their energy stores in a shot powerful enough to cut through even the strongest shields. Signal transceivers had also been added to the craft so that the Rebel pilots could recognize each other among the enemy fleet. After arriving at the armada and gaining entrance with their stolen codes, the four Flying Banthas each chose an Imperial Star Destroyer and attacked. The Imperials mounted a hasty counterattack and began to fire wildly, initially only hitting each other but eventually destroying Alph's TIE with lasers. Alph was killed in the explosion, but Skywalker was able to take out the Teezl and win the day.\nAlph was a member of Rogue Squadron, a group that was composed of the Rebel Alliance's top pilots. However, he was killed during the battle of the secret armada while flying a TIE Fighter. Alph had dark skin.\nAlph was created in 1982 as a character in Star Wars  61, an issue of Marvel Comics' ongoing Star Wars comic series. The issue was written by David Michelinie and Walt Simonson, penciled by Simonson, and colored by Glynis Wein. Twenty years later, Shira Brie's entry in The New Essential Guide to Characters explicitly confirmed that Alph was a member of Rogue Squadron.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Pilot/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Alph_(guard)",
  "/wiki/City_of_Bone",
  "/wiki/3_ABY/Legends",
  "/wiki/Secret_armada",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Teezl",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Operation_Earplug",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Fleet/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Flying_Bantha_Squadron",
  "/wiki/Battle_of_the_secret_armada",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Space_warfare",
  "/wiki/Death/Legends",
  "/wiki/Delta_Leader/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Haven_Base",
  "/wiki/Arbra/Legends",
  "/wiki/Time/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Arms_dealer/Legends",
  "/wiki/Orion_Ferret",
  "/wiki/Skirmish_on_Spindrift",
  "/wiki/Spindrift_Station",
  "/wiki/Spindrift",
  "/wiki/Uninhabited_planetoid",
  "/wiki/Distress_signal/Legends",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Milnn",
  "/wiki/Lumiya",
  "/wiki/Hanc_Thorben",
  "/wiki/Laser/Legends",
  "/wiki/Ultra-power_blast",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Signal_transceiver",
  "/wiki/Bantha/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/1982",
  "/wiki/Star_Wars_(1977)_61",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/David_Michelinie",
  "/wiki/Walter_Simonson",
  "/wiki/Glynis_Oliver",
  "/wiki/2002",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_(1977)_60",
  "/wiki/Wizards.com",
  "/wiki/Arbra:_Sanctuary_In_the_Storm",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}