{
 "name": "Alpha_(clone)",
 "display_name": "Alpha  (clone)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Frozen moon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "41.5 ABY",
      "Frozen moon in the Unknown Regions"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Empire of the Hand",
      "Community"
     ]
    }
   ]
  }
 ],
 "content": "Alpha was a clone of Jedi Master Kam Solusar, created by Imperial scientists on the orders of Grand Admiral Thrawn. He was the mate of Hunter with whom he sired two daughters, Blessing and Grace. In 41 ABY, he was killed on a moon in the Unknown Regions by Jedi Knight Jaden Korr after a lightsaber duel.\nAlpha was an extremely powerful Force-user, shown by the fact that he was selected as the leader of the Community. When he was faced by Jedi Knight Jaden Korr, Alpha dueled with savage ferocity in his form of lightsaber combat. So much, that Jaden, an experienced Jedi Knight with incredible mastery over both the Light and Dark Sides of the Force, was almost killed in their duel, in the first few minutes. Alpha's Force presence was described as that of a dark-side user, but adulterated with something else, proving the fact that he can use dark and light Side powers.\nAlpha was insane from clone madness, and he had a mad desire to feed and worship the Rakatan entity known as Mother.\nLike other clones in the secret facility, Alpha was able to steal enough parts to construct his own lightsaber, which may have been what allowed the clones to rebel. Jaden Korr compared Alpha's lightsaber to the purple-bladed lightsaber Korr had constructed without training and eventually used to kill Alpha. Alpha's lightsaber was said to be \"unstable\", and spit sparks when activated. After defeating Alpha, Jaden Korr kept the clone's unstable, red-bladed lightsaber to replace the green-bladed lightsaber he had constructed upon becoming a Jedi Knight, which he had lost in the duel with Alpha. Jaden Korr later cleansed the lightsaber of Alpha's Dark residuum left in the crystal. After the cleansing, it turned yellow, as Jaden Korr was thinking of Relin Druur at the time. The yellow bladed lightsaber then became Jaden Korr's primary lightsaber, and was said to be a final tribute to Relin Druur's memory.\nAlpha was said to be wearing a combination of rags, doctors' clothing, and stormtroopers' armor retrieved from those who were stationed at the facility and were killed when the clones rebelled.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Alpha_(clone)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Alpha_(clone)",
  "/wiki/Alpha",
  "/wiki/Frozen_moon",
  "/wiki/41_ABY",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Empire_of_the_Hand",
  "/wiki/Community",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kam_Solusar",
  "/wiki/Scientist/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Hunter_(clone)",
  "/wiki/Blessing",
  "/wiki/Grace_(Human)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jaden_Korr",
  "/wiki/Mission_to_the_frozen_moon",
  "/wiki/Relin_Druur",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Crosscurrent",
  "/wiki/Riptide_(novel)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}