{
 "name": "Alpha-17",
 "display_name": "Alpha-17",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Squad Seven",
      "Squad Seven"
     ]
    }
   ]
  }
 ],
 "content": "Alpha-17, otherwise known as A-17 or simply Alpha, was an Alpha-class Advanced Recon Commando in the Republic's clone army during the Clone Wars.\nAlpha, as was the case with the rest of the ARCs, first saw action with the Separatist invasion of Kamino. As the Confederacy's droid forces pushed towards the heart of Tipoca City, the Kaminoan Prime Minister, Lama Su, activated the ARCs and authorized their deployment to hot-spots across Kamino in a last-ditch effort to save the planet's precious cloning facilities.\nDuring the fighting to push the droids from Tipoca's central armory, Alpha teamed up with Jedi Master Shaak Ti, Jedi Knight Obi-Wan Kenobi, and Kenobi's Padawan, Anakin Skywalker. When the city's clone stocks became compromised, Alpha rigged the lab to self-destruct, much to the dismay of the Jedi. After remarking, \"They grow up loyal to the Republic, or they don't grow up at all,\" it was clear to the Jedi that they were not dealing with an average clone trooper. Ti wished there was another way, so Alpha made a strategy for Obi-Wan and Anakin to collapse the transparisteel walls linking the facility while Ti held back the ocean before they sealed the place off. When the plan worked and the attack was successfully repelled, Alpha then aborted the detonation sequence.\nWhen Naboo lost contact with the Gungan colony moon of Ohma-D'un, a Separatist attack was suspected, and General Kenobi and Skywalker were sent to investigate. Kenobi, having witnessed his lethal effectiveness on Kamino, took Alpha along for the ride. When the trio arrived on the surface, they found the Gungan colony in ruins and bodies for as far as the eye could see. Before they could complete their investigation into the cause of the genocidal slaughter, however, they fell under attack from the bounty hunter Durge and the Dark Jedi Asajj Ventress. Under Kenobi's orders, Alpha went with Anakin to find and destroy the bio-weapon responsible for Ohma-D'un's destruction before it could be let loose in Theed. It was then that Anakin, uncomfortable with calling him simply \"clone,\" named the ARC trooper \"Alpha\".\nFollowing the mission to Ohma-D'un, Alpha was once again chosen by Kenobi and Anakin to accompany them on another important mission. This time, the three were to lead the assault on the obscure Outer Rim world of Jabiim, which had recently declared its allegiance to Count Dooku's Confederacy. The initial days of the assault saw victory after victory for the Republic, but, as the rain continued to pour, their assault vehicles became bogged down in the mud and became an easy target for the Jabiimi guerrillas. As Republic casualties mounted, the rebels, their forces now bolstered with the addition of Separatist battle droids, stepped up their attacks. The Republic was dealt its greatest blow with the apparent death of Obi-Wan and Alpha while they were clearing out a downed All Terrain Armored Transport.\nNeither Obi-Wan nor Alpha, however, died in the explosion that supposedly took their lives. In truth, they fell into Separatist custody and were transferred to a secret prison on Rattatak. Once there, Asajj Ventress, the dark Jedi from Ohma-D'un, tried to beat and torture the two of them into revealing sensitive information regarding Republic troop movements. Before she got the information she wanted, however, the two of them escaped under the guise of a prison break. Having fought their way off Rattatak and away from Ventress with the help of Anakin and Master Ki-Adi-Mundi, the two found their way back to the Republic and to the Grand Army.\nFollowing the ordeal, and after several weeks in a bacta tank, Alpha was transferred out of General Kenobi's Third Systems Army and was sent back to Kamino, where he was to train current and future generations of clone commanders. He followed Anakin's previous suggestion that he give them names, was promoted to the rank of captain, and became lead instructor of the Tipoca City training facility. Commanders Cody of the 212th Attack Battalion, Neyo of the 91st Reconnaissance, Bacara of the 21st Nova Corps, Gree of the 41st Elite Corps, Appo of the 501st Legion, Rex of the 501st Legion, Bly of the 327th Star Corps, Faie, and many more were among the first hundred to be enrolled in and graduate from his experimental training regimen, known as the ARC training program. Of those first hundred, a few were hand-picked by Alpha and assigned to Squad Seven, with Commanders Davijaan and Cody as its leaders.\nAlpha's duties on Kamino, however, did not mean an end to service in the field. Alpha was chosen to accompany Senator Bail Organa on his tour of the Outer Rim Sieges aboard the Star Destroyer Intervention. When the Intervention was commandeered by General Kenobi in order to lead the assault on Boz Pity, Alpha readied himself for yet another battle. During the fighting, Alpha was critically wounded by General Grievous himself, so much so that it was thought he'd never walk again. As hostilities wound down, Alpha, along with the supposed corpse of Asajj Ventress, was loaded onto a medical transport and sent back to Coruscant for treatment. En route, however, Ventress proved very much alive when she took control of the transport and ordered its pilots to take her into the unknown.\nAccording to the Star Wars: The Clone Wars DVD's commentary, the creators at first had decided to put in Alpha-17 as the Clone Wars series' prime clone character. However, Lucas objected because his inclusion would make too much of an alliteration , so a different clone character, clone trooper captain \"Rex,\" was created.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alpha",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Squad_Seven_(Galactic_Republic)",
  "/wiki/Alpha-class_Advanced_Recon_Commando",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/First_Battle_of_Kamino",
  "/wiki/Droid/Legends",
  "/wiki/Tipoca_City/Legends",
  "/wiki/Kaminoan/Legends",
  "/wiki/Prime_Minister_(Kamino)",
  "/wiki/Lama_Su/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Transparisteel/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Ohma-D%27un/Legends",
  "/wiki/Durge/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Jabiim/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Rattatak/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Third_Systems_Army/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/Clone_trooper_captain",
  "/wiki/CC-2224/Legends",
  "/wiki/CC-8826/Legends",
  "/wiki/CC-1138/Legends",
  "/wiki/CC-1004/Legends",
  "/wiki/CC-1119/Legends",
  "/wiki/CT-7567/Legends",
  "/wiki/CC-5052/Legends",
  "/wiki/Faie/Legends",
  "/wiki/ARC_training_program",
  "/wiki/Davijaan",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Outer_Rim_Sieges/Legends",
  "/wiki/Intervention",
  "/wiki/Battle_of_Boz_Pity_(Clone_Wars)",
  "/wiki/Boz_Pity/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/R2-D2/Legends",
  "/wiki/Republic_50",
  "/wiki/Star_Wars:_Republic:_The_New_Face_of_War",
  "/wiki/Republic_Commando:_Triple_Zero",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Republic_55",
  "/wiki/Republic_60",
  "/wiki/Republic_62",
  "/wiki/Star_Wars_Insider",
  "/wiki/Republic_HoloNet_News_Core_Edition_15:2:22",
  "/wiki/Star_Wars_Insider_74",
  "/wiki/Republic_68",
  "/wiki/Obsession_3",
  "/wiki/Obsession_4",
  "/wiki/Obsession_5",
  "/wiki/Labyrinth_of_Evil",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith_(novelization)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith_(unabridged_audiobook)",
  "/wiki/Star_Wars:_The_Force_Unleashed_(comic)",
  "/wiki/Empire_34",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_102",
  "/wiki/The_Official_Star_Wars_Fact_File_109",
  "/wiki/The_Official_Star_Wars_Fact_File_112",
  "/wiki/The_Official_Star_Wars_Fact_File_114",
  "/wiki/The_Official_Star_Wars_Fact_File_125",
  "/wiki/The_Official_Star_Wars_Fact_File_136",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/Revenge_of_the_Sith_(TCG)",
  "/wiki/Guide_to_the_Grand_Army_of_the_Republic",
  "/wiki/Star_Wars_Insider_84",
  "/wiki/StarWars.com",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Militaries_of_Star_Wars",
  "/wiki/The_Clone_Wars_Campaign_Guide",
  "/wiki/The_Art_of_Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars:_The_Clone_Wars_%E2%80%93_The_Official_Episode_Guide:_Season_1",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_30",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_32",
  "/wiki/Databank_(original)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2013)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_2_(2013)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Episode_Guide",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_19",
  "/wiki/Star_Wars:_The_Clone_Wars_(toy_line)",
  "/wiki/Star_Wars:_Obsession"
 ]
}