{
 "name": "Alpha-30",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Born",
     "values": [
      "32 BBY",
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Mandalorians"
     ]
    }
   ]
  }
 ],
 "content": "Alpha-30, also known as A-30 and Sull, was an Alpha-class Advanced Recon Commando. He served as a lieutenant in the Grand Army of the Republic during the Clone Wars.\nIn 21 BBY, Sull was deployed to Gaftikar. His assignment was to train the planet's disenfranchised Marit population as a rebel army, in order to overthrow Gaftikar's Human-biased government. During the mission, Sull disappeared, and was officially listed as missing in action.\nTwo months after Sull's disappearance, Sergeant A'den and Omega Squad were sent to Gaftikar. They were tasked with assassinating key members of the Gaftikari government, paving the way for a Marit coup. However, during a recon of the capital city Eyat, two members of Omega Squad, Darman and Atin, spotted Sull and tracked him to an apartment in the city. After a short struggle, during which he bit Darman's hand, Sull was apprehended and returned to the Marit village that served as Omega's base of operations.\nUnder interrogation by A'den, Sull made a shocking claim: Clones who attempted to desert the Grand Army were summarily executed, not because they had deserted, but simply because they could no longer be completely trusted. He told of another clone, a friend of his called Tavo, who had tried to run, and had been tracked down by Republic Intelligence agents and shot. Sull's assertions raised disturbing questions about what would happen to the GAR's clone personnel once the war, and their usefulness to the Republic, ended. While it was almost certain that regular clones would still be retained, mainly due to their leashed independence and unquestioning loyalty to the Republic, the future of the clones that were less tampered would eventually have been considered more of a threat than an asset.\nIn the end, A'den decided to release Sull. Over protests from Niner, he arranged for Sull to leave Gaftikar on Nyreen Vollen's ship and reported to the Republic's SO Brigade that ARC trooper A-30 had died of unknown causes during the course of his mission. Shortly after, what Sull had said was confirmed when two Covert Ops clone troopers attacked Darman, under the mistaken belief that he was Sull.\nLater in the war, Sull encountered Fi at a cantina on Mandalore. Surprised to see him again, he was taken aback by his state. In the company of another renegade ARC Spar, Sull met former Jedi Bardan Jusik. Sull angrily demanded to know who ordered the executions of Alpha ARCs who deserted, attacking Jusik. The former Jedi understood Sull's anger, and tried to calm him. In defense of Jusik, Fi however, reacted by punching Sull and threatening to kill him should he ever get too close to Jusik.\nLater, Sull and Spar found out that Kal was attempting to reverse the aging process and wanted to join him. They agreed to participate in the liberation of Kal Skirata´s Separatist daughter Ruusaan Skirata, although Sull still had no love for the Jedi, and within all odds had a low, if non-existent, opinion on them.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Alpha-30",
  "/wiki/Kamino/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Alpha-class_Advanced_Recon_Commando",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Gaftikar",
  "/wiki/Marit",
  "/wiki/Sergeant/Legends",
  "/wiki/A%27den_Skirata",
  "/wiki/Omega_Squad",
  "/wiki/Eyat",
  "/wiki/Darman_Skirata",
  "/wiki/Atin_Skirata",
  "/wiki/Death/Legends",
  "/wiki/Tavo",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/Niner_Skirata",
  "/wiki/Nyreen_Vollen",
  "/wiki/Special_Operations_Brigade/Legends",
  "/wiki/Covert_Ops_clone_trooper",
  "/wiki/Cantina/Legends",
  "/wiki/Spar",
  "/wiki/Jedi/Legends",
  "/wiki/Ruusaan_Skirata",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}