{
 "name": "Alrich Wren",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Krownest"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown",
      "slightly graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "House Vizsla",
      "Clan Wren",
      "Clan Wren"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorian resistance"
     ]
    }
   ]
  }
 ],
 "content": "Alrich Wren was a human male Mandalorian, and the husband of Ursa Wren, leader of Clan Wren. Upon his marriage to Ursa, Alrich elected to adopt his wife's surname, because of the power and respect it held in Mandalorian society. The couple had two children together, a son named Tristan, and a daughter they named Sabine. Alrich, unlike his wife and children, was not a warrior, being an artist instead. Sabine inherited his artistic talents, although he humbly credited her prowess to Ursa. After his daughter fled the Imperial Academy of Mandalore, he eventually found himself a political prisoner in all but name, held on Mandalore to ensure his wife and clan's compliance with the Imperial occupation.\nAt some point in time following the Battle of Atollon, Alrich's daughter Sabine led a mission to rescue her father from Imperial custody. Amid a heated ambush of an Imperial convoy transporting Wren to the Mandalorian capital of Sundari for execution, Wren was successfully rescued by the rebel agent Ezra Bridger, and reunited with his daughter.\nAlrich Wren was the husband of Countess Ursa Wren, the leader of Clan Wren. After marrying Ursa, Alrich adopted his wife's surname, because of the power and respect it held in Mandalorian society. The couple produced two children together, a daughter named Sabine and a son named Tristan. Alrich and his family supported the Galactic Empire and its New Order, which emerged following the Clone Wars.\nWhen Tristan was still an infant, Alrich often traveled to Tarre Vizsla's statue on Mandalore with Sabine, to appreciate its art and history.\nWhile Sabine was studying at the Imperial Academy of Mandalore, she built weapons that the Empire used to subjugate the Mandalorians. One of these weapons was the Arc Pulse Generator known as the \"Duchess,\" which was capable of reacting with the beskar alloy inside Mandalorian armor and incinerating the wearers. When Sabine spoke out against the Empire, Alrich and his family stood by the Empire and denounced her. Sabine subsequently fled into hiding and later joined the rebellion.\nSabine's actions undermined the political position of Clan Wren. To guarantee the cooperation of the remaining Wrens, Alrich was made a hostage of Governor Gar Saxon, the Imperial–appointed Viceroy of Mandalore and the Emperor's Hand. His son Tristan was conscripted into Saxon's Imperial Super Commandos. Alrich's wife Ursa was allowed to continue ruling Clan Wren's domain on the planet Krownest but the family was treated with suspicion and had to go the extra length to prove its loyalty to Clan Saxon and the Empire.\nIn 2 BBY, Sabine returned to Krownest to seek her family's help in aiding the rebellion. Countess Ursa initially refused to help since she did not want to endanger her husband Alrich. In an attempt to save her daughter, Ursa tried to turn in Sabine's Spectres comrades Kanan Jarrus and Ezra Bridger to Governor Saxon. However, Saxon reneged on the deal and ordered his men to destroy Clan Wren. Fortunately for the Wrens, Kanan, Ezra, and the Mandalorian Protector Fenn Rau helped the Wrens to fight off Saxon's Imperial Super Commandos. Sabine defeated Saxon in lightsaber combat but spared his life. When Saxon tried to murder Sabine, Ursa killed him instead. Saxon's death sparked a Mandalorian Civil War.\nAfter Clan Wren assisted the rebels during the Battle of Atollon, Clan Wren and the Spectres took part in a joint operation to liberate Alrich, who was imprisoned at a prison outpost on Mandalore. Before Sabine and her forces attacked the prison outpost, Gar Saxon's brother and successor Governor Tiber Saxon ordered that Alrich be transported to the capital Sundari for a public execution. By the time Ursa had obtained this information, Sabine had already departed.\nSabine's joint Mandalorian-rebel force backed by Lady Bo-Katan Kryze's Nite Owls later ambushed the Imperial convoy transporting Alrich above a canyon. Observing the approaching column, Rau deduced that Alrich was in the middle Imperial Troop Transport. While Sabine, Rau, Kanan, and Lady Bo-Katan attacked the convoy's speeder bike escorts, Ezra climbed onto the transport. After throwing out the drivers and the guards, Ezra freed Alrich from his restraints. After clarifying that he was with Sabine but not romantically, Ezra gave Alrich his jetpack. While Alrich rocketed out of the transport before it fell into a chasm, Ezra used his Force powers to Force jump out of the transport.\nAlrich reunited with his daughter. However, this victory was overshadowed by news that Ursa and Tristan's forces had been annihilated by the weapon known as the \"Duchess.\" Fortunately for the Wrens, Ursa and Tristan managed to take shelter. After rescuing Ursa and Tristan, Alrich and the others evacuated aboard one of Lady Bo-Katan's starships. During the journey to Bo-Katan's camp, Alrich learnt about Sabine's role in creating the \"Duchess.\" When Sabine's rebel friend Ezra suggested that the Mandalorians construct their armor out of something different from beskar alloy, Alrich and the others looked with shock. Sabine then educated him about the importance of Mandalorian armor to Mandalorian families.\nAfter arriving at Bo-Katan's camp, Alrich and his family participated in a meeting to plan the operation to destroy the \"Duchess.\" Sabine agreed to lead the mission in order to atone for her role in creating the weapon. Ursa offered to lead the strike but Fenn Rau counseled her that she still could not hold a blaster due to her injuries. Alrich and Tristan managed to convince Ursa to listen to reason. Alrich and his wife remained at the camp while Sabine and Tristan accompanied the strike team to Tiber Saxon's Star Destroyer where the weapon was housed. The joint rebel and Mandalorian force managed to destroy the weapon, the associated data, and Saxon's Star Destroyer.\nFollowing the destruction of the \"Duchess,\" Alrich joined his family and the other Mandalorian clans in pledging allegiance to Lady Bo-Katan, who inherited the Darksaber and the mantle of Mandalorian leadership.\nAlrich Wren was a human man with brown eyes and dark brown hair, eyebrows, and a goatee that was turning gray. He was a Mandalorian artist who married into a warrior Clan Wren. Alrich's artistic talents were inherited by his daughter Sabine. As a Mandalorian, he wore Mandalorian armor and knew how to operate a jetpack. Alrich regarded Mandalorian armor as sacrosanct and was visibly disturbed when Ezra questioned why Mandalorians did not use another material besides beskar. Alrich convinced his wife Ursa to rest and recover during the planning for a strike operation to destroy the \"Duchess.\"\nHe was a proud Mandalorian. He loved and cared for his family. Unlike Ursa, who was cold and strict, he was more nurturing and warm. Alrich did not consider himself to be the artistic parent, but nonetheless was able to recognize the evolution of Sabine's personal artistic aesthetic, complementing her improved use of line and color after he was rescued and acknowledging the influence of Tojnun and the Pre-Exile Masters.\nAlrich Wren was first mentioned in \"Trials of the Darksaber,\" a third season episode of Star Wars Rebels. He made his first appearance in the show's season four premiere, Star Wars Rebels: Heroes of Mandalore, and was voiced by Cary-Hiroyuki Tagawa.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Krownest",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/House_Vizsla",
  "/wiki/Clan_Wren",
  "/wiki/Mandalorian_resistance",
  "/wiki/Mandalorian",
  "/wiki/Marriage",
  "/wiki/Ursa_Wren",
  "/wiki/Youngling",
  "/wiki/Tristan_Wren",
  "/wiki/Sabine_Wren",
  "/wiki/Artist",
  "/wiki/Imperial_Academy_of_Mandalore",
  "/wiki/Mandalore",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Atollon",
  "/wiki/Mission_to_Mandalore",
  "/wiki/Parent",
  "/wiki/Capital",
  "/wiki/Sundari",
  "/wiki/Death",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Ezra_Bridger",
  "/wiki/Count",
  "/wiki/New_Order",
  "/wiki/Clone_Wars",
  "/wiki/Tarre_Vizsla",
  "/wiki/Statue_of_Tarre_Vizsla",
  "/wiki/Arc_Pulse_Generator",
  "/wiki/Beskar",
  "/wiki/Mandalorian_armor",
  "/wiki/Alliance_to_Restore_the_Republic#Rebellion",
  "/wiki/Governor",
  "/wiki/Gar_Saxon",
  "/wiki/Viceroy",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Imperial_Super_Commando",
  "/wiki/Clan_Saxon",
  "/wiki/2_BBY",
  "/wiki/Spectres",
  "/wiki/Kanan_Jarrus",
  "/wiki/Mandalorian_Protectors",
  "/wiki/Fenn_Rau",
  "/wiki/Lightsaber_combat",
  "/wiki/Mandalorian_Civil_War_(Imperial_Era)",
  "/wiki/Mandalore_prison_outpost",
  "/wiki/Tiber_Saxon",
  "/wiki/Lord",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Nite_Owls",
  "/wiki/K79-S80_Imperial_Troop_Transport",
  "/wiki/Speeder_bike",
  "/wiki/Jetpack",
  "/wiki/The_Force",
  "/wiki/Force_jump",
  "/wiki/Starship",
  "/wiki/Blaster",
  "/wiki/Tiber_Saxon%27s_Star_Destroyer",
  "/wiki/Darksaber",
  "/wiki/Tojnun",
  "/wiki/Pre-Exile_Masters",
  "/wiki/Trials_of_the_Darksaber",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels:_Heroes_of_Mandalore",
  "/wiki/Cary-Hiroyuki_Tagawa",
  "/wiki/Legacy_of_Mandalore",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Art_History",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Rebels:_Complete_Season_Three",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Databank_A-Z",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Alrich_Wren"
 ]
}