{
 "name": "Altaca",
 "display_name": "Altaca",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Altaca was a Human male nobleman of the planet Alderaan who lived during the Cold War.\nIn 3643 BBY, he was captured by the resurgent Sith Empire and was mistakenly sold into slavery instead of ransomed as nobles usually were. He and his fellow slaves were building the Unfinished colossus when he was rescued and taken prisoner by Lady Dak-Ah. He was convinced by the Imperial that he had no way offworld and that his family would forget about him. Opposites attract and the pair fell in love, though Dak-Ah told him to pretend that he's her brother in public. His family attempted to recover him alive by placing a bounty on him as part of the Great Hunt.\nHis datapad was recovered by a participant of this competition who followed his traces to the Nexus Room Cantina. The bounty hunter encountered Altaca and Lady Dak-Ah together. When confronted, the hunter revealed that Altaca's family wanted him back. This caused Altaca to become upset at Dak-Ah's deception. After Lady Dak-Ah expressed displeasure at the idea of losing Altaca to someone else, she asked the hunter to kill him, explaining that his family would likely pay less for his body, but that she would compensate the rest of the payment.\nThe Hunter refused to make a deal with Lady Dak-Ah and killed her before capturing Altaca.\nThe player has two alternatives in the scenario where they confront Altaca. They can either accept Lady Dak-Ah's deal and kill Altaca instead, or simply take Altaca alive without killing either one.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/3643_BBY",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Slavery/Legends",
  "/wiki/Unfinished_colossus",
  "/wiki/Prisoner/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Dak-Ah",
  "/wiki/Altaca_family",
  "/wiki/Bounty/Legends",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Datapad/Legends",
  "/wiki/Hunter_(individual)",
  "/wiki/Nexus_Room",
  "/wiki/Death/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}