{
 "name": "Altiss",
 "display_name": "Altiss",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Altiss was a female Human Moff of the reconstituted Sith Empire. In 3639 BBY she commanded the Imperial operations on Denova following the defeat of troops led by Colonel Grezor. Altiss requested the presence of the Empire's best forces to handle the situation and defeat Kephess and his Warstalkers, bringing Denova's baradium resources under Imperial control. When Grezor contacted her requesting extraction, she reprimanded him for his failure and opted to terminate him on the spot. After her assault team defeated Kephess and returned to Altiss's ship, they were interrupted by a sudden appearance of the Dread Masters, who revealed themselves to have split from the Empire and brought resurrected Kephess under their control. After the Dread Masters disappeared just as suddenly, Altiss prepared to report the incident up the chain of command.\nMoff Altiss appears in the 2011 BioWare massively-multiplayer online role-playing video game Star Wars: The Old Republic during the \"Explosive Conflict\" operation.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Moff/Legends",
  "/wiki/3639_BBY",
  "/wiki/Denova",
  "/wiki/Colonel/Legends",
  "/wiki/Grezor",
  "/wiki/Kephess",
  "/wiki/Warstalkers/Legends",
  "/wiki/Baradium",
  "/wiki/Dread_Masters",
  "/wiki/2011",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}