{
 "name": "Altuur zok Adon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kubindi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kubaz"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Shroud's syndicate",
      "Eternal Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Altuur zok Adon was a male Kubaz information broker and marksman who left the Shroud's syndicate and offered his services to the the Commander of the Eternal Alliance and Task Force Nova in early 3626 BBY. While Adon was the premier information broker under the Shroud's employ, the Kubaz had disagreements with his superiors and thus parted ways. Altuur zok Adon then decided to assist the Alliance Commander as he was amazed by tales of the Commander's journey. Claiming that no one across a hundred worlds could match his skills, the Kubaz promoted himself as an experienced broker of sensitive intelligence and an superb marksman. When they first met on Odessen, Adon expressed his great pleasure in meeting the Alliance Commander, declaring it to be a profoundly momentous occasion.\nAdon was a Kubaz with pale brown hair who wore brown clothing, a gray belt, and a pair of red goggles. He was a stranger from Kubindi to the wider galaxy.\nAltuur zok Adon was introduced as a companion in the 2021 Update 6.3 of Star Wars: The Old Republic: Onslaught, a digital expansion to the video game Star Wars: The Old Republic. Adon is to be obtainable as a companion by players as a reward for participating in the Galactic Seasons event.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kubindi/Legends",
  "/wiki/Kubaz/Legends",
  "/wiki/Gender/Legends",
  "/wiki/The_Shroud%27s_syndicate",
  "/wiki/Eternal_Alliance",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Sniper/Legends",
  "/wiki/Alliance_Commander",
  "/wiki/Task_Force_Nova",
  "/wiki/3626_BBY",
  "/wiki/The_Shroud",
  "/wiki/Planet/Legends",
  "/wiki/Odessen",
  "/wiki/Color/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Goggles/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/2021",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Standard_week/Legends",
  "/wiki/Galactic_Standard_Calendar"
 ]
}