{
 "name": "Alum_Frost",
 "display_name": "Alum Frost",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Several years before 4 ABY",
      "Yinchorr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Alum Frost was a trainee at the Imperial Royal Guard Academy on Yinchorr who did not pass its final examination.\nLike all prospective Imperial Guardsmen, Alum Frost was already one of the Empire's top soldiers when he was selected for Guard training. Excelling among his peers, he was one of four students to survive the harsh training regimen up until the Emperor's final test. For the last year of his training, he was the companion of Carnor Jax. By aiding and relying on one another in this period, they managed to survive where most others did not, developing a bond as close as that of brothers.\nFrost was, however, unprepared for the final loyalty test and the true price of Guard service. Palpatine summoned the two students and ordered them to fight one another to the death to test their loyalty to him. Without hesitation, Jax struck down his friend with a double-edged vibroblade, killing him.\nHasbro released an action feature multipack based on the final test the prospective Guardsmen had to face. Alum was included in this pack, and was given a removable helmet, thus showing his face for the first time. He is bald with no facial hair.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Yinchorr/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Royal_Guard_Academy",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Carnor_Jax",
  "/wiki/Palpatine/Legends",
  "/wiki/Crimson_Empire_2",
  "/wiki/Crimson_Empire_(audio)",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Legacy_Collection"
 ]
}