{
 "name": "Alyn Rae",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gotal"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Alyn Rae was a male Gotal entrepreneur. Shortly after the end of the Yuuzhan Vong War in 29 ABY, he developed cone socks, a garment designed for Gotals to wear over their head cones. These cones were extra-sensory organs that could detect energy emissions, but their sensitivity rendered Gotals easily susceptible to pain or disorientation while in the presence of droids or other machines that emitted electromagnetic energy. Rae's chemical-based garment, when worn over head cones, filtered out incoming electromagnetic emissions and allowed other transmissions to pass through.\nRae worked with several scientists who were not native to the Gotal homeworld of Antar 4 while designing cone socks, as they were adept at using the equipment that was required to design and construct the garment. Cone socks were expensive and initially only worn by wealthy Gotals, but their practicality saw them grow in popularity and become favored in energy-rich environments by many Gotals throughout the galaxy.\nAlyn Rae was first mentioned in The New Essential Guide to Alien Species, a reference book published in 2006.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Rae_(disambiguation)",
  "/wiki/Gotal/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/29_ABY/Legends",
  "/wiki/Cone_sock",
  "/wiki/Clothing/Legends",
  "/wiki/Cones",
  "/wiki/Droid/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Antar_4/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/2006",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology"
 ]
}