{
 "name": "Alyord_Smythe",
 "display_name": "Alyord Smythe",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 4 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "204th Imperial Fighter Wing",
      "Imperial Navy's officer corps",
      "204th Imperial Fighter Wing"
     ]
    }
   ]
  }
 ],
 "content": "Alyord Smythe was a human TIE fighter pilot and captain in the Galactic Empire's 204th Imperial Fighter Wing. Six months before the Battle of Endor in 4 ABY, Smythe and eleven other TIE pilots took part in the defense of the Trenchenovu shipyards, having been loaned to the Imperial-class Star Destroyer Sanction. Smythe's squadron massacred an attacking squadron of rebel BTL-A4 Y-wing assault starfighter/bombers, with only the rebel pilot Nath Tensent escaping. At some point in the seven months after Trenchenovu, Smythe perished.\nDuring the Galactic Civil War, the human Alyord Smythe served as a TIE fighter pilot with the rank of captain in the Galactic Empire's 204th Imperial Fighter Wing. Six months prior to the Battle of Endor in 4 ABY, Smythe and eleven TIE pilots were loaned to the Imperial-class Star Destroyer Sanction by 204th Colonel Shakara Nuress to defend the Trenchenovu shipyards against an anticipated Rebel Alliance attack.\nWhen the attack came, Smythe's squadron ambushed the attacking squadron of BTL-A4 Y-wing assault starfighter/bombers as it attempted a bombing run on the Trenchenovu shipyards. The rebel bombers were cut off from their initial escape route by the Sanction, and so flew through to the other side of the shipyards. Smythe and the other TIE pilots made chase, killing all of the enemy pilots aside from Nath Tensent, who escaped into hyperspace.\nSmythe, along with the other eleven TIE pilots who had fought at Trenchenovu, perished at some point in the following seven months. Tensent confronted Nuress after those seven months, asking for the names of the pilots who had massacred his squadron so that he could get revenge on them. When the colonel revealed to him that the twelve pilots, including Smythe, were already dead, Tensent fatally shot her instead after she confirmed that she had approved the Smythe's squadron's deployment to Trenchenovu.\nAlyord Smythe was first mentioned in the 2019 novel Alphabet Squadron, the initial installment of the Star Wars: Alphabet Squadron trilogy which was written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/4_ABY",
  "/wiki/Human",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Captain",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Endor",
  "/wiki/TIE_line",
  "/wiki/Pilot",
  "/wiki/Battle_at_Trenchenovu",
  "/wiki/Trenchenovu_shipyards",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Sanction",
  "/wiki/Squadron",
  "/wiki/Death",
  "/wiki/Nath_Tensent%27s_squadron",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Rebel_pilot",
  "/wiki/Nath_Tensent",
  "/wiki/Trenchenovu",
  "/wiki/Galactic_Civil_War",
  "/wiki/Military_rank",
  "/wiki/Colonel",
  "/wiki/Shakara_Nuress",
  "/wiki/Shipyard",
  "/wiki/Bomber",
  "/wiki/Hyperspace",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Star_Wars:_Alphabet_Squadron",
  "/wiki/Alexander_Freed",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Attack_on_Pandem_Nai",
  "/wiki/Endor",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}