{
 "name": "Amanaman",
 "display_name": "Amanaman",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Maridun"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Amani"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow and green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Amanaman was a male Amani headhunter from the planet Maridun who worked as a bounty hunter for the Hutt crime lord Jabba Desilijic Tiure. After the smuggler Han Solo was frozen in carbonite in 3 ABY, Solo's friend Lando Calrissian met with Amanaman in Jabba's Palace on the desert world Tatooine and asked that the Amani alert him if the bounty hunter Boba Fett arrived at the palace, as Fett was tasked with transporting Solo to Jabba. After Solo was delivered and displayed on Jabba's wall, Amanaman stood near the smuggler in 4 ABY and laughed when Jabba declared he did not want to lose his favourite decoration after the Hutt listened to a message from the Jedi Knight Luke Skywalker asking to bargain for Solo's freedom.\nThe headhunter then sat in one of the palace's booths during a performance by the Max Rebo Band which ended in the enslaved dancer Oola being dropped into Jabba's rancor pit and eaten. Princess Leia Organa, another of Solo's allies, then arrived in the throne room disguised as the bounty hunter Boushh and negotiated with Jabba over the bounty on the Wookiee Chewbacca. Later that night, Amanaman was part of a trap set for Organa, and hid behind a curtain while she freed Solo from carbonite. Jabba then revealed the trap and Organa and Solo were captured as Amanaman and others blocked their escape route.\nAmanaman was a mysterious Amani male headhunter from the planet Maridun who worked for the Hutt crime lord Jabba Desilijic Tiure and lived in Jabba's Palace on the desert planet Tatooine. In 3 ABY, the smuggler Han Solo was frozen in carbonite and given to the bounty hunter Boba Fett to bring to Jabba. Solo's friend Lando Calrissian approached Amanaman at the palace and sat with him at a table while asking if the Amani had seen Fett arrive. When Amanaman responded in the negative, Calrissian asked that the headhunter contact him when Fett did arrived before being interrupted by Jabba's majordomo, Bib Fortuna. Before Calrissian left with Fortuna, Amanaman fist bumped him and agreed to contact Calrissian if Fett was spotted.\nFett eventually did successfully deliver Solo to Jabba, who displayed the smuggler on the wall of his throne room frozen in carbonite. In 4 ABY, Amanaman was stood near to the frozen Solo when Jabba declared that he would not be bargaining for the smuggler's freedom after watching a holographic message from the Jedi Knight Luke Skywalker, a friend of Solo's who wished to negotiate his release. Amanaman and others laughed when Jabba refered to the smuggler as \"his favorite decoration.\" The Amani later sat beside the Saurin Gauron Nas Tal in one of the throne room's booths while the Max Rebo Band performed for the court. After they finished a song, Jabba demanded the enslaved dancer Oola repeat her performance, but thinking that the Hutt was speaking to them, the band began playing the song \"Jedi Rocks.\"\nThe Hutt then interrupted the second performance when he dropped Oola into a pit beneath the throne room. Amanaman remained seated while much of the court rushed forward to watch the dancer be devoured by Jabba's pet rancor, Pateesa. Once the ordeal was over, the court's attention was by drawn to the throne room's entry way by the sound of blaster fire, which marked the arrival of Princess Leia Organa with the Wookiee Chewbacca. Organa, who was disguised as the bounty hunter Boushh, used a thermal detonator to negotiate the price of the bounty on Chewbacca with Jabba, scaring much of the court, but causing the Hutt to laugh and offer her a increased price.\nJabba, who had been warned by Fett about Organa's disguise, then set up a trap for her, and had Amanaman and many other court members hide behind a curtain on the stairs leading to the throne room's exit. Later that night, Organa snuck back into the throne room and freed Solo from the carbonite, after which Jabba pulled back the curtains and revealed his trap, with Amanaman, who was stood behind a Gamorrean guard and next to the arms dealer Ephant Mon, and the others blocking Organa and Solo's escape. The pair were captured, but Skywalker arrived the next day to rescue them.\nAfter the Jedi was dropped into the rancor pit and killed the rancor, he was dragged back up to the throne room, where Amanaman was stood at the top of the stairs with Mon. Jabba then sentenced Skywalker, Solo, and Chewbacca to death and left with them aboard his sail barge, the Khetanna, in order to execute them at the Great Pit of Carkoon. However, the prisoners managed to turn the tables at the pit, killing Jabba and destroying his barge before escaping.\nAmanaman was a gangly Amani with cruel red eyes and enormous hands. The front of his body was yellow in color with some green streaks, while the rear was entirely green. As a headhunter, Amanaman never showed mercy to his victims.\nAmanaman was skilled with a variety of traditional weapons and preferred traditional hunting weapons over blasters.\nAmanaman carried a staff with three humanoid skulls attached to the top.\nAmanaman first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The character was portrayed by puppeteer Ailsa Berk, who was credited as a mime artist. A prototype model of the character was made for the film and measured 43 centimeters by 20 centimeters by 64 centimeters. The production crew used the name Amanaman for the character but also nicknamed him \"Banana Slug.\" The puppet included two circular flaps in the neck that could be opened to ventilate the costume.\nThe palace throne room scenes were filmed between January 25 and February 8, 1982 on Stage 8 at Elstree Studios.. The character was first identified as Amanaman in-universe in the new Star Wars canon in the 2015 reference book Star Wars: Absolutely Everything You Need to Know. In the Star Wars Legends continuity, the first in-universe use was on an action figure produced in 1985 by Kenner Products as part of the Star Wars: The Power of the Force toy line.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Amanaman",
  "/wiki/Amanaman/Legends",
  "/wiki/Maridun",
  "/wiki/Amani",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Planet",
  "/wiki/Bounty_hunter",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/3_ABY",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Desert",
  "/wiki/Tatooine",
  "/wiki/Boba_Fett",
  "/wiki/4_ABY",
  "/wiki/Jedi_Knight",
  "/wiki/Luke_Skywalker",
  "/wiki/Max_Rebo_Band",
  "/wiki/Slavery",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Death",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Throne",
  "/wiki/Boushh",
  "/wiki/Bounty",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Standard_day",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Hologram",
  "/wiki/Saurin",
  "/wiki/Gauron_Nas_Tal",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Pateesa",
  "/wiki/Blaster",
  "/wiki/Thermal_detonator",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Gamorrean",
  "/wiki/Arms_dealer",
  "/wiki/Ephant_Mon",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Eye",
  "/wiki/Limb",
  "/wiki/Staff",
  "/wiki/Humanoid",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Ailsa_Berk",
  "/wiki/January_25",
  "/wiki/February_8",
  "/wiki/1982",
  "/wiki/Elstree_Studios",
  "/wiki/In-universe",
  "/wiki/Star_Wars",
  "/wiki/2015",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Legends",
  "/wiki/1985",
  "/wiki/Kenner_Products",
  "/wiki/Star_Wars:_The_Power_of_the_Force_(1985_toy_line)",
  "/wiki/Star_Wars_(2020)_2",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/September_6",
  "/wiki/2019",
  "/wiki/Star_Wars:_Chronicles",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/StarWars.com"
 ]
}