{
 "name": "Amda Wabo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ando"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aqualish"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.67 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "80 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  }
 ],
 "content": "Amda Wabo was a male Aqualish who worked as a weapons designer on the planet Garel during the early years of the Galactic Empire's reign. On one occasion, he negotiated a deal with Empire to sell them a large supply of T-7 ion disruptor rifles, meeting with Imperial Minister Maketh Tua on the planet Lothal. Their negotiation proved difficult, as the two did not share a common language and had to use the protocol droid C-3PO as a translator. This was used by the crew of the starship Ghost to disrupt the deal in an attempt to steal the disruptors, as by removing the pair's translator they were able to provide their own translation services to Tua and Wabo during a trip from Lothal to Garel.\nThe thieves managed to misdirect Tua and the Imperials to the wrong hangar bay in Garel City Spaceport, while they loaded the disruptors onto their own ship. Once Wabo and Tua realized they had been tricked, the Imperials attacked the crew of the Ghost but were unable to prevent them from stealing the weapons, after which Wabo turned on Tua in the belief she had double crossed him.\nThe male Aqualish Amda Wabo was originally a native of the planet Ando, but during the early years of the Galactic Empire's reign worked as a weapons designer on the planet Garel. Around fourteen years after the founding of the Empire—Lothal Year 3272—Wabo acted as a representative of Garel in negotiating a deal to sell a large supply of experimental T-7 ion disruptor rifles to the Imperials, weapons which were illegal under Imperial law. The Aqualish agreed to a one-on-one meeting with Imperial Minister Maketh Tua on the nearby planet of Lothal, where the pair conversed with the aid of the protocol droid C-3PO, who Tua had borrowed from Senator Bail Organa along with the astromech droid R2-D2, in order to act as a translator.\nOnce the meeting was complete, Wabo, Tua and the pair of droids boarded the Star Commuter 2000 shuttle ST-45 in Lothal's Capital City spaceport, which was traveling to Garel, where the weapons would be exchanged. The shuttle was also boarded however, by several members of the starship Ghost who had agreed to steal the disruptors from Wabo and the Imperials for Cikatro Vizago, leader of the criminal Broken Horn Syndicate. During the flight, C1-10P, an astromech member of the Ghost's crew, purposefully began a fight with another crew member, Ezra Bridger, causing all droids including C-3PO to be sent to the rear of the shuttle by the RX-Series pilot droid, R-3X. This left Wabo and Tua without a translator and therefore unable to understand each other, although Wabo kept trying to converse much to Tua's annoyance. Garazeb Orrelios, another Ghost crew member who was seated behind Wabo, then offered the services of his companion Sabine Wren as a translator, which Tua gratefully accepted. When Tua asked Wren to inquire where Wabo had stored the disruptors, the translator purposefully mistranslated the Aqualish's answer that they were in Bay 7 in Garel City Spaceport and told the Imperial minister they were in Bay 17.\nAfter landing on Garel, Wabo, Tua, and the droids rendezvoused with a squad of stormtroopers and, much to Wabo's confusion headed to Bay 17. Upon arrival, the group discovered the bay to be empty at which point Wabo complained and pointed out that they were in the wrong place. With C-3PO present again to translate what the Aqualish was saying, Tua realized what had happened when she recognized C1-10P observing them from nearby and ordered that the Imperials move to Bay 7 to seize the disruptors. Upon reaching Bay 7, Wabo and the Imperials discovered the Ghost's crew loading crates on to their ship, which the Stormtroopers demanded they allowed to be searched. Two members of the crew, Orrelios and Kanan Jarrus then attacked the Imperials and held them off while the rest of the disruptors were loaded. In the confusion R2-D2 and C-3PO also boarded the Ghost in an attempt to catch C1-10P, and were still on board when it took off and fled Garel.\nWithout a translator, Wabo came to believe that the Imperials had double crossed him, and despite Tua's unsuccessful attempts to calm him, drew his heavy blaster pistol on Tua. The crew of the Ghost successfully brought Wabo's weapons to the Broken Horn, who took most of them before Imperial's arrived to disrupt the deal. Vizago then took what weapons he had without paying the Ghost's crew, who destroyed the rest while escaping the Empire.\nAmda Wabo had brown hair, light brown skin, and round black eyes. At the time of his dealings with Maketh Tua and the Galactic Empire he stood 1.67 meters tall and weighed 80 kilograms. Wabo learned to be cautious due to the fact his line of work often required him to meet with dangerous individuals, and when meeting with Tua the Aqualish would of preferred to have been accompanied by guard droids. In order to avoid the Imperial bureaucrat bringing stormtroopers to their meeting however, Wabo agreed to a one on one meeting.\nWhen Wabo came to believe Tua had double crossed him he drew his weapon on her, and had they fought would have been able to defeat as he had more experience with armed combat, preferring to belligerently shove foes in combat. Wabo spoke the Aqualish language, which sounded like the bleating of a nerf, and did not understand Galactic Basic Standard.\nAmda Wabo was created for the Star Wars Rebels television series and was first shown in Star Wars Rebels: Head to Head, a tie-in book written by Pablo Hidalgo and released as part of the build up to the series launch in 2014. The character's first on screen appearance was in \"Droids in Distress,\" the first episode of Star Wars Rebels Season One, in which he was voiced by Steve Blum.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ando",
  "/wiki/Aqualish",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Planet",
  "/wiki/Garel",
  "/wiki/Standard_year",
  "/wiki/Galactic_Empire",
  "/wiki/T-7_ion_disruptor_rifle",
  "/wiki/Maketh_Tua",
  "/wiki/Lothal",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Spectres",
  "/wiki/Starship",
  "/wiki/Ghost",
  "/wiki/Mission_to_steal_Imperial_weapons",
  "/wiki/Garel_City_Spaceport",
  "/wiki/Disruptor",
  "/wiki/Lothal_Calendar",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Droid",
  "/wiki/Star_Commuter_2000",
  "/wiki/Shuttle",
  "/wiki/ST-45",
  "/wiki/Capital_City",
  "/wiki/Capital_City_spaceport",
  "/wiki/Cikatro_Vizago",
  "/wiki/Broken_Horn_Syndicate",
  "/wiki/C1-10P",
  "/wiki/Ezra_Bridger",
  "/wiki/RX-Series_pilot_droid",
  "/wiki/R-3X",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Sabine_Wren",
  "/wiki/Stormtrooper",
  "/wiki/Kanan_Jarrus",
  "/wiki/Heavy_blaster_pistol",
  "/wiki/Eye",
  "/wiki/Aqualish_(language)",
  "/wiki/Nerf",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels:_Head_to_Head",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2014",
  "/wiki/Droids_in_Distress",
  "/wiki/Star_Wars_Rebels_Season_One",
  "/wiki/Steve_Blum",
  "/wiki/Droids_in_Distress_(book)",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Mission_to_Mos_Eisley_(episode)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Rebels:_Visual_Guide:_Epic_Battles",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_91",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide"
 ]
}