{
 "name": "Ames Uravan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Christophsis"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Eadu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Around 1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Kyber crystal research team",
      "Kyber crystal research team"
     ]
    }
   ]
  }
 ],
 "content": "Ames Uravan was a human male scientist and engineer from the Outer Rim planet Christophsis. A pioneer in the kyber crystal research field, Uravan was forcibly conscripted into the Imperial service around 19 BBY. During that time, he was assigned to the kyber crystal research team division of the Tarkin Initiative, which was stationed at the Eadu Energy Conversion Laboratory on the mountainous Outer Rim planet Eadu. Under the leadership of the crystallographer Galen Erso, Uravan and his colleagues worked to turn kyber crystals into a viable energy source for the Death Star's superlaser, giving it the capability to destroy entire planets. Uravan's duties on Eadu included synthetically fusing together kyber crystal fragments imported from the Mid Rim moon Jedha.\nIn 0 BBY, Imperial Director Orson Krennic found evidence that a member of Uravan's research team had conspired with a cargo pilot to send a message to the Rebel Alliance about the Death Star project. Krennic brought death troopers to confront Uravan and his colleagues, instructing the traitor to expose himself. Despite Erso admitting to the betrayal, Krennic proceeded to have the troopers execute Uravan and the rest of his research team.\nA native of the Outer Rim Territories planet Christophsis, Ames Uravan was a gifted scientist and engineer who was a pioneer in the field of kyber crystal research. He was forcibly conscripted into the service of the Galactic Empire around 19 BBY to serve as a specialist on the kyber crystal research team, a division of the Tarkin Initiative managed by Director Orson Krennic. Identification records of the scientists working for Krennic, including Uravan, were deleted from public databases upon their admittance to Imperial service.\nUravan and his colleagues were stationed in the Outer Rim planet Eadu's Energy Conversion Laboratory, where they were kept secluded in laboratories hidden by the world's mountainous terrain. The scientists worked to make kyber crystals a viable energy source for the superlaser of the Death Star, a Geonosian-designed battle station that would, with the superlaser, possess the capability to destroy entire planets. While on Eadu, Uravan's duties included overseeing the shipments of kyber crystal fragments from the Mid Rim moon Jedha. Using a phase-shifting grafting technique, he fused the fragments together synthetically, taking care to preserve their delicate qualities. The kyber crystal research team's day-to-day needs on Eadu were managed by Sirro Argonne, its operations manager.\nBy 13 BBY, work on the superlaser had stalled, prompting Krennic to abduct his former colleague, the crystallographer Galen Erso, and bring him into Imperial service. Erso's extraordinary intellect managed to revitalize the division's progress, and Uravan and his team were able to complete the Death Star's superlaser after several years under his leadership. By the time of his death, Uravan held the title of doctor.\nIn 0 BBY, Grand Moff Wilhuff Tarkin informed Director Krennic that a rebel sympathizer within Erso's research team had conspired with a cargo pilot to deliver a message to the Rebel Alliance concerning the Death Star. Krennic traveled to Eadu with a group of death troopers to investigate, informing the laboratory's workers, including Uravan, of his shuttle's impending arrival. Stormtroopers ushered the scientists out of the laboratories to near the entrance of Krennic's shuttle. The director then assembled his death trooper unit around the scientists, recalling them each by name, including Uravan.\nKrennic announced his knowledge of the conspiracy against the Empire and instructed the traitor to expose himself. The director received no response in the moments afterward and concluded that the scientists had conspired in a group effort. As Krennic's death troopers readied themselves to execute the scientists, Erso intervened and confessed to being the traitor in an attempt to save his team. However, as soon as Erso stepped out of the way, Uravan and his colleagues were shot and killed by the death troopers per Krennic's orders.\nUravan's work contributed to the completion of the Death Star project, though the space station was destroyed soon after his death when the Rebel Alliance targeted a faulty thermal exhaust port that Erso had deliberately planted inside.\nAmes Uravan's forced conscription into Imperial service resulted in the passion for his crystal-centered endeavors to weaken. The time spent in the kyber crystal research team's laboratories on Eadu left him frail and unused to the outdoors by the time of his death. Though Uravan and Krennic were acquaintances, the director felt no particular fondness toward him. Uravan was terrified at the prospect of death when confronted by Krennic's death troopers and was relieved when Erso stepped in to save his team, though it proved a futile gesture. Uravan was a human male who had light skin, brown eyes, and brown hair. He was around 1.83 meters tall.\nAs a member of the kyber crystal research team, Uravan wore a blue-and-white, long-sleeved engineering jumpsuit. The jumpsuit's antiseptic coveralls sported the dark-gray insignia of the Empire on the left sleeve. The fractured kyber-crystal–inspired logo of the Tarkin Initiative was present on the chest of Uravan's coveralls.\nHis uniform included a tunic that would change colors when in the presence of dangerous radiation and shoes that were grounded against potential static charges present within laboratories. His jumpsuit included a chest pocket that held two code cylinders programmed with access to restricted areas.\nAmes Uravan first appeared in the 2016 Anthology film, Rogue One: A Star Wars Story, in which he was portrayed by Robert Benedetti-Hall. Though the film's credits refer to him as \"Engineer,\" Uravan's name was revealed in Star Wars: Rogue One: The Ultimate Visual Guide, a reference book written by Pablo Hidalgo and released on the same day as the film.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Christophsis",
  "/wiki/0_BBY",
  "/wiki/Eadu",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Kyber_crystal_research_team",
  "/wiki/File:KrennicErsoEadu.ogg",
  "/wiki/Scientist",
  "/wiki/Engineer",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Kyber_crystal",
  "/wiki/19_BBY",
  "/wiki/Time",
  "/wiki/Tarkin_Initiative",
  "/wiki/Eadu_Energy_Conversion_Laboratory",
  "/wiki/Mountain",
  "/wiki/Crystallography",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Project_Stardust",
  "/wiki/Crystal",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Mk_I_Superlaser",
  "/wiki/Kyber_crystal_container",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/Director",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Treason",
  "/wiki/Bodhi_Rook",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Death_Star",
  "/wiki/Death_trooper",
  "/wiki/Trooper",
  "/wiki/Death",
  "/wiki/Homeworld",
  "/wiki/Laboratory",
  "/wiki/Geonosian",
  "/wiki/Battle_station",
  "/wiki/Superlaser",
  "/wiki/Standard_day",
  "/wiki/Sirro_Argonne",
  "/wiki/13_BBY",
  "/wiki/Capture_of_Galen_Erso",
  "/wiki/Standard_year",
  "/wiki/Doctor",
  "/wiki/File:KrennicScientistsEadu.ogg",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Krennic%27s_guard_squadron",
  "/wiki/ST_149",
  "/wiki/Stormtrooper",
  "/wiki/Delta-class_T-3c_shuttle",
  "/wiki/Space_station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Antiseptic_coveralls",
  "/wiki/Imperial_crest",
  "/wiki/Radiation",
  "/wiki/Code_cylinder",
  "/wiki/Programmer",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Robert_Benedetti-Hall",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Category:Images_of_Ames_Uravan",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_3",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Rogue_One:_A_Star_Wars_Story_-_The_Official_Collector%27s_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2017_Topps_Star_Wars:_Rogue_One_Series_2",
  "/wiki/Star_Wars:_Rogue_One:_Death_Star_Deluxe_Book_and_3D_Wood_Model",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_False_Economies_of_Scale",
  "/wiki/Star_Wars_Insider_192",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Geonosis_and_Other_Outer_Rim_Planets",
  "/wiki/The_Birth_of_the_Rebellion",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Lah%27mu",
  "/wiki/StarWars.com"
 ]
}