{
 "name": "Amie_Antin",
 "display_name": "Amie Antin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bellassa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White-blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Eleven"
     ]
    }
   ]
  }
 ],
 "content": "Amie Antin was a female Human who lived on Bellassa as a doctor during the first few years of the Empire's existence. She was also the mother of Adem Antin.\nAmie met Jedi Master Obi-Wan Kenobi when he was searching for her patient, Roan Lands. She helped him hide from the Inquisitor Malorum, and then revealed to him that she was a secret member of the rebel organization The Eleven. She helped Kenobi and Lands escape her hospital and reach a base of The Eleven.\nAfter Lands and Dona Telamark, members of the Eleven, were arrested on charges of conspiracy against the government of Bellassa, Amie and Wil Asani met with Solace, Oryon and Trever Flume and aided them in rescuing Lands and Telamark from captivity. However, their plan was interrupted by stormtroopers that raided the hidden base. As they moved through a tunnel, Amie and Asani took Flume, Solace and Oryon to a landing platform in order to escape the planet.\nLater, Antin accompanied Olin and Lands on a mission to infiltrate the offices of Wilhuff Tarkin in the city of Ussa. However, their plan failed when they confronted Darth Vader. After watching Lands die from Vader's wrath, Antin was arrested while Olin escaped the trap. Olin went to warn the other members of the Eleven, Anton was scheduled to be sent to a penal colony until she was rescued by Solace and Ry-Gaul. While the Jedi attacked stormtroopers, Antin escaped with Clive Flax to the lakeside and disguised herself as a priestess in order to avoid detection. Back in the safety house, Amie was able to treat Flume after he was badly injured during a fight against stormtroopers.\nAfter the rescue, she aided Olin by going through medical records from the EmPal SuRecon Center to discover Vader's true identity. Antin was able to analyze the data and came to the conclusion that the Vader had suffered severe burns and a high metal contamination from volcanic eruptions. During her search, Antin received help from Oryon, and discovered that Vader was on Mustafar, the place where he fought against his former master, Kenobi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bellassa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/The_Eleven",
  "/wiki/Doctor/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Adem_Antin",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Roan_Lands",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Malorum",
  "/wiki/Medcenter/Legends",
  "/wiki/Dona_Telamark",
  "/wiki/Wil_Asani",
  "/wiki/Fy-Tor-Ana",
  "/wiki/Oryon",
  "/wiki/Trever_Flume",
  "/wiki/Planet/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Ussa",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Ry-Gaul",
  "/wiki/Jedi/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Clive_Flax",
  "/wiki/Emperor_Palpatine_Surgical_Reconstruction_Center",
  "/wiki/Mustafar/Legends",
  "/wiki/The_Last_of_the_Jedi:_The_Desperate_Mission",
  "/wiki/The_Last_of_the_Jedi:_A_Tangled_Web",
  "/wiki/The_Last_of_the_Jedi:_Return_of_the_Dark_Side",
  "/wiki/The_Last_of_the_Jedi:_Secret_Weapon",
  "/wiki/The_Last_of_the_Jedi:_Against_the_Empire",
  "/wiki/The_Last_of_the_Jedi:_Master_of_Deception",
  "/wiki/The_Last_of_the_Jedi:_Reckoning",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}