{
 "name": "Ammon",
 "display_name": "Ammon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ammon was a male Human Jedi Initiate enrolled in the Coruscant Jedi Temple's academy during the final decade of the Galactic Republic.\nA Human male, Ammon was identified as Force-sensitive and given over to the Jedi Order for training in the ways of the Force. Assigned to an Initiate Clan, Ammon was a cautious and somewhat clumsy boy, with a strong regard for the Jedi Code.\nWhen the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Ammon and a group of fellow students, including Cryle and Tryla, accompanied Jedi Knight Anakin Skywalker on a training mission to a jungle planet. There, Ammon was constantly harassed by Cryle before the older boy was admonished for this by Skywalker. When Skywalker was knocked out by a local beast, the Jedi younglings realized they needed to take him back to the ship. Cryle picked up Skywalker's lightsaber, and Ammon warned him that it was dangerous. The younglings built a litter for Skywalker and dragged him back through the forest. They dropped the older Knight and stopped to rest. The beast then confronted them, and Cryle tried to stop it with his lightsaber. The older boy then dropped it and ran up a tree. Ammon then noticed a thorn in its leg. It calmed down and licked him. Later, aboard their ship, Skywalker was recovering, and congratulated Cryle. The latter pointed out that it was Ammon who did it, and he responds that it was a team effort, because it they were Jedi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ammon_IV",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_academy",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Initiate_Clan/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Cryle",
  "/wiki/Tryla_(Jedi_Initiate)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Mission_to_unidentified_planet_(Younglings)",
  "/wiki/Unidentified_planet_(Younglings)",
  "/wiki/Younglings_(comic)",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.25"
 ]
}