{
 "name": "An%27ya_Kuro",
 "display_name": "An'ya Kuro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 1–0 BBY",
      "Cophrigin V"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "later silver"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Jon Antilles",
      "Aurra Sing",
      "Ki-Adi-Mundi",
      "A'Sharad Hett"
     ]
    }
   ]
  }
 ],
 "content": "An'ya Kuro was a Human female who gave up her name in service of the Force and became the Dark Woman. A mysterious yet respected Master of the Jedi Order during the Clone Wars, the Dark Woman trained several Force-sensitives of later prominence in the Jedi arts. However, it was her failure to successfully train a female student named Aurra Sing—who later earned a reputation as a notorious slayer of Jedi—that caused the Dark Woman to enter a self-imposed exile on the planet Cophrigin V.\nThe Dark Woman later returned to the Jedi Order in accordance with the will of the Force to participate in the Clone Wars as a spy. During the onset of the Great Jedi Purge, Kuro went into hiding until she was discovered and struck down by Darth Vader.\nA Force-sensitive Human, An'ya Kuro was trained in the ways of the Force by the Jedi Order, attaining the rank of Jedi Knight and constructing a purple-bladed lightsaber. Showing much devotion to the Force and the Jedi Code, Kuro gone extreme on the teaching of attachments, shedding her own name and taking up the moniker the Dark Woman and said to be uncomfortable with connections with others. During her time as a Knight, Kuro began to travel the galaxy to find Force-sensitive children that the Republic's screening process might have missed. In concert with the Order's Acquisition Division, one of Kuro's early successes was the discovery of a young Ki-Adi-Mundi on Cerea.\nWhile Kuro was negotiating with the child's father in the family farm, a gang of raiders came to steal the harvest of the household. Ki-Adi-Mundi was immediately hidden because of the special status of boys on Cerea—the birth rate for female Cereans to males was twenty-to-one, and raiders would steal young boys to raise as their own. At first, the Dark Woman wished to fight the gang, but the boy's father asked her not to intervene. Indeed, even if the raiders were defeated on the spot, they would probably come back for revenge after the departure of the Jedi. Knowing all of that, Kuro put her lightsaber back and witnessed the raid. Following this new violent experience, Ki-Adi-Mundi's father consented to let his son go. The Dark Woman was urged to take the child with her before the patriarch could change his mind. Returning to Coruscant with the Cerean child, Kuro convinced the Jedi High Council to allow Ki-Adi-Mundi to begin training despite being older than most accepted Jedi Initiates. When he was old enough, the High Council chose to assign Ki-Adi-Mundi to Master Yoda for his Jedi training, lest an emotional relationship develop between Kuro and the young Cerean.\nKuro utilized unconventionally harsh training methods which were nonetheless effective, and the High Council often assigned difficult trainees to her. These methods often produced strong Jedi that inherited a hint of Kuro's darkness, as visible in her former Padawan Jon Antilles. However, the harsh training conditions she imposed on her students sometimes led to failure. Circa 51 BBY, Kuro discovered a Force-sensitive baby in the slums of Nar Shaddaa. Kuro brought the child to Coruscant to receive training. There, the child took the name Aurra Sing. Sing showed aggressive tendencies that led the Council to assign her to Kuro as a \"problem case.\" Their efforts were in vain, however, and by age nine, Sing had still not attained the level of Padawan. While at Kuro's training ground on Ord Namurt in 44 BBY, Sing was kidnapped by space pirates who convinced the young Jedi that she was sold off by her master. Sing, who had never been close to Kuro, believed the lie. Thus began a lifelong grudge against the Jedi.\nDemoralized by the loss of Sing, Kuro retreated to Cophrigin V to meditate on her role as a Jedi, her training techniques, and the future. In 32 BBY, after twelve years of solitude, Kuro returned to Coruscant just as Ki-Adi-Mundi, now a famed Jedi Knight, was preparing for a mission to Tatooine. Before his departure, Kuro warned her former Padawan to take considerable care on Tatooine, as she had foreseen a great darkness approaching in her dreams.\nKuro later sparred with Ki-Adi-Mundi's new Padawan A'Sharad Hett in a training room at the Jedi Temple. Hett would not continue his training until he received a lesson from Kuro. The Dark Woman attacked Hett fiercely with her lightsaber and her own words, trying to enrage him. Hett stayed in control, phrasing passages from the Jedi Code and passed his test according to Kuro.\nTwo years thereafter, the assassination of two Jedi verified the rumors of Sing's return as a Jedi-hunting assassin and bounty hunter. Kuro requested that the Jedi Council place her in charge of the hunt for her former Padawan, but she was denied on the grounds of her connection to Sing. Instead, Ki-Adi-Mundi, A'Sharad Hett, and Adi Gallia were dispatched to track Sing and bring her to justice.\nKuro returned to Cophrigin V, unaware that Sing had been hired to assassinate her. The Jedi task force converged on Kuro's retreat just as Sing prepared to strike. Hett engaged Sing in battle and subdued the bounty hunter, but was forced to tap into his anger to ensure victory. Discouraged by the darkness he had seen in himself, Hett wished to give up on his Jedi training until Kuro offered to train him to control his anger. As the Jedi prepared to depart with Sing in tow, a meteor shower struck their landing site, forcing a hasty departure leaving the assassin behind.\nKuro accompanied Master Windu to Geonosis where she aided in the starfighter battle against Captain Cavik Toth under the command of Adi Gallia. During the Clone Wars, Kuro chose to aid the Republic as a spy rather than a general. Together with Tholme and Aayla Secura, Kuro infiltrated Devaron to verify rumors of a Separatist base.\nDuring their mission, Kuro was observed by Sing, who was on the planet to assassinate the Devaronian senator. Sing sprung a trap that pinned Tholme and Kuro under cavern rocks, but the young Secura was able to subdue Sing. The injured Jedi Masters recovered with bacta treatments and returned to Coruscant.\nWith the onset of the Great Jedi Purge and the establishment of the Galactic Empire, Kuro sought safety on Cophrigin V, where she built a great garden and lived as a hermit. When Kuro's hiding place was discovered by Mara Jade, an Emperor's Hand and one of Palpatine's personal assassins, Darth Vader arrived to personally kill the maverick Jedi Master. After a brief discussion concerning extinction and evolution, Kuro told Vader that she already accepted her fate, but nonetheless put up a fight.\nEventually during their duel, Vader brought down a huge tree on top of Kuro, trapping her. With a slash of his lightsaber, he ended her life. She merged with the Force and told him he still had the power left in him to become Anakin again. Enraged, Vader tried to strike her Force ghost with his blade, but Kuro's presence simply disappeared into the light of the Force.\nAn'ya Kuro was an unorthodox and mysterious Jedi Master. She believed strongly in the Jedi philosophy of humility, so strongly that she abandoned her own name and adopted the name Dark Woman. Kuro was well known for training difficult or troubled Padawans such as Aurra Sing and A'Sharad Hett. However, her teaching methods were brutal and, to some, disturbing. Her teaching methods most likely contributed to Aurra Sing's hatred of the Jedi Master.\nThough Kuro displayed some dark traits, such as her brutal training methods, she was still able to become a Force ghost after her death, indicating that, underneath her mysterious, unorthodox and at times brutal exterior, she was devoted to the light side of the Force. Kuro also believed that Darth Vader still had enough good in him to turn away from the dark side and her Force ghost even referred to him as Anakin, the name of the man he had once been.\nAn'ya Kuro was a very powerful Jedi and was known to possess many Force powers uncommon among the Jedi, such as the ability to control plant matter, and bend light around her to render herself invisible. She even appeared to be able to pass through solid objects. She also possessed the ability to use the Force to teleport. During the hunt for Aurra Sing, Kuro had additionally shown to possess an incredible talent for Force healing, being able to casually heal a misfired blaster wound almost instantly. After her death, Kuro appeared before Darth Vader as a Force ghost.\nHer lightsaber was particularly ornate, with an organic style to it, modified or perhaps built with artificial plant vines wrapping around it. Though emitting a purple blade throughout most of her career as a Jedi, Kuro briefly wielded a blue-bladed weapon during the Clone Wars before returning to her original lightsaber after the war. She proved capable of holding her own against Darth Vader in a lightsaber duel, despite her advanced age. She utilized several acrobatic maneuvers during the duel, which suggested she was possibly a practitioner of Ataru. Like Grand Master Yoda, her old age did not seem to limit her speed and dexterity, and at one point she even disarmed the Sith Lord, something very few other Jedi had been able to do. However, she had to ambush him to accomplish this. Kuro was also proficient in the use of Jar'Kai.\nThe Dark Woman was created by Jan Strnad as an incidental character for Star Wars: Republic: Vow of Justice.\nThe Dark Woman also appears as an action figure in a set including A'Sharad Hett and a comic book depicting the hunt for Aurra Sing. The comic Jedi: Aayla Secura depicts her lightsaber with a blue blade instead of her typical purple.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Anya",
  "/wiki/1_BBY/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Cophrigin_V",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jon_Antilles",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Lekket",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_hunter/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Acquisition_Division/Legends",
  "/wiki/Cerea/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/51_BBY/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ord_Namurt",
  "/wiki/44_BBY/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Duel_on_Coruscant_(30_BBY)",
  "/wiki/Hunt_for_Aurra_Sing",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Cavik_Toth",
  "/wiki/Tholme/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Devaron/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Devaronian/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Duel_on_Cophrigin_V",
  "/wiki/Force_ghost",
  "/wiki/Even_Piell/Legends",
  "/wiki/Plant_Surge",
  "/wiki/Force_cloak",
  "/wiki/Phase",
  "/wiki/Teleport",
  "/wiki/Force_healing/Legends",
  "/wiki/Form_IV/Legends",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Jan_Strnad",
  "/wiki/Star_Wars:_Republic:_Vow_of_Justice",
  "/wiki/Jedi:_Aayla_Secura",
  "/wiki/Aurra%27s_Song",
  "/wiki/Star_Wars_(1998)_8",
  "/wiki/Star_Wars_(1998)_9",
  "/wiki/Star_Wars_(1998)_12",
  "/wiki/Star_Wars_(1998)_13",
  "/wiki/Star_Wars:_Republic:_The_Hunt_for_Aurra_Sing",
  "/wiki/Star_Wars:_Jedi_Starfighter",
  "/wiki/Republic_53",
  "/wiki/Republic_59",
  "/wiki/Coruscant_Nights_II:_Street_of_Shadows",
  "/wiki/Extinction",
  "/wiki/Empire_27",
  "/wiki/Category:Images_of_An%27ya_Kuro",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Collector_8",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_Power_of_the_Jedi",
  "/wiki/Aurra_Sing:_Dawn_of_the_Bounty_Hunters",
  "/wiki/Star_Wars_Insider",
  "/wiki/Shining_Stars",
  "/wiki/Star_Wars_Insider_52",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_131",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/The_Phantom_Menace_(TCG)",
  "/wiki/Wizards.com",
  "/wiki/Star_Wars_Unleashed",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_The_Saga_Collection",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Special_Edition",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Threats_of_the_Galaxy",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Clone_Wars_Campaign_Guide",
  "/wiki/Star_Wars_Miniatures:_Jedi_Academy",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2010_Topps_Star_Wars_Galaxy_Series_5",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Republic:_Outlander",
  "/wiki/Star_Wars_(1998)_29",
  "/wiki/Star_Wars:_Republic:_Emissaries_to_Malastare",
  "/wiki/Star_Wars_(1998)_31",
  "/wiki/February_17",
  "/wiki/2001"
 ]
}