{
 "name": "Ana Tathis",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Masters",
     "values": [
      "Caryn"
     ]
    }
   ]
  }
 ],
 "content": "Ana Tathis was a female Human Jedi trained as the Padawan of Lady Caryn at some point during the reign of the Galactic Empire. After Caryn taught Tathis all she could, she disappeared, leaving Tathis on her own.\nDuring the reign of the Galactic Empire, Ana Tathis lived on a planet where a local woman named Lady Caryn was a favorite storyteller of her village's children. When Tathis was of sixteen or seventeen years, Caryn approached her and told the girl that she had sensed her in the Force. Caryn told Tathis that her presence in the Force was a strong one and that she wished for Tathis to become her apprentice.\nTathis eagerly took to Caryn's training, and labored in her master's tropical gardens, making them lush with beauty. Through her physical labors, Tathis learned focus and concentration. Over the course of three years, Tathis learned the skills of controlling her body, Force healing, seeking out knowledge and farseeing. Though Tathis became quite skilled, she was never able to read Caryn's mind. After a time, Caryn felt that she had taught Tathis all she was able, and bid her farewell.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gender/Legends",
  "/wiki/Human/Legends",
  "/wiki/Ana",
  "/wiki/Caryn_(Jedi)",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Force_sense/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Farsight/Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game,_Second_Edition,_Revised_and_Expanded"
 ]
}