{
 "name": "Andor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Themian"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Themian Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Andor was a Themian who served as an admiral in the Themian Fleet during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. During the Republic's mission to the planet Themis, Andor ordered the Themian Fleet to destroy the starfighter of Jedi Master Obi-Wan Kenobi and reported it to Themis's Prince Lumon.\nDuring the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, the Themian Andor served as an admiral in the Themian Fleet. During the Republic's mission to the planet Themis to negotiate rights to its moon's mines of explosive ore, the Separatist Duchess Thax sabotaged Jedi Master Obi-Wan Kenobi's starfighter with a droid planted by her agent in an attempt to discredit the Republic in the negotiations. As his fighter approached the moon, Kenobi contacted Andor, who answered that they would not hesitate to destroy the fighter as ordered by Themis's Prince Lumon. Believing he was not making himself clear, Kenobi requested Andor to destroy his ship precisely on time, to the officer's surprise. As the fleet opened fire on his starfighter, Kenobi timed the ejector seat and escaped the destruction.\nAndor informed Lumon that the fleet had destroyed Kenobi's fighter. Meanwhile, Kenobi presented Lumon evidence of Thax's treachery: a scrap of the droid that had sabotaged his vessel. After Thax threatened to kill him and was disarmed, Lumon decided Themis would join the Republic.\nAndor had brown skin, and brown hair. The admiral was a loyal officer who carried out their orders.\nAndor wore a dark blue and maroon uniform, including dark blue boots.\nAndor appeared in the 2011 comic strip \"Runaway Starfighter,\" written by Mike W. Barr, pencilled by Andres Ponce, and published in the comic Star Wars: The Clone Wars Comic UK 6.24.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Andor_(television_series)",
  "/wiki/Andor_(disambiguation)",
  "/wiki/Themian",
  "/wiki/Color/Legends",
  "/wiki/Themian_Fleet",
  "/wiki/Admiral/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Mission_to_Themis",
  "/wiki/Planet/Legends",
  "/wiki/Themis",
  "/wiki/Obi-Wan_Kenobi%27s_Delta-7B_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Lumon",
  "/wiki/File:Mission_to_Themis.jpg",
  "/wiki/Themis_moon",
  "/wiki/Themis_moon_mining_base",
  "/wiki/Ore/Legends",
  "/wiki/Duke/Legends",
  "/wiki/Thax",
  "/wiki/Thax%27s_sabotage_droid",
  "/wiki/Gender/Legends",
  "/wiki/Thax%27s_agent",
  "/wiki/Starfighter/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Time/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Ejector_seat/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Boot/Legends",
  "/wiki/2011",
  "/wiki/Runaway_Starfighter",
  "/wiki/Mike_W._Barr",
  "/wiki/Andres_Ponce",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.24"
 ]
}