{
 "name": "Andor_Vex",
 "display_name": "Andor Vex",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "prior to 3956 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Andor Vex was a male Human Jedi who served in the Jedi Order and a good friend of Jolee Bindo.\nThe Force was said to have \"swirled around him like a hurricane,\" prompting many other Jedi to believe that a great destiny awaited him; a mythos of perceived infallibility in which, unfortunately, Andor himself soon began to believe.\nDuring one particular trip, Andor and Jolee were captured by Dimean raiders led by a politically strong warlord named Kraat. Upon being hauled on the bridge of their ship, Andor's arrogance took over. He began demanding their freedom, lording his supposedly enormous \"reputation\" over all of the Dimeans. Kraat crushed his neck to which Jolee and Andor agreed that he'd stop talking . Kraat grabbed him by the throat and tossed him down the nearest reactor shaft. However, the interaction of Andor's corpse with the reactor's energy controls set off a chain reaction, destroying the Dimean forces and killing Kraat. Jolee was barely able to make it off their ship alive.\nThus, Andor Vex's \"great destiny\" did meet up with him, although not in a way he or anyone else would have ever predicted. This incident \"changed the political course of the entire sector for centuries to come.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Andor_(disambiguation)",
  "/wiki/3956_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jolee_Bindo",
  "/wiki/Jedi/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Dimean",
  "/wiki/Warlord/Legends",
  "/wiki/Kraat",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}