{
 "name": "Andrephan_Stormcaller",
 "display_name": "Andrephan Stormcaller",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Entralla"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the RepublicAlliance Special ForcesTask Force on Alliance Security",
      "Alliance Special Forces",
      "Task Force on Alliance Security",
      "New RepublicRed Moons",
      "Red Moons"
     ]
    }
   ]
  }
 ],
 "content": "Andrephan Stormcaller was a Rebel Alliance officer.\nA light-eyed Human from Entralla, Stormcaller was a tactical expert and a veteran of many conflicts. He lied about his age and joined the military at age 15. He served in multiple conflicts and was eventually commissioned by the Delephran militia to train their commanders and assist with eliminating piracy along the Vexta Belt. The Imperial military absorbed the militia and Stormcaller was forced to serve. He spent three years at the Imperial Academy before deciding to defect to the Rebel Alliance.\nAlongside Airen Cracken, he was responsible for the development of SpecForces units used by the Alliance. He also developed the SpecForces Infiltrator units, even serving in one of them for a time.\nIn 2 ABY, while his brown hair was going gray, Stormcaller was a member of the Task Force on Alliance Security. He wrote reports on the Guiteica Militia, explaining that their equipment was far too outdated to be a real threat to the Alliance. He was also surprised that Militia leader Quaal Tavier Catharius, a strong Republic-hater, would use so many Republic-designed machines.\nDuring the New Republic, Stormcaller became disillusioned because the government did not want to help his native planet after it was taken by the Pentastar Alignment. He decided to desert his service to the New Republic and create his own mercenary unit, the Red Moons.\nAs the leader of the Red Moons, Stormcaller assigned Sully Tigereye to command a rescue operation on the children of the ambassador of Cantras Gola, who had been kidnapped by the Karazak Slavers Cooperative as a means to blackmail the politician. The mission was successful.\nStormcaller was very loyal and charming. He was a brilliant tactician able to plan and execute a variety of missions. He had a habit of smoking Shento cigars.\nStormcaller was an excellent pilot and blaster marksman. He was very knowledgeable in the latest security and detention procedures.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Entralla/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/New_Republic/Legends",
  "/wiki/Red_Moons",
  "/wiki/Colonel/Legends",
  "/wiki/Delephran_militia",
  "/wiki/Piracy_Scouring",
  "/wiki/Pirate/Legends",
  "/wiki/Vexta_Belt",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Infiltrator/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Guiteica_Militia",
  "/wiki/Quaal_Tavier_Catharius",
  "/wiki/Pentastar_Alignment",
  "/wiki/Sully_Tigereye",
  "/wiki/Cantras_Gola",
  "/wiki/Karazak_Slavers_Cooperative",
  "/wiki/Shento_cigar",
  "/wiki/Pilot/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/It%27s_a_Gambler%27s_Life",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/Blaze_of_Glory_(short_story)",
  "/wiki/Star_Wars_Adventure_Journal_8",
  "/wiki/Blasters_for_Hire",
  "/wiki/Star_Wars_Adventure_Journal_3",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Threats_of_the_Galaxy"
 ]
}