{
 "name": "Andrik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald with brown eyebrows"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic Special Forces Division",
      "Republic Special Forces Division",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Andrik was a Human male who served the Galactic Republic until he joined the reconstituted Sith Empire during the Cold War.\nIn 3643 BBY, Captain Andrik and a group of Republic Special Forces Division personnel, following the advice of Harron Tavus, defected to the reconstituted Sith Empire. He salvaged a battle droid named M1-4X and attempted to fully activate him on Nar Shaddaa, using the droid's own command codes to turn him against the Republic.\nHowever, he soon encountered the new Havoc Squad lieutenant, who was tasked with tracking down the traitors. At first trying to order Forex to kill the lieutenant, he attempted to bluff the lieutenant into backing down by saying he was on a top secret mission for Tavus. The lieutenant revealed that they were the CO of Havoc Squad, and Andrik ordered his fellow traitors to kill them while he took Forex. Andrik later contacted a group of Imperial officers, only to find the lieutenant had beaten his team and was now confronting the Imperials. Andrik callously told Major Zardres that they were going to buy him time to power up M1, but his attitude led to Zardres peacefully telling Havoc Squad where he was.\nEventually cornered in Shadow Town, Andrik hypocritically cursed the lieutenant's actions against the traitors, saying a soldier's true loyalty was to their fellow soldiers, but his foe knew Andrik was wrong. Andrik attempted to kill Havoc Squad's lieutenant in the resulting fire fight, but failed.\nAndrik felt that a soldier's true loyalty was to their fellow soldiers, particularly the ones who fought side by side on the battlefield. However he also felt Tavus was right to try to betray the lieutenant on Ord Mantell because the Lieutenant was loyal to the Republic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Captain/Legends",
  "/wiki/Harron_Tavus",
  "/wiki/Battle_droid/Legends",
  "/wiki/M1-4X",
  "/wiki/Droid/Legends",
  "/wiki/Havoc_Squad",
  "/wiki/Lieutenant/Legends",
  "/wiki/Zardres",
  "/wiki/Shadow_Town",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Andrik",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}