{
 "name": "Andrid",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Andrid was a male Human who served as a General in the Galactic Empire, reporting directly to Darth Vader. Andrid was stationed in the Belderone sector and was part of an effort to stop rising Rebel support on the planet Kulthis. In 3 ABY, Andrid was summarily executed by Vader after trying and failing to assassinate several key Rebel leaders without Vader's knowledge.\nA Human male, Andrid served in the Imperial Army and reached the rank of General by 3 ABY. An avowed skeptic of the Sith Lord Darth Vader's Jedi background, Andrid served under Vader as the Empire moved in to tamp down growing Rebel sentiment on Kulthis—Andrid had been tasked with overseeing production of AT-AT walkers on nearby Belderone to use in the coming assault on Kulthis. Warned by Vader that their work was crucial to the future of the war, Andrid decided to go behind the Sith Lord's back when an informant tipped him off that several key Rebel leaders, including Luke Skywalker and Leia Organa, had been spotted on Belderone, instead sending his own assassins to deal with them. When that attempt failed, one of Vader's spies informed Vader of Andrid's subterfuge. Infuriated by Andrid's presumptuousness and ineffectiveness, Vader Force choked the general to death where he sat.\nAlthough a subordinate of Darth Vader, Andrid was bold enough to question Vader's faith in the Force and his Jedi background, even to Vader's face—he often though Vader exaggerated his own importance. Andrid's antipathy towards Vader veered towards actual insubordination in 3 ABY, when he attempted to kill the Rebels without the Sith Lord's knowledge. This directly led to Andrid's death, as Vader lashed out at what he saw as Andrid's stupidity and egotism.\nAndrid appeared in Star Wars Annual  3, written by Mary Jo Duffy, illustrated by Klaus Janson, and released in 1983.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/General/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Belderone_sector/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kulthis",
  "/wiki/Assassin/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Belderone/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Star_Wars_Annual_(1977)_3",
  "/wiki/Mary_Jo_Duffy",
  "/wiki/Klaus_Janson",
  "/wiki/1983",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Magazine_11",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}