{
 "name": "Andrew Woolfson",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1125 BBY",
      "Arrakad"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicAzul brigade",
      "Azul brigade"
     ]
    }
   ]
  }
 ],
 "content": "Andrew Woolfson was a Human male explorer who discovered Sylvia IV and the Sylphe species. It was he who gave them this name.\nAndrew Woolfson led a team sent by the Galactic Republic and explored the Sylenia V system some decades before the Ruusan Reformation. He encountered a native species on Sylvia IV and named them Sylphes.\nThe Galactic Republic named him the head of the Azul brigade, formed from both Human and Sylphe soldiers. He then married a female Sylphe of the unit and had a child, whom they named Layahna.\nIn 1125 BBY, Woolfson was sent with the Azul brigade to Arrakad. The planet was a raider's lair from which attacks were launched against Republic commerce convoys in the Rigel-Hurib sector.\nThe battle was a quick victory for the Republic, but the unit's repatriation was delayed by the lack of fuel. The brigade took five months to arrive on Arrakad, and the metabolism of the Sylphes wasn't adapted to the arid climate of Arrakad. All of them died before the ships arrived. The Human survivors of the brigade deserted or vowed to take revenge, without success. Andrew Woolfson committed suicide on Arrakad to follow his wife, deceased because of the climate.\nAndrew Woolfson was briefly mentioned by Franck Vidal for an ambiguously canon roleplaying scenario which appeared in the French magazine Avalon 2.\nHis name is misspelled \"Woolfsar\" twice in the Azul brigade entry of the article.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/1125_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Sylvia_IV",
  "/wiki/Sylphe",
  "/wiki/Species/Legends",
  "/wiki/Sylenia_V_system",
  "/wiki/Ruusan_Reformation",
  "/wiki/Layahna",
  "/wiki/Planet/Legends",
  "/wiki/Suicide/Legends",
  "/wiki/Franck_Vidal",
  "/wiki/Canon",
  "/wiki/Roleplaying_game",
  "/wiki/Avalon_2",
  "/wiki/La_Veuve_Noire"
 ]
}