{
 "name": "Anetia Kah'ryn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Lavender"
     ]
    }
   ]
  }
 ],
 "content": "Anetia Kah'ryn was a female Twi'lek entertainer who lived on Tatooine during the Galactic Civil War.\nAfter the Battle of Yavin, Anetia Kah'ryn resided in Mos Eisley and worked as an entertainer at the local cantina. In 1 ABY, Kah'ryn was very concerned about criminal and Tusken activity around Mos Eisley. She identified several individuals who might have useful information and were known to frequent the cantinas of Tatooine. Around the same, the Twi'lek started to teach a group of entertainer trainees who had just arrived on Tatooine. Kah'ryn therefore tasked her trainees to establish themselves as performers in the Mos Espa Cantina, in the Anchorhead Tavern and in the Bestine Hotel to get information. Anetia, a performer herself, found that patrons were more willing to divulge information after they have been entertained. The entertainers were very skillful and enjoyed great success among the consumers. Moreover, they convinced three people, Dorn Gestros, Crix Yarrow and Borra Setas, to reveal what they knew about recent criminal and Tusken activity in Mos Eisley. Anetia Kah'ryn later sent the entertainers to a party full of very important people held by Rauk Oenish in Mos Eisley. They discovered that Jabba the Hutt was inciting the Tusken Raiders to attack Mos Eisley in order to pressurize the mayor of Mos Eisley and eventually take control of the city. Anetia Kah'ryn and her trainees revealed their discoveries to Mayor Mikdanyell Guh'rantt. The plot was finally foiled by a group of marksmans led by Purvis Arrison who eliminated the Tusken vanguard unit in Junktown.\nAnetia Kah'ryn was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Anetia Kah'ryn was added to the game with the release of the \"Publish 17\", on May 26, 2005. She was a specialized trainer providing a quest to the beginner players who had chosen a career of \"entertainer\". Anetia Kah'ryn's quest was removed from the game upon the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005,",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Entertainer",
  "/wiki/Tatooine/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Chalmun%27s_Spaceport_Cantina/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Mos_Espa/Legends",
  "/wiki/Anchorhead/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Bestine_Hotel",
  "/wiki/Dorn_Gestros",
  "/wiki/Crix_Yarrow",
  "/wiki/Borra_Setas",
  "/wiki/Rauk_Oenish",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Mayor/Legends",
  "/wiki/Mikdanyell_Guh%27rantt",
  "/wiki/Sniper/Legends",
  "/wiki/Purvis_Arrison",
  "/wiki/Junktown",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/May_26",
  "/wiki/2005",
  "/wiki/November_15",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}