{
 "name": "Anf_Dec",
 "display_name": "Anf Dec",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Colicoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Colicoids"
     ]
    }
   ]
  }
 ],
 "content": "Anf Dec was a male Colicoid and starship captain in the final years of the Galactic Republic, before the Clone Wars.\nFour years before the Battle of Naboo, Dec was the captain of a Colicoid diplomatic ship that was attacked by the slave-raider Krayn, despite the presence of Jedi Master Qui-Gon Jinn and his apprentice Obi-Wan Kenobi.\nAlmost eight years later, Kenobi and his apprentice, Anakin Skywalker, encountered Dec as not only the captain of a diplomatic ship, but also as one of the primary negotiators  among the Colicoids, who wanted to secure from Krayn total control over the spice-processing operations within the Kessel system and at Nar Shaddaa.\nIt was because of the Colicoids' entry into negotiations with Krayn that Dec and the other negotiators were furious with the pirate when, in 29 BBY, he blatantly raided Dec's cargo ship after promising that he would thenceforth refrain from doing so. But it was also the Colicoids' suspicions of Krayn's duplicity that prompted their petitioning the Galactic Senate and Jedi High Council to send \"Jedi diplomats\"  as protectors of Dec's ship as it traversed the space lanes where Krayn was known to be operating.\nDec, despite his seeming hysteria and rage at Krayn's attack, was able to create a diversion  that allowed Kenobi and Skywalker to infiltrate the pirate's ship. Because Krayn's engines weren't at full speed, the Jedi, in their small utility transport, were able to infiltrate through the raiders' exhaust port.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Colicoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/36_BBY/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Colicoid_cargo_ship",
  "/wiki/Pirate/Legends",
  "/wiki/Krayn",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/29_BBY/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Nor_Fik",
  "/wiki/Spice/Legends",
  "/wiki/Kessel_system/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Krayn%27s_pirate_starship",
  "/wiki/Jedi_Quest:_Path_to_Truth",
  "/wiki/Jedi_Quest_2",
  "/wiki/Jedi_Quest_3",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}