{
 "name": "Anise_I%27Zak",
 "display_name": "Anise I'Zak",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Anise I'Zak was a Human female Jedi Knight serving the Jedi Order and the Galactic Republic during the Clone Wars. In 22 BBY, I'zak was dispatched to the planet of Hitaka, where she received a mission from Jedi Generals Ki-Adi-Mundi and Aayla Secura to deliver a canister to the clone commander of one of the Republic bases on the world. During her quest, she encountered numerous Separatist battle droids, who tried to halt her progress. In one of the skirmishes between I'Zak and the droids, the canister was destroyed. After fighting through more enemy forces, I'Zak reached the base and delivered the broken canister, only to discover that Mundi and Secura had used her presence as a decoy so that they could carry out the actual mission that Supreme Chancellor Palpatine had given them. I'Zak accepted that fact and expressed her willingness to serve the Republic.\nAnise I'Zak, a Human female, was born during the final decades of the Galactic Republic. During her youth, she was trained in the ways of the Force by the Jedi Order. I'Zak possessed an insolent attitude and a habit for causing trouble, traits many Jedi Masters believed would prevent her from ascending to the rank of Jedi Knight. In 22 BBY, shortly after the Battle of Geonosis—which initiated the Clone Wars between the Republic and the Confederacy of Independent Systems—I'Zak managed to pass the Trials necessary to become a Knight, although she did so through unconventional methods, and was thus granted Knighthood status.\nShortly after her promotion, I'Zak was dispatched to the planet of Hitaka, where she met with Jedi Generals Ki-Adi-Mundi and Aayla Secura at a Republic-controlled station. During the meeting, Mundi tasked I'Zak with smuggling a secret canister across enemy lines to one of the Republic camps on the east side of the world, Base \"B\", and she was forewarned about the squadrons of CIS battle droids in the forests and fields. As she was making the trek to the base, I'Zak was attacked by some of the droids of the Separatist Army, though she was able to defeat them before coming across an occupied house. She was ambushed once more by droidekas, causing her to crash into the house and interrupt a native family's dinner. With the aid of the family, I'Zak defeated the droidekas but not before one of them shot and destroyed the canister she was carrying. She was left in despair for a moment, but the arrival of a group of super battle droids prompted her to engage and destroy them all to vent her feelings.\nI'Zak arrived at Base \"B\" by dusk and gave the broken canister to the clone commander, remarking that her mission had been a failure. However, Mundi and Secura surprised I'Zak and told her that her mission was a success, in that she provided an adequate distraction for the droid armies while the Generals carried out the true objective that Supreme Chancellor Palpatine had given them. Although she disliked being used in that way, she recognized that it was in the best interests of the Republic.\nAnise I'Zak was light-skinned and had freckles on her face. She had blue eyes and blond hair, and wore a set of brown Jedi robes. During battle, I'Zak used a lightsaber with a green crystal. She was known for her brazen attitude. She would often use expletives to either help herself conquer her emotions or to conceal her errors. Many of the Jedi Masters felt that her attitude would be a hindrance to her ascending to the rank of Jedi Knight. However, she was able to pass her Trials by using unorthodox methods. When she initially met with Mundi and Secura, she expressed disdain for the Padawan braid she used to wear, and also noted her affinity for repairing her speeder. After the canister she was carrying was destroyed, I'Zak displayed remorse over her apparent failure and took her anger out on a squad of super battle droids. Upon finding out from Mundi and Secura that she was merely a decoy, I'Zak came to the conclusion that the Jedi Generals had leaked information to the Separatists about her whereabouts, although she acknowledged that it was in the best interests of completing the mission and that she was glad to have served.\nI'Zak was a skilled Jedi, enough to be promoted to Knighthood even if she used less than traditional methods, and displayed proficiency in combat against the droid armies on Hitaka, using acrobatics to evade the droids' blaster fire as well as her lightsaber against them. During one skirmish, she used telekinesis to use her lightsaber and destroy three droids who ordered her to surrender. I'Zak also displayed an ability to absorb blaster energy with her hands.\nAnise I'Zak first appeared in the comic story \"Chain of Command,\" written by Jason Hall, penciled by Ethan Beavers, and published by Dark Horse Comics in the tenth volume of the Star Wars: Clone Wars Adventures trade paperbacks on December 19, 2007.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Hitaka",
  "/wiki/Mission_on_Hitaka",
  "/wiki/Jedi_General/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Unidentified_clone_trooper_commander_(Hitaka)",
  "/wiki/Base_%22B%22",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Tree/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Droideka/Legends",
  "/wiki/Unidentified_Hitaka_species",
  "/wiki/B2_super_battle_droid/Legends",
  "/wiki/Army/Legends",
  "/wiki/General/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan_braid/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Tutaminis",
  "/wiki/Limb/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Chain_of_Command_(comic)",
  "/wiki/Jason_Hall",
  "/wiki/Ethan_Beavers",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_10",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/December_19",
  "/wiki/2007",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones"
 ]
}