{
 "name": "Anj'a",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Anj'a was a female Twi'Lek who worked as an entertainer during the Galactic Civil War, sometime after the Battle of Yavin. While she declared that she was neutral in the conflict, rumors persisted that she aided the Alliance to Restore the Republic during the war. She graced the covers of every fashion holo-mag and adorned the screens of every HoloNet user's computer in the galaxy. She was considered by both the Galactic Empire and the Rebellion to be the galaxy's most popular holo-pinup girl, much to the dismay of Imperial officers. Anj'a found the Nightsisters of the planet of Dathomir fascinating, using one of their energy lances as a dancing prop during her performances. She also owned a suit of custom Rancor bone armor that she wore frequently. A painting was commissioned of Anj'a performing her number-one galactic hit \"Booombaaa Boombaa Bombashella\" at the outdoor theater at Vreni Island on the planet Corellia. Anj'a's song was the only time a release by a non-human artist topped the charts under Imperial rule.\nAnj'a appeared in a painting in the 2003 MMORPG Star Wars Galaxies: An Empire Divided and on a card in the Star Wars Galaxies Trading Card Game set, Threat of the Conqueror. The painting and card were named Intense Performer and their artwork was created by the player Anj'a, who won a contest in 2010 to have their artwork added to the games. The artwork's appearance as a painting in Star Wars Galaxies includes a short biography of Anj'a the entertainer. In 2014, Anj'a was mentioned in the second installment of Slugthrowers: An Overview of Popular Music and Musicians in a Galaxy Far, Far Away, an article written by Edward M. Erdelac and published on the StarWars.com Blog.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Entertainer",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Computer/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Bone/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Intense_Performer",
  "/wiki/Booombaaa_Boombaa_Bombashella",
  "/wiki/Grand_Theater_of_Vreni_Island",
  "/wiki/Vreni_Island",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/2003",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/2010",
  "/wiki/2014",
  "/wiki/Slugthrowers:_An_Overview_of_Popular_Music_and_Musicians_in_a_Galaxy_Far,_Far_Away",
  "/wiki/Edward_M._Erdelac",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Blog",
  "/wiki/Template:SWGTCG"
 ]
}