{
 "name": "Anj Dahl",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "Galactic Alliance Remnant",
      "Rogue Squadron",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Anj Dahl was a Human female that served the Galactic Alliance Remnant as a pilot during the Second Imperial Civil War. As a member of the Rogue Squadron, Dahl participated in the Battle of Mon Calamari. After the battle, Dahl was appointed to the position of Rogue Leader when Commander Jhoram Bey was elevated to the rank of second–in–command by Admiral Gar Stazi. Dahl was involved in the Galactic Alliance's attack over Ralltiir and the evacuation efforts of the planet Dac.\nAnj Dahl, a female Human, joined the remnants of the Galactic Alliance several years after the end of the Sith–Imperial War in 130 ABY. She joined the prestigious Rogue Squadron shortly after. Seven years later, Dahl accompanied fellow Rogue Squadron member and Mon Calamari Monia Gahan as she attempted to persuade her uncle Gial Gahan—a former member of the Galactic Alliance Triumvirate and Duros Admiral Gar Stazi's friend—to supply data on the Imperious, an advanced class of Star Destroyer under construction at the Mon Calamari Shipyards. Dahl acquired supplies, including parts, bacta, and a bottle of Corellian brandy for the Dug and fellow Rogue Squadron member Andurgo.\nAfter Monia Gahan successfully convinced her uncle to give the Alliance fleet intel on the Imperious, Dahl and Gahan flew the Scarlet Star, a modified YT-2400 light freighter, back to the Indomitable and the fleet to report to Admiral Stazi. They barely missed the fight between Andurgo and Hondo Karr, a former Imperial stormtrooper. After the Rogue Leader Jhoram Bey broke up the fight between Karr and Andurgo, the Weequay reprimanded Dahl and Gahan for making Admiral Stazi wait.\nLater she fought at the Battle of Mon Calamari. When Ronto had to eject into Dac's atmosphere, Dahl informed Andurgo that she would skin him alive if the Dug's showboating led to Ronto's death.\nAfter Bey was promoted by Admiral Stazi to the second-in-command of the Galactic Alliance fleet, Dahl was promoted to Rogue Leader.\nSometime after the Battle of Ralltiir, the Galactic Alliance fleet made its way to the Arkanis sector in the Outer Rim. Dahl and the other members of Rogue Squadron were briefed on their next mission by Jhoran Bey, who informed Dahl and Rogue Squadron that the fleet planned to\nShe accompanied Hondo Karr on a mission to smuggle Mon Calamari refugees from a moon of Da Soocha. While the mission was a success, Karr did not return from it, as he was able to reunite with his wife and return to Mandalorian ways.\nAnj Dahl was known for being eager and talented. She was also known to have been mischievous, starting trouble between her fellow Rogue Squadron members just for her own entertainment. Because having spent most of her life as a young adult in the Galactic Alliance Core Fleet, Dahl felt that everything in her life could be gone anytime. As a result, she embraced anything that seemed fun to her. Dahl excelled at scrounging, and was capable of acquiring ship parts and supplies from most spaceports without alerting the authorities. Her abilities at this were boosted when sympathizers to the Galactic Alliance Core Fleet assisted her. Dahl did not enjoy being Rogue Leader, feeling that her predecessor, Jhoram Bey, was better at leading the Rogue Squadron than her. She viewed her fellow squad members, including Hondo Karr, as her friends, and was loyal to them. Dahl was not willing to lose any of the Rogue Squadron members on her watch, and did not wish to leave a man behind.\nDahl spoke and comprehended Galactic Basic Standard. She was also capable of understanding Binary. Dahl was skilled in unarmed combat. She possessed a padded flight suit, a blaster pistol, a datapad, and a comlink.\nAnj Dahl was created by John Ostrander, the writer of the Star Wars Legacy comic series, for the Indomitable story arc. She later appeared in the thirty-sixth and forty-second issues of the Legacy series. Dahl also appeared in the second, third, and fifth issues of Star Wars: Legacy's followup miniseries, Star Wars: Legacy—War. Dahl received an entry in the Legacy Era Campaign Guide, which was published by Wizards of the Coast and released on March 17, 2009. Dahl was drawn by Omar Francia for the Indomitable and Renegade storylines. In the story Rogue's End, she was penciled by Kajo Baldisimo; Dahl was drawn by Jan Duursema in The Fate of Dac and in her three appearances in Star Wars: Legacy—War.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Battle_of_Mon_Calamari_(Second_Imperial_Civil_War)",
  "/wiki/Rogue_Leader/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Jhoram_Bey",
  "/wiki/Admiral/Legends",
  "/wiki/Gar_Stazi",
  "/wiki/Battle_of_Ralltiir_(Second_Imperial_Civil_War)",
  "/wiki/Ralltiir/Legends",
  "/wiki/Evacuation_of_Dac",
  "/wiki/Dac",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/130_ABY",
  "/wiki/137_ABY",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Monia_Gahan",
  "/wiki/Gial_Gahan",
  "/wiki/Triumvirate_(Galactic_Alliance)",
  "/wiki/Duros/Legends",
  "/wiki/Alliance_(Imperious-class)",
  "/wiki/Imperious-class_Star_Destroyer",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Mon_Calamari_Shipyards/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Corellian_brandy/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Andurgo",
  "/wiki/Scarlet_Star",
  "/wiki/YT-2400_light_freighter/Legends",
  "/wiki/Indomitable_(Scythe-class)",
  "/wiki/Hondo_Karr",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Ronto_(Klatooinian)",
  "/wiki/Arkanis_sector/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Mission_to_Napdu",
  "/wiki/Moon/Legends",
  "/wiki/Da_Soocha",
  "/wiki/Mandalorian/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Binary/Legends",
  "/wiki/Flight_suit/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy:_Indomitable",
  "/wiki/Legacy_(2006)_36",
  "/wiki/Legacy_(2006)_41",
  "/wiki/Legacy%E2%80%94War_2",
  "/wiki/Legacy%E2%80%94War_3",
  "/wiki/Legacy%E2%80%94War_5",
  "/wiki/Star_Wars:_Legacy%E2%80%94War",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/March_17",
  "/wiki/2009",
  "/wiki/Omar_Francia",
  "/wiki/Kajo_Baldisimo",
  "/wiki/Jan_Duursema",
  "/wiki/Legacy_(2006)_47",
  "/wiki/Legacy%E2%80%94War_4",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Derek_Klivian/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/9_ABY/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/18_ABY/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Gavin_Darklighter",
  "/wiki/28_ABY/Legends",
  "/wiki/Corran_Horn",
  "/wiki/29_ABY/Legends",
  "/wiki/36_ABY",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/40_ABY",
  "/wiki/Lensi",
  "/wiki/Legacy_(2006)_20",
  "/wiki/Legacy_(2006)_21"
 ]
}