{
 "name": "Anj Zavor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Majoros"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Massassi Group",
      "Rebel Fleet Command",
      "Massassi Group",
      "Rebel Fleet Command"
     ]
    }
   ]
  }
 ],
 "content": "Colonel Anj Zavor was a human male who served in Fleet Command for the Alliance to Restore the Republic. He provided a report to Commander Mon Mothma on the militarization of Mon Calamari city-ships in the Telaris cometary cloud and the capture of a Quasar Fire-class cruiser-carrier that had occurred in 3 BBY. Zavor then became liaison between Admiral Raddus, head of the Alliance Fleet, and the rebels based in the Great Temple on the moon Yavin 4.\nIn 0 BBY, he attended a meeting in the temple where Alliance High Command discussed the possibility of stealing the plans to the Imperial Death Star superweapon but ultimately decided against it. After a rogue squad of rebels set out to steal the plans anyway, Raddus led a fleet to support them. Zavor then kept a line of communication open between Yavin 4 and Raddus during the ensuing Battle of Scarif. Raddus perished during the battle, but the successful acquisition of the plans allowed the Alliance to destroy the Death Star at the Battle of Yavin, after which Zavor attended an award ceremony for the victors.\nAnj Zavor was a human male from Majoros who served as a colonel in Fleet Command for the navy of the Alliance to Restore the Republic. He sent a message to Commander Mon Mothma, head of the Alliance, informing her that the Rebellion had finished converting Mon Calamari city-ships to war production facilities in the Telaris cometary cloud. The officer noted that the MC75 Star Cruiser Profundity would be the first cruiser to be combat-ready at the stardocks and, in an addendum, he mentioned the Quasar Fire-class cruiser carrier that had been acquired by Commander Hera Syndulla in the Ryloth system in 3 BBY. Zavor provided details on the carrier model and suggested that they could fill an escort carrier role if more could be acquired.\nZavor later became liaison between the rebel forces of Massassi Group, who were based at the rebel headquarters in the Great Temple of the moon Yavin 4, and Admiral Raddus, commander of the Profundity and the Alliance Fleet. Zavor kept a channel of communication open between Yavin 4 and the admiral, who was constantly mobile. Zavor was also a member of Alliance High Command and was listed as Raddus's liaison in a list of the command members on a classified intelligence document titled Form #49021804-REB, which, along with Zavor's message to Mothma, was included in the collection of documents that became known as The Rebel Files.\nIn 0 BBY, Zavor was among the members of Alliance High Command who observed the questioning and recruitment of the criminal Jyn Erso into the Alliance in the Great Temple. Erso later returned to the temple with information from her father, Imperial scientist Galen Erso, which revealed that the Galactic Empire was building a superweapon known as the Death Star that was capable of destroying planets.\nHowever, Galen had created a flaw in the weapon that the rebels could exploit if they recovered the plans for the battle station from the planet Scarif. A meeting was then held to discuss what should be done with the information, with Jyn and Raddus demanding that the Alliance attack Scarif. Zavor attended the meeting standing behind General Davits Draven, but the plan of attack ultimately failed to gain unanimous backing from the Rebel Council. After the meeting disbanded, Jyn led an unauthorized squad of Alliance forces to Scarif in order to steal the plans.\nWhen the rebels on Yavin 4 learned of the squad on Scarif, they scrambled their forces to provide support, with Raddus leading the fleet from the Profundity. Zavor then carried out his liaison duties for Raddus during the ensuing Battle of Scarif, in which the plans were successfully stolen, but Raddus and many others rebels were killed. With Raddus gone and the battle over, Zavor managed to establish contact with Admiral Gial Ackbar and the remaining fleet elements, which General Jan Dodonna reported to Mothma. However, Ackbar reported that his forces were shorthanded, behind schedule, underequipped, and in no position to replace Raddus or bolster the rebel fleet. After the plans were eventually delivered to the Great Temple on Yavin 4, the Death Star itself traveled to the Yavin system in order to destroy the rebel headquarters there.\nZavor was then present for the Battle of Yavin, in which the Alliance successfully used the plans' information to destroy the Death Star. The morning after the Alliance victory, an award ceremony was held in the temple in which Princess Leia Organa presented Medals of Bravery to Luke Skywalker and Han Solo, pilots who had played key roles in the battle. During the ceremony, Zavor stood upon the stage behind Organa alongside Dodonna and other members of Alliance High Command. The rebels then evacuated all personnel from Yavin 4.\nAnj Zavor had light skin, gray hair, and brown eyes.\nPrior to the Battle of Scarif, Zavor wore a brown shirt with tan pants, a brown belt, and a tan jacket that was part of traditional Alderaanian military livery. He wore a rank insignia plaque with five red pips on his jacket. During the awards ceremony, Zavor wore a tan cap, a white neckerchief, a green jacket, green pants, black shoes, and a black belt.\nAnj Zavor was portrayed by an uncredited Henry Roberts in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. The medal ceremony scene was shot on Stage H at Shepperton Studios between May 13 and May 18, 1976. The character was then first identified in the Star Wars Legends continuity in the \"Rogues Gallery\" feature, written by Leland Chee, of 133th issue of the Star Wars Insider magazine, published on May 1, 2012.\nA character played by a separate actor in the 2016 canon Anthology Series film, Rogue One: A Star Wars Story, was then identified as being Zavor by the accompanying reference book Star Wars: Rogue One: The Ultimate Visual Guide, which was written by Pablo Hidalgo. Although the book identifies Zavor as a colonel, his rank plaque in the film bears five pips, which the guide identifies as the insignia of a general.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Anj_Zavor",
  "/wiki/Anj_Zavor/Legends",
  "/wiki/Anj",
  "/wiki/Majoros",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Massassi_Group",
  "/wiki/Rebel_Fleet_Command",
  "/wiki/Colonel",
  "/wiki/Commander-in-Chief",
  "/wiki/Mon_Mothma",
  "/wiki/Mon_Calamari",
  "/wiki/City-ship",
  "/wiki/Telaris_cometary_cloud",
  "/wiki/Mission_to_Ryloth_(Phoenix_Squadron)",
  "/wiki/Quasar_Fire-class_cruiser-carrier",
  "/wiki/3_BBY",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/0_BBY",
  "/wiki/Alliance_High_Command",
  "/wiki/Death_Star_plans",
  "/wiki/Galactic_Empire",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Rogue_One",
  "/wiki/Battle_of_Scarif",
  "/wiki/Commanding_officer",
  "/wiki/Fleet",
  "/wiki/Scarif",
  "/wiki/Death",
  "/wiki/Death_Star",
  "/wiki/Battle_of_Yavin",
  "/wiki/Royal_Award_Ceremony",
  "/wiki/Officer",
  "/wiki/MC75_Star_Cruiser",
  "/wiki/Profundity",
  "/wiki/Cruiser",
  "/wiki/Telaris_rebel_stardocks",
  "/wiki/Phoenix_Nest",
  "/wiki/Commander",
  "/wiki/Hera_Syndulla",
  "/wiki/Ryloth_system",
  "/wiki/The_Rebel_Files",
  "/wiki/Jyn_Erso",
  "/wiki/Parent",
  "/wiki/Scientist",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Planet",
  "/wiki/Battle_station",
  "/wiki/General",
  "/wiki/Davits_Draven",
  "/wiki/Gial_Ackbar",
  "/wiki/Jan_Dodonna",
  "/wiki/Yavin_system",
  "/wiki/Local_day",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Medal_of_Bravery",
  "/wiki/Luke_Skywalker",
  "/wiki/Han_Solo",
  "/wiki/Pilot",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Alderaanian",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Hat",
  "/wiki/Henry_Roberts",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Shepperton_Studios",
  "/wiki/May_13",
  "/wiki/May_18",
  "/wiki/1976",
  "/wiki/Star_Wars_Legends",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars_Insider_133",
  "/wiki/Star_Wars_Insider",
  "/wiki/May_1",
  "/wiki/2012",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Military_rank",
  "/wiki/Star_Wars_Storybook_Collection:_Star_Wars:_The_Prequel_Trilogy_Stories_and_Star_Wars:_The_Original_Trilogy_Stories",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Han_Solo_-_From_Smuggler_to_General",
  "/wiki/Star_Wars:_A_New_Hope_Cinestory_Comic",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/Star_Wars:_A_New_Hope_(Disney_Die-Cut_Classics)",
  "/wiki/Princess_Leia_%E2%80%93_The_Rescue",
  "/wiki/The_Battle_of_Yavin_(short_story)",
  "/wiki/The_Original_Trilogy_Stories",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_23",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Long_Live_Leia",
  "/wiki/Star_Wars_Insider_178",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_3",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars_Maker_Lab",
  "/wiki/Star_Wars_Insider_Special_Edition_2019",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Rebel_Alliance",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Anj_Zavor",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Standard_year",
  "/wiki/Mission_on_Lothal",
  "/wiki/A_Princess_on_Lothal",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Reproduction",
  "/wiki/19_BBY",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Attack_on_Phoenix_Squadron_(3_BBY)",
  "/wiki/Phoenix_Squadron",
  "/wiki/The_Forgotten_Droid",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Homecoming",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/July_25",
  "/wiki/November_15",
  "/wiki/2017",
  "/wiki/The_Making_of_Star_Wars",
  "/wiki/Titan_Magazines"
 ]
}