{
 "name": "Anri",
 "display_name": "Anri",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Violet"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Raven Squad",
      "Raven Squad"
     ]
    }
   ]
  }
 ],
 "content": "Anri was a female Twi'lek major of the Sith Empire who served in the Invasion of Ossus. She was in command of Raven Squad.\nAs a former slave, Anri rose through the ranks of the Imperial Military due to societal reforms proposed by Darth Malgus and continued by Darth Marr. By the time of the third Galactic War, she became a major in command of Raven Squad, a highly esteemed special forces unit serving under Darth Malora and then Darth Malgus. Anri belonged to the 8 percent of Non-Human Imperials that staffed the Imperial Military during the third Galactic War.\nAnri viewed her advancement in the meritocratic terms of the Sith Empire at large; one's power and standing rises as they prove their superiority by overcoming the threats and impediments facing them. Her skillful leadership and gallows humor made her popular with her fellow troops, and while her outspokenness led some officers and Sith to question her dedication, her troops knew firsthand that her determination to see the Sith Empire triumph over all foes was absolute.\nMajor Anri was first introduced in Patch 5.10.0 of Star Wars: The Old Republic, dubbed Jedi Under Siege. She is available as a companion NPC to the main character. She is voiced by Helen Sadler, who previously worked on Star Wars: The Old Republic as Jedi Master Surro. According to Charles Boyd, the Creative Director for the game, Anri is an updated version of a character that he originally wrote years prior to the release of Jedi Under Siege; an antagonist in the Republic Trooper storyline who was cut from the final release of the game.\nFor Republic players during the Mek-Sha storyline, Anri is confronted by Vice-Admiral Dol Narlock attempting to activate the station's failsafe. If the player is a Loyalist, Anri immediately surrenders, not wanting to take her chances against the one who defeated the Sith Emperor. The player will later receive a message from Narlock, stating that Anri had escaped his most secure ship, the Aphelion III.\nAlternatively, if the player is a Saboteur, they have the choice of either killing Narlock and allowing Anri to activate the failsafe, or assist Narlock.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Raven_Squad",
  "/wiki/Major/Legends",
  "/wiki/Invasion_of_Ossus",
  "/wiki/Slavery/Legends",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Darth_Malgus",
  "/wiki/Darth_Marr",
  "/wiki/Third_Galactic_War",
  "/wiki/Imperial_Special_Forces_(Sith_Empire)",
  "/wiki/Darth_Malora",
  "/wiki/Alien/Legends",
  "/wiki/Imperials",
  "/wiki/Alliance_Commander",
  "/wiki/Helen_Sadler",
  "/wiki/Surro",
  "/wiki/Charles_Boyd",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Mek-Sha",
  "/wiki/Vice_Admiral/Legends",
  "/wiki/Dol_Narlock",
  "/wiki/Tenebrae",
  "/wiki/Aphelion_III",
  "/wiki/Category:Images_of_Anri",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/File:CharlesBoyd-AnriUpdate-December-17-2018.png"
 ]
}