{
 "name": "Ansan Talam",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Graying"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Commission for the Preservation of the New Order"
     ]
    }
   ]
  }
 ],
 "content": "Ansan Talam was a Human who was one of the first miners to arrive on the planet Tasariq. Independent and liking space and solitude, Talam prospected in unexplored craters for Tasar crystals. While he rarely found rich deposits, Talam occasionally hit it big but sold off his claim before the mining corporations moved in.\nTalam was an ardent supporter of the New Order, and a diehard racist to non-Humans. Much of the wealth that Talam earned over the years was donated to the Commission for the Preservation of the New Order. He had been a member since the organization was first founded, and believed it was a grassroots movement created by the people of the Empire for the benefit of the people of the Empire. Talam's racism extended to his equipment, frequently paying more for imported goods rather than using the Tasari's own products. His only concession was owning an All Terrain Cruiser K-111 steam rover which replaced a landspeeder lost in a tunnel worm attack.\nDuring his time on Tasariq, Talam came into possession of a citrine crystal that granted him the Force power of Accelerate Healing.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/Miner/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tasariq",
  "/wiki/Tasar_crystal",
  "/wiki/Mining/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Speciesism",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Tasari",
  "/wiki/All_Terrain_Cruiser_K-111",
  "/wiki/Steam_rover",
  "/wiki/Landspeeder/Legends",
  "/wiki/Tunnel_worm_(Tasariq)",
  "/wiki/Citrine_crystal",
  "/wiki/Force_power/Legends",
  "/wiki/Accelerate_Healing",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Tasariq:_The_Crystal_Planet",
  "/wiki/Star_Wars_Adventure_Journal_15"
 ]
}