{
 "name": "Antes Belladar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Reytha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Antes Belladar was the Human male governor of the agricultural planet Reytha during the reign of the Galactic Empire. In 0 ABY, during the Galactic Civil War, Reytha was taken over by the Alliance to Restore the Republic, which Belladar was unable to prevent. Eventually, he received assistance from the Sith Lord Darth Vader, who was able to eliminate the Rebels from several of Reytha's major cities. After Belladar discovered a Rebel presence in the Montrosa Islands, Vader led his army there. When he arrived at the islands, Vader executed Belladar for failing to prevent the Alliance takeover, and then eliminated the remaining Rebels from the planet.\nAntes Belladar was a Human male who served the Galactic Empire and rose to the position of governor of the agricultural planet Reytha several years before 0 ABY. Belladar commanded a token defense force on the world, and in 0 ABY, during the Galactic Civil War, a major conflict between the Empire and the Alliance to Restore the Republic, Belladar was unable to prevent the Alliance from taking over Reytha. To counter the Rebel threat, the Governor was forced to request help from the Dark Lord of the Sith Darth Vader, who had already discovered the Rebels' plan to take Reytha when he had chased them off their base on the moon Yavin 4. Upon receiving the information, Vader left for Reytha immediately, knowing that the loss of its food supplies could severely damage the Empire.\nUpon Vader's arrival, Belladar thanked him for responding so quickly to his call, and then reported that the Alliance was still preparing to attack the planet. However, a probe droid scan showed that the Rebels had already taken over Reytha. Vader planned to take the capital city, Reytha Minor, but instead led his army to attack and retake the smaller cities of Teks and Breeda for the Empire. After Vader did so, Belladar was surprised that he was able to defeat the Rebels in those cities. As soon as it had gained enough soldiers, the Empire launched its assault on Reytha Minor and destroyed the Rebels' command center. Belladar then received a report from a Reythan soldier that the Alliance had set up multiple bases in the planet's Montrosa Islands. Belladar relayed this to Vader, who then departed for the islands.\nOnce Vader's army arrived at the islands, Belladar told him of the structure the Rebels had set up in their bases. Vader, however, questioned the Governor on how the Rebels had been allowed to infiltrate Reytha, but Belladar was not sure what Vader was asking. Deciding that the Governor had failed the Empire for the last time, Vader used the Force to strangle Belladar, killing him. Vader then destroyed the Rebel bases in the Montrosa Islands and continued his search for the Alliance Fleet.\nAntes Belladar was able to achieve the position of governor of Reytha under the Empire, but several years on the relatively peaceful planet led many to believe that he had grown soft, and the Empire even considered the possibility that Belladar was a Rebel sympathizer. Emperor's Hand Mara Jade saw the Governor as being weak in his abilities. When Darth Vader arrived on Reytha, Belladar gave outdated information to him, reporting that the Rebel Alliance was only preparing to attack when, in fact, it had already completed its takeover of the planet. Belladar preferred that tasks be completed by others on his behalf, and would complain of injuries when ordered to complete a task. Belladar was fair-skinned.\nBelladar wore a visor attached to an orange helmet that hid most of his face. He also wore a dark blue tunic, a shirt with orange sleeves, dark green pants and brown shoes.\nAntes Belladar was first mentioned in Star Wars: Galactic Battlegrounds: Prima's Official Strategy Guide by Steven L. Kent, released on November 7, 2001. He then appeared in the LucasArts video game Star Wars: Galactic Battlegrounds, released on November 11, 2001, where he was voiced by James Horan. Belladar's voice was heard in the second and third levels of the Imperial campaign, titled \"Breaking Bread\" and \"Fire, Earth, Water and Air\" respectively. Belladar's only physical appearance is in the game's scenario editor, where the player can use him as a uniqe unit. Belladar's first name is also only given in the level editor; in the campaign his character is always just called \"Reytha Governor,\" with his last name being given in dialogue with Darth Vader.\nIn Galactic Battlegrounds, an inconsistency occurs involving Belladar. At the end of the first level of the Imperial campaign, the Empire finds intelligence on Yavin 4 that leads them to arrive at Reytha; however, at the start of the next level Belladar thanks Vader for responding to his call for help, and Vader asks why he has been summoned. This article assumes that the Empire found the intelligence on Yavin 4 and left for Reytha, and that Belladar requested Vader's assistance at the same time.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/0_ABY/Legends",
  "/wiki/Reytha",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/File:Belladar_chokes.ogg",
  "/wiki/Governor/Legends",
  "/wiki/Agriworld/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Reytha_campaign",
  "/wiki/City/Legends",
  "/wiki/Montrosa_Islands",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Death/Legends",
  "/wiki/File:Belladars_bad_news.ogg",
  "/wiki/Standard_year/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Evacuation_of_Yavin",
  "/wiki/Great_Temple/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Probe_droid/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Reytha_Minor",
  "/wiki/Teks",
  "/wiki/Breeda",
  "/wiki/Soldier/Legends",
  "/wiki/Command_center",
  "/wiki/Unidentified_Reythan_soldier",
  "/wiki/Army/Legends",
  "/wiki/Time/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/File:Belladars_weakness.ogg",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Darth/Legends",
  "/wiki/Color/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/File:Antesrathernot.ogg",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Steven_L._Kent",
  "/wiki/November_7",
  "/wiki/2001",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/November_11",
  "/wiki/James_Horan",
  "/wiki/Category:Audio_files_of_Antes_Belladar",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/Star_Wars:_Force_and_Destiny_Core_Rulebook"
 ]
}