{
 "name": "Antidar Williams",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "32 BBY; Radiant VII",
      "Naboo system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Judicial Forces",
      "Judicial Forces"
     ]
    }
   ]
  }
 ],
 "content": "Antidar Williams was a human male who served in the Judicial Forces of the Galactic Republic. In 32 BBY, he and Captain Maoi Madakor piloted the Consular-class space cruiser Radiant VII while transporting two Jedi ambassadors—Qui-Gon Jinn and Obi-Wan Kenobi—to the Naboo system in order to negotiate an end to the Trade Federation's blockade of the planet Naboo. After docking on the Federation flagship, the Saak'ak, Williams and Madakor waited aboard the Radiant VII but were killed when the cruiser was ambushed and destroyed by a ceiling-mounted droid laser turret.\nAntidar Williams was a human male who served as a pilot in the Judicial Forces of the Galactic Republic. In the year 32 BBY, he co-piloted the Republic Diplomatic Corps Consular-class space cruiser Radiant VII alongside Captain Maoi Madakor while transporting Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, to the Naboo system. The two Jedi were acting as ambassadors on behalf of Republic Supreme Chancellor Finis Valorum in the hopes of negotiating an end to the Trade Federation's blockade of the planet Naboo.\nUpon reaching the blockade, the Radiant VII docked in a hangar aboard the Trade Federation flagship, the Saak'ak. Williams and Madakor remained in the cruiser's cockpit while the Jedi left to meet with Federation Viceroy Nute Gunray. Learning that the Jedi had been sent to negotiate, Gunray contacted his master, the Sith Lord Darth Sidious, who ordered him to kill the Republic party.\nUnder Gunray's orders, a droid laser turret descended from the ceiling in the hangar where the Radiant VII was parked and opened fire on the vessel. Williams saw the attack coming and tried to warn Madakor, who ordered him to activate the cruiser's shields, but it was too late, and both were killed as the cruiser exploded. The Jedi were able to avoid the Federation's attempt on their lives and escaped the Saak'ak, ultimately helping to defeat the Federation after it invaded Naboo.\nAntidar Williams had black hair, brown eyes, and light skin. He spoke with an aristocratic accent.\nWhile on the Radiant VII, Williams wore a blue Judicial Forces uniform.\nAntidar Williams was created for the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace, in which he was played by Silas Carson. Although Carson initially auditioned for a separate, slightly more prominent pilot role that ended up not making it into the film, casting director Robin Gurland enjoyed the interview with him and so mentioned him to director George Lucas. Deciding that Carson looked like an interesting person, Lucas had him come back in for animatics and then gave him the part of the Jedi Ki-Adi-Mundi instead.\nCarson was later also given the roles of Nute Gunray and Senator Lott Dod, both of which, along with Mundi, required him to wear prosthetics that covered his face. Carson mentioned to Gurland that he would like for his actual face to appear in the film, so when it came time to cast Williams, Gurland asked him if he would like the role. All of the scenes in the cockpit of the Radiant VII were filmed on September 8, 1997.\nThe Antidar Williams character was first given a name in the new Star Wars canon by the mobile card game Star Wars: Force Collection, which initially launched in 2013. Although the launch of Force Collection predates the Star Wars canon reset of 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon.\nIn Star Wars Legends, Williams appeared prior to the film's release in the novelization of The Phantom Menace, written by Terry Brooks. The character was originally given a surname by the Coruscant Limited expansion set of the Star Wars Customizable Card Game in 2001. The forename \"Antidar\" was then created by fan Ian Tapley for the \"What's The Story?\" feature on StarWars.com. Tapley initially wanted the character's first name to be a tuckerization of his own name or one of his nicknames, but after being unable to come up with a satisfying result, he settled for an anagram of \"radiant\"—a reference to Williams's ship, the Radiant VII.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Antidar_Williams",
  "/wiki/Antidar_Williams/Legends",
  "/wiki/32_BBY",
  "/wiki/Radiant_VII",
  "/wiki/Saak%27ak",
  "/wiki/Naboo_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Judicial_Forces",
  "/wiki/File:Williams_and_Madakor.ogg",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Captain",
  "/wiki/Maoi_Madakor",
  "/wiki/Pilot",
  "/wiki/Consular-class_space_cruiser",
  "/wiki/Jedi",
  "/wiki/Ambassador",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Trade_Federation",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Planet",
  "/wiki/Naboo",
  "/wiki/Flagship",
  "/wiki/Death",
  "/wiki/Cruiser",
  "/wiki/Escape_from_the_Saak%27ak",
  "/wiki/Droid_laser_turret",
  "/wiki/File:Sidious_and_Gunray-Kill_them.ogg",
  "/wiki/File:Radiant_Cockpit.jpg",
  "/wiki/Standard_year",
  "/wiki/Republic_Diplomatic_Corps",
  "/wiki/Jedi_Master",
  "/wiki/Padawan",
  "/wiki/Supreme_Chancellor",
  "/wiki/Finis_Valorum",
  "/wiki/Blockade",
  "/wiki/Hangar",
  "/wiki/Cockpit",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Nute_Gunray",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Sidious",
  "/wiki/File:Radiant_VII_destruction.png",
  "/wiki/Starship",
  "/wiki/Deflector_shield",
  "/wiki/Battle_of_Naboo",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Manic_Mundi",
  "/wiki/File:NuteDatabank.png",
  "/wiki/1999",
  "/wiki/Prequel_trilogy",
  "/wiki/Silas_Carson",
  "/wiki/Robin_Gurland",
  "/wiki/George_Lucas",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Senator",
  "/wiki/Lott_Dod",
  "/wiki/September_8",
  "/wiki/1997",
  "/wiki/File:Republic_Cruiser_SWE.png",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/2013",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Terry_Brooks",
  "/wiki/Coruscant_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/2001",
  "/wiki/Ian_Tapley",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/StarWars.com",
  "/wiki/Tuckerization",
  "/wiki/Category:Images_of_Antidar_Williams",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Ultimate_LEGO_Star_Wars",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_29",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_214",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Tarkin_(novel)",
  "/wiki/Star_Wars_Insider_44",
  "/wiki/Multiple_Personality",
  "/wiki/Star_Wars_Insider_83",
  "/wiki/Creating_the_Worlds_of_Star_Wars:_365_Days",
  "/wiki/File:Leland_Chee_Force_Collection.png",
  "/wiki/In-universe",
  "/wiki/Star_Wars:_Blogs"
 ]
}