{
 "name": "Antinnis_Tremayne",
 "display_name": "Antinnis Tremayne",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond; Dark brown"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic right arm and eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius",
      "Imperial Remnant",
      "Empire Reborn",
      "Empire Reborn"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Dav Kylanu",
      "Darth Vader"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Vialco"
     ]
    }
   ]
  }
 ],
 "content": "Antinnis Tremayne was a Human male cyborg who served as an Imperial High Inquisitor during the Galactic Civil War. The apprentice of Darth Vader, Tremayne was initially trained as a Padawan by Master Dav Kylanu. When his master perished during the Clone Wars, Tremayne was captured by enemy troops, and was forced to sit out the rest of the war. With the advent of the New Order, he did not fall victim to Order 66 or the Great Jedi Purge, and was instead taken to Byss with other captive Jedi-in-training. There, he was recruited by Vader to be a founding member of a new division of Imperial Intelligence, the Inquisitorius.\nTremayne quickly turned to the dark side of the Force, and was dedicated to hunting down fugitive Jedi who might potentially damage the Empire. He obsessed over his targets; in particular, he spent several months hunting \"Jodd Sonta,\" actually the Jedi Padawan Drake Lo'gaan. Though he failed to capture or kill Lo'gaan, he was given other tasks, such as the discovery and conversion of fugitive Jedi on far-flung worlds. He was able to convert many to the cause of the Inquisitorius, and began honing his skills as an interrogator. In time, Tremayne was unparalleled in the field of interrogation, and was often called upon by COMPNOR and Imperial Intelligence when resilient subjects arose.\nTremayne's reputation spread, and he became feared by ally and enemy alike. He began obsessing over another Jedi, Corwin Shelvay, but that particular pursuit resulted in the loss of Tremayne's eye and arm. Nevertheless, he was able to slay Jedi Master Darrin Arkanian, boosting his confidence further. He was given command of the Interrogator, which he used to root out Rebel cells and pursue turncoat Dark Side Adepts. When the Empire fell, Tremayne decided to ally himself with another of Vader's former students, Hethrir. Despite this, the Procurator of Justice's splinter movement was quickly eliminated by the New Republic.\nAt the age of nineteen months, Antinnis Tremayne was handed over to the Jedi Order, to be trained as a Jedi Knight though, unlike other Jedi, he remained in contact with his family, namely his mother. When he reached the age of fifteen, he was selected by Jedi Master Dav Kylanu as an apprentice. After three years as Kylanu's Padawan, Tremayne was scolded for his vain nature and Kylanu taught him that truth was more relevant to the Jedi. Despite Kylanu's presence, Tremayne grew increasingly fascinated by the dark side of the Force—an interest that caused concern amongst the rest of the Order. Nevertheless, Tremayne fought in the Clone Wars, but with each passing mission, the brutality of the conflict deeply affected the young man. On one mission, Kylanu was killed by the Confederacy of Independent Systems, with Tremayne captured and held prisoner until 19 BBY.\nWith the Declaration of a New Order and Order 66, the Jedi Order was effectively destroyed, with the surviving Jedi going into hiding. Tremayne was among those captured by Palpatine's agents, and he was taken to the Deep Core world of Byss. There, under the supervision of Sly Moore, he was kept in custody along with other captured Padawans and Agricultural Corps members. When the new Dark Lord of the Sith, Darth Vader arrived on Byss for an inspection tour, he was told by his master, Palpatine, to select worthy pupils to form a Jedi-hunting team, the Inquisitorius. Palpatine had the cuffs of the prisoners deactivated, and they were given staffs with which to attack Vader.\nVader, unarmed, easily fended off the Padawans, and mocked their lack of skill. While Vader was throttling two of the prisoners, Tremayne saw an opportunity: Vader's chest panel, which helped regulate his artificial breathing. He pressed one of the buttons on the panel, causing the Dark Lord to drop the prisoners and gasp for breath. Vader, impressed, selected four potential pupils: Tremayne, Gwellib Ap-Llewff, Lanu Pasiq, and Halmere, while the remaining Padawans and AgriCorps members were executed. Now in the employ of the Empire as Darth Vader's apprentice, Tremayne fell to the dark side of the Force.\nOne of Tremayne's first assignments was to give a speech at the Jrade District on Coruscant, where he was to address the Commission for the Preservation of the New Order's Sub-Adult Group. He applauded Palpatine's policies and hinted at the new Human supremacy that would dominate the galaxy. He also talked about progression in the New Order, and told the teenage audience that they would be exempted from the curfew restriction were they to join COMPNOR. Tremayne also offered jobs to those seeking pay. Following his speech, he had Halmere get the names of all those present, as he detected a Jedi presence amongst the crowd.\nFollowing the recruitment drive, Tremayne entered a sparring session with his fellow Inquisitors. As Vader watched them duel, Tremayne told his new master of the Jedi presence, and rumors from the lower levels of a rogue Padawan. During the duel, Vader chastised Tremayne for being on the defensive, and ordered him to attack. When Tremayne had gained the upper hand over all of his fellow Inquisitors, Vader ordered him to hunt down and destroy the Jedi.\nWith Halmere's data, it was understood that three people attending the Jrade district drive had questionable backgrounds: Ash Lynn, Jodd Sonta, and Bray Kopedon. Sonta was the one that attracted Tremayne's attention, and he dispatched stormtroopers to detain the young suspected Jedi at Platform DN6-4435. They failed, however, and Sonta escaped. Nevertheless, Tremayne had gleaned that Sonta had interest in the transport that was due to depart from DN6-4435 for Byss. Forty minutes before its departure, he had his troops surround it, and boarded it himself, expecting Sonta's arrival. The ship was in fact a slave ship, packed with non-Humans that were to work on building Palpatine's citadel on Byss.\nSure enough, Sonta, with a light disguise, infiltrated the ship, and Tremayne met him in the corridors. Sonta had been searching for his friend and fellow Padawan, Zonder, who, as a Selonian, was a part of the slave group. Tremayne let slip the Selonian's location during a bout of banter between him and Sonta, and the young Jedi's other ally, Ekria, used the knowledge to her advantage. While she found Zonder, Tremayne and Sonta grappled, and the Inquisitor offered the young Jedi a place in his organization. The Jedi refused, however, and the pair squared off, lightsabers at the ready. After a brief duel, Sonta kicked Tremayne in the face, disarming him. Livid, Tremayne ordered the death of Zonder, while Sonta threw a restraining device over him.\nAs Sonta fled, Tremayne escaped from his restraints, and ordered his troops to fire on the resisting aliens, who had beaten back the other Inquisitors. He also ordered that the ship depart as soon as possible. Sonta and his cronies escaped, but the young Jedi decided to return to warn Onnelly Praji, a young girl on the transport, of the ship's intent and destination. Tremayne caught him in the act and attempted to arrest him, but Sonta once again escaped, cutting open a window and jumping out into Imperial City. Tremayne, disgruntled and embarrassed, ordered his fellow Inquisitors to keep his failure secret from Vader, and vowed to capture the Padawans before the Dark Lord's return.\nSome time later, Tremayne was dispatched to a far-flung world, hunting two Jedi, a Zeltron and a Gotal. He was unable to capture them alive, as the Gotal sacrificed himself defending his village, and the Zeltron perished during interrogation. During the interrogation, however, he had learned the location of other Jedi, such as Niebur Boton. However, he had trouble working with Imperial Intelligence Director Armand Isard. Upon returning to Coruscant, he expressed his concerns to Darth Vader, who said that he would talk with Isard. Tremayne then questioned Inquisitor Pasiq as to Sonta's location, but she had turned up no new leads.\nThe following day, at Imperial Intelligence Headquarters, the Inquisitors began searching for Sonta by studying camera feeds and civilian media. Tremayne was approached by Isard, who complained that the Inquisitorius's parameters were too broad, and were taking up a significant amount of Intelligence resources. As Tremayne and Isard debated, Inquisitor Pasiq came across a news report, featuring a pair of Omwati who had been attacked the previous night, and had been saved by a trio of rescuers with seemingly superhuman abilities. Confident that the perpetrators were Sonta and his cronies, Tremayne began devising a trap.\nHe had probes sent to the Omwati residence, but he did not account for the presence of Boushh, a Black Sun bounty hunter who had been charged with eliminating Kodo Finn. As expected, Sonta arrived, and Tremayne's stormtroopers barged in, capturing the bounty hunter and the Jedi. As Tremayne entered, however, Sonta fled, jumping out a nearby window in much the same fashion as he had in months prior. Foiled once again, Tremayne returned to his quarters to meditate.\nWhile meditating, he discovered Prince Xizor flirting with Inquisitor Pasiq. Xizor introduced himself, and began recounting facts about Tremayne's past—some facts that not even Tremayne himself was aware of, including his first name. Xizor made clear that he was aware of Tremayne's hunt for Sonta, and that Tremayne had kept his failure hidden from Vader. With Xizor effectively blackmailing him, Tremayne saw no option but to comply with the Falleen's demands: namely, information on the Dark Lord himself.\nSubsequently, Tremayne was summoned to Xizor's residence, where the Falleen Prince had a gift for the Inquisitor. In exchange, Tremayne was to deliver a holographic recording of a meeting between Orman Tagge and Palpatine to Vader. Tremayne tentatively agreed, and Xizor unveiled his gift: the fugitive Padawan Zonder, one of Sonta's accomplices. Back at the Inquisitorius headquarters, Tremayne began brutally interrogating and torturing Zonder, with the help of Pasiq. The Selonian put up fierce resistance, however, which attracted the attention of Lord Vader.\nVader released the Selonian, gave him his lightsaber, and then activated his communication device, transmitting a hologram to Sonta and Ekria. Tremayne watched on as the Dark Lord dueled with Zonder, injuring him to a severe degree before decapitating him. Vader knew that such an action would lure the accomplices out of their hiding, on a quest for revenge. The Dark Lord then turned on his apprentice, demanding to know why he had kept the fugitive Jedi a secret. He throttled Tremayne, before viewing the Tagge/Palpatine holorecording. Following this, he told Tremayne that he would be giving the Inquisitorius extra help in apprehending Sonta. Vader had also been able to reveal Sonta's real name: Drake Lo'gaan.\nHelp came in the form of Armand Isard and clone Commander Bly, who the Padawans had eluded on Felucia when Order 66 came about. Bly was able to lend knowledge on Ekria, who was a talented slicer. Isard adjusted his tracking tactics accordingly, and the Imperials soon learned the location of Lo'gaan's hideout. Taking a Low Altitude Assault Transport to the location, they arrived only to see it ripped apart by explosives. Pasiq speculated that the Padawans had perished in the explosion, but Tremayne detected them leaving in an airspeeder.\nA harrowing chase ensued through Imperial City, and though Ekria jumped off the speeder, Tremayne ordered Bly to persist in chasing Lo'gaan. They eventually came to Platform NL1922, where Lord Vader was due to depart for Tepasi. Lo'gaan attempted to attack Vader, but the Dark Lord's Noghri bodyguards were able to apprehend him. Tremayne apologized for his failure, but Vader cared little, instead ordering the Inquisitor to find the girl. He failed, however, and Ekria made her own way to Tepasi. There, both she and Lo'gaan were believed to have been killed.\nTremayne, along with fellow Inquisitor Ameesa Darys, was enlisted by Grand Inquisitor Laddinare Torbin to aid in the capture of Arden Lyn. Lyn was an ancient woman, preserved for over twenty-five thousand years. She was also a master of Teräs Käsi, and proved to be more than a match for the two junior Inquisitors. Darys perished during the fight, and Tremayne suffered severe injuries at Lyn's hands. When Torbin stopped the fight by cleaving off Lyn's arm, Tremayne moved in for the kill, but the Grand Inquisitor decided that Palpatine may have a use for the ancient warrior. Tremayne, however, would not quickly forget Lyn and the damage she caused him.\nTremayne was eventually promoted to the lofty position of High Inquisitor, and was rumored to be one of the Emperor's Hands. In fact, he was only answerable to Grand Inquisitors, the most respected of Palpatine's advisers, Palpatine himself, and of course his master, Darth Vader. Since his loss to Lo'gaan on the slave ship in years prior, Tremayne developed his lightsaber skills to a degree that he thought supreme. He became feared in the Outer Rim Territories, and grew a reputation for being a master torturer. However, Imperial Intelligence were generally adept at interrogation, so Tremayne spent most of his time searching for potential Dark Side Adepts. He found them in isolated communities, in the form of village shamans and dark side devotees. Tremayne also had no qualms about recruiting alien Force-sensitives to his cause. His repeated successes at this time caused him to believe that he would one day ascend to the position of Grand Inquisitor.\nWhile some Jedi were incorruptible, there were those who could be bent to the Emperor's will. One such candidate was Jerec, a Miralukan Jedi Master who had taken a sabbatical to the Unknown Regions during the Clone Wars, on a hunt for ancient Jedi artifacts. Tremayne found him there, and instead of killing the Jedi, extended an offer to him, claiming that if Jerec joined the Inquisitorius, he would surely survive through Palpatine's New Order. Jerec did not care enough for the Jedi ideals to adhere to them at the cost of his life, and willingly accepted Tremayne's offer. Another of Tremayne's discoveries that would rise to prominence in the New Order was the Firrerreo Hethrir, and his mate Rillao. Upon finding the pair, he tortured them, hoping to extract information as to the location of Jedi fugitives. However, they were not Jedi, and had no affiliation with them whatsoever. Believing that the pair would make for suitable Dark Side Adepts, Tremayne took them to his master for training. In time, he would develop a rivalry with fellow apprentice Hethrir.\nSeveral years after the failed hunt for Lo'gaan, before 10 BBY, Tremayne found a new Jedi to obsess over: Corwin Shelvay, who was also known to have had associations with those resistant to the New Order. Before he could get to Shelvay, he murdered the Jedi's parents, and took his sister, Elena, forcing her to join COMPNOR. When he was finally captured, Corwin Shelvay went through full COMPNOR and Intelligence interrogations, before being transferred to the Inquisitor. By this time, Tremayne had been able to break every prisoner he had captured, but Shelvay proved to be the exception, resisting violent and brutal torture for two weeks. Before Tremayne had the opportunity to interrogate Shelvay further, the Jedi's master, Darrin Arkanian, saved Shelvay and escaped, planning to find passage off Imperial Center with Captain Rashh.\nWhen Tremayne learned of Shelvay's escape, he gathered a squad of troops, and set off after the fugitives. Luckily for Tremayne, his torturing methods had damaged Shelvay to such a stage where his master had to carry him through the city, impeding their progress greatly. Tremayne caught up with them in a courtyard just near their point of departure, and revealed himself. Arkanian strode forward boldly to meet Tremayne, but Shelvay grew weak at the Inquisitor's presence, and his legs buckled underneath him. Tremayne took the opportunity, and lashed out at Arkanian with his green lightsaber. A fierce and high-speed duel ensued, with Tremayne mocking the Sullustan Jedi, and Arkanian repaying in kind.\nTremayne's troopers revealed themselves, and the Inquisitor, tiring of the duel, threatened to have Shelvay killed if Arkanian did not surrender. The Sullustan relented, and deactivated his lightsaber, in the hope that Tremayne would free Shelvay. The Inquisitor did no such thing, however, and dissected the Jedi Master before Shelvay's eyes. Tremayne gloated over the corpse of Arkanian, as it was the first Jedi Master he had ever killed. Shelvay's reaction, however, was significantly more violent. The young Padawan, touching the dark side of the Force, took up his master's blade and engaged Tremayne with a vengeance. The High Inquisitor found himself hard pressed to defend himself, and did not anticipate Shelvay's unorthodox attack. As a result, he lost his arm and his eye, all of which were on the right side of his body, to the young Jedi's blade.\nTremayne woke in a medical ward to find himself with a new prosthetic arm and eye. The droids revealed that his master, Lord Vader, had selected particularly cumbersome and unattractive prosthetics, hoping that he could curb the Inquisitor's ego. As Tremayne fumed over the fact that he had been bested by a Padawan, Vader strode in, and chastised Tremayne for his failure. His only consolation being the death of Arkanian, Tremayne vowed to find Shelvay and break him. For the time being, however, he was content in the knowledge that his dark side knowledge would have increased by the next time they met. He would also use the cumbersome cybernetics to his advantage, as they instilled fear in onlookers. With the advent of the Alliance to Restore the Republic, and Shelvay's known ties to them, Tremayne once again resumed his hunt, using the Star Destroyer Inquisitor.\nSometime before the Battle of Yavin, Tremayne came across a Force-sensitive slave, by the name of Leesub Sirln. Sirln, a Qiraash, was selected by the Inquisitor to serve the Empire as a Force Adept. However, Sirln fled Tremayne's custody, and hid on Tatooine, leaving the Inquisitor empty-handed. Following the Battle of Yavin, Tremayne was given command of the Imperial II-class Star Destroyer Interrogator. He also gained the life debt of the Srrors'tok Ahnjai Rahmma, who served the High Inquisitor as a bodyguard. Rahmma detested Tremayne and the Empire, but his people's culture dictated that he must fulfill the life debt until either his or Tremayne's death. Tremayne, in turn, treated Rahmma poorly, mocking him in front of colleagues, and dispatching him on dangerous assassination work. At this stage, Tremayne was respected by enemies and allies alike as one of the most powerful active Inquisitors.\nDuring the war, Tremayne devised a new set of incarceration documents, dubbed Legal Authorization for Advanced Confinement Documents, or \"LAACDocs.\" These documents allowed Imperial staff to use any methods necessary to detain prisoners wanted by High Inquisitors. No proof or evidence was needed when using a LAACDoc, and Moffs, Generals, and Prefects alike could detain whoever they chose until an Inquisitor arrived to interrogate. Vader backed Tremayne's new movement, but the LAACDocs were soon derided by those forced to fill them out.\nWhile Tremayne often derided his master's tactics and modus operandi, he did mimic Vader's command style. He did not tolerate failure or tardiness aboard the Interrogator, and executed officers who failed to do their duty to perfection. He went through captains regularly, and upon executing Captain Nolaan, he systematically went through eliminating all who had considered Nolaan a friend, save for Jovan Vharing. Vharing took Nolaan's place as captain, but during an expedition through the stretch of space known as the Nharqis'I, an error in judgment occurred. Lieutenant Leeds intercepted what he thought to be a Rebel transmission while Vharing slept, and dispatched TIE Bombers from the Interrogator to destroy the source at Qlothos.\nHowever, Qlothos's atmosphere played havoc with the TIE Bombers' missiles, resulting in the deaths of over sixty Imperial citizens planetside. Tremayne, upon hearing this, had Captain Vharing summoned to his \"interview\" room. He let Vharing wait outside the room for a prolonged amount of time, feeding off the captain's fear. After three hours, Tremayne opened the door, and cracked Vharing's neck, killing him and letting him serve as an example to other supposedly incompetent officers.\nSeveral years later, Grand Admiral Demetrius Zaarin attempted a coup d'etat, and abducted Emperor Palpatine over Imperial Center, with the help of former Emperor's Hand Arden Lyn. Tremayne aided Lord Vader and Maarek Stele in foiling the attempt, and while Grand Admiral Thrawn was tasked with hunting Zaarin, Tremayne was given the task of tracking Lyn. The Inquisitor was still resentful over the sound beating he had received from Lyn years before, but he was unable to apprehend or kill her.\nWhen fellow Inquisitor Adalric Brandl turned rogue and deserted the Empire, Tremayne was tasked with capturing him. He was able to catch up to Brandl, and inflicted a wound on the fugitive's hand, but Brandl fought back, forcing Tremayne to disengage, enabling him to escape to Najiba. Shortly after this, Brandl was captured by Admiral Etnam's flagship. Etnam contacted Tremayne, who was looking forward to \"interviewing\" Brandl, angry that he had failed to stop the traitor and seeking retribution for what he thought was a stain on his record. The High Inquisitor rushed in the Interrogator to rendezvous with the Admiral. However, Brandl was able to trick Etnam, and feigned his own death before Tremayne could arrive.\nNow the Procurator of Justice, Hethrir formed the Empire Reborn in 4 ABY following the Emperor's first death at Endor. As the Procurator drew powerful allies into his splinter faction during the power vacuum left by Palpatine, Tremayne saw fit to aid his former rival's efforts. He allied with Hethrir, but kept his involvement with the organization a secret. In 12 ABY, he revealed the existence of the Valley of the Jedi to the Procurator. Hethrir, with his curiosity piqued, assigned his other ally, Desann to locate and exploit the valley. Desann's efforts, however, were foiled by New Republic agent Kyle Katarn.\nOne of the traits that Tremayne was constantly reprimanded for, by both his masters, was his vanity. Master Kylanu detested it, and attempted to curb it without result. Lord Vader, however, took a more direct approach, inflicting violence on Tremayne when the Inquisitor would grow too overconfident. Tremayne's vanity would be his downfall when fighting Shelvay on Imperial Center, since he was confident that he could easily anticipate the Padawan's dueling moves. When he lost his arm and eye as a result of this, Vader personally selected unwieldy replacements, to constantly remind Tremayne of his vanity and overconfidence. Tremayne's passion, however, would serve him well from time to time, as it gained him admission into the Inquisitorius in the first place.\nTremayne was known to develop obsessions, at first in the case of Drake Lo'gaan. He chased Lo'gaan, a far younger man than he was, for several months, and even disregarded the chance of finding more Jedi fugitives on far-flung worlds in favor of hunting the young Padawan. He eventually grew too emotionally involved in the case, which displeased his master greatly. He also tried to hide his hunt from Vader, to no avail. When the prospect of capturing fugitive Jedi Corwin Shelvay came about, Tremayne once again found himself obsessed, to a point where he even had Shelvay's parents executed, and his sister captured. When Shelvay proved to be one of the few to resist Tremayne's \"interview\" technique, and escaped Imperial Center, Tremayne initially was satisfied with the fact that he would have grown in the Force by their next meeting, but he eventually devoted himself to finding the fugitive Jedi.\nTremayne hated failure, and was quick to punish it. In his command of the Interrogator, he went through commanders at an astonishing rate, executing officers for the most minute slip-up, and sometimes killing the wrong man. He would even execute those known to have associated with the offending officer, resulting in mass courts-martial, and subsequently, mass promotions. When Tremayne himself failed, he always clamored to hide it from his master, and would not hesitate to shift blame onto others. Vader himself would punish Tremayne for failure, inspiring the Inquisitor to be more mindful in the future.\nA cowardly streak ran through Tremayne, however: he struck down the unarmed Master Arkanian in cold blood, had innocent members of the Shelvay family executed for no good reason other than to get to Corwin Shelvay, ordered troops to fire on unarmed slaves, and even developed doctrines that allowed for the spontaneous arrest of innocent citizens. He would often use the unarmed and innocent as bait in traps, and would summarily execute officers through, slow, painful asphyxiation.\nThe High Inquisitor believed in the Empire he served, and would sometimes give voice to his patriotic attitude. He believed that the Death Stars represented the strongest elements Palpatine's policies, and that the Destruction of Alderaan was offset by the destruction of both superweapons.\nDespite his shortcomings, Tremayne was considered to be a handsome individual, with a polite and courteous attitude. His victims, if given the chance, regarded him as a \"friend,\" which helped Tremayne extract information from them. He used the cumbersome cybernetics chosen for him by Vader to instill fear into his enemies, and would often use his booming voice to great effect. Despite this, he was usually a calm and softly spoken individual.\nInitially, Tremayne's biggest asset was his ability to seize opportunities, rather than his actual ability with the Force. While he was able to defeat his fellow Inquisitors in combat, he had trouble facing down Drake Lo'gaan on the Byss-bound slave ship. He also suffered a humiliating defeat at the hands of Arden Lyn. Over the following years, Tremayne would hone his saber skills, until he thought himself to be highly adept. His skills would serve him well against Darrin Arkanian, but would once again fail him when dueling Corwin Shelvay.\nTremayne's most capitalized skill was the ability to extract information from prisoners. Imperial Intelligence and COMPNOR were usually effective enough to deal with prisoners themselves, but in special cases they handed their quarries over to the Inquisitorius, and in particular, Tremayne. Moving away from the more frank and brutal interrogation style of his master, Tremayne was a subtle interrogator, often probing at his victims minds before beginning interrogation. He would then become the victim's \"friend,\" and engage them in mild conversation, loosening their tongues and allowing him to extract the pertinent information. Failing that, he would move onto more \"persuasive\" methods, which would usually kill, or grievously wound the subject. Tremayne's skills were infamous, and very few were able to resist him.\nTremayne was also skilled at converting possible adepts to the cause of the Inquisitorius, and though he did not always succeed, his gains made up for his failures. He was able to locate Force-sensitives in the most obscure locations, even plucking Jerec from the Unknown Regions. He would never pass up an opportunity to convert someone, and would always make joining the Inquisitorius look like an attractive option to the subject. He was frequently forced to resort to violence, however.\nTremayne could speak the Sith language.\nThe character of High Inquisitor Tremayne was created in 1993 by Simon Smith and Eric S. Trautmann, as an NPC villain in Star Wars: The Roleplaying Game. He first appeared in the supplement book, Galaxy Guide 9: Fragments from the Rim, and was mentioned in passing in the subsequent book, Galaxy Guide 10: Bounty Hunters. In 1995, during the initial planning stages for The DarkStryder Campaign, Tremayne was considered for use as an adversary in the series. However, his inclusion was cancelled since the character of Kaiya Adrimetrum, the main character and captain of the New Republic vessel FarStar, had made her first appearance in the same book as Tremayne—Galaxy Guide 9: Fragments from the Rim. This information would be revealed in a \"Behind-the-scenes\" section in 1996's Endgame, the final book of the DarkStryder series. The character's first appearance came in 1996, when he was used as a focal character in Patricia A. Jackson's Star Wars Adventure Journal short story, The Longest Fall. Later that same year, a scenario mentioned in Galaxy Guide 9 would be elaborated upon by Eric S. Trautmann in Dark Vendetta.\nDark Vendetta featured Tremayne as the central character, and it provided elements of a backstory for the High Inquisitor. It also featured a physical portrayal of Tremayne that conflicted with his description in Galaxy Guide 9 as a \"slender Human.\" With the advent of the prequels in 1999, the details of Tremayne's past suddenly conflicted with elements introduced by George Lucas in Star Wars: Episode I The Phantom Menace, such as the timeline of Palpatine's ascension to Emperor, the Great Jedi Purge, and Anakin Skywalker's transformation into Darth Vader. Dark Vendetta claims that Palpatine had ascended to the position of Emperor while the Jedi Order was still active, and that \"Darth Vader\" was also in existence at this time. Star Wars: Episode III Revenge of the Sith, however, shows that the destruction of the Jedi Order was simultaneous with Palpatine's ascension. These would be reconciled by Paul Ens, who would use Tremayne in his 2005-2006 webstrip series, Evasive Action, as the primary antagonist. Ens also gave the character the first name of \"Antinnis.\" Despite the reconciliations, several statements in Dark Vendetta still clash with Evasive Action: Recruitment. Dark Vendetta shows Tremayne experiencing a flashback, wherein Vader gradually recruits him to the cause of the Empire, whereas Recruitment shows that the conversion was almost immediate.\nTremayne was also referenced in Emanations of Darkness, another Jackson short story, which, due to the cancellation of Adventure Journal, has not been canonically published.\nBrandl, following the incident over Trulalis, turned himself in to the Empire, after a failed attempt at training Fable Astin. However, instead of presenting Astin to the Emperor as a gift, he offered his son instead. Jaalib Brandl was handed over to Tremayne for instruction, which angered Brandl. The former Jedi hated Tremayne, and the High Inquisitor had mutual feelings for Brandl. Tremayne took his hatred of Brandl out on Jaalib in a variety of ways, and although the High Inquisitor never fully converted Jaalib to the dark side, the young Jedi would eventually fall several years later.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Matta_Tremayne",
  "/wiki/Rolund_Tremaine",
  "/wiki/Rhondi_Tremaine",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Empire_Reborn",
  "/wiki/Dav_Kylanu",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Vialco",
  "/wiki/Cyborg/Legends",
  "/wiki/High_Inquisitor",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Byss/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Drake_Lo%27gaan/Legends",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/Corwin_Shelvay/Legends",
  "/wiki/Darrin_Arkanian",
  "/wiki/Interrogator/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Dark_Side_Adept",
  "/wiki/Hethrir",
  "/wiki/Procurator_of_Justice",
  "/wiki/New_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Palpatine/Legends",
  "/wiki/Deep_Core/Legends",
  "/wiki/Sly_Moore/Legends",
  "/wiki/Agricultural_Corps/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Gwellib_Ap-Llewff",
  "/wiki/Lanu_Pasiq",
  "/wiki/Halmere",
  "/wiki/Jrade_District/Legends",
  "/wiki/Sub-Adult_Group/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Ash_Lynn",
  "/wiki/Bray_Kopedon",
  "/wiki/Stormtrooper/Legends",
  "/wiki/DN6-4435",
  "/wiki/Transport/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Emperor%27s_Citadel",
  "/wiki/Zonder/Legends",
  "/wiki/Selonian/Legends",
  "/wiki/Ekria/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Onnelly_Praji",
  "/wiki/Galactic_City",
  "/wiki/Zeltron/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Niebur_Boton",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Armand_Isard/Legends",
  "/wiki/Imperial_Intelligence_Headquarters_(Coruscant)",
  "/wiki/Omwati/Legends",
  "/wiki/Boushh/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Kodo_Finn",
  "/wiki/Prince/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Falleen/Legends",
  "/wiki/Orman_Tagge/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Commander/Legends",
  "/wiki/CC-5052/Legends",
  "/wiki/Felucia/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Low_Altitude_Assault_Transport/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Landing_platform_NL1922",
  "/wiki/Tepasi/Legends",
  "/wiki/Noghri/Legends",
  "/wiki/Ameesa_Darys",
  "/wiki/Grand_Inquisitor/Legends",
  "/wiki/Laddinare_Torbin",
  "/wiki/Arden_Lyn",
  "/wiki/Ter%C3%A4s_K%C3%A4si/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Jerec_(Inquisitor)",
  "/wiki/Miraluka/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Firrerreo/Legends",
  "/wiki/Rillao",
  "/wiki/10_BBY/Legends",
  "/wiki/Elena_Shelvay",
  "/wiki/Captain/Legends",
  "/wiki/Rashh",
  "/wiki/Sullustan/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Inquisitor_(Star_Destroyer)",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Leesub_Sirln/Legends",
  "/wiki/Qiraash/Legends",
  "/wiki/Force_Adept",
  "/wiki/Tatooine/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Srrors%27tok",
  "/wiki/Ahnjai_Rahmma",
  "/wiki/Legal_Authorization_for_Advanced_Confinement_Document",
  "/wiki/Moff/Legends",
  "/wiki/General/Legends",
  "/wiki/Imperial_Prefect",
  "/wiki/Nolaan",
  "/wiki/Jovan_Vharing",
  "/wiki/Nharqis%27I",
  "/wiki/Lieutenant/Legends",
  "/wiki/Leeds",
  "/wiki/TIE/sa_bomber/Legends",
  "/wiki/Qlothos",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Demetrius_Zaarin",
  "/wiki/Maarek_Stele/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Adalric_Cessius_Brandl",
  "/wiki/Najiba/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Etnam",
  "/wiki/Flagship/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/14_ABY/Legends",
  "/wiki/Endor/Legends",
  "/wiki/12_ABY/Legends",
  "/wiki/Valley_of_the_Jedi",
  "/wiki/Desann",
  "/wiki/Kyle_Katarn",
  "/wiki/Sith_(language)",
  "/wiki/1993",
  "/wiki/Simon_Smith",
  "/wiki/Eric_S._Trautmann",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim",
  "/wiki/Galaxy_Guide_10:_Bounty_Hunters",
  "/wiki/1995",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/Kaiya_Adrimetrum",
  "/wiki/FarStar",
  "/wiki/1996",
  "/wiki/Endgame",
  "/wiki/Patricia_A._Jackson",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Longest_Fall",
  "/wiki/Dark_Vendetta_(short_story)",
  "/wiki/Prequel_trilogy",
  "/wiki/1999",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Paul_Ens",
  "/wiki/2005",
  "/wiki/2006",
  "/wiki/Webstrips",
  "/wiki/Evasive_Action",
  "/wiki/Emanations_of_Darkness",
  "/wiki/Trulalis",
  "/wiki/Fable_Astin/Legends",
  "/wiki/Jaalib_Brandl",
  "/wiki/Evasive_Action:_Recruitment",
  "/wiki/Evasive_Action:_Prey",
  "/wiki/Evasive_Action:_End_Game",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Star_Wars_Galaxy_Magazine_8",
  "/wiki/The_Final_Exit",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/West_End_Games",
  "/wiki/The_Best_of_the_Star_Wars_Adventure_Journal,_Issues_1-4",
  "/wiki/Graveyard_of_Alderaan",
  "/wiki/Classic_Adventures:_Volume_Two",
  "/wiki/Star_Wars_Adventure_Journal_11",
  "/wiki/Two_for_One",
  "/wiki/Star_Wars_Adventure_Journal_15",
  "/wiki/Star_Wars:_Empire_at_War",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Premiere_Limited",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Uhl_Eharl_Khoehng_(short_story)",
  "/wiki/Star_Wars_Adventure_Journal_8",
  "/wiki/Star_Wars:_The_Roleplaying_Game,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_Trilogy_Sourcebook,_Special_Edition",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Droids",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Emperor%27s_Pawns",
  "/wiki/Star_Wars_Gamer_5",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Droids,_Technology_and_the_Force:_A_Clash_of_Phenomena_(article)",
  "/wiki/StarWars.com",
  "/wiki/Wizards.com",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/The_New_Essential_Guide_to_Droids",
  "/wiki/Star_Wars_Roleplaying_Game_Saga_Edition_Core_Rulebook",
  "/wiki/Star_Wars_Insider",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_92",
  "/wiki/Aliens_in_the_Empire",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Rebellion_Era_Campaign_Guide",
  "/wiki/Galaxy_at_War",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/Evasive_Maneuvers",
  "/wiki/Star_Wars_Galaxy_Magazine_7"
 ]
}