{
 "name": "Antoc_Merrick",
 "display_name": "Antoc Merrick",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Virujansi"
     ]
    },
    {
     "name": "Born",
     "values": [
      "46 BBY",
      "Virujansi"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Scarif"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.82 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blondish-brown",
      "also graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Virujansi Rarified Air Cavalry",
      "Alliance to Restore the Republic",
      "Rebel Alliance Starfighter Command",
      "Blue Squadron",
      "Rebel Alliance Starfighter Command",
      "Blue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Antoc Merrick was a human male ace pilot who served as a General in the Alliance to Restore the Republic. Around 0 BBY, General Merrick participated in the Alliance's acquisition of the Galactic Empire's plans to their ultimate weapon, the Death Star, in the Battle of Scarif. During the battle, Merrick flew as Blue Squadron leader in a T-65B X-wing starfighter until he was shot down and killed by a TIE Striker.\nAntoc Merrick was born in 46 BBY on Virujansi. Prior to the outbreak of the Galactic Civil War, Merrick served as the flight leader of his homeworld's planetary defense forces, which was known as the Virujansi Rarified Air Cavalry.\nAfter the formation of the Galactic Empire, Virujansi underwent political transformation when an Imperial governor displaced the ruling Virujansi council. Local military forces loyal to the old regime were effectively disbanded, and the pilots of the Air Cavalry were extended invitations to join the Imperial Navy. Merrick rejected. He viewed the offer as hollow and the Empire's TIE forces as unimaginative compared to the Rebel Alliance's starfighter squadrons, which demonstrated greater unit coherence and piloting ability. Alongside friend and fellow pilot Garven Dreis, Merrick instead opted for early retirement, left Virujansi, and sought out membership with the Rebel Alliance.\nSometime after joining the Rebel Alliance, Merrick earned the rank of General, and was made Commander of Rebel Alliance Starfighter Command. Merrick was in command of all starfighter squadrons at the Rebel's base on Dantooine, and then later on at Base One on Yavin 4. Under the callsign Blue Leader, Merrick personally led Blue Squadron, with Barion Raner as the squadron's second-in-command. When the entirety of the Massassi starfighter squadrons were scrambled, Merrick had authority over all other squadron leaders. In Merrick's absence, or when operational authority was better served from a ground-based dispatch, General Jan Dodonna commanded the fleet.\nServing on the Alliance High Command allowed Merrick to play an essential and influential role in the early rebellion. He contributed in the decisions to cycle the U-wing out of escort duty, and use X-wings as the backbone of Starfighter Command. Their hardware and handling was much like a bush hopper from Virujansi, Merrick's homeworld. Neither Merrick nor Garven Dreis would fly anything but the X-wings in combat.\nMerrick sent multiple reports to Mon Mothma discussing the uses and details of ships both within the rebellion and those they fought against. In one, Merrick reported the use of UT-60D U-wing starfighter/support craft as a troop transport on Mantooine in the Atrivis sector. In another, Merrick compiled all information from Rebel Intelligence on the differing models of the TIE line the rebellion faced, including Grand Admiral Thrawn's TIE Defender.\nGeneral Antoc Merrick worried that General Davits Draven was too pragmatic and thus likely to forget the human variables when making his cold calculations. As an intelligence chief, Draven commanded a staff, but those who reported to him were normally lone operators, in contrast to Merrick's squadrons of pilots who committed themselves to cooperation and unit cohesion.\nDuring his time as Commander of Rebel Alliance Starfighter Command and Blue Squadron, Merrick gave a speech at the Great Temple in which he addressed the U-wing pilots. Understanding they were often overlooked yet vital assets to the rebellion, Merrick pledged his support and expressed his admiration for them, stating that he assigned them specifically to U-wings as he knew they were all above the boasting of \"hot shot\" X-wing pilots. He also stated that this praise did not come from High Command, but from his heart. Merrick humbly considered himself a pilot more than a commanding officer.\nMerrick refused to risk lives needlessly, as he cared deeply for those under his command. Having logged hundreds of hours at the controls of a U-wing, he knew from experience the pilots bore extra responsibility and felt particularly protective of them.\nIn 0 BBY, during Operation Fracture, a secret operation made to extract scientist Galen Walton Erso so he could testify to the Imperial Senate regarding the existence of a planet-destroying superweapon called the Death Star under construction by the Empire, the Alliance rescued Galen's daughter, Jyn Erso, so that they could make contact with Saw Gerrera's Partisians and question Imperial defector, Bodhi Rook, about the Death Star and Galen's location. Merrick was present during Erso's interrogation in the Masassi base, during which she ultimately agreed to the Alliance's demands, and she, Captain Cassian Jeron Andor, and K-2SO set off for Jedha City.\nFollowing the return of Andor's team to the Massassi base, Organa gathered with other key members of the Alliance to discuss the findings of their mission. Jyn had convinced Saw to show her her father's message, which detailed the superweapon's destructive power, as well as a weakness that Galen had deliberately set in the station. He also explained that a copy of the weapon's technical readouts was kept in the Citadel Tower on Scarif. Jyn, however, was unable to deliver the holographic recording to the Alliance due to the destruction of Jedha City. During the meeting, however, several members of the Alliance dismissed Jyn's testimony, and Merrick asserted that Empire had the means of mass destruction while the Alliance did not. In spite of Jyn's best efforts, the Alliance refused to send troops to Scarif.\nDespite being denied permission to attack the Imperial base at Scarif, Erso, Andor, and their crew disobeyed the Alliance's orders and formed the Rogue One squad, heading to Scarif to retrieve the Death Star plans. Before long, a technician rushed to inform Mon Mothma of Rogue One's actions, but was stopped by Merrick in front of the former senator. Mothma, however, told Merrick to let him speak, and when the technician revealed that Admiral Raddus was going to fight, Blue Squadron, along with the entire starfighter wing at Base One, scrambled to provide assistance. Blue Squadron entered combat above Scarif in conjunction with the Rebel Fleet led by Admiral Raddus. Merrick then led Blue Squadron's X-wings and U-wings through the Shield Gate to provide air support to the pathfinders on Scarif's surface. Blue Squadron proceeded to destroy several AT-ACTs that had been harassing rebel forces. However, in the ensuing battle, Merrick was shot down by a TIE striker, resulting in his death.\nQuadruple ace Merrick logged 22,542 flight hours, with twenty-four confirmed kills.\nHuman male Antoc Merrick had light skin, steel-blue eyes and blondish-brown hair.\nDespite having logged hundreds of hours at the controls of a U-wing, Merrick's preferred craft when leading a squadron was Blue One, his T-65B X-wing starfighter. Merrick was experienced, and had a talent for leadership, though he believed himself not one for speeches.\nMerrick felt particularly protective of the U-wing pilots, and cared deeply for all under his command. He deferred to Colonel Cor for day-to-day decisions, but Cor treated the fighter resources as mere assets, whilst Merrick refused to risk lives needlessly.\nAs a pilot of the Rebel Alliance, Antoc Merrick wore a blue flight suit with a white, gray, blue and yellow helmet. He operated a T-65B X-wing starfighter known as Blue One, manufactured by the Incom Corporation.\nAntoc Merrick, portrayed by Ben Daniels, is a character created for Rogue One: A Star Wars Story, the first installment in the Star Wars Anthology Series, which was released on December 16, 2016. The first footage of Merrick was revealed in the Celebration Europe reel on July 15, 2016. His name was revealed on October 15, 2016 by Entertainment Weekly in an exclusive trading card from Star Wars: Card Trader.\nOn page 170 of the 2016 reference book Star Wars: Rogue One: The Ultimate Visual Guide, Merrick was erroneously referred to as Davits Draven.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Merrick",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Special:Upload",
  "/wiki/Virujansi",
  "/wiki/46_BBY",
  "/wiki/0_BBY",
  "/wiki/Scarif",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Virujansi_Rarified_Air_Cavalry",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Starfighter_Command",
  "/wiki/Blue_Squadron_(Rebel_Alliance)",
  "/wiki/Poe_Dameron",
  "/wiki/The_Rebel_Files",
  "/wiki/Ace",
  "/wiki/Rebel_pilot",
  "/wiki/General",
  "/wiki/Galactic_Empire",
  "/wiki/Death_Star_plans",
  "/wiki/Superweapon",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Scarif",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/TIE/sk_x1_experimental_air_superiority_fighter",
  "/wiki/Reproduction",
  "/wiki/Galactic_Civil_War",
  "/wiki/Flight_Leader",
  "/wiki/Homeworld",
  "/wiki/Planetary_defense_forces",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Governor",
  "/wiki/Virujansi_council",
  "/wiki/Pilot",
  "/wiki/Imperial_Navy",
  "/wiki/TIE_line",
  "/wiki/Starfighter",
  "/wiki/Squadron",
  "/wiki/Garven_Dreis",
  "/wiki/Military_rank",
  "/wiki/Commander",
  "/wiki/Starfighter_Command",
  "/wiki/Dantooine",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Blue_Leader",
  "/wiki/Barion_Raner",
  "/wiki/Massassi",
  "/wiki/Jan_Dodonna",
  "/wiki/Alliance_High_Command",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/X-wing_starfighter",
  "/wiki/Mon_Mothma",
  "/wiki/Mantooine",
  "/wiki/Atrivis_sector",
  "/wiki/Rebel_Alliance_Intelligence_Service",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Davits_Draven",
  "/wiki/Chief",
  "/wiki/Color",
  "/wiki/Operation_Fracture",
  "/wiki/Scientist",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Jyn_Erso",
  "/wiki/Saw_Gerrera",
  "/wiki/Bodhi_Rook",
  "/wiki/Captain",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/K-2SO",
  "/wiki/Jedha_City",
  "/wiki/Citadel_Tower",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/Rogue_One",
  "/wiki/Squad",
  "/wiki/Raddus",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Admiral",
  "/wiki/Shield_Gate",
  "/wiki/Special_Forces_Trackers_Unit",
  "/wiki/All_Terrain_Armored_Cargo_Transport",
  "/wiki/Alliance_Military",
  "/wiki/Death",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Blue_One",
  "/wiki/Bandwin_Cor",
  "/wiki/Flight_suit",
  "/wiki/Flight_helmet",
  "/wiki/Incom_Corporation",
  "/wiki/Ben_Daniels",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/December_16",
  "/wiki/2016",
  "/wiki/Celebration_Europe_(2016)",
  "/wiki/July_15",
  "/wiki/October_15",
  "/wiki/Entertainment_Weekly",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Category:Images_of_Antoc_Merrick",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Duty_Roster",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Grounded",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Rebel_Starfighters_Owners%27_Workshop_Manual",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_10",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_25",
  "/wiki/Star_Wars_Insider",
  "/wiki/Unsung_Heroes",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Databank_(website)",
  "/wiki/Ultimate_Star_Wars"
 ]
}