{
 "name": "Anvar Keyis",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Anvar Keyis was a Human businessman who lived during the Galactic Civil War.\nFollowing the Battle of Yavin, Anvar Keyis resided aboard Tansarii Point Station, in the Bright Jewel system. During that time, the man was the manager of the station's cantina. He also was a friend of Mira T'rani, the most renowned entertainer on the station.\nIn 1 ABY, Anvar Keyis was very concerned about the low attendance in the cantina. Due to troubles on Tansarii Point Station, including a war with the Rak'qua of the neighboring Station Gamma, few people were still patronizing the cantina. Keyis wanted to change this situation and sought for new entertainers in order to perform in the cantina. Around the same time, a spacer arrived on Tansarii Point Station and encountered Mira T'rani. Since the spacer was an entertainer, Mira proposed her to work for Keyis. Anvar was indeed very pleased to greet the spacer and paid her to dance in the cantina. Fortunately, the spacer was very skilled and her performances were very successful, bringing more customers to the cantina. The successful spacer eventually left Anvar Keyis and returned to Mira in order to perform other kinds of work.\nAnvar Keyis appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Anvar Keyis was added to the game as part of the \"New Player Tutorial\", introduced with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005. In the game, Anvar Keyis used to wear the same outfit than Imperial Inquisitors.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mira_T%27rani",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/Entertainer",
  "/wiki/1_ABY/Legends",
  "/wiki/Rak%27qua",
  "/wiki/Station_Gamma",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}