{
 "name": "Anya  (Serenno)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Serenno"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 82 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Serenno"
     ]
    }
   ]
  }
 ],
 "content": "Anya was a Serennian female, the lady of House Serenno, and the wife of Count Gora during the reign of the Galactic Republic. As consort to the Count of Serenno, Anya held the title of Countess. She was the mother of Jenza and Ramil, as well as the Force-sensitive Dooku who joined the Jedi Order. She would eventually die and be buried at the Serenno family mausoleum on the moon Mantero.\nSometime prior to 102 BBY, Anya was married to Count Gora of Serenno and bore him a son, Ramil. In 102 BBY, she gave birth to a second son named Dooku, however the boy soon showed signs of Force-sensitivity which frightened her husband. On Gora's orders, the infant Dooku was left to the elements on the edge of a forest, where he was found by a Jedi seeker and taken in by the Order. Anya would go on to have a third child, a daughter named Jenza.\nIn 90 BBY, Serenno played host to a festival held in the planetary capital of Carannia, designed to advertise what Outer Rim planets could offer to the Galactic Republic. Anya attended the event with her husband and children, but Gora proved to be dismissive of the affair, cynically viewing it as a waste of time. Unhappy with her husband's attitude, Anya instructed the family's protocol droid, D-4, to look after Ramil and Jenza as they went off to explore the festival.\nHowever, unbeknownst to her and Gora, their other son, Dooku, was also present with members of the Jedi Order from Coruscant. Dooku ran into both Jenza and Ramil during the celebrations, striking up a connection with Jenza in particular that would last for much of the rest of his life. However, Anya did not get the chance to see her long-lost son before he was forced to leave the planet by his enraged father.\nAnya died suddenly in around 82 BBY. On her passing, Jenza invited Dooku to her funeral on Serenno's moon of Mantero. Despite being forbidden by the Jedi Council, Dooku travelled with Master Lene Kostana and his close friend, Sifo-Dyas, to Mantero to attend the burial. His presence enraged Gora who verbally assaulted him, however the funeral was also marred by protests from Serenno's citizens who were unhappy with Gora's rule over them and the inequality in their society. In his attempts to prevent a clash between Gora's security droids and the protestors, Dooku's use of the Force not only scattered the crowds but disturbed Anya's body, which led to Gora physically attacking him. This altercation led to Dooku's relationship with Jenza becoming strained for a time.\nLater, when experiencing the Dark Side on the planet Asusto, Dooku heard Anya's voice in his head as he struggled to cope with it. Ultimately, Anya's second son would go on to leave the Jedi Order and become Count of Serenno himself, killing Ramil in the process. Years after that, Dooku would also execute his other sibling after finally falling to the Dark Side and joining the Sith.\nAnya was unlike her husband in that she showed genuine care for their children. Nevertheless, she was content to leave practical responsibility for them in the hands of the family protocol droid. She did not share her husband's cynicism towards the celebrations held at Carannia and scolded Gora for displaying his attitude in front of Ramil and Jenza. She seems to have had little affection for Gora, pointedly noting his bad temper and rudeness. On her death, Jenza would remember her as a compassionate woman who worked to better the lives of Serenno's ordinary citizens. \nAnya appeared in the audiobook Dooku: Jedi Lost, written by Cavan Scott and published in 2019.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Anya",
  "/wiki/Serenno",
  "/wiki/82_BBY",
  "/wiki/Human",
  "/wiki/Serennian",
  "/wiki/Gender",
  "/wiki/House_Serenno",
  "/wiki/Marriage",
  "/wiki/Count",
  "/wiki/Gora",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Count_of_Serenno",
  "/wiki/Parent",
  "/wiki/Jenza",
  "/wiki/Ramil",
  "/wiki/Force-sensitive",
  "/wiki/Dooku",
  "/wiki/Jedi_Order",
  "/wiki/Death",
  "/wiki/Serenno_Mausoleum",
  "/wiki/Mantero",
  "/wiki/102_BBY",
  "/wiki/Jedi_seeker",
  "/wiki/90_BBY",
  "/wiki/Carannia",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Protocol_droid",
  "/wiki/D-4",
  "/wiki/Coruscant",
  "/wiki/Funeral",
  "/wiki/Jedi_Council",
  "/wiki/Jedi_Master",
  "/wiki/Lene_Kostana",
  "/wiki/Sifo-Dyas",
  "/wiki/Security_droid",
  "/wiki/The_Force",
  "/wiki/Mission_to_Asusto",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Asusto",
  "/wiki/Sith",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Anya_(Serenno)",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Cavan_Scott",
  "/wiki/2019",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Time",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Geonosis",
  "/wiki/22_BBY",
  "/wiki/Reproduction"
 ]
}