{
 "name": "AP-1982",
 "display_name": "AP-1982",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gideon's Imperial remnant"
     ]
    }
   ]
  }
 ],
 "content": "AP-1982 was a human male scout trooper who served in an Imperial remnant led by Moff Gideon during the New Republic Era. Around 9 ABY, he guarded the entrance to Nevarro's city alongside JS-1975, another scout trooper, after Gideon's forces drove the city's residents away. After hearing a communication from Din Djarin, the troopers took off and secured Grogu, whom Gideon wished to acquire. Arriving at the city's outskirts, they awaited for confirmation to enter until they were approached by IG-11, who incapacitated them and secured the Child.\nA human male, AP-1982 was a scout trooper who served in an Imperial remnant led by Moff Gideon during the New Republic Era. Around 9 ABY, the scout trooper guarded the entrance to Nevarro's city alongside another scout trooper, JS-1975, after Gideon's forces forced its residents away.\nWhen Bounty Hunters' Guild agent Greef Karga brought Din Djarin in cuffs, accompanied by Carasynthia Dune with Grogu's pram, AP-1982 asked for his chain code. Karga initially avoided the demand, claiming he brought a gift for their leader, but showed his code after AP-1982 demanded for it again. While scanning the code, he offered to pay twenty credits for Djarin's beskar helmet, but Karga refused, stating that he would hang it on his wall. He then handed the code back to Karga and they proceeded inside the city.\nSometime later, Gideon arrived in front of the city's cantina with his forces, cornering Karga and his allies. The two troopers overheard a communication by Djarin, learning of the Child's true location. They immediately activated their speeder bikes and chased him down, finding him with the Ugnaught Kuiil and his blurrg. They fired at Kuiil, killing him and the blurrg he rode and dropping the Child. JS-1975 then picked up the infant and stuffed him into a sack, taking him back to the city and into the hands of Gideon, accompanied by AP-1982.\nUpon arriving at the city's outskirts, AP-1982 waited as JS-1975 hailed the operator and requested for confirmation to enter. He overheard the chatter and learned that Gideon's forces killed a squad of local troopers. Questioning the act, JS-1975 replied saying that officers like Gideon always enforced the law when they entered the town. AP-1982 questioned what was inside the sack, with JS-1975 replied stating that he did not question Gideon's actions. AP-1982 then asked if he could see it, but was refused and was reminded of what Gideon had done in the city just to make a statement, and was asked if he understood it.\nAfter stating that he did, AP-1982 pulled out his blaster and began taking shots at a nearby object out of boredom, but failed to land a single one. Prompting JS-1975 to do the same, the two attempted to hit the object, but failed to do so. AP-1982 then asked if they should provide water to the Child, but was called out by JS-1975, claiming that he only wanted to see him. AP-1982 replied stating that he got to see him as he stuffed him into the sack, but was told he could barely see the infant when picking him up and that he would not take the infant out until he was delivered to Gideon.\nAfter JS-1975 contacted the operator again, AP-1982 voiced his concerns over the Child's condition, stating he was knocked hard. He pointed out that Gideon would not be pleased with seeing the infant dead in the sack, prompting JS-1975 to open it and reveal the Child to him. As he inspected the Child by poking his forehead, the Child bit his finger, and AP-1982 punched him in response. Immediately afterwards, the two troopers were confronted by IG-11, who stated he was the infant's nurse droid. They pulled out their blasters, questioning his model as they thought IG droids were usually bounty hunters. As the droid approached them, he incapacitated AP-1982 with the sack and grabbed JS-1975's head, slamming him into his speeder and knocking him out. IG-11 then took the other bike with the Child in hand and headed towards the city.\nEventually, AP-1982's curious nature cost him his life.\nAP-1982 was mostly unfazed when being reminded of Gideon's actions in the city after asking if he could see the Child. He was initially concerned for the Child after he took a beating from JS-1975, but punched the infant himself after he bit AP-1982's finger while he inspected the baby.\nAP-1982 was equipped with the same armor as other scout troopers, although it was visibly dirtier. He also possessed a 74-Z speeder bike and an EC-17 hold-out blaster, which were typically owned by other scout troopers.\nAP-1982 first appeared in \"Chapter 7: The Reckoning\" of the Disney+ television show The Mandalorian, which was directed by Deborah Chow and aired on December 18, 2019. Credited as \"Biker Scout Trooper #2,\" the character played by Adam Pally. He was later identified in an update of the 2015 video game Star Wars: Galaxy of Heroes.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Scout_trooper",
  "/wiki/Galactic_Empire",
  "/wiki/Moff",
  "/wiki/Gideon",
  "/wiki/New_Republic_Era",
  "/wiki/9_ABY",
  "/wiki/Nevarro",
  "/wiki/Nevarro_City",
  "/wiki/JS-1975",
  "/wiki/Trooper",
  "/wiki/Din_Djarin",
  "/wiki/Grogu",
  "/wiki/IG-11",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Greef_Karga",
  "/wiki/Stun_cuffs",
  "/wiki/Carasynthia_Dune",
  "/wiki/Chain_code",
  "/wiki/The_Client",
  "/wiki/Credit",
  "/wiki/Din_Djarin%27s_armor",
  "/wiki/Beskar",
  "/wiki/Helmet",
  "/wiki/Nevarro_school",
  "/wiki/Speeder_bike",
  "/wiki/Ugnaught",
  "/wiki/Kuiil",
  "/wiki/Blurrg",
  "/wiki/Blaster",
  "/wiki/Water",
  "/wiki/Nanny_droid",
  "/wiki/IG-series",
  "/wiki/Bounty_hunter",
  "/wiki/Speeder",
  "/wiki/Armor",
  "/wiki/74-Z_speeder_bike",
  "/wiki/EC-17_hold-out_blaster",
  "/wiki/Chapter_7:_The_Reckoning",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Deborah_Chow",
  "/wiki/December_18",
  "/wiki/2019",
  "/wiki/Adam_Pally",
  "/wiki/2015",
  "/wiki/Category:Images_of_AP-1982",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/Chapter_8:_Redemption",
  "/wiki/The_Mandalorian:_This_is_the_Way",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_Two",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Databank_(website)",
  "/wiki/2016",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Stormtrooper",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Electronic_Arts",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/September_24",
  "/wiki/June_23",
  "/wiki/2021"
 ]
}