{
 "name": "Aphra family's tooka",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tooka"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Owner(s)",
     "values": [
      "Aphra family"
     ]
    }
   ]
  }
 ],
 "content": "The Aphra family owned a tooka cat while they lived together on the Second Moon of Thrinittik at some point after 20 BBY. The cat often defecated on the carpet of their home.\nThe tooka was owned by the Aphra family while they lived together in a home in the University Quarter of the Second Moon of Thrinittik at some point after 20 BBY. The tooka cat was prone to defecating on the family's carpet. Korin Aphra's obsession with his research on the Jedi splinter group Ordu Aspectu caused him to neglect his family and other responsibilities. His wife Lona Aphra grew tired of this and sarcastically remarked that she thought the Ordu Aspectu could stop the tooka from soiling the carpet. That day, Lona made the decision to leave her husband and instructed their young daughter Chelli Lona Aphra to pack her belongings. While Chelli packed, the family's tooka slept nearby on the carpet.\nThe Aphra family's tooka had red fur. Its face, front legs and the tips of its ears were of a paler color. The tooka had a tendency to defecate on the family's carpet.\nThe Aphra family's tooka was first mentioned in the Star Wars comic Doctor Aphra  15, written by Kieron Gillen and Si Spurrier and published by Marvel Comics on December 20, 2017. It first appeared in Doctor Aphra  32, written by Spurrier and illustrated by Caspar Wijngaard, which was published by Marvel on May 8, 2019.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Doctor_Aphra:_An_Audiobook_Original",
  "/wiki/Doctor_Aphra_(2016)_15",
  "/wiki/Tooka",
  "/wiki/Color",
  "/wiki/Aphra_family",
  "/wiki/Cat",
  "/wiki/Second_Moon_of_Thrinittik",
  "/wiki/20_BBY",
  "/wiki/Aphra_family_home",
  "/wiki/University_Quarter",
  "/wiki/Korin_Aphra",
  "/wiki/Gender",
  "/wiki/Jedi_Order",
  "/wiki/Ordu_Aspectu",
  "/wiki/Marriage",
  "/wiki/Lona_Aphra",
  "/wiki/Standard_day",
  "/wiki/Reproduction",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Hair",
  "/wiki/Limb",
  "/wiki/Ear",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Kieron_Gillen",
  "/wiki/Simon_Spurrier",
  "/wiki/Marvel_Comics",
  "/wiki/December_20",
  "/wiki/2017",
  "/wiki/Doctor_Aphra_(2016)_32",
  "/wiki/Caspar_Wijngaard",
  "/wiki/May_8",
  "/wiki/2019",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY"
 ]
}