{
 "name": "Aqinos",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Monor II"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 25 and 29 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sunesi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Altisian Jedi",
      "Altisian Jedi",
      "Galactic Republic",
      "New Jedi Order",
      "Iron Knights",
      "Iron Knights",
      "New Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jaled Dur"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Ilum",
      "Firkrann",
      "Luxum"
     ]
    }
   ]
  }
 ],
 "content": "Aqinos was a male Sunesi Jedi Master who served the Jedi Order and the Galactic Republic during the final years of the Republic Classic era. Deemed a heretic for melding the Force with technology, Aqinos was cast out of the Order and became an Altisian Jedi; therefore he was able to survive the Great Jedi Purge with many of his Iron Knights. He subsequently perished in the Yuuzhan Vong War.\nA Force-sensitive Sunesi male from Monor II, Aqinos entered the Jedi Order at a young age and began receiving formal training at the Coruscant Jedi Temple. Eventually taken as the Padawan of Jedi Jaled Dur, Aqinos went on to pass the Trials of Knighthood and ascend to the rank of Jedi Knight. After years of independent study and service, Aqinos was given the title of Jedi Master and went on to teach students at the Temple where he was criticized for his philosophies regarding droids. Believing that droids were a form of sentient life, Aqinos pursued studies into bonding Force-sensitives with technology. Cast out of the Order by the Jedi High Council because of these beliefs, Master Aqinos found refuge aboard Master Djinn Altis's praxeum ship, the Chu'unthor, where he continued to teach.\nAround 60 BBY, Master Aqinos discovered the Force-sensitive Shard named Ilum and her twelve children on Orax and began training them in the ways of the Force. Residing on Dweem, Master Aqinos was able to imbue these individuals' Force-abilities within the shell of several Juggernaut war droids, FLTCH-series battle droids, and Uulshos justice droids. Deemed fully trained Jedi by Master Aqinos, the so-called Iron Knights approached the Jedi Order and fought alongside Jedi Mace Windu during the Arkanian Revolution of 50 BBY. However, this did not gain them favor with the High Council and the group remained isolated from Coruscant and the Jedi Temple there. Several decades later, the group reemerged on the front lines of the Clone Wars, fighting on behalf of the Republic against the Separatist Droid Army of the Confederacy of Independent Systems. While not accepted by the Order, Supreme Chancellor Palpatine granted them the titles of High Marshal within the Grand Army of the Republic.\nWhile most Jedi were slain during the Great Jedi Purge initiated by Dark Lord of the Sith Darth Sidious, many of the Iron Knights and Master Aqinos were able to retreat to Dweem and remain hidden. Aqinos and his Knights were approached by Jedi Luke Skywalker in 13 ABY, and were asked to help in rebuilding the Jedi Order. Joining Skywalker's fledgling Order, the Iron Knights and Aqinos helped defeat the Red Knights of Life on Osarian and Uffel and saved Kligson's Moon from the Yuuzhan Vong. They fought in defense of Hosk Station, during which one of Ilum's children, Luxum, fell to the dark side of the Force and led a group of assassin droids against the Yuuzhan Vong as the aliens began their invasion of the galaxy. During this conflict, Aqinos himself fell victim to the Yuuzhan Vong, becoming one with the Force after nearly a century of service to the galaxy.\nAqinos first appeared in Star Wars Missions 14: The Monsters of Dweem, but was not given a name or species. Abel G. Peña identified him as a Sunesi, and, following the lead of Kathy Tyers, who named her Sunesi characters after historical figures, chose the name Aqinos. This was a homage to St Thomas Aquinas because of the \"overt parallels between the Sunesi religion and Christianity.\" Thomas Aquinas was a famous philosopher and theologian in the Scholastic school. This was a methodology that made use of fine distinctions, and, in an ironic move, Peña had Master Aqinos criticize this methodology with the essay.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Monor_II",
  "/wiki/25_ABY/Legends",
  "/wiki/29_ABY/Legends",
  "/wiki/Sunesi",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Altisian_Jedi",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Iron_Knight",
  "/wiki/New_Republic/Legends",
  "/wiki/Jaled_Dur",
  "/wiki/Ilum_(Jedi)",
  "/wiki/Firkrann_(Jedi)",
  "/wiki/Luxum_(Jedi)",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/The_Force/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Djinn_Altis/Legends",
  "/wiki/Praxeum_ship/Legends",
  "/wiki/Chu%27unthor_(Clone_Wars)",
  "/wiki/60_BBY/Legends",
  "/wiki/Shard_(species)",
  "/wiki/Orax",
  "/wiki/Dweem",
  "/wiki/Juggernaut_war_droid",
  "/wiki/FLTCH-series_battle_droid",
  "/wiki/Uulshos_justice_droid",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Arkanian_Revolution",
  "/wiki/50_BBY/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/High_Marshal",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Death/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/13_ABY/Legends",
  "/wiki/Red_Knights_of_Life",
  "/wiki/Osarian",
  "/wiki/Uffel",
  "/wiki/Attack_on_Kligson%27s_Moon",
  "/wiki/Kligson%27s_Moon",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Battle_of_Kalarba",
  "/wiki/Hosk_Station/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Assassin_droid/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Kathy_Tyers",
  "/wiki/Star_Wars_Missions_14:_The_Monsters_of_Dweem",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Droids,_Technology_and_the_Force:_A_Clash_of_Phenomena_(article)",
  "/wiki/StarWars.com",
  "/wiki/The_New_Essential_Guide_to_Droids",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jedi_Academy_Training_Manual",
  "/wiki/Star_Wars:_Blogs"
 ]
}