{
 "name": "Ar%27alani",
 "display_name": "Ar'alani",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 62 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue-black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Irizi family",
      "Picket Force Six",
      "Senior officer corps",
      "Irizi family",
      "Picket Force Six",
      "Senior officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Ar'alani, born as Irizi'ar'alani and also known by the core name Ziara, was a Chiss female admiral who served in the Expansionary Defense Fleet of the Chiss Ascendancy during the Clone Wars and the reign of the Galactic Empire. A Chiss with blue skin and striking red eyes, Ar'alani was known as a brilliant tactician and a devoted officer within the Expansionary Defense Fleet. She was once a member of the Irizi family—one of the Nine Ruling Families that controlled the Ascendancy. The Vigilant, a Nightdragon man-of-war, served as her command ship during and shortly after the Clone Wars. Later in the Imperial period, her command ship was the Chiss Heavy cruiser Steadfast. In her early life, Ar'alani attended Taharim Academy where she became acquainted with fellow cadet Mitth'raw'nuru \"Thrawn\". The pair developed a lifetime friendship, completing many missions side by side, with Ar'alani sometimes serving as Thrawn's Commanding officer. During their shared time as cadets at Taharim Academy—where she had built up a spotless record—Ziara aided Thrawn in being cleared from a cheating charge on a simulation, along with the help of Expansionary Defense Fleet Supreme General Ba'kif. After having his name cleared, Thrawn invited Ziara out where he first introduced her to his abilities of using an individual's art against them in combat, which he demonstrated to her in a bout after taking a look at her wire sculptures.\nFollowing their graduation from Taharim Academy, Ziara successfully completed many missions as she rose in rank with the Expansionary Defense Fleet. She worked with Thrawn in a mission to the nation of the Lioaoin Regime, where the pair worked together to defeat a group of pirates. Both Ziara and Thrawn were promoted for their efforts, with Thrawn being placed under Ziara's watchful eye aboard the Chiss patrol cruiser Parala. Ziara and Thrawn worked together on many missions, including the destruction of pirates against the Garwian Unity colony of Stivic, and the rescue of an excursion liner from the Gravity well of a planet it was stuck in, where they saved eight thousand lives. Thrawn was once again put on trial on the Chiss homeworld of Csilla, where Ziara informed him of the truth of Csilla. Ziara was soon promoted to the rank of commodore, which severed her ties to the Irizi Family and was now called Ar'alani. She was also given command of the Chiss heavy cruiser Destrama as well as Picket Force Six. Shortly after her promotion, Ar'alani and Thrawn were invited to the Garwian homeworld, where she first began to humanize non-Chiss lives, while also thwarting an attempt for the Garwian Unity to conquer areas of Lioaoin space.\nNear the end of the Clone Wars, the warlike Grysk Hegemony began a plot to destroy the Chiss Ascendancy. Their coordinator, Jixtus, first sent the Nikardun General Yiv to conquer the neighboring nations of the Ascendancy, in an attempt to encircle them. This Chiss had rules against preemptive strikes, which aided the leader of the Nikardun Destiny in his attempt to destroy the Ascendancy. Ar'alani and the Vigilant played an important role in defeating Yiv's fleet over the Vak Combine planet of Primea. Following the Chiss victory, Ar'alani dealt with the aftermath of the battle, finding and cleaning up Nikardun remnants. The Vigilant then made its way to the planet Sunrise, where it encountered and destroyed a Battle Dreadnought. After returning to the Ascendancy, Ar'alani met with the imprisoned Yiv in an attempt to find a lead on the mastermind behind the attacks on the Chiss. Ar'alani was also a major factor in the decisive victory against Jixtus's fleet during the climactic battle against the Grysk, which was dubbed Senior Captain Thrawn's last stand.\nIn her youth, Irizi'ar'alani was known by her core name \"Ziara\", and was a member of the Irizi family, one of the Nine Ruling Families. She attended Taharim Academy, and rose to the rank of Senior Cadet in four years. While at the academy, she was on trial after a cadet under her tutelage, Mitth'raw'nuru \"Thrawn,\" was accused of cheating on a simulator exercise. During a luncheon break from the trial, Ziara invited General Ba'kif to the trial, who suggested that if they could not recreate the parameters as a simulation, Cadet Thrawn should try the real thing. Ziara watched as Thrawn perfectly executed the maneuvers he did in the simulation, and explained to the Irizi family Aristocra how he had pulled it off.\nAfter having his name cleared, Thrawn invited Ziara out as a token of his gratitude for her help. He took her to an art gallery showcasing the history of the Chiss Ascendancy, much to her dismay. Thrawn explained that art and military tactics are reflected in each other, and strengths and weaknesses can be seen in one's artwork. He broke down two civilizations, the Scofti and the Brodihi, from their art. Ziara argued that everything he concluded was purely theoretical, and told him to study her own art, before the two of them dueled to see if he could find her tactical strengths and weaknesses. After studying her wire sculptures Thrawn easily countered all her attacks, and she was unable to block his. She changed up her attacks and was able to hit him a few times, before things went back to normal. After the bout ended, he explained her art and it's correlation with her fighting techniques, and noted he was unable to block her new set of attacks, before she switched back to her old ones, which he already knew how to counter.\nSome time after their bout, Ziara, now Mid Captain, aided Junior Commander Thrawn on a mission to the heart world of the Lioaoin Regime to take down a group pirates. After Thrawn informed the Lioaoin Regime he was searching for pirates, Ziara and her ship jumped to hyperspace, and Thrawn prepared to jump to hyperspace with his Pathfinder, Qilori. The Lioaoin Regime patrol ships also had Pathfinders aboard, and would be able to follow Thrawn back to Chiss Space. They reached Kinoss where Ziara had set a trap for them.\nShortly after the destruction of the pirates, Ziara and Thrawn were reprimanded by General Ba'kif for launching a preemptive strike. Ascendancy protocol indicated that the Chiss should not attack unless attacked first—which they had ignored. Regardless, both of them had been promoted, Ziara to Senior Captain, and Thrawn to Senior Commander. After dismissing Thrawn, Ba'kif asked Ziara for her assessment of Thrawn. She replied that he is an excellent tactician and strategist, but his political capabilities is close to nonexistent. He placed Thrawn aboard the Parala as Ziara's Third Officer, in order to keep an eye on him. While discussing their roles with the Ascendancy, Thrawn informed Ziara that after the Lioaoin Regime would go back to piracy after they had replaced the ships she destroyed. He noted that they wouldn't try it with the Ascendancy, but they would go after other peoples that could not defend themselves. Ziara asked if he wished for the Ascendancy to be the protectors of the Chaos, mentioning that would be the case should they interfere in the affairs of others. She told him that for the time being, non-intervention was the protocol, and until that changed, they must accept their orders and fulfill their duties.\nSome months after their respective promotions, Thrawn guided the Parala to the Garwian Colony Stivic, where they had requested help against pirates. Thrawn informed Ziara that he hoped the presence of a Chiss Warship would scare away the pirates, and if it didn't, he would do nothing. Mentioning he could take on all four attackers, Thrawn asked for Ziara's permission to intervene, promising no major damage to the Parala. Thrawn requested leave to check the ranging lasers for calibration, and headed down to secondary command. With Ziara back in command, she informed her First Officer Roscu that she wanted to see the attack, and check if they had come up with new weapons or tactics. Just then, the pirates fired upon the Chiss Warship, and then immediately blew up. The pirates retreated, and Ziara ordered the helm to return the patrol circuit.\nZiara came to the aid of Thrawn after he placed an emergency call, who was struggling to save an excursion liner from a planets gravity well. Thrawn had command of the Boco, and was using its tractor beam to hold the liner from crashing into the planet. Ziara brought the Parala parallel to the Boco, and the Boco dropped its tractor beam and turned around to face the liner. Thrawn fired on the wings of the liner, lightening the ship. The Boco returned to the side of the Parala and together they pulled the lightened liner out, saving eight thousand lives.\nZiara and Thrawn made their way to the Chiss homeworld of Csilla, where there was to be a hearing regarding their action. They passed by Csaplar, a massive city that appeared to be frozen in ice. Ziara mentioned that their desired destination was underground, and would not be visibile from their current standpoint. The only loss from the hearing was that Thrawn had lost his command post of his first patrol ship, and Ziara had requested for him to be assigned to the Parala again as one of her officers. Ziara invited Thrawn to the Irizi family homestead, where they would spend a few days before their new orders came in. On their way to the homestead, Ziara told Thrawn the truth about Csilla - how most people had moved from Csilla, while the others moved underground. The official record showed eight billion people living there, when in reality it was only sixty or seventy million. He asked why she had told him this, noting he wasn't senior enough for this information. Ziara replied that he thrives on information, and with more information he could come up with better tactics.\nSome time after the Irizi offered Thrawn the position of Trial-born with them, Ziara was promoted to Commodore, losing her connection with the Irizi. Supreme Admiral Ja'fosk presented her with her new uniform and name - Commodore Ar'alani. During the promotion celebration, Thrawn approached Ar'alani and congratulated her, reminding her that he said she'd be here one day. Ar'alani had been assigned the Destrama and Picket Force Six, and had requested Thrawn to be her first officer. Thrawn informed Ar'alani that Aristocra Irizi'stal'mustro \"Zistalmu\" of the Irizi had offered him the rank of tria-born within the family, and asked for her advice. Ar'alani brought him up to speed of the family politics, but ultimately left the decision up to him. Thrawn thanked her for her help, and for all she'd done for him over the years.\nAr'alani and Thrawn were invited to the Garwian home world, where Security Chief Frangelic informed them the Ruleri would be present. While en route to the security center, Frangelic stopped at the Creators' Market, noting that it was one of the finest representations of Garwian culture and he wished to share it with them. He led them to a woman named Mimott, who created extravagant clothes for Remembrance party's, much to Ar'alani's amazement. She mentioned that she had never thought of aliens as people and began humanizing them, asking Thrawn whether he always saw them for what the were. He replied that he saw them as people, but he truly saw them as assets. When they reached the security center, alarms began to blare indicating Solitair was under attack by the Lioaoin Regime.\nA Garwian general asked Ar'alani for her help, which she could not give. Thrawn was about to give them info about their attackers when Ar'alani cut him off, which earned her more pleading from Frangelic. Ar'alani pulled out her comm unit to contact the Destrama, but their was no answer. Thrawn asked the Garwian General to lift their jammer. After a few moments the Garwians lifted their jamming, and Ar'alani question what their goal was. They informed her that there used to be six outer worlds of the Garwians, and soon there will be six again. Ar'alani prepared to leave, and warned the Garwians that Thrawn's insights regarding blind spots weren't limited to those of Lioaoi.\nAdmiral Ar'alani, now commander of the Nightdragon man-of-war class Vigilant, joined Thrawn and the Springhawk on a mission to attack the Paataatus. During the skirmish, Thrawn turned his ship away from the Vigilant, forcing the Paataatus to fire upon him, giving the other ships an opportunity to fire back without confusion from the gunners or computers. Ar'alani commended Thrawn on the maneuver, but also requested him to share his plans before executing them. Ar'alani informed Thrawn that they had it under control, giving him leave to continue on his next mission. Ar'alani travelled in-system to speak with the Paataatus leaders, to confirm they understood what happens when they attack the Chiss Ascendancy. Following the attack, Ar'alani and her first officer, Senior Captain Wutroow were called in for testimony in the Aristocra hearing room.\nSince Thrawn was unavailable, Ar'alani and her first officer were summoned by the Aristocra in hopes they would say something derogatory about him for disobeying orders. Ar'alani instructed Wutroow to answer honestly, but also said she herself would spiral her answers slightly. The pair entered the hearing room, and stood ready for questioning. The syndic for the Clarr family spoke first, asking Ar'alani if Senior Captain Thrawn had in fact disobeyed a direct order. Ar'alani replied that he disobeyed a lesser order, later correcting herself that while disobeying an order, Thrawn carried out a more important priority, which was to protect the ascendancy and win the battle. She compared Thrawns actions to those of the syndics, noting that their first priority was to the ascendancy as a whole and the second to their respective families. The Syndicure dismissed Ar'alani and Wutroow, after the latter informed the Syndicure of a report showing the Paataatus knew where they were going to be attacked, which she received from someone in her family.\nAr'alani received a message from Thrawn requesting her to meet him at the given coordinates, with instructions to bring only the Vigilant and to not hire a navigator. Ar'alani instructed Wutroow to set course for Naporar to pick up their sky-walker. After reaching Thrawn's coordinates, Ar'alani and Wutroow shuttles across to the Springhawk, where the pair and Senior Captain Samakro read through Thrawn's data and proposal. Thrawn had found the system the two refuge ships with dead bodies had come from, and planned to pull the same maneuver he used at Taharim Academy to enter the box system, using the Springhawk instead of a patrol cruiser. Ar'alani asked what his exit strategy was, and he replied that he would go through the gas giants, where they could holes to pop in and out of.\nAr'alani agreed to his plan, only ordering him to send his sky-walker Che'ri and her caregiver Thalias aboard the Vigilant to keep them safe. Thrawn countered that he needed Thalias, mentioning he felt that the guard would be less likely to attack if he had a woman with him, and he could not take any officers because he wanted the Springhawk combat ready at all times. The plan was to have the Springhawk fly alongside the Vigilant and hide in its shadow until it could enter the asteroid cluster undetected, and added course changes to draw away suspicion the blockade ships might have. The two ships reaches the asteroid cluster where the Springhawk broke off and entered undetected, and the Vigilant jumped to hyperspace.\nWith Che'ri aboard the Vigilant, Ar'alani entered the Sky-walker suite to check on Che'ri and informed her that Thrawn, Thalias, and the Springhawk had made it safely to their destination. The Vigilant's sky-walker, Ab'begh requested that Che'ri's bed be put next to hers, to which everyone agreed. Ar'alani bade farewell to the girls and their caregiver, and took her leave.\nDuring the skirmish over Rapacc, Thrawn had captured a Nikardun ship, which he and Ar'alani presented to General Ba'kif. Ba'kif argued that it was a serious violation of protocol, with Ar'alani retorting that capturing a ship isn't a breach. Ar'alani and Thrawn informed that they believed the Nikardun Destiny were in league with the Lioaoin Regime, and requested permission to go to the Lioaoin heart world in person, a mission that would be kept quiet. Just then, Mitth family Syndic Thurfian and Irizi family Syndic Zistalmu entered Ba'kif's office together, which Ar'alani found very suspicious. Thurfian and Zistalmu shot down Thrawn and Ar'alani's proposed mission, noting the Springhawk was undergoing repairs and the Vigilant was being sent to Urch, the capital of Urchiv-ki, where a new ambassador was being sent. The synics had also reassigned sky-walker Ab'begh from the Vigilant and assigned sky-walker Ch'eri to it, as were caregiver Thalias and Senior Captain Thrawn. Ch'eri brought the Vigilant into the Urchiv-Ki system, and had to take a detour that forced them to arrive several hours late, much to the annoyance of Ambassador Ilparg. During Ilparg's groveling, Thrawn showed Ar'alani a ship that he believed was Lioaoin. Ilparg, once again listing his complaints, was told sternly to stop talking by Ar'alani. She and Thrawn counted eight ships: the single Lioaoin, six Urchiv, and a Nikardun frigate.\nThey wondered whether the Urchiv-Ki has been conquered or if they were still resisting the Nikardun. Ar'alani rose from her command chair and went over to sky-walker Che'ri, and asked her to find an exit vector that was quicker and easier than the rest. Che'ri gave the vector, but Wutroow informed the admiral that to reach the vector, the Vigilant would have to angle outward and therefore move straight into the net created by the enemies. She replied that they wouldn't necessarily have to angle outward, and ordered the Vigilant forward, with an additional three course changes which took the enemies off their tail, and then jumped to hyperspace. An angered Ilparg asked how and what had just occurred, and Ar'alani informed him that the Nikardun wanted to capture a Chiss ship, and used him as bait. Ar'alani also pointed out the thr Lioaoin ship was present, and did not interfere implying they were in league with the Nikardun. She suggested they travel to the Lioaoin heart world to demand an explanation, to which Ilparg agreed.\nChe'ri brought the Vigilant to the Lioaoin heart world, and Ilparg demanded to speak with someone in the Regime Diplomatic Office. Ar'alani advised him to wait until Thrawn was present on the bridge, much to Ilparg's annoyance. Thrawn arrived on the bridge, apologizing that his studies took longer than he expected. Ilparg questioned his studies, claiming Thrawn's study of art was a waste of time. Ar'alani came to his defense, saying that the first rule of strategy is to know your enemy, and that includes their battle tactics, history, philosophy, and their art. Thrawn pondered why the Lioaoin ships were hesitating to attack, noting nine ships in particular. The voice of a person from the Lioaoin Orbital Command echoed over the speaker, and Ilparg replied that he demanded to speak to someone about their treatment at Urchiv-Ki. Ar'alani began to stop him from revealing the information, when Thrawn stopped her, to see what the reaction of the Lioaoin's would be. Just then, a massive Battle Dreadnought class Nikardun warship came into view, and Ar'alani ordered Ilparg to say his farewells so they could leave.\nThrawn asked Ar'alani for permission to run an experiment with the nine gunboats the pair had noticed earlier. Thrawn spoke to the Lioaoin Orbital Command, and noticed the seven of the nine gunboats moved forward at the mention of his own name, and then promptly moved back into position. With that, the Vigilant jumped into hyperspace. Wutroow asked her Admiral what they had learned, and Thrawn responded that the pilots of the seven gunboats had standing orders regarding him, but someone higher in command countermanded the order. It also showed that the Lioaoin weren't just subjects of the Nikardun, instead they were allies. Thrawn asked Ar'alani if she could take the Vigilant to Solitair, and to borrow her office for two hours. She agreed, and instructed Thalias to bring Che'ri out of Third sight when it was safe and have her redirect to Solitair. While en route to Solitair, Thalias agreed to accompany Thrawn as his Chiss family hostage, leaving Che'ri without her caregiver.\nAr'alani allowed Thalias to choose who she'd like to take care of Ch'eri while she was on Solitair with Thrawn, and Thalias chose the admiral herself. When Ar'alani went to check on the young girl, she found her curled up in oversized chairs, and asked if she was upset that Thalias had left her. Che'ri replied that Thalias told her she had to go but wouldn't tell her why. Ar'alani sympathized with her, mentioning that it used to bother her when she was young as well. Che'ri blamed herself for Thalias leaving, noting that she yelled at her for not giving her graph markers. She began crying because she feared that Thalias was going into danger and was going to die, and Ar'alani did her best to comfort her by saying that Thrawn was with her and he wouldn't let anything happen to her. Ar'alani told Che'ri she would draw her a hot bath and then make her whatever she wanted to eat, and the young sky-walker agreed. Che'ri asked Ar'alani to tell her some stories about Thrawn, because Thalias gave her some but she didn't read very well. Ar'alani let out a quiet sigh, realizing that it was going to the a long night.\nAr'alani sat in front of General Ba'kif and Aristocra's Zistalmu and Thurfian, facing heat from all three for separating a sky-walker and her caregiver as well as letting Thrawn insert himself in to Garwian politics once again. Ar'alani replied that Thrawn's mission was simply reconnaissance, trying to figure out if thr Nikardun had established their presence any where else. Thurfian countered that since the Nikardun had not yet attacked the Ascendancy nor show any indication that they might, it was a political matter and not military. Ba'kif interjected that the discussion would continue after Thrawn had returned and would be able to properly defend himself, noting that the issue at hand was figuring out how to safely extract him from Solitair. Zistalmu replied that Thrawn got himself into the mess and he should be responsible to get himself out of it, but Thurfian countered that letting him have his way could bring more diplomatic and political consequences.\nAr'alani said her extraction mission would be straightforward, she would take the Vigilant to the Primea system and and arrange a pickup, noting that the Ascendancy had no quarrel with the Vak. Thurfian said that Ar'alani and the Vigilant would be on their way as soon as the ships sky-walker dilemma was solved, and Ar'alani countered that she promised Che'ri's caregiver she would take care of her. Zistalmu mentioned that his wife served as a caregiver for some time, and she could be reinstated to be Che'ri's temporary caregiver. Ar'alani disagreed, not wanting a strange woman not a Syndic on her ship, but Ba'kif accepted Zistalmu's offer and ordered him to call ha wife and report to the Vigilant. Ba'kif held Ar'alani for a few moments, saying while it was not ideal, it was the only way, not to mention the fact that she had not mandate because Thalias wasn't an official caregiver. Ba'kif informed Ar'alani that Thurfian helped Thalias sweet-talk her way on the to the Springhawk, and guaranteed that there was a cost for his help. Ba'kif stated that Thurfian could have mentioned Thalias not being an official caregiver, but he didn't. He also noted that despite their family rivalries, Thurfian and Zistalmu have shown remarkable unity in their joined efforts to get Thrawn out of the fleet.\nBa'kif concluded that Thurfian still wants something from Thalias, or else he would have had her removed from the Springhawk. He ordered Ar'alani to watch Zistalmu closely, stating that the Syndic wouldn't voluntarily walk into trouble unless he could manage to benefit his family from it. While en route to the Primea system, Ar'alani confronted Zistalmu on why he and Thurfian hates Thrawn. Zistalmu replied that they don't hate Thrawn, and actually admire his military skill. He said they resist him because they considered him a threat to the Ascendancy. Ar'alani countered if he meant a threat to the Ascendancy or the Irizi family, to which he replied that she didn't see what he meant and there was no point in continuing the conversation. Ar'alani pointed out that she was aboard her ship and he was subject to her authority, and ordered him to explain how Thrawn was a thread tot he Ascendancy. He replied that there wasn't enough time for a proper explanation, but pointed out that she'd seen enough of his career and if she didn't see what he meant, it's because she chose not to. With that, the Vigilant exited hyperspace and entered the Primea system. She ordered Wutroow to identify themselves to the planetary diplomatic office and let them know they were trying to reach Artistic Master Svorno.\nWutroow replied that the Garwian ship left three days ago with all personnel aboard, and Ar'alani asked for a list of all personnel aboard the ship as well as copies all transmission to and from the ship. Biclian reported that five small ships were breaking orbit towards them and another nine patrol ships from the surface. Wutroow noted that thirteen of ships were working into a lens formation, and the fourteenth was moving forward. Ar'alani ordered Octrimo to start subtly drifting toward the fourteenth fighter, wondering if it was Thrawn. The fighter fired on the Vigilant, and continued modulated laser fire on the Vigilant. Zistalmu figured out that the fighter was Thrawn and the modulated laser fire was a means of communication, a secret that until now only Thrawn and Ar'alani knew. Two patrol ships began pursuing Thrawn, and two additional warships began moving steadily towards the Vigilant off to portside. Suddenly, a Nikardun warship appeared, and Thrawn had also transferred a schematic of the Vak patrol ships that highlighted their weak points. Ar'alani ordered for the lasers to target only the weapons sensors of the patrol ships, to which Zistalmu retaliated, saying they had not been attacked yet. Ar'alani countered that one ship had fired upon them, and they did not know for a fact if it was Thrawn or not.\nJust as Zistalmu began to forbid any action, Biclian reported that four heavy cruisers were coming in from hyperspace, and they turned out to be Lioaoin heavy cruisers. Ar'alani informed the Lioaoi that they meant no harm to Primea, and were simply inquiring the whereabouts of a missing person. All four Lioaoi ships opened fire on the Vigilant, and Ar'alani noted that it would take at least half a dozen plasma sphere impacts to neutralize a single ship, and there was four of them. She asked Octrimo what their best course out of the battle was, fending off Zistalmu's protests in the process. Octrimo replied that the best exit vector was portside, but it would take them into close combat range with Lioaoin ships three and four. Ar'alani ordered weapons to concentrate spheres on ship three, as both three and four began moving sideways to block the Vigilant's escape. Thrawn's hijacked patrol ship shot past the Vigilant and opened fire on ship four, destroying its combat ability before they could figure out why a Vak patrol ship had fired upon them. Thrawn's patrol ship was hit, and the Vigilant brought him in with its tractor beam. As soon as his patrol ship was secured, the Vigilant jumped to hyperspace.\nThe Vigilant and the Springhawk went on their way to deliver a message to the Lioaoi, and met at a rendezvous system, and both ships' commanders and senior officers met aboard the Vigilant for a final briefing before making an easy jump by jump to the Lioaoin heart world. Ar'alani hailed the twelve warships that were headed their way, announcing that ships of the Lioaoin Regime attacked a ship of the Chiss Ascendancy, and asked if they had an explanation before this Chiss passed judgement. Thrawn realized that the Nikardun were present, either on the surface or aboard Liaoain ships. Thrawn informed Ar'alani of the four approaching warships, and she ordered him to ready the probe. The probe, really one of the Vigilant's shuttles, was meant as a distraction for the Laiaoi, and they soon took control over the shuttle by jamming the Vigilant's control signal.\nThe Lioaoi gained full control of the shuttle and sent it on a vector that would take it through the center of the Lioaoin formation. Once it reached the center, Thrawn ordered to fire on the shuttle, which sent out breacher missiles that headed towards each ship. The damage was minimal, but all four ships lurched violently, breaking formation. The Vigilant's lasers flashed out, and the second shuttle which had been towed behind the first sent out its own breacher missiles into each of the warships. Ar'alani once again asked for an explanation, but the four Lioaoin ships started falling back with two more rising from defense orbit. Ar'alani informed the Springhawk they were sent to deliver a message, and they would do so, and Thrawn instructed his bridge to prepare for combat.\nSome five weeks after their departure to Lesser Space, Thrawn and Che'ri returned to the Csilla system with a Republic energy shield, that was brought aboard the Vigilant. Ar'alani remarked that the shield generator was light years beyond the electrostatic barriers, they had been using, but Thrawn replied that their advantage would only be temporary, noting that their enemies would try to replicate or steal it. Ar'alani wondered why Yiv did not have something like the shield generator, and Thrawn replied that he might and was only saving it for a later time. Thrawn stated that they, however, could not afford to wait and would have to use it against Yiv before he knew it. Ar'alani warned that he might already know, considering the noise that he and Jedi General Anakin Skywalker made on Batuu and Mokivj. She stated it was a bizarre coincidence regarding the Jedi's last name, and Thrawn replied that to his understanding, it wasn't an uncommon name in parts of Lesser Space. Ar'alani asked Thrawn what his plan was, and he replied that it was clear that he and the Nikardun were not ready to face the Ascendancy yet, and that he was still working on being the Vaks completely under his control.\nHe aimed to drive a wedge between the Vaks and Yiv, which should either halt his plans completely or buy them enough time to convince the Syndicure that the Nikardun were indeed a threat. Ar'alani also noted that Primea was important to him not only for the Vaks, but also as it was a center of trade and diplomacy for the entire region, and an endorsement from the Vak leaders would allow Yiv easy access to all the other nations. Thrawn laid out his entire plan, which Ar'alani decided was not only illegal but also insane. Thrawn replied that if she did not want to go along with it, he would do it alone with Thalias and Che'ri. Thrawn replied that his message would get to the Vaks and they would come to his aid, but Ar'alani stated that they would come to his aid only if they received the message and chose not to ignore it. Ar'alani was firm in her belief that his plan was insane, even for him, also noting that his reading of Yiv and the Vaks could be wrong. She also noted that he had been wrong before, referencing his failure with the Garwians.\nThrawn said this was different, as it was a an issue of war and not politics. Despite her reservations, she agreed to his plans, and stated that they would need the Vak fighter they brought back from Primea, the Republic shield, and a customized freighter to hold it, in addition to permission from Ba'kif and Ja'fosk. After sending Che'ri and Thalias aboard the Vak fighter to Primea and receiving word of their capture, Ar'alani was present at the Convocate Hall for the Syndicure's emergency meeting. Ja'fosk read General Yiv's demands for the release of Thalias and Che'ri, and the Syndicure planned their steps to get them back. Zistalmu asked if they would order a military strike, but Thurfian countered that the Nikardun were not their enemies, and could not attack them. Thrawn stated that they had taken a sky-walker, which itself constitutes as an attack on the Ascendancy. The Syndicure agreed, and sent Thrawn aboard an unarmed freighter alone to Primea, just as Yiv has requested.\nAboard the Vigilant, Ar'alani discussed the upcoming battle with Wutroow, noting that if the Vaks had indeed fallen under control of the Nikardun, they would not be allowed to attack them unless fires upon first. Wutroow asked her admiral how good the Republic energy shield really was, and Ar'alani replied she wasn't sure. Wutroow went off to runs the weapon crews through final system check, and Ar'alani made arrangements for sky-walker Ab'begh to be taken off the bridge upon arrival. When the Vigilant arrived above Primea, Ar'alani asked Primea Central Command if they had received the message from Senior Captain Thrawn, to which they replied in the affirmative. They asked for confirmation of the identities and locations of the Nikardun vessels, and the admiral informed them her officers were working on it. The Chiss ships counted thirty two Nikardun vessels, and the Vigilant sent their profile to Primea Command.\nThey asked if they were subject to a Nikardun blockade, which Ar'alani confirmed. They agreed to hold their defense ships back while the Chiss cleared the way. She told her task force they had their targets and ordered them to engage at will. During the battle, the three Battle Dreadnaughts that had been stationed aside General Yiv's own Dreadnaught, the Deathless, appeared, and Ar'alani ordered her task force to split up and keep the occupied. While the Springhawk was being battered down and out-played by the Dreadnaught, Ar'alani offered some much needed timely assistance, and asked Mid Captain Samakro if he remembered the maneuver Thrawn pulled against the Pataatus when he first took command over the Springhawk. She ordered him to come out from his spot and angle toward low orbit, and then ordered him to go dark. The Springhawk shut down all its systems, and Ar'alani called upon the Vaks for humanitarian aid.\nThe Vaks agreed, and sent two patrol ships to render aid, with warnings from both the Vaks and Ar'alani to the Nikardun to not fire upon them. Heedless of the warnings, the Nikardun fired upon and destroyed both patrol ships, causing the Vaks to send in their forces against the Nikardun. Together, the Chiss and the Vaks overpowered the Nikardun, and Thrawn was able to deliver General Yiv to the council alive interrogation. Thrawn later revealed to Thalias and Che'ri that Ar'alani realized that in Vak history, all of their enemies were careful to never kill a Vak in combat, because to the Vaks an attack one one is an attack on the entire society.\nSome time after Yiv's capture, Ar'alani, along with Thrawn and the Springhawk and Senior Captain Lakinda and the Grayshrike were engaged in battle with Nikardun remnants. The three Chiss ships easily took care of their attackers, and Ar'alani gave Thrawn permission to take his leave and continue on his mission. Wutroow questioned if this had to do with the conversation that she and Thrawn had with Ba'kif before they left for this mission, but Ar'alani did not give her an answer. Following Thrawn's departure, the Vigilant and Grayshrike traveled to their next stop, another Nikardun base in the region. Upon arrival, they found three badly damaged ships, and the Grayshrike found another six. Ar'alani ordered a full sensor scan to find out what weapons were used in the attack. She then ordered Octrimo to move closer to the derelicts and to be ready to go evasive, also mentioning she didn't like the idea of someone with this much military strength around this part of the chaos. Wutroow stated that they shouldn't spend too much time on it, mentioning the Aristocra already did not like they idea of mopping up the Nikardun as far as they were.\nJunior Commander Larisom informed Ar'alani of message coming from Schesa as a relay from Csilla from Supreme Admiral Ja'fosk. The message was an order for Thrawn and the Springhawk to return to Csilla for a new assignment. Wutroow pointed out that it was the Syndicure who had summoned Thrawn, noting that had it been Ja'fosk or Ba'kif, they would have asked him to complete his mission first. Ar'alani dispatched Lakinda and the Grayshrike to the Rapacc system to deliver the message to Thrawn, who was out of comm range. Ar'alani and the Vigilant continued on their mission, setting their destination for one of the last two Nikardun Listening post's. Wutroow brought up the point that the Nikardun ma have left their unflyable ships at their current location ridden with lasers and missiles in hopes of the Chiss assuming the final two listening posts had been destroyed, but were actually assembling their forces there. Ar'alani replied that if that were the case, they would inflict as much damage as possible and run, and come back after they had rendezvoused with the Springhawk and the Grayshrike.\nThe Vigilant arrived at the final base on Yiv's list, only to find silence and more debris. Wutroow noted that the base looked too big for a listening post, and found it odd that all the other bases had been marked by size and purpose, and this one had not. Ar'alani agreed, and abruptly ordered Biclian to scan a clump of debris that she felt was too close together. He reported that it could be the remnants of an asteroid, and Ar'alani then ordered him to find the overall vector of the debris and Octrimo to take them in closer to it. After both had had carried out their respective orders, Ar'alani revealed that the asteroid had broken apart directly in front of the gap in the stations she'd identified as the first point of impact. The asteroid had drifted through the base's defense perimeter, and shattered open to reveal the Missile launcher inside it, which blasted away at the base's hull. Ar'alani ordered a full sensor scan on all the debris, a squad to check out the base, and a shuttle to check out the asteroid fragments.\nAr'alani and the Vigilant, along with Lakinda and the Grayshrike arrived above Sunrise, finding the planet and its surrounding areas completely empty. Biclian reported movement coming from the starboard side of the planet, and had her crew scan it. She ordered Lakinda to shift her scans to aft and flanking, much to Lakinda's dismay. Biclian reported the object was about the size of the Vigilant and irregularly shaped, when Wutroow realized it was a moon, which Biclian confirmed, also adding it could be an asteroid. Ar'alani ordered a reading on its orbital eccentricity, and asked Lakinda if the object was in orbit or on the other side of the planet during her time above Sunrise. Lakinda replied that they were going through the battle records, and asked Wutroow if they suspected it was another camouflaged missile launcher, which Ar'alani confirmed. Ar'alani asked Wutroow to retrieve Thrawn's records of the battle the Springhawk and Grayshrike partook in over Sunrise to check if she could spot the asteroid anywhere. Ar'alani asked Lakinda if she was ready to try something dangerous, to which she replied in the affirmative.\nAboard the Grayshrike, Wikivv performed an in-system jump, which brought it in view of Sunrise and barely a kilometer from the asteroid. The Grayshrike waited until Ar'alani and the Vigilant were in position before they began to close the gap. As the Vigilant came into position a quarter way around the planet, an Battle Dreadnaught emerged, and Lakinda noticed that it was the exact same Battle Dreadnaught she and Thrawn had fought with two weeks before above the planet. Ar'alani called to the Battle Dreadnaught in Taarja, and a harsh voice replied, warning them to leave the area or face severe consequences. Ar'alani asked who exactly it was that didn't want the Chiss in the area, and the commander of the Battle Dreadnaught replied that that planet had been devastated by the Nikardun Destiny, and the survivors of it had begged them to guard the planet from the Nikardun or other scavengers. Ar'alani stated that they were here for the same reasons, and perhaps they could join forces, to which the commander declined. Ar'alani asked for the name of the planet and the names of the planetary leaders, both questions the commander refused to answer. Part of Ar'alani's plan was for Lakinda to figure out a way to disable and capture the asteroid missile launcher while she kept the Dreadnaught occupied, but gave permission to destroy it if necessary. The Grayshrike used its spectrum lasers to open up the hull of the asteroid, and then used its plasma spheres to disable it.\nLakinda informed Ar'alani that it had been disabled, and she ordered the Grayshrike to lock on a tractor beam and then to get over to her side. Ignoring her admirals order, Lakinda rushed the Grayshrike to the Vigilant's aid. Ar'alani hissed out a curse when she saw the Grayshrike coming without the missile launcher, as her plan had been for the Grayshrike to tow the missile launcher between the two ships and get the crew of the Vigilant to trigger the launcher and send the missile towards the battle Dreadnaught. If not, she would try to detonate the launcher and hope to score some blast damage against the enemy, but both options were gone. Ar'alani ordered Oeskym to launch two breachers, and a laser spread around them to keep the Dibbers busy. Wutroow questioned if Lakinda was trying to ram the Dreadnaught from behind, and Ar'alani realized the Grayshrike's best bet was for the Vigilant to keep the Battle Dreadnaught busy while she attacked their portside sensors, which had been damaged two weeks prior against Lakinda and Thrawn. Ar'alani ordered Oeskym, to continue only defensive fire, and to prepare six breachers targeted on sensor and weapons clusters on the starboard flank, and three plasma spheres to follow five seconds later. Ar'alani called to the Dreadnaught, and told them now she knew how to destroy them, and asked if they were ready to return to their respective peoples and deliver their reports. Lakinda picked up on Ar'alani's gambit, and went into stealth mode, which set the stage for Ar'alani's plan.\nAr'alani told the alien commander that they could run home, and that the Chiss would easily win the next battle. The alien replied they were not done with the current one, but before he could finish his sentence Ar'alani ordered Oeskym to fire the breachers, which were taken care of by the dibbers. Followed by the breachers were the plasma spheres, and another batch of dibbers were sent to destroy them, but were disintegrated by the acid of the breachers. The Vigilant opened fire, the the alien Dreadnaught returned fire as the plasma spheres reached their target. The Grayshrike launched twin clusters of breachers at the battle cruisers starboard flank, and the cruiser replied with a massive missile aimed at the missile launcher, destroying it. Picking up on what was about to happen, Ar'alani ordered Lakinda to veer off and get out of her position, and ordered the same to Wutroow. The Battle Dreadnaught ignited its self destruct system as both ships began to move away, and it was over. Ar'alani commanded Wutroow to search the debris for any dibbers that might be incapacitated, and bring it back to be studied. Wutroow pointed out that whether or not the enemy had found their weak spots, at least they had found theirs. Ar'alani disagreed, stating that the mixed breacher and sphere attack was a useful tactic but not a weakness.\nLakinda apologized to Ar'alani for not bringing the missile launcher, but the admiral replied it was okay because her scenario also involved the missile launcher being destroyed. Ar'alani mentioned that they were not able to salvage any dibbers, and that whoever the aliens were they were very determined to keep their secrets. She noted that the alien was careless in his language, and noticed that he used the term Generalirius, which could be similar to generalissimo, a term used by nations our past the Tarleev, which referred to someone who was both the chief military commander and the chief civilian leader. Wrapping up the official briefing, Ar'alani began the real reason she brought Lakinda aboard the Vigilant. A new order had come from Csilla through Schesa, ordering Lakinda and the Grayshrike to report to Csilla for repairs, then to join Captain Thrawn in his search for Vagaari pirates.\nAr'alani asked if Lakinda wanted to go, much to Lakinda's confusion. Ar'alani stated she was the commander and flag officer on scene and had the ability to countermand all orders as she saw fit. Lakinda questioned why she would not want to go, and Ar'alani mentioned it was because she could used her help and that she had a problem with Thrawn. Lakinda replied that even if she had a problem with Thrawn, she would never let her personal feelings get in the way of her job. She stated that unless Ar'alani needed her assistance, she would return to the Grayshrike and prepare for their departure. Before leaving, Lakinda suggested that the Grayshrike transfer it's remaining breachers and plasma fluid to the Vigilant, in case they were caught in another battle. Ar'alani accepted the offer and told Lakinda she would get Wutroow on it.\nAr'alani and the Vigilant spent the next two weeks searching Sunrise for survivors, finding a few spread across ruined cities, industrial centers and mines. Senior Warrior Yopring reported that they had come upon a mine with perhaps a hundred active workers, just before being startled by two skycars, who began to tail him. Wutroow informed him that another four skycars were coming in from the north and west, trying to cut him off from the mine. Ar'alani informed Yopring to hold course to the point she had marked, and ordered Wutroow to fire a full bore laser salvo at two different spots. When Yopring reached the point, Wutroow fired the lasers and all six skycars pitched sharply upward in an attempt to intercept Yopring's escape vector. Per Ar'alani's orders, Yopring had instead dropped his shuttle to tree top level, spun ninety degrees, and races across the landscape before ascending towards space. Ar'alani stated that they had got what they came for, finding evidence of survivors. Wutroow mentioned that the survivors were keen on making sure whatever was down was kept to themselves. Ar'alani replied that if they were the native inhabitants, the Ascendancy would have no say in the matter but if they were not, they would be very sorry they came there.\nFollowing Yopring's escape on Sunrise, Ar'alani and the Vigilant returned to the final Nikardun base, where they first discovered the asteroid missile launcher. Ar'alani confessed that she didn't know exactly what it was that bothered her about it, but hoped she would recognize it when she saw it. Wutroow mentioned that they still didn't know why the Battle Dreadnought was interested in this base, not to mention they were already late for their return to Csilla. They wondered if this base was connected to the mining operation on Sunrise or whether it was a completely different party. Upon arrival, Biclian reported three ships close to the central base, two warships and what he believed was a Mobile repair base. Ar'alani mused that under normal circumstances the Vigilant could take two warships, but even with the plasma spheres and breachers transferred from the Grayshrike, they were still under armed.Larisom reported that they had caught the edge of a tight beam laser transmission, indicating the recipient of the transmission was directly behind them.\nThe patrol cruiser, marked as Bogey One, fired upon the Vigilant, and Ar'alani gave her crew a series of orders to respond. She ordered Oeskym to disable the thrusters in breachers one and two and then to drop them out of their tubes, and then ordered Octrimo to move them towards the warships, designated bogey two and bogey three. Bogey one began to avoid the breachers, and Wutroow ordered the crew to tractor them back in, which Ar'alani belayed. She told them to tractor onto a chunk of rock to try to draw it up to the cruisers ventral bow area. Bogey one spotted the rock and began to avoid that as well, and headed back in the direction of the breachers. The Vigilant fired on the breachers and the acid engulfed bogey one, leaving it an easy target for the Vigilant. Bogey one exploded, and headed towards the patrol ships. Ar'alani realized that the warships weren't taking anything off the station, but instead putting something in. She ordered plasma spheres and lasers to be fired on the station, but the dock and the two patrol ships jumped to hyperspace.\nAr'alani ordered two shuttles to be prepared to get to the station and dismantle whatever bombs were placed on board. On board the station, Ar'alani pointed out that after the asteroid missile launcher explosion had damaged the station, the attackers charged in and poked holes in the walls to depressurize the compartments until all the Nikardun were dead. They determined the base was a rendezvous point for Yiv's forces, and that it was relatively close to Sunrise and the Ascendancy, perfect for someone who wanted to keep an eye on both. They came to the conclusion that the enemies at the battle that had just taken place and the battle dreadnought they tangled with over Sunrise were the same people. In addition to that, the Nikardun weren't the allies of the newer enemies, merely their tools, and they don't get rid of a tool unless they had something better. They decided it was best to not overstay their welcome in case more patrol ships came along, and began packing their equipment to return to the Ascendancy.\nUpon returning to the Ascendancy, Supreme General Ba'kif informed Ar'alani that the station they had tagged as a repair and refurbishing site was doing work on nyix hulls, suggesting that they were adding it to ships that didn't normally have armor. Running through recent events, they determine that Yiv and thr Nikardun move into the region and begin conquering small nations. At the same time, a civil war takes place on Sunrise, leaving their nyix mines open for taking. The battle dreadnought aliens convince Yiv to build the nyix refurbishment station knowing well they were going to kill the Nikardun anyway. The presence of nyix in thr Agbui jewelry and in Hoxim suggests the Agbui and the Dreadnaught aliens are working together. On top of all that, Ba'kif informed Ar'alani that an alien warship commanded by Jixtus had appeared over Avidich only four hours ago. The war ship was stated to be peace-sealed, and after a short discussion with Mitth Patriel Thistrian, left the planet. Due to the looming threat of an alien warship poking around the Ascendancy, the Defense Council and the Syndicure decided to recall many Expansioanry Defense Fleet ships back to the Ascendancy to bolster planetary patrols. Ar'alani and the Vigilant were stationed above Sposia, home of the UAG. Before returning to her ship, Ar'alani asked Ba'kif if he could set up a meeting for her.\nSitting above Sposia on planetary patrol, Ar'alani was thinking of more drills to throw at her crew to keep them ready when Larisom informed her they were receiving a transmission frkm Ba'kif. He informed Ar'alani that two more of the nine ruling families had begun moving their war ships around, but instead of moving them to bolster planetary defenses, they seemed to be adding an extra presence to Pommrio, Erighal, and Xodlak stronghold worlds. Ba'kif notes that the Patriarch's of the three families continued to claim innocence for the mess that took place at the Hoxim incident, and denied any involvement with Jixtus and the aliens. Ar'alani asked if the video he was selling, which showed Erighal and Xodlak ships attacking an armed freighter while a Dasklo ship looked on, was a hoax or not. Ba'kif replied he was unsure, as the quality was low but all the families were using enhancing techniques to see clearly. Ar'alani interrupted Ba'kif and asked if the Clarr had also used enhancing techniques, to which he replied yes.\nAr'alani noticed that Jixtus had offered Patriarch Thurfian military assistance, as he did all the Patrirchs, but all of their reports indicated they turned it down except the Clarr. The report from Patriarch Rivlex had no mention of military assistance being offered, much less it being refused. Ba'kif replied that Rivlex was the only one to send someone aboard the cruiser, which he claimed was solely for the purpose of gaining a closer look at the battle cruiser. Ba'kif played both the recording from the Mitth and the Clarr simultaneously, and noticed the Clarr version was a quarter second longer. He stated that a pattern was beginning to emerge with respect the Clarr, first they had a longer recording and a visit to the Whetstone, and the fact they sent the Orisson on a tour of all major Clarr worlds. He also added the Orisson's possibly coincidental presence at Jamiron where the alleged Xodlak and Erighal patrol ships attacked four Clarr freighters. Senior Captain Ziinda and the Grayshrike were present at the Attack at Jamiron, and Ba'kif brought her into the discussion. Wutroow informed Ar'alani that the Orisson had entered the system, and she ordered Oeskym to ask what they were doing here.\nComing back to the previous discussion, Ziinda began by telling Ar'alani of the Erighal tradition of marking their warships with subtle dot and line decorations, and how that while all the patterns are smilies, no two of them are exactly like. She continued by saying the two Erighal ships that had attacked the Clarr over Jamiron had the same exact pattern, something Roscu didn't notice or didn't care about. Ziinda also mentioned that not only were they identical, they also matched the marking of an Erighal patrol ship that was at Hoxim. They came to the conclusion someone was counterfeiting Chiss patrol ships, and Ba'kif wondered what the Clarr family thought about the situation. Wutroow suggested they ask Roscu since she was right outside, but Ar'alani believed Roscu wouldn't want to talk to her, considering they hadn't parted on good terms. Ba'kif suggested Wutroow talk to her, which she accepted. Wutroow started by asking Roscu why Ar'alani had flounced off the bridge, and Roscu replied that when she was her Ar'alani's first officer aboard the Parala, Ar'alani had covered up a serious policy violation by one of her officers. Roscu stated that both had managed to skate free, and Ar'alani had resented her since. Wutroow, now having Roscu talking, asked what was going on, and Roscu replied it was quite simple and she was shocked no one else had figured it out. Roscu claimed that despite what Jixtus had said, the Dasklo were not allying themselves with the Xodlak, Erighal, and Pommrio, but instead stretching their family fleet beyond the legal limit. She said the Dasklo were creating fake Erighal ships to further their cause, also noting they had already gotten away with it. Wutroow replied that Jixtus' vid showed the three families working together, but Roscu claimed that everyone thought that because they were too cheap to buy the entire vid. Wutroow asked what the whole vid showed, but Roscu replied she couldn't say, and that she had already said too much. She ended the transmission, leaving Wutroow back with Ar'alani, Ba'kif, and Ziinda. The four of them determined that it was the battle dreadnought aliens creating the fake Chiss ships, and Ziinda pointed out that in the sample vid, the Dasklo ships lifted its bow near the end of the vid, perhaps to fire plasma spheres or initiate a tractor beam, or both. Ba'kif dropped out of the conversation to check on something, while Ar'alani, Ziinda, and Wutroow continued to ponder what the rest of the vid could possibly have shown the Clarr. They came to the conclusion that the whole vid was a set up, a fake confrontation using fake ships, courtesy of whoever recorded the Hoxim battle. Ziinda mentioned they fired uselessly at her over Jamiron, something they picked up from Thrawn's gunners at Hoxim, before cutting herself off. Ar'alani pressed for Ziinda to finish her sentence, but she could not and was interrupted by Ba'kif's return. He reported that he was checking the Orisson's travels since Jixtus arrived, and said that they began checking Clarr strongholds, and then widened their focus, checking out Dasklo shipbuilding centers, in hopes of catching them in the act. He stated that they had one left, Krolling Sen on Ornfra. He ordered Ziinda to go to Ornfra and to do her best to diffuse the situation. He then ordered Ar'alani to hand over command of the Vigilant to Wutroow and take a shuttle to Csilla, as her meeting request had been approved. Ar'alani gave her crew a few orders to prepare for her departure. Wutroow asked Ar'alani if she had any idea about Ziinda's comment about Thrawn's gunners, which she replied in the negatory. Wutroow wished her admiral safe travels, and with that Ar'alani took her leave.\nAr'alani was in a section of the Syndicure she had never been in before, and made her way down a hallway to a room that held General Yiv of the Nikardun. She found Yiv in his casual arrogant position, and he told her that in the months since his capture, he had grown fond of solitude. Ar'alani began the topic of betrayal, and informed him that his empire had been squandered and his conquered nations had been freed. He replied that many had told him this, and he believed her no more than he did them. He believed the only reason he was alive was for the Chiss to use him as a bargaining chip when the Nikardun brought the Chiss to their knees. She retorted that he was alive because the Chiss don't slaughter defeated enemies, and that he still had valuable information. She asked Yiv about his allies, and he replied that the mighty Nikardun had no allies. She informed him that Jixtus has a new set of allies, perhaps even tools, and that they were converting the two listening posts Jixtus suggested to him into shipyards. She continued that it was her belief that Jixtus persuaded him to build the listening posts in positions he needed, and let Yiv do all the work. When the Nikardun failed, he simply killed everyone on board and rebuilt them to his own specifications. Yiv claimed she was lying, and she showed him recordings thr Vigilant had taken at the bases. Yiv asked Ar'alani why she was there, and she replied she needed information about Jixtus. She told him they knew he was working with the Kilji Illumine and the Agbui, and she asked if there were more allies that Jixtus had. He replied that there were, allies and not, but even just names could prove useful under careful analysis. He told Ar'alani that she wanted more than names, she wanted times and locations of meetings and conversations, small bits that were too vague for him to add in his report - she wanted everything there was to know about Jixtus an the Grysks. He gave up the name of the Grysks for no cost, but for all the other information, his price was his freedom. All he asked was to leave the Chiss, with enough equipment and provisions to build a home. He wanted exile, a request Ar'alani didn't believe to be difficult to provide.\nAr'alani left his chamber and was met by Ba'kif outside, who asked her opinion on Yiv's offer. Ar'alani replied that it seemed genuine, but Ba'kif told her that he said Jixtus was on the move against the Ascendancy, and he expected the Chiss to lose. He wanted to find a way off Csilla before that happened. Ba'kif noted that because of Yiv's firm belief in Jixtus destroying the Chiss, they should take the possibility of defeat seriously. Ba'kif said he would get in touch with the defense council to start the process, and Ar'alani noted that he hadn't mentioned the Syndicure. Ba'kif replied that bringing the Syndicure into it would only delay the process, and it was best to leave them out of it. Ar'alani suggested that Ba'kif and the council formally call upon the Nine Ruling Families to provide warships ti strengthen the defense force, and Ba'kif replied he would bring it up but he didn't expect anyone to follow through with it. He noted that aside from the Mitth and Xodlak families, no other families had said the council could call upon their family fleet for help. Ba'kif walked Ar'alani to the main level so she could rejoin the Vigilant over Sposia, and reminded her that the families may be fighting now but when disaster struck they would come together, something Ar'alani knew he didn't believe himself.\nAr'alani and the Vigilant were sent to Jamiron to intervene in hostilities between the Droc and the Tahmie family over the planet. Wutroow mentioned the had no idea what the issue was, and Octrimo, a member of the Droc, put in that his family and the Tahmie had been locking antlers on every topic imaginable for a very long time. The Vigilant entered the system to find a battle already ensued, and took an in-system jump to reach the battle. She called on both families to cease hostilities, which both denied, claiming the Expansionary Defense Fleet had no jurisdiction inside Ascendancy borders. After two more feinted attempts, Ar'alani ordered Oeskym to fire plasma spheres on all eighteen ships, starting with the Tahmie patrol cruiser that had told her to mind her own business. Oeskym had silenced all the ships before Ar'alani ordered him and Octrimo to fire up the tractor beams and move the ships away from each other.\nFollowing the battle, Ar'alani received a call from Ja'fosk, informing her that he didn't know what her goal was but if it was to infuriate the Syndicure, she had succeeded. Ar'alani countered that there was nothing else she could have done, and asked Ja'fosk if the Speakers and syndics had any helpful suggestions as to what she should have done, to which he replied in the negatory. Ja'fosk told Ar'alani that the families were worried, angry, and frightened, and that was not a good combination. Half of them saw Jixtus trying to goad the families into infighting while the other half saw him as the lesser evil. Ar'alani asked if they could kick Jixtus out of the Ascendancy by sending a laser barrage across his bow, claiming it wasn't an attack, but Ja'fosk said she had spent too much time around Thrawn. Ja'fosk ordered her back to Sposia, saying that the Venturous was on its way there now, but currently the UAG was unguarded.\nAr'alani and the Vigilant arrived over Sposia, only to find Admiral Dy'lothe, commander of the Venturous, reporting to have a Nikardun blockade frigate pinned inside the gravity well. Ar'alani immediately ordered an in-system jump from Octrimo and ordered Larisom to acknowledge and request Dy'lothe hold off any action. Wutroow asked if it was Thrawn, to which Ar'alani replied if she knew anyone else with a friend who had a Nikardun warship. Ar'alani wondered if he had come to Sposia after hearing she had been stationed there to find a sympathetic ally, but didn't know she had been sent to Jamiron and now was stuck with Dy'lothe. Larisom reported the the Venturous said it's none of the Vigilant's business, and with that the Vigilant took its in-system jump. She ordered Larisom to tell the Venturous that the Nikardun frigate was commanded by a Chiss officer, and Oeskym to fire a laser salvo between the Nikardun frigate and the Venturous. Larisom reported that Dy'lothe already knew, and was ordered by the Syndicure to detain Senior Captain Thrawn. Oeskym fired the salvo, which got Dy'lothe's attention. Ar'alani informed him that the Syndicure didn't have authority over the Defense Force. Dy'lothe countered that he didn't care who gave the orders, the Syndicure wanted Thrawn and he was going to deliver him. He stated that the frigates captain requested to hold off any action until Thrawn was aboard, and now he was, so he was going to tractor the frigate in.\nAr'alani replied that she would not let him carry out his illegal orders, and just then, the Nikardun frigate charged at the Venturous, and before the Groundlion man-of-war could fire upon it, the frigate did a pitch and roll and and blazed across Sposia's atmosphere. Biclian reported an electrical discharge from the Venturous, and Ar'alani ran through the footage again, and noticed that Thrawn had thrown a crippler net at the Venturous, causing the electrical discharge. With Thrawn making his escape, Dy'lothe's only option to stop him was to fire upon him, which Ar'alani knew he wouldn't do. Confused, Wutroow asked why he would not, and Ar'alani replied that Dy'lothe did not want to capture Thrawn in the first place, and all the legal order blather was purely for the record. She went on and said that Dy'lothe had spent way too many years in the Defense Force to be impressed by any Aristocra, and if the order had come from Ja'fosk, Thrawn would be in the Venturous' brig by now. He had also given hints, such as leaving his shoulder lasers powered down so Thrawn only had to disable the blow cluster, and chatting with Ar'alani instead of tractoring the frigate as soon as Thrawn boarded it. Ar'alani contacted Dy'lothe asking if he needed assistance, and he denied. He reported that he was bringing debris from an asteroid missile launcher that blew itself up at Ornfra.\nAfter concluding her conversation with Dy'lothe, Ar'alani was hailed by Ba'kif, who had just met with Thrawn at the UAG. He informed her that Thrawn had left a message for her. After hearing the message, Ar'alani remarked that Thrawn had finally outdone himself. She realized that even if his plan worked, he would face serious consequences from the Syndicure, and if it failed, it would likely end up with the doom of the Ascendancy. Larisom informed Ar'alani that an urgent message was coming through, and it was a summons from Ja'fosk for all Expansionary Defense Fleet ships to return to Naporar. Ar'alani asked for an exception, as Thrawn had wanted her and the Vigilant at Schesa, which Ba'kif said he could get. She also suggested that he leave the location of Thrawn's desired meeting spot a little vague, so that she and whatever captains and ships joined Thrawn would not be in violation of the summons.\nThe first person Ar'alani called was Senior Captain Ziinda of the Grayshrike, who agreed immediately. Ziinda's first officer, Mid Captain Apros had some reservations, stating that he feels uncomfortable staking the hopes and future of the Ascendancy on a piece of alien tech that Thrawn had borrowed from the UAG, and even if it did work, it would mean a lot of death. Ar'alani replied that that was the whole point, and began to say islolating the Grysk fleet they could do something, but was cut off by Ziinda who wanted a private consultation with her first officer. After getting commitment from Apros, Ziinda re-opened the comm and gave Ar'alani a thumbs up for the mission, and Ar'alani informed her that they would be meeting at Schesa in three days, and asked to pass the word on to more ships, but only ones she could trust. With Ziinda's help secured, Ar'alani ended the transmission.\nThe Springhawk arrived over Sunrise, and was greeted by Admiral Ar'alani and the Vigilant, who deemed the encounter \"Captain Thrawn's Last Stand\". Ar'alani asked Samakro how his mission had went, and he replied that he was told it went fine. Ar'alani questioned why he was told it went fine when he was the one handling it, but Samakro informed her that Thalias convinced him that she had a better chance of persuading one of the Aristocra to deliver the message to the Syndicure. Ar'alani asked Thalias if she did have success in the mission, and she replied that she thinks she did. Ar'alani informed Samakro that Thrawn and Uingali foar Marocsaa were out in the asteroid cluster he passed on his way in, and that had groups towing some of the asteroids towards the planet. She added the Ziinda was on the other side having a conference with the commanders of the nine Paccian gunboats, and she had left an invitation for him. Samakro asked how many other ships she was able to contact, and she replied that she had talked to the patrol cruisers Parala and Bokrea, and the light cruisers Whisperbird and Stingfly, and added that they had sounded receptive. Finally, she added the Captain Raamas and the Clarr family warship Orisson had also joined them. Samakro stated that he thought the Captain's name was Roscu, and Ar'alani replied that Raamas isn't saying much about it but it sounded like Patriarch Rivlex kicked Roscu off command for questioning his role in everything. Ar'alani reported she had to go to the asteroid cluster for a consultation with Thrawn, and she'd told Ziinda that he was on his way.\nWhen the Grysk ships arrived over Sunrise, they found every single Chiss ship dead. Ar'alani listened over the comm as Thrawn spoke to Jixtus, with his last line asking Jixtus if he was ready to surrender. Assessing the enemy, she noticed that the largest Grysk warship, a Shatter-class WarMaster, titled the FateSpinner, was just as large as the ship she and Ziinda had taken down, which she now learned was called the HopeBreaker. The three StoneCrusher-class WarMaster ships, the SkySweep, Armageddon, and Emery, were smaller than the Vigilant, but still larger than the Springhawk and the Vigilant. The eleven Prism-class BattleChief ships were were slightly smaller than Chiss heavy cruisers, and larger than Chiss light cruisers and patrol cruisers that Ba'kif had sent. The whole plan rested on the functionality of the alien technology hidden on a Paccian gunboat, but Ar'alani assured herself that these were the cards she was given, and she would play them as cleanly and cunningly as possible.\nDuring the battle, Ar'alani and deduced that Jixtus was finally commanding the battle from the Grysk side, noting the escape pod that left from the Kilji warship and made its way to the FateSpinner. Up until that point, the FateSpinner had been sitting idly waiting for Jixtus' return, but now that he was back on board, the massive warship began turning towards the Vigilant and the Aelos. Ar'alani asked Thrawn still believed taking the FateSpinner was the best option, and he replied affirmatively, stating that they need to hurt Jixtus enough that he continues to hold back but not too much that will make him pull back his forces. Ar'alani agreed, and summoned the Stingfly to help with this part of the plan. As the FateSpinner reached combat range, both the Vigilant and the Aelos locked tractor beams onto an asteroid that Thrawn had put in position two days prior.\nSo far, everything was going according to Thrawn's plan, but Ar'alani felt a vague sense of foreboding. The Vigilant's sky-walker, Ab'begh had reported a strange resistance on the last leg of their approach to sunrise, and Samakro had told her of the Magys' attempt to take over Che'ri. Samarko's threat had gotten Che'ri and Thalias out of that situation, but Ar'alani wondered what would happen if the Chiss lost the battle, and if the Magys would seek vengeance against the Chiss. The Magys had already made a play for Che'ri and Thalias, and it was possible she would also try for Ab'begh and the Grayshrike's sky-walker Bet'nih. With the FateSpinner nearly to combat range, Ar'alani ordered spheres and lasers to be fired, and the FateSpinner replied with its own lasers and dibber missiles. As the Aelos focused it's lasers on the dibbers, Ar'alani ordered for continuous laser fire, as well as plasma spheres followed by a salvo of breacher missiles. The Grysk warship finally caught on to the danger coming from behind them, and the warships aft batteries came to life as they pummeled away huge chunks of rock from the asteroid. The asteroid disintegrated, revealing the Stingfly's breacher missiles, which had been traveling in the asteroids visual shadow. The breachers slammed into the Grysk warships hull, releasing their acid loads, followed by the Stingfly with lasers blazing, trying to get its first kill of the day. Ar'alani had expected Jixtus to retreat so he could make some repairs on the FateSpinner, but to her surprise, the Grysk warship swiveled ninety degrees, released a salvo of missiles at all three ships, and began diving for the planet below. The FateSpinner found its new vector and was racing sideways, and Thrawn told Ar'alani they would chase him down once enough enemy ships had been destroyed to spare one in the FateSpinner. Ar'alani agreed, and keyed the comm for the Orisson's status. Roscu and the Orisson were still engaging the SkySweep, and Ar'alani informed her that the Springhawk was ready to play bait, and she needed the Orisson and the Grayshrike to play hunter. Roscu acknowledged, and blew up one last section of the SkySweep before Ar'alani sent her the vector for the Orisson to get in position. Roscu and Ziinda fired two breachers at each other as the Armageddon, in hot pursuit of the Springhawk, ran through the cloud of acid. All three ships joined together to take down the final StoneCrusher class war ship.\nAr'alani watched as two BattleChief class ships broke off from the battle and began heading toward the Paccian gunboat which housed the Gravity well projector, and Thrawn ordered Apros, who was in the gunboat, to get read to run. Ar'alani keyed for Thrawn's private frequency, and asked if he wanted the Grysks to have a clean shot, noting that it was incredibly risky and he could lose it all. Thrawn replied that the first shot will be from a distance, so the enemies think the gunboat has extra protection, and he wanted them to get to point blank range before thinking of firing again. Ar'alani offered to go help Apros and the gunboat, but Thrawn replied he needed the Vigilant to stay where it was, as it was the only ship pinning down the FateSpinner. As the two BattleChiefs closed on Apros' gunboat, twelve new ships appeared, and began attacking the two BattleChiefs, which disintegrated in a pair of violent explosions. Ar'alani listened as Thrawn greeted the commanders of the new ships, Senior Security Chief Frangelic of the Garwian Unity, as well as a commander from the Vak Combine.\nThrawn began to inform them that if they wish to coordinate attacks with the Chiss they may do so with Admiral Ar'alani, but he was cut off by Apros who warned Ar'alani that the FateSpinner was coming up behind her. Ar'alani saw the Grysk warship making its way to the end of the battleground to make its escape, and ordered Octrimo to put them in an intercept course. Ar'alani blamed herself, feeling that she was distracted by the battle and the relief of the arrival of the Garwian Unity and the Vak Combine that she forgot to keep an eye on Jixtus, and now it was going to cost her. She realized she couldn't get there in time, and asked Samakro if he could. He replied that he would try, but the Springhawk's pilot, Lieutenant Commander Azmordi, replied that they would not be able to make it as thrusters were only at fifteen percent. Apros joined the conversation and said he would take care of it, hoping to stall the FateSpinner long enough for the Vigilant to reach it. Thrawn ordered him to break off, noting that he was too vulnerable, but Apros continued on, saying he would hold them long enough for the Vigilant or the Springhawk to get there. Ar'alani replied that he couldn't go in alone, and Ziinda said he wouldn't be alone, ordering Apros to run parallel with the Grayshrike covering the gunboat, which would give the Vigilant enough time to catch up. As the FateSpinner passed by the Kilji cruiser, now under command of Qilori, the Whetstone fired on the Grysk warship with all its weapons. With the FateSpinner taking heavy fire from the Whetstone, Ziinda ordered Apros to throttle back, and Ar'alani ordered both ships to rendezvous with the Aelos, citing the battle was just about over.\nAs Thrawn contacted Jixtus for terms of surrender and to render medical aid for the Grysks, Ar'alani remembered what had happened last time they had defeated a Grysk warship, and ordered all Chiss ships to move away from all Grysks immediately. Across the battlefield, all Grysk ships disintegrated in violent explosions - all except the FateSpinner. Jixtus told Thrawn to enjoy his victory, as it would be his last, citing that the leaders of the Ascendancy would make him pay for his treason on that day. Jixtus promised that the Grysks would be back, and Thrawn wouldn't be there to protect his people, before following the rest of the Grysk ships into annihilation. Thrawn ordered damage reports and injuries to the Vigilant, and then contacted Qilori, who informed him that Nakirre was killed by Jixtus, and the Kilji had taken him as their commander. Thrawn asked if he could return the Kilji to their home, as well as taking the pathfinder of the Hammer, Sarsh, back to Guild Concourse 447. Ar'alani noticed a short pause between words from Qilori, and ordered Apros and Ziinda to keep watch incase he tried to make a run for it. After concluding his talk with Qilori, Thrawn asked Ar'alani if she had gotten the damage reports, and she replied that they were coming in, and they weren't as bad as they could have been. Biclian reported they had incoming, and Ar'alani turned around to see the Venturous, and Dy'lothe informed her that he was sent by the Syndicure to assess the situation.\nAr'alani entered the hearing room for Thrawn's trial, and in Ba'kif's eyes, was the only one to recognize the darker sense in the air. She caught his eye and narrowed them, wondering why he was in the observers galley and not one of the tribunal members. The five admirals who would be passing judgement walked in, including Supreme Admiral Ja'fosk, Admirals Dy'lothe of the Venturous and Ers'ikaro of the Bellicose, along with two others. The tribunal members decided that Thrawn would be stripped of all rank in the Expansionary Defense Fleet, as well of his rank as a trial-born of the Mitth. In addition to that, he would be transported to an uninhabited world where he would live out the rest of his days in exile. Admiral Dy'lothe walked over to Thrawn, removed his honor chains off his chest, gave him a small but respectful nod, and turned back.\nAr'alani met with Ba'kif and Thrawn in the formers office, trying to read their eyes. As usual, Ba'kif wore his unreadable neutral face, but for Thrawn, she saw a sense of pleading in his eyes. She wondered if it was for understanding or sympathy, and hoped it wasn't forgiveness, as she wasn't in the mood to forgive someone who had done nothing wrong. Ba'kif asked Ar'alani what she saw in the exile, and she replied resentment for Thrawn, embarrassment for themselves, and revenge. Ba'kif replied that was exactly what the Syndicure intended, and it was exactly what they wanted them to believe. Ba'kif stated that the Syndicure was looking for a scapegoat what happened at Sunrise, and with tensions running high between the families, framing Thrawn was the only way to offer closer. Ar'alani replied that what happened at Sunrise was the salvation of the Ascendancy, and they should have found another way, mentioning they could have picked anyone who was at Sunrise instead of Thrawn. Thrawn finally spoke up and said they did pick, they picked everyone. Ba'kif cleared things up by saying that there was a sizable percentage of the Aristocra who wanted every commander and senior officer who was at Sunrise to be brought up on charges, including Thalias and Che'ri. Thrawn added that she should think of it as a game of Tactica. Ba'kif had surrendered his nightdragon in order to protect his groundlion and whisperbirds. Ar'alani asked if the whole idea was Ba'kif's which he confirmed. He said that the Grysk threat wasn't over, and the Ascendancy needed her and all the other senior officers who knew Thrawn to keep their positions if and when a new threat arised. Ar'alani countered that sending the Ascendancy's best protector to waste the rest of his life on some last planet was a mistake, and then Thrawn finally filled in the last piece.\nAfter Sunrise, the Springhawk went to the edge of lesser space to search for the Grysks and to check off the other bases on Yiv's list. They stumbled across an alien group called Neimoidians, who informed them that the war between the Republic and the Separatists had ended, and neither side had won. The Separatist forces had crumbled, and the Republic was replaced by the Galactic Empire. Ar'alani asked if the Empire could be a threat down the line, and Ba'kif replied it could, but it could also mean a solution. He continued that the Grysks are still a threat, and Ar'alani asked if the plan was for Thrawn to pretend to be exiled, but instead he goes to the Empire and consults with their leader. Ba'kif replied that they couldn't go directly to the Empire as the Syndicure wouldn't have it, but the hope was to leave Thrawn on a planet and hope the Empire bumped into him. He went on and said they had a few planets gathered by watching trade routes and communications, and after a short period if no one showed, they'd pack Thrawn up and move him. All in all, Thrawn didn't expect to be gone for more than a few months, perhaps a year. Ar'alani thanked the two of them for filling her in on what was going on, and Ba'kif told Ar'alani he needed to finalize some details for the exile. He informed her that Thrawn would be travelling aboard the Parala, and she said she would say her goodbyes then. She told him not to leave without saying goodbye, and he said he wouldn't, because that's not what friends do.\nShortly after the Battle of Batonn, Commander Eli Vanto of the Imperial Navy defected to the Ascendancy under the guidance of Grand Admiral Thrawn. Journeying into the Unknown Regions, Vanto came across Ar'alani's ship, the Steadfast, and informed the admiral that he had been sent by Thrawn to aid the Ascendancy. Ar'alani allowed the former Imperial officer to join her ship's crew and assigned him to data analysis.\nFollowing Thrawn and Darth Vader's campaign to rescue Force-sensitive Chiss girls from the Grysks, Ar'alani informed Thrawn that she would return the children to their families. Ar'alani also promised to bolster the defenses of the colony world from which the children were taken.\nAr'alani sat in the command chair of the Defense Fleet warship Steadfast and scowled as the Imperial Star Destroyer jumped to hyperspace. The arrival of the Star Destroyer had forced the Steadfast into full dark mode, giving their quarry more time to escape. Ar'alani signaled to Mid Commander Tanik who began searching along the target ship's last vector. Senior Captain Khresh had a small outburst about the Imperial interference, much to Tanik's amusement. Ar'alani guessed that tales of the outburst would spread back to the Ascendancy to fuel the fire between their respective families. Tanik located the target ship, noting it was maintaining its original heading. The ship jumped to hyperspace, and Ar'alani ordered for the Steadfast to come out of dark mode and sent the vector of the ship to sky-walker Mi'yaric. Ar'alani ordered Khresh to signal all senior officers to report to the bridge conference room, and he acknowledged and implied a question if the newcomer was to be invited as well. Ar'alani replied in the affirmative, and told him to signal Lieutenant Eli'van'to as well.\nVanto reached the bridge and Ar'alani showed him a recording and asked him what he thought of it. He replied that and object, likely a civilian ship it a freighter, came into the system, was shot at, and then promptly left the system. Ar'alani asked him if he believed the shots fired fit the profile of an Imperial weapon. After some careful checking, Vanto replied that they were not Imperial weapons, but some characteristics fit those of a Grysk weapon. Ar'alani asked if it was in fact a Grysk weapon, and Vanto replied that it likely wasn't, but it could be a generation or two behind the ones they had encountered. The group wondered why the ship came out of hyperspace directly into the asteroid cluster and into the attackers targeting zone, and Tanik suggested it could be a mass shadow, that could pull ships out of hyperspace back into real space. Vanto recalled that Imperial Interdictor-class Star Destroyers had the technology aboard, but there was nothing the size of an Interdictor nearby. Ar'alani thanked Vanto and ordered him to return to his station, and that Tanik would send him the information on the incident, in hopes he would catch something others had missed.\nVanto sprinted to the bridge and reached Ar'alani at the comm station and sat down, asking her if it was really him. Ar'alani confirmed that it was indeed Thrawn, and Vanto had to warn him off before he ruined everything. He keyed for the Imperial encryption he's added to the Steadfast's comm system, one that Thrawn would immediately be able to identify and decipher. The Chimaera returned to real space where the Allanar N3 light freighter had appeared a few hours prior. Ar'alani said they would wait and see what happened, hopefully they would be able to salvage the operation. Vanto asked what would happen if they were attacked, and Ar'alani replied that Thrawn and his crew mates would be in danger.\nWhen the Grysks they had been tracking fired on the Chimaera, Ar'alani ordered all systems and weapons to be up in fifteen seconds. She ordered all plasma spheres from the portside salvo to be fired, but all were deflected by the Grysk warships' electrostatic barrier. Thrawn and the Chimaera joined the battle and fired early at the warship, leading Ar'alani to believe Thrawn was no longer in command. Vanto replied that he was and fired early to divert the Grysks attnetion from both the Steadfast and his TIE Defenders. Ar'alani hissed, and asked Vanto if the Chimaera's sensors were good enough to have spotted the electrostatic loci, and he replied yes, also noting that Thrawn was good enough to see the effects of their attack. Ar'alani ordered to belay the plasma spheres and to prepare the breachers. The TIE defenders converged on the electrostatic generator and the point-defense lasers and fired, disarming the barrier. Ar'alani ordered for breachers to be fired, and four of the six made it through, penetrating the hull. As the warship prepared to jump to hyperspace, the TIE defenders attacked once again, disabling the hyperdrive. Ar'alani ordered Vanto to contact Thrawn and tell him to switch to ion cannons, as they would preserve the ship for study. Just then, the Grysk warship exploded, leaving the bridge silent. Vanto informed Ar'alani that Thrawn sent his greetings and would be honored if she joined him on the Chimaera. Ar'alani told him to reply that she would be over at her convenience, and ordered the Steadfast to survey the wreckage. She told Vanto to prepare her shuttle, as he would be joining her to meet his former commander.\nThrawn was waiting for them in the hangar bay, and greeted Ar'alani in Cheunh. He started by saying the Empire appreciated her assistance in defeating the Grysk warship, and she replied that the Ascendancy was happy to do so. Thrawn greeted Vanto, and then informed Ar'alani that the boarding party had done its initial sweep and they should join them as soon as possible. The trio passed by the Allanar N3 freighter secured to the hull, and Ar'alani mentioned its interesting design and that she had never seen it before. Thrawn believed that it was created by one of the Grysk client species, and Ar'alani mused that perhaps they could give some insight regarding the enemy. Thrawn replied that they won't, as they had all been murdered.\nAr'alani, Thrawn, and Vanto reached the command center where Major Carvia and four of his stormtroopers were waiting, along with two shackled Grysks. Ar'alani began by telling them that their backup defense ship had been destroyed, and the Grysks asked what the referred to. Ar'alani continued that the warship was hiding beneath a pile of rock and was looking for trouble, and it found it and paid the price. The Grysks called her bluff, and Ar'alani asked if they would like to see images of its current state, and only then did the Grysks believe it. Ar'alani asked Carvia what happened, and he replied that five humans and eighteen beings of an unknown species were massacred, mentioning the humans were in confinement while the rest were spread around the ship. He added that a young Chiss girl was also found, but she wasn't killed like the others, and perhaps she died before the killings. Ar'alani asked where she is, but Thrawn told her no, saying he understood her want for vengeance but these were his prisoners. She told him they would talk about it later, and asked if she can see the fallen, to which he agrees.\nAs they exit the room, Ar'alani tells Thrawn to never talk to her that way in front of her crew again, and Thrawn asked Vanto if he saw disrespect to his Admiral. Vanto replied that on the surface it seemed so, but that's also what the Grysks saw, causing them to believe there was a wedge created between the two admirals. Both Thrawn and Ar'alani commended Vanto on his conculsion, but Ar'alani added that he missed one crucial part, that she had a surge of hope and Thrawn did not want the prisoners to see that, so he made it look like she was angry to confuse them. She ordered Vanto to call the Steadfast and send sky-walker Vah'nya over. Thrawn asked if Vah'nya had second sight, and Ar'alani confirmed that she did. Bantu acknowledged her order and asked about her hope, and she informed him that Major Carvia's dead Chiss girl could be alive.\nThe trio made their way to the medcenter of the observation post. Bodies lay around the room of human and unidentified species, and one Chiss girl that lay untouched, but looked very much dead. Thrawn asked Ar'alani if it was somnia, and she replied it was a variant of the technique that was developed after his departure from the Ascendancy. She asked for the lights lowered, and Thrawn asked Vanto for a towel soaked in hot water. Vanto walked over to the sink and asked what was happening, and Ar'alani informed him that some sky-walkers, especially the younger ones, sometimes experience a sensory overload, accompanied by symptoms such as headaches, body aches, and vertigo. The cure for it was a mental regimen called somnia. Vanto asked if the Grysks knew if the girl was alive, and Thrawn replied that they'd get to it soon. Ar'alani stated that the girl was alive, and asked Vanto to stand back, as she didn't want the first face the girl saw to be human. Without warning, the girl twitched violently and then collapsed back onto the table, as Ar'alani told her to come back. The girl opened her eyes and lunged forward, wrapping her arms around Ar'alani, bursting into tears.\nAr'alani calmed the girl, and motioned for Thrawn and Vanto to join her when the girl was ready to talk. Thrawn introduced himself and Vanto, and asked for the girls name, to which she replied it was Un'hee. She said she was taken by the Grysks two years prior, and had been serving them since. Ar'alani added that she could prove to be the Grysks greatest mistake, as she had navigated ships through a large part of the Grysk Hegemony. If they were able to find some of those routes, they could unveil some of the secrets the Grysks work so hard to protect. Thrawn mentioned that it now made sense why the aliens didn't tell the Grysks' Uh'nee was alive, as they may have been unwilling clients and sparing the girl was their last act in defiance of their overlords.\nThrawn deduced that the two Grysks' likely have a way of communicating with the hidden supply ship, and if they suspect that Uh'nee was alive, they'd send an attack against the defenseless observation post. Vanto added that sky-walker Vah'nya was also on her way, making two sky-walkers vulnerable. Ar'alani pulled out her com link to way Vah'nya off, but Thrawn told her not to as it may become suspicious. Ar'alani said they won't fire because it would give off their position, and they'd only get one shot in before the Steadfast destroyed it. That shot could either be targeted at Vah'nya's shuttle or the observation post. The group began thinking of ways to protect both sky-walkers when Thrawn got a call, and told the caller to send him in, and then told Vanto to prepare himself for an unpleasant conversation.\nDirector Orson Krennic had sent his Assistant Director, Brierly Ronan, aboard the Chimaera to watch over Thrawn's handling of the Project Stardust gralloc issue. Ronan made his way to the observation post where he saw Thrawn, Ar'alani, Uh'nee, and in his eyes, the Imperial traitor Vanto. Vanto came up with a plan to send the Grysk prisoners back to the Chimaera and see if the hidden Grysk ship would fire on it, uncovering the ship which would then lead them to its base. Ar'alani argued that the mission was none of Ronan's business, but agreed to let him stay as long as Vanto served as his liaison and translator. Thrawn, Ronan, and Vanto watched the plan succeed and watched the Grysk ship flee, as Thrawn predicted they would. Despite Ronan's complaints, Thrawn believed they would be able to track the ship to the Grysk base.\nAr'alani watched as both Uh'nee and Vah'nya sat beside each other with their hands clasped, using second sight. Thrawn asked if she feared that Vah'nya would not be able to extract the necessary information, and she replied that it wasn't a fear. Ar'alani asked what he knew of second sight, and he replied nothing, as he is not privy to the secrets of the Ascendancy. After questioning his loyalty, Ar'alani reluctantly told him that Third Sight was the sight from without, while Second Sight was the sight from within. Ar'alani explained that Vah'nya's mind delves deeply into Uh'nee's, seeking information about Uh'nee's usage of Third Sight while navigating for the Grysks'. She went on and said that normally there was no danger, unless Uh'nee also had second sight, which would cause both girls to be lost within each other's souls. Thrawn asked if there was any record of Uh'nee's abilities, and Ar'alani replied that second sight doesn't normally manifest until the age of ten, while Uh'nee was only seven. Thrawn told Ar'alani that he would need Vah'nya aboard the Chimaera to guide it to the Grysk base, angering Ar'alani. She refused, saying that he would not take Vah'nya into danger, but he replied that she was the only way, and the Steadfast could not be seen by the Grysks' or the Empire. Ar'alani said she was afraid of neither, so Thrawn asked her to be afraid for him. As Ronan reported what happened to Krennic, a mention of Chiss military involvement could end his career and possibly his life. Realizing that would be a blow to the Ascendancy as well, Ar'alani finally gave in.\nAt last, the girls separated, and Vah'nya reported that she had the way to the Grysk base. Ar'alani informed Vah'nya of her new mission, and the girl asked if someone would be there with her, perhaps Lieutenant Vanto. Thrawn told them that Vanto would be there for the beginning, but he had a separate mission for him. Vah'nya asked if Ar'alani would accompany her, and Thrawn added that Vah'nya need Ar'alani more than the Steadfast did. For Vah'nya's sake and the sake of the Ascendancy, Ar'alani agreed. Thrawn stated that they should travel to the Chimaera so they could get the final part underway as soon as possible.\nThrawn had sent everyone off the bridge except Commodore Faro, much to Ar'alani's displeasure. She had argued about it with Thrawn, finally allowing Faro to stay aboard the bridge as long as she manned the weapons station, to which Faro agreed. After clearing the bridge, Faro guided Vah'nya to the helm, and Ar'alani stood silently behind them as Faro instructed Vah'nya on the control, as she did not trust Faro. Vah'nya took the ship to hyperspace while Thrawn filled Faro in on the situation. About an hour later, the Chimaera arrived at a system with a single sun and eight uninhabitable planets, and in the distance, the Grysk ship Thrawn had hoped to find, along with another Grysk ship attached to it. Ar'alani took an unsteady Vah'nya to her temporary quarters, while Faro called for the bridge to return to their stations. Ar'alani retuned as the tractor beam operators were ready for the Slingshot maneuver Thrawn had ordered and asked if they had found the Grysk's, and Thrawn replied that they were tightening the search. He ordered Pyrondi and launch TIE Squadron Two and to activate tractor beams, and using a new slingshot maneuver, sent the TIE's towards the Grysk ships while they were still on low power, remaining invisible to the Grysk's. Ar'alani argued that it was useless as the Grysk's have likely wiped all information on the conjoined ships, but Thrawn countered that there was still ten to twenty life forms on board who had information, most likely the Grysk client species and the members of the pirates way station. Ar'alani pointed out that the ships were bait and the cloaked ship was the primary target, and Thrawn added that a Communications triad, a communications technique used in the Unknown Regions and Wild Space was also a primary target. They wondered where parts of the triad could be, as none of the planets or asteroids were capable of holding them. Ar'alani asked what the goal of the TIE fighters was, and Thrawn replied that they were sent to gather information, provoke a reaction from the Grysk's, and be in prime position to attack should he order it. Ar'alani reminded him that he wanted to capture the client species and rescue the prisoners, and Thrawn said that was only if it was possible.\nAr'alani turned to Faro an asked for a moment, and then turned back to Thrawn and began conversing in Cheunh, causing Faro to head to the weapons station with Pyrondi. While look at the displays, something caught her eye, and noticed the sunlight glinting of the conjoined ships' hulls. She turned around to Thrawn and Ar'alani and informed them about the sunlight, and Thrawn quickly picked up on her point that the ships had moved. Ar'alani suggested it was a sensor-sweep technique, which allowed them to se farther without risking active sensor emanations. Thrawn replied that the rotation was too slow, and said that they'd have more information when the TIE's finished their sweep in half and hour. He told Faro he'd be in his office and took his leave, and Ar'alani asked Faro if he was going to study his artwork. Faro replied that he didn't have any of the Grysk's artwork, but he had some from the Grysk victims. Ar'alani made a noise in her throat, prompting Faro to ask if she disproved of the admiral's ability. Ar'alani replied that her opinions were irrelevant, and Faro fired back asking what her problem was with it. Ar'alani looked sharply at Faro, both women holding their gaze until Ar'alani's glare softened, and she congratulated Faro, saying she was strong and confident, and that Thrawn had chosen well in his choice of protégé. Ar'alani finally answered that she had nothing but respect for Thrawn's abilities, it was his service to the Empire that she disagreed with. She informed Faro that there were grave threats facing the Ascendancy, the Grysk's and their clients mainly, but also others. She added that Thrawn had refused to help them so far, and asked Faro if his life was that much better with the Empire. Faro replied that his life was precarious, but this was where he believed his services were best put to use.\nThrawn returned to the bridge with navigator Vah'nya, and after giving a few orders to Hammerly, Agral, and Faro, continued ahead with Faro and Vah'nya to where Ar'alani was standing. She reminded Thrawn that he had promised to return Vah'nya and herself back to the Steadfast after they had arrived, and Thrawn replied that Vah'nya requested to stay so she may see the defeat of the Grysk's and share the memory with Uh'nee. Ar'alani accepted the point and asked Thrawn what his combat strategy was, and he reminded her of the unanswered question about the triad. He came to the conclusion that the conjoined ships had two of the poles, with the third being on the cloaked Grysk warship, and the two ships were rotating to maintain the required distance between the poles. Thrawn called to Lieutenant Agral who had just located the triads, and informed Hammerly that his target was 8.7 kilometers above or below the conjoined ships, as Thrawn had indicated the cloaked warship was either above or beneath the conjoined ships. Thrawn ordered him them to wait a little, and hailed the Grysk ship telling them they were trespassing in Imperial space and ordered them to power down all weapons and defense. Ar'alani drily asked if he expected an answer, and Thrawn replied he was but not immediately. He offered more bait to the Grysk's by moving the Chimaera forward and launching a shuttle of stormtroopers. After the shuttle reached the tactical's inner sphere, Faro hailed the shuttle with Encryption G77, which was only used by the twelve Grand Admirals, much to Thrawn's surprise, and informed the shuttle she would be joining them to take personal charge of the boarding party. Ar'alani said her actions were insubordinate, and Faro apologized before explaining that the stormtrooper bait wasn't enough for the Grysk's to call their base, so she added the weight of an Imperial Flag officer such as herself. She made way to the conjoined ships when they began rolling in their triad poles, activating the triad without having to move their warship. All of a sudden, the Chimaera turned and Vah'nya called for firing to begin, and the Chimaera and the TIE's bombarded the cloaked warship, breaking it apart.\nThrawn has been aboard the conjoined ships for nearly three hours when Faro received word of an anomaly about twelve hundred kilometers away. She decided against contacting Thrawn about it, but when she informed Ar'alani, the Chiss admiral told her to report it to Thrawn. While informing Thrawn of the anomaly caused by a small gas discharge, Hammerly informed Faro it was pure nitrogen, and Ar'alani said that Grysk ships use nitrogen maneuvering jets. She ordered Faro to prepare a full spread of weapons fire, but Thrawn told her to stay calm, as he wanted to find out how far it was now. He ordered a full turbo laser salvo, and after four full salvos Pyrondi reported a cylinder, which then erupted into a fireball. Ar'alani stated it was a doomsday device, as the Grysk's were prepared for their base to be captured, but didn't want it to be examined. Agral reported that the rest of the doomsday devices would converge at the conjoined ships in a little over four hours, which gave them some time to set up a defense.\nNearing the four hour mark, all the crew of the Chimaera could do was wait. Ar'alani told Faro not to look so glum, assuring that their plan would work. She headed towards where Thrawn was standing when Pyrondi reported a large ship incoming, mentioning it was the Steadfast. Ar'alani ordered Senior Captain Khresh to remain where he was, fighting off her first officer's qualms about being unable to help in case of a Grysk attack. Ar'alani returned from the comm station and reported that Khresh was unhappy with the situation, but still obeyed his admiral. Hammerly called out that seven more doomsday devices had appeared, and one by one Faro triggered explosions that separated the conjoined ships, moving them from their previous location. The seven bombs exploded, and Captain Dobbs reported only minor damage to the Grysk ship. Ar'alani congratulated Thrawn, and he in turn congratulated her and Faro, and Ar'alani gave Faro a smile. Ar'alani contacted the Steadfast and ordered Khresh to move in and capture one of the Grysk ships, leaving the other as bait. Vanto informed Ar'alani that he needed to speak with Thrawn, as there was a slight complication in that plan.\nAr'alani sat in the conference room of the Chimaera with Thrawn, Faro, and Vanto. Ar'alani asked Thrawn if he was convinced , and Thrawn replied he was and he still intended to go through with it. He said that if Grand Admiral Balanhai Savit could be persuaded to join the battle, there would be no doubt of a Grysk defeat. Ar'alani asked Vanto for his thoughts on Thrawn's plan, and he said he believed it was sound and that Captain Dobbs and his TIE Defenders would obey his orders from the Steadfast. Ar'alani then asked Faro if she had any qualms, and the commodore replied that one always has qualms, but all she could do was prepare the best she could. Ar'alani then accepted the plan, and they began preparing. Thrawn, Faro, and the Chimaera headed to meet with Savit, while Ar'alani, Vanto, and the Steadfast awaited the Grysk's arrival.\nWhile waiting for the Grysk's to arrive, Vanto spotted a small ship, and Tanik said it was to small to be armed, likely a scout, but definitely Grysk design. Khresh stated that the scout had seen their location and asked if they should move positions, and Ar'alani replied by asking if the enemy believed they would move. She said they would stay where they were, which would give them better insight to the Grysk's knowledge of Chiss battle maneuvers. Ar'alani asked Vanto if the TIE Defenders and the slingshot tractor operators were ready, and he replied they were. She moved to Vah'nya who stated she was ready, and the girl asked for a word with Vanto, which Ar'alani allowed. Vah'nya made Vanto promise that if there was no hope for the Stedfast against Grysk's, he would kill her and the other sky-walkers, as it was a better alternative to serving the Grysk's. Ar'alani called Vanto and asked him if he was prepared to carry out Vah'nya's request, and he replied he was. She told him to stand ready and hope he would not have to, and that Thrawn would finish in time to assist them.\nTanik reported that two Grysk warships had emerged from hyperspace, and Ar'alani ordered for the ship to turn and face them, as well as preparing plasma spheres. Vanto reported that the tractor beams were ready and waiting her command, and she told him to hold until Tanik reported twenty Grysk fighters from the first ship, and then Ar'alani ordered Vanto to execute the slingshot maneuver. The tractor beam operators used the maneuver to send the cloaked gravity well generator toward the Grysk's causing them to be unable to jump to hyperspace.\nAr'alani hailed the Grysk ship and called them out on invading Imperial space and their many crimes against the Empire. She ordered them to withdraw from the system and return to their own territory. A dry voice called back, asking if the Ascendancy had extended their jurisdiction into the Empire, or if Thrawn was ruling in Palpatine's stead. Ar'alani retorted that the Empire would make its presence known soon enough, and gave them another chance to withdraw. The Grysk replied that Ar'alani amused him, stating that her victories leading up to this point were minor and irrelevant. Ar'alani mentioned that they had also destroyed two Grysk warships, and the Grysk fired back saying the first was destroyed with the Empire's aid, and the second was without Chiss aid entirely. Ar'alani stated that they didn't give military aid, but Thrawn needed Chiss interrogation techniques to locate the communications base, likely confusing and worrying the Grysk commander.\nTanik reported that the fighters were accelerating and preparing to fire missiles, and Ar'alani ordered plasma spheres to be fired, and spectrum lasers on the Grysk missiles. The Grysk's had goaded Ar'alani into wasting two salvos of plasma spheres, and Ar'alani let them believe the battle was playing out by their rules. She ordered a tractor to bring in one of the neutralized fighters, and to slam it into the hull when it got close. The Grysk's did not understand the maneuver until it was too late, and Ar'alani ordered Senior Commander Cinsar to bring it aboard and find it's weakness. Three damaged Grysk fighters headed back to the warship and swapped out for three fresh fighters, and Vanto noticed something odd about the switch, and he asked Tanik for a full sensor bracket of the three new ships. He informed Ar'alani that they should've have gotten so close for a briefing, and Tanik reported that the new ships electrostatic barrier shifted slightly after the exchange. Ar'alani called to Cinsar, who concurred with Tanik, saying that tuning the barriers may allow them to reinforce one another. Khresh stated that if they found a way to retune the fighters they could create interference. Ar'alani asked Cinsar if he found anything else helpful, and he reported that there was some plastic flex seal on the fighter that was highly susceptible to breacher missiles, the only problem being they didn't have enough breachers to use on every individual ship. Ar'alani stated there was another way, and ordered for the helm to prepare the thrusters to full power, as she was taking the battle to the enemy.\nAr'alani ordered the helm to go straight toward the lead warship and ignore all attacks from the fighters, which was acknowledged. She then asked Cinsar if the special package was ready and he replied it was, with a few modifications. The fighters fired on the Steadfast, and Ar'alani ordered lasers to take care of the missiles. Ar'alani ordered for breachers to be fired, two normal ones and a special one Cinsar's team had created. The first breacher was destroyed by the warships lasers, and the second flickered as it was hit. The third breacher's drive sputtered and went silent, and after a laser shot, exploded into a glob of acid. The pool of acid slammed into the cluster of fighters near it, soon draining them of power, and became easy pickings for the Steadfast. The Grysk commander fired at the Steadfast, digging deeper into the hull and destroying the Steadfast. Ar'alani asked Vanto if his forces were ready, and he replied they were. He pressed a button, and the cloaked gravity well generator beneath the second warship flickered, revealing Thrawn's twelve TIE Defenders. Vanto had located the warships laser clusters, missile tubes, and electrostatic barrier nodes which he fed to the the TIEs, who quickly attacked and jumped back into hyperspace. Tanik reported thirty more Grysk fighters coming from the second warship, and as they fine tuned their electrostatic barriers, the twelve Defenders flashed back to the attack, this time forming under the warship where the obliterated all thirty fighters.\nAr'alani ordered the Defenders to commence Gamma Attack, where they would do a second attack on the lead warship, but the pilots wanted to skip ahead to Delta attack, where they would charge from the rear warship and assist the Steadfast in destroying the lead warship. Ar'alani told them to split the difference, and all twelve jumped to hyperspace, the first six coming out attacking the rear warship, while the remaining six came in thirty seconds later firing on the lead warship. The warship fire a few useless shots on the Defenders and the Steadfast before it fell silent. The Defenders jumped to hyperspace before the Grysk warships exploded. Ar'alani ordered for the tractor beam to be secure and called Vanto over, telling him to prepare refreshments for the Defender pilots.\nAr'alani asked Vanto what exactly he had promised sky-walker Vah'nya, and he replied that she asked him to kill her and her fellow sky-walkers should the battle turn against them. Ar'alani asked if he agreed, and he said he did. The admiral asked how he would have done it, and he stated he would have put the girls on an escape pod with as many explosives he could find, wait until the pod was aboard the warship, and then detonate, fulfilling his promise to Vah'nya and taking out as much of the enemy as possible. Ar'alani asked him if he knew what his assignment was, and he replied he didn't. She informed him that he was studying Vah'nya and the other sky-walkers, studying their histories in hopes of finding patters to determine where more sky-walkers may arise. She asked if his assignment felt insignificant now, and he replied it didn't and he would take the lesson to heart. He thanked Ar'alani, who promoted him to the rank of Lieutenant Commander.\nAr'alani returned the Defenders to the Chimaera as it arrived, and informed Thrawn that the Steadfast hadn't sifted through much of the wreckage, but brought over some of what they had for Imperial inspection. She added that Thrawn might find two of the pieces particularly interesting, both appeared to be sections of artwork, possibly Grysk. Ar'alani hoped his studies would prove useful, as they needed as much help as possible to defeat the Grysk, and Thrawn replied that he would do whatever he could. Thrawn asked if Vanto's studies had achieved success, and she replied it had not yet, but if success was possible, she had no doubt he would be the one to achieve it. She said that her official report would feature Lieutenant Commander Vanto prominently, and Thrawn smiled at his former protégé's new position. Ar'alani prepared to take her leave, but not before Thrawn asked her to stay until Assistant Director Ronan had completed his report.\nAfter Ronan offered his report to Director Krennic and Grand Moff Tarkin, Thrawn gave Ronan the opportunity to travel with Admiral Ar'alani back to the Chiss Ascendancy, to help with the upcoming war. Thrawn had suggested to Krennic and Tarkin that Lord Vader be assigned to project Stardust, where Ronan would be unable to hide his contempt for the Emperor. Thrawn assured him that if he or Ar'alani believed he was not useful in the war, they could easily bring him back. Reluctantly, Ronan agreed, saying he wanted hard evidence the Grysk's were a threat to the Empire if he was to stay with the Ascendancy.\nAfter Ronan was taken to Ar'alani's shuttle, Ar'alani told Thrawn she was making a mistake as Ronan was unwilling and unhappy to go with her. Ar'alani said it was dangerous, as harboring a potential traitor was bad but knowing you were doing so was even worse. Thrawn suggested she make sure Ronan would be prepared with information and expertise she wanted the enemy to know. Ar'alani stated that one day, Thrawn would overplan and overthink, and it would come crashing down on him and when it did, she hoped someone would be there to lift him back to his feet. He asked if it might be her, she replied that she feared she may never see him again. She warned him that the chaos was growing in the Ascendancy, and if he did not return soon, there may not be anything for him to return to. Thrawn understood, but stated he must remain with the empire for the time being. She told him to do what he deemed right, and prayed that warriors fortune be in his favor.\nPrior to the skirmish above Solitair, Ar'alani had never seen personhood in non-Chiss individuals. During her visit to homeworld of the Garwians with Thrawn, her view of them changed to them being people. Ar'alani believed that was how Thrawn must have always seen non-Chiss, but he told her that he in fact saw them as assets first and people second. She thought the dedication the remnants of the Nikardun Destiny showed towards their fallen regime was pointless.\nShe was a very devoted officer that cared about the prestige and efficiency of the Chiss Expansionary Defense Fleet. She was known to refer to her officer subordinates by their names and it was noted that she took special effort to learn them. Her tactical genius caught not only the attention of the higher-ups, but also that of Thrawn's, who at one point professed that she had an eminently tactical mind. She was confident in her tactics but was not opposed to outside opinions and realized the importance of different perspectives when it came to analyzing situations.\nAr'alani was a master tactician. She was very patient, known to wait for days or even weeks for the right time to take action. She was fluent in the Chiss primary language Cheunh, as well as the trade languages Meese Caulf, Minnisiat, and Sy Bisti.\nAr'alani was originally introduced in the Star Wars Legends continuity in the 2006 novel Outbound Flight, written by Timothy Zahn. In the current Star Wars canon, Ar'alani first appeared in the 2017 novel Thrawn, the first installment of the Star Wars: Thrawn trilogy of books written by Zahn. She was first pictured in the sixth/final issue of the comic miniseries Star Wars: Thrawn, an adaptation of the novel Thrawn which was written by Jody Houser, illustrated by Luke Ross, and published by Marvel Comics on July 11, 2018. The character's birth name and corresponding core name were later revealed in the 2020 novel Thrawn Ascendancy: Chaos Rising, the first installment of Star Wars: The Ascendancy Trilogy which was also written by Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ar%27alani",
  "/wiki/Ar%27alani/Legends",
  "/wiki/Chiss",
  "/wiki/New_Apsolon/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Alani",
  "/wiki/Template:Cleanup",
  "/wiki/Template:Expand",
  "/wiki/Template:Image",
  "/wiki/Talk:Ar%27alani",
  "/wiki/62_BBY",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Irizi_family",
  "/wiki/Picket_Force_Six",
  "/wiki/Senior_officer_corps",
  "/wiki/Reproduction",
  "/wiki/Admiral",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Clone_Wars",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Eye",
  "/wiki/Vigilant_(Nightdragon_man-of-war)",
  "/wiki/Nightdragon_man-of-war",
  "/wiki/Command_ship",
  "/wiki/Heavy_cruiser",
  "/wiki/Steadfast_(Chiss)",
  "/wiki/Taharim_Academy",
  "/wiki/Cadet",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Commanding_officer",
  "/wiki/Mitth%27raw%27nuru%27s_cheating_charge",
  "/wiki/Supreme_General",
  "/wiki/Ba%27kif",
  "/wiki/Lioaoin_Regime",
  "/wiki/Pirate",
  "/wiki/Patrol_cruiser",
  "/wiki/Parala",
  "/wiki/Garwian_Unity",
  "/wiki/Stivic",
  "/wiki/Unidentified_excursion_liner",
  "/wiki/Gravity_well",
  "/wiki/Csilla",
  "/wiki/Commodore",
  "/wiki/Destrama",
  "/wiki/Grysk_Hegemony",
  "/wiki/Jixtus%27s_plan",
  "/wiki/Jixtus",
  "/wiki/Nikardun",
  "/wiki/General",
  "/wiki/Yiv",
  "/wiki/Nikardun_conquests",
  "/wiki/Non-intervention_policy",
  "/wiki/Nikardun_Destiny",
  "/wiki/Battle_over_Primea",
  "/wiki/Primea_fleet",
  "/wiki/Vak_Combine",
  "/wiki/Primea",
  "/wiki/Planet",
  "/wiki/Sunrise",
  "/wiki/HopeBreaker",
  "/wiki/Jixtus%27s_fleet",
  "/wiki/Senior_Captain_Thrawn%27s_last_stand",
  "/wiki/Core_name",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Senior_Cadet",
  "/wiki/Aristocra",
  "/wiki/Scofti",
  "/wiki/Brodihi",
  "/wiki/Mid_Captain",
  "/wiki/Junior_Commander",
  "/wiki/Pathfinder",
  "/wiki/Qilori",
  "/wiki/Kinoss",
  "/wiki/Senior_Captain",
  "/wiki/Senior_Commander",
  "/wiki/Chaos",
  "/wiki/Garwian",
  "/wiki/Executive_officer",
  "/wiki/Clarr%27os%27culry",
  "/wiki/Boco",
  "/wiki/Homeworld",
  "/wiki/Csaplar",
  "/wiki/Irizi_family_homestead",
  "/wiki/Trial-born",
  "/wiki/Supreme_Admiral",
  "/wiki/Ja%27fosk",
  "/wiki/Irizi%27stal%27mustro",
  "/wiki/Frangelic",
  "/wiki/Ruleri",
  "/wiki/Creators%27_Market",
  "/wiki/Mimott",
  "/wiki/Remembrance_party",
  "/wiki/Solitair",
  "/wiki/Lioaoi",
  "/wiki/Paataatus",
  "/wiki/Kiwu%27tro%27owmis",
  "/wiki/Clarr_family",
  "/wiki/Naporar",
  "/wiki/Sky-walker",
  "/wiki/Ufsa%27mak%27ro",
  "/wiki/Box_system",
  "/wiki/Che%27ri",
  "/wiki/Caregiver",
  "/wiki/Mitth%27ali%27astov",
  "/wiki/Sky-walker_suite",
  "/wiki/Ab%27begh",
  "/wiki/Mitth_family",
  "/wiki/Mitth%27urf%27ianico",
  "/wiki/Urch",
  "/wiki/Urchiv-ki",
  "/wiki/Ambassador",
  "/wiki/Boadil%27par%27gasoi",
  "/wiki/Regime_Diplomatic_Office",
  "/wiki/Lioaoin_Orbital_Command",
  "/wiki/Battle_Dreadnought_class",
  "/wiki/The_Force",
  "/wiki/Chiss_family_hostage",
  "/wiki/Graph_marker",
  "/wiki/Primea_system",
  "/wiki/Vak",
  "/wiki/Obbic%27lia%27nuf",
  "/wiki/Galactic_Republic",
  "/wiki/Ray_shield",
  "/wiki/Electrostatic_barrier",
  "/wiki/Jedi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Batuu",
  "/wiki/Mokivj",
  "/wiki/Convocate_Hall",
  "/wiki/Primea_Central_Command",
  "/wiki/Deathless",
  "/wiki/Irizi%27in%27daro",
  "/wiki/Grayshrike",
  "/wiki/Stybla%27rsi%27omli",
  "/wiki/Schesa",
  "/wiki/Listening_post",
  "/wiki/Missile_launcher",
  "/wiki/Wikivv",
  "/wiki/Taarja",
  "/wiki/Dibber",
  "/wiki/Generalirius",
  "/wiki/Generalissimo",
  "/wiki/Tarleev",
  "/wiki/Yopring",
  "/wiki/Skycar",
  "/wiki/Mobile_repair_base",
  "/wiki/Nyix",
  "/wiki/Agbui",
  "/wiki/Hoxim",
  "/wiki/Avidich",
  "/wiki/Patriel",
  "/wiki/Thistrian",
  "/wiki/Sposia",
  "/wiki/Universal_Analysis_Group",
  "/wiki/Pommrio_family",
  "/wiki/Erighal_family",
  "/wiki/Xodlak_family",
  "/wiki/Hoxim_incident",
  "/wiki/Whetstone",
  "/wiki/Orisson",
  "/wiki/Jamiron",
  "/wiki/Attack_at_Jamiron",
  "/wiki/Krolling_Sen",
  "/wiki/Ornfra/Legends",
  "/wiki/Kilji_Illumine",
  "/wiki/Grysk",
  "/wiki/Droc_family",
  "/wiki/Tahmie_family",
  "/wiki/Venturous",
  "/wiki/Dy%27lothe",
  "/wiki/Groundlion_man-of-war",
  "/wiki/Crippler_net",
  "/wiki/Csap%27ro%27strob",
  "/wiki/Uingali_foar_Marocsaa",
  "/wiki/Bokrea",
  "/wiki/Stingfly",
  "/wiki/Raamas",
  "/wiki/Clarr%27ivl%27exow",
  "/wiki/Shatter-class_WarMaster",
  "/wiki/FateSpinner",
  "/wiki/StoneCrusher-class_WarMaster",
  "/wiki/SkySweep",
  "/wiki/Armageddon",
  "/wiki/Emery",
  "/wiki/Prism-class_BattleChief",
  "/wiki/Bet%27nih",
  "/wiki/Gravity_well_projector",
  "/wiki/Tumaz%27mor%27diamir",
  "/wiki/Nakirre",
  "/wiki/Hammer_(Kilji_picket_cruiser)",
  "/wiki/Sarsh",
  "/wiki/Guild_Concourse_447",
  "/wiki/Bellicose",
  "/wiki/Tactica",
  "/wiki/Neimoidian",
  "/wiki/Batonn_insurgency",
  "/wiki/Commander",
  "/wiki/Eli_N._Vanto",
  "/wiki/Imperial_Navy",
  "/wiki/Grand_Admiral",
  "/wiki/Unknown_Regions",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Imperial_officer",
  "/wiki/Starship",
  "/wiki/Imperial%E2%80%93Grysk_conflict",
  "/wiki/Force-sensitive",
  "/wiki/Unidentified_Chiss_colony_world",
  "/wiki/Steadfast",
  "/wiki/Star_Destroyer",
  "/wiki/Tanik",
  "/wiki/Khresh",
  "/wiki/Mi%27yaric",
  "/wiki/Mass_shadow",
  "/wiki/Interdictor-class",
  "/wiki/Chimaera",
  "/wiki/Allanar_N3_light_freighter",
  "/wiki/TIE/dg_starfighter",
  "/wiki/Major",
  "/wiki/Carvia",
  "/wiki/Stormtrooper",
  "/wiki/Vah%27nya",
  "/wiki/Telepathy",
  "/wiki/Medcenter",
  "/wiki/Somnia",
  "/wiki/Un%27hee",
  "/wiki/Director",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Assistant_Director",
  "/wiki/Brierly_Ronan",
  "/wiki/Project_Stardust",
  "/wiki/Gralloc",
  "/wiki/Slingshot_maneuver",
  "/wiki/Communications_triad",
  "/wiki/Wild_Space",
  "/wiki/Hammerly",
  "/wiki/Agral",
  "/wiki/Encryption_G77",
  "/wiki/Flag_officer",
  "/wiki/Nitrogen",
  "/wiki/Balanhai_Savit",
  "/wiki/Cinsar",
  "/wiki/Skirmish_above_Solitair",
  "/wiki/Standard_day",
  "/wiki/Standard_week",
  "/wiki/Cheunh",
  "/wiki/Trade_language",
  "/wiki/Meese_Caulf",
  "/wiki/Minnisiat",
  "/wiki/Sy_Bisti",
  "/wiki/Star_Wars_Legends",
  "/wiki/2006",
  "/wiki/Outbound_Flight_(novel)",
  "/wiki/Timothy_Zahn",
  "/wiki/Star_Wars",
  "/wiki/2017",
  "/wiki/Thrawn_(novel)",
  "/wiki/Star_Wars:_Thrawn_(novel_series)",
  "/wiki/Thrawn_6",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Thrawn",
  "/wiki/Jody_Houser",
  "/wiki/Luke_Ross",
  "/wiki/Marvel_Comics",
  "/wiki/July_11",
  "/wiki/2018",
  "/wiki/2020",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Thrawn_(audiobook)",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Thrawn:_Alliances_(audiobook)",
  "/wiki/Thrawn:_Treason",
  "/wiki/Thrawn:_Treason_(audiobook)",
  "/wiki/Category:Images_of_Ar%27alani",
  "/wiki/Standard_year",
  "/wiki/59_BBY",
  "/wiki/Template:ThrawnBirthDate"
 ]
}