{
 "name": "Ar Prace",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Fian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ar Prace was a Fian female who served as a maintenance supervisor aboard the Galactic Republic space station Starlight Beacon during the High Republic Era. Due to her species, Prace was more resistant to radiation than a human. Around 230 BBY, Prace was on the station's upper half when it was brought down by Nihil saboteurs. The upper and lower halves of Starlight Beacon split apart as they plummeted towards the planet Eiram, with the top half disintegrating in Eiram's upper atmosphere first, although Jedi Master Avar Kriss was able to evacuate some people aboard the starcruiser Ataraxia beforehand.\nUnlike the upper half, Starlight's bottom half had positional thrusters which allowed it to buy itself some time, but radiation had made both the thruster controls and radiation suits unreachable. Jedi Master Elzar Mann, trying to solve the problem, asked the logistics droid JJ-5145 if any members of more radiation-resistant species were present on the station. The droid mentioned Prace, but noted that she had been on the top half, which had been destroyed by that point, so Mann and Forfive had no idea whether or not Prace lived.\nAr Prace was mentioned in the 2022 novel The High Republic: The Fallen Star, written by Claudia Gray for the Star Wars: The High Republic multimedia project.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Fian",
  "/wiki/Gender",
  "/wiki/Galactic_Republic",
  "/wiki/Supervisor",
  "/wiki/Space_station",
  "/wiki/Starlight_Beacon",
  "/wiki/High_Republic_Era",
  "/wiki/Species",
  "/wiki/Radiation",
  "/wiki/Human",
  "/wiki/230_BBY",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Nihil",
  "/wiki/Saboteur",
  "/wiki/Planet",
  "/wiki/Eiram",
  "/wiki/Atmosphere",
  "/wiki/Jedi_Master",
  "/wiki/Avar_Kriss",
  "/wiki/Star_Cruiser",
  "/wiki/Ataraxia",
  "/wiki/Time",
  "/wiki/Radiation_suit",
  "/wiki/Jedi",
  "/wiki/Elzar_Mann",
  "/wiki/Logistics_droid",
  "/wiki/JJ-5145",
  "/wiki/Droid",
  "/wiki/2022",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Claudia_Gray",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/StarWars.com"
 ]
}