{
 "name": "Aragh",
 "display_name": "Aragh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Skye"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "S'kytri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Supreme Council of the Highland Clans"
     ]
    }
   ]
  }
 ],
 "content": "Aragh was a male S'kytri warrior and Lord of the Highlands of the planet of Skye. Serving as the people's Patriarch, he resided in the planet's capital city, the City of the Winged People.\nA blue-pigmented S'kytri of the Highland Clan, Aragh served as a Guardsman and retainer to the Patriarch Klarymére in 22 BBY. At this time, the crazed Arkanian mutant, Zeta Magnus had brought a pathogen to Skye and unleashed it on her people, declaring himself Magister in the process. Escorting the Patriarch to a rendezvous point with Jedi Knight Obi-Wan Kenobi and his two Padawans, Anakin Skywalker and Halagad Ventor, Aragh collected the lightsabers from the Jedi and escorted them to the gates of the City of the Winged People high in the summits of a nearby mountain. Bringing the Jedi before the Supreme Council of the Highland Clans to discuss the future of the Tyrant which ruled over them, Aragh did Klarymére's bidding at the conclusion of the meeting and released the clone commandos that the S'kytri had placed under their custody when the Jedi arrived. When the Patriarch accompanied the Jedi into the Entyrmion labyrinth beneath the surface of Skye, Aragh waited dutifully back in the capital and served as steward. When Klarymére's daughter, Kharys contacted him with news of the Patriarch's death, Aragh rallied the warriors of the S'kytri people to come to her aide on the slops of Canaitith Mountain where they would do battle with the Evil Tyrant. Fighting valiantly against Magnus' thralls, Aragh witnessed the death of his friend and fellow warrior Herana and fought harder for it.\nSometime after Klarymére's death, Aragh succeeded him as Patriarch of the Highland Clans. When the Millennium Falcon was shot down by Imperial TIE Fighters over the planet Skye, Luke Skywalker and Princess Leia Organa were captured by the Highland clans. Aragh brought the Rebels to trial before the Supreme Council of the Highland Clans, and fully expected that they would be found guilty and the only thing to decide was the punishment. Since Skye had been affiliated with the Empire, and it was known that Leia Organa was a leader in the Rebellion, their fate seemed to be sealed, but councilor Deverén recognized Skywalker's lightsaber as one that she had seen before. The council discussed the possibility that Luke might be the \"one\" they had been waiting for, and Aragh decided he would test Skywalker's honor. He revealed to the young Rebel that Han Solo and Chewbacca had not been killed but had been captured by Majestrix Kharys. Skywalker and Organa both decided that they should invade the Majestrix's fortress, and with that resolution they passed the test and were declared to be friends of the S'kytri. Aragh led Skywalker, Organa, and members of the Highland clans to the fortress, but did not enter the battle forcing the Rebels to fight alone. After the battle was over, the Rebels had rescued their captured friends and Skywalker had killed Kharys, freeing Skye from Imperial rule.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Skye/Legends",
  "/wiki/S%27kytri",
  "/wiki/Gender/Legends",
  "/wiki/Supreme_Council_of_the_Highland_Clans",
  "/wiki/Lord/Legends",
  "/wiki/Highlands",
  "/wiki/Planet/Legends",
  "/wiki/Patriarch_(Skye)",
  "/wiki/City_of_the_Winged_People",
  "/wiki/Klarym%C3%A9re",
  "/wiki/22_BBY/Legends",
  "/wiki/Arkanian/Legends",
  "/wiki/Zeta_Magnus",
  "/wiki/Magister",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Halagad_Ventor",
  "/wiki/Lightsaber/Legends",
  "/wiki/Clone_commando/Legends",
  "/wiki/Entyrmion",
  "/wiki/Kharys",
  "/wiki/Canaitith_Mountain",
  "/wiki/Herana",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Dever%C3%A9n",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story",
  "/wiki/Star_Wars_Annual_(1977)_1",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Marvel_Series",
  "/wiki/Star_Wars_Gamer_1"
 ]
}