{
 "name": "Arakkus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Graveyard of Lost Ships"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange sclerae",
      "black pupils"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light",
      "with green splotches"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Dr. Arakkus was a Imperial scientist and director of an Imperial weapons development complex during the era of the Galactic Civil War. Arakkus was severely irradiated in a Rebel attack that destroyed his facility, leaving him dependent on a protective suit to fend off his impending death. Embittered, Arakkus used negatron charges to accelerate the collapse of a dwarf star, using its intense gravitational pull to lure many passing ships to their doom. Rebel leaders Han Solo and Luke Skywalker eventually overpowered and defeated Arakkus, condemning him to die in his Graveyard of Lost Ships.\nDr. Arakkus was a male Human scientist and director of an Imperial weapons development complex. When his lab was destroyed by the Alliance to Restore the Republic, one of Arakkus' radiation experiments backfired upon him, heavily irradiating him and confining him to a protective suit that only slowed his eventual demise. His fate sealed, the vengeful Arakkus withdrew to an area near the Kabal system to take part in his final experiment. Arakkus created a new home inside abandoned Imperial transport, and used a negatron impact charge bombardment to accelerate the collapse of a dwarf star, making it so dense its gravitational pull was impossible to overcome.\nBlaming the Rebels for his impending death, Arakkus lured numerous Rebel ships to their doom, eventually creating a Graveyard of Lost Ships. Arakkus' experiment finally came to an end when his star ensnared the Millennium Falcon, a starship crewed by Rebel leaders Han Solo, Luke Skywalker and Leia Organa. Solo and Skywalker managed to overpower Arakkus and steal the negatron detonator he had strapped to his suit, and while the Rebels intended to take him alive, Arakkus was determined to die where he stood. Solo and Skywalker granted his wish, detonating the entire ship graveyard behind them as they escaped on the Millennium Falcon.\nEmbittered by his irradiation and the knowledge of his impending death, Arakkus directed his rage outward, developing a desire to bring others to the grave with him—particularly the Rebels who were responsible for his fate. Arakkus became committed to die in his new home in the Graveyard of Lost Ships, and chose a violent death aboard his ship over a continued existence in a Rebel prison. A male Human, Arakkus had gray hair and light skin, which was covered in green splotches after being contaminated by radiation. In addition, his eyes' pupils became black while his sclerae turned orange.\nTo slow the effects of his contamination, Arrakus wore a gold and red protective suit, attached to which was a device that would automatically detonate his Imperial transport's cargo of negatron impact charges should anything happen to him. He was also protected by a pair of guard-globe seeker droids.\nArakkus was originally created for the Star Wars Legends newspaper comic strip Deadly Reunion, written by Archie Goodwin and penciled by Al Williamson, which ran from November 2, 1981 to January 3, 1982.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Graveyard_of_Lost_Ships",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Death/Legends",
  "/wiki/Negatron",
  "/wiki/Collapsed_dwarf_star",
  "/wiki/Gravity/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Radiation/Legends",
  "/wiki/Kabal_system",
  "/wiki/Imperial_Action_transport",
  "/wiki/Star/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Prison/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Guard-globe_seeker_droid",
  "/wiki/Star_Wars_(comic_strip)",
  "/wiki/Deadly_Reunion",
  "/wiki/Archie_Goodwin",
  "/wiki/Al_Williamson",
  "/wiki/November_2",
  "/wiki/1981",
  "/wiki/January_3",
  "/wiki/1982",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Magazine_2",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Star_Wars_Galaxy_Collector_3",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}