{
 "name": "Aran Cho",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Just over 2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Aran Cho was a captain in the Imperial Navy. Born into a family of strict naval officers, he thus received his officers commission at a relatively young age. He quickly gained rank and was reputed to be a brilliant strategist and motivator. But as his crew could attest, he was no fair task master, personally administering corporal punishments, even for the most minor of offenses. He seemed to enjoy this and often chose one or two soldiers to pick on, and in his words \"teach them the virtues of service.\" Despite this he managed to ingrain deep feelings of loyalty within his troops. By being fair to the many, his crew often turned a blind eye to the unlucky few.\nUltimate Adversaries, the only source to feature Cho, allows its villains to exist in any era. According to the text, \"In the Rise of the Empire era, Cho could work for the Trade Federation or Republic Navy . During the Rebellion era, he could be a member of either the Imperial Fleet or Rebel Alliance. During the New Jedi Order era, he could be a part of the New Republic military.\" However, his character stats list a Chariot LAV, which was only introduced in Imperial times. His picture clearly shows an Imperial uniform. Thus, it can be assumed Aran Cho was a member of the Imperial Navy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Ultimate_Adversaries",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Republic_Navy",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/LAVr_QH-7_Chariot"
 ]
}