{
 "name": "Arb Skynxnex",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "11 ABY",
      "Kessel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Arb Skynxnex was a tall, lanky Human who was Moruth Doole's enforcer on Kessel. He used a specially modified weapon known as a double blaster.\nSkynxnex had, prior to 0 BBY, been sent to Kessel's prison, where he barely avoided a death sentence. At some point, he encountered Han Solo during one of his smuggling runs to the planet. Eventually, after the Empire's defeat at the Battle of Endor in 4 ABY, an administrator of the prison, Moruth Doole, staged a revolt against the Imperials present and took control of the planet, along with the nearby Garrison Moon. Doole freed many of the prisoners on Kessel, including Skynxnex, who he made his second-in-command for having previously killed a hitman who had been sent to kill Doole.\nIn 6 ABY, Skynxnex topped Borsk Fey'lya's list of criminals to free from Kessel and send to Coruscant as part of an operation to divert Imperial resources away from Rogue Squadron's covert reconnaissance mission on the planet. Doole refused to give up his enforcer, and Zekka Thyne was moved to the top of the list.\nFive years later, Skynxnex led Doole's forces in their capture of Han Solo and Chewbacca, who had crash-landed on Kessel after being sent by the New Republic as informal ambassadors. During the pair's escape, Skynxnex was killed by an energy spider.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Moruth_Doole",
  "/wiki/Double_blaster",
  "/wiki/0_BBY/Legends",
  "/wiki/Kessel_prison",
  "/wiki/Han_Solo/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Garrison_Moon",
  "/wiki/6_ABY/Legends",
  "/wiki/Borsk_Fey%27lya",
  "/wiki/Coruscant/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Zekka_Thyne",
  "/wiki/Chewbacca/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Energy_spider",
  "/wiki/X-Wing:_Wedge%27s_Gamble",
  "/wiki/Jedi_Search",
  "/wiki/Champions_of_the_Force",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}