{
 "name": "Archer",
 "display_name": "Archer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Archer's squadron",
      "Grand Army of the Republic",
      "Archer's squadron",
      "Archer's squadron"
     ]
    }
   ]
  }
 ],
 "content": "Serving as a captain in the Galactic Republic's Grand Army on the planet of Coruscant, the clone trooper pilot \"Archer\" led a squadron of starfighters. In 19 BBY, the pilots were charged by the Senate Bureau of Intelligence with chasing a starship, the Stellar Envoy, that had been caught using a clearance code it was not authorized to know. Despite Archer's best efforts, the squadron of ARC-170s and V-wing starfighters that later coordinated with two Republic fleets were unable to capture the Envoy.\nArcher was a clone of the bounty hunter Jango Fett from the planet of Kamino created to serve in the Grand Army of the Republic. A clone trooper pilot captain during 19 BBY, he led his own squadron of starfighters. Soon after the Battle of Coruscant during the Clone Wars, Archer's squadron was called upon by the assistant director of the Republic's Senate Bureau of Intelligence to pursue the YT-1300 light freighter Stellar Envoy as it tried to escape the planet of Coruscant after being reported for using a security code its pilots should not have known.\nArcher and his men took up the chase in at least seven ARC-170s and V-wing starfighters. Director of the Senate Bureau of Intelligence Armand Isard gave Archer authorization to disable or destroy the ship; however, though Archer's squadron fired upon the vessel, the Stellar Envoy merged with a swarm of civilian craft trying to leave the planet in the battle's wake. Archer and his pilots were forced to hold their fire and follow the Envoy from a distance. When the Envoy reached the upper atmosphere, it was designated as a target by two Republic Navy fleets, the Open Circle and Home, which the ship flew into for cover from the squadron's resurgent fire. Shots from Archer's squadron struck the craft before the Envoy was caught by a tractor beam from a capital ship, the Integrity. Nonetheless, the Stellar Envoy jumped to hyperspace before the squadron could disable it.\nAs a clone of the bounty hunter Jango Fett, Archer was genetically identical to his template. Fett was a Human male who stood 1.83 meters tall, had brown hair, and brown eyes. Archer was trained to fly starfighters and possessed the leadership skills needed to command his own squadron in battle.\nArcher appeared in the 2008 novel Millennium Falcon by James Luceno. Although it was not directly specified if Archer was a clone or non-cloned officer, the novel stated flatly that the pilots chasing the Envoy were clones. Therefore, this article treats him as a clone.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Clone_trooper_pilot/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Archer_(Tector-class)",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Archer%27s_squadron",
  "/wiki/Captain/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Senate_Bureau_of_Intelligence/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Aggressive_ReConnaissance-170_starfighter/Legends",
  "/wiki/Alpha-3_Nimbus-class_V-wing_starfighter/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Director_of_the_Senate_Bureau_of_Intelligence",
  "/wiki/Armand_Isard/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Open_Circle_Fleet/Legends",
  "/wiki/Coruscant_Defense_Fleet",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Integrity",
  "/wiki/Hyperspace/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/2008",
  "/wiki/Millennium_Falcon_(novel)",
  "/wiki/James_Luceno",
  "/wiki/Officer/Legends",
  "/wiki/Millennium_Falcon_(audiobook)",
  "/wiki/Databank_(original)"
 ]
}