{
 "name": "Arcuse",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ubese"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Granse Confederacy"
     ]
    }
   ]
  }
 ],
 "content": "Arcuse was a male Ubese bounty hunter and a member of the Granse Confederacy.\nProbably born in Ubertica, Arcuse became a bounty hunter soon after 18 BBY, with a great career during the following two decades. He managed to hunt several famous bounties, such as the Exelis Hunters who terrified the Strabin sector. His nomadic nature led him to move after a certain time in the same place. He spent a time working for various Hutts in the Y'Toub system. While in this job, he was introduced to a fellow bounty hunter, Kiran Tatch, and they began a partnership. Tatch appreciated Arcuse's quietness, especially when contrasted to the boastful Hutts.\nAround 1 ABY, Tatch's disdain got the best of him and, during a visit to the Hollastin system, he spat on Glorga the Hutt. As Tatch had been a good employee for a long time, he was ordered to leave instead of being executed. Arcuse decided to leave with him, and both of them were blacklisted. Arcuse knew he would have had a stellar career as bounty hunter should he remain there, but he had decided it was a good time for a change. While departing Hutt Space, they encountered Rodick Tag, an Iotran Braceman who had also taken leave of the Hutts. The three of them formed a slight partnership, and then they met assassin Callandri, who wanted to create a group of bounty hunters. Arcuse decided it would be a good team to join, and the others followed him. The Granse Confederacy was formed with some other members—a team of bounty hunters who almost specialized in hunting Rebel Alliance members.\nArcuse's knowledge of hideouts and his vast network of contacts throughout the galaxy were two of his most valued abilities for the Confederacy. Rebel lieutenant Akul Witig wrote a report on Arcuse specifying that Arcuse showed no cruelty when working and that he was respected and even liked—he had too few enemies for a bounty hunter. Nevertheless, although the Task Force on Alliance Security feared Arcuse's threat, they also thought he would eventually feel the need the leave the Granse Confederacy. But as of 2 ABY, Arcuse still worked with the Granse Confederacy, and had been last seen on Draria.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ubese/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Granse_Confederacy",
  "/wiki/Akul_Witig",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Ubertica",
  "/wiki/18_BBY/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Exelis_Hunters",
  "/wiki/Strabin_sector",
  "/wiki/Hutt/Legends",
  "/wiki/Y%27Toub_system",
  "/wiki/Kiran_Tatch",
  "/wiki/1_ABY/Legends",
  "/wiki/Hollastin_system",
  "/wiki/Glorga",
  "/wiki/Hutt_Space/Legends",
  "/wiki/Rodick_Tag",
  "/wiki/Iotran/Legends",
  "/wiki/Braceman",
  "/wiki/Callandri",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/2_ABY/Legends",
  "/wiki/Draria",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}