{
 "name": "Ardan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Brentaal IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ardan was a Human male native of the Core World Brentaal IV and a lieutenant commander of the Imperial Navy during the height of the Galactic Civil War. He participated in the Imperial subjugations of the planets Ithor, Kashyyyk, Firro, Sinton, and other worlds populated by non-Humans. Ardan later commanded the bridge pit crews of the Super Star Destroyer Executor, the flagship of the Dark Lord Darth Vader, during the events leading up to the Battle of Hoth.\nThe Human male Ardan was a member of the Imperial Navy officer corps during the Galactic Civil War. A native of Brentaal IV, a wealthy commercial planet in the Core Worlds that proved strategically important during the Clone Wars, Ardan was a veteran of the Imperial war machine dating back to the Empire's initial subjugation of the planet Kashyyyk in 19 BBY. He also participated in the Imperial conquests of Ithor, Firro, Sinton, and other non-Human-populated worlds.\nBy 3 ABY, Ardan served with the Imperial Death Squadron as a lieutenant commander aboard the Super Star Destroyer Executor, the personal flagship of the Dark Lord of the Sith Darth Vader. Ardan commanded the Executor's bridge pit crews.\nArdan was present within the Executor's starboard-side crew pit in 3 ABY, monitoring a number of helmsmen, when Vader strode purposefully across the bridge's command walkway to discuss the findings of a reconnaissance Viper probe droid in the Hoth system with Admiral Kendal Ozzel and Captain Firmus Piett. Ardan, along with the rest of the crewmen within the command pit, watched with fearful silence as the Dark Lord passed above them. The probe droid's data revealed the location of Echo Base, the Rebel Alliance's hidden headquarters on the planet Hoth, leading to the Executor's participation in the subsequent Battle of Hoth.\nArdan and the remainder of the Executor pit crew present displayed fearful deference for the presence of Darth Vader as he stalked across the upper command walkway of the flagship's bridge to learn of the Viper probe droid's report in the Hoth system. Ardan also possessed a certain level of Force-attunement. He had brown hair, dark eyes, and light skin.\nLieutenant Commander Ardan wore the standard-issue Imperial officer's uniform during his service aboard the Executor's bridge in 3 ABY. His equipment included a blaster pistol as his personal sidearm.\nArdan appears in the 1980 film Star Wars: Episode V The Empire Strikes Back as one of the unidentified extras among Darth Vader's bridge crew who gaze fearfully at the Dark Lord in the scene introducing the Imperial forces. The panning shot of Ardan and the Executor's bridge crew helps to establish the film's theme of Vader's authoritative dominance over his subordinate officers.\nThe character's name and backstory were first introduced on the \"Lieutenant Commander Ardan\" card as part of the April 1997 Dagobah Limited expansion set of the Star Wars Customizable Card Game.\nThe character image appearing on the Ardan SWCCG card, seen here, is a transposed version of the character's scene from the film. In the card game's image, Ardan's rank insignia plaque and code cylinder are located on his right breast, while in the film they are located on his left breast—in accordance with all other Imperial officers in the film. However, in both the card image and the film scene, the character is looking up and over his right shoulder. Additionally, the card image lacks the presence of the two helmsmen whom Ardan is flanking within that scene in the film.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Arda_system",
  "/wiki/Brentaal_IV/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Brentaalan",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Lieutenant_Commander/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Subjugation_of_Ithor",
  "/wiki/Battle_of_Kashyyyk_(19_BBY)",
  "/wiki/Subjugation_of_Firro",
  "/wiki/Subjugation_of_Sinton",
  "/wiki/Alien/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Death_Squadron/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Helmsman/Legends",
  "/wiki/Viper_probe_droid/Legends",
  "/wiki/Hoth_system/Legends",
  "/wiki/Fleet_Admiral/Legends",
  "/wiki/Kendal_Ozzel/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Firmus_Piett/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Probe_droid/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Force-attunement",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Imperial_officer%27s_uniform/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Imperial_officer/Legends",
  "/wiki/April",
  "/wiki/1997",
  "/wiki/Dagobah_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Rank_insignia_plaque/Legends",
  "/wiki/Imperial_code_cylinder",
  "/wiki/Officer/Legends",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)"
 ]
}