{
 "name": "Arden Telowe",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Arden Telowe was a Human male who operated Mos Eisley's Desert Survey Office during the height of the New Order. He used an outdated Ranger-5 swoop.\nArden Telowe lived in the office in between expeditions into the desert, always in search of scrap or salvage with his Gamorrean assistant Slaff. Additionally, a furtive Jawa visited on a regular basis, updating information. It was suspected that they were engaged in underhanded dealings.\nDespite his efforts to explore as much of the desert as he could, Telowe never updated the official map in the Desert Survey Office. He kept many locations, such as smugglers' hideouts and possible mining locations, to himself, often selling them to the local Hutt crimelords. During the Galactic Civil War, Telowe found himself the object of an intense search, ostensibly led by his long-lost sister, Masda Telowe. However, Masda turned out to be his former wife, whom he had left on Esseles with a huge debt to repay. Masda hired a group of bounty hunters to trail her after she hired some local guides to help track down Telowe. The scouts managed to find Telowe in a canyon cave, and he was approached by his wife and the bounty hunters to seek her revenge.\nArden Telowe appears in the article Secrets of Mos Eisley in 2001's Star Wars Gamer 7.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Desert_Survey_Office/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Ranger-5_swoop",
  "/wiki/Jundland_Wastes/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Slaff",
  "/wiki/Unidentified_furtive_Jawa",
  "/wiki/Smuggler/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Masda_Telowe",
  "/wiki/Esseles/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Guide",
  "/wiki/Scout/Legends",
  "/wiki/Cave/Legends",
  "/wiki/Secrets_of_Mos_Eisley",
  "/wiki/2001",
  "/wiki/Star_Wars_Gamer_7",
  "/wiki/Star_Wars_Gamer"
 ]
}