{
 "name": "Arden_Lyn",
 "display_name": "Arden Lyn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Before 24",
      "500 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "10 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic right arm from Juggernaut war droid"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Followers of Palawa",
      "Legions of Lettow",
      "Galactic Empire",
      "Zaarin coup forces"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "KkH'Oar'Rrhr"
     ]
    }
   ]
  }
 ],
 "content": "Arden Lyn was a female Human and master of Teräs Käsi who belonged to the Followers of Palawa. This ancient Dark Jedi, along with her fellow Padawans, joined the Legions of Lettow upon the advent of the First Great Schism between Force users, and became the lover of Xendor, head of the Legions. When Xendor was killed during the conflict, Lyn ascended to leadership of the Legions, although she was confronted by Jedi Master Awdrysta Pina. Lyn defeated Pina with a powerful Kashi Mer talisman, but the Jedi Master stopped Lyn's heart before being destroyed, sending the martial artist into a Force trance.\n25,000 years later, in 4 BBY, at the end of the Great Jedi Purge, Lyn was reawakened by scouts on Irkalla in the Unknown Regions, before being confronted by three of Emperor Palpatine's Inquisitors: Antinnis Tremayne, Ameesa Darys, and Grand Inquisitor Laddinare Torbin. After fighting off Tremayne and killing Darys, Lyn was maimed by Torbin, who spared her life so that she could serve the Emperor as an Emperor's Hand. Lyn did so for a while, spurred on by the Emperor's promise that he would resurrect Xendor from the dead. When she finally came to accept that Sidious had been lying, she turned rogue, and aided Grand Admiral Demetrius Zaarin in his attempt to abduct the Emperor. The endeavor failed, and Lyn was forced to flee. She was eventually hunted down and killed by a vengeful Darth Sidious.\nA Follower of Palawa born during the early days of the Galactic Republic, the female Human Arden Lyn was a master of the Teräs Käsi martial art. The Followers of Palawa were noted for mastering a technique for falling into a deep Force trance, allowing them to sleep for decades without aging. Along with the other Followers of Palawa, Lyn fell in with the Legions of Lettow, a group of Force users who had embraced the dark side of the Force and turned against the teachings of the Jedi Order. Lyn became the lover of that faction's leader, Xendor, a Kashi Mer exile. After her investment as a Steel Hand of Palawa, she went to the world of Pelgrin to learn her fortune from the Oracle. It told her that she would have to go to Ossus, the home of the Jedi Order, where she would meet a man with a clever mind and a fair face, and learn from him. When she arrived, she was welcomed by the Jedi as a fellow student of the Force, and joined them. While studying on Ossus, she met Xendor, who wanted to learn about Teräs Käsi, and they secretly conversed, each teaching the other. At first, Xendor merely wanted to set up another academy to study other Force traditions. When the hierarchs refused, he and Lyn left the Order and founded their own academy on Lettow, with other Jedi later accompanying them. Relations between the Order and Xendor and his disciples, who became known as the Legions of Lettow, deteriorated, and war was the result.\nThe Jedi and the Legions of Lettow formed armies, with Xendor being the General and leader of the Legions, and Lyn his right hand. Together, the two of them wreaked havoc and destruction during the First Great Schism as they actively waged war against the Jedi Order. During the Battle of Columus, Xendor was slain by Jedi Master Awdrysta Pina. Following Xendor's death on Columus, Lyn ascended to the leadership of the Legions of Lettow. However, she knew that there was no longer a chance of victory, so they fled. Subsequently, she was tracked down by Pina, who followed her to Irkalla. They dueled until Pina disarmed Lyn of her sword, and she used a powerful Kashi Mer talisman that Xendor gave her, to focus all her rage, her grief and her love of Xendor to shatter Pina's katana blade, and drive its pieces into his body, fatally wounding him, bringing joy to her. However, Pina used the technique of morichro to stop Lyn's heart before he died.\nDue to her possession of the Kashi Mer talisman, Lyn survived Pina's attack by falling into a Force trance, possibly due to her study of Palawan techniques. At some point, an unidentified party discovered Lyn's body, and constructed a tomb, in which it was interred. Her decomposed body was located by scouts in the Unknown Regions approximately 25,000 years later during the Galactic Empire's reign at the end of the Great Jedi Purge. They located the Kashi Mer talisman near her body, and as they brought the artifact into Lyn's proximity she was reawakened, her body rejuvenated. Lyn believed the scouts to be the ones who had killed Xendor many years prior, so she attacked them.\nIn 4 BBY, she attracted the attention of Emperor Palpatine's Jedi hunters, the Inquisitors. Imperial Inquisitors Antinnis Tremayne, Ameesa Darys, and Grand Inquisitor Laddinare Torbin located Lyn, and she attacked them with vigor. She severely injured Tremayne and killed Darys before Torbin cleaved off her right arm. Defeated, Lyn was at the Inquisitors' mercy, but although Tremayne wanted her killed, Torbin believed that the Emperor might find some use for her rare martial-arts skills. He was also impressed by her use of the dark side of the Force, so he spared Lyn's life.\nPalpatine, who was also the Sith Lord Darth Sidious, did indeed have great use for Lyn, and promised to bring Xendor's spirit back from the netherworld of Chaos if she chose to serve him. She agreed, and Sidious had her severed arm replaced with that of an ancient pre–Old Sith Wars era Juggernaut war droid. For several years, Lyn served as the Emperor's Hand, believing that she was the only one to hold such a title. In reality, although Lyn was one of the first to be given the title, Sidious employed many other dark side adepts as \"Hands.\" Lyn also operated under the authority of Sidious' apprentice, Darth Vader, and acted as his right-hand woman in matters pertaining to Teräs Käsi. Meanwhile, Lyn served the Empire by training Sidious' Byss Mages and Sovereign Protectors, and at some stage began working as Grand Admiral Demetrius Zaarin's agent on Imperial Center. Eventually, she came to realize that the Emperor had no intention of coming through on his promise to resurrect Xendor. As a result, following the destruction of the Death Star at Yavin, when Sidious tasked her with tracking down and destroying key figureheads in the Alliance to Restore the Republic, Lyn used her new freedom to turn rogue.\nLyn enlisted students to her cause, training them with the intent of eventually turning them against the Emperor. At least three were identified. One of her students was the notorious gaderffii-wielding Hoar, a Tusken Raider from Tatooine who was acclaimed as the greatest fighter of his people as well as a member of the Tusken splinter group Grave Tuskens. She instructed him in the arts of Teräs Käsi, and he in turn fought to defeat her enemies, hoping to gain her favor. Also amongst her recruits were the Gamorrean Thok, whose competitive nature was appealed to when faced with the prospect of battling members of the Alliance, and when he, per Gamorr tradition, served her after she bested him in a close battle after she freed him from prison. Her third student was a Force-sensitive stormtrooper known only as 17786, whose identity was largely a mystery other than being the offspring of Grand Admiral Nial Declann. Among Lyn's targets was the Jedi-in-training Luke Skywalker, the son of Darth Vader, who was at that time struggling against the temptations of the dark side. Lyn sought to capitalize on Skywalker's inner conflict while planning to destroy him. When the Followers of Palawa, still in existence during the Imperial Period, were attacked on Bunduki by an Imperial detachment led by the Dark Jedi Yun, Lyn entered the fray, attacking both the Palawan monks, with whom she had some old scores to settle, and the Imperial forces. Secretly, however, she had intended to use her students to overthrow Sidious. However, her plans failed before they could come to fruition, as Mara Jade, another Emperor's Hand, reported on her activities to the Emperor, forcing her alongside Thok and 17786 to go into hiding .\nLyn was later contacted by Grand Admiral Zaarin, himself planning a coup against the Emperor, who hoped that the master of Teräs Käsi would catch the Emperor off-guard during his planned coup of the Empire. Over Imperial Center, Zaarin's forces disabled the Emperor's Imperial-class Star Destroyer Majestic, which was then boarded. Lyn used her powers to abduct the Emperor, although the conspirators' gambit was eventually foiled due to the arrival of Imperial forces, amongst them Inquisitor Tremayne. With the arrival of Vice Admiral Thrawn and his flagship, the Vanguard, Zaarin's forces were forced to flee Imperial Center. As Lyn fled in the wake of the botched coup, she was pursued by Tremayne, who was still resentful over his loss to her years prior. She began focusing on finding the Kashi Mer talisman that had afforded her earlier success, and had allowed her to cheat death.\nAt some time before or after Sidious' death during the Battle of Endor in 4 ABY, Lyn met and fell in love with the Dark Jedi Durrei, who was part of a \"Restored Empire\" under Supreme Commander Ennix Devian. In 9 ABY, Durrei had been tasked with reclaiming the Kashi Mer relic. Once the talisman was in his possession, Devian no longer saw any use for Durrei. He betrayed him and Lyn to his old sparring partner and Lyn's nemesis, Antinnis Tremayne.\nA year later, Darth Sidious was later resurrected through the use of clones. The reborn Dark Lord of the Sith took revenge on Lyn, killing her conclusively in 10 ABY.\nA destructive individual, Lyn and her lover Xendor wreaked havoc and tumult throughout the galaxy during the First Great Schism. After her reawakening by the Inquisitors, Lyn's mind was highly unstable, and she had been driven insane. When Darth Sidious recruited her to his cause, he appealed to her love for the long-dead Xendor, promising to bring him back to life. Although initially swayed by Sidious's words, Lyn eventually came to the realization that the Emperor had tricked her, and at the first opportunity, turned on him. Lyn was also adept at recruiting students to her cause, as she demonstrated after turning rogue. When faced with a specific opponent to hunt down and confront, Lyn looked for weaknesses to exploit.\nAs a master of Teräs Käsi, Lyn wielded the powers of the Force with malevolence. Her powers were heightened through the use of a Kashi Mer talisman, which allowed her to destroy a Jedi Master. Her skills served her well when faced with Force-adept opponents, such as the Inquisitors, as she was able to fight off three of them at once, even killing Inquisitor Darys in the process. In addition to her Teräs Käsi skills, Lyn was able to harness sound energy, conjuring powerful sonic shock waves. Lyn often used her Force powers and martial arts skills in conjunction with her prosthetic droid arm, which she could use to shoot bolts of energy. She was apparently skilled enough to, along with her students Thok and 17786, subdue and capture Darth Sidious himself.\nLyn's other powers included Battlemind, Force valor, Force grip and push, and Force healing. Lyn could also speak, read, and write Bunduki, as well as Old Galactic Standard. She could also repair items and disable various devices. It was suggested by Jedi Master Tionne Solusar, when writing about Lyn during the Second Galactic Civil War, that Lyn's study of Palawan trance techniques allowed her to survive Master Pina's morichro attack at the end of the First Great Schism.\nArden Lyn first appeared in the 1997 video game Star Wars: Masters of Teräs Käsi. Of the playable combatants in the game, she was one of the two original characters, alongside Hoar. The character of Lyn came about when the game developers felt that there was a need to introduce a strong female character in Masters of Teräs Käsi. She was voiced in-game by Edie Mirman. Some of Arden Lyn's story was introduced in Masters of Teräs Käsi: Prima's Official Hints and Tips, and this was in turn expounded upon in The Emperor's Pawns, written by Abel G. Peña and Juan Schwartz with Pablo Hidalgo. Although the statements in the strategy guide had been vague, Peña decided to establish that Lyn originated in the early years of the Jedi, and placed the character's early life 25,000 years before the events of the Star Wars films. In deepening her character, Peña looked to her name, and believed that it resembled the words \"harden\" and \"ardor.\" Combining the two, he decided to make Lyn a \"passionate woman with a hard heart.\" The article also tied Lyn's story into that of the computer game Star Wars: TIE Fighter, by linking her to Admiral Zaarin's coup attempt. Furthermore, Peña touched on the content of Masters of Teräs Käsi itself, which features iconic Star Wars characters, and Lyn, seemingly facing off in a fighting tournament across disparate worlds. This was explained as being part of Lyn's mission to hunt down Alliance figureheads during the war.\nThe original manuscript for Peña and Daniel Wallace's Who's Who: Imperial Grand Admirals, entitled Dirty Dozen: The Imperial Grand Admirals, stated that Lyn was aided in her abduction of Palpatine by her pupils, and that Zaarin's overall plan included killing the Emperor, which the conspirators were close to doing before being stopped. These references were cut from the final article, although Lyn was still mentioned.\nThe Complete Star Wars Encyclopedia states that Lyn was at first confronted by Tremayne, and then later hunted down by Torbin, which clashes with the events described and detailed in The Emperor's Pawns. Masters of Teräs Käsi also contains a non-canon ending for Lyn, in which she defeats Darth Vader, standing triumphantly over his body.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire",
  "/wiki/24,500_BBY",
  "/wiki/10_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Juggernaut_war_droid",
  "/wiki/Followers_of_Palawa",
  "/wiki/Legions_of_Lettow",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Zaarin_coup_forces",
  "/wiki/KkH%27Oar%27Rrhr",
  "/wiki/Ter%C3%A4s_K%C3%A4si/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/First_Great_Schism",
  "/wiki/The_Force/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Xendor",
  "/wiki/Death/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Awdrysta_Pina",
  "/wiki/Kashi_Mer_talisman",
  "/wiki/Jedi/Legends",
  "/wiki/Morichro/Legends",
  "/wiki/Hibernation_trance",
  "/wiki/4_BBY/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Irkalla",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Antinnis_Tremayne",
  "/wiki/Ameesa_Darys",
  "/wiki/Grand_Inquisitor/Legends",
  "/wiki/Laddinare_Torbin",
  "/wiki/Cho_sun/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Demetrius_Zaarin",
  "/wiki/Battle_of_Imperial_Center",
  "/wiki/Expansionist_Era",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Kashi_Mer_Dynasty",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Steel_Hand_of_Palawa",
  "/wiki/Pelgrin",
  "/wiki/The_Oracle_(Pelgrin)",
  "/wiki/Ossus/Legends",
  "/wiki/Battle_of_Columus",
  "/wiki/Columus/Legends",
  "/wiki/Duel_on_Irkalla",
  "/wiki/Heart/Legends",
  "/wiki/Palawa_hibernation_trance",
  "/wiki/Arden_Lyn%27s_tomb",
  "/wiki/Imperial_Period",
  "/wiki/Jedi_hunter/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Netherworld_of_the_Force/Legends",
  "/wiki/Chaos/Legends",
  "/wiki/Post-Manderon_period",
  "/wiki/Dark_Side_Adept",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Byss_Mage",
  "/wiki/Imperial_Sovereign_Protector",
  "/wiki/Coruscant/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Gaderffii",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Grave_Tuskens",
  "/wiki/Gamorrean/Legends",
  "/wiki/Thok_(Gamorrean_guard)",
  "/wiki/Stormtrooper/Legends",
  "/wiki/17786",
  "/wiki/Nial_Declann",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Bunduki/Legends",
  "/wiki/Yun",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Majestic_(Imperial-class)",
  "/wiki/Force_power/Legends",
  "/wiki/Vice_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Vanguard_(Imperial-class)",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Durrei",
  "/wiki/Restored_Empire",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Ennix_Devian",
  "/wiki/9_ABY/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Battlemind",
  "/wiki/Force_valor",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Bunduki_(language)",
  "/wiki/Old_Galactic_Standard",
  "/wiki/Tionne_Solusar",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/LucasArts",
  "/wiki/1997",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Masters_of_Ter%C3%A4s_K%C3%A4si",
  "/wiki/Edie_Mirman",
  "/wiki/Masters_of_Ter%C3%A4s_K%C3%A4si:_Prima%27s_Official_Hints_and_Tips",
  "/wiki/The_Emperor%27s_Pawns",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Juan_Schwartz",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_TIE_Fighter",
  "/wiki/Daniel_Wallace",
  "/wiki/Who%27s_Who:_Imperial_Grand_Admirals",
  "/wiki/Dirty_Dozen:_The_Imperial_Grand_Admirals",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Category:Images_of_Arden_Lyn",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Game_Room",
  "/wiki/Star_Wars_Galaxy_Magazine_12",
  "/wiki/Star_Wars_Galaxy_Magazine_13",
  "/wiki/Star_Wars_Insider",
  "/wiki/Be_the_Jedi_in_Three_New_LucasArts_Games",
  "/wiki/Star_Wars_Insider_36",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars_Gamer_5",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Insider_66",
  "/wiki/Wizards.com",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_New_Essential_Guide_to_Droids",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Rogue_Leaders:_The_Story_of_LucasArts",
  "/wiki/The_Essential_Atlas",
  "/wiki/Galaxy_at_War",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/The_Shadow_Syndicate",
  "/wiki/Template:SWGTCG",
  "/wiki/Masters_of_the_Force_(Star_Wars_Miniatures)",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_118",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_67",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/Barely_Tolerable:_Alien_Henchmen_of_the_Empire",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Relic_(article)",
  "/wiki/Star_Wars_Adventure_Journal_6",
  "/wiki/Star_Wars:_Blogs"
 ]
}