{
 "name": "Ardinondu Dipolus Daeruun",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Krex"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Military",
      "Task Force Nova",
      "Republic Military",
      "Task Force Nova"
     ]
    }
   ]
  }
 ],
 "content": "Ardinondu Dipolus Daeruun was a Krex male general of the military of the Galactic Republic during the new conflict with the Sith Empire. Daeruun participated in the defense of the Jedi Colony on Ossus, repelled the Nova Blades' incursion on Dantooine, and led the efforts for the defense of the Meridian Complex during the Meridian Complex assault.\nAround 3628 BBY, Daeruun was overseeing the Republic Military's deployments along the Perlemian hyperroute. He was alerted to an Imperial presence near the planet Ossus, discovering the hidden Jedi Colony there. He sought the assistance of the former Jedi Grand Master Satele Shan but she was not able to help. Due to the colony's proximity to Imperial space, Daeruun was not able to get the Republic's authorization to send reinforcements but regardless, he started assembling them although taking more time for this task.\nAs a result of the delay in assembling reinforcements to support the Jedi colony, he was forced to request the aid of the Eternal Alliance's Commander, fearing an Imperial invasion on Ossus before he could come to their assistance.\nGeneral Daeruun was a staunch Republic loyalist. He greatly enjoyed Gatalentan tea offering it to his friends.\nDespite his hulking and fearsome appearance, he was a person of studious nature with a vast passion for the arts. Although he possessed a natural physical strength, Daeruun had no particular love for battle, therefore rarely having carried a blaster with himself. The Krex was tremendously fond of literature, poetry, theater and the visual arts, consequently having decorated his personal quarters with paintings and musical instruments he had dabbled with over the years. Daeruun's paintings of Tau Idair in particular won a painting contest in the Republic and was subsequently featured on Carrick Station. The painting was so popular that Idair received several requests from admirers to be transferred to her unit. Daerunn was also liked to play the game dejarik as an enthusiast, discussing new strategies for the game with his close friend Dol Narlock.\nDaeruun's love of culture and the arts was the primary driver of his enlistment in the military and subsequent years of meritorious service. In his youth, Daeruun's family worked with Jedi Master Vij Markos to help resettle refugees from worlds conquered by the Sith Empire, which instilled him with a deep understanding of the cost of any Imperial victory.\nAccording to Charles Boyd, the Creative Director of Star Wars: The Old Republic, the name \"Dipolus Daeruun\" is a play on the name of Darin De Paul, who voices the character.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Krex",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Task_Force_Nova",
  "/wiki/General/Legends",
  "/wiki/Third_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Invasion_of_Ossus",
  "/wiki/Jedi_Colony",
  "/wiki/Ossus/Legends",
  "/wiki/Nova_Blades",
  "/wiki/Dantooine_Incursion",
  "/wiki/Dantooine/Legends",
  "/wiki/Meridian_Complex",
  "/wiki/Meridian_Complex_assault",
  "/wiki/3628_BBY",
  "/wiki/Perlemian_Trade_Route/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Eternal_Alliance",
  "/wiki/Alliance_Commander",
  "/wiki/Gatalentan_tea/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Painting/Legends",
  "/wiki/Music/Legends",
  "/wiki/Tau_Idair",
  "/wiki/Carrick_Station",
  "/wiki/Dejarik/Legends",
  "/wiki/Dol_Narlock",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Vij_Markos",
  "/wiki/Refugee/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Ardinondu_Dipolus_Daeruun",
  "/wiki/Charles_Boyd",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Darin_De_Paul",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Quite_A_Story_To_Tell",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith",
  "/wiki/Category:Audio_files_of_Ardinondu_Dipolus_Daeruun",
  "/wiki/2017",
  "/wiki/3629_BBY",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/December_13",
  "/wiki/2018",
  "/wiki/July_29",
  "/wiki/2020"
 ]
}