{
 "name": "Ardun Kothe",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dantooine"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 3696 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3642 BBY",
      "Quesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Strategic Information Service",
      "Strategic Information Service"
     ]
    }
   ]
  }
 ],
 "content": "Ardun Kothe was a male Human Jedi Knight who later became a Galactic Republic spy with the Republic Strategic Information Service during the Cold War and the Galactic War.\nA Force-sensitive Human born to Edra and Neven Kothe, he fled his homeworld of Dantooine to the Core Worlds during the Great Galactic War when the Sith Empire invasion began. The Jedi Order was able to identify his Force sensitivity when he was a young boy and recruited him into the Order, training in the ways of the Force and ascending to the rank of Jedi Knight. Working with refugees on Brentaal IV during his career, Kothe was a respected Knight and close with fellow Jedi Syo Bakarn and Jaric Kaedan.\nServing throughout the Great Galactic War, Kothe was responsible for rescuing the Senators Thranz and Falit from an attempt on their lives while on Coruscant. When the Treaty of Coruscant was signed in 3653 BBY, Kothe left the Jedi Order and joined the Republic Strategic Information Service as an agent. Kothe rose swiftly in rank and was granted command of the Mid Rim Operations Group sixteen months after joining the SIS. There, he began a series of covert projects including Operation: Etching Wheel, Operation: Derelict and Operation: Glass Knife.\nAround 3642 BBY, Kothe was given special sanction by the Galactic Senate to operate autonomously and to take any actions necessary to avert a disastrous second war with the Sith Empire. Kothe always believed in fate and redemption and the enemies from the Empire would be converted to the Republic side. He later encountered Cipher Nine who was serving undercover for the Empire. However, he didn't trust that the agent was sincere in defecting and used Nine's own brainwashing code. He and his team used the agent to gather various items for an unknown purpose, while the Agent secretly searched for a way to free themselves of the programming. During a mission on Quesh, Kothe was going after the Shadow Arsenal, an armament of undetectable nuclear missiles developed during the end of the previous war. His plan was to use the missiles as deterrent, believing that threatening Kaas City on Dromund Kaas would cow the Sith into surrendering. He ordered Nine to remain at the shield controls until the missiles were moved, and at which Nine would return to Imperial Intelligence for a few months. Shortly after, the chemicals took effect and the Agent's brainwashing program reset. The agent went in and engaged Kothe who revealed himself to be a former Jedi.\nAt the end of the battle, Nine trapped Kothe behind a force field and activated the security turrets. Kothe remembered the Jedi Code and was shot down by the turrets.\nArdun Kothe appeared to have a particular interest in subversion and recruitment of enemy assets. He wanted to believe his enemies could be converted into friends, but also maintained an awareness of the associated risks. He was instrumental in several slave rebellions: suggestive of strong political beliefs.\nIf the agent player choose light side option he/she can spare Kothe. If so, Kothe and his team will reunite with Cipher Nine on Corellia in place of Neyla Hawkins. Nine explains to him about the Star Cabal and Kothe agrees to help fake the agent's death. Near the end of Chapter 3, Kothe will kill the two Dark Council agents who arrived at the Star Cabal headquarters. He then requests the Black Codex, promising to use it to destroy the Star Cabal before sealing the data. Nine can choose to either betray Kothe and kill him or refuse to hand over the Black Codex, so Kothe departs. If Nine did give the Black Codex to Kothe then he would ask Nine before departing if the agent wanted to join the Republic. Nine could either refuse or join the Republic .\nIf Nine spared Kothe and defected to the Republic, at the conclusion of battle against Revan at Yavin 4 the agent contacts Kothe to update him on the Empire's operations and happenings since their last contact.\nArdun Kothe is voiced by Dude Walker.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/3696_BBY",
  "/wiki/3642_BBY",
  "/wiki/Quesh",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Edra_Kothe",
  "/wiki/Neven_Kothe",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Refugee/Legends",
  "/wiki/Brentaal_IV/Legends",
  "/wiki/Syo_Bakarn",
  "/wiki/Jaric_Kaedan",
  "/wiki/Assassination_attempt_on_Falit_and_Thranz",
  "/wiki/Senator/Legends",
  "/wiki/Thranz",
  "/wiki/Falit",
  "/wiki/Coruscant/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Agent/Legends",
  "/wiki/Mid_Rim_Operations_Group",
  "/wiki/Operation:_Etching_Wheel",
  "/wiki/Operation:_Derelict",
  "/wiki/Operation:_Glass_Knife",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Strategic_Information_Service_strike_team",
  "/wiki/Cipher_Nine",
  "/wiki/Shadow_Arsenal",
  "/wiki/Kaas_City",
  "/wiki/Dromund_Kaas",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Neyla_Hawkins",
  "/wiki/Star_Cabal",
  "/wiki/Black_Codex",
  "/wiki/Dude_Walker",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}