{
 "name": "Arek_Emjon",
 "display_name": "Arek Emjon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Arek Emjon was a Bith male who lived in the settlement of Reestkii decades after the Battle of Yavin. When a group of Zygerrian slavers took control of the settlement, Emjon and all of the other residents were forced into the town hall as captives. As they sat in wait in the hall, the Nu-Cosian crittermonger Bobbajo began telling a story to the children present about he and his pets involvement in the destruction of the first Death Star. Part way through the story, a loud crash outside the hall drew the attention of many within, and Emjon began anxiously whispering with fellow villagers P'nll Vun and Thaddeeus Marien. Bobbajo then continued his tale in order to calm everyone down, but it was soon interrupted again by a series of explosions. Scared, Emjon declared that the whole building was going to collapse. Again Bobbajo continued his tale to keep things calm, and when the Chevin Jol Bengim interrupted to dispute the storytellers claims, the Bith told him to be quite, wanting to here the rest of what he considered a goods story. After Bobbajo finished his tale, the storyteller opened the town hall's doors and revealed that the Zygerrians had all been incapacitated by unknown means. Bobbajo then collected up his pets, which had been loose in the town, and left the townsfolk to claim the slavers riches for themselves. Emjon had large eyes and was hairless like all Bith.\nArek Emjon first appeared in \"All Creatures Great and Small\", a short story written by Landry Q. Walker and released in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bith",
  "/wiki/Gender",
  "/wiki/Reestkii",
  "/wiki/Standard_decade",
  "/wiki/Battle_of_Yavin",
  "/wiki/Zygerrian",
  "/wiki/Slavery",
  "/wiki/Reestkii_town_hall",
  "/wiki/Nu-Cosian",
  "/wiki/Bobbajo",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/P%27nll_Vun",
  "/wiki/Thaddeeus_Marien",
  "/wiki/Chevin",
  "/wiki/Jol_Bengim",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/All_Creatures_Great_and_Small",
  "/wiki/Landry_Q._Walker",
  "/wiki/2015",
  "/wiki/Tales_from_a_Galaxy_Far,_Far_Away:_Aliens:_Volume_I"
 ]
}