{
 "name": "Ares Nune",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Phu system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Phuii"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ares Nune was a Phuii male Jedi Master and Jedi General in the Grand Army of the Republic during the Clone Wars. In 22 BBY, Nune was given a task force—consisting of at least three Venator-class Star Destroyers—to patrol the Phu system for Separatist activity. While on patrol, he and Clone Commander Kite began to discuss the mission on the bridge of Nune's flagship, the Venator-class Star Destroyer Laudable. However, while they were talking, the task force was attacked by the Malevolence, a Confederate warship equipped with two giant ion pulse cannons. Under the command of the Confederate General Grievous, the Malevolence disabled the shields of the entire Republic fleet with its ion cannons and proceeded to destroy the entire task force. Nune and Kite were killed, along with everyone else in the fleet.\nA Phuii male, Ares Nune was a Jedi Master who became a Jedi General in the Grand Army of the Republic during the Clone Wars. In 22 BBY, Nune was assigned a Republic fleet consisting of at least three Venator-class Star Destroyers, including his flagship, the Laudable, to patrol the Phu system for Separatist activity.\nWhile on patrol, the task force's initial sensor sweeps reported no enemy activity. However, Nune, from the bridge of the Laudable, ordered another scan of the area to be sure nothing had been missed. While the secondary sweeps were underway, Nune and Clone Commander Kite, who was also stationed aboard the Laudable, began to discuss their mission.\nHowever, a new Confederate weapon was hiding out of sight of the Republic task force in the form of the Malevolence, a Subjugator-class heavy cruiser under the command of the cyborg General Grievous. As Nune and Kite were finishing up their conversation, Grievous ordered the Malevolence to fire its ion pulse cannons at the Republic task force, which disabled the shields of the entire Republic fleet. The Malevolence destroyed the Laudable, along with the rest of the Republic fleet, killing Nune, Kite, and everyone else onboard.\nThe loss of Nune's battle group was later reported in a press release by HoloNet News. An audio recording taken during the attack survived the battle, and the transmission was played during the broadcast. Despite the quick destruction of the Laudable, the recording stated that an evacuation of the Laudable via its escape pods had been attempted, but the crew was not quick enough to escape.\nNune had a sense of humor, joking about Kite's overly singular-minded outlook on life. Nune was also precautious, ordering another sensor sweep of the Phu system, even though the first sweep reported no enemy sightings. He had green skin and black eyes.\nGeneral Ares Nune was briefly mentioned in The Clone Wars webcomic Prelude, which led into \"Ambush,\" the first episode in the Star Wars: The Clone Wars television series. Nune made his first appearance in the webcomic Shakedown, which led into \"Rising Malevolence,\" the second episode in The Clone Wars television series.\nThe loss of Nune's task force was reported in the in-universe HoloNet News — A Galaxy Divided, the first installment of the online Holonet News podcast series that took place before the events of \"Rising Malevolence.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ares_Nune/Canon",
  "/wiki/Ares_Nune",
  "/wiki/Jedi_General/Legends",
  "/wiki/Nune-class_Imperial_shuttle",
  "/wiki/22_BBY/Legends",
  "/wiki/Phu_system/Legends",
  "/wiki/Phuii",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/Kite_(clone_trooper)",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Laudable",
  "/wiki/Battle_of_the_Phu_system/Legends",
  "/wiki/Malevolence/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Ion_pulse_cannon",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Death/Legends",
  "/wiki/File:Kite_Nune_talking.png",
  "/wiki/Sensor/Legends",
  "/wiki/Subjugator-class_heavy_cruiser/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/File:Ares_Nune_death.png",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars_(webcomics)",
  "/wiki/The_Clone_Wars:_Prelude",
  "/wiki/Ambush",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars_comic_books",
  "/wiki/The_Clone_Wars:_Shakedown",
  "/wiki/Rising_Malevolence",
  "/wiki/In-universe",
  "/wiki/HoloNet_News_%E2%80%94_A_Galaxy_Divided",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_20",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com"
 ]
}