{
 "name": "Arfan Ramos",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi OrderGreen Jedi Council",
      "Green Jedi Council",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Arfan Ramos was a male Human Jedi Master of the Jedi Order and leader of the Green Jedi during the Cold War and the Galactic War between the Republic and the Sith Empire.\nBorn into a wealthy Corellian family, Arfan Ramos had an affinity for The Force that was discovered at an early age. Instead of sending him to the Jedi High Council for training, however, his family gave him over to the Green Jedi of Coronet City--an enclave of Jedi who rejected the High Council's authority and placed loyalty to Corellia above all else.\nLike most of the Green Jedi, Ramos focused primarily on philosophical studies and research into the non-martial uses of the Force. Over the decades, he distinguished himself among his peers and rose to a position of wise, contemplative authority. With the arrival of the Sith Empire and the defection of the local government, however, Ramos recognized the time for pacifism was past, and he was quick to change the Green Jedi's focus. Strong in the Force and a confident and capable leader, he had willingly shouldered the burden that has been thrust upon him.\nMaster Ramos was later present on Corellia where he rallied against the Sith invasion of the planet.\nWhile he was a Jedi by principle, Master Ramos possessed a fiery temper and was quick to words of aggression. Multiple times during his final battle he angrily shouted at his foes or proclaimed their death would be his doing. His anger was enough to see both his students and his fellow Councilors express concern, often forcing him to quote the Jedi Code.\nAs a Master sitting on the Corellian Jedi Council, he possessed substantial ability in the Force. In battle, he wielded a yellow-bladed lightsaber, eschewing the common green color sabers analogous to the Green Jedi. Combining his anger into sheer skill, he was a deadly opponent in combat.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/3640_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Green_Jedi_Council",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Corellian_Jedi",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Corellian/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Coronet_City/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}