{
 "name": "Aric Nightdrifter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "During the mission to Vashka",
      "Vashka"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "Aric Nightdrifter, designated TK-1403 as a stormtrooper, was a human male who served in the Galactic Empire's Stormtrooper Corps under Captain Jor Tribulus during the battle against the Alliance to Restore the Republic on the moon of Endor.\nFollowing the Empire's defeat at the battle and the formation of the New Republic sometime afterwards, Nightdrifter was retired by the Republic to Vashka Valley Retirement Facility 48, an asylum on the planet Vashka. During his tenure at the asylum, the establishment was overrun by Vashkan apidactyls, violent insectoids who turned the building into a huge wax covered nest. The facility's staff fled, abandoning Nightdrifter and the other patients to the apidactyls. Alongside several other patients, he managed to survive in the building's basement, but over time each of the other survivors was killed and sealed inside wax cells by the insectoids. Nightdrifter's solitude in the basement was eventually interrupted by the arrival of the mercenary Bazine Netal, who forced him to show her the location of Tribulus' corpse so that she could locate a steel case the captain had owned. While Netal recovered the case from the wax cell Tribulus' body was stored in, Nightdrifter was knocked out by Delphi Kloda, Netal's old mentor and competitor in searching for the case. Kloda took the case and sealed his former student in the wax cell, before alerting the apidactyls to her presence. The insects swarmed toward the cells and killed Nightdrifter while Netal made her escape, eventually killing Kloda and avenging the old stormtrooper.\nAric Nightdrifter first appeared in the short story \"The Perfect Weapon,\" which was written by Delilah S. Dawson and published as an eBook in 2015.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mission_to_Vashka",
  "/wiki/Vashka",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Stormtrooper",
  "/wiki/Captain",
  "/wiki/Jor_Tribulus",
  "/wiki/Battle_of_Endor",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Moon",
  "/wiki/Endor",
  "/wiki/New_Republic",
  "/wiki/Vashka_Valley_Retirement_Facility_48",
  "/wiki/Planet",
  "/wiki/Vashkan_apidactyl",
  "/wiki/Insectoid",
  "/wiki/Death",
  "/wiki/Mercenary",
  "/wiki/Bazine_Netal",
  "/wiki/Steel",
  "/wiki/Delphi_Kloda",
  "/wiki/The_Perfect_Weapon",
  "/wiki/Delilah_S._Dawson",
  "/wiki/EBook",
  "/wiki/2015"
 ]
}