{
 "name": "Arien_Yage",
 "display_name": "Arien Yage",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Between 21 BBY and 12 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Remnant",
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Arien Yage was a Human female commissioned as a Captain in the Navy of the Imperial Remnant. During the Yuuzhan Vong War, she held command of the Imperial frigate Widowmaker, and following the Battle of Borosk she and her crew joined the expedition of Jedi Master Luke Skywalker, in his attempts to locate Zonama Sekot, under the orders of Grand Admiral Gilad Pellaeon.\nPrior to the Battle of Ithor, Captain Yage was assigned to the Chimaera as its Commander. Her relationship with Supreme Commander Gilad Pellaeon appears to have been quite personal; through interactions with him she consistently referred to, and at times addressed him by his personal name, \"Gilad\", a highly unorthodox form of communication between a Navy Captain and a Grand Admiral.\nIndeed, Admiral Pellaeon appeared to hold considerable trust in Yage, as he advised the Jedi aboard the Jade Shadow who appeared towards the end of the Battle of Bastion to seek out Captain Yage at Yaga Minor. Yage held discussions with Jedi Knight Jacen Solo, while reluctantly awaiting orders from the Council of Moffs, who hoped to fill the power vacuum that appeared to form with the supposed death of Pellaeon.\nAfter learning that Pellaeon had indeed survived, Yage was contacted by General Berrida, who like the Council was unaware of the Grand Admiral's survival. As a show of faith, Solo aided Yage by answering the communication from Berrida instead of Captain Yage, so as to stall the Council's attempts to bring her under their command. With Pellaeon in a critical condition, he was vulnerable and keeping his survival secret became a priority for Yage.\nWhile Pellaeon recovered in a bacta tank, Yage became somewhat of an ally to the Jedi. Pellaeon soon revealed his survival to the Moffs who in fear of his wrath at their intrigue hastened to comply with his commands to flee for Borosk and ready for battle with the Yuuzhan Vong. During the battle Yage acted as Pellaeon's personal assistant and following the Imperial victory, he ordered her to aid the Jedi in their expedition, by adding the Widowmaker to their arsenal.\nLater, while a portion of the expedition team landed on the planet of Munlali Mafir in the Unknown Regions, Yage remained in orbit aboard the Widowmaker. When Master Skywalker and his ground team returned from an unsuccessful mission to the planet, Yage contacted him to make him aware of an approaching Chiss force. Soon the Chiss made contact with Yage personally, demanding she arrange an audience with Skywalker.\nDuring the audience with the Chiss, Yage was astounded by the Chiss commanders rudeness, and advised against complying with her suggestion to journey to Csilla. However, the task force did indeed venture to the Chiss homeworld, where the Jedi discovered the whereabouts of Zonama Sekot.\nAt one point in Force Heretic II, Yage is referenced as \"Mayn\" following a shift in the novel from the plot involving Bakura.\nWhile writing her 2008 novel Legacy of the Force: Revelation, author Karen Traviss was seeking an unrepentant Imperial character to resurrect as part of a Drake's Drum, ship-captain-returned-from-the-dead theme. She wanted to use a female character whose unrepentant style would contrast with the character of Cha Niathal, and she turned to her friend James Gilmer for advice. Gilmer considered suggesting both Arien Yage and Moff Leonia Tavira before ultimately choosing the character of Admiral Daala.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/12_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Widowmaker_(frigate)",
  "/wiki/Battle_of_Borosk_(Yuuzhan_Vong_War)",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Zonama_Sekot/Legends",
  "/wiki/Battle_of_Ithor",
  "/wiki/Chimaera/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jade_Shadow",
  "/wiki/Battle_of_Bastion",
  "/wiki/Yaga_Minor/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/General/Legends",
  "/wiki/Berrida",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Borosk/Legends",
  "/wiki/Munlali_Mafir",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Csilla/Legends",
  "/wiki/Todra_Mayn",
  "/wiki/Bakura/Legends",
  "/wiki/2008",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/Karen_Traviss",
  "/wiki/Cha_Niathal",
  "/wiki/Leonia_Tavira",
  "/wiki/Natasi_Daala",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_I:_Remnant",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_II:_Refugee",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_III:_Reunion",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/28_ABY/Legends",
  "/wiki/Jedi_Council_Forums",
  "/wiki/May_25",
  "/wiki/February_18",
  "/wiki/2013"
 ]
}