{
 "name": "Arik_Stijhl",
 "display_name": "Arik Stijhl",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Arik Stijhl was a Human male who served in the Republic Navy and later as a Field Commander in the Rebel Alliance.\n\nStijhl started his career with the Old Republic Navy but never saw action. He became known for his ability to get groups the supplies they needed as efficiently as possible. This led him to be assigned by the Alliance High Command to the Ordnance and Supply Inner Rim division. He was quartermaster of a training base where T'Charek Haathi was also stationed. She often interfered with his plans and schedule, frustrating him.\nStijhl was commanding officer of Drop Point: Gelgelar. He was on-duty when his communications officer Kovings informed him that The Maker light freighter had requested permission to land. He sardonically suggested that they should have shot the freighter down. Once the ship landed, he boarded it and met with the Major T'Charek Haathi who was in charge of the freighter. He was also introduced to Captain Ivhin Jayme and Dren Nord. Stijhil questioned Haathi on her reason for coming to his base. She stated that she needed some supplies and the colonel had his aide Maglenna Pendower come onboard to provide him with an inventory. The freighter suffered a power outage that injured Morgan Q. Raventhorn. After the tech was treated by Pendower and evacuated to the medical suite in the base, Stijhl came back and offered Haathi the assistance of Sergeant Nofre Ecls to get The Maker running again but warned the tech not to perform any repairs that went around established safeguards. A commotion arose outside the freighter, and Stijhl left to investigate. As he exited the ship, he caught sight of the battle between Rebel security forces and the Doom Slayer assassin droid. He ordered his personnel to get to cover and started to tell Nord to get everyone on The Maker but was hit by blaster fire and knocked unconscious. Nord carried him onto the freighter. Stijhl and the surviving personnel managed to evacuate the drop point and escape to a Rebel medical frigate before the assassin droid self-destructed and destroyed the warehouse.\nAfter recovering, he meet with Haathi and her team to debrief them on what happened. Raventhorn explained that they had stolen the freighter from outlaw droid manufacturer Sythluss Leethe and had inadvertently activated the Doom Slayer. Stijhl demanded that Haathi's team replaced all the material that was lost in the warehouse's destruction. She agreed, but requested that Pendower replace Nord as medic on her team. Exasperated, Stijhl agreed.\nStijhl was a stickler for details and timetables. He was well-respected by his underlings.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Field_Commander/Legends",
  "/wiki/Galactic_Republic",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Ordnance_and_Supply/Legends",
  "/wiki/Inner_Rim",
  "/wiki/Quartermaster/Legends",
  "/wiki/T%27Charek_Haathi",
  "/wiki/Drop_Point:_Gelgelar",
  "/wiki/Communications_officer",
  "/wiki/Bendlar_Kovings",
  "/wiki/The_Maker_(YT-1300)",
  "/wiki/Light_freighter/Legends",
  "/wiki/Major/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Ivhin_Jayme",
  "/wiki/Dren_Nord",
  "/wiki/Maglenna_Pendower",
  "/wiki/Morgan_Q._Raventhorn",
  "/wiki/Sergeant/Legends",
  "/wiki/Nofre_Ecls",
  "/wiki/Doom_Slayer",
  "/wiki/Assassin_droid/Legends",
  "/wiki/Hospital_ship/Legends",
  "/wiki/Sythluss_Leethe",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Special_Ops:_Drop_Points",
  "/wiki/Star_Wars_Adventure_Journal_14"
 ]
}