{
 "name": "Arikakon Baraka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dac"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic Navy",
      "Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "Arikakon Baraka was a male Mon Calamari Admiral from Dac who served in the Galactic Republic Navy during the Clone Wars.\nArikakon Baraka, a male Mon Calamari, was born on his species' homeworld of Dac. Baraka came from a long line of military men, as his father and his father's father had been soldiers; indeed, Baraka had been chosen to become a professional soldier from birth. BY 22 BBY, he had won scars and experience in over one hundred regional conflicts.\nBy the time of the Clone Wars, a galaxy-spanning conflict between the Galactic Republic and the Confederacy of Independent Systems, Baraka had attained the rank of admiral within the Republic Navy. During the first year of the war, he was given command of a clone trooper training program on the watery planet of Vandor-3, operating out of the supercruiser Nexu. Baraka discovered that he greatly disliked the clones, and saw their mass-production and utter similarity as the end of the Republic's great military traditions. Overseeing fifty thousand clones, including Alpha-98, Baraka subjected them to a brutal—and sometimes lethal—training regimen.\nIn 21 BBY, Baraka was dispatched to Ord Cestus and positioned the Nexu in orbit over the planet. On the surface, a mission to destroy a new type of droid was well underway, led by Jedi Masters Obi-Wan Kenobi and Kit Fisto. Along with a local rebel group fighting against the Five Families, the Separatist-aligned rulers of Ord Cestus. Alpha-98, who had previously been sent to Ord Cestus after his successes on Vandor-3, accompanied the Jedi as well.\nSoon, Kenobi and Fisto left on a mission to sabotage the droid factory, attempting to avoid an orbital bombardment by Baraka's vessel. If the Jedi were unable to pinpoint the factory's location, the entire city of ChikatLik would be leveled by the Nexu, to make certain that the \"Jedi Killer droids\" would not survive. While the Jedi were away, Alpha-98 discovered where the Five Families were hiding, and slipped away from his fellow clones in order to assassinate the leaders. After encountering heavy resistance, the forces on the ground ordered Baraka to begin the orbital strike, an action which would cost the lives of millions of innocent beings. At the same time, Alpha-98 discovered that though he had indeed found the Separatist leaders, he could not gain access to them; instead, he transmitted a targeting code into orbit, calling the strike upon his own location.\nOn board the Nexu, a clone technician brought the transmission to Baraka's attention. The admiral joined the clone at his station as the technician managed to decode the signal, which changed the coordinates to a location near Kibo Lake. Baraka briefly checked the veracity of the location, then commanded his vessel to commence the strike. In moments, the entire facility was wiped out, killing everyone within, including the Five Families and Alpha-98. Soon after, Kenobi and Fisto managed to end the threat of the Jedi Killer droids as well.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Admiral/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Vandor-3",
  "/wiki/Supercruiser",
  "/wiki/Nexu_(starship)",
  "/wiki/Cloning/Legends",
  "/wiki/CT-96/298",
  "/wiki/21_BBY/Legends",
  "/wiki/Ord_Cestus/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Mission_to_Ord_Cestus",
  "/wiki/JK-13_security_droid",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Desert_Wind",
  "/wiki/Five_Families",
  "/wiki/Droid/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/ChikatLik",
  "/wiki/Assassin/Legends",
  "/wiki/CT-9/85",
  "/wiki/Kibo_Lake",
  "/wiki/The_Cestus_Deception",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}