{
 "name": "Ariole Yu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sixth Kin"
     ]
    }
   ]
  }
 ],
 "content": "Ariole Yu was a human male who served as a lieutenant in the Sixth Kin criminal organization, led by Wen Delphis. He was formerly romantically involved with Just Lucky, an assassin who undertook jobs for the Sixth Kin for some time. Eventually Lucky left Yu and the Sixth Kin, but the two were pulled back together by Wen Delphis, who sent them to the Auction for Han Solo to kill Gallin Crae, the two's former mentor who had betrayed the Sixth Kin to join the syndicate Crimson Dawn.\nAriole Yu was a human male who lived during the Imperial Era. As a child, Yu was orphaned and taken in by the criminal organization called the Sixth Kin by its leader, Wen Delphis, and was trained to fight and kill for the organization. Yu was mentored by Gallin Crae, one of the Sixth Kin's lieutenants. Crae also mentored Just Lucky alongside Yu, and the three came to consider each other a family.\nYu and Lucky eventually began a romantic relationship with each other. The two's relationship wasn't smooth at times and they pulled apart on at least one occasion before coming back together. One night, after the two stayed together in an apartment in the South Stretch Worker's District of the city Canto Bight, on the planet Cantonica, Yu was awoken by Lucky leaving their bed early and getting dressed to leave. Yu asked where he was going, but Lucky only told him to go back to sleep. But Yu stopped him from leaving, and told him that he had a question he wanted to ask. Yu prefaced the question by telling Lucky that he had been thinking about their future together, telling him that he loved him and wanted to spend the rest of his life with him. But as Yu started to ask the question, Lucky cut him off by kissing him on the forehead and telling him to ask him when he got back. But Lucky was really abandoning both Yu and the Sixth Kin because his brother Pak's debts were catching up to him, and he didn't want to bring that into Yu's life and because he felt he needed to do what was necessary to protect his brother.\nA few years later, Yu confronted Just Lucky's brother, Pak, who was indebted to Delphis, leaving him with a bruise on his face. After Lucky went back to working for the Sixth Kin to pay off the debt, he ran into Yu on Canto Bight while returning to Delphis following a successful job. Yu threatened him about his brother's situation and asked him about what he thought of the bruise he left on him, to which Lucky remarked that Yu never changed and joked that if he was desperate to see him he could just call. Yu accompanied Lucky as he entered the organization's headquarters to meet with Delphis, informing Lucky that Delphis had wished to meet with both of them, but admitted that he didn't know why. Delphis asked the boys to collect a debt from a man named Koz.\nChasing after Koz lead Yu and Lucky to Club Lazuli, where Yu fought Koz's men and ordered them to tell them where Koz was while Lucky watched. After Lucky defeated the last remaining goon, much to Yu's displeasure as he wished to do it on his own, Yu spotted Koz running out the back of the club. The two chased after him, and after Lucky took him down, Yu threatened Koz, warning him that he was not patient like Wen Delphis but if he paid up, he'd let him go. Koz laughed and told them that something big was coming that they could not stop. He warned that it was bigger than all of them and that the Sixth Kin would soon be no more. Then many more of Koz's men descended on the scene. Yu and Lucky managed to defeat all of them, which Yu expressed pride over, causing Lucky to comment that he thought Yu would refuse to die just to spite him. Yu asked if Lucky was okay, but added that he didn't care. Lucky said he was fine but was confounded by the situation that had unfolded, unsure why Koz was so bold and had so many men. Yu theorized that someone knew Wen Delphis would send them to deal with Koz and used him as bait to draw them in. Because Koz said something big was coming that would destroy the Sixth Kin, Yu believed that they were going to make an example out of the two of them to send a message to Wen Delphis. Lucky agreed with Yu, and the latter decided that they needed to get back to Wen Delphis so that both she and the two of them could get answers.\nYu and Lucky's confrontation confirmed to Delphis that there was a traitor within the Sixth Kin, who she believed to be Gallin Crae, the boys' former mentor and the organization's former lieutenant. She sent Yu and Lucky to the Auction for Han Solo, as she believed that Crae would be meeting with his handler there. Delphis warned them that if they wished to protect their families, they had to eliminate Crae or never return to Canto Bight.\nBefore they left, Yu and Lucky ran into bounty hunters Dengar and Beilert Valance. Yu told Dengar that he was brave for being there after he cheated at sabacc with weequay pirates. Lucky asked Dengar if he was going to pay up to the Sixth Kin and get his ship back, but Yu suggested that he would lose it again to the organization because of the way he gambled. The two then left the bounty hunters, as Yu believed they had more important things to attend to.\nYu departed Canto Bight in his ship, the Fleeting, accompanied by Lucky. Yu explained to him that basically every syndicate was going to be at the auction, mainly to see the return of the organization hosting it, Crimson Dawn. He hoped that everyone would be too focused on Han Solo to notice them assassinate Crae and make their escape. But Lucky was distracted, and when Yu called him out for it expressed his confusion about the mission as Crae had always been loyal to Delphis and wondered what happened. Yu reflected on the time the three of them were family, before angrily reminding Lucky that he left too. Yu told him that it didn't matter why Crae made his choice, only that he did and now needed to answer for it. Yu told Lucky to get his head in the game before he got them both killed.\nThe Auction for Han Solo was held on the planet Jekara, in Crimson Dawn's fortress-flagship, the Vermillion. Ariole Yu and Just Lucky arrived and spotted Crae in the crowd. Yu realized that it was too risky to take him out there, and instead decided to take him out after the auction started and they could get him alone. Lucky noted that Crae had gotten old, but did not share Lucky's sympathy, saying that Crae was a seasoned killer and they could take any advantage they could get.\nAs the auction started, Yu and Lucky noticed Crae leaving to a backstage area, and followed him there. As the boys caught up to him he activated an Electrostaff, and Yu realized that Crae had known that they were coming after him, much to his surprise. Crae told them that the two of them were his best work, and therefore of course knew they were coming. He commented that Lucky had grown, but said that Yu had not, angering him. Lucky warned Yu that Crae was baiting him, but Yu didn't care and began fighting Crae with Brass knuckles. Crae quickly got the upper hand in the fight and fought them off easily, but Yu and Lucky refused to stand down. Crae expressed dissapointment that the two of them fought like they were enemies, while Lucky realized that Crae had been working for Crimson Dawn. Yu lashed out, telling Crae that he had betrayed the Sixth Kin and them and ruined their family. Crae remarked that Yu had always been sentimental and loyal to a fault. He added that the boys' strengths should have complimented each other but that their weaknesses were too abundant as he knocked Yu to the floor. He explained to Yu that he had realized that Wen Delphis was paranoid and eliminated the people closest to her, so he got out to. He met Qi'ra, Crimson Dawn's leader, who he said had a vision for the future that Yu could be a part of and be a family again. But Lucky rejected this and held a blaster to his head. Then the assassin Deathstick stepped in, and incapacitated Yu and Lucky with Dathomirian poison laced weapons and forced them to surrender. The two of them were sent to the Vermillion's brig, and put in a cell with Doctor Chelli Aphra and Sana Starros.\nLucky woke up and found Yu unconscious, causing him to freak out, begging for Yu to not be dead. He was incredibly relieved when he checked and could feel Yu's pulse. He then apologized for abandoning Yu and the Sixth Kin, explaining how he didn't want to bring his brother's troubles to Yu and how he wanted to protect his brother. Lucky thought Yu couldn't hear him, believing that to be the reason he could talk to him so easily, but Yu was really conscious and had heard what he said.\nLater, after Aphra and Starros had come to, Crae came to the cell and asked Yu and Lucky if they had considered his offer to join Crimson Dawn. Yu started to reject it, before Lucky stopped him and said they were still thinking it over, telling Yu to just give him time to convince him. Aphra, Lucky, and Starros deliberately made a scene to draw Crae back over and have him open the cell. Yu and Lucky fought Crae while Aphra hot-wired a A3L-N sentinel droid that he had arrived with. Crae exploited Yu's wound to best him and held him in front of him as Aphra treatened to kill him with the droid's energy blasts. Crae asked if she would kill Yu to kill him, and Aphra said that she had no idea who Yu was and absolutely would. But Aphra ricocheted the blast off of the wall and into Crae's back, sparing Yu but leaving him fozen looking at Crae's body. Lucky told Yu they needed to go, and asked him how his wound was as they left. Yu said that it was fine and told Lucky to stop acting like he should expect anything from him, which caused Aphra to comment on their relationship problems.\nYu and the others then raided one of the Vermillion's armories, with Yu getting two daggers at Lucky's suggestion, and traveled to the gallery of artifacts to try and retrieve their belongings and a Data crystal necklace for Aphra. There they encountered Qi'ra and Margo, who were securing the necklace in the vault. After they left, Aphra tried to get the necklace but was stopped by the arrival of Deathstick. Yu and Starros managed to get Deathstick off of Aphra by shooting at her, with both of them complimenting each other's shots afterward. They were then attacked by a group of Crimson Dawn guards, but they were stopped by Aphra who used a Thought dowser to mind control Deathstick and the Crimson Dawn soldiers into stabbing themselves, causing Yu to taught Deathstick about being poisoned. The group escaped to the hangar, but Yu and Lucky then immediately held up blasters to Aphra and Starros just as Aphra and Starros held up blasters to them. But Aphra got the upper hand when she threw an explosive at the Fleeting, greatly angering Yu.\nYu and Lucky were left stranded. The two were approached in the hangar by Crimson Dawn guards, Crae, and Deathstick, the latter two of whom were both injured. Crae ordered the boys to lay down their weapons before they made it worse for themselves. In response to this Deathstick asked Crae if she was still not allowed to kill them, to which Qi'ra answered as she arrived that it wouldn't be necessary. Qi'ra introduced herself to Lucky and Yu, and told them that she knew of them from Crae talking about them, and from what he said had hoped they would have been 'better behaved.' She then invited the two inside for a talk.\nQi'ra sat down with the boys over a drink. She told them that Crae had told her about what they had been through with Wen Delphis and the Sixth Kin, and knew that they had been conscripted into the organization without a choice, been trained as killers by the Delphis, and had their autonomy restricted. Qi'ra empathized with this, showing them her Crimson Dawn tattoo that represented her former enslavement under the organization. She told the boys that they had options now, and that together they could create a galaxy free from tyrants like Wen Delphis, the Empire, and the Tagges. She explained that that was the future that Crimson Dawn wanted to make and offered them the chance to join the syndicate so that they could be a part of it. She told them to think about it, and that she would be waiting when they made up their minds.\nAriole Yu first appeared in the eighth issue of the comic series Star Wars: Doctor Aphra  by Alyssa Wong.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Doctor_Aphra_(2020)_16",
  "/wiki/Doctor_Aphra_(2020)_18",
  "/wiki/Doctor_Aphra_(2020)_21",
  "/wiki/Doctor_Aphra_(2020)_23",
  "/wiki/Doctor_Aphra_(2020)_24",
  "/wiki/Doctor_Aphra_(2020)_25",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sixth_Kin",
  "/wiki/Lieutenant_(criminal)",
  "/wiki/Wen_Delphis",
  "/wiki/Just_Lucky",
  "/wiki/Assassin",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Death",
  "/wiki/Gallin_Crae",
  "/wiki/Crimson_Dawn",
  "/wiki/Imperial_Era",
  "/wiki/Lieutenant",
  "/wiki/South_Stretch_Worker%27s_District",
  "/wiki/Canto_Bight",
  "/wiki/Cantonica",
  "/wiki/Pak",
  "/wiki/Koz",
  "/wiki/Club_Lazuli",
  "/wiki/Bounty_hunter",
  "/wiki/Dengar",
  "/wiki/Beilert_Valance",
  "/wiki/Sabacc",
  "/wiki/Weequay",
  "/wiki/Pirate",
  "/wiki/Fleeting",
  "/wiki/Han_Solo",
  "/wiki/Jekara",
  "/wiki/Vermillion_(Crimson_Dawn)",
  "/wiki/Electrostaff",
  "/wiki/Brass_knuckles",
  "/wiki/Deathstick",
  "/wiki/Dathomirian_poison",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Sana_Starros",
  "/wiki/A3L-N_sentinel_droid",
  "/wiki/Data_crystal",
  "/wiki/Thought_dowser",
  "/wiki/Doctor_Aphra_(2020)_8",
  "/wiki/Star_Wars:_Doctor_Aphra_(2020)",
  "/wiki/Alyssa_Wong",
  "/wiki/Category:Images_of_Ariole_Yu",
  "/wiki/Doctor_Aphra_(2020)_9",
  "/wiki/Doctor_Aphra_(2020)_10",
  "/wiki/Bounty_Hunters_15",
  "/wiki/Doctor_Aphra_(2020)_11",
  "/wiki/Doctor_Aphra_(2020)_12",
  "/wiki/Doctor_Aphra_(2020)_13",
  "/wiki/Doctor_Aphra_(2020)_14",
  "/wiki/Doctor_Aphra_(2020)_15",
  "/wiki/Doctor_Aphra_(2020)_17",
  "/wiki/Doctor_Aphra_(2020)_19",
  "/wiki/Doctor_Aphra_(2020)_27",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_The_Ascendant",
  "/wiki/Doctor_Aphra_(2020)_7"
 ]
}