{
 "name": "Arissa Fawn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Arissa Fawn was an Imperial lieutenant of flexible ethics who served as a liaison officer on Starlyte Station.\nFawn was part of the Sub-Adult Group and was an idealistic young member that supported the Emperor's New Order. She later joined the Galactic Empire by enlisting with the Imperial Army. She was unable to rise up very far or fast within the ranks and ended up with an assignment to a dead end post, as Imperial Liaison to Starlyte Station.\nShe was given only a single battalion of stormtroopers and a poor battalion at that. The Emperor's Irregulars were an incredibly loyal and disciplined yet completely incompetent group that was assigned as far away from the front lines as was possible.\nOver time Fawn became disillusioned upon realizing that the Empire was not all that the Sub-Adult Group and conditioned her to believe it was and ended up losing faith in the Emperor and his Empire. She began taking hefty bribes from station owner Talandro Starlyte to ignore his sizable black market on the station.\nWhere once she burned brightly with passion and vigor for the Empire she entertained thoughts of leaving or even joining the Alliance to Restore the Republic. Two things kept her in her position, however. The first was her second-in-command, the ruthless and ambitious Brezzic Marr. The second was Talandro Starlyte because despite his charm and sizable bribes, Fawn could tell there was something sinister behind his smile.\nAs an officer of the Imperial Army she was decently trained in blasters and hand-to-hand combat. She also had some basic leadership and command training however overall she was remarkably average and unskilled.\nBesides her distinctive Imperial uniform, Fawn wore a protective vest, carried a blaster pistol and a datapad. She used her bribes to buy some nice clothing and jewelry for when she was off-duty.\nArissa Fawn was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. He was illustrated by Joe Corroney.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Imperial_Liaison",
  "/wiki/Starlyte_Station",
  "/wiki/Sub-Adult_Group/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Battalion/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/105th_Stormtrooper_Platoon",
  "/wiki/Talandro_Starlyte",
  "/wiki/Black_market/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Brezzic_Marr",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Joe_Corroney",
  "/wiki/Dark_Tremors"
 ]
}