{
 "name": "Aris Vauranelle",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Cin Tykan"
     ]
    }
   ]
  }
 ],
 "content": "Aris Vauranelle was a Human female Jedi Padawan of the Jedi Order and the apprentice of Jedi Master Cin Tykan during the Cold War.\nIn 3643 BBY, Aris Vauranelle and her master were stationed on Taris where they were spearheading the restoration of the world. Working with Captain Nelex of the Republic Expeditionary Forces, Tykan and Vauranelle were focused on ridding the planet of the residual rakghoul infections which cropped up in the Undercity. When Tykan went out on an exploratory mission to the ruins of the old Jedi academy he succumbed to a mysterious illness concocted by the Sith Lord Vivicar. When a young Jedi Consular arrived on Taris to track him, Vauranelle directed the Jedi Consular to the ruins with assurances that her master was fine. When the opposite proved to be true, Vauranelle communicated her concern for Master Tykan via holotransmission and pleaded with the Consular to spare him if at all possible.\nWhile the Consular was away, Tykan attacked the Republic base using secret rakghoul tunnels and helped decimate the Republic's forces. During the fighting, Tykan abducted Vauranelle and dragged her to one of the last working super-reactors deep within the Undercity. There, Vauranelle listened to her beloved master as he explained how it was the Republic's fault that Taris was in such instability and that the Jedi Consular would quickly betray them for the Republic's cause. When the Consular arrived at the reactor, Vauranelle stepped up to defend her master and herself from the Consular but when confronted with reason, the impressionable young Padawan backed down from conflict. Furious, Tykan lashed out at the young girl and surely would have killed her if not for the intervention of the Jedi Consular. When Tykan came to his senses, he vowed to return to Tython to seek redemption and counsel from the Jedi High Council with Vauranelle in tow.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cin_Tykan",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/3643_BBY",
  "/wiki/Taris/Legends",
  "/wiki/Taris_Resettlement_Initiative",
  "/wiki/Captain/Legends",
  "/wiki/Nelex",
  "/wiki/Republic_Expeditionary_Forces",
  "/wiki/Rakghoul",
  "/wiki/Undercity_(Taris)",
  "/wiki/Jedi_Tower",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Parkanas_Tark",
  "/wiki/The_Barsen%27thor",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}