{
 "name": "Aris-Del_Wari",
 "display_name": "Aris-Del Wari",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ord Thoden"
     ]
    },
    {
     "name": "Born",
     "values": [
      "24 BBY",
      "Ord Thoden"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Aris-Del Wari, born Ludi Billane, was a Jedi youngling who lived in the era known as the Great Peace of the Republic. Separated from her mother, Jonava Billane, during a quake that wracked the city of Domitree on Ord Thoden, the child was recovered by the Jedi Order, who discovered that she was Force-sensitive. The Jedi brought the infant into their ranks and gave her the name of \"Aris-Del Wari,\" before introducing her to the power of the Force.\nWhen Jonava Billane discovered what had happened to her child, she journeyed to Coruscant to contest the Jedi's possession of her. In what became known as the \"Baby Ludi\" case, she petitioned to the Jedi Order for custody of Wari, but the Jedi Council refused to return her to her mother. The actions of the Jedi inspired protest rallies and demonstration, and a massive media blitz of the story followed. As events were still unfolding, Kailio Entertainments prepared to make a holofilm about the case, to be directed by Ch'been. While Billane was overseeing casting decisions on the film, Wari was transferred to the Kamparas Jedi Training Center, where she would further her connection to the Force.\nLudi Billane was born in 24 BBY to Jonava Billane, who resided on Ord Thoden. Mother and daughter were in Ord Thoden's capital of Domitree when a quake devastated the city. The pair was separated during the disaster, with the infant left in the ruins of Domitree while Jonava was taken to an outskirt town to recover. Rescue workers from the Jedi Order had been dispatched to Domitree to aid in the recovery, and in their work, they chanced upon Ludi, who was Force-sensitive.\nAlthough normally the Order required parental consent when bringing a child into their ranks, the infant's parents were missing at the time, presumed dead. Naming the unidentified child \"Aris-Del Wari,\" the Jedi took her back to the Jedi Temple on Coruscant, where they intended to instruct her in the ways of the Force. One month later, the recovering Jonava was discovered, and she eventually learned what had happened to her child.\nWhen Jonava Billane discovered the fate of her daughter, she exhausted all her funds to travel from Ord Thoden to Coruscant in the hope that she could regain custody over Wari. What followed was a very public custody battle, prompting Republic officials to try to find a resolution to the dispute. Siding with Billane on the issue was the People's Inquest, a Jedi watch-group. The group's leader, Thrynka Padaunete, used the incident as an example of why the actions of the Jedi should be held more accountable to the people who subsidized their operations. Meanwhile, in the care of the Jedi, the infant Wari was introduced to the power of the Force and had her mind opened to its nature.\nBoganni Hrul, senator of the Dynali sector, which encompassed Ord Thoden, submitted a formal petition to the Jedi Order requesting that Wari be returned to Billane, but three weeks later, the Jedi Council rejected the plea. As a result, both the petition itself and its rejection made headlines across the galaxy's media. Councilman Coleman Trebor spoke to HoloNet News about the council's decision, insisting that since the Jedi had opened Wari's mind to the Force, it would be too dangerous to place her back in a non-Jedi environment and lifestyle. Billane was not deterred, however, and proclaimed that she would not halt her campaign until she had her daughter back.\nSeven days after the Jedi Order's rejection of Hrul's petition, student activists from the University of Coruscant overloaded two datanet hubs with holographic imagery of Wari, who had become widely known as \"Baby Ludi.\" The images spread at a startling rate across the hubs, deleting and replacing existing files. They had been culled from a HoloNet News report, and were accompanied by the caption \"I'd rather be with Mom than Mace.\" Protest against the Jedi Order's actions in the matter was not exclusive to Coruscant, however. On Alsakan, there was the Mothers United March, and in the Minos Cluster, a fund-raising mediathon was held, augmented by the presence of celebrities. In time, Thrynka Padaunete became more directly involved with the case, and took on the role of Billane's appearance manager.\nA week later, it was announced that Billane would be appearing on the Eriadu talk show, Essence, to talk about the custody battle over Wari. The show's producer, Garox Tronten, stated his intention to delve into the issue of Wari's custody and hinted toward the idea that the Jedi were in fact \"kidnapping and raising an army of mind-controlled youths.\" Meanwhile, holofilm production company Kailio Entertainments secured the rights to the \"Baby Ludi\" story and green-lighted the \"Untitled Baby Ludi Project,\" a feature-length holo that would cover the dispute. Dark Romance director Ch'been was attached to direct, prompting the spiritualist H'drachi holomaker to use his \"timestream\" power to try and predict the future of the case.\nWhen the Billane episode of Essence aired, it made news. During the interview, Billane, who was accompanied by Padaunete, pleaded with the Jedi Council to relinquish custody of Wari and thanked everyone who had spoken out against the actions of the Jedi Order. Padaunete, meanwhile, used the show as a platform to attack the Jedi, calling them a cult that did not understand the concept of a mother's love. By this time, HoloNet News had come to term the Jedi's taking of the child as a \"kidnapping.\"\nAfter the airing of the Essence episode, active protesting persisted and escalated. Twenty University of Coruscant students from a sociology tour group stormed into the Jedi Temple's public lobby and began throwing pre-programmed graffiti-bombs. The bombs, when detonated, painted messages such as \"Baby Ludi Wants Her Mom,\" and \"Broodsnatchers!\" across the lobby. Two Jedi Padawans attempted to quell the protest, but were unsuccessful. The students were able to push into the Temple's Second Atrium Lobby before being mind tricked by Jedi Master Plo Koon and subsequently subdued and taken off-site. The Council refused to comment on the incident, and Billane was busy, by this stage, reviewing casting decisions for Ch'been's holofilm. Padaunete acknowledged the efforts of the students on HoloNet News, however.\nPer standard procedure, the fourteen-month-old Wari and nineteen of her classmates were transferred to the Kamparas Jedi Training Center. People's Inquest members who had been camping outside the Jedi Temple soon learned of the move, and launched into an impromptu rally. The Inquest's acting leader, Firris Palbert, publicly decried the Jedi for the transfer and urged his fellow protesters to journey to Kamparas, where they could continue their opposition. At this stage, Billane, along with Padaunete, was still reviewing casting decisions for the Baby Ludi holofilm.\nThough Wari was just an infant, many sentients had their own opinions on her. Some, such as systems analyst Lomina Argo, did not believe that the infant was dangerous, and should have been returned to her mother. Others, like courier Wuuden Malnic, thought of her as a \"snot-nosed brat.\"\nAris-Del Wari was created for HoloNet News, written by Pablo Hidalgo and Paul Ens. In his original pitch for the HoloNet News website, Hidalgo called the \"Baby Ludi\" story a trivial one that the media would latch on to in the face of the impending Separatist Crisis. He compared the fixation on the story to the real-life examples of Elián González, O. J. Simpson, and JonBenét Ramsey. Ludi's story was spread across seven issues of HoloNet News, which were published in the weeks leading up to the release of Star Wars: Episode II Attack of the Clones.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Ludi",
  "/wiki/Aris-Del_Wari",
  "/wiki/Aris_(disambiguation)",
  "/wiki/Ord_Thoden",
  "/wiki/24_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Coleman_Trebor/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Time/Legends",
  "/wiki/Great_Peace_of_the_Republic",
  "/wiki/Jonava_Billane",
  "/wiki/City/Legends",
  "/wiki/Domitree",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/%22Baby_Ludi%22_custody_case",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Kailio_Entertainments",
  "/wiki/Untitled_Baby_Ludi_Project",
  "/wiki/Ch%27been",
  "/wiki/Kamparas_Jedi_Training_Center",
  "/wiki/Jedi_Temple",
  "/wiki/File:LudisMom.jpg",
  "/wiki/People%27s_Inquest",
  "/wiki/Thrynka_Padaunete",
  "/wiki/Boganni_Hrul",
  "/wiki/Senator/Legends",
  "/wiki/Dynali_sector",
  "/wiki/The_galaxy/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/University_of_Coruscant/Legends",
  "/wiki/Datanet",
  "/wiki/Hologram/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Alsakan/Legends",
  "/wiki/Mothers_United_March",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Eriadu/Legends",
  "/wiki/Essence",
  "/wiki/Garox_Tronten",
  "/wiki/Holodrama/Legends",
  "/wiki/Dark_Romance",
  "/wiki/H%27drachi",
  "/wiki/Graffiti-bomb",
  "/wiki/Padawan/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Kamparas",
  "/wiki/Firris_Palbert",
  "/wiki/Sentience/Legends",
  "/wiki/Systems_analyst",
  "/wiki/Lomina_Argo",
  "/wiki/Courier/Legends",
  "/wiki/Wuuden_Malnic",
  "/wiki/HoloNet_News_(original_website)",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Paul_Ens",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/HoloNet_News_Vol._531_46",
  "/wiki/HoloNet_News_Vol._531_47",
  "/wiki/HoloNet_News_Vol._531_48",
  "/wiki/HoloNet_News_Vol._531_49",
  "/wiki/HoloNet_News_Vol._531_50",
  "/wiki/HoloNet_News_Vol._531_51",
  "/wiki/HoloNet_News_Vol._531_52",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_138",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/StarWars.com"
 ]
}