{
 "name": "Arlan Barrezz",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Intelligence",
      "Imperial Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Arlan Barrezz was a male Human Commander in Imperial Intelligence during the Galactic Civil War.\nAfter the Battle of Yavin, Commander Arlan Barrezz was stationed in the Bestine Imperial garrison on Tatooine. His immediate superior was Lieutenant Maximilian Vox.\nIn 1 ABY, Barrezz was tasked with the job of finding cargo, smuggled from the Tansarii Point Station. The cargo was now lost among the various denizens on Tatooine. Both the Empire and the Alliance were very interested in finding it, so time was of the essence. Fortunately, a spacer chose seek out Barrezz and offer his assistance, instead of Rebel Captain Carh'la Bastra. Barrezz agreed to use the spacer's help, so he immediately gave him work.\nCommander Barrezz first tasked the spacer with finding the inventory of the cargo content that was acquired by a group of Jawa traders. The Jawas had recently been spotted at Tosche Station, near Anchorhead. There, the spacer learnt from the manager Cuan Talon that he should ask his warehouse manager Janus but the latter had already been killed by Desert Demons. From Janus' datapd, the spacer recovered the first part of the cargo data and discovered that the Jawa had also visited the Lars homestead. At the homestead, Zef Ando agreed to give the inventory of what he bought from the Jawas. The spacer finally reached the Jawa sandcrawler in the Western Dune Sea but it was under attack from Tusken Raiders. The spacer attacked the Tusken Raiders and rescued the Jawas and the droid FA-2PO. The spacer later recovered Jawa encryption keys from the Tusken Raiders and finally accessed to the sandcrawler database.\nBarrezz then tasked the spacer with going to the Valarian Depot near Bestine. It turned out that the Valarian crime syndicate purchased a portion of the lost cargo. The spacer was told to do a complete inventory, by checking the manifests on the cargo pallets. Though the job was highly dangerous, due to the number of guards patrolling the depot, the spacer succeeded.\nBarrezz was pleased, but there was still more work to be done. Barrezz immediately tasked the spacer with going to the Darklighter storage facility near their estate. It turned out that some of the cargo the Empire was looking for ended up in their hands, so the spacer needed to do another complete inventory of their cache. The spacer agreed to help, and immediately sought out the storage facility, which was actually a cave, overrun by Desert Demon looters. At the cave's entrance, was a guard named Draci. Draci informed the spacer that the cave's security system failed, and that he would need to move quickly. Fortunately, the spacer managed to do a complete inventory, before most of the cache was destroyed or stolen by the scavengers.\nBarrezz still had one final task for the spacer. The spacer now needed to deliver the data to Barrezz's slicer, Jem Lavar. Compared to the previous tasks, finding Jem Levar was a trivial matter, but the spacer had nonetheless to rescued Lavar from a group of gunrunners. Barrezz was thankful to the spacer for giving Levar the data. Jem Lavar analyzed the inventory data from the Jawas, the Darklighter and the Valarians and finally discovered that the R2 unit that both the Empire and the Rebellion were looking for was bought by the junk dealer Watto.\nThe spacer was tasked by Barrezz to retrieve the droids and thus headed to Watto's Shop in Mos Espa. There, the spacer learnt that the droids was already sold in spare parts. Nevertheless, Watto agreed to re-assemble the droid if the spacer was able to get all the parts. The spacer obtained the droid body from Ji'Ni Sil in the Jawa Mountain Fortress, the legs from Syndil Na'Marr and a Bothan pilot, the motivator from one of An'Kwee's death podracer pilot friend, the motivator booster controller from Pah and his gang, the diagnostic controller in the Squill Cave, and finally the head from Jabba the Hutt's supervisor droid EV-9D9. When the spacer returned to the shop with all parts, Watto finally helped re-assemble the droid. From the reassembled droid, the spacer was able to recover the information both the Empire and the Rebellion were looking for. Arlan Barrezz ordered the spacer to immediately transmit the data to Lieutenant Vox on Naboo.\nArlan Barrezz was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Arlan Barrezz was added to the game as part of the \"Legacy Quest\" with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005. In the game, Barrezz is part of a long, epic quest, referred to as the \"Legacy Quest.\" The player can choose to help either Barrezz, or a Rebel Captain named Carh'la Bastra with finding the lost cargo.\nIn 2008's The Complete Star Wars Encyclopedia, Barrezz's name is misspelled as \"Arlen Barezz.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Barezz",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Imperial_garrison_(Bestine)",
  "/wiki/Tatooine/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Maximilian_Vox",
  "/wiki/1_ABY/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Carh%27la_Bastra",
  "/wiki/Sand_Crawler_345",
  "/wiki/Jawa/Legends",
  "/wiki/Tosche_Station/Legends",
  "/wiki/Anchorhead/Legends",
  "/wiki/Cuan_Talon",
  "/wiki/Janus",
  "/wiki/Desert_Demons",
  "/wiki/Lars_homestead",
  "/wiki/Zef_Ando",
  "/wiki/Western_Dune_Sea/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/FA-2PO",
  "/wiki/Valarian_Depot",
  "/wiki/Valarian/Legends",
  "/wiki/Darklighter_family",
  "/wiki/Darklighter_cache",
  "/wiki/Darklighter_estate",
  "/wiki/Draci",
  "/wiki/Jem_Lavar",
  "/wiki/Smuggler/Legends",
  "/wiki/R2-series_astromech_droid",
  "/wiki/Junk_dealer/Legends",
  "/wiki/Watto/Legends",
  "/wiki/Wald%27s_Parts",
  "/wiki/Mos_Espa/Legends",
  "/wiki/Ji%27Ni_Sil",
  "/wiki/Jawa_Mountain_Fortress",
  "/wiki/Syndil_Na%27Marr",
  "/wiki/Bothan/Legends",
  "/wiki/Motivator/Legends",
  "/wiki/An%27Kwee",
  "/wiki/Podracing/Legends",
  "/wiki/Hilbrun",
  "/wiki/Squill_Cave",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Supervisor_droid/Legends",
  "/wiki/EV-9D9/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}