{
 "name": "Arliz Hadrassian",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "28 ABY",
      "Hosnian Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Starfighter Corps",
      "Imperial Security Bureau",
      "Imperial Starfighter Corps",
      "Imperial Security Bureau",
      "Amaxine warriors",
      "First Order"
     ]
    }
   ]
  }
 ],
 "content": "Arliz Hadrassian was a female human who served in the Galactic Empire prior to its defeat at the Battle of Jakku. Initially a TIE fighter pilot flying for the Imperial Starfleet, she later became an officer of the Imperial Security Bureau and helped chase down spicerunners around Kessel and Kerev Doi. Her elder brother also served the Empire as a member of Emperor Palpatine's Royal Guard.\nFollowing the Empire's defeat at Jakku and the establishment of the New Republic, Hadrassian became a small-time businesswoman and the leader of the Amaxine warriors. Twenty-four years after the Battle of Endor, she assisted Carise Sindian in her conspiracy to help the First Order by orchestrating the Napkin Bombing of the Galactic Senate on Hosnian Prime and assassinating Senator Tai-Lin Garr, quickly committing suicide afterwards.\nDuring the Age of the Empire, Arliz Hadrassian along with several members of her family and friends served in the Imperial Navy. She served as a TIE fighter pilot before becoming an Imperial Security Bureau officer. Hadrassian spent a significant portion of her career chasing down spice smugglers around Kessel and Kerev Doi. She also had an elder brother who served in the Emperor's Royal Guard around the time of the Battle of Endor. This brother had fallen ill prior to the battle and was not on the second Death Star when it was destroyed. Following Emperor Palpatine's death, Hadrassian's brother continued serving the Empire and perished during the Battle of Jakku. Hadrassian later acquired her brother's Royal Guard helmet as a memento.\nFollowing the Galactic Concordance, Hadrassian became a small-time businesswoman on the Outer Rim world of Daxam IV. She also became the leader of a paramilitary faction called the Amaxine warriors that had ties to an Imperial remnant called the First Order and the Nikto crime lord Rinnrivin Di's cartel. The Amaxines wore black jumpsuits, trained with Force pikes, and had several starfighter squadrons. About twenty four years after the Battle of Endor, the Amaxines numbered several thousand and were well-equipped enough to pose a threat to the New Republic, the successor government that had been created by the Alliance to Restore the Republic.\nUnder the leadership of Hadrassian, the Amaxines supplied both funds and pilots to Rinnrivin's cartel. While the Amaxines on the surface appeared to be the financiers and partners of Rinnrivin's operations, they were actually a front for the First Order; which used Rinnrivin's cartel's smuggling and gambling operations to generate funds to rebuild the old Imperial fleet. Rinnrivin channeled his revenue back to the First Order through the auspices of several shadow corporations and Centrist sources like Senator Lady Carise Sindian. While Hadrassian saw the Amaxines as the vanguard of the First Order, her collaborator Lady Carise viewed them as a distraction that would justify the First Order's attempts to \"restore order\" to the galaxy.\nIn 28 ABY, Rinnrivin's criminal activities in the Gaulus sector began to take a toll on the economy of Ryloth. Following a petition to the New Republic Galactic Senate by Ryloth's Emissary Yendor, the Populist Senator Leia Organa and her Centrist colleague Ransolm Casterfo agreed to investigate Rinnrivin's cartel. Around the time of the investigation, Arliz visited the casino hub of Bastatha with a group of companions. She crossed paths with Leia's team and took the opportunity to observe the former rebel leader and New Republic senator. Despite her best attempts to stay unnoticed, Leia noticed her.\nLater, Leia's pilots Greer Sonnel and Joph Seastriker visited Pamarthe and learned that Rinnrivin was hiring Amaxines pilots from Daxam IV. With the approval of Lady Carise, Hadrassian staged a \"distraction\" to delay the investigation. While Carise had envisioned a scandal or accident, the fanatical Hadrassian went further and used a Twi'lek individual to plant a bomb in the Senatorial conference building. However, Leia discovered a message warning of the bomb and managed to order an evacuation of the building, saving many lives. The so-called Napkin Bombing strained relations between Hadrassian and Lady Carise, who came to regard the former as a liability to the First Order.\nFollowing the Napkin Bombing, Arliz Hadrassian, using the pseudonym Crimson Blade, arranged to sell the helmet of her Imperial Royal Guard brother to an offworld buyer. This buyer turned out to be Senator Casterfo, who used the transaction as an opportunity to visit and investigate Daxam IV. With the approval of Senator Organa, Casterfo traveled with Greer to rendezvous with Crimson Sword. Hadrassian arranged to meet her buyer at a run-down teahouse. Upon entering the teahouse, Casterfo immediately recognized Hadrassian as the woman that had been watching the senatorial delegation on Bastatha.\nAfter exchanging greetings, Casterfo asked Hadrassian how she obtained the Imperial helmet. While the previous sellers he had encountered had usually obtained their Imperial artifacts as trophies of war, Hadrassian related the story of her brother's service as an Imperial Royal Guard. Assuming the Centrist senator to be an Imperial sympathizer, Hadrassian told Casterfo that he was the right customer she had been looking for. After Casterfo asked about her time in the Imperial Navy, Hadrassian spent the next two hours regaling the young senator with stories from her work as a TIE fighter pilot and later an ISB officer.\nHaving assessed Hadrassian's suitability, she arranged for the purchase of the helmet to take place at her encampment in the Western Wastes the following day. Hadrassian also gave instructions for Casterfo's \"staffer\" Greer to stay behind in order to maintain the confidentiality of her transactions. Hadrassian then returned to her territory, leaving Casterfo and Greer to spend the night in the settlement. Later that night, Greer undertook a reconnaissance flight above Daxam IV and discovered that the Amaxines had at least six starfighter squadrons practising manuevers over the planet.\nThe following day, Hadrassian received Casterfo at her compound in the Western Wastes. Inside the building, Hadrassian presented the young Senator her brother's Royal Guard helmet and allowed to don it. Hadrassian then asked Casterfo to imagine himself as a Royal Guard serving the Emperor and Darth Vader aboard the Death Star. Despite his distaste for Vader and the Emperor, Casterof played along and asked to try out a force pike. While Hadrassian did not have an original force pike, she allowed him to borrow one of her Amaxine warrior' training force likes.\nHadrassian then arranged for Casterfo to duel with one of her Amaxine warrior but warned the combatants to fight in it to the first landed blow since she did not want anybody to get hurt. Due to his martial arts and quarterstaff combat training, Casterfo managed to defeat the Amaxine warrior and spared his life, per Hadrassian's instructions. Believing Casterfo to be an Imperial sympathizer, she told the senator that she had fifty starfighters and two fully-qualified pilots on Daxim IV. In addition, Hadrassian divulged that the Amaxines had at least six bases around the Galaxy including their central base on the watery Expansion Region world of Sibensko; a seedy crime haven.\nDue to her meeting with Casterfo, Hadrassian unwittingly exposed information about the Amaxine warriors to Senator Organa. Hadrassian's financier Lady Carise also learned about the leak through Casterfo, who informed Lady Carise about his encounter with the paramilitary group. Viewing the disclosure as a disaster, Lady Carise contacted Hadrassian via hologram and chastised the Amaxine leader for ruining the First Orders plans by tipping off Castefo. Hadrassian retorted that she spent several years building the Amaxine army on Daxam IV. In response, Lady Carise accused her of abandoning the First Order; prompting an angry response from Hadrassian who stressed that Carise was too young to have known the Empire.\nLady Carise then criticized Hadrassian for spilling the Amaxine warriors' secrets to Casterfo; whom she revealed was assisting Leia's investigation into Rinnrivin's cartel. When Hadrassian insisted that she was trying to recruit Casterfo as a potential ally, Lady Carise pointed out that he was playing her due to his work with Leia. Hadrassian insisted that Casterfo was an Imperial sympathizer and a potential supporter of the First Order. Losing her temper, Lady Carise then chastised Hadrassian for her role in the Napkin Bombing and pointed out that her actions had only drawn the authorities' attention to the Amaxines.\nStill trusting Casterfo, Hadrassian urged Lady Carise to do more to convince the Centrist senator to remain in their side and to convert him to their cause. Lady Carise agreed and in return extracted a promise from Hadrassian to stick to their plans before terminating the holographic connection. Having learned about Leia's true parentage as the daughter of Darth Vader and knowing Casterfo's contempt for Vader, Lady Carise decided to drive a wedge between Casterfo and Organa by disclosing Leia's true parentage. Feeling betrayed, Casterfo upstaged a Senate hearing into Leia's candidacy for the position of First Senator and exposed Leia's identity as the daughter of Vader. Due to the political uproar that ensued, Leia's political credibility was fatally undermined and she was forced to withdraw her nomination for First Senator.\nDespite Lady Carise's efforts to undermine Leia's investigation into the Amaxines and Rinnrivin's cartel, Leia was undaunted. She and her team including C-3PO, Joph, and Greer undertook a mission to Sibensko. During the course of the mission, Leia and C-3PO managed to obtain banking records linking the Amaxines to Rinnrivin's cartel. Leia also discovered the Amaxine base and managed to escape with the help of her husband Han Solo. During a brief dogfight with Han's racer, one of the Amaxine B-wing starfighters crashed into the underwater base's arms depot; triggering a massive explosion that wiped out the underwater city, the Amaxine headquarters, and a large portion of the militia's forces.\nThe events on Sibensko dealt a major blow to Hadrassian's plans for the Amaxines to serve as the vanguard of the First Order's coming war with the New Republic. Infuriated by the disaster, Hadrassian engaged Lady Carise in a heated hologram conversation. When Lady Carise blamed Hadrassian's impatience for the recent debacle on Sibensko, Hadrassian chastised the Centrists for not seceding from the New Republic and accused her financier of being too cowardly to take chances. Lady Carise counteracted that the Napkin Bombing proved that she and her Amaxines were a liability.\nAfter Lady Carise hinted that she would write off the Amaxines as a First Order asset, Hadrassian pleaded for Lady Carise to allow her to kill Leia Organa in order to avenge her warriors. Lady Carise then criticized Hadrassian for taking the conflict personally. As a political player, Lady Carise preferred to assassinate Organa's character and to sow discord within the Populist faction. Before ending the conversation, Hadrassian warned Lady Carise that she would have a greater need of soldiers someday and that she would regret abandoning the Amaxines.\nDespite their falling out, Lady Carise would find a new opportunity to exploit Arliz Hadrassian's services. When Casterfo unexpectedly defended Leia during a Senate hearing into Rinnrivin's cartel and the Amaxine Warriors, Lady Carise decided to eliminate the dissident senator. She hired Hadrassian to assassinate the Populist senator Tai-Lin Garr, Leia's friend and the new Populist candidate for First Senator. Hadrassian shot Tai-Lin in the heart before shooting herself in the head with a blaster. Prior to committing suicide, she told Leia that she should be fortunate that Hadrassian was thinking strategically.\nWith the Senate in mourning, Lady Carise then fabricated evidence presenting Casterfo as Hadrassian's financier and close friend. With Hadrassian linked by Leia's investigation to the Napkin Bombing and Rinnrivin's rise, Casterfo was implicated and deported to his homeworld of Riosa for imprisonment, trial, and sentencing. Lady Carise's elation was however short-lived because Leia determined her role in Casterfo's frame-up and convinced the Elder Houses to strip Carise of all her royal titles. Sensing that other threats to the New Republic existed, Leia formed a paramilitary group called the Resistance.\nArliz Hadrassian was an elderly sixty year old woman with long, wiry black, and silver-streaked hair. She was a thin, angular woman with small white scars on her forehead, left cheek, and throat. Hadrassian was known to have dark eyes. Throughout her life, Hadrassian was a staunchly Imperial loyalist and admirer who loathed the New Republic. Due to her loyalty, Hadrassian was assigned to work for the Imperial Security Bureau during the Age of the Empire. Regarding the New Republic as an illegitimate government, Hadrassian and other like-minded former Imperials established a paramilitary outfit called the Amaxine Warriors with the financial and material assistance of the First Order and its intermediaries including Lady Carise.\nShe devoted much of her adult life to building the Amaxine Warriors into a strong and well-equipped militia that could take on the New Republic. As a military person, Hadrassian had little patience and understanding for political intrigue. She had a tense relationship with her financier Lady Carise due to the latter's reluctance to use violence and to secede from the New Republic; which Hadrassian regarded as \"weak and snivelling.\" Lady Carise found Hadrassian difficult to manage due to the latter's enjoyment of violence and destruction, as exemplified by the Napkin Bombing.\nHadrassian admired her brother, who served as an Imperial Royal Guard during the last years of the Old Empire. She kept his helmet as a memento. Hadrassian was also idealistic and trusting. This enabled Ransolm Casterfo to gain her trust by posing as an Imperial sympathizer. Hadrassian mistakenly believed that Casterfo was a genuine convert who would support the First Order. Later, Hadrassian took the destruction of the Amaxines as a personal setback and sought to kill Senator Organa. In an attempt to eliminate Hadrassian, Lady Carise convinced her to assassinate Tai-Lin Garr and then kill herself.\nAs a former Imperial officer, Arliz Hadrassian was familiar with weapons like blasters, starfighters, and Force pikes. She was able to lead an army of Amaxine Warriors.\nThe name \"Arliz\" is one of the many references to Mad Max: Fury Road that Claudia Gray inserted in Bloodline. It is a shortened form of \"Charlize,\" after actress Charlize Theron, who portrayed Imperator Furiosa in the movie. While writing the novel, Gray pictured Hadrassian as being portrayed by actress Sônia Braga.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/28_ABY",
  "/wiki/Hosnian_Prime",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Amaxine_warriors_(New_Republic_Era)",
  "/wiki/First_Order",
  "/wiki/Battle_of_Jakku",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Imperial_Navy",
  "/wiki/Officer",
  "/wiki/Spicerunner",
  "/wiki/Kessel",
  "/wiki/Kerev_Doi",
  "/wiki/Arliz_Hadrassian%27s_brother",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Jakku",
  "/wiki/New_Republic",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Carise_Sindian",
  "/wiki/Napkin_Bombing",
  "/wiki/New_Republic_Senate",
  "/wiki/Assassin",
  "/wiki/Senator",
  "/wiki/Tai-Lin_Garr",
  "/wiki/Suicide",
  "/wiki/Imperial_Era",
  "/wiki/Spice",
  "/wiki/Time",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Death",
  "/wiki/Armor",
  "/wiki/Galactic_Concordance",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Daxam_IV",
  "/wiki/Nikto",
  "/wiki/Crime_lord",
  "/wiki/Rinnrivin_Di",
  "/wiki/Rinnrivin_Di%27s_cartel",
  "/wiki/Force_pike",
  "/wiki/Starfighter",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Pilot",
  "/wiki/First_Order_Navy",
  "/wiki/Centrists",
  "/wiki/Lord",
  "/wiki/The_galaxy",
  "/wiki/Gaulus_sector",
  "/wiki/Ryloth",
  "/wiki/Emissary",
  "/wiki/Yendor",
  "/wiki/Populists",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Ransolm_Casterfo",
  "/wiki/Bastatha",
  "/wiki/Greer_Sonnel",
  "/wiki/Joph_Seastriker",
  "/wiki/Pamarthe",
  "/wiki/Twi%27lek",
  "/wiki/Senatorial_conference_building",
  "/wiki/Crimson_Blade",
  "/wiki/Western_Wastes",
  "/wiki/Hadrassian%27s_compound",
  "/wiki/Anakin_Skywalker",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Expansion_Region",
  "/wiki/Sibensko",
  "/wiki/Hologram",
  "/wiki/First_Senator",
  "/wiki/C-3PO",
  "/wiki/Mission_to_Sibensko",
  "/wiki/Han_Solo",
  "/wiki/Racing_starfighter",
  "/wiki/A/SF-01_B-wing_starfighter",
  "/wiki/Cold_War",
  "/wiki/Blaster",
  "/wiki/Riosa",
  "/wiki/Elder_Houses",
  "/wiki/Resistance",
  "/wiki/Claudia_Gray",
  "/wiki/Bloodline_(novel)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Fugitives_and_Collaborators_Squadron_Pack",
  "/wiki/Del_Rey",
  "/wiki/File:New_Republic_Bloodline_Twitter_Post.jpg",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/File:Arliz_tweet.png"
 ]
}