{
 "name": "Arlo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Arlo was a male Human technician who served the Galactic Empire, and later defected to the Alliance, during the Galactic Civil War.\nAfter the Battle of Yavin, Arlo was assigned to the Imperial Fortress on Yavin 4 where he served as an assistant technician. During his time on Yavin 4, his immediate superior was a technician named Tellulon. However, Arlo ignored that Tellulon was in fact a spy of the Rebel Alliance who had infiltrated the Imperial armed forces. Arlo himself was having second thoughts about the Empire, wondering if it was he was serving the morally just faction.\nIn 1 ABY, during the Empire Day festivities, Tellulon met a group of Rebel spacers at the Imperial Fortress where he was based with Arlo. Tellulon suggested to a Rebel spacer to attempt to persuade Arlo to defect to the Alliance. The spacer met Arlo who accepted to listen to the Rebel's wisdom, and finally decided to leave the Empire and join the Rebellion. The Rebel spacers later visited Colonel Verks to report the news of Arlo's defection.\nArlo appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Arlo was added to the game upon the release of the \"Publish 19,\" on June 29, 2005.\nDuring the 2005 Empire Day live event from June 29 to July 11, 2005, he could be found in the Imperial Fortress and was part of a quest titled \"Empire Day Revealed,\" where Rebels had to persuade him to join the Rebellion. Only by being respectful to the Imperial could the Rebel player convince Arlo to defect. If the player was sarcastic or rude to the Imperial, Arlo would decline joining the Alliance, and the player could not complete the quest 100%.\nAfter the live event ended, Arlo never reappeared in the game, since the Empire Day event was discontinued until its complete overhaul in 2008.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Arlo_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Imperial_Fortress_(Yavin_4)",
  "/wiki/Yavin_4/Legends",
  "/wiki/Tellulon",
  "/wiki/Spy/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Empire_Day/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Verks",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_29",
  "/wiki/2005",
  "/wiki/July_11",
  "/wiki/2008",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}