{
 "name": "Arlos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pierce's black ops team"
     ]
    }
   ]
  }
 ],
 "content": "Arlos was a Human male sergeant who served the reconstituted Sith Empire during the Cold War. He served under Pierce until the division's dissolution, though he later joined the reformed Pierce's black ops team in capturing the Bastion during the Battle of Corellia.\nA former member of Pierce's black ops team, Arlos was found by Tanido when he tried to slice his own service record. In 3640 BBY Lieutenant Pierce recalled him back for the old team for a special occasion - General Arkos Rakton authorized Pierce to go after The Bastion, the Republic's best defended military complex on Corellia. Pierce trusted no one else except him old team to be qualified enough for the job. Arlos provided the floor layouts of the Bastion and set out to work on its systems. When the team was fully assembled, Rakton excused them for all other assignments and the team went for the Bastion. Arlos tripped an alarm going in, but still handled the system as if he designed it himself and the fortress' gates were open. Pierce's team dealt with the security, killed the Bastion's commanding officer and took the base for the Empire.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Pierce%27s_black_ops_team",
  "/wiki/Sergeant/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Pierce",
  "/wiki/Bastion_(Corellia)",
  "/wiki/Battle_of_Corellia",
  "/wiki/Tanido",
  "/wiki/3640_BBY",
  "/wiki/Lieutenant/Legends",
  "/wiki/General/Legends",
  "/wiki/Arkos_Rakton",
  "/wiki/Corellia/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}