{
 "name": "Armanda Durkin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Notsub Shipping Company"
     ]
    }
   ]
  }
 ],
 "content": "Armanda Durkin was a Human female and the CEO of the Notsub Shipping Company, located on the northern edge of Mos Eisley. She lived a double life as a pirate, bearing the alias of Duchess.\nArmanda Durkin was driven to succeed by tragedy. She owned a business with her husband that was destroyed in a fire, injuring her husband. When Maltsett Insurance Company, which held the policy on their business, refused to pay based on a legal technicality, she could not afford the care needed to save her husband's life. This left her with a grudge against Maltsett, and a desire for money and power.\nHer early years with the Notsub Shipping Company were not good ones. Due to high risk investments that failed to pay off her company was struggling. Then she noticed that three different shipments through her company were all insured by Maltsett. Realizing that she could save her company and take revenge, she created a disguise for herself, the Duchess, purchased a new freighter, the Vengeful Sandstorm, and hired a crew of pirates to help her steal her own shipment. The profit from the sale of stolen goods, coupled with the insurance payout from Maltsett, signaled the start of a new double life.\nNotsub became the largest company on Tatooine during the Galactic Civil War, and Armanda Durkin became wealthy and powerful. She continued her pirate raids on Maltsett-insured ships, using a series of shell companies to hide her illegal dealings. She maintained a \"no-killing\" policy for her pirates, but an incident circa 0 ABY that resulted in twelve deaths made her worry about the future, and consider getting out of the piracy business.\nArmanda Durkin is a svelte woman who is almost always richly attired when in public, with a penchant for fine brocade and silks. She wears her luxurious hair in a variety of complicated styles. This makes it all the easier to disguise herself as the Duchess, by hiding her hair under a cap and wearing a baggy flight jumpsuit to disguise her figure. She cares little for anything besides money or power, all other emotions having been transformed by her husband's death into her grudge against Maltsett Insurance Company. She is not entirely without conscience, however, and regrets any deaths her activities cause.\nIn her persona as the Duchess, Armanda Durkin owns the pirate freighter Vengeful Sandstorm.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Notsub_Shipping_Company",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Maltsett_Insurance_Company",
  "/wiki/Vengeful_Sandstorm",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/West_End_Games",
  "/wiki/A_Bith_Saved_Is_A_Bith_Learned",
  "/wiki/Galaxy_Guide_7:_Mos_Eisley",
  "/wiki/Pirates_%26_Privateers"
 ]
}