{
 "name": "Arn Peralun",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel; red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic eye",
      "arms",
      "legs",
      "and much of torso"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Arn Peralun's master",
      "Tau Idair"
     ]
    }
   ]
  }
 ],
 "content": "Arn Peralun was a Human male cyborg Jedi Knight who served the Jedi Order during the third war with the reconstituted Sith Empire after 3627 BBY as Tau Idair's Padawan.\nWhile on the planet Dakot Seven with his master, Arn was wounded severely by artillery fire when he attempted to defend the native population from slavers. While Arn survived, his master did not. Unfortunately, the people native to Dakot Seven were biologically incompatible with Kolto and Bacta, and took to healing Arn in the only way they knew how: cybernetics. Upwards of eighty percent of Arn's body was replaced and augmented to keep him alive.\nHis recovery took years, setting him back in his training as a Padawan, making him one of the oldest padawans of the order. Master Gnost-Dural took an interest in the Padawan, however, and assigned him to the Jedi Knight Tau Idair to continue his training.\nPeralun was sent alongside the Commander of the Eternal Alliance to Onderon by Gnost-Dural where he was to meet his new master. When they arrived, Peralun was introduced to the Sith Lana Beniko, before the pair were able to meet with Idair. After meeting his new master, a nearby explosion promoted the three to investigate further. Peralun was able to correctly identify Darth Savik's presence on Onderon, enabling the Republic to coordinate with Senator Deja Nebet to thwart the Sith Empire's plans for the planet.\nFollowing their success on Onderon in routing the Sith's forces and successfully apprehending Savik, Peralun accompanied his master to Mek-Sha. The Republic was able to successfully pursue their objectives there while removing the Sith's influence from the colony.\nHowever, Peralun's previous encounters with slavers on Dakot Seven led him to hunt down the slaver group known as the Brothers. Peralun gave into his anger and slew the slavers without his master being aware of what had transpired. Idair and Gnost-Dural both later said that Peralun was remorseful for his actions, but both also conceded that Peralun had given in to his anger and prejudice.\nIt was following Peralun's setback on Mek-Sha that he accompanied the Republic to Corellia to protect the Meridian Complex, and there, alongside his master, faced off against the Sith Lord Darth Malgus. In the aftermath of the battle, Malgus was defeated , while the complex was saved. However, both master and pupil were almost killed in the encounter, and were later treated for their injuries. The pair were both saved by the Jedi Knight Kira Carsen and Scourge, both of whom were in search for the Commander's assistance.\nPeralun later joined Task Force Nova, a joint military-civilian initiative partnered with the Alliance to reunite Jedi scattered throughout the galaxy to settle a new homeworld. While traveling with General Daeruun's fleet to Odessen, they were forced to answer a distress call from a refugee ship under attack by Dire Skulls. After managing to chase off the pirates, Peralun and Idair went in pursuit. By this time, Idair and Gnost-Dural believed Peralun to be almost ready for his Jedi Knight trials, a prospect he found both terrifying and exciting.\nPeralun would later accompany the Commander and Aryn Leneer when they traveled to the Dantooine Jedi Enclave to investigate the whereabouts of Darth Malgus. When they reported their findings to Gnost-Dural, Sal-Deron, Tau Idair, and Vinyor Tesh, Peralun stood up for Leneer when Tesh asked that she be expelled from the meeting on the basis that she was no longer a member of the Jedi Order and thus was not privy to the affairs of the Jedi. Peralun would go on to work with Tesh to uncover that the artifact stolen from Dantooine by Malgus was once owned by Darth Nul, but what properties the artifact had and what Maglus intended to do with it was still a mystery to them.\nArn carried a blue–bladed lightsaber.\nArn first appears in the 2019 Onslaught expansion for Star Wars: The Old Republic. He is voiced by Max Mittelman.\nWhen Arn hits the Brothers, the player has the choice to either assist him alone or alert his Master, either outcome strengthening or weakening their relationship, which will affect whether Arn survives the Meridian Complex assault unscathed or is badly injured. If he is injured he will not join his master as part of Task Force Nova and the pirate encounter will have a more violent ending.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Template:Expand",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Human/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Arn_Peralun%27s_master",
  "/wiki/Tau_Idair",
  "/wiki/Gender",
  "/wiki/Cyborg",
  "/wiki/Third_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/3627_BBY",
  "/wiki/Padawan/Legends",
  "/wiki/Dakot_Seven",
  "/wiki/Battle_on_Dakot_Seven",
  "/wiki/Slaver/Legends",
  "/wiki/Kolto/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Gnost-Dural",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Alliance_Commander",
  "/wiki/Eternal_Alliance",
  "/wiki/Onderon/Legends",
  "/wiki/Lana_Beniko",
  "/wiki/Darth_Savik",
  "/wiki/Senator/Legends",
  "/wiki/Deja_Nebet",
  "/wiki/Mek-Sha",
  "/wiki/The_Brothers",
  "/wiki/Corellia/Legends",
  "/wiki/Meridian_Complex",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Malgus",
  "/wiki/Kira_Carsen",
  "/wiki/Scourge",
  "/wiki/Task_Force_Nova",
  "/wiki/Odessen",
  "/wiki/Dire_Skulls",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Aryn_Leneer",
  "/wiki/Dantooine/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Sal-Deron",
  "/wiki/Vinyor_Tesh",
  "/wiki/Darth_Nul",
  "/wiki/Lightsaber/Legends",
  "/wiki/2019",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Max_Mittelman",
  "/wiki/Meridian_Complex_assault",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith",
  "/wiki/Mission_Abstract:_Investigate_link_between_Darth_Malgus_and_the_planet_Elom",
  "/wiki/Category:Images_of_Arn_Peralun"
 ]
}