{
 "name": "Arn_Horada",
 "display_name": "Arn Horada",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Metalorn"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Organa"
     ]
    }
   ]
  }
 ],
 "content": "Arn Horada was a renowned historian and professor of galactic history, who during the years following the Clone Wars served as a personal teacher to Alderaanian Princess Leia Organa during her youth. A native of Metalorn, Horada eventually returned to his homeworld, where he worked as a common laborer and underwent extensive re-education under the new Imperial government. In 0 ABY, Organa traveled to Metalorn in the hopes of re-establishing a link with Horada and helping to establish a Rebel presence on the world. Although her plot was uncovered, Horada openly defied the Empire and helped her escape the planet.\nA Human male, Arn Horada was a native of the planet Metalorn, a factory world in the Mid Rim. Horada eventually became a well-known historian acquiring a strong enough reputation that in the years following the Clone Wars, Alderaanian royal Bail Organa brought Horada to Alderaan to serve as a personal teacher for his young daughter Leia. By his time on Alderaan, Horada was regarded as one of the greatest professors and historians in the galaxy, and educated the young Organa in politics and galactic history.\nAfterwards, Horada returned to his homeworld, which saw a radical societal transformation after the Galactic Empire rose to power in 19 BBY. Control of Metalorn fell into the hands of Governor Corwyth, who tightly regimented daily life on the planet and instituted an information control program that succeeded in convincing the planet at large that a Rebellion did not even exist. The new Imperial government spent years re-educating Horada in particular, hoping that the respected historian could serve as an Imperial mouthpiece. Despite his profile, Horada toiled as an ordinary laborer in Metalorn's factories, and in 0 BBY he learned of Alderaan's destruction, which Metalorn's central information bureau attributed to a meteor storm: according to them, none of the royal house he once served survived.\nIn truth, Leia—now one of the Rebel Alliance's top leaders—had escaped her homeworld's obliteration, and several months later she traveled to Metalorn in the hopes of contacting her old teacher and using him to help set up a local resistance against Imperial rule. Organa's arrival didn't go unnoticed for long by the Imperial government's extensive surveillance system, but the Alderaanian Princess managed to escape pursuit long enough to make contact with Horada, who was shocked at her sudden appearance. However, their conversation was almost immediately interrupted by Baron Orman Tagge, the head of the Imperial-allied Tagge Company, who had learned of Horada's connection to Organa and correctly guessed the Rebel leader's objective. When Tagge attacked Organa, Horada kicked a chair into Tagge's path, giving his former student the opening she needed to flee. Humiliated by Organa's escape, Corwyth considered executing Horada for his interference, but ultimately let the historian walk free when Tagge suggested that any reprisal would only confirm the existence of Rebel activity.\nAlthough a renowned historian and teacher, Arn Horada proved to be no less susceptible to the Empire's re-education efforts than most other natives of Metalorn, believing their false narratives of Alderaan's destruction and initially suspecting that Organa's appearance was some sort of trick. However, he still proved to have some fight in him, openly defying the Empire by interfering with Orman Tagge and allowing Organa to escape.\nArn Horada first appeared in Star Wars  30, written by Archie Goodwin and released in 1979, where he was illustrated by Carmine Infantino.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Metalorn/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Historian/Legends",
  "/wiki/Professor/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Homeworld/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Politics/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Corwyth",
  "/wiki/Information_control_program",
  "/wiki/0_BBY/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Meteorite/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Orman_Tagge/Legends",
  "/wiki/Tagge_Company",
  "/wiki/Star_Wars_(1977)_30",
  "/wiki/Archie_Goodwin",
  "/wiki/1979",
  "/wiki/Carmine_Infantino",
  "/wiki/Databank_(original)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion"
 ]
}