{
 "name": "Arnet",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Blizzard Force",
      "Tempest Force",
      "Blizzard Force",
      "Tempest Force"
     ]
    }
   ]
  }
 ],
 "content": "Arnet was a human male who was a veteran Imperial AT-ST pilot and lieutenant. He piloted the Walker Blizzard Scout 1 during the Battle of Hoth, and later Tempest Scout 1 in Battle of Endor.\nArnet was a male Human veteran AT-ST pilot, who commanded the Imperial walker Blizzard Scout 1 in General Veers' Blizzard Force during the Battle of Hoth in the year 3 ABY. During the battle, Much of Blizzard Force was destroyed by Alliance snowspeeders, including the AT-AT Walkers Blizzard 2 and Blizzard 4. Ultimately, the battle would end in a tactical victory, though strategic failure for the Imperials.\nEarning the rank of lieutenant by the year 4 ABY, Arnet piloted the enclosed AT-ST walker Tempest Scout 1. After the ambush of the Endor shield generator bunker, which was protecting the under construction Imperial battlestation, the Death Star II, Tempest Scout 1 was present near the bunker. Arnet was assigned to coordinate the surprise counterattack in the Battle of Endor. However, the battle would become a victory for the Alliance.\nArnet was a human male with light skin.\nAs an AT-ST driver, Arnet wore a gray jumpsuit, and a dark green and black helmet with a chinstrap and goggles.\nArnet's name was first established by his character card in the 1999 Endor Limited expansion set of Decipher's Star Wars Customizable Card Game, with the name's synonymous mention in the text for a card for his AT-ST, Tempest Scout 1, released in the same set.\nAlthough the Tempest Scout 1 card identifies the walker as one of the AT-STs seen during the onset of the Battle of Endor of the 1983 film Star Wars: Episode VI Return of the Jedi, it is difficult to tell if the walker's onscreen occupant is the same actor used for the \"Lieutenant Arnet\" CCG card. As the \"Tempest Scout 1\" card does not identify the individual as Arnet this article avoids linking Arnet to the Return of the Jedi movie actor, and treats the Customizable Card Game's \"Lieutenant Arnet\" and \"Tempest Scout 1\" cards as the licensed Star Wars products that first introduced the character.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Blizzard_Force/Legends",
  "/wiki/Tempest_Force",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Blizzard_Scout_1",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Tempest_Scout_1",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Walker/Legends",
  "/wiki/General/Legends",
  "/wiki/Maximilian_Veers/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/T-47_airspeeder",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Blizzard_2/Legends",
  "/wiki/Blizzard_4/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Endor_shield_generator_bunker",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Color/Legends",
  "/wiki/Helmet/Legends",
  "/wiki/Goggles/Legends",
  "/wiki/1999",
  "/wiki/Endor_Limited",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_11",
  "/wiki/The_Official_Star_Wars_Fact_File_50",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/The_New_Essential_Chronology"
 ]
}