{
 "name": "Arnus",
 "display_name": "Arnus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Amber"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicGalactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Arnus was a Human male Senator who served in the Galactic Senate of the Republic during the Cold War.\nIn 3643 BBY, Senator Arnus called General Elin Garza via hologram to inquire about the rumors surrounding supposed defections from SpecForce. Garza assured him that the rumors were baseless but the senator wasn't going to take her at her word but was quickly dismissed as the general terminated the call to address some guests in her office.\nArnus later summoned the new CO of Havoc Squad to an informal inquiry before a Senate committee, composed of himself, Senators Voralla and Zorin Krasul, for the purpose determining the defection of the previous Havoc. The CO truthfully admitted that the rest of Havoc Squad had defected to the Sith Empire. Arnus then asked if Harron Tavus and his cohorts showed any signs of instability or frustration before defecting. When told that they were subtle about it, he then asked if the events on Ando Prime are connected to Havoc's defection, only for Voralla to point out that the operation on Ando Prime are classified and told the CO to ignore the question. The committee then dismissed the CO.\nAround 3641 BBY, Arnus and his colleagues summoned Havoc back to Coruscant for a hearing to discuss the squad's recent activities. Once the CO arrived at the Senate, the senator behind the hearing, Grom Zian, started accusing Havoc Squad of abuse their privileged position. He laid out allegations against the squad, accusing them of murdering Tavus and covered it up, provoked the Empire by destroying the Gauntlet without Senate approval and apparent lack of contribution to the war effort. When it came to the CO's turn to speak, the trooper showed evidence gathered by the SIS, revealing Zian to be a paid agent for the Empire, attempting to get Havoc suspended to allow General Arkos Rakton to turn the tide of the war. The Chagrian attempted to deny the evidence as \"wild accusations\" and \"paranoid delusions\", but Arnus decided to review the evidence. Once the committee had thoroughly examined the evidence and became certain that it's valid, Arnus then ordered the Senate Guard to detain Zian for high treason. Voralla then apologized to the CO for doubting them and allowed the trooper to return to the front lines.\nArnus is a non-player character from the massively multi-player online role playing game Star Wars: The Old Republic released by BioWare in 2011. He is voiced by Fred Tatasciore.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3643_BBY",
  "/wiki/General/Legends",
  "/wiki/Elin_Garza",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Havoc_Squad",
  "/wiki/Voralla",
  "/wiki/Zorin_Krasul",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Harron_Tavus",
  "/wiki/Ando_Prime/Legends",
  "/wiki/3641_BBY",
  "/wiki/Coruscant/Legends",
  "/wiki/Grom_Zian",
  "/wiki/Gauntlet_(Sith_Empire)",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Arkos_Rakton",
  "/wiki/Galactic_War",
  "/wiki/Chagrian/Legends",
  "/wiki/Senate_Guard/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Fred_Tatasciore"
 ]
}