{
 "name": "Arra_Yooms",
 "display_name": "Arra Yooms",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "3662 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic legs"
     ]
    }
   ]
  }
 ],
 "content": "Arra Yooms was a Human female who lived on Vulta. She was the daughter of Zeerid Korr.\nArra was the child of Zeerid Korr and his wife, Val. In a tragic accident, she lost her legs and her mother was killed. Her father, Zeerid, tried to continue to take care of her, but was unable to make enough money legally to provide for her. Zeerid was then forced to work for the Exchange to help provide for Arra, and hoped to eventually get prosthetic legs for her. While he worked for the Exchange, Zeerid placed Arra in the care of his sister-in-law, Nat. Zeerid kept his work a secret from Arra, although he continued to grow deeper into debt. However, after accepting a spicerunning job, he used the credits to purchase a Hoverchair for her, as she used a wheelchair beforehand. She enjoyed a brief visit with her father, although he soon had to leave to continue his illegal work. Although Zeerid's mission eventually failed, he managed to escape the Exchange and to gain enough credits to buy her prosthetic legs. When her father became a farmer and Jedi Knight Aryn Leneer lived with them as of their love developed into a relationship, Yooms welcomed Leneer to their farm, as she enjoyed the use of her new legs.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Quite_A_Story_To_Tell",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/3662_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Vulta",
  "/wiki/Zeerid_Korr",
  "/wiki/Val_(Natala_Yooms%27_sister)",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Exchange",
  "/wiki/Natala_Yooms",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Aryn_Leneer",
  "/wiki/The_Old_Republic:_Deceived",
  "/wiki/The_Old_Republic:_Deceived_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}