{
 "name": "Arrek_Von_Sarko",
 "display_name": "Arrek Von Sarko",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Amber"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Arrek Von Sarko was Human male who lived during the time of the Galactic Civil War. Sometime following the Battle of Yavin in 0 BBY, he would frequent the cantina in the city of Moenia on the planet Naboo.\nSometime following the Battle of Yavin in 0 BBY, the Human male by the name of Arrek Von Sarko frequented the cantina in the city of Moenia on the planet Naboo. While there, he encountered a spacer, and tasked the individual with completing a number of tasks. The first involved delivering a datadisc containing a compendium of evidence in an ongoing fraud investigation into Corellian shipping interests of Shalera the Lady Hutt to an individual named Huffee Vindaag. Despite being ambushed by a tusk cat on the way to Vindaag in the Naboo countryside, the spacer succeeded in delivering the datadisc.\nVon Sarko's next task was to escort an artisan named Folux Pozur back to Moenia. The spacer succeeded, despite being ambushed by yet another dangerous beast called a narglatch. However, the spacer's work did not end there. Von Sarko also requested that an Imperial sergeant named Merox Suld be escorted back to the city. Although the spacer was attacked by a Gungan scout attempting to impede the sergeant's rescue, the spacer neutralized the native and brought the Imperial officer back to the safe confines of Moenia.\nArrek Von Sarko was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011.\nPlayers who performed a series of quests for Von Sarko had to deliver a datadisc to Vindaag, and escort Pozur and Sergeant Suld safely back to Moenia. Although these three quests could be completed, Von Sarko's dialogue was incomplete, thus providing limited context for the quest's storyline. The game files suggest that Von Sarko paid 500 credits as a reward for each of the three questions, in addition to a bracelet as a reward for the second quest. However, it is not known if these rewards were actually implemented. Von Sarko's quests were removed at some point during the game's lifespan, but he remained in the Moenia cantina. If a player were to attempt to converse with him, he would simply dismiss the player by saying, \"I'm a bit preoccupied at the moment.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/City/Legends",
  "/wiki/Moenia/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Shalera",
  "/wiki/Lord/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Huffee_Vindaag",
  "/wiki/Tusk_cat",
  "/wiki/Artisan/Legends",
  "/wiki/Folux_Pozur",
  "/wiki/Narglatch/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Merox_Suld",
  "/wiki/Gungan/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Bracelet/Legends",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided_Quick_Reference_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide"
 ]
}