{
 "name": "Arro_Basteren",
 "display_name": "Arro Basteren",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ertegas"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Scarif"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Marine Corps",
      "Rogue One",
      "Marine Corps",
      "Rogue One"
     ]
    }
   ]
  }
 ],
 "content": "Arro Basteren was a human male soldier who grew up on the planet Ertegas and joined the Alliance to Restore the Republic in their fight against the Galactic Empire during the Galactic Civil War. He became a member of the Marine Corps of the Rebel Alliance Special Forces and was a private, primarily serving as spotter to the sniper Serchill Rostok. Basteren was one of several soldiers recommended by General Davits Draven for possessing the fearlessness and self-awareness and considered by the general for a potential mission to raid the headquarters of Saw Gerrera's Partisans on Jedha. Later, he and his fellow soldiers volunteered for an unsanctioned mission to steal the Death Star's plans from the Citadel Tower on the planet Scarif in 0 BBY. Basteren perished in the battle that followed, helping to ensure that the plans were transmitted to the Alliance Fleet.\nArro Basteren was a human male soldier who was born on the agriworld of Ertegas in the Anoat sector. He grew up there, protecting his family's crops from woshrikes and other dangerous creatures which sharpened his eyesight and helped him develop the skill of seeking out and destroying the enemy. He eventually joined the Alliance to Restore the Republic in their fight against the Galactic Empire during the Galactic Civil War, with whom he served as a private in the Rebel Alliance Special Forces' Marine Corps, and found a natural place as a scout.\nIn the Rebel Alliance, Basteren acted as a spotter for the renowned sniper Corporal Serchill Rostok, uncovering targets using Q4-E quadnoculars and passing the information on to Rostok. His primary task was maintaining situational awareness and environmental status in the midst of battle. During his service, he was recognized by General Davits Draven for both his fearlessness and self-awareness. For this reason, when Draven had doubts that the former member of the resistance fighter Saw Gerrera's Partisans Jyn Erso would successfully connect with Gerrera on the moon of Jedha, he recommended Basteren and several other soldiers to Rebellion chancellor Mon Mothma for a potential raid of the Partisan headquarters in Jedha's Catacombs of Cadera. The general sent a biography of Basteren to Mothma and suggested they start with those soldiers and build a larger squad around them.\nIn 0 BBY, once Erso had successfully completed the mission to connect with Gerrera and learned of the Empire's Death Star superweapon, Basteren and the same group of Rebel soldiers volunteered to join her in an unsanctioned mission to steal the Death Star's plans from the Citadel Tower on the planet Scarif. The volunteer squad took the improvized callsign \"Rogue One\" and infiltrated the planet's defenses in the stolen Zeta-class Heavy Cargo Shuttle SW-0608. On Scarif, Basteren was among a squad that set out to create a distraction and draw the Empire's forces so that Erso and a small team could sneak into the Citadel and find the plans. He and the others ultimately gave their lives in the fighting to ensure the plans were transmitted to the Alliance Fleet.\nThe intelligence update to Mon Mothma that featured Draven's recommendation and biography of Arro Basteren was eventually included in The Rebel Files, a collection of documents relating to the Rebel Alliance compiled by the archivist Hendri Underholt. When The Rebel Files were recovered in 34 ABY after being lost during the bombardment of Durkteel in 4 ABY, the documents were passed on the General Leia Organa of the Resistance and several Resistance members read them. Resistance officer and former Rebel Caluan Ematt read Draven's recommendation of Basteren and his fellow soldiers and commented that Draven was on to something in selecting them, as evidenced by Basteren's volunteering for the unsactioned mission to Scarif that resulted in his death.\nArro Basteren was a human male with light skin, brown hair and blue eyes.\nAs member of Rebel Alliance Special Forces, he was a brave and resilient individual. Basteren was among a group of Rebel soldiers that General Davits Draven believed possessed the genuine fearlessness needed to undertake a mission with long odds and the self-awareness needed to survive more than a minute during such a mission.\nArro Basteren was a first-class rebel soldier. Basteren had sharp eyesight and a knack for uncovering and destroying the enemy, both skills honed by keeping his family's crops protected from woshrikes and other dangerous creatures on his homeworld.\nBasteren wore a blue vest over a blue jacket, with brown pants and boots. The vest had an orange patch on his right lapel and white and red insignias on the left lapel. These were paired with a black and tan helmet and a brown colored belt that contained several containers on it.\nHe also used an A-300 blaster rifle and a pair of Fabritech Q4-E quadnoculars, which possesed an imaging screen surface that captured approaching Imperials. Basteren's quadnoculars were held up by a blue strap around his neck.\nPrivate Basteren was played by James Harkness in the film Rogue One: A Star Wars Story, which was released in North America on December 16, 2016. His surname was revealed in the film credits, while his first name was first identified in the reference book Star Wars: Rogue One: The Ultimate Visual Guide, which was published the same day and written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ertegas",
  "/wiki/0_BBY",
  "/wiki/Scarif",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Marine_Corps",
  "/wiki/Rogue_One",
  "/wiki/Rebel_trooper",
  "/wiki/Planet",
  "/wiki/Galactic_Empire",
  "/wiki/Galactic_Civil_War",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/Private",
  "/wiki/Sniper",
  "/wiki/Serchill_Rostok",
  "/wiki/General",
  "/wiki/Davits_Draven",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Jedha",
  "/wiki/Thief",
  "/wiki/Death_Star",
  "/wiki/Death_Star_plans",
  "/wiki/Citadel_Tower",
  "/wiki/Death",
  "/wiki/Battle_of_Scarif",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Agriworld",
  "/wiki/Anoat_sector",
  "/wiki/Woshrike",
  "/wiki/Eye",
  "/wiki/Scout",
  "/wiki/Corporal",
  "/wiki/Q4-E_quadnoculars",
  "/wiki/Jyn_Erso",
  "/wiki/Moon",
  "/wiki/Soldier",
  "/wiki/Chancellor_(Rebel_Alliance)",
  "/wiki/Mon_Mothma",
  "/wiki/Catacombs_of_Cadera",
  "/wiki/Squad",
  "/wiki/Operation_Fracture",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Callsign",
  "/wiki/Shield_Gate",
  "/wiki/Zeta-class_Heavy_Cargo_Shuttle",
  "/wiki/SW-0608",
  "/wiki/The_Rebel_Files",
  "/wiki/Archivist",
  "/wiki/Hendri_Underholt",
  "/wiki/34_ABY",
  "/wiki/Bombardment_of_Durkteel",
  "/wiki/Durkteel",
  "/wiki/4_ABY",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Resistance",
  "/wiki/Officer",
  "/wiki/Caluan_Ematt",
  "/wiki/Hair",
  "/wiki/Standard_minute",
  "/wiki/Homeworld",
  "/wiki/Jacket",
  "/wiki/Boot",
  "/wiki/Helmet",
  "/wiki/Belt",
  "/wiki/A-300_blaster_rifle",
  "/wiki/Fabritech",
  "/wiki/Quadnoculars",
  "/wiki/James_Harkness",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/December_16",
  "/wiki/2016",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Category:Images_of_Arro_Basteren",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Rogue_One",
  "/wiki/Rogue_One:_A_Star_Wars_Story_-_The_Official_Collector%27s_Edition",
  "/wiki/Top_Trumps",
  "/wiki/Top_Trumps:_Star_Wars:_Rogue_One",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_171",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Insider_Special_Edition_2019",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Heroes_of_Rogue_One",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/StarWars.com",
  "/wiki/Dorling_Kindersley"
 ]
}