{
 "name": "Ars Veruna",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "By 32 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo"
     ]
    }
   ]
  }
 ],
 "content": "Ars Veruna was a human male who served as the king of the Mid Rim planet of Naboo prior to the reign of Queen Padmé Amidala. A philosopher named Sio Bibble was elected Governor of Naboo under Veruna's rule. During his reign, Veruna established a vast royal library collection in a tower at the back of the Theed Royal Palace. Veruna was considered a corrupt king, and was assassinated prior to Amidala's election as queen in 32 BBY.\nHe shared his name with Veruna, one of the three moons of Naboo.\nArs Veruna was first canonically mentioned in Sio Bibble's entry from the 2016 reference book Star Wars Character Encyclopedia: Updated and Expanded, written by Pablo Hidalgo. The text mentioning Veruna is reprinted from the Star Wars Legends reference book Star Wars Character Encyclopedia, written by Simon Beecroft and published in 2011.\nIn 2016, Star Wars Character Encyclopedia: Updated and Expanded stated that Veruna was Amidala's predecessor. Other reference materials published in that year stated that his reign lasted thirteen years, and ended when she defeated him in an election.\nEarlier mentions of Veruna are inconsistent with material published during and after 2018. The fifty-fourth issue of the magazine Star Wars Helmet Collection, published that year, retconned the previous information that Amidala had defeated Veruna in an election by instead stating that he had been assassinated before she was elected. The 2019 canon novel Queen's Shadow, written by E. K. Johnston, established that Naboo monarchs can only serve for a maximum of four years, or two terms lasting two years each. The 2019 reference book Ultimate Star Wars, New Edition placed Bibble's election to the position of Governor during Veruna's reign, but did not maintain Veruna as Amidala's immediate predecessor, or specify the duration of his reign. Johnston's 2020 novel Queen's Peril, which is set in 32 BBY, stated that Amidala's immediate predecessor was Sanandrassa, a single-term queen who was elected when Queen Réillata retired after one term.\nQueen's Peril placed the beginning of Réillata's first term in 36 BBY, and Sanandrassa's in 34 BBY. This dating is inconsistent with James Luceno's 2014 canon novel Tarkin, which is set in 14 BBY, and has Wilhuff Tarkin remember a conversation from \"twenty years earlier,\" in which Senator Palpatine briefly talked about the Naboo king who ruled at that time: \"Even on my own Naboo, the king finds himself embroiled with the Trade Federation and off-world bankers with regard to our plasma exports.\" The quote superficially describes events previously seen in Luceno's 2012 Legends novel Darth Plagueis. However, it has not yet been confirmed in canon whether this king is indeed Veruna.\nIn the Legends continuity, Veruna was first mentioned in the 1999 novel Star Wars Episode I Journal: Queen Amidala, written by Jude Watson. He later made his first appearance in the 2000 short comic \"A Summer's Dream,\" published in Star Wars Tales 5 by Dark Horse Comics. Veruna was eventually given the first name Ars in the novel Darth Plagueis, in which he has a prominent role.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ars_Veruna",
  "/wiki/Ars_Veruna/Legends",
  "/wiki/King",
  "/wiki/Veruna",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Queen%27s_Peril",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_47",
  "/wiki/Naboo",
  "/wiki/32_BBY",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Gender",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Queen",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Philosopher",
  "/wiki/Sio_Bibble",
  "/wiki/Governor_of_Naboo",
  "/wiki/Veruna%27s_tower",
  "/wiki/Theed_Royal_Palace",
  "/wiki/Death",
  "/wiki/Democracy",
  "/wiki/Moon",
  "/wiki/2016",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Character_Encyclopedia",
  "/wiki/Simon_Beecroft",
  "/wiki/2011",
  "/wiki/Standard_year",
  "/wiki/2018",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Retcon",
  "/wiki/Assassin",
  "/wiki/2019",
  "/wiki/Queen%27s_Shadow",
  "/wiki/E._K._Johnston",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/2020",
  "/wiki/Sanandrassa",
  "/wiki/R%C3%A9illata",
  "/wiki/36_BBY",
  "/wiki/34_BBY",
  "/wiki/James_Luceno",
  "/wiki/2014",
  "/wiki/Tarkin_(novel)",
  "/wiki/14_BBY",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Senator",
  "/wiki/Darth_Sidious",
  "/wiki/2012",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/1999",
  "/wiki/Star_Wars_Episode_I_Journal:_Queen_Amidala",
  "/wiki/Jude_Watson",
  "/wiki/2000",
  "/wiki/Star_Wars_comic_books",
  "/wiki/A_Summer%27s_Dream",
  "/wiki/Star_Wars_Tales_5",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Unidentified_Queen_of_Naboo_(40_BBY)",
  "/wiki/40_BBY",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/19_BBY",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Queen%27s_Hope",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_BBY"
 ]
}