{
 "name": "Artruk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Artruk was a male Twi'lek who lived on the planet of Ryloth during the Clone Wars. In 22 BBY, Artuk was hired by Separatist Council member Passel Argente to hide secret items he had acquired from the planet Christophsis. When the two met in Ryloth's capital, Lessu, Argente presented the items to Artruk and requested that the Twi'lek store them in a secure warehouse in the city. During their negotiation, two Twi'leks—Cham Syndulla and Voyla—spied on Artruk and Argente and concluded that the war might find its way to Ryloth, after spotting Confederate battle droids. However, Syndulla and Voyla weren't the only ones spying on Artruk and Argente; the tactical droid TA-175 and Separatist Council member Wat Tambor watched Artruk and Argente via hologram. After hearing Artruk's discussion about the treasures he hid on Ryloth, Tambor told his droid that an invasion of Ryloth was about to commence.\nA male Twi'lek, Artruk lived on the planet of Ryloth. In 22 BBY, during the Clone Wars, Artruk signed a contract that was presented to him by Magistrate Passel Argente, a member of the Separatist Council. Argente wanted the Twi'lek to hide secret items he had acquired from the planet Christophsis. The two met in Ryloth's capital city, Lessu, and the Magistrate showed the items to Artruk. The Twi'lek acknowledged Argente when the latter told him the items had to be confined within a secure place, and Artruk took the valuables to a nearby loading cart, soon to be inspected by two pit droids.\nUsing a datapad, Artruk calculated the amount of credits Argente had to pay him. After Artruk told Argente that it seemed to be a \"profitable month\" for him, the Twi'lek revealed information about the items out loud, despite Argente's request for anonymity. Angered by the Twi'lek's behavior, Argente told Artruk he was only going to pay him to erase any connection he had with the items. During their negotiation, two Twi'leks—Cham Syndulla and Voyla—spotted Artruk and Argente in the warehouse. The pair spied on them on top of the warehouse's ceiling support beams and saw Confederate battle droids near Artruk and Argente, leading them to conclude that the Clone Wars might come to Ryloth.\nThey weren't the only ones spying on Artruk and Argente, however. Tactical droid TA-175 and Separatist Council member Emir Wat Tambor watched both Artruk and Argente via hologram. When Tambor heard Artruk discuss his hidden treasures on Ryloth, he asked TA-175 if Ryloth was one of their targeted worlds; the droid revealed that it was \"target number seventy-nine.\" Tambor then ordered the droid to mobilize their troopers and change Ryloth's priority number from seventy-nine to one. With Tambor, the Confederacy invaded Ryloth and established a blockade around the planet.\nArtruk's only desire was to help those who had riches in their possession, and he was referred to as a \"fat leech\" by Voyla. When he was contracted by Argente, the Twi'lek didn't hesitate to help the Magistrate, and met with him in Ryloth's capital of Lessu, which Artruk called the \"city of riches.\" When Argente wanted his items to be hidden within a secure location, Artruk told him that his warehouses were the securest ones in the Outer Rim. Artruk also specialized in anonymity, which pleased Argente. Despite his promises of anonymity, the Twi'lek spoke of the item's origins out loud, angering Argente. Artruk had green skin.\nArtruk first appeared in The Clone Wars: Covetous, a six-page online comic in the Star Wars: The Clone Wars webcomic series, which led directly into \"Storm Over Ryloth,\" the nineteenth episode of Season One of the Star Wars: The Clone Wars television series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Separatist_Council",
  "/wiki/Passel_Argente/Legends",
  "/wiki/Christophsis/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Lessu/Legends",
  "/wiki/City/Legends",
  "/wiki/Cham_Syndulla/Legends",
  "/wiki/Voyla",
  "/wiki/Spy/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/T-series_tactical_droid",
  "/wiki/TA-175/Legends",
  "/wiki/Wat_Tambor/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Battle_of_Ryloth/Legends",
  "/wiki/Magistrate/Legends",
  "/wiki/DUM-series_pit_droid/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Standard_month/Legends",
  "/wiki/Emir_(title)/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/The_Clone_Wars:_Covetous",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_Clone_Wars_(webcomics)",
  "/wiki/Storm_Over_Ryloth",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com"
 ]
}