{
 "name": "Arvel Crynyd",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Thyferra"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Endor system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Thyferran bacta cartel",
      "Alliance to Restore the Republic",
      "Green Squadron",
      "Green Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Arvel Crynyd was a male human pilot who served in the Alliance to Restore the Republic during the Galactic Civil War. In the war's fourth year, Commander Crynyd participated in the Rebellion's attack on the Galactic Empire's second Death Star in the Battle of Endor, flying an RZ-1 A-wing interceptor in Green Squadron as leader of the squadron. When Crynyd was killed during the battle in a suicide run to destroy the Super Star Destroyer Executor, Lieutenant L'ulo L'ampar assumed command of the squadron. The battle ended soon after, seeing the destruction of the Death Star and death of Galactic Emperor Sheev Palpatine.\nArvel Crynyd was a male human who flew as a Z-95 Headhunter pilot for a Thyferran bacta cartel before joining the Alliance to Restore the Republic. With the Alliance, he fought in the Galactic Civil War, a galaxy-wide conflict between the Alliance and the Galactic Empire. Holding the rank of commander, Crynyd flew as a pilot in Green Squadron, operating an RZ-1 A-wing interceptor In 4 ABY, after the Bothan Spynet discovered that Galactic Emperor Sheev Palpatine would be aboard the second Death Star to oversee its construction, Alliance High Command determined that launching an immediate assault on the space station would be their only chance to cripple the Empire.\nWith the full Alliance Fleet, Crynyd, under the callsign of Green Leader, exited hyperspace above the forest moon of Endor, approaching the superweapon in his A-wing. He was the last squadron leader to report stand-by status and prepared to attack the Death Star, but pulled up at the last second on General Lando Calrissian's orders when it was revealed that the shield was still up. Green Squadron was ordered to stick close to Sector MV-7 as a massive flotilla of Star Destroyers emerged from the other side of the moon. The Alliance had walked right into a trap, but were determined to go down fighting. Initially, both sides fought with only their starfighters to the rebels' confusion, but this turned to horror when the Death Star proved itself to be fully operational, firing its superlaser on the Mon Calamari Star Cruiser Liberty and reducing it to atoms. Following the advice of Calrissian, the remaining Rebel forces moved up alongside the Star Destroyers and fought at point-blank range, hoping the Death Star wouldn't dare shoot into its own fleet.\nWhen the shield protecting the Death Star was disabled, several fighters broke off and headed for it to destroy the reactor. To buy them time, Crynyd and his squadron attacked the Imperial flagship, the mighty Super Star Destroyer Executor, with two A-wings knocking out its bridge deflector shields. In response, Admiral Firmus Piett ordered the forward batteries to increase forward firing to prevent any window of opportunity from being exploited. As Crynyd attempted a trench run through the ship's superstructure, his fighter was struck by a laser bolt and spun wildly. Realizing he was doomed, Crynyd managed to wrestle what little control he had over his starfighter and put it on a collision course with the Executor's unshielded bridge tower. Letting out one last cry of defiance, Crynyd's ship crashed through the bridge windows and exploded, killing himself alongside Piett and the entire bridge crew.\nWithout its command structure, the Executor lost primary power and plunged into the Death Star's gravity well, colliding with the station and detonating in a massive fireball. Crynyd's sacrifice tipped the battle in the Alliance's favor, with the Death Star being destroyed shortly after.\nCrynyd was a human male with brown eyes and light skin. Being a veteran pilot and instructor, Crynyd spent more time in an A-wing than anyone else in the Alliance Starfighter Corps. He praised the starfighter and maintained the notion that skilled A-wing pilots could easily outfly the TIE interceptor—the Imperial counterpart to the A-wing. Having also recognized that the lightly shielded A-wings couldn't stand up to Imperial-class Star Destroyers, Crynyd pushed them into reconnaissance and escort missions where speed meant strength. He was also brave and dedicated to the Alliance cause to the extent that he was willing to sacrifice his life for it, crashing his crippled starfighter into the Executor.\nCrynyd possessed hyper-quick reflexes and an uncanny spatial sense.\nAs a pilot of the Alliance, Arvel Crynyd wore a green flight suit and helmet, while operating an RZ-1 A-wing interceptor.\nArvel Crynyd first appeared in the 1983 film Star Wars: Episode VI Return of the Jedi. He was portrayed by Hilton McRae in an uncredited role. The character's name during the production of Return of the Jedi was \"Mad Maxx\" — an homage to the film Mad Max — as seen in storyboards for the film.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Arvel_Crynyd",
  "/wiki/Arvel_Crynyd/Legends",
  "/wiki/Arvel",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Thyferra",
  "/wiki/4_ABY",
  "/wiki/Endor_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Thyferran_bacta_cartel",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Green_Squadron_(Rebel_Alliance)",
  "/wiki/Battle_of_Endor",
  "/wiki/Rebel_pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/Standard_year",
  "/wiki/Commander",
  "/wiki/Galactic_Empire",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Green_Leader",
  "/wiki/Death",
  "/wiki/Suicide",
  "/wiki/Super_Star_Destroyer",
  "/wiki/Executor",
  "/wiki/Lieutenant",
  "/wiki/L%27ulo_L%27ampar",
  "/wiki/Squadron",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Z-95_Headhunter",
  "/wiki/Pilot",
  "/wiki/Bacta",
  "/wiki/Galaxy",
  "/wiki/Military_rank",
  "/wiki/Bothan_Spynet",
  "/wiki/Alliance_High_Command",
  "/wiki/Space_station",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Callsign",
  "/wiki/Hyperspace",
  "/wiki/Endor",
  "/wiki/Endor_(planet)",
  "/wiki/Superweapon",
  "/wiki/General",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Firmus_Piett",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/TIE/IN_interceptor",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Flight_suit",
  "/wiki/Flight_helmet",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Hilton_McRae",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Shattered_Empire_1",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_A-wing_Deluxe_Book_and_3D_Wood_Model",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Rebel_Alliance_Conversion_Kit",
  "/wiki/RZ-1_A-Wing_Expansion_Pack",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_75",
  "/wiki/Helmets",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_13",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Rebel_Starfighters_Owners%27_Workshop_Manual",
  "/wiki/LEGO",
  "/wiki/LEGO_Classic_Star_Wars",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Databank_(website)",
  "/wiki/The_Making_of_Return_of_the_Jedi"
 ]
}