{
 "name": "Asaak Dan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order",
      "Mon Calamari Rangers"
     ]
    }
   ]
  }
 ],
 "content": "Asaak Dan was a Togruta male Jedi Master who lived during the Second Imperial Civil War. He was present at the Jedi Order's Hidden Temple when the bounty hunter Cade Skywalker visited it in 137 ABY. Skywalker looked to gain the Jedi Council's help in assassinating Darth Krayt, Dark Lord of the Sith and Emperor of his faction of the Galactic Empire. The Council refused, instead opting to oppose Krayt by allying with the remnants of the Galactic Alliance and the deposed Emperor Roan Fel's forces. Dan, along with Jedi Masters Sayar Dun'La, Te Corso, and Drok, was sent by the Council to meet with Admiral Gar Stazi, the leader of the Galactic Alliance Remnant. After Dan and his fellow Jedi boarded Stazi's flagship, the Alliance, he volunteered to accompany the Imperial Knight Sigel Dare on a mission to retrieve her fellow Imperial Knight Treis Sinde from the world of Dac, which was under siege by the Sith-Imperial forces.\nWhen Dan and Dare located Sinde, the Imperial Knight refused to leave Dac since he was assisting the Mon Calamari Rangers, who were fighting against the Sith-Imperials on Dac. After Dare and Sinde began to duel each other, Dan intervened and managed to break up the fight. He volunteered to take Sinde's place with the Mon Calamari Rangers and bid the two Imperial Knights farewell. Shortly thereafter, the Sith Lord Darth Wyyrlok—who had assumed control of Krayt's Empire—ordered the execution of the Final Protocol. The Sith forces on Dac infected the planet's oceans with Viral spores that would eliminate all life on Dac within one week. Dan and the Rangers captured the city Heurkea's docks and aided the Galactic Alliance fleet in their evacuation efforts, managing to rescue twenty percent of Dac's surviving population. The Jedi Master departed the planet on the last shuttle with the Mon Calamari Ranger Captain Tanquar.\nAsaak Dan, a male Togruta Jedi Master, was a member of the Jedi Order during the Second Imperial Civil War in 137 ABY. Dan lived in the Hidden Temple on the planet Taivas—where the surviving Jedi had fled after the One Sith and Imperial forces massacred the Order on Ossus seven years previously—when the former Jedi Padawan Cade Skywalker, son of deceased Jedi Council member Kol Skywalker, came to the Temple in order to ask for the Jedi's help in assassinating the Dark Lord of the Sith and Emperor Darth Krayt. The Council refused to aid Skywalker, instead opting to oppose Krayt by pursuing an alliance with the Galactic Alliance Remnant and the forces of the deposed Emperor Roan Fel.\nAfter Skywalker successfully assassinated Krayt, the Council sent Dan and fellow Jedi Masters Te Corso, Sayar Dun'La, and Drok to meet with Galactic Alliance Admiral Gar Stazi and discuss the possibility of the Jedi allying with his forces and Roan Fel's Empire-in-exile against the Sith. Dan and his companions journeyed to Stazi's flagship, the Alliance, and boarded the ship in their X-83 TwinTail starfighters. After disembarking, Dan and the Jedi were greeted by Stazi and several Alliance officers. During Stazi's ensuing conversation with Corso, the Imperial Knight Sigel Dare, who represented Fel's Empire, interrupted Stazi. She asked the Admiral for permission to take one of his shuttles to the planet Dac in order to retrieve her fellow Imperial Knight Treis Sinde, who was working with the Mon Calamari Rangers against the Sith-Imperial forces on Dac. Dan, who was interested in meeting Sinde, asked Dare if he could accompany her. She objected, but her conviction was overridden by Stazi.\nDuring the journey to Dac, Dare repeated to Dan the plan to meet with Sinde on five separate occasions. The two dressed as Imperial Intelligence officers in order to blend in with the local Imperials. As their shuttle was approaching Dac, Dan was given instructions by Dare yet again, and he reminded her that he was already aware of the plan. After disembarking in New Coral City, Dare used the Force to persuade an Imperial officer that she and Dan were never officially on Dac. When Dan and Dare met with Sinde and Tanquar, a Mon Calamari Captain, Sinde informed Dare that he would not be returning with her to Bastion, Emperor Fel's stronghold.\nAfter a brief argument, Dare and Sinde attacked each other. Dan ignited his lightsaber and crossed blades with the Imperial Knights, stating that it was wrong for them to fight. This prompted both Sinde and Dare to attack Dan, who felt it was better for the Imperials to fight him. Dan Force-pushed Dare away from him and asked if he could suggest an alternative to their solution, but Dare continued attacking the Jedi. During the skirmish, Dan told Sinde that he agreed with Dare about him returning to Bastion, stating that if Sinde truly felt that the Imperial Knights were losing their focus, the Force needed Sinde to return to instruct the Imperial Knights. The Jedi Master blocked Dare's attack while Force-pushing Sinde and gained the upper hand by pushing the Imperials into each other. After deactivating his lightsaber, Dan volunteered to take Sinde's place with the Mon Calamari Rangers, and Sinde agreed with Dan. Dan then bid farewell to both Sinde and Dare and left with Tanquar to help the Mon Calamari Rangers.\nA short time later, the Sith Lord Darth Wyyrlok, who had become the ruler of the Empire, ordered the execution of the Final Protocol. The Sith scientist Vul Isen infected Dac's oceans with Viral spores that would eliminate all life on the planet within seven days. Three days after the Final Protocol's execution, the Galactic Alliance starfighter squadron known as Rogue Squadron discovered that millions of beings had died, prompting Admiral Stazi to initiate a massive evacuation of the planet. Dan joined the Mon Calamari Rangers in their takeover of the city Heurkea's docks, which served as base for the evacuation efforts. The Galactic Alliance fleet and a number of civilian volunteers managed to evacuate approximately twenty percent of the planet's population. As the last available shuttle prepared to depart, Dan convinced Tanquar that as a figure of leadership, he had the responsibility to survive, and the two then departed Dac aboard the shuttle.\nThe male Togruta Asaak Dan wore a set of brown Jedi robes and used a lightsaber containing a blue crystal. He was trusted enough by the Jedi Council to be one of four Jedi sent to discuss the possibility of fighting alongside the Galactic Alliance Remnant and the Empire-in-exile against the Sith-Imperials. Dan was fascinated by the prospect of meeting Imperial Knight Treis Sinde, who had been working with the Mon Calamari Rangers against the Sith on Dac. This led Dan to ask Imperial Knight Sigel Dare if he could join her on her mission to retrieve Sinde from Dac.\nAs their shuttle approached the planet, Dare began to inform him of their plan to get Sinde out of Dac quickly, but Dan pointed out to Dare that he was aware of the plan, since she had gone over it five times previously. After she retorted, Dan apologized to her, and stated that he was enjoying her company. Later, when Dare used a mind trick on an Imperial officer, Dan mocked her usage of the Force, stating that the Imperial mindset invited mind control. When Sinde and Dare got into an argument and attacked each other, Dan crossed his lightsaber with theirs in order to prevent them from fighting each other. He willingly volunteered to take Sinde's place among the Mon Calamari Rangers.\nAsaak Dan was skilled at using a lightsaber during combat, and was capable of fending off two fully trained Imperial Knights. After he left to assist the Mon Calamari Rangers, Sigel Dare told Treis Sinde that Dan's skills were impressive. Dan utilized abilities with telekinetic Force powers; he employed these skills against both Sinde and Dare.\nAsaak Dan was created by John Ostrander, the writer of the Star Wars: Legacy comic series. He first appeared on the cover for the second issue of the The Hidden Temple story arc. Dan was drawn by Omar Francia for the cover of Legacy 26: The Hidden Temple, Part 2. He was first identified and featured more prominently in the standalone comic Divided Loyalties, the series' forty-second issue. The character was drawn by Dave Ross in Divided Loyalties, and Dan later received an appearance in The Fate of Dac, the series' forty-seventh issue. In that issue, Dan was penciled by Jan Duursema.\nBecause of a surplus of characters in The Hidden Temple story arc, Dan, Corso, Dun'La, and Drok were not used in the comic itself. Dan and the other three Jedi were originally supposed to accompany Cade Skywalker in his assassination mission of Darth Krayt, against the wishes of the Jedi Council.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Togruta/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Mon_Calamari_Rangers",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Hidden_Temple_(Sith%E2%80%93Imperial_War)",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/137_ABY",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/Assassin/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Empire-in-exile",
  "/wiki/Jedi/Legends",
  "/wiki/Sayar_Dun%27La",
  "/wiki/Te_Corso",
  "/wiki/Drok",
  "/wiki/Admiral/Legends",
  "/wiki/Gar_Stazi",
  "/wiki/Flagship/Legends",
  "/wiki/Alliance_(Imperious-class)",
  "/wiki/Imperial_Knight",
  "/wiki/Sigel_Dare",
  "/wiki/Treis_Sinde",
  "/wiki/Planet/Legends",
  "/wiki/Dac",
  "/wiki/Sith/Legends",
  "/wiki/Incident_on_Dac",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Wyyrlok_(III)",
  "/wiki/Final_Protocol",
  "/wiki/Water/Legends",
  "/wiki/Viral_spore",
  "/wiki/Standard_week/Legends",
  "/wiki/City/Legends",
  "/wiki/Heurkea_Floating_City",
  "/wiki/Galactic_Alliance_Core_Fleet",
  "/wiki/Evacuation_of_Dac",
  "/wiki/Shuttle/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Tanquar",
  "/wiki/Taivas",
  "/wiki/One_Sith",
  "/wiki/Massacre_at_Ossus",
  "/wiki/Ossus/Legends",
  "/wiki/130_ABY",
  "/wiki/Padawan/Legends",
  "/wiki/Death/Legends",
  "/wiki/Kol_Skywalker",
  "/wiki/Battle_on_Had_Abbadon",
  "/wiki/Starship/Legends",
  "/wiki/X-83_TwinTail_starfighter",
  "/wiki/Officer/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/New_Coral_City/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Bastion/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Vul_Isen",
  "/wiki/Starfighter/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Emergency_evac_fleet",
  "/wiki/Brown",
  "/wiki/Jedi_apparel",
  "/wiki/Blue",
  "/wiki/Lightsaber_crystal",
  "/wiki/Force_power/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_26",
  "/wiki/Star_Wars:_Legacy:_The_Hidden_Temple",
  "/wiki/Omar_Francia",
  "/wiki/Legacy_(2006)_42",
  "/wiki/Dave_Ross",
  "/wiki/Legacy_(2006)_47",
  "/wiki/Jan_Duursema",
  "/wiki/Category:Images_of_Asaak_Dan",
  "/wiki/Legacy_(2006)_43",
  "/wiki/Jedi_Council_Forums",
  "/wiki/July_23",
  "/wiki/2008",
  "/wiki/March_25",
  "/wiki/2013"
 ]
}