{
 "name": "Asajj_Ventress",
 "display_name": "Asajj Ventress",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    },
    {
     "name": "Born",
     "values": [
      "50 BBY",
      "Dathomir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Christophsis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.79 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "later silver-blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Ice-blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Bone-white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Mother Talzin's clan"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Sith",
      "Confederacy of Independent Systems",
      "Nightsisters",
      "Krayt's Claw"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Ky Narec",
      "Dooku"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Quinlan Vos"
     ]
    }
   ]
  }
 ],
 "content": "Asajj Ventress was a Dathomirian female who was, at various points throughout her life, a slave, a Jedi Padawan, an assassin of the Sith, a Nightsister and a bounty hunter. In the final decades of the Galactic Republic's reign, Ventress was born into a clan of Force-sensitive Nightsister witches led by Mother Talzin on the planet Dathomir. Early in her life, her coven was forced to surrender Ventress to the criminal Hal'Sted, who spirited Ventress away from her sisters to the war-torn world of Rattatak where she was raised as a slave in his service. She was orphaned when her master was killed by Weequay pirates, but was later discovered by the Jedi Knight Ky Narec, who was stranded on Rattatak and waging a battle against the pirate marauders.\nNarec raised Ventress and taught her to use the Force in the ways of the Jedi Order, and together they protected the populace of Rattatak and fought back against the predatory attacks of pirates and warlords. After a decade of helping the local population, Ventress was orphaned once more when Narec was killed by pirates seeking to end the Jedi's crusade on their world. Enraged by the loss and bereft of guidance, Ventress embraced the dark side of the Force, deposing the local warlords and ruling in their stead. She was ultimately captured while attempting to assassinate the warlord Osika Kirske, who forced her to fight as a gladiator in his arena. She was eventually discovered by the Sith Lord Count Dooku and fell under his guidance and tutelage as a Dark Acolyte and aspiring apprentice.\nWhen the pan-galactic Clone Wars erupted between the Galactic Republic and Dooku's Confederacy of Independent Systems, Ventress became a commander in her Master's Separatist droid military and an assassin in the employ of the Sith. Her exploits brought her into conflict with the Jedi Order and she became renowned for her skill and cruelty as she waged war against the Republic. She frequently crossed lightsabers with Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker, heroes of the Republic who were often assigned to counter Ventress's efforts. Although she was highly talented and saw success in the kidnapping of Rotta the Hutt, the rescue of Nute Gunray, and the infiltration of the Republic fortress world of Kamino, Ventress was repeatedly forced to compete for her Master's favor against Confederate military leader General Grievous.\nAs the war progressed, Dooku's own master, Darth Sidious, became increasingly wary of Ventress's growing strength in the Force and ultimately ordered the Confederate leader to eliminate his apprentice in a show of loyalty. Dooku complied, and during the Battle of Sullust, betrayed Ventress and ordered her own forces to execute her. Left for dead, Ventress survived and clawed her way back to her homeworld of Dathomir to seek refuge and revenge. Mother Talzin and her coven welcomed Ventress back to their sisterhood and together they conspired to kill Dooku. After a failed attempt to assassinate the count, Ventress and Talzin moved to install a pawn of their own close to Dooku as his new assassin and apprentice.\nTo that end, Ventress selected the Zabrak Nightbrother Savage Opress to be gifted to Dooku and eventually to aid her in his murder. This plan also went awry after Opress betrayed both Ventress and Dooku and nearly killed them both. Resolving to make a new life for herself, Ventress returned to Dathomir to formally rejoin her clan and forgo further plans for revenge, but Dooku would not have it. The count targeted the Nightsisters for harboring his former apprentice and dispatched Grievous and his droid army to massacre the Dathomirian witches. Mother Talzin and Ventress were among the few survivors of the slaughter and were forced to separately flee Dathomir to escape Dooku's wrath.\nVentress was deeply hurt by the loss of her newfound family and so took to wandering the galaxy in search of a purpose, ultimately turning to bounty hunting, and finding a good measure of success in the business. This work forced her to adopt a series of unexpected alliances—she rescued Obi-Wan Kenobi from the clutches of the former Sith Lord Maul and Savage Opress, who had recently apprenticed himself to his renegade Sith brother—and worked alongside Skywalker's apprentice, Ahsoka Tano, when Tano was falsely accused of bombing the Jedi Temple.\nNear the end of the Clone Wars, she encountered Quinlan Vos, a Jedi Master tasked with assassinating Count Dooku to end the war. Vos partnered with Ventress under the guise of a fellow bounty hunter but ultimately revealed his identity and purpose after the two fell in love. Ventress trained Vos in Nightsister culture and dark-side skills to prepare for a strike against Dooku, but their attempt to kill the count failed, and she was forced to flee while he was taken into Confederate custody. She eventually worked with Kenobi and Skywalker to rescue Vos, but months of torture at Dooku's hand had turned him to the dark side.\nAlthough Ventress sensed his fall, Vos refused to believe his own darkness and was again sent to kill Dooku by the Jedi Council. She joined him on this final mission, but it was met with failure when Vos gave himself fully to the dark side. Ventress reluctantly helped Vos and Dooku in fleeing from Jedi pursuit but refused to embrace the dark side once more. Instead, she sacrificed herself when Dooku attempted to kill Vos with Force lightning by absorbing the blast to protect her lover. Her death finally motivated Vos to renounce the dark side, and she was honored for her sacrifice by the Jedi Council. Ventress' body was later laid to rest in the waters of her clan's village on Dathomir.\nIn 50 BBY, the Dathomirian female Asajj Ventress was born on the planet Dathomir in the latter years of the Galactic Republic's reign as the preeminent governing body in the galaxy. Dathomir, which was outside of Republic territory, was ruled by the Nightsisters, a clan of witches that used the Force in the form of Magick to manipulate nature around them and control their male counterparts, the Nightbrothers. Ventress's mother belonged to the coven under the leadership of Mother Talzin, a powerful spellcaster and former associate of the Sith Order. While Ventress was still an infant, Talzin's clan came under a threat associated with the Siniteen criminal Hal'Sted. In order to ensure her people's safety, Talzin arranged for Ventress's mother to surrender the young girl to Hal'Sted, who took her away from Dathomir as a slave. The Siniteen ferried his new possession to the war-torn world of Rattatak, where Ventress lived with him for several years and appreciated his surprising kindness as a master. In reality, however, he was trying to turn her into a living weapon.\nHer new homeworld was a violent land, ruled by warlords and wracked by repeated raids from Weequay pirate bands. When Ventress was six years old, in 44 BBY, Hal'Sted was killed during a pirate uprising, leaving Ventress—still a young child—orphaned during the attack. She discovered her master's body and grieved over her loss, but became distracted by the arrival of Ky Narec, a Jedi Knight who had been stranded on Rattatak and resolved to combat the pirate menace. When he too was attacked by a Weequay, Ventress called upon previously untapped Force power to throw the pirate into the air and across several homes. Recognizing her potential in the Force, Narec took the child into his care and made her his Jedi Padawan. Unknown to her at the time, Narec had been the one who killed Hal'Sted, not the pirates.\nFor twenty-one years, Narec trained the young Dathomirian in the ways of the Jedi Order. Together they worked to protect the people of Rattatak from the pirates and warlords that preyed on them, becoming heroes to many and enemies of those who would visit violence on the local people. Narec tutored his apprentice in lightsaber combat and the use of the Force, and although she was very skilled, Ventress was ultimately unable to avoid being orphaned once more. While the two were battling yet more Weequay pirates, Narec was shot in the back and killed. The loss devastated Ventress, and she took up her fallen Master's lightsaber and killed Narec's assailants. Bereft of guidance and with only an introductory training of the power of the Force, the young Dathomirian embraced the dark side and waged a war of vengeance against the pirates and warlords that controlled Rattatak.\nShe ultimately deposed all of the planet's warmongers and ruled in their place, claiming the world as her own. However, when she attempted to assassinate a remaining warlord—a Vollick named Osika Kirske, who had ordered the death of her master—she failed. She was captured and forced to fight as a gladiator in his arena with a stun collar around her neck. Her power in the dark side eventually attracted the attention of an offworlder—the Serenno noble Count Dooku. Dooku was himself a former member of the Jedi Order who had abandoned his brethren to join the Sith Order as Darth Tyranus, a Dark Lord under the command of his Master, Darth Sidious. The ambitious count plotted to find a Sith apprentice with whom he could overthrow Sidious and claim the mantle of Master, and so recruited Ventress to his side as a student and Sith assassin after he killed Kirske. She still blamed the Jedi for abandoning Narec on Rattatak, so she joined Dooku to eagerly kill Jedi and embrace the power offered by the Sith.\nVentress was also considered a Dark Jedi. Dooku gifted her a pair of curved lightsabers that had once belonged to one of his previous disciples. At one point Ventress was chained by the wrists and suspended above a vat of hot, bubbling red substance. She managed to break her chains, land safely on the ground, and summon one of her lightsabers from a box where a group of red-robed individuals kept it.\nIn 23 BBY, after meeting the count on Rattatak, Ventress pledged herself to Dooku at his palace on Serenno, agreeing to serve at his side in exchange for teachings in the ways of the dark side of the Force. He was impressed with her strength in the Force and educated her in new and brutal lightsaber combat methods. She adopted the use of twin red-bladed lightsabers, for which she became renowned. An additional responsibility of her apprenticeship to the Sith Lord was to serve as a commander in the newly established Confederacy of Independent Systems, Dooku's anti-Republic separatist rebellion movement. During her time under Dooku, Ventress also held the title of Dark Acolyte.\nAround 23 BBY, Dooku tasked Ventress to locate his sister, Jenza. For her to find Jenza, she looked through datapads and Dooku's journal, and learned how Dooku was before he left the Jedi Order. She finds out that she had been kidnapped and would be tracking Glute, a Crolute criminal who was hired by Raz Fellidrone. Before Ventress could get information from Glute, a sudden blaster bolt was fired into Glute's head, shot by a Republic Intelligence officer, Raz Fellidrone. He tortured Jenza to try to get information out of her to help the Galactic Republic. Ventress caught up with him and stabbed him through his chest with her lightsaber. Dooku really intended for Jenza to be killed, for the information she held, as Ventress was later ordered. She then said \"I'm sorry\" as she buried her lightsaber into Jenza's chest.\nAs a high-ranking officer in the Separatist military, Ventress then fought for the Confederacy on the battlefields of the galaxy-spanning Clone Wars after its beginning. Her brutality and ruthlessness in battle against the clone armies of the Republic and Jedi Order garnered her a fearsome reputation. Early in the war, she fought on the front lines of a major battle against the Republic forces under the command of Jedi Master Tholme. The Confederacy had broadly won the contest, but in a final large skirmish, Ventress engaged Tholme in personal combat and quickly overwhelmed the Jedi, disarming him and forcing a surrender. Ignoring Dooku's command that she spare Tholme's life, the Dark Acolyte claimed victory by executing him on the battlefield. She later delivered the Jedi Master's lightsaber to the count as a trophy.\nVentress also became familiar with two Jedi adversaries early in the war—the human Generals Obi-Wan Kenobi and Anakin Skywalker. First meeting them during the mission to Cato Neimoidia, the two were considered some of the Republic's greatest heroes and Ventress came to savor opportunities to trade verbal barbs with Kenobi and saber strikes with Skywalker. Her actions during the war constituted war crimes according to Republic law, and she became a wanted figure by both the Galactic Senate and the Jedi Order.\nShortly into the war, the Confederacy moved to seize control of major hyperspace routes to separate the Republic's Core Worlds from the bulk of its forces in the Outer Rim Territories. Dooku and Sidious, eager to exploit their advantage and weaken the Jedi's position, hatched a plot to turn Jabba the Hutt, leader of the Grand Hutt Council and the crime families of the Hutt Clan, against the Jedi and the Republic. The first objective of the scheme was to ensure the Jedi were embroiled in long, drawn-out campaigns in the Outer Rim and unable to combat the ostensibly everyday injustices that were once their focus. Ventress led one such effort on Christophsis, a resource-rich crystalline planet allied with the Republic. With Separatist military leaders General Whorm Loathsom and Admiral Trench at her side, she led her battle droid forces in an invasion of the world, attacking the local population and laying waste to a major city. The humanitarian crisis prompted the Republic's Senator Bail Organa to launch relief effort for Christophsis's people, but he too came under assault from the Confederacy.\nTrench's blockade of Christophsis was eventually broken by a fleet led by Generals Kenobi and Skywalker, who launched a counter-campaign on the surface to beat back the Separatist armies. To confound their efforts, Ventress bribed the clone trooper Sergeant Slick, promising him wealth and freedom from servitude in exchange for divulging Republic movements and strategy on the planet. His information was fruitful and resulted in many losses for the Jedi-led task force. The existence of a security breach was realized by the generals and their lieutenants after finding classified intelligence in the memory of the captured T-series tactical droid TJ-55. Slick learned of their discovery and informed Ventress that the Jedi were heading behind enemy lines to search for information on the breach; he meanwhile went into hiding at the Republic base while arranging to sabotage its munitions depot.\nVentress ordered her forces to stand down and allow the Jedi to infiltrate the Confederate headquarters, which occupied a large tower in the central city. To distract the Jedi while Slick sabotaged their base and a massive army of droid reinforcements landed on Christophsis, she confronted Kenobi and Skywalker in the upper floors of the tower and engaged them in an aggressive lightsaber duel. She taunted the two about the existence of her informant before fleeing into an adjacent room where she used the Force to hurl numerous books and rubble at her opponents. The Jedi telekinetically turned the attack against her, pelting Ventress with the projectiles and apparently forcing a surrender. Confident that her forces were in position and that Slick had done his duty, she deactivated her weapons and sat on the floor. As Kenobi and Skywalker approached, she reactivated her blades into the floor, opening a hole that Skywalker and Kenobi fell into. She mocked the two before bursting out of a window and fleeing through to perch atop an octuptarra tri-droid that was scaling the tower. Before her, numerous C-9979 landing craft were delivering her invasion force into the city. The pursuing Jedi were shocked by the Separatist reinforcements but still managed to escape after severing the legs of Ventress's octuptarra droid.\nVentress left the remainder of the battle in the hands of General Loathsom, who was ordered to march on the city and keep the Jedi occupied while she executed the next part of her Masters' plan: the kidnapping of Rotta, son of Jabba the Hutt. Ventress traveled to Jabba's throneworld of Tatooine in a Trident-class assault ship and hunted down the young Huttlet. She ambushed Rotta's sail barge and its escort skiffs in the desert, destroying one of the skiffs before abducting the barge. With Rotta in tow, she fled to the abandoned B'omarr Order Monastery on Teth in Wild Space, far from the front lines of the war. News of Rotta's kidnapping at the hands of \"renegades\" spread quickly as Jabba hired bounty hunters to retrieve his kin and reached out to the Republic Senate and Jedi Council for aid in exchange for clear passage through Hutt Space. On Teth, Ventress locked Rotta in the monastery dungeons before contacting Count Dooku and Lord Sidious, who praised her work. Dooku asked Ventress to guard the child but allow the inevitable Republic rescue force to find and seize him; the count required footage of the Jedi with the Huttlet to deceive Jabba into believing that the Jedi were behind the kidnapping.\nThe monastery was first discovered by Jabba's bounty hunters, but Ventress defeated and decapitated every one of them, sending their heads back to the Hutt in mockery. Republic reconnaissance forces had also discovered the location of Rotta's prison, but took longer to mobilize a rescue mission because the only available Jedi were Skywalker and Kenobi, who were still occupied with General Loathsom on Christophsis. They ultimately won that battle and Skywalker and his new Padawan, the Togruta Ahsoka Tano, were sent to Teth to find and recover Rotta. Ventress arranged for a small droid force to defend the monastery landing platform, preventing the Republic from landing there directly and instead forcing the enemy into a costly battle to scale the mesa on which the monastery was built. Skywalker, Tano, and their forces succeeded in reaching the summit, at which point Ventress sent the protocol droid 4-A7 to guide them into the dungeons.\nShe meanwhile contacted Dooku to update her progress. Although she insisted that she could kill both the Master and Padawan at that moment, the count cautioned patience and promised an opportunity to hunt the Jedi once she had record of them with the Huttlet. Once they retrieved Rotta and brought him back to the monastery courtyard, Skywalker and Tano discovered he was sick, and so put him into a backpack for transport to their cruiser. This was the footage that Ventress and 4-A7 collected—a recording of the Jedi manhandling the child while Skywalker discussed his general distaste for Hutts. The data was sent to Dooku on Tatooine, who instructed his apprentice that she was now to recover the Huttlet and return him to Jabba. The goal to cast the Jedi as treacherous enemies of the Hutt clan and the Confederacy as an ally to Jabba and his family was successful, and Jabba agreed to join the Confederacy if Ventress returned his son unharmed.\nTo ensure success, she was reinforced with two landing craft carrying hundreds of droids and squadrons of Vulture-class droid starfighters. At her command, the army attacked the small Republic unit occupying the monastery and forced the Jedi and clones to retreat into the structure and seal themselves in. Although Ventress believed them to be trapped, Skywalker and Tano discovered a secondary landing platform while the droids struggled with getting through the monastery's sealed outer blast door. The dark-side apprentice quickly lost her patience and simply cut through the controls, releasing the lock and opening the doors to the main entrance hall.\nThe Jedi had already fled deeper into the monastery, but their clone troopers remained behind to delay the Separatists forces for as long as possible. After a short battle only a few clones lived; Captain CT-7567, also known as \"Rex,\" attempted to kill Ventress but managed only to destroy a command droid. The Dathomirian deflected all of his blaster bolts and seized his windpipe in a telekinetic Force grip, lifting the captain into the air and demanding to know Skywalker's whereabouts. Rex refused to divulge the general's location, so Ventress dropped him to the floor and used Force mind-control techniques to make him contact Skywalker and give the all-clear, unaware of how Rex was managing to resist the mind trick and warn Skywalker by using his first name.\nWhile she continued the search for the Jedi in the monastery, Ventress was informed by her droids that Republic reinforcements had arrived. Recognizing the need to accelerate her plans, she ordered her fighters and droids to engage the new Republic forces and buy her enough time to complete the mission. She soon discovered the Jedi attempting to flee from a rear landing pad, but their astromech droid R2-D2 sealed a blast door in front of her, halting her advance. Ventress began cutting through the barrier while dwarf spider droids climbing the mesa below hammered the exterior platform with blaster fire. By the time she made it outside, Skywalker was nowhere to be found; Ventress and the new Padawan Tano engaged in a brief duel, but the Dathomirian easily overpowered the Togruta and threw her to the ground. Upon demanding to know where Skywalker had run to, the dark-side apprentice was attacked by the Jedi General and a giant insectoid can-cell he had taken as a mount. The beast threw Ventress back towards the monastery just as the spider droid's sustained fire caused the platform to break apart and fall from the cliffside. Skywalker and Tano escaped the mesa on the can-cell's back, leaving Ventress with a B1-series battle droid that informed her Dooku was demanding an update. In a rage, she threw the droid off the mesa before contacting the Sith Lord.\nShe was met with disappointment and veiled threats from her Master, who was still on Tatooine attempting to parley with Jabba. While Dooku reminded her of the stakes of their conspiracy, she was distracted by the arrival of Obi-Wan Kenobi, who was leading the Republic reinforcements. Ventress retreated into an antechamber in the monastery, luring Kenobi into a one-on-one battle in the darkness. Although she lurked in the upper reaches of the monastery for a time, Kenobi's prodding and taunting eventually drew her down to engage the Jedi on a level field. The duel saw both combatants enjoy the advantage for a time, but ultimately Kenobi found command of the conflict when he led the dark-side apprentice to a catwalk outside the monastery. It was there that they both sensed through the Force that Skywalker and Tano had escaped Teth with the Huttlet, signifying her mission's failure. Although she attempted to continue the attack, Ventress was disarmed of one of her lightsabers and forced to retreat aboard a Vulture-class droid starfighter.\nIn failure, Ventress was forced to contact Dooku and explain to him and Jabba the Hutt that Skywalker had killed Rotta before she could intervene. Although Dooku had hoped she at least managed to kill the Jedi after losing control of the Huttlet, she admitted that Skywalker had escaped and was now on his way to Tatooine—ostensibly to kill Jabba, but in reality to return the crime lord's son. Dooku endeavored to kill the Jedi himself, but was also foiled in his attempts to intercept the Huttlet. Ultimately, Skywalker and Tano managed to deliver Rotta back to Jabba's Palace, convincing the elder Hutt that Dooku and the Confederacy had been deceiving him. The debacle resulted in the Republic and Hutt clan establishing a treaty of cooperation, a significant setback for the Separatist cause.\nEarly in the war, after the outbreak of the Battle of Ryloth, Dooku's spies learned that the Republic sought to establish an agreement with the Toydarian people that would allow the building of a supply depot in their territory. The Toydarians, previously neutral in the conflict, agreed to engage in secret negotiations on the neutral moon of Rugosa between Jedi Grand Master Yoda and King Katuunko of Toydaria. With this information, Dooku sent Ventress to Rugosa with a significant military detachment to convince Katuunko that the Toydarians should join the Confederacy of Independent Systems instead of the Republic. The apprentice arrived on Rugosa before either the Jedi or the king to jam communications and positioned two Munificent-class star frigates not far from the moon. She confronted Katuunko upon his arrival to the meeting location, and although he was wary of her presence, Ventress assured him that she was there merely as a messenger for Count Dooku. While the count explained the intrusion to the king via holographic transmission, the two Munificent-class frigates jumped into the star system and engaged the recently arrived Republic frigate that was ferrying Yoda to the moon. The Confederate warships quickly overwhelmed the Jedi Master's, but he was able to make it to the surface with three clone troopers aboard an escape pod.\nWhen the Republic frigate fled the system, Ventress insisted to Katuunko that it was a clear sign of the Jedi's inferiority; however, he did not yet believe her and was relieved when Yoda contacted him from the escape pod's crash site. The Toydarian had been eager to do business with the Grand Master and was clearly displeased with Ventress's intrusion, but the dark-side apprentice piqued his interest with an offer to perform a show of force: she suggested that she could prove the Confederacy's superiority by sending her forces to capture the Jedi Master. If Yoda were to escape her grip and arrive at the rendezvous by nightfall, the king could consider himself free to join the Republic; if not, she expected him to consider an alliance with the Separatists. Although the king found the idea of pushing his guest into a test of battle distasteful, Yoda accepted the terms, and Ventress agreed to give the diminutive Jedi a fair fight.\nHowever, a fair fight was never her plan. After contacting Dooku, Ventress oversaw the deployment of a full battalion consisting of B1 battle droids, B2-series super battle droids, and Armored Assault Tanks and tasked her droid commander, 224, with hunting down and killing Yoda and his retinue. Ventress remained alongside King Katuunko as they monitored the Jedi's progress through Rugosa's coral forests. 224 regularly updated the Dathomirian on the droids' progress, eventually reporting that their forces had engaged the Yoda and forced him into retreat. Katuunko was clearly rooting for the Jedi and contacted Yoda to confirm his survival, but Ventress seized his communicator from him and crushed it with her bare hands, vowing to win the contest. 224 contacted her again later in the day, claiming that the Jedi had been found by the Confederate forces and was simply sitting in the wilderness before a column of droids and assault tanks. Ventress insisted that they kill the Jedi immediately, but Yoda managed to destroy all of the tanks and droids, creating a scene of smoke and destruction visible from the rendezvous point. The apprentice attempted once more to contact 224, but was informed by another droid that her commander had been destroyed by Yoda. Katuunko took this as a sign of victory, but Ventress refused to surrender and dispatched a large group of droidekas to finish the job.\nEven without knowing the outcome of the contest, Katuunko made his decision and contacted Dooku to reject his offer, claiming that Ventress ignored the terms of their deal and refused to give Yoda a fair fight. The count would not allow Toydaria to fall to the Republic, so ordered his apprentice to kill the king and make way for a pro-Separatist monarch. She nearly succeeded in the task, but her lightsaber blades were halted mid-strike by Master Yoda's telekinetic intervention. The Jedi threw Ventress back and taunted her Force prowess, seizing her lightsabers from her and suggesting surrender. Yoda allowed her to take her weapons back, but Ventress refused surrender and instead detonated bombs she had planted near Katuunko's starship on the ridge above. The explosion and falling rubble distracted the Jedi and his clones, giving the dark-side apprentice an opportunity to escape aboard her Punworcca 116-class interstellar sloop. Dooku was disappointed in his assassin and developed a grudge against Katuunko in light of the mission's failure.\nIn spite of her public failures at Teth and Rugosa, Dooku continued to call upon Ventress in the early days of the Clone Wars for delicate and imperative missions. The count and his military commander, the cyborg General Grievous, placed the capture of the planet Kamino as one of their highest priorities during this time. Kamino was the site of the Republic's cloning facilities, where clone troopers were churned out at accelerated rates to join the fight against the Confederacy. In an early attempt to destroy the cloning resources, Dooku and Grievous plotted to invade the world by way of the Rishi system. Because Republic space was monitored by an interconnected network of listening posts, Grievous's fleet was unable to travel directly to the Kamino system lest the Republic be warned of the incoming attack by the station on the moon of Rishi.\nWhile the general oversaw a plan to disable the listening post, Ventress was dispatched to Kamino alone to engage in espionage and prepare for the arrival of the Separatist fleet. Her efforts were successful and she contacted Grievous to inform him of her readiness, but his plans had yet to see fruition; his fleet was still hiding from Republic detection while he waited for his forces to take the Rishi station. Ultimately Ventress's efforts were for naught, as a small force of clones repelled Grievous's droids and alerted their command to the presence of the Confederate fleet. Grievous was forced to abandon the mission and Ventress escaped Kamino without the invasion having commenced.\nSometime afterwards, following the destruction of the Confederate listening post Skytop Station, Darth Sidious and Count Dooku faced a crisis when Nute Gunray, Viceroy of the Trade Federation and a leading member of the Separatist Council, was taken into custody on Rodia while attempting to kill Republic Senator Padmé Amidala. Gunray was a long-time co-conspirator to the Sith and had knowledge of Dooku's machinations and Sidious's involvement in the war. Recognizing the damage the Neimoidian could do if he divulged his secrets under Jedi interrogation, Sidious ordered that Dooku see to it that Gunray be saved or silenced. To that end, Dooku assigned Ventress the task of traveling to Rodia with a contingent of battle droids to intercept and infiltrate the Tranquility, the Venator-class Star Destroyer that was transporting the viceroy back to the Republic capital world of Coruscant. She would be assisted in her mission by Captain Faro Argyus, a Republic Senate Commando who had covertly turned traitor and was now in service to the count. Argyus was in charge of the viceroy's Senate security detail on the Tranquility and arranged an intricate extraction plan with Ventress prior to her arrival.\nAfter meeting with her Master on his Munificent-class frigate, Ventress set off for Rodia in one of several Droch-class boarding ships dispatched to the planet alongside Vulture droid starfighters. The vessels ambushed the Star Destroyer before it could leave the system and aimed directly at the Tranquility, slamming into the hull and penetrating the Venator's main hangar to disgorge dozens of super battle droids. After the droids wiped out the first wave of clone defenders and moved onto other regions of the ship, Ventress leaped out of her vessel and beheaded the last remaining clone trooper before he could warn his commanders of her presence. She pilfered his gauntlet-mounted comlink so she could listen in on Republic chatter and proceeded to cut her way into the Tranquility's ventilation ducts and navigate towards the Star Destroyer's engine room. Within, she evaded the notice of the maintenance droid 327-T while stealthily planting time-delayed thermal detonators throughout the room. Avoiding capture by patrolling clone troopers, Ventress slipped back into the ventilation shafts and made her way to the detention center, where Gunray was being held.\nAs the battle droids were cut down and their invasion of the Tranquility defeated, Ventress found the detention center and cut her way into its control room from the ceiling above. The assassin quickly dispatched two Senate Commandos before being confronted by Ahsoka Tano, Skywalker's Padawan who had been assigned to guard Gunray. The two briefly dueled and Tano was ostensibly aided by Captain Argyus, who shot at Ventress to maintain their ruse. Nevertheless, Ventress easily overcame them both and released Gunray from his detention cell before luring Tano into the cell herself. Gunray sealed the Padawan behind the prison's energy shield, but his freedom was short-lived; Jedi Master Luminara Unduli, who was overseeing the prisoner transfer, returned from battling the droids with Clone Commander CC-1004 and engaged Ventress.\nUsing the Force, Unduli released Tano from her prison and together the two Jedi attacked Ventress, who appeared to quickly surrender. However, the surrender was also a ruse, as at that exact moment, the timed detonators that the assassin had planted in the engine room blew, crippling the ship and throwing the crew and combatants into chaos. Ventress used the opportunity to throw Unduli to the ground and leap over her, escaping past the Jedi Master and her troops into a now-malfunctioning turbolift. Plunging her lightsabers into the wall of the lift to control her descent, the assassin fled into the bowels of the ship in an attempt to lure Unduli. Along the way, she killed numerous clone troopers, leaving a trail of dead clones in her wake.\nThe scheme worked, and the Jedi Master tracked Ventress alone into the Tranquility's now-ruined and burning engine room. The Dathomirian ambushed Unduli and temporarily blinded the Jedi by slicing open an exposed pipe that immediately blasted gas into her opponent's face. Unduli's left eye was injured in the attack, but the two continued their duel throughout the upper levels of the room, with Ventress growing more enraged at the Jedi when she criticized the assassin for sloppy lightsaber combat discipline. After they both attempted to Force-push one another off the engine platforms, Ventress lunged at Unduli and kicked her in the face, disarming her and throwing the Jedi to the ground far below. Before descending to finish off her opponent, the Dathomirian leaped to the ceiling and severed several large pipes, sending them crashing down atop Unduli below. The Jedi Master was trapped beneath one of the pipes when Ventress reached her, but before the killing blow could be made, she was interrupted by Ahsoka Tano, who used the Force to throw her backwards into one of the severed pipes. Tano freed Unduli and returned her lightsaber in time for them both to defend against Ventress, who attacked them simultaneously.\nThe assassin showed her very formidable lightsaber skills by engaging the two Jedi. However, she again fled into the upper levels of the engine room after a short duel, this time to keep the Jedi occupied while she signaled to Argyus via the pilfered gauntlet that it was again time to free Gunray. While the Jedi searched for the assassin, believing her to be the only threat, Argyus killed his own commandos and released the Neimoidian, absconding with the viceroy to a docked Republic frigate. When CC-1004 contacted the Jedi to inform them of Argyus's betrayal, their rush back to the detention level was halted by Ventress, who used the Force to pelt them with pieces of piping and debris. She was able to combat both the Jedi but ultimately had to give ground until Argyus signaled to her that the mission had been completed.\nVentress then quickly fled the scene, leaping onto a reactor and into an overlooking ventilation duct and covering her final escape by lobbing a primed thermal detonator behind her at Tano as the Padawan gave chase. The Jedi were left behind as Ventress made her way to the Tranquility's escape pod bay. There, she attacked two clone troopers, easily dispatching them both by throwing them across the room with the force. With the two clones either dead or unconscious, she calmly walked into an escape pod, departing the crippled Star Destroyer. Her pod rendezvoused with Gunray and Argyus's stolen frigate a short distance from the Tranquility, where she found the Senate Captain boasting about his success and claiming credit for the mission. Seeing that he planned to downplay her role to Count Dooku, Ventress stabbed Argyus through the chest, killing her confidant before ferrying Viceroy Gunray to safety herself.\nFollowing this, Ventress was sent to the Halcyon Star Cruiser for a Lannik senator named Zast Tri'vak who wished to defect from the Republic. After arriving in her personal Ginivex-class fanblade starfighter, she infiltrated the ship and found Tri'vak in his cabin. Cutting a hole in the floor with her lightsabers, she began to escape with the senator until she was confronted by Skywalker and Amidala. Ventress dueled the Jedi until the four of them were stopped by a Hutt and a group of security guards. As Amidala explained the situation to the Hutt, Ventress remotely prepped her starfighter for departure. Tri'vak pleaded for his life and offered the Hutt Clan information on the Separatists. In response, Ventress stabbed the senator through the back before shattering a nearby window with her lightsabers and leaping out into space. Skywalker then sealed the breach with the Force while Ventress boarded her starfighter and flew away.\nAt some point later in the war, prior to the battles over the world of Felucia, Ventress participated in a clash between the Republic and Separatists on the planet Khorm. During that battle, Ventress came into contact with CC-3636, a clone trooper commander who served under Jedi General Plo Koon. The commander, informally known as \"Wolffe,\" was assaulted by Ventress and lost his right eye to her lightsabers, although both combatants survived the conflict.\nAs the war progressed, Dooku's Confederacy still faced staunch resistance from the Republic and its clone armies, prompting Separatist leadership to once again target the clone trooper production facilities on Kamino. The count assigned both Ventress and Grievous to oversee the theft of the clone genetic source material and the destruction of the Republic's clone training and housing complexes, although both of his subordinates sought to claim the victories for themselves. Thus, for the second time, Ventress traveled to the watery world in advance of Grievous's fleet and armies, now commanding a small insertion force of AQ-series battle droids aboard her submersible Trident-class assault craft. She and the cyborg general planned for the Confederate fleet to be engaged by the Republic blockade in orbit and intentionally take damage so the wreckage from downed Separatist vessels could ferry droid soldiers and components for additional Trident-craft to Ventress in the waters of the planet below.\nIn preparation for the assault, Ventress studied the Kaminoan capital of Tipoca City and determined the exact locations of the Clone DNA room and the clone barracks. On the eve of the attack she contacted Grievous from deep beneath the waves of the Kaminoan oceans to inform the general that she had completed her first phase of the operation and was in position to begin the attack. Unbeknownst to both Confederates, Grievous's transmissions to Ventress had been intercepted by Republic forces, drawing Skywalker, Kenobi, and the clone 501st Legion back to Kamino for its defense.\nGrievous's fleet arrived in orbit shortly thereafter and began the assault on the Republic blockade. The general pushed his attack against the greater force, all while deliberately sacrificing Munificent-class cruisers that, upon detonating under enemy fire, sent large chunks of debris down to Ventress in the waters outside Tipoca City. The dark-side apprentice quickly put her droids to work assembling the components that were attached to the debris and soon had a fleet of Trident-class drilling assault craft carrying an army of aqua droids. With the battle in space nearly won by the Republic, Ventress launched her assault. The Trident ships rose from the sea and clung to the stilted, domed structure of Tipoca City. While some disgorged droids onto landing platforms and bridges that connected the city, others drove their spiked drills directly into the city walls to deliver Separatist troops into hangars and other sensitive areas.\nWhile Grievous led the frontal assault, Ventress infiltrated Tipoca City on her own, leaving the aqua droids behind as she set out towards the DNA archive room. On the way she encountered the clone Advanced Recon Commando Colt making a desperate last stand against a droid squad led by Grievous. Ventress quickly ended the shootout when she seized Colt in a telekinetic Force choke and slammed him into a passage wall before impaling his body on one of her lightsabers. The display impressed Grievous, but Ventress rebuffed his praise and offers of reinforcement, instead insisting that she would retrieve the DNA on her own. Upon reaching the DNA store room, Ventress used the archive computer to withdraw the genetic material belonging to Jango Fett—the template organism used to create all of the Republic's clones—but was intercepted by Anakin Skywalker before she could abscond with her objective.\nThe Jedi Knight attempted to seize the DNA sample, but Ventress easily evaded his grasp and fled into the city passageways. The two dueled one another through the halls of Tipoca City, trading saber slashes until Ventress found an opportunity to flip Skywalker over her body with a kick. Now with an open route, she fled towards the city exterior with the Jedi in close pursuit but emerged to find that the Republic had disabled the last Trident assault craft and driven back the droid forces. As she sparred with Skywalker again, their duel attracted the attention of nearby clones who rushed to aid their general. Near the edge of the city, the Jedi gained the upper hand when he kicked Ventress off her feet and pulled the DNA container away from her with the Force, but the apprentice responded furiously, kicking Skywalker in the face and chest until he too was knocked down and dropped the DNA sample. As Ventress tried to pull it back into her hands with the Force, the container was intercepted midair by a clone trooper—one of many who had arrived to reinforce Skywalker. Now outnumbered and without her objective, Ventress asked if she was expected to surrender, but Skywalker implied that he would have her executed on the spot. At that moment she received a signal from Grievous, who was likewise fleeing a duel with a Jedi. As the general passed overhead in a stolen Kaminoan flight pod, Ventress dodged Republic fire and leaped up into the pod, in which the two of them would flee the planet.\nDespite the damage the battle did to Tipoca City and its cloning facilities, Ventress and Grievous's failure to either capture the Fett genetic material or destroy the clone barracks ensured that Kamino would continue to mass-produce soldiers for the Republic and its Jedi Generals. The Battle of Kamino also contributed to a growing list of engagements wherein Ventress failed to fulfill the orders of her Sith masters.\nAs the war dragged on Ventress continued her service to Dooku while steadily becoming more powerful in the dark side of the Force, a fact that came to greatly concern Dooku's Sith master, Darth Sidious. Shortly after the Republic approved an effort to enhance and expand its military capabilities, Ventress led a sizable Confederate battle group to the Sullust system, where she and the tactical droid TJ-912 directed their forces in a showdown against a Republic fleet led by Kenobi, Skywalker, and Admiral Wullf Yularen. Ventress's fleet, consisting of her Providence-class Dreadnought, Recusant-class light destroyers, and Munificent-class star frigates, launched a vicious attack against the Republic's forces over Sullust.\nMany Republic ships were overwhelmed by Vulture droids and Separatist tri-fighters, and Ventress herself joined the fray in her fanblade starfighter. The tri-fighters of Trident groups one and two followed the dark-side apprentice in an assault on Yularen's flagship, the Venator-class destroyer Resolute. Under her orders, Group One targeted the Resolute's starboard engines, and Group Two fired on the ship's port-side deflector shield generators; the coordinated assault allowed Ventress to navigate her starfighter through the Resolute's turbolaser defenses and blast the destroyer's port-side command bridge. The Resolute was crippled in the assault and was ultimately destroyed under Separatist fire, though Admiral Yularen managed to escape.\nAs Ventress pressed her attack, she and her droid squadrons located and intercepted Kenobi and Skywalker's Jedi starfighters. She quickly fired on Kenobi's ship, driving the two Jedi to diverge from one another to split their attackers' attention. While the tri-fighters followed after Skywalker's fighter, Ventress tailed Kenobi and continued to fire on his ship, gradually crippling its systems. After chasing the Jedi through the battle theater and around a Venator-class destroyer, Ventress nearly killed Kenobi but instead came under fire from Skywalker, who had managed to evade and destroy his tri-fighter pursuers. Ventress's Ginivex-class starfighter was badly damaged and she was forced to follow Kenobi into a crash landing in the hangar of her Providence-class Dreadnought.\nUnbeknownst to Ventress, Dooku had been confronted about his apprentice by Darth Sidious during the battle. Although her master attempted to assuage the Dark Lord's concern, Sidious was convinced that Ventress was being trained as a means to overthrow him and insisted that Dooku kill her. The count reluctantly complied and decided that Sullust would be where Ventress would meet her end. When Ventress contacted Dooku from within the cockpit of her downed fighter to request assistance, he rejected his apprentice and left her to die. Injured and with her reinforcements ordered to abandon the battle theater, Ventress emerged from her ship to face the Jedi alone. In a refusal to surrender, she dueled the two aggressively across the hangar.\nAlthough she managed to separate the Jedi for a moment, she was quickly overwhelmed and cornered against her own starfighter. In a burst of dark-side aggression, Ventress seized both in a Force choke but was interrupted when TJ-912—under orders from Count Dooku—opened fire on Ventress's command ship from the droid's Recusant-class destroyer. As the Providence dreadnought rocked under the assault, the battle in the hangar was thrown into chaos. Ventress was disarmed by the Jedi and nearly taken down when a damaged Hyena-class Droid Bomber performed a suicide run on the dreadnought hangar. The three combatants jumped away from the impact, and the Jedi decided to flee the doomed command vessel and leave Ventress to go down with the ship.\nAgain left for dead at the Battle of Sullust, Ventress scurried aboard her crippled starfighter and drove it along the hangar floor towards the airlock, escaping the Providence-class destroyer just as it detonated under continued fire. The explosion destroyed much of the remaining Confederate fleet and won the battle for the Republic, leaving behind only debris and an unconscious Asajj Ventress in the charred hull of her disabled Ginivex-class starfighter. TJ-912 reported to Dooku that scans showed no survivors, leaving the count and Lord Sidious convinced that the Dathomirian assassin had met her end.\nThe remains of Ventress's ship and her unconscious body were eventually discovered by a salvage ship, the Raider. The scavengers aboard, who had been picking through the debris field in the aftermath of the battle, took the Fanblade starfighter as a prize and pulled Ventress from the wreckage. The scavenger captain Ratch and his crew resuscitated the woman and began interrogating her about the battle at knifepoint, but the injured and betrayed Ventress refused to answer questions, instead demanding to be taken to Dathomir. When Ratch questioned her demands, she seized the Twi'lek captain and his three crewmen in a Force choke that killed them almost instantly. Knowing that the Confederacy was no longer her cause and the Republic was still her enemy, Ventress took command of the Raider and set course for her long-lost homeworld in the Mid Rim.\nVentress arrived at the sparsely populated planet and set the Raider down just outside of the Nightsister fortress-village. As she approached on foot she was surrounded by a cadre of witches who failed to recognize their sister and threatened her as an unwelcome stranger. The injured and exhausted Ventress was saved by the intervention of Mother Talzin, who knew the woman was the young Nightsister child she had given away decades prior. Ventress, overcome by her wounds, collapsed into Talzin's arms and was carried into the village by her sisters. Her body was placed on a stone slab while Talzin directed the Nightsisters to gather basins containing the Water of Life—a liquid ichor that was infused with the magick of Dathomir and aided in Nightsister rituals. The coven encircled Ventress with the Waters while Talzin led them in a shamanistic ritual intended to heal the assassin. During the ceremony, the dark magicks caused Ventress to experience vivid and painful visions of her past—her transfer to Hal'Sted and his eventual murder, her training under Ky Narec and his eventual murder, and ultimately her tutelage under Dooku and his attempted murder of Ventress herself. Her last vision of Dooku abandoning her at Sullust made Ventress realize what she needed most: revenge.\nVentress emerged from her unconscious state to find Talzin by her bedside. The Clan Mother had hoped Ventress would have returned to Dathomir sooner, but was prepared to aid her long-lost clanswoman nonetheless. Although Talzin was acquainted with Dooku and ostensibly on cordial terms, she hated the Sith Order and its adherents. Decades prior, she had been a confidant and aspiring student of Darth Sidious, but the Dark Lord ultimately betrayed the Nightsister shaman by abducting and indoctrinating her young son and leaving the witch to her fate on Dathomir. And so in Talzin, Ventress found a new mentor and ally in her vendetta against Dooku. The Clan Mother pledged Nightsisters Karis and Naa'leth—the coven's greatest warriors—to Ventress's cause and set out to plan the assassination of Count Dooku.\nVentress hid out with the Nightsisters for a short time after her healing, gathering strength and becoming familiar with her people's attire and customs. Meanwhile, Talzin prepared her assassination plot. She summoned her coven to the village center and greeted Ventress with a prayer circle and an enchanted basin of ichor. Using her coven's spellcasting abilities, Talzin had imbued the liquid with the magick powers of stealth. Ventress, Karis, and Naa'leth stepped into the mist rising from the ichor and became nearly invisible. Their forms were cloudy and translucent, allowing the three Dathomirians easily be camouflaged in any environment. Ventress and her compatriots were given Jedi lightsabers by Talzin, who planned for the three women to strike at Dooku in his palace on the planet Serenno. The lightsabers ensured that if the three were seen, the would appear to be Jedi assailants and not Nightsister assassins.\nVentress flew the Raider to Serenno with Karis and Naa'leth in tow, landing in the forests on the outskirts of Dooku's compound. Under the cover of night, the three women trekked to the palace and infiltrated it by cutting through the outer wall and crawling through the ducts. Ventress sensed her old master in his room below them and descended upon a sleeping Dooku with her cadre. Before engaging, she shot him with a dart that had been dipped in Nightsister poison by Talzin. The count immediately woke and armed himself with his lightsaber, but quickly began to lose his vision as a result of the poison. Nevertheless he attacked his assailants, who he assumed to be Jedi on the basis of their lightsaber blades.\nVentress, Karis, and Naa'leth went in on the Sith Lord, striking to kill their target who remained a dangerous and talented foe despite his impairments. The duel eventually moved into Dooku's office, where the count faltered and was slammed into his desk by a powerful Force push from Ventress. The Dathomirian nearly took the Sith Lord's life, but Dooku surprised his three assassins with a sudden and overwhelming wave of Force lightning. The blast incapacitated all three Nightsisters, lifting them into the air and allowing Dooku to fling them through his window and out of the palace towards the forests below. Ventress fell for a long distance but swiftly regained her bearings and clung to a cliffside to avoid impact on the ground. She grabbed Karis and Naa'leth's tumbling bodies through the Force and rescued them too before returning to the Raider and fleeing Serenno in defeat.\nThe Raider flew back to Dathomir where the assassins were greeted by Talzin and the coven. Karis admitted their failure, but the Clan Mother insisted that the defeat presented additional opportunities. She explained to Ventress that their failed assassination demonstrated to Dooku his own vulnerability, and that the Sith Lord would now be eager to protect himself—specifically, by finding a new pupil with which to replace Ventress. To that end, Talzin contacted her old acquaintance and offered the count a new apprentice. Dooku had always acknowledged Ventress's talents and the power of Dathomirian warriors, and so accepted the offer to take a new apprentice from Talzin's people—this time from the subordinate but ferocious male warrior clans of Dathomir, the Nightbrothers.\nNot long after the assassination attempt, Dooku traveled to Dathomir to hold audience with Talzin and discuss the Nightsister's offer. Ventress hid among her sisters during the meeting but monitored her old Master until his departure from the planet. Talzin had promised to find Dooku a new assassin from the ranks of the Nightbrothers and assured him that the warrior would be of the same bloodline as Maul. Maul had been a renowned Sith Lord a decade prior during his time as Darth Sidious's apprentice; after he was reported dead at the hands of Obi-Wan Kenobi, Dooku replaced him as the Dark Lord's pupil, but his legend lived on.\nIt was that legend that motivated the count to agree to the arrangement, unaware that Talzin was conspiring with Ventress to ensure that his new assassin would be a weapon against Dooku that was loyal only to the Nightsisters. Unbeknownst to all parties but the Nightsister shaman herself, Maul was the young son of Talzin's who had been abducted and indoctrinated by Darth Sidious so many years prior. Talzin's aid to Ventress in maneuvering against the Sith was motivated by loyalty to her son and her desire to revive him and strike back against the Sith Lord. Thus, she sent Ventress off aboard a speeder towards the Nightbrother village on the far side of the planet to find one of Maul's kinsman to be her proxy and Ventress's pawn in taking down Dooku.\nAt the village, Ventress met the Nightbrother chieftain Viscus and informed him that she had arrived to perform the Selection—a Dathomiri ritual by which Nightsisters tested their own skills and in which Nightbrothers were selected for mating. Viscus summoned the heads of each Nightbrother clan to the village square, where the men lined up to be inspected by the Nightsister. Taking full advantage of her dominant social status, Ventress began to beat and berate several of the Nightbrothers to demonstrate that many were unfit for consideration. After dismissing several undesirables, she selected a group of six potential candidates, making sure to single out two in particular: Savage Opress and his brother Feral.\nThe warriors' first trial would also serve as an initiation assessment for Ventress—the Test of Fury was the first part of the Selection process, but was also a necessary rite for Nightsisters to become full-fledged assassins in their culture. In an open circular arena high above the village, Ventress and Viscus gathered the six candidates and armed them with a variety of deadly melee weapons. At Viscus's signal, the men attacked the unarmed Nightsister, who easily dodged their assaults and assailed them with her bare hands. Ventress killed two of the Nightbrothers in the vicious scuffle and incapacitated the other three. Opress was the last warrior standing, but she knocked him out with a swift punch after he chose to rush to Feral's aid instead of continuing the attack.\nNight fell on Dathomir as Ventress and Viscus began the second test of the selection. In a challenge of blindness, Ventress wielded a flail and hid in the darkness from the four remaining warriors, occasionally using the Force to quickly and quietly speed towards them in an ambush. Her first two attacks were successful and killed two of the candidates, but Opress was able to predict the angle of the third attack and pull himself and Feral away from Ventress's deadly strike. Impressed, she accepted the two brothers into the third and final test in which she would fight them to the death on ceremonial platforms that raised and lowered unpredictably. The brothers did not want to fight one another for survival and so attempted to evade Ventress together, but Feral was discovered and attacked by the Nightsister when he was separated from Savage. Ventress nearly killed Feral, first beating him into submission and then seizing him in a Force choke. She was prevented from doing so by Opress, who threw her against a pillar and demanded that she take him and spare his brother. Ventress accepted the offer and ordered Feral to leave before continuing battle against Opress. The two were well-matched in martial combat but the Nightsister ultimately overcame her opponent after brutally beating him to the ground. With her foot on his throat she proclaimed Opress the victor of the Selection and took ownership of him as a slave.\nThe following day, Ventress departed from the village with Opress in tow to return to the Nightsister fortress. She presented the man to Mother Talzin, who praised her selection of such a fine specimen. Opress was sedated under Talzin's influence and brought to the village center, where he was subjected to the dark magicks of the gathered witch clan. Ventress watched as the coven used the Spirit Ichor to transform the man's body, infusing him with dark power and enhancing his natural rage and hatred. Opress grew from an average-sized Zabrak warrior into a hulking monster with little free will or compassion left within. When the ritual was complete, Talzin reawakened Opress, who immediately grabbed Ventress's neck and began to crush her throat with overwhelming strength. Although he initially ignored her protestations, Talzin's magick made him obedient to the Nightsister in the proper context, and so Ventress was able to order him to release her with a calm and soft command.\nTo ensure his loyalty to her above all else, Ventress brought forth Feral, who had been abducted from the Nightbrother village after Opress was selected and taken away. Ventress ordered Savage to kill Feral to prove his obedience and merciless nature; although he hesitated briefly, Opress ultimately grabbed his brother by the throat and strangled him to death. Assured of her pawn's allegiance and skill, Ventress allowed Talzin to take Opress to Dooku on Serenno, where he would be apprenticed to the count and train in the dark side of the Force. Still believing Ventress to have been killed at Sullust, Dooku took the Nightbrother into his inner circle and began planning to overthrow Sidious and conquer the galaxy with his new student—just as he once had with Ventress.\nWhile she remained with the Nightsisters on Dathomir, her pawn grew stronger in the Force under the count's teachings and began to undertake missions on behalf of the Confederacy. The first of these missions saw Opress brutally kill two Jedi on Devaron, forcing the Jedi High Council to launch an investigation that ultimately led Obi-Wan Kenobi and Anakin Skywalker to Mother Talzin on Dathomir. Talzin, realizing that Opress could no longer be kept a secret from the galaxy and not wanting to incriminate herself or her clan, complied with the Jedi. After Kenobi and Skywalker departed Dathomir to intercept Opress at Toydaria, Ventress met with Talzin to discuss their progress. Although the younger woman believed that her assassination plot was not yet prepared, Talzin insisted that she needed to strike now, as Opress had been revealed to the galaxy. Ventress agreed and set off for Toydaria to reclaim Opress as her own and finally kill Count Dooku.\nWhile Opress was on the planet to retrieve King Katuunko alive and force him into an agreement with the Separatists—thereby correcting Ventress's failure on Rugosa—he was intercepted by Kenobi and Skywalker and ended up killing the Toydarian monarch. Ventress meanwhile infiltrated the Confederate Providence-class destroyer in orbit, which had ferried Dooku to the system to parley with his intended captive. When Opress returned to the count's observation chamber with Katuunko's corpse, the Sith Lord punished his student for his failure with relentless blasts of Force lightning. Ventress shocked both of them when she interrupted the torture and once more took command of Opress and the two students turned against their former teacher. A vicious duel ensued, with Dooku just barely fending off attacks from the Dathomirian warriors.\nAlthough the count was at a severe disadvantage and was even disarmed at one point, he was able to hold off Opress by repeatedly attacking him with Force lightning. Ventress bristled at her pawn's inability to strike at Dooku and began berating him for his weakness; the derision from Ventress and torture from Dooku was ultimately too much for the Nightbrother to handle, and so he broke free from his bonds of servitude and attacked both of his masters. As the duel devolved into a three-way brawl, Dooku escaped the fray by fleeing into a trap door in the floor. Ventress gave pursuit, leaving Opress in the count's observation chamber, where he was discovered by Kenobi and Skywalker, who were still tracking him for his murder of the Jedi on Devaron.\nVentress followed Dooku into the lower levels of the destroyer where she once again confronted her former Master. The two continued their duel throughout the vessel and into the escape pod bays, where Dooku ended the confrontation by throwing the Nightsister into a bulkhead and disarming her with telekinetic Force. He poured a blast lightning into her body and moved to execute her with a swift downward strike, but Ventress was able to narrowly avoid death by using the Force to push his blade into the piping beside her instead. Toxic gasses flowed out of the severed pipe and into Dooku's face, allowing Ventress just enough time to retrieve her lightsabers and flee into a nearby escape pod. The pod's path took her down towards Toydaria, after which she fled into the galaxy to hide from Dooku, Opress, the Jedi, the Confederacy, and the Republic.\nThe debacle at Toydaria rattled Ventress, who took to wandering the stars for a time to contemplate her next moves. As the war dragged on elsewhere and much of the galaxy still believed her to be dead, Ventress decided that the time had come to return to Dathomir and make it her home. She traveled back to the planet aboard an HH-87 Starhopper and was greeted by her sisters and Mother Talzin upon her arrival. She explained to Talzin what had happened with Opress and voiced her uncertainty over her own future now that revenge against Dooku appeared to be out of reach. Despite having an agenda of her own with Opress—specifically, the recovery of her son, Maul—Talzin welcomed Ventress back without hesitation and offered to make her an official member of the coven by performing the baptismal ritual. Ventress agreed, thereby leaving behind her identity as an assassin and embracing her new life as a Nightsister. In the dark ichor-infused waters of the coven's fortress, the witches gathered around to perform the ceremony. After Ventress repeated a pledge to her honor her sisters with loyalty above all else, she was bathed in the waters while her sisters performed the magick ritual to rebirth her as a true Sister of the Night.\nVentress was risen from the waters at the conclusion of the ceremony and declared a Nightsister by Mother Talzin, who called for a feast to celebrate the formal return of their long-lost sister. Unbeknownst to the Dathomirians, far away on Serenno, Count Dooku was still plotting to eliminate his former apprentice and deliver retribution unto the Nightsisters for harboring her and baiting him with Opress. To that end, he dispatched General Grievous and an armada of droid forces to Dathomir to wipe out the Nightsisters and Mother Talzin once and for all. During the celebration of her baptism, Ventress recognized the familiar sound of droid starfighters and realized before the rest that the coven was under assault. She ordered her sisters to scatter just as Vulture droids and Hyena bombers made their first attack runs on the fortress. Understanding that the Confederacy had come to Dathomir to end the Nightsisters, Talzin ordered her clan to prepare for battle while Ventress readied herself to lead the fight. The droids continued their bombing runs against the fortress, downing support structures and crushing Sister Karis. Ventress took a moment to mourn before rushing into the fray against the first wave of droids, leading her sisters in an offensive against the invading army.\nAt her command, bow-wielding Nightsisters took to the trees to attack from above while Ventress led the assault against droid infantry forces on the ground. The witches gained ground under her leadership until Grievous launched organic-incinerating defoliator missiles against the Dathomirians. They were briefly forced to retreat until they were joined by reinforcements: an army of undead Nightsisters resurrected by the eldest sister, Old Daka. With the aid of these zombified sisters, the Nightsisters overwhelmed the droids and Ventress was able to commandeer an Armored Assault Tank. After destroying the Defoliator Deployment Tanks threatening her people, she drove the commandeered tank directly towards Grievous's staging area with the Army of the Dead clearing a path. Upon reaching the general's landing craft, Ventress abandoned her tank and leaped over waves of battle droids while her sisters laid waste to the automatons behind her. She was greeted at the ships by Grievous and insisted that if she was the target of the invasion, then the two should face one another in a duel—if Grievous were to win, then the Nightsisters would surrender, but if Ventress was victorious then the Confederate army was to leave. Grievous agreed, but after Ventress overcame him in a short bout, he ordered his forces to kill her and all of her sisters.\nHis sudden reneging on the terms of the duel threw the battle into chaos, in which Ventress was shot in the shoulder by a droid. The remaining Nightsisters attacked the droids, with the Army of the Undead tackling Grievous and narrowly saving Ventress from execution by the general. The Nightsister Luce grabbed the wounded Ventress and began carrying her away from the battle but was fatally shot in the back by droids. Advised by her savior to flee in the face of their impending doom, Ventress limped into the forest while the Army of the Undead and the remaining Nightsisters were wiped out. Grievous ultimately made his way into the Nightsister fortress itself, where he murdered Old Daka and forced Talzin to escape execution by phasing out of the fortress via magic. In the aftermath of the battle, Ventress wandered the Dathomirian wilderness alone and injured until she was confronted by the specter of Mother Talzin, communicating from the realm of spirits. The clan mother informed her that the battle was lost, and although Ventress blamed herself for the eradication of the Nightsisters, Talzin encouraged her to continue her life before again dissipating in a green mist. Devastated, Ventress screamed for Talzin to return but was instead left alone in the forest to forge her own path yet again.\nA devastated Ventress eventually made it off of Dathomir and took to wandering the Outer Rim Territories. Posing as a traveler on a vagabond transport, she made her way to the lawless desert world of Tatooine where she would be largely anonymous among the seedy spaceport city of Mos Eisley. While attempting to drink through her sorrows in Chalmun's Spaceport Cantina, Ventress was propositioned by the bounty hunter Oked, who she soundly dismissed. When he continued to harass her despite being rejected, she casually impaled him with her lightsaber and continued drinking. Though violence was commonplace in the cantina, Oked's brutal murder attracted the attention of the Trandoshan Bossk and the Theelin Latts Razzi, both fellow bounty hunters. They summoned Ventress to their table and informed her that Oked had been a member of their syndicate of hunters, and that they now needed a replacement for their upcoming job. Bossk insisted that Ventress join in Oked's place given that she was the reason for the newly opened position. Having no other direction or plan and also realizing the bounty hunters would give her over to Jabba for her murder, which would result in the Hutt finally getting revenge for her role in kidnapping Rotta, Ventress agreed.\nBossk and Razzi escorted Ventress to their Mos Eisley safehouse, where she was introduced to the other three members of the bounty hunting team: Dengar, the human cyborg; the combat droid C-21 Highsinger; and their leader, Boba Fett. Ventress made her displeasure at having to answer to the adolescent Fett known immediately, and although the young man wanted her thrown off the team, Razzi reminded him that their upcoming job required six hunters. Fett accepted Ventress's membership out of necessity, despite her refusal to take orders or reveal her identity to the team. Together, the five bounty hunters and Ventress departed Tatooine aboard Bossk's ship, the Hound's Tooth, and made way for their target on the planet Quarzite. The team arrived at the world's skyhook space station, where they were greeted by the Belugan Major Rigosso, a representative of the Belugan dictator of Quarzite, Otua Blank. Rigosso explained to the team that, due to the world's completely pressurized atmosphere, he and the hunters would travel from the station to the inhabited subsurface of Quarzite via the skyhook's turbolifts. There they would find their objective: precious cargo that was to be protected from marauders as it was delivered to Blank's fortress via subtram.\nVentress rode to the crystalline subsurface with Dengar, where the two of them and the rest of the team were joined my members of Rigosso's guard. The major insisted that the cargo container not be opened by any of the hunters before he and Fett's crew boarded the subtram and began their journey towards the fortress. The team split up along the tram, with Ventress and Dengar being assigned to guard the rear platform from attack. Dengar attempted to make conversation but was interrupted by three Kage Warriors—the marauders who opposed Blank that Rigosso had warned them about. Ventress and Dengar engaged the warriors, but four more quickly appeared and ran towards the front of the tram.\nThe other hunters successfully repelled this first wave, but more Kage continually boarded from Milodon mounts running alongside the subtram. Ventress held off three attackers using only unarmed combat, but activated her lightsabers after the warriors drew their own blades. Dengar was overwhelmed by the assault and fell off the tram, leaving Ventress to fend off the invaders on the back of the tram alone. Although she requested aid, Bossk, Razzi, and C-21 Highsinger were all thrown off as well, and Major Rigosso was killed by the warriors' leader, Krismo Sodi. After eliminating all combatants on the tram's rear, Ventress made her way towards the cargo compartment that was now manned only by Fett.\nIn the compartment she discovered Krismo Sodi standing over an unconscious Fett and Otua Blank's newly freed cargo: Pluma Sodi, sister to the Warriors' leader. Ventress demanded that Krismo step aside so she could claim her bounty, but the Kage instead released a smoke bomb and hid in the darkened recesses of the cabin, only to ambush and disarm Ventress moments later. The two engaged in a vicious fistfight that was ended when the Dathomirian seized her opponent's throat with the Force and slammed him against the wall and thew him across the tram. Fett awoke moments later, oblivious to Ventress's display of Force power. He ordered that he tie up Krismo and Pluma so the two of them could complete the objective and collect their reward.\nVentress was assigned to guard the prisoners for the final leg of their journey aboard the tram, during which time Pluma Sodi attempted to appeal to her better nature, explaining that she had been ripped away from her family and home. Ventress sympathized with the young woman, but still intended to make the delivery and collect half the bounty until Fett revealed that she would only get a small cut while he would receive the majority share. Ventress lost patience with the young hunter during their argument and grabbed him in a Force choke—a display that shocked Fett. Having been swayed by Sodi and displeased by Fett, Ventress decided to deliver a different cargo to Otua Blank. She bound and gagged Fett and stowed him away in the cargo box that had previously held Pluma Sodi and delivered the container on her own to Otua Blank at his fortress, collecting a significant bounty of unmarked credits from the client.\nIt wasn't until after Ventress departed once more aboard the subtram that Blank opened his prize to find Fett in the place of Sodi. Meanwhile, Ventress ransomed Pluma back to Krismo Sodi and the Kage for an additional sum of credits before returning to the skyhook turbolifts to meet the remaining members of the bounty hunter team in the space station above. Ventress subtracted her share from Blank's bounty payment and returned the rest—including Fett's money—to Bossk. Although the hunters commended her work for the team, Ventress insisted that she wasn't part of their syndicate, as she now had a new life to lead on her own.\nFollowing the Quarzite job, Ventress returned to Tatooine and decided to continue to work as a bounty hunter. She frequented the Mos Eisley Cantina, which was a favorite haunt for many hunters in the spaceport city. She enjoyed the company of fellow hunter Latts Razzi, but while the two shared a drink in the cantina, Ventress became increasingly wary of a presence from her past: Savage Opress. Even the arrival of new patrons startled her, and she admitted to Razzi that a \"monster\" from her past was occupying her thoughts. While she was enjoying a drink alone in the cantina not long after her work with Fett's syndicate, she overheard bounty hunters gathered around the cantina transmitter discussing a particularly valuable target: one million credits in exchange for the capture of Savage Opress.\nAlthough another hunter intended to take the job, Ventress pushed her way towards the transmitter and insisted that this particular bounty was hers; she claimed the posting from the bounty boards and departed Tatooine aboard an HH-87 Starhopper to hunt down her old Nightbrother pawn. Her search ultimately led her to Raydonia, an isolated world in the Outer Rim Territories not far from Dathomir. She set down just outside a desolate settlement where she found a Turtle Tanker starship preparing for takeoff. Assuming Opress was within, she jumped onto the hull of the ship and climbed aboard as it lifted towards space.\nShe hid in the upper reaches of the vessel's cargo hold, where she discovered Obi-Wan Kenobi being beaten and tortured by none other than Maul—Opress's brother and Talzin's son, long believed to have been killed more than a decade prior by Kenobi himself. Opress and Talzin had recently recovered Maul, and now he and his brother were exacting revenge against the Jedi who had cut off the lower half of his body and left him for dead so many years before. When Opress returned from the cockpit to join Maul's torment of Kenobi, Ventress revealed herself, taunting the brothers before vanishing into the darkness of the cargo hold once more. The two Nightbrothers stalked into the forward compartments to where they thought she had gone, but Ventress had in fact remained in the hold to awaken the unconscious Obi-Wan Kenobi. The Jedi was shocked to see his old adversary, as she was still widely believed to have been killed at the Battle of Sullust. Despite the sudden change in roles, the two quickly accepted one another as necessary allies in the fight against Opress and Maul. When the two brothers returned to the cargo hold, Ventress lent Kenobi one of her lightsabers, and the four combatants engaged in a lethal duel, with the Dathomirian engaging Opress and the Jedi battling the disgraced Sith Lord.\nVentress held her own against Opress but was eventually overwhelmed by his unnatural strength and disarmed. She continued battling him unarmed until Kenobi was able to retrieve his own lightsaber from Maul and returned the loaned red saber back to her. The duel continued until both the Jedi and Nightsister realized they were outmatched and decided that it had become necessary for them to flee. While Kenobi ran for the cockpit escape module, Ventress held off Maul and pushed Opress towards the back of the cargo hold. The unlikely allies fled into the cockpit, with Kenobi activating the escape module function and detaching from the cargo hold shortly before the two brothers could cut through the airlock blast doors. The narrow escape rattled both of them, with Kenobi reminding Ventress that both Maul and Opress would make efforts to hunt down the two of them following the skirmish. The Jedi and the bounty hunter parted ways after Raydonia, although Kenobi held a newfound respect for his former opponent and voiced this to the Jedi Council. Regardless of her deeds, the Jedi and the Senate still believed her to be a Separatist and intended to charge her with war crimes.\nAs the war raged in the rest of the galaxy, Ventress followed her new career as a bounty hunter and eventually began work out of a residence on Level 1312 in the seedy lower levels of Coruscant, the capital of the Galactic Republic in the Core Worlds.\nFor one of her jobs, Asajj Ventress was hired by Lacezzi Macran, one of Coruscant's Level 1313's primary crime lords, to investigate a string of disappearances before the authorities started to investigate. During her investigation, she found some spores on the ground. However, some vermin attacked her. She fought off most of the vermin, but the mother was eaten by a tentacled creature in the shadows. She attacked but was sprayed with the same spores she found on the ground, which burned her. She then sliced several tentacles off the creature; however, she was shot in the back and went unconscious. When she awoke she found out that Meysor, Lacezzi Macran's adopted son, was taking care of a sarlacc, who was the creature in question. She released the sarlacc, which proceeded to eat Meysor. She found out that the sarlacc was replicating itself all across the city, which explained the spores, and also why the disappearances were so widespread. She lured all of the sarlaccs into her ship, flew into the sky, jumped out, and detonated it, killing all of the sarlaccs. But when she went to collect her payment from Lacezzi, he refused to pay her due to his son's death. Asajj then revealed that one of the sarlaccs had not boarded her ship. The sarlacc then ate Lacezzi, as Ventress walked away.\nShe remained successful and shrewd in business and performed her work in a helmet with a retractable faceplate that obscured her identity. Not long after the Onderonian Civil War, Ventress delivered a near-dead Kalleran to her Devaronian bounty broker. While awaiting her payment, she saw and immediately accepted a bounty posted by the Galactic Senate for Ahsoka Tano, wanted for terrorism and crimes against the Republic for the bombing of the Jedi Temple and the murder of multiple clone troopers. Although she initially did not believe that the young Padawan was capable of such offenses, she took the job anyway and hunted the Jedi, who was on the run from both the Order and the Grand Army of the Republic.\nWhile hunting the fugitive Padawan, Ventress happened upon a Weequay thug assaulting a pair of Zygerrian sisters for their food. Ventress stepped in and quickly defeated the thug, severing his left arm in the process. As she departed, she bequeathed the Weequay's abandoned vibro-knife to the sisters. She eventually tracked Tano to Level 1313 of the undercity and followed her for a time until the young Togruta was alone in an alley. Ventress leaped from scaffolding above and tackled Tano, pinning her to the ground with her two sabers scissored over the Padawan's neck. After revealing her identity, Tano assumed it was Ventress who framed her for the crimes she was accused of committing, but the Dathomirian had no familiarity with the charges—she only intended to find Tano to collect the Senate's bounty.\nVentress took custody of Tano and escorted her towards the landing platform at Terminal 24 of the undercity transportation hub, but the young Jedi still tried to reason with her, insisting that a Separatist war criminal and Sith could not simply hand her over to the Jedi Council without retribution. Although Ventress had intended to hand her over to a bondsman to collect her bounty, she sympathized with Tano's position as a student abandoned and betrayed by her masters. Ventress was still hesitant, but agreed to aid Tano in her quest for justice provided the Padawan advocate for her pardoning to the Council and Galactic Senate. As the two agreed to a deal, a team of clone troopers led by Anakin Skywalker and Jedi Master Plo Koon descended on them to capture Tano. Ventress led the young Togruta to safety, sealing them behind a ray shield that prevented Republic pursuit. Before they escaped, Skywalker caught a glimpse of his apprentice with Ventress, leading him to believe that the bounty hunter was involved with the bombing and Tano's framing.\nAlthough still wary of their deal and planning to turn Tano in if it proved more profitable to do so, Ventress led the wayward Padawan to her hideout on Level 1312. There, the Togruta rewired a holobooth to contact her friend, Jedi Padawan Barriss Offee, without being traced by the authorities. Unbeknownst to both women, a Republic probe droid had followed them there and relayed their location to a search party led by Clone Commander CC-3636—a clone whom Ventress had disfigured years earlier. Tano ended her conversation and informed Ventress that proof of her innocence may be found in an abandoned munitions warehouse on Level 1315. Ventress was familiar with the location and agreed to take the Padawan there, but the two were interrupted by CC-3636's team of clones. Wolffe attempted to take Tano into custody, but Ventress and the Togruta engaged the soldiers and disarmed or disabled all of them; Ventress specifically refrained from killing any of the clones for Tano's benefit and to prove that she had moved into a new phase of her life. Afterwards, she led her new ally to the munitions warehouse on Level 1315 and claimed that she had fulfilled her half of the bargain. She returned Tano's lightsaber to her and departed, reminding the Jedi that she was to advocate for her pardoning to the Republic.\nVentress returned to her hideout on Level 1312, but sensed some continuing danger on her walk home. She was briefly distracted by a tooka cat, during which time she was ambushed by Barriss Offee, who hurled a metal barrel at Ventress's head, knocking her to the ground and removing her helmet. Ventress attempted to recover, but Offee approached her and hit her in the head with a metal pipe, knocking the bounty hunter unconscious. The renegade Jedi—responsible for the bombing of the Temple and murder of the clones—intended to frame both Tano and Ventress for her crimes and so stole the Dathomirian's lightsabers and helmet. Ventress recovered from the attack, but Offee adopted the bounty hunter's identity and attacked Tano in the warehouse. The deception led the Padawan to believe that Ventress had betrayed her and allowed the Jedi and clones to find Tano in the munitions warehouse filled with the same explosives that had been used to attack the Temple.\nVentress went back into hiding in the undercity following the attack while Tano was taken into custody and expelled from the Jedi Order. The Togruta argued that it was likely Ventress who was behind the terrorism and framing plots, but with no evidence to support the claims, the Senate and Republic military insisted that Tano be indicted for the crimes. As the disgraced Padawan faced a military tribunal, Skywalker committed himself to ascertaining the validity of his apprentice's defense and so traveled to the undercity to hunt down Ventress. The bounty hunter sensed the Jedi stalking her while she walked through a slum, but was still unarmed after losing her lightsabers to Offee. The two fought briefly, but Ventress was quickly overpowered by the Jedi, who was enraged by the situation and brushing with the dark side.\nSkywalker seized Ventress in a Force choke before wrapping his own hand around her neck, nearly throttling her to death while accusing the bounty hunter of setting up Tano. When Ventress explained that she had only become involved for the sake of the Togruta's bounty, but ultimately sympathized with the spurned student, Skywalker released her. She explained to the Jedi that she had been attacked after leaving Tano at the warehouse but failed to identify her assailant—she could only confirm that the culprit had taken her lightsabers. She also confirmed that Tano had only spoken to one other individual after her escape from prison: Barriss Offee, the Jedi that led the two of them to the munitions warehouse.\nSkywalker believed Ventress's claims and returned to the Jedi Temple, where he confronted Offee and exposed her guilt. Offee admitted her crimes before the military tribunal and thereby cleared both Tano and Ventress of the accusations. Although Tano was offered the chance to return to the Jedi following her acquittal, she rejected the offer and left the Order, never having the opportunity to advocate for Ventress's pardoning to either the Council or the Senate.\nFollowing the intrigue with Tano on Coruscant, Ventress left the Core Worlds and gained possession of the gunship pursuit craft she dubbed the Banshee. She moved her business to the vessel and adopted it as her home, modifying it significantly and using it to great effect on numerous missions. Even though she was at first inconvenienced by the loss of her red lightsabers to Offee, Ventress came to see it as a way to distance herself, yet again, from her time under Dooku; she acquired a new lightsaber, one with a rather conventional, straight hilt, on the black market. When she first powered on the blade, she saw it was a pale yellow, which satisfied and pleased her; the color showcased how she was neither Jedi nor Sith, she was simply Asajj Ventress. Her reputation as a successful hunter grew in the following months, garnering her the moniker \"the Bald Banshee\" and the ire of other bounty hunters—particularly Boba Fett. She also became familiar with a growing roster of underworld figures, including the Pyke Syndicate majordomo Fife.\nShortly after investing in significant repairs to the Banshee, Ventress accepted a large bounty posting from the Koorivar antiquities merchant Sheb Valaad. Valaad had hired a crew of smugglers to transport precious cargo aboard the freighter Steady On and required skilled pilots to escort the vessel to its destination. Ventress joined the escort detail to fly the Banshee alongside five other fighter pilots, but was additionally tasked with ensuring a specific piece of cargo reached Valaad. During the journey to the cargo's destination, Ventress remained wary of probable pirate attacks; the Dathomirian had learned in her time in the business that smugglers and coveted cargo often drew out brigands, and this job proved no different. The Steady On was attacked by a group of pirates from the Weequay Ohnaka Gang and all five of her fellow pilots were killed in the fighting. The Banshee was badly damaged and Ventress was injured while the Weequays made off with the Steady On and the cargo within.\nThe Banshee was left crippled in space when a second group of pirates, the Blood Bone Order, arrived to the area aboard their ship, the Opportunity. Led by the Pantoran Lassa Rhayme, the Blood Bone pirates had also intended to hijack the Steady On, but were instead left with nothing but rubble and a heavily injured Ventress. Rhayme decided to tow in the Banshee for repairs and take Ventress into her sickbay to recover, acting on a hunch that the bounty hunter may be of use. Upon finding Ventress's lightsaber, Rhayme decided that the Dathomirian would be the ideal partner for her scheme to retake the Steady On. Ventress agreed on the condition that she could keep the single piece of cargo she had been assigned to deliver and the two set off for Florrum, where the Ohnaka Gang made their base.\nTo retrieve the Steady On, Rhayme posed as a bounty hunter by donning Ventress's garb while the Dathomirian dressed herself in a robe intended to resemble those worn by Jedi. Rhayme brought Ventress to Florrum's pirate hub with her hands bound, intending to present the \"Jedi hostage\" to Jiro, the Ohnaka Gang's second in command. The two women were welcomed into the pirate's hall and Rhayme explained to Jiro that she was a defector from the Blood Bone Order, fleeing the oppressive Captain Lassa Rhayme and hoping to join the Ohnaka Gang by providing the Jedi as a gift they could ransom and divulging the location of the Blood Bone's pirate fleet. Jiro took Ventress's lightsaber but was cautious to accept the offer, as the gang's leader, Hondo Ohnaka, was away from Florrum and not able to approve or vet the \"bounty hunter\" as a new addition to the crew. To sell the deception, Ventress pulled her lightsaber back from Jiro and attacked the Weequay pirates in an apparent attempt to flee. Rhayme \"subdued\" Ventress and reclaimed the lightsaber, but not before slashing at the false Jedi's wrist restraints to loosen them for an escape.\nWhile Rhayme continued to deal with Jiro, Ventress was led to the base's dungeons by a guard of four pirates. As soon as her escort led her out of the grand hall, she broke free of her restraints and knocked them each unconscious before shooting them with stun bolts for extra assurance. She then snuck back into the main hall and out to the Steady On, which was docked outside the base and being offloaded by the pirate crew. Ventress dispatched the six brigands handling the cargo, but her plan with Rhayme became suddenly more complicated when Ohnaka returned from his absence with an additional ten crewmen. Ohnaka and his men confronted Rhayme in the main hall, but the Pantoran pirate was saved by Ventress, who emerged from the shadows and began disarming and disabling the Weequay crew. Rhayme threw Ventress's lightsaber back to her during the melee, and the two women were able to overcome the Ohnaka Gang and humiliate Hondo Ohnaka.\nThey absconded with the Steady On's cargo and returned to the Opportunity, where they celebrated their victory and enjoyed one another's company over a bottle of Tevraki whiskey. Rhayme offered the Dathomirian a place in her crew, but Ventress turned it down despite admiring the woman and her command style, insisting that her life was one to be lived alone.\nVentress continued to work alone for many months, becoming quite wealthy from her successes in the bounty trade. Around the time of Dooku's genocide on Mahranee, around three years into the Clone Wars, Ventress accepted bounty posting from the Rang Clan for the capture of the Volpai embezzler Moregi in exchange for twenty-five thousand credits. Her acceptance of the job drove other hunters like Boba Fett away, leaving her free to hunt the target alone. Ventress's tracking ultimately led her to the capital city of Orto Plutonia's moon of Pantora in the Outer Rim Territories, where she received a tip that Moregi enjoyed wandering around a specific sector of the metropolis. She spent quite some time staking out the area, hindered in her search by Pantora's unique multilevel architecture and expansive park system. While scanning the region with her macrobinocular goggles, she found Moregi and descended upon him, but the Volpai refused to surrender and fled at the sight of the bounty hunter. Ventress gave chase, following the target through crowded streets and across several rooftops. Moregi eventually made it to the street level, but Ventress easily followed him down and tackled him to the ground. Although she nearly captured the Volpai, Moregi was suddenly tackled again—this time by a rival Kiffar bounty hunter named Quinlan Vos.\nUnbeknownst to her at the time, Vos was in fact a Jedi Master who had been assigned by the Jedi Council to go undercover as a bounty hunter and gain Ventress's trust. His ultimate objective was to familiarize himself with the habits and techniques of Count Dooku so he could carry out an assassination of the Confederate leader. Knowing that Ventress was more familiar with the Sith Lord than anyone else, the Council encouraged Vos to partner with her while concealing his true identity and purpose. To that end, Vos presented himself as a skilled but reckless bounty hunter who was eager to capture Moregi for himself, but more than happy to partner with Ventress and split the reward. The display and sudden intrusion infuriated the Dathomirian, as it allowed Moregi the opportunity to escape and momentarily robbed her of the bounty. Ventress pushed past Vos and continued her pursuit, but Vos kept pace throughout the chase, sometimes aiding her and sometimes intervening.\nAfter a series of speeder chases, Ventress finally distanced herself from Vos and caught up to Moregi, but the Volpai used his four-armed physique to disarm and overpower the bounty hunter long enough to make his escape. Ventress was thrown from a speeder at great height but was saved from the fall by Vos, who had commandeered a speeder of his own and caught the Dathomirian on her way down. Vos continued to annoy her and insist that they work together to find Moregi, but Ventress's irritation and dismay at having lost track of the Volpai pushed her to abandon the hunt for a short time and instead head to a bar. Vos inevitably followed her there as well and in exasperation she tolerated his presence instead of reacting violently. She was attracted to the faux-bounty hunter and recognized that he indeed possessed some skills, but remained insistent that she worked alone and only barely allowed him to join her for a drink. After brief introductions, Ventress allowed the Kiffar to inspect a shoulder plate she had managed to pull off of her target in their scuffling. Unbeknownst to her, Vos was particularly skilled in the Force technique of psychometry—the ability to pull images and memories from inanimate objects. After handling the plate for a moment, he was able to roughly estimate the location of Moregi's home.\nVentress followed Vos to a destitute area of the city on the claim that he had received a tip as to Moregi's whereabouts. The Kifar was in fact simply estimating the location that he saw in his psychometric vision but was ultimately able to lead them to a shabby apartment complex. On the fourth floor of the building, he and Ventress broke into an apartment unit to find Moregi there with his wife and child. The Volpai was insistent on protecting his family and proclaimed his innocence before offering to pay the two bounty hunters more than the Rang Clan. Ventress brushed off her target's protestations and pursued Moregi as he fled from the apartment through a window and onto a repulsor sled in the street below. Vos caught up to her on a commandeered speeder bike and together the two chased down their target. Ventress quickly leaped from the bike and forced Moregi to the ground, cornering him with her lightsaber drawn and Vos's blaster aimed at point blank range. After an exhaustive hunt, the Volpai embezzler had finally been caught.\nAfter taking Moregi into custody, Vos hung around Ventress, insisting that he get half the pay for the job and encouraging a continued partnership. Despite her typically solitary nature, the Dathomirian agreed to the partnership on a probationary period and required that Vos begin a daily physical training regimen to hone his skills and speed in combat. Their business relationship began in earnest over several hunts following the capture of Moregi, usually involving underworld contracts and outlaw targets. During this time, the two hunters frequented the Coruscant undercity for work; a specific instance saw them ambushed by a large group of thugs on Level 1313, forcing Vos to use the Force to save his partner from being shot. Ventress was distracted during the melee and failed to notice Vos's use of telekinetic powers, but was nevertheless suspicious of how her partner managed to disarm the assailant from an apparently significant distance.\nVentress handled the acquisition of new contracts for the team and their fifth job came to her from Captain Lassa Rhayme, who had promised to call on Ventress in the event she needed a bounty hunter. Rhayme sought the capture of her first mate and former lover, who had recently abandoned the pirate crew and run off with an heiress the Blood Bone Order had intended to rob. Ventress informed Vos of the job during his training, explaining that she intended to bait the man with sexual advances. The strategy was a success and the two hunters managed to capture their target in a short fifteen minutes. Rhayme expressed her appreciation for their work by including a bottle of her coveted Tevraki whiskey with their payment, which the two hunters enjoyed together that evening. While drinking, Vos prodded Ventress for information on her training, but she remained tight-lipped. It was during this period of successful hunting that the two began do develop feelings for one another beyond professional business relations, although both kept their affections to themselves.\nThe two returned to Coruscant's Level 1313 shortly afterwards so Ventress could work on modifications to the Banshee in relative safety while Vos purchased new supplies and weaponry. The Kiffar had in fact used the time alone to meet with Obi-Wan Kenobi to update the Jedi Council member on his progress in the mission to assassinate Dooku, but Ventress was unaware and busied herself with the work on the Banshee and lining up a new contract—this time with a powerful cartel of drug runners and spice dealers, the Pyke Syndicate. Ventress and Vos traveled to the Pyke's base of operations on the rocky world of Oba Diah, where her old acquaintance Fife introduced them to the Syndicate's newly installed leader, Marg Krim. Krim tasked the two hunters with retrieving his wife, Tezzka Krim, and their two children, Laalee and Vram, from the Black Sun. The rival criminal organization had abducted Krim's family and taken them to the Black Sun fortress on Mustafar in the Outer Rim Territories. Ventress was hesitant to take the contract but agreed regardless, and the two hunters set course for the volcanic planet.\nUpon arrival, Ventress set the Banshee down on the outskirts of a small mining town near the Black Sun fortress. The bounty hunters rented two lava fleas for transport and made their way into the village towards the only bar in town, The Last Resort. Within, Ventress identified a Falleen soldier as an agent of the Black Sun and proceeded to seduce the man. After she pulled him into the restrooms—ostensibly for intercourse—Vos emerged from hiding and subdued the Falleen. The hunters pumped the soldier for information on the Pyke hostages before knocking him out and heading towards the criminals' fortress. They managed to infiltrate the heavily guarded Black Sun base through an exposed balcony outcropping and entered the facility's jail cells, where they found Krim's children.\nLaalee and Vram informed the bounty hunters that their mother had been separated from them after their abduction and they did not know her whereabouts. This complication was compounded when the Black Sun soldier from The Last Resort returned to the fortress and raised the alarm, alerting the base's many guards to the presence of Ventress and Vos. To make a quick escape, the hunters had the children climb onto their backs and fled out the balcony and back onto the lower levels, intending to escape over a lava flow on the backs of their lava-flea mounts. With Laalee clinging to her, Ventress made it onto her flea and began the escape, defending the child from the blasterfire of the Black Sun with her lightsaber. Vos was meanwhile shot in the shoulder and nearly fell into the lava flow, but managed to save himself and Vram by using the Force. Eventually the two hunters made their getaway with the children in tow, but Vos's survival of the fall—which should have killed him and the child—reinforced Ventress's suspicions of her partner and led her to believe that he was indeed Force-sensitive.\nThey returned to the Banshee, where Ventress treated Vos's wounds and began to formulate their plan to find Tezzka Krim. Although they apparently had no leads, Vos used his psychometry ability on a locket worn by Laalee to discern that Krim was indeed still held in the fortress by the Black Sun leader himself, Ziton Moj. Within twenty minutes of their first escape from the compound, Ventress had piloted the Banshee back to the Black Sun base and landed directly in the courtyard—this time, she would pose as a Pyke Syndicate negotiator while Vos worked to free Marg Krim's wife. The hunters left Laalee and Vram in the ship before once more venturing into the fortress; Ventress was immediately intercepted by guards who did not recognize her from the recent rescue and therefore brought her before Moj so she could state the negotiating terms for the Pykes. She demanded to see Tezzka Krim before negotiating, but when the Pyke was presented, Vos revealed himself and initiated a shootout in Moj's throne room. During the melee, Ventress engaged and Force-choked Moj, allowing her and Vos time to escape with Krim. The two fled the scene among heavy fire, having successfully rescued all three hostages from the Black Sun.\nUpon returning to Oba Diah, an overjoyed Marg Krim rewarded Ventress with double their promised pay. She and Vos left the planet immediately after, but upon reaching the upper atmosphere, a fleet of Black Sun Interceptor-class frigates and starfighters came out of hyperspace above the planet. Despite knowing the implications of this for their most recent clients, the bounty hunters had no ability to interfere and so jumped out of the system to find safe haven and, more specifically, a bar. After drinking in silence for a time, Vos, who was overcome with his feelings for Ventress and disturbed by the apparent murder of the Krim family, admitted to his partner that he was indeed a Jedi, sent by the Council to learn from Ventress and ultimately kill Count Dooku. To his great surprise, the Dathomirian was already aware of his affiliations, citing his unnatural combat prowess and ability to survive even the most lethal incidents as evidence that he was likely a Jedi.\nVentress was surprised by the Jedi Council's willingness to assign one of its agents to the task of assassination, but understood why—the war had resulted in the deaths of not just many Jedi and clones, but civilians as well. Even though she was more than eager to see Dooku dead, she had long since abandoned the idea of revenge and cautioned Vos that the assassination would require him to abandon the vast majority of his Jedi ideals. Regardless, she agreed to help the Jedi by training him in the darker aspects of the Force so that the two of them might stand a chance of killing her former Master.\nWhile Vos made his final reports to the Jedi Council, Ventress began contacting former associates within the Confederacy to ascertain where and when she and Vos would be able to find Count Dooku. She meanwhile began planning his training as an initiate in the dark side of the Force and decided that it would take place on her homeworld of Dathomir, a planet steeped in the energies of the dark side. Upon arrival, the two bore witness to the aftermath of the Nightsister massacre carried out by General Grievous nearly a year before: skeletal remains and charred forests teeming with the ghosts of the dead and the pain of Ventress's loss. The Dathomirian explained to her companion her life's story, from her enslavement by Hal'Sted to her apprenticeship to Dooku and ultimately her return to—and eventual loss of—her sisterhood. When Vos grasped one of the fallen Nightsister's energy bows he received a psychometric vision of the Dathomir massacre and understood Ventress's pain.\nAlthough he still clung to his Jedi teachings of the avoidance of anger, Ventress pressed him to allow it in, insisting that Jedi orthodoxy would never defeat Dooku. To illustrate her embrace of hatred, she summoned a snake to slither onto her body before crushing its windpipe with a dark-side-fueled Force choke. Vos sympathized with the losses she had endured and revealed to Ventress that, much like she had struggled with the death of her Master Ky Narec, he too had struggled with the death of his Jedi Master—Tholme. Ventress recalled having killed Tholme early in the war, but instead told Vos that it had been Dooku that ended his Master's life. The Kiffar Jedi believed the lie and developed a deeper vendetta against the count for it, as well as the Jedi Council for having apparently withheld that information.\nOn the eve their training began, Ventress and Vos revealed their feelings for one another and kissed—a further rejection of Jedi mandates of non-attachment and a new manifestation of the commitment between the partners-turned-teacher and pupil. Over the following days, Ventress immersed Vos in the teachings and culture of the Nightsisters, insisting that their use of the dark side was superior to that of the Sith. They set up a camp far from the Nightsister village and began Vos's reeducation; Ventress took the Jedi on climbs to increase his strength, hunting trips so he could become accustomed to killing for food, and runs for the sake of agility and endurance. On one such run, she led him to the mouth of her fortress village but refused to take him inside the abandoned edifice, saving that experience for a later lesson. Instead, they returned to their camp where they began a new lesson; recounting her murder of the snake upon their arrival, Ventress invited Vos to do the same so he could practice using his hatred to kill without remorse or hesitation. She summoned another snake into their encampment and encouraged Vos to kill this one as she had killed the first, but the Jedi failed. He lost control of the creature while trying to throttle it with the Force and was bitten, injected with an agonizingly painful hallucinogenic venom.\nVentress watched over Vos's torment until the following morning, when the Jedi awoke in a drugged stupor. Testing his resolve, she attacked him with her lightsaber and engaged her student in a duel through their camp and across the surrounding forests. She led Vos all the way back to her abandoned village and ran within, baiting him to follow her. He was taken aback by the natural beauty of the caverns that had once housed her people, but was still able to defend against Ventress's attacks inside the fortress. Having witnessed him give into the dark side during their bout, she was satisfied with the test and ended the duel to continue his tutelage in the ritualistic access to the dark side perfected by the Nightsisters. She explained to him that deep within the pools of water throughout her village lived a creature known as the Sleeper—an ancient beast that was harvested by the Nightsisters in coming-of-age rituals. The sisters used body parts from the Sleeper to create the Water of Life, and Vos's next test would be to undertake the same ritual by tapping into the dark side to control the beast.\nIn preparation for his encounter with the Sleeper, Ventress took Vos to the oceans of Dathomir, where he was forced to train underwater without a breathing device or ocular aids. They worked there for many days, with her student practicing to increase his underwater endurance and combat the planet's native ocean fauna. Their romantic relationship continued to develop and deepen during these days which led both of them to question what they would do after killing Dooku. As Vos would be expected to return to the Jedi Order, his attachment to Ventress was forbidden and would be expected to end; however, having given himself to the dark side and embraced his love for the Dathomirian, Vos declared that he would not be returning to the Jedi after Dooku's assassination. He destroyed his comlink—his only connection to Kenobi and the Council—and committed himself to Ventress. As they prepared to consummate their love, Ventress was interrupted by a communication from Sumdin, a Gossam woman who was an associate of hers from within the Confederacy. Sumdin had been working to track Dooku's movements for Ventress and discovered that the count would soon be on the Separatist capital world of Raxus Secundus in the Tion Hegemony.\nKnowing that their window of opportunity to carry out the assassination was narrow, Ventress and Vos decided to return to the Nightsister fortress immediately so he could complete his training by facing the Sleeper. Ventress held her student's lightsaber and looked on while he stood at the edge of one of the cavern's pools and attempted to summon the slumbering beast. The Sleeper appeared after several moments and obeyed Vos's telepathic commands, climbing out of the water and onto land. However, when Ventress ordered Vos to kill the beast, he hesitated, allowing the Sleeper to break free of his will and drag him underwater. After grappling with the animal and sustaining great injury, Vos was once again able to gain control of it. Although he did not want to kill the Sleeper, as it had obeyed his commands and was probably the last animal of its kind, Ventress reminded him that their mission was to kill Dooku, even in cold blood if need be. Vos ultimately complied and strangled the Sleeper to death, reveling in the pain he caused and becoming empowered in the dark side. Seeing that he was now prepared to use the dark side to kill in any manner necessary, she deemed his training complete and the two left Dathomir for Raxus.\nUpon approaching the world, Ventress used security clearance codes provided by Sumdin to pilot the Banshee past the naval blockade of Raxus and down to the surface. Before heading to their destination in the capital city of Raxulon, she insisted that the two of them stop in Tamwith Bay to pick up formal attire; their plan involved ambushing Dooku at a high society gala organized to honor the count with the Raxian Humanitarian Award, and she and Vos would need to disguise themselves as Confederate dignitaries to get in. After the short stop they headed to Raxulon, where she dressed herself in an astonishing, form-fitting, black gown that concealed her lightsaber, but it was easily accessible through a side seam. Ventress and Vos were met at their landing pad by Sumdin, who arrived to provide the two with passes to the gala. After thanking the Gossam, Ventress murdered Sumdin to ensure their assassination plot could not be complicated by loose ends. With that, the two headed to the gala, where they disappeared among the throngs of guests watching Dooku's address. Following his pronouncements, the two split up, with Vos heading off to prevent General Grievous from interfering while Ventress approached the count on her own.\nIn a crowded dining room of gala attendees, Ventress walked up to the count and revealed herself. Although his first intention was to kill her immediately, he chose not to commit murder in front of the guests attending the event for his humanitarian work. Instead, Ventress told him to meet her on the hall's overlook for a fair one-on-one fight. Despite agreeing, Dooku attempted to hail Grievous to join him, but Vos had already been trapped the general within the security center. Ventress meanwhile waited on the overlook for the count, who arrived offering Alderaanian wine. He was rebuffed by Ventress and surprised first by Grievous's lack of response and then by the arrival of the Jedi Quinlan Vos. The three quickly entered into a vicious duel, with Ventress and Vos easily gaining the upper hand. However, during the duel Vos revealed that Ventress had trained him, tipping the count off to their love affair. Knowing his opponents weakness for one another, he was able to recover and overwhelm his adversaries. Dooku threw Vos back and grabbed Ventress with telekinetic power, slamming her into the railing and knocking her unconscious. She quickly regained her wits but was attacked by Grievous, who had escaped the confines of the security center. Ventress was dragged down to the balcony below and lost her lightsaber, but managed to defend herself with Vos's weapon, which had tumbled off the overhang.\nWhile Grievous left to aid Dooku against Vos, Ventress fended off her droid attackers and returned to the overhang, only to find her companion debilitated by the count's Force lightning. She attempted to retrieve him as he was being dragged off by battle droids, but was overwhelmed and forced to flee into the sewers of Raxulon. With their mission having failed and Vos taken captive by Dooku, Ventress was lost but resolved to rescue her lover from the count. Although she briefly considered reaching out to Kenobi, she believed the Jedi would never trust her. Instead, she fled Raxus and committed herself to saving the man she loved from the clutches of her former Master at all costs. Meanwhile, Vos began to believe that Ventress had set him up to fail and embraced the full power of the dark side.\nAfter escaping Raxulon with the Banshee, Ventress wandered for a time to formulate a plan to rescue Vos. She knew Dooku would take the Jedi to his palace on Serenno for torture and imprisonment and understood that she had no chance of rescuing her lover on her own. And so, in spite of their complicated professional relationship, Ventress sought out Boba Fett and his syndicate of bounty hunters on Tatooine. In the Mos Eisley Cantina, she confronted Fett, Bossk, and Latts Razzi with an offer of one hundred thousand credits for the rescue mission. Although Fett was resistant to working with Ventress after the job on Quarzite, he agreed to join the rest of his team—Bossk, Razzi, C-21 Highsinger, and the Kyuzo hunter Embo—after negotiating up to two hundred and fifty thousand credits for the job. The sum represented all of the wealth Ventress had accumulated throughout her bounty hunting career, but with no other recourse, she paid the syndicate up front and briefed them on their mission and target.\nVentress and the members of the hunter syndicate traveled to Serenno aboard Fett's ship, Slave I. Upon landing at the spaceport near Dooku's palace, Ventress explained to her compatriots that Dooku would likely not be present, and that they simply had to provide a distraction for the palace's battle droid guards while she infiltrated the compound to free Vos. Having previously lived in the castle as Dooku's apprentice, Ventress knew the delivery schedule for supplies, as well as the location of the landing and offloading docks for the supply shuttles. The team waited in the forest outside of the palace for the transports to arrive and attacked as soon as droids began offloading their cargo. When the bounty hunters managed to destroy one of the shuttles, palace security was alerted to their presence and droid guards were diverted to the cargo dock from within the compound, allowing Ventress to enter unnoticed. Given a fifteen minute time window from Fett, she raced through the halls towards the prison bloc, destroying many droids in her wake. Upon finally reaching Vos's cell, she found her lover broken and sobbing after enduring long periods of torture.\nWhen he sensed her arrival, Vos quickly seized Ventress in a Force choke and accused her of being a liar and murderer. Dooku had provided Vos with the lightsaber that belonged to his late Master and the Jedi's psychometric abilities revealed that Tholme had been executed not by the count, but rather by Ventress. Enraged over the deception, Vos fell entirely to the dark side and believed that Ventress had been manipulating him from the outset of their relationship. He badly battered the woman, throwing her into walls and engaging her in a vicious lightsaber duel. Although Ventress pleaded with him to pull back from the depths of the dark side and flee the palace with her, Vos was blinded by anger and refused to leave with the woman he had once loved. Ventress was repeatedly wounded and nearly overpowered by Vos, but she still intended to take him away from Serenno and so retreated back towards the docking zone in the hope that her bounty hunter compatriots could help subdue him.\nHowever, upon emerging from the palace, she found that the hunters themselves were nearly overwhelmed, although they had managed to subdue a quarry of their own: Count Dooku. The count had indeed been at the palace and went to confront the intruders, but was entrapped in an incapacitating webbing and held at blasterpoint by Bossk. Despite having the Sith Lord captive, the bounty hunters knew they could not hold out against the battle droid hoards and so retreated into one of the cargo shuttles with Ventress in tow. Although she wanted to stay and reach through to Vos, she witnessed him rush to aid Dooku and finally realized that he had embraced not only the dark side, but the Sith Order itself.\nFilled with regret and believing she had exhausted her options, Ventress resigned herself to the idea that Vos was now entirely in Dooku's grasp. After the failed rescue attempt on Serenno, she decided to reach out to the Jedi and let them know what had come of her former love. To that end, she returned to Coruscant, where she knew Vos had been meeting with Kenobi before she took him to Dathomir. She found the Jedi in a bar on Level 1313 and explained to him that his compatriot had joined the count, and the two former adversaries shared a drink in silence before parting ways. Over the following months, Ventress moved back to Level 1313 and fell into a deep depression exacerbated by alcoholism and severe insomnia. She returned to work as a solo bounty hunter but was haunted by thoughts of Vos, who had since gained galactic notoriety as Dooku's new right hand under the moniker \"Admiral Enigma.\" She was increasingly paranoid that her former lover, still enraged by her deception, was sending agents to kill her.\nOn one evening, she suspected that Vos's assassins were following her home from a bar and so ambushed her stalker, first assaulting the individual with telekinetic Force before holding the would-be assailant—a Mahran male—at saber-point. The Mahran offered no resistance, instead explaining that he was Akar-Deshu, a Jedi Knight and close friend of Quinlan Vos. Against the will of the Jedi Council, Desh sought out Ventress to ask for her help in retrieving Vos once again. Although she was wary of the Jedi Order and embittered against the Council for their earlier efforts to deceive her through Vos, she agreed to help the Mahran after taking stock of the pathetic state of her life in recent months.\nVentress followed Desh to the Jedi Temple, where he presented her to Obi-Wan Kenobi and Anakin Skywalker and explained that he had recruited the Nightsister to help find and recover Master Vos. Although Skywalker still held deep resentment for Ventress, Kenobi was sympathetic to her relationship with Vos and agreed to take her before the Council with assurance that no reprisal would be enacted for her past crimes. The four of them arrived in the High Council Chamber during a meeting between Jedi Masters Yoda, Mace Windu, Ki-Adi-Mundi, Shaak Ti, and Plo Koon. The five councilors were surprised by Ventress's appearance and all but Yoda quickly rose and reached for their lightsabers. Windu held particular animus towards the former Separatist and declared his intentions to arrest her on the spot, but was stopped from doing so by Kenobi and Yoda.\nThe Jedi agreed to hear her out and began questioning her relationship with Vos and what she had exposed him to in preparation for the attempt on Dooku's life. Ventress admitted to having been Vos's lover but denied that she taught him the ways of the dark side; rather, she had intended to train him only in measured use of the dark side to counter Dooku's own strengths, but ultimately pushed him farther than intended in the hope of better protecting him. After charging that the Jedi were also complicit in Vos's fall, she explained that she still cared for the man but even her love for him would never entice her to rejoin the dark side.\nIn a closed-door meeting after Ventress's interrogation, the Council debated her role in their current crisis. Although several members of the Council still did not trust the Dathomirian, her testimony convinced Yoda and Kenobi of her genuine affection for Vos and desire to see him saved. In his capacity as Grand Master of the Order, Yoda authorized Kenobi to lead Ventress and Skywalker on a mission to capture and redeem Quinlan Vos. Just as they concluded their meeting, the Council received an intelligence communique from Admiral Wullf Yularen, who had been tracking Dooku and Vos and learned that \"Admiral Enigma\" was allegedly on a Providence-class Dreadnought en route to assault Taris in the Outer Rim Territories. With their apparent target location set, Kenobi asked Ventress to join him on the mission. Although she was still hesitant to work alongside the Jedi in any official capacity, she agreed after Yoda offered her a full pardon for her war crimes in exchange for her efforts to recover Vos.\nVentress, Kenobi, and Skywalker left Coruscant aboard the Banshee and intercepted the Confederacy's fleet. With the ship's powerful cloaking device activated, the three were able to navigate through the Separatist armada and use Ventress's knowledge of Separatist security codes to land in the hangar of Dooku's Providence-class Dreadnought. Ventress, having familiarized herself with the ship during her time under the count, guided the Jedi through the vessel towards the bridge, where they expected to find Vos. The three reached the bridge without being detected but were shocked to find Dooku and not \"Admiral Enigma\" in command of the dreadnought. Kenobi and Skywalker immediately attacked the Sith Lord and his battle droid guards, but Ventress remained committed to finding Vos. After failing to locate him elsewhere on the bridge, she guarded Kenobi from battle droid attackers while the Jedi Master searched the warship's data logs to locate his lost friend. He discovered that Vos was still being held prisoner in the brig, leading him and Ventress to believe that he had never truly joined Dooku.\nThe two left Skywalker and Dooku on the bridge and rushed to the brig, where they discovered Vos, who had clearly been tortured and starved during his imprisonment. Kenobi released Vos from his constraints, but Ventress sensed a deep and lingering darkness within her former lover. Although the Jedi prisoner attempted to explain that he had only attacked her on Serenno to fool Dooku into thinking he had joined the dark side, Ventress refused to believe him and instead insisted that she could still sense Vos's hatred and he was irredeemably lost to the dark side. The assertion startled Kenobi, as he sensed no such darkness in his Jedi comrade. His attempts to calm Ventress failed and the Dathomirian attacked her former lover, claiming that he could only be free from the dark side in death. Kenobi jumped to Vos's defense, and the two dueled briefly while the freed prisoner attempted to flee the melee.\nThe spat was interrupted by the dreadnought's battle droid defenders and all three were forced to flee towards the hangar to make their escape. Skywalker rejoined the group during their rush back to the Banshee, but the team soon found themselves trapped within the hangar because the Confederates had changed the access codes for the ray shields and were quickly closing the hangar bay doors. While Ventress attempted to bring the shields down from within the Banshee by entering new codes, Vos left the ship against her protestations, ostensibly to deactivate the shields and open the doors from control consoles within the hangar. The Dathomirian was furious that the Jedi allowed him to exit her ship, as she was certain he was escaping back to Dooku, but to her surprise he quickly returned having accomplished his objective.\nVentress piloted the Banshee out of the open hangar and into space, trailed closely by droid tri-fighters dispatched by Dooku. While Skywalker and Kenobi worked defensive turrets, Ventress deftly avoided blaster fire and discord missiles while insisting that Vos take no part in the effort to protect the ship. She was ultimately able to outmaneuver the droid fighters and jump the Banshee to hyperspace, saving the team and completing their mission. She sat alone in the cockpit until Vos approached her in an attempt to explain his attack on Serenno and apologize. Ventress rebuffed him entirely, insisting that they were no longer partners or lovers and that she would kill him if he did not leave her alone.\nShe flew the group back to the Jedi Temple on Coruscant, where they brought Vos before the Jedi Council. Masters Windu and Yoda expressed their appreciation for Ventress's help and confirmed that they would honor their deal and issue a full pardon for all of her previous crimes. Still convinced that the Jedi were blind to Vos's turn to the dark side, she abruptly left, telling Akar-Deshu on the way out that Vos was not himself in the aftermath of his imprisonment. Before she could finally make it out of the temple, Vos caught up to her and once again attempted to explain himself and offer an apology. Although Ventress was forced to question whether or not she was right about his fall, she ultimately decided that it made no difference; he had returned to the Jedi Order, so their relationship was at an end anyway.\nIn the month following the rescue, still in the final months of the Clone Wars, Ventress returned to a life of solitude but remained conflicted over her relationship with Vos. Seeking some measure of closure, she traveled back to Pantora to visit the bar where she and Vos had first formed their partnership. To her surprise, Vos had also come to the bar in the hope of finding her. He attempted to again explain his attack on Serenno and assuage her concerns that he had truly joined the Sith, but Ventress remained wary and dismissed the consolations. Although she no longer sensed a dark-sided malevolence in him, she knew he had rejoined the Jedi Order and again accepted their vows of non-attachment. Vos, who was still dedicated to Ventress and unwilling to let her pass from his life, insisted that he would leave the Order in the near future, but only after helping the Council defeat Dooku. Against her suspicions, Ventress accepted the promise and the two resumed their affair.\nThe two regularly met in secret on one of Coruscant's large floating parks, where they could find privacy from Vos's Jedi superiors. During one of their rendezvous, Vos informed Ventress that the Jedi had tasked him with completing his original mission: the assassination of Count Dooku. Ventress was shocked and begged that he abandon the mission and flee with her, but Vos was insistent. After a string of blundered missions against the Confederacy, the Jedi Council suspected that Vos had indeed fallen to the dark side and was leaking classified information to Dooku. The mission was their final attempt to discern the truth of his allegiances, although these motives were largely unknown to Ventress. Nevertheless, she insisted that she would join Vos for the attempt once again.\nTogether, Ventress and Vos returned to the Jedi Temple to meet the Council in their Situation Room. Although most of the Jedi present were enraged that Vos would again bring Ventress to the Temple—this time without forewarning—they ultimately accepted her presence and went about the business of planning the attack on Dooku. Kenobi presented Vos and Ventress with data on all current Separatist military activity and Ventress was able to identify the theater that Dooku and General Grievous would take the greatest interest in: Christophsis. She knew that the count had a long-standing vendetta against the crystal planet and even located Dooku's orbiting dreadnought from the Republic's reconnaissance footage. With the Council's approval, Ventress and Vos left the Temple, but the Nightsister suspected they were going to be followed. To her surprise, Vos was pleased with the possibility that they were being tailed, mentioning that he had a plan in mind but that it could not yet be shared with her.\nVos' overall plan was to rescue Dooku only to be led to Darth Sidious and to kill both Sith, but that plan failed when Vos, Dooku, and Ventress crashed on Christophsis. Pursued by the Jedi, Dooku learned of Vos' plan and tried to kill him with Force lightning, but Ventress stood in the way and saved Quinlan's life, at the cost of her own. After Dooku escaped, Ventress' sacrifice helped Vos break the dark side's grip on him completely.\nVentress, now once again on the light side of the Force, died in Vos' arms. Several months later, he and Obi-Wan took her body back to Dathomir where she was laid to rest alongside her sisters in the waters of her village, making tendrils of green mist rise. Vos, followed shortly afterward by Kenobi, began to hear the whispers of the Nightsisters' voices, welcoming their lost sister back home. In fact, as Vos reached out in the Force to say goodbye to Ventress one last time, he thought he could make out the word \"sister.\" Her lightsaber was laid to rest with her.\nVentress proved to be remembered long after the Clone Wars. Her image was printed upon a playing card included in a set that also used an image of Sidious. During the mutiny on Mon Cala, a group of four stormtroopers were in the middle of a card game, with both the Sidious and Ventress cards in one trooper's hand. However, their game was interrupted when Han Solo and Leia Organa breached the room and stunned the four soldiers. Sometime after the Galactic Civil War's Battle of Endor, she was mentioned by a member of the Whills as someone to be remembered in galactic history.\nAs a child Ventress was kind and caring, but became dark and brooding after the death of her master, Ky Narec. Giving in to rage and resentment, she subsequently spiraled into darkness and developed a strong will to survive. For a time, she heard the voice of Narec in her mind, urging her away from the dark side. However, after learning Narec had been the one who killed Hal'Sted, she rejected his guidance, giving herself fully to her anger.\nKnown to be quick to anger, Ventress could easily be infuriated, such as when her formidable lightsaber skills were described to her as those of an amateur by Luminara Unduli. Despite her quick temper, she was very cunning and swift, allowing her to outsmart most foes.\nVentress could also be vindictive and inconsiderate. After being betrayed, abandoned and nearly killed by Dooku, Ventress desired to kill him and went to the Nightsisters to find a way to defeat her former master. She recruited Savage Opress and treated him like a slave, which ultimately caused him to turn against her.\nAfter becoming a bounty hunter, her attitude softened somewhat, as seen when she allowed Pluma Sodi to return to her people. Likewise, she lost interest in killing some of her former enemies, including Obi-Wan Kenobi and Ahsoka Tano. In fact, she rescued Kenobi from Darth Maul and Opress, more interested in the latter's bounty reward than her previous enmity with the Jedi Master. On the other hand, she helped Tano, as she empathized with the Padawan's situation, likening it to her own with Count Dooku. She also incapacitated a group of clones without seriously harming any of them, and implied that not killing people was her new modus operandi. As she distanced herself more and more from her time under Dooku, Ventress, to highlight her misunderstood status, used a snake as the icon on her bounty hunter armor; they were thought to be evil, even when they were not.\nGlad to have a reason to have a new weapon after losing her red ones on Coruscant, she came to wield a unique lightsaber with a pale yellow blade. The color reassured Ventress that she had indeed left behind her life as a pawn of the Sith. Additionally, its yellow color equally showed her she had not been pushed towards the Jedi; Ventress's lightsaber showed she was no Jedi nor Sith, she was simply herself.\nNeeding to pretend to be a captured Jedi to fool the Ohnaka Gang was not a part she was rather comfortable taking on, but she did so nevertheless, and her yellow lightsaber—the design of which was symbolic of her state of mind—made the act more convincing. Near the end of the war, as she traveled with Quinlan Vos to assassinate Count Dooku, her more compassionate and trusting side was even more strengthened—to the point of her developing a romantic attraction to him, with the two eventually becoming lovers. In the end, she sacrificed herself to save Vos, who was influenced by the dark side, fully redeeming herself into the light. The fact that she died on a mission to assassinate her former mentor was considered ironic, but her actions returned her to the light side of the Force.\nAsajj Ventress was a master of Jar'Kai, a style she acquired after the death of her first master, Ky Narec, taking up his lightsaber alongside her own. Under Count Dooku, the mechanisms in her new curved lightsabers enabled her to combine them into a bizarre, though effective, S-shaped double-bladed weapon known as a split saber. These red blades became her distinctive weapon.\nUnder the tutelage of Dooku, Ventress learned to utilize Form II. However, her technique still was not without its flaws; notably her version was criticized by a temporarily blinded Luminara Unduli as being \"unrefined,\" \"amateurish,\" and \"sloppy.\" By the time of their duel, Ventress had already developed a physical strength to hold up simultaneous bladelocks with multiple duelists at a time, and Ahsoka Tano recognized her as \"too powerful for any one Jedi to fight alone.\"\nVentress proved a match for both Obi-Wan Kenobi and Anakin Skywalker in many of their encounters. On Teth, she disarmed Kenobi—a member of the Jedi Council—who later deprived her of one of her weapons in return. She was able to contend with General Grievous, as she gained the upper hand and cut one of his robotic arms in a lightsaber duel.\nIn one instance, Ventress managed to wield a lightsaber with both hands tied behind her back, all the while fighting off the Ohkona Gang. Assisted by the Force, she detected the direction of blaster bolts and used the blade to deflect them as well as make physical contact with a few pirates. As the Ohnaka Gang came to see during the encounter, Ventress changing her allegiances and lightsaber did nothing to make her less dangerous. She was also, to her surprise, happy to replace her old red lightsabers after spending a time inconvenienced by their loss. She realized the blades had been her last physical link to her time as Dooku's apprentice, and she was pleased to find her new lightsaber produced a pale yellow blade.\nVentress was viewed by Obi-Wan Kenobi as having immense willpower, with more experience in the Force than many Jedi Knights. Darth Sidious himself sensed that the Dathomirian was growing more powerful and feared that his apprentice, Darth Tyranus, would use her to help overthrow him as Dark Lord of the Sith. All of this had been in due part to her close connection with the dark side.\nShe did not often employ the taming beasts power but could successfully use it. Ventress displayed a great aptitude for Force-enhanced jumps, frequently employing them during her duels. She was also skilled with telekinesis, as witnessed when she lifted Captain Rex in the air, while simultaneously choking him. Later, the assassin proved herself capable of Force-choking and telekinetically levitating Skywalker and Kenobi simultaneously, when fueled by her rage, pain and desperation. Shortly after, she used that same power on Ratch and his three men, this time achieving a lethal result. Ventress demonstrated an aptitude for using mind tricks, though Rex was able to avoid her influence when contacting Skywalker.\nVentress also displayed skill in unarmed combat, being able to easily fight a group of Nightbrothers when she was looking for a suitable servant on Dathomir. Her hand-to-hand combat skills were later displayed when she fought Savage Opress and Maul alongside Kenobi, dodging Opress's aggressive blows and striking back with a flurry of punches and kicks until Kenobi returned her lightsaber to her.\nAfter losing her dual red lightsabers to Barriss Offee, Ventress wielded a new, personal lightsaber, which produced a yellow blade from a straight, standard hilt. Holding a fascinating design, the bottom of the lightsaber was a traditional, ridged grip and fully closed off section, which kept the power cell safe. Meanwhile, around three fifths of the hilt was made up by an upper section that was crafted from perforated metal, which left the inner workings of the blade exposed. Nevertheless, that did not appear to make the weapon vulnerable to moisture damage. In effect, the glowing center of the lightsaber appeared as if it was simultaneously vulnerable and safe, remaining a powerful weapon. As such, the yellow lightsaber provided a great deal of information about Ventress's own state of being.\nThe power cell was located at the bottom of the lightsaber, under the ridged grip. The ignition trigger was located right over the grill hilt, which covered the rest of the hilt up to the blade emitter. Typically, Ventress wore the yellow lightsaber out in the open, but—on at least one occasion, the time during the mission to Raxus when she needed to infiltrate Dooku's high society gala—she did need to hide the blade within a dress. Nevertheless, she continued her tradition of being nothing if not practical through its design, as she could easily reach the lightsaber hilt, which was hidden against her upper left thigh, through a side seam.\nThe name \"Ventress\" was suggested by Samuel C. Spitale, naming her after the town of Ventress in the state of Louisiana because it reminded him of \"the voodoo queen\" Marie Laveau. She was created for the 2003 Legends animated series Star Wars: Clone Wars. She reappeared in the second, canonical The Clone Wars series, in which she was voiced by Nika Futterman. Futterman knew only as much as the audience regarding the character and for her portrayal simply assumed that Ventress had a difficult childhood.\nHer design originated as concept art by Dermot Power for a potential female Sith Lord during the development of Star Wars: Episode II Attack of the Clones. However, the character was abandoned in favor of Count Dooku. Power wanted her earlier designs to look almost as if she was a samurai. The concept art can be seen in The Art of Star Wars Episode II: Attack of the Clones.\nVentress' costume at the beginning of the Clone Wars episode \"Nightsisters\" was a direct recreation of the outfit she wore in her initial concept art and early Legends appearances. In Legends, she first encountered Anakin Skywalker during a duel on Yavin 4, while Skywalker and Kenobi's first encounter with Ventress in canon was part of a mission to Cato Neimoidia in the novel Brotherhood. However, author Mike Chen revealed that Skywalker's mention of fighting other agents of Dooku by that point can be read as a reference to the Yavin 4 duel; as Chen explained, the duel can still have happened in canon, but Skywalker was unable to see his opponent was Ventress because of the rain and darkness around them. Indeed, in Brotherhood, Skywalker also notes that he thinks he has seen Ventress's fanblade starfighter before, and Ventress displays a familiarity with him by revealing that she knows his name, much to Skywalker's surprise.\nChris Glenn designed her costume for the episode \"Bounty.\" The outfit was accented with leggings with a pattern that resembled the red piping on Han Solo's trousers. The shoulder plate of the costume had an illustration of a black snake that represented Ventress' character as a misunderstood creature that is commonly assumed to be dangerous. The helmet worn by Ventress in the Clone Wars episode \"To Catch a Jedi\" was designed by Dave Filoni, Chris Glenn, and Darren Marshall.\nDark Disciple, the 2015 novel focusing on the character, is based upon eight episodes planned for the unfinished seventh and eighth seasons of The Clone Wars. The first illustration showing Ventress with her hair grown out was also developed for the series. Dave Filoni explained Ventress' shaved head symbolized her loyalty to the Sith philosophy. The Official Star Wars Fact File Part 112 states that Ventress built and designed the yellow lightsaber she wielded in the novel. According to it, after she acquired the kyber crystal under unknown means, the kyber, as always, had taken its color from the emotions of its wielder, which was why it was yellow. However, Ultimate Star Wars, New Edition later confirmed she did indeed secure the yellow lightsaber on the black market, as she had claimed in Dark Disciple.\nVentress was going to be revealed to have survived her fate in Dark Disciple to make an appearance in Star Wars Resistance. In this appearance she would have dueled Supreme Leader Kylo Ren.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Asajj_Ventress",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Brotherhood",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales",
  "/wiki/Choose_Your_Destiny:_A_Clone_Trooper_Mission",
  "/wiki/Worthless",
  "/wiki/Tales_of_Villainy:_Give_%26_Take",
  "/wiki/The_Lost_Nightsister",
  "/wiki/Dark_Vengeance:_The_True_Story_of_Darth_Maul_and_His_Revenge_Against_the_Jedi_Known_as_Obi-Wan_Kenobi",
  "/wiki/Halcyon_Legacy_1",
  "/wiki/Halcyon_Legacy_3",
  "/wiki/Lightsabers_and_Jedi_Equipment",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Scum_and_Villainy_Conversion_Kit",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_177",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Dathomir",
  "/wiki/50_BBY",
  "/wiki/19_BBY",
  "/wiki/Christophsis",
  "/wiki/Zabrak",
  "/wiki/Dathomirian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Mother_Talzin%27s_clan",
  "/wiki/Jedi_Order",
  "/wiki/Sith",
  "/wiki/Sith_assassin",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Nightsisters",
  "/wiki/Krayt%27s_Claw",
  "/wiki/Ky_Narec",
  "/wiki/Jedi",
  "/wiki/Dooku",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Quinlan_Vos",
  "/wiki/Slavery",
  "/wiki/Padawan",
  "/wiki/Bounty_hunter",
  "/wiki/Standard_decade",
  "/wiki/Galactic_Republic",
  "/wiki/Reproduction",
  "/wiki/Force-sensitive",
  "/wiki/Witch",
  "/wiki/Mother_(title)",
  "/wiki/Talzin",
  "/wiki/Planet",
  "/wiki/Hal%27Sted",
  "/wiki/Rattatak",
  "/wiki/Death",
  "/wiki/Weequay",
  "/wiki/Pirate",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi_training",
  "/wiki/The_Force",
  "/wiki/Warlord",
  "/wiki/Osika_Kirske",
  "/wiki/Gladiator",
  "/wiki/Sith_Lord",
  "/wiki/Count",
  "/wiki/Dark_Acolyte",
  "/wiki/Sith_apprentice",
  "/wiki/The_galaxy",
  "/wiki/Clone_Wars",
  "/wiki/Commander",
  "/wiki/Confederacy_military",
  "/wiki/Assassin",
  "/wiki/Lightsaber",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Rotta",
  "/wiki/Hutt",
  "/wiki/Rescue_on_the_Tranquility",
  "/wiki/Nute_Gunray",
  "/wiki/Kamino",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Darth_Sidious",
  "/wiki/Battle_of_Sullust",
  "/wiki/Mission_to_Serenno_(Nightsisters)",
  "/wiki/Nightbrothers",
  "/wiki/Savage_Opress",
  "/wiki/Showdown_at_Toydaria",
  "/wiki/Droid",
  "/wiki/Army",
  "/wiki/Battle_of_Dathomir",
  "/wiki/Skirmish_above_Raydonia",
  "/wiki/Maul",
  "/wiki/Ahsoka_Tano",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Imperial_Palace",
  "/wiki/Mission_to_Raxus_Secundus",
  "/wiki/Rescue_of_Quinlan_Vos",
  "/wiki/Standard_month",
  "/wiki/Torture",
  "/wiki/Jedi_High_Council",
  "/wiki/Second_battle_of_Christophsis",
  "/wiki/Force_lightning",
  "/wiki/Water",
  "/wiki/Nightsister_lair",
  "/wiki/Standard_year",
  "/wiki/Magick",
  "/wiki/Asajj_Ventress%27s_mother",
  "/wiki/Siniteen",
  "/wiki/Homeworld",
  "/wiki/44_BBY",
  "/wiki/Force_power",
  "/wiki/Telekinesis",
  "/wiki/Time",
  "/wiki/Lightsaber_combat",
  "/wiki/Vollick",
  "/wiki/Serenno",
  "/wiki/Noble",
  "/wiki/Darth",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Dark_Jedi",
  "/wiki/Asajj_Ventress%27_lightsabers",
  "/wiki/Unidentified_Padawan_(Dooku)",
  "/wiki/23_BBY",
  "/wiki/Castle_Serenno",
  "/wiki/Asajj_Ventress%27s_lightsabers",
  "/wiki/Mission_to_assassinate_Jenza",
  "/wiki/Jenza",
  "/wiki/Datapad",
  "/wiki/Dooku%27s_journal",
  "/wiki/Glute",
  "/wiki/Crolute",
  "/wiki/Republic_Intelligence",
  "/wiki/Raz_Fellidrone",
  "/wiki/Officer",
  "/wiki/Galaxy",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Battle_of_unidentified_planet_(Tholme_and_Ventress)",
  "/wiki/Tholme",
  "/wiki/Human",
  "/wiki/Jedi_General",
  "/wiki/Mission_to_Cato_Neimoidia_(Kenobi_and_Skywalker)",
  "/wiki/Galactic_Senate",
  "/wiki/Hyperspace",
  "/wiki/Hyperspace_route",
  "/wiki/Core_Worlds",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Hutt_Clan",
  "/wiki/Whorm_Loathsom",
  "/wiki/Admiral",
  "/wiki/Trench",
  "/wiki/Battle_droid",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Fleet",
  "/wiki/Clone_trooper",
  "/wiki/Sergeant",
  "/wiki/Slick",
  "/wiki/Lieutenant",
  "/wiki/Droid_brain",
  "/wiki/T-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/TJ-55",
  "/wiki/Christophsis_Republic_base",
  "/wiki/Christophsis_Separatist_headquarters",
  "/wiki/Lightsaber_duel",
  "/wiki/Octuptarra_tri-droid",
  "/wiki/C-9979_landing_craft",
  "/wiki/Tatooine",
  "/wiki/Trident-class_assault_ship",
  "/wiki/Sail_barge",
  "/wiki/Skiff",
  "/wiki/Desert",
  "/wiki/B%27omarr_Order_Monastery",
  "/wiki/Teth",
  "/wiki/Wild_Space",
  "/wiki/Hutt_Space",
  "/wiki/Advanced_Recon_Force_Scout_Trooper",
  "/wiki/Togruta",
  "/wiki/Battle_of_Teth",
  "/wiki/Protocol_droid",
  "/wiki/4-A7",
  "/wiki/Cruiser",
  "/wiki/Squadron",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Starfighter",
  "/wiki/Cloning",
  "/wiki/Blast_door",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/OOM_command_battle_droid",
  "/wiki/Blaster",
  "/wiki/Force_choke",
  "/wiki/Mind_trick",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/DSD1_dwarf_spider_droid",
  "/wiki/Can-cell",
  "/wiki/B1-series_battle_droid",
  "/wiki/Crime_lord",
  "/wiki/Mission_to_Jabba%27s_Palace_(Clone_Wars)",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Hutt_Clan%E2%80%93Republic_treaty",
  "/wiki/File:SidiousDooku-CoD.ogg",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Spy",
  "/wiki/Toydarian",
  "/wiki/Moon",
  "/wiki/Rugosa",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/King",
  "/wiki/Katuunko",
  "/wiki/Toydaria",
  "/wiki/Ambush_on_Rugosa",
  "/wiki/Munificent-class_star_frigate",
  "/wiki/Hologram",
  "/wiki/Frigate",
  "/wiki/Star_system",
  "/wiki/Consular-class_cruiser_(Charger_c70_retrofit)",
  "/wiki/Escape_pod",
  "/wiki/Battalion",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Armored_Assault_Tank_Mk_I",
  "/wiki/224",
  "/wiki/Droideka",
  "/wiki/Thief%27s_Eye",
  "/wiki/Punworcca_116-class_interstellar_sloop",
  "/wiki/Cyborg",
  "/wiki/Rishi_system",
  "/wiki/Listening_post",
  "/wiki/Kamino_system",
  "/wiki/Rishi_Station",
  "/wiki/Rishi_Moon",
  "/wiki/Rishi",
  "/wiki/Defense_of_Rishi_Station",
  "/wiki/Mission_to_Skytop_Station",
  "/wiki/Skytop_Station",
  "/wiki/Viceroy",
  "/wiki/Trade_Federation",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Rodia",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Neimoidian",
  "/wiki/Tranquility",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Star_Destroyer",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Faro_Argyus",
  "/wiki/Senate_Commando",
  "/wiki/Droch-class_boarding_ship",
  "/wiki/Hangar",
  "/wiki/Comlink",
  "/wiki/327-T",
  "/wiki/Thermal_detonator",
  "/wiki/Ray_shield",
  "/wiki/Luminara_Unduli",
  "/wiki/CC-1004",
  "/wiki/Turbolift",
  "/wiki/Halcyon",
  "/wiki/Star_Cruiser",
  "/wiki/Lannik_(species)",
  "/wiki/Zast_Tri%27vak",
  "/wiki/Ginivex-class_fanblade_starfighter",
  "/wiki/First_Battle_of_Felucia",
  "/wiki/Second_Battle_of_Felucia",
  "/wiki/Felucia",
  "/wiki/Battle_of_Khorm",
  "/wiki/Khorm",
  "/wiki/Wolffe",
  "/wiki/Plo_Koon",
  "/wiki/Eye",
  "/wiki/AQ-series_battle_droid",
  "/wiki/Blockade",
  "/wiki/Orbit",
  "/wiki/Kaminoan",
  "/wiki/Tipoca_City",
  "/wiki/Clone_DNA_room",
  "/wiki/Barracks",
  "/wiki/Battle_of_Kamino",
  "/wiki/501st_Legion",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Colt",
  "/wiki/Jango_Fett",
  "/wiki/Kaminoan_flight_pod",
  "/wiki/Republic_military_enhancement_bill",
  "/wiki/Sullust_system",
  "/wiki/TJ-912",
  "/wiki/Wullf_Yularen",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Recusant-class_light_destroyer",
  "/wiki/Sullust",
  "/wiki/Droid_tri-fighter",
  "/wiki/Trident_group_one",
  "/wiki/Trident_group_two",
  "/wiki/Flagship",
  "/wiki/Resolute",
  "/wiki/Engine",
  "/wiki/Deflector_shield_generator",
  "/wiki/Turbolaser",
  "/wiki/Bridge_(starship)",
  "/wiki/Delta-7B_Aethersprite-class_light_interceptor",
  "/wiki/Obi-Wan_Kenobi%27s_Delta-7B_Aethersprite-class_light_interceptor",
  "/wiki/Anakin_Skywalker%27s_Delta-7B_Aethersprite-class_light_interceptor",
  "/wiki/Cockpit",
  "/wiki/Hyena-class_Droid_Fighter/Bomber",
  "/wiki/Raider_(salvage_freighter)",
  "/wiki/Ratch",
  "/wiki/Twi%27lek",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Nightsisters%27_altar",
  "/wiki/Water_of_Life",
  "/wiki/Magical_ichor",
  "/wiki/Shaman",
  "/wiki/Karis",
  "/wiki/Naa%27leth",
  "/wiki/Poison",
  "/wiki/Dooku%27s_lightsaber",
  "/wiki/Nightsister_speeder",
  "/wiki/Nightbrother_village",
  "/wiki/Chief",
  "/wiki/Viscus",
  "/wiki/Selection",
  "/wiki/Feral",
  "/wiki/Test_of_Fury",
  "/wiki/Nightbrother_arena",
  "/wiki/Challenge_of_blindness",
  "/wiki/Force_Dash",
  "/wiki/Devaron_massacre",
  "/wiki/Halsey",
  "/wiki/Knox",
  "/wiki/Devaron",
  "/wiki/HH-87_Starhopper",
  "/wiki/Nightsister_energy_bow",
  "/wiki/Defoliator",
  "/wiki/Army_of_the_Dead",
  "/wiki/Zombie",
  "/wiki/Daka",
  "/wiki/Defoliator_Deployment_Tank",
  "/wiki/Luce",
  "/wiki/Spaceport",
  "/wiki/Mos_Eisley",
  "/wiki/Alcohol",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Oked",
  "/wiki/Cantina",
  "/wiki/Trandoshan",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Theelin",
  "/wiki/Latts_Razzi",
  "/wiki/Safe_cargo_objective",
  "/wiki/Dengar",
  "/wiki/C-21_Highsinger",
  "/wiki/Boba_Fett",
  "/wiki/Hound%27s_Tooth",
  "/wiki/Quarzite",
  "/wiki/Skyhook",
  "/wiki/Quarzite_space_station",
  "/wiki/Belugan",
  "/wiki/Major",
  "/wiki/Rigosso",
  "/wiki/Otua_Blank",
  "/wiki/Atmosphere",
  "/wiki/Otua_Blank%27s_stronghold",
  "/wiki/Subtram",
  "/wiki/Kage_Warriors",
  "/wiki/Milodon",
  "/wiki/Krismo_Sodi",
  "/wiki/Pluma_Sodi",
  "/wiki/Credit",
  "/wiki/Transmitter",
  "/wiki/Raydonia",
  "/wiki/Raydonian_settlement",
  "/wiki/Terrapin-class_Bulk_Tanker",
  "/wiki/Airlock",
  "/wiki/Corner_of_twelfth_and_G",
  "/wiki/Level_1312",
  "/wiki/Coruscant_Underworld",
  "/wiki/Lacezzi_Macran",
  "/wiki/Level_1313",
  "/wiki/Meysor",
  "/wiki/Sarlacc",
  "/wiki/Onderonian_Civil_War",
  "/wiki/Kalleran",
  "/wiki/Devaronian",
  "/wiki/Devaronian_bail_bondsman",
  "/wiki/Escape_from_the_Republic_military_base",
  "/wiki/Zygerrian",
  "/wiki/Limb",
  "/wiki/Vibro-knife",
  "/wiki/Terminal_24",
  "/wiki/Underworld_portal",
  "/wiki/Bail_bondsman",
  "/wiki/Holobooth",
  "/wiki/Barriss_Offee",
  "/wiki/Probe_droid",
  "/wiki/Abandoned_munitions_warehouse",
  "/wiki/Level_1315",
  "/wiki/Tooka",
  "/wiki/NM-K_reconstitutor",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Gunship",
  "/wiki/Banshee_(starship)",
  "/wiki/Ventress%27s_lightsaber",
  "/wiki/Black_market",
  "/wiki/Pyke_Syndicate",
  "/wiki/Majordomo",
  "/wiki/Fife",
  "/wiki/Koorivar",
  "/wiki/Merchant",
  "/wiki/Sheb_Valaad",
  "/wiki/Smuggler",
  "/wiki/Steady_On",
  "/wiki/Ohnaka_Gang",
  "/wiki/Blood_Bone_Order",
  "/wiki/Opportunity",
  "/wiki/Pantoran",
  "/wiki/Lassa_Rhayme",
  "/wiki/Medical_bay",
  "/wiki/Florrum",
  "/wiki/Hondo%27s_complex",
  "/wiki/Jiro",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Tevraki_whiskey",
  "/wiki/Atrocity_on_Mahranee",
  "/wiki/Mahranee",
  "/wiki/Rang_Clan",
  "/wiki/Volpai",
  "/wiki/Moregi",
  "/wiki/Pantoran_City",
  "/wiki/Orto_Plutonia",
  "/wiki/Pantora",
  "/wiki/Macrobinoculars",
  "/wiki/Speeder",
  "/wiki/Kiffar",
  "/wiki/Psychometry",
  "/wiki/Moregi%27s_wife",
  "/wiki/Moregi%27s_son",
  "/wiki/Repulsorcraft",
  "/wiki/Speeder_bike",
  "/wiki/Standard_minute",
  "/wiki/Whiskey",
  "/wiki/Spice",
  "/wiki/Pyke",
  "/wiki/High_fortress_of_the_Pyke_Syndicate",
  "/wiki/Oba_Diah",
  "/wiki/Marg_Krim",
  "/wiki/Tezzka_Krim",
  "/wiki/Laalee",
  "/wiki/Vram_(Pyke)",
  "/wiki/Black_Sun",
  "/wiki/Black_Sun_fortress",
  "/wiki/Mustafar",
  "/wiki/Volcano",
  "/wiki/Lava_flea",
  "/wiki/The_Last_Resort",
  "/wiki/Falleen",
  "/wiki/Refresher",
  "/wiki/Ziton_Moj",
  "/wiki/Interceptor-class_frigate",
  "/wiki/Taming_beasts",
  "/wiki/Snake",
  "/wiki/The_Sleeper",
  "/wiki/Nightsister_adulthood_ritual",
  "/wiki/Ocean",
  "/wiki/A99_aquata_breather",
  "/wiki/Sumdin",
  "/wiki/Gossam",
  "/wiki/Raxus_Secundus",
  "/wiki/Tion_Hegemony",
  "/wiki/Raxulon",
  "/wiki/Tamwith_Bay",
  "/wiki/Raxian_Humanitarian_Award",
  "/wiki/Alderaanian_wine",
  "/wiki/Kyuzo",
  "/wiki/Embo",
  "/wiki/Mission_to_Serenno_(Krayt%27s_Claw)",
  "/wiki/Slave_I",
  "/wiki/Carannia_Spaceport",
  "/wiki/Mahran",
  "/wiki/Akar-Deshu",
  "/wiki/Jedi_Council_Chamber",
  "/wiki/Mace_Windu",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Shaak_Ti",
  "/wiki/Taris",
  "/wiki/Cloaking_device",
  "/wiki/Discord_missile",
  "/wiki/Destruction_of_the_Separatist_supply_storage_base",
  "/wiki/Destruction_of_the_Vanqor_listening_station",
  "/wiki/Unidentified_Whill",
  "/wiki/Mutiny_on_Mon_Cala",
  "/wiki/Stormtrooper",
  "/wiki/Han_Solo",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Galactic_Civil_War",
  "/wiki/Battle_of_Endor",
  "/wiki/Second_Whill_(From_a_Certain_Point_of_View)",
  "/wiki/Whills",
  "/wiki/Timeline_of_galactic_history",
  "/wiki/Jar%27Kai",
  "/wiki/Double-bladed_lightsaber",
  "/wiki/Split_saber",
  "/wiki/Form_II",
  "/wiki/Samuel_C._Spitale",
  "/wiki/2003",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Nika_Futterman",
  "/wiki/Dermot_Power",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/The_Art_of_Star_Wars_Episode_II:_Attack_of_the_Clones",
  "/wiki/Nightsisters_(episode)",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Duel_on_Yavin_4",
  "/wiki/Mike_Chen_(author)",
  "/wiki/Chris_Glenn",
  "/wiki/Bounty_(episode)",
  "/wiki/To_Catch_a_Jedi",
  "/wiki/Dave_Filoni",
  "/wiki/Darren_Marshall",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_112",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Dark_Disciple",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Supreme_Leader",
  "/wiki/Ben_Solo",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_5",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales_1",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales_2",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales_3",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales_5",
  "/wiki/The_Hidden_Enemy",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Ambush",
  "/wiki/Sharing_the_Same_Face",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Rookies",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Lair_of_Grievous",
  "/wiki/A_Jedi%27s_Duty",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Brain_Invaders",
  "/wiki/ARC_Troopers",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_Adventures_(2020)_12",
  "/wiki/Hyperspace_Stories_5",
  "/wiki/Monster",
  "/wiki/Witches_of_the_Mist",
  "/wiki/Massacre",
  "/wiki/Brothers",
  "/wiki/Revenge_(episode)",
  "/wiki/Sisters",
  "/wiki/Age_of_Republic_Special_1",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Kindred_Spirits",
  "/wiki/Star_Wars_Insider_159",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!_(audiobook)",
  "/wiki/Obi-Wan_4",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_1",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_3",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_5",
  "/wiki/Star_Wars_(2015)_47",
  "/wiki/Doctor_Aphra_(2020)_22",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_Ashcan",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Savi%27s_Workshop",
  "/wiki/Whills_(short_story)",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/Jedi_Training_Academy",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Asajj_Ventress",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Insider_Looks_Back",
  "/wiki/Star_Wars_Insider_150",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Classic_Moment",
  "/wiki/Star_Wars_Insider_155",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_158",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_71",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Star_Wars_Helmet_Collection_42",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Way_of_the_Force",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_18",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_19",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Star_Wars_Helmet_Collection_68",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Star_Wars_Helmet_Collection_77",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/The_Clone_Wars_Begin",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Inside_Intel:_The_Nightsisters",
  "/wiki/Star_Wars_Inside_Intel:_Quinlan_Vos",
  "/wiki/Ships_of_the_Galaxy:_The_Halcyon_Starcruiser",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_BBY",
  "/wiki/Second_Battle_of_Dathomir",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Star_Wars:_Darth_Maul%E2%80%94Son_of_Dathomir",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_3",
  "/wiki/Assassin,_Security,_and_Combat_Droids",
  "/wiki/Cat_and_Mouse",
  "/wiki/The_Grand_Army_of_the_Republic",
  "/wiki/Holocron_Heist",
  "/wiki/Senate_Murders",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle",
  "/wiki/Heir_to_the_Jedi",
  "/wiki/Tarkin_(novel)",
  "/wiki/May_11",
  "/wiki/2022",
  "/wiki/May_12",
  "/wiki/April_3",
  "/wiki/2019",
  "/wiki/September_2",
  "/wiki/2021",
  "/wiki/September_10"
 ]
}