{
 "name": "Asenec",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Crakull"
     ]
    },
    {
     "name": "Born",
     "values": [
      "593 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "244 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Croke"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Asenec was a male Croke from Crakull. A writer and a poet, Asenec was widely discriminated not only because of his species, but also because his poems were considered dark, sickening and offensive.\nOne of the few Crokes to leave the Unknown Regions and become known in the greater galaxy, Asenec was active until his death in 244 BBY and found work as a poet. Literary critics reviled his work: Asenec appeared to write with the explicit aim of revolting and offending his audience, with his themes celebrating revenge, the squeezing of ooze, tyrannical atrocities, and blasted wastelands.\nThe Croke poet made a single contribution to The Despotica, the vast literary collection of plays and poems on Xim the Despot, entitled \"The Gleam of Kiirium\". The poem departed from his usual themes: while it did celebrate the Despot, Ximologists like S. V. Skynx remarked that it also carried a sense of romantic sadness. The poem was rumored to have been composed by Asenec on his deathbed, and some critics went as far to suggest that it was so unlike his other poems that it could not in fact be by him at all.\nThe extreme animosity and offensiveness of much of Asenec's work led him to become one of the most banned authors in the galaxy. Even centuries after his death, the publishers of The Despotica refused to include \"The Gleam of Kiirium\" for fear of endorsing him. Despite being often censored, it was rumored that Asenec's misanthropy and spite had earned him the literary sympathy of Darth Sidious.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Crakull",
  "/wiki/593_BBY",
  "/wiki/244_BBY/Legends",
  "/wiki/Croke",
  "/wiki/Gender/Legends",
  "/wiki/Professor/Legends",
  "/wiki/S._V._Skynx",
  "/wiki/Author/Legends",
  "/wiki/Poet/Legends",
  "/wiki/Species/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/The_Despotica",
  "/wiki/Xim/Legends",
  "/wiki/The_Gleam_of_Kiirium",
  "/wiki/Ximology",
  "/wiki/Palpatine/Legends",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut"
 ]
}