{
 "name": "Asgar_Ro",
 "display_name": "Asgar Ro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ro homeworld"
     ]
    },
    {
     "name": "Died",
     "values": [
      "242 BBY",
      "No-Space"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Evereni"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Slate-gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ro family",
      "Nihil"
     ]
    }
   ]
  }
 ],
 "content": "Asgar Ro was a male Evereni who held the title of Eye of the Nihil in the Nihil marauder group. Along with his son, Marchion, and mother, Shalla, Ro abandoned his homeworld of Everon to take control of and reorganize the Nihil, at that point a small gang, utilizing the Paths generated through hyperspace by Mari San Tekka to undertake operations.\nRo occupied the position of the Eye, a counter-power to the three Tempest Runners who controlled the Nihil, after killing his mother. During his time as the Eye, Ro lead the Nihil to greatly expand using his hyperspace Paths. Ro was eventually killed by a disgruntled Lourna Dee, and kicked by his son during his dying moments. Marchion would go on to replace his father as the Eye of the Nihil, expanding the group's scope even further.\nAsgar Ro was a member of the Evereni species, hailing from the storm-planet Everon. The Evereni abandoned their homeworld after it was ravaged by war and widespread strife. They were a distrusting people, which lead to Asgar and his mother Shalla aligning themselves with the Nihil, a  marauder group in the galaxy. Shalla built up the Nihil, and secretly used the elderly Hyperspace savant Mari San Tekka to create the Paths, which allowed for incredibly fast travel through the use of the unorthodox and otherwise inaccessible routes.\nAs time went on, Asgar became upset at how long his mother was waiting to combat the Galactic Republic and the Jedi. Onboard the Gaze Electric, he challenged Shalla's waiting, leading to an argument that lead to him pushing her over a railing to her death. After the death of his mother at his own hands, Ro brought his son down to the rest of the Nihil in No-Space. There he met with the Tempest Runners, making a wager for everything he owned, including the Gaze Electric, if they could shoot down his son in a single fighter, using however many fighters they wanted. The two senior Tempest Runners, Pan Eyta and Kassav Milliko, eagerly accepted this wager and sent up scores of fighters against the young Marchion. As the fighters approached to engage, Ro called upon Mari San Tekka to transmit Paths to Marchion, allowing him to jump into Hyperspace at unpredictable and seemingly random locations. This confused the Nihil and lead to Marchion destroying many of their fighters. Ro tried to command his son to stop, but Marchion didn't listen and killed more than he wanted before finally stopping at a threat on his own life. This served as a demonstration of the Path engine, which Ro used as leverage to keep the Nihil loyal to his family alone, if they wanted Paths. Asgar took the role of the Eye of the Nihil for himself after making this deal, even pondering adding a third Tempest.\nDuring his time as the Eye, one Tempest runner tried to circumvent the system. Ro had the other Tempests summoned to the Great Hall of the Nihil, in No-Space, where he ordered his execution. Following this event, Ro promoted a young Storm named Lourna Dee to replace him. For this action along with many others, Ro was widely seen, including by his own son, as a despot. As the secretive guardian of the Paths which allowed the pirates to expand their power throughout the Outer Rim Territories, the Eye's power was often questioned by the unruly Tempest Runners, but his position held a double vote which allowed him to break deadlocks and steer the decisions the way he desired. In addition, Ro implemented the Rule of Three, a system which deviced the distribution of the spoils from Nihili raids among the leadership. One third of the riches went to the Strikes, Storms and Clouds which made up the three Tempests of the Nihil. The second third would go the Tempest Runners, who orchestrated the raids. And, should the Nihil make use of the Paths that Ro had delivered to them, he received his own third.\nThe Tempest Runners Pan Eyta and Kassav Milliko often chafed under Ro's domineering hand and wanted to return the Nihil exclusively to their authority and retain the third cut they had to surrender for use of the Paths. Enlisting Dee's help, they planned to assassinate Ro and use his son, whom they viewed as a weakling they could control, to retain control of the Paths. However, Dee instead contacted Ro to inform him of their plan. However, Ro ridiculed Dee's suggestion that they eliminate Eyta and Milliko together and restructure the Nihil with themselves in command, instead declaring that the Paths would remain his alone. Instead, Ro planned to convince the two Tempest Runners to launch a coordinated attack against Shili, the homeworld of the powerful Togruta, an attack which would be designed to fail and force the two runners to regain the respect of their Tempests. Consumed by the leadership challenges, they would be unable to turn on Ro and would need his assistance to gain the Paths for raids to restore their credentials.\nHowever, Ro had underestimated Dee, who was angered that he had rejected her proposed plan. Unbeknownst even to her fellow Tempest Runners, Dee found Ro alone in the Great Hall and stabbed him, leaving him to bleed out. He was found by Marchion whom he begged for help. His son, angry at the abuse he had taken from his father all his life, took pleasure in kicking him viciously, making his death all the more painful. Marchion, who suspected that one of the Tempest Runners had murdered his father, succeeded him as the Eye of the Nihil.\nAfter his death, Marchion took Asgar's helmet, and first put it on in a meeting with the Tempest Runners, claiming the title for himself, and that he had a vision for the Nihil. In later years, Asgar's spectre haunted Marchion, as his son's mind often dwelled on the imagined thoughts and opinions of his father as he led the Nihil against the Republic and Jedi.\nAsgar Ro was first mentioned in the novel The High Republic: Light of the Jedi, written by Charles Soule and released in 2021. He later debuted in flashbacks in the 2021 novel The High Republic: The Rising Storm, written by Cavan Scott. In the audio drama The High Republic: Tempest Runner, Ro is voiced by Jonathan Davis.\nAsgar Ro was first pictured in a flashback in the 2022 comic The High Republic: Eye of the Storm 1, written by Charles Soule, illustrated by Guillermo Sanna and Jim Campbell, and published by Marvel Comics on January 12, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ro_(disambiguation)",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Ro_homeworld",
  "/wiki/242_BBY",
  "/wiki/No-Space",
  "/wiki/Evereni",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Ro_family",
  "/wiki/Nihil",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Pirate",
  "/wiki/Marchion_Ro",
  "/wiki/Shalla_Ro",
  "/wiki/Homeworld",
  "/wiki/Everon",
  "/wiki/Path",
  "/wiki/Hyperspace",
  "/wiki/Mari_San_Tekka",
  "/wiki/Tempest_Runner",
  "/wiki/Death",
  "/wiki/Lourna_Dee",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi",
  "/wiki/Gaze_Electric",
  "/wiki/Pan_Eyta",
  "/wiki/Kassav_Milliko",
  "/wiki/Path_engine",
  "/wiki/Tempest",
  "/wiki/Great_Hall_of_the_Nihil",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Strike",
  "/wiki/Storm_(rank)",
  "/wiki/Cloud_(rank)",
  "/wiki/Shili",
  "/wiki/Togruta",
  "/wiki/Parent",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Charles_Soule",
  "/wiki/2021",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Cavan_Scott",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Jonathan_Davis",
  "/wiki/2022",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_1",
  "/wiki/Guillermo_Sanna",
  "/wiki/Jim_Campbell",
  "/wiki/Marvel_Comics",
  "/wiki/January_12",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_2",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_The_Nihil_Hierarchy",
  "/wiki/252_BBY",
  "/wiki/Standard_year",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/232_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Xanaven"
 ]
}