{
 "name": "Ashana",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Twisted Rancor Trio"
     ]
    }
   ]
  }
 ],
 "content": "Ashana was Human female singer from Taris and sister of Elinda, the original lead singer of The Twisted Rancor Trio.\nIn 3956 BBY, Ashana's sister Elinda was a rising star as the singer of the Twisted Rancor Trio band founded by Gilthos Uksaris. Elinda's fans admired her voice, and the band at last attracted the attention of the local, powerful businessman Davik Kang, who invited them to play at his estate. Kang, however, was actually the head of the criminal organization the Exchange, and Elinda feared the consequences should Kang somehow be malcontent with her performance or should she even have dealings with him at all. Such was her apprehension that in spite of Uksaris's conviction that Kang's sponsorship was too grand of an opportunity to reject, Elinda abandoned the band altogether.\nWithout a singer, the Twisted Rancor Trio seemed to be at its end, but on the eve of the scheduled performance, Uksaris recruited Ashana as a replacement for her sister. By Uksaris's own admission, the plan was risky given Ashana's untested singing and the last minute recruitment without prior rehearsals, and should Ashana fail to live up to Elinda's reputation, the band could incur the notorious wrath of Kang, putting their lives in jeopardy. Uksaris, however, believed that the scheme was still worth the risks, hoping that should they succeed, Kang would sign them up on a great touring contract.\nAshana only appears as a hologram in the video game Star Wars: Knights of the Old Republic, if the player, as Revan, visits an apartment in the Lower City Apartment containing a delivery to Uksaris secured by a Holo-Sec Corp anti-theft explosive. To safely disarm the trap, the player must activate all six holoprojectors of the band members surrounding the footlocker in order of their recruitment. The solution to this puzzle is given in a datapad resting on a nearby desk that contains a draft of Guts and Glory: A Chronicle of The Amazing Story of The Twisted Rancor Trio, a brief narrative of the history of the band authored by Gilthos Uksaris.\nSince the incomplete chronicle ends on the eve of the scheduled performance when Ashana is recruited, her success or failure is unknown.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/The_Twisted_Rancor_Trio",
  "/wiki/Musician/Legends",
  "/wiki/Elinda",
  "/wiki/3956_BBY",
  "/wiki/Gilthos_Uksaris",
  "/wiki/Davik_Kang",
  "/wiki/Davik_Kang%27s_estate",
  "/wiki/Exchange",
  "/wiki/Hologram/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Revan/Legends",
  "/wiki/Lower_City_Apartments",
  "/wiki/Lower_City",
  "/wiki/Holo-Sec_Corp",
  "/wiki/Holo-Sec_Corp_anti-theft_explosive",
  "/wiki/Holoprojector/Legends",
  "/wiki/Footlocker/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Guts_and_Glory:_A_Chronicle_of_The_Amazing_Story_of_The_Twisted_Rancor_Trio"
 ]
}