{
 "name": "Ashii Nermani",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial HoloVision",
      "Imperial HoloVision"
     ]
    }
   ]
  }
 ],
 "content": "Ashii Nermani was a female Human who worked for the Galactic Empire's Imperial HoloVision as of 0 ABY. One of the most popular Imperial HoloVision newscasters, Nermani reported that year on the attacks by a group of Alliance pirates and terrorists in the Core Worlds' Ringali Shell, and the death of Imperial Advisor Coh Veshiv.\nA female Human, Ashii Nermani worked for Imperial HoloVision, a news agency that the Galactic Empire occasionally used for propaganda purposes. As of 0 ABY, at the time the Empire was fighting the Alliance to Restore the Republic in the Galactic Civil War, she was one of the most popular newscasters. That year, Nermani was the first to break the story that Venslas Beeli was a privateer working for the Alliance in a report on the attacks that a group of Alliance terrorists and pirates, led by Captain Beeli, were carrying out on innocent civilians in the Core Worlds' Ringali Shell; the group, a captured pirate band known as the Solar Terrors, was actually forced by the Imperials to commit the crimes, as the Imperials wanted to draw out the Far Orbit, an Alliance privateering frigate. In that same report, Nermani covered up the fact that Imperial Advisor Coh Veshiv had been captured by the same Far Orbit, by informing the public that the advisor had died when his shuttle hit a wayward asteroid.\nNermani had hair of a lighter shade, and wore earrings at the time of her report on the Alliance terrorists, as well as a loose garment with a brooch on it that she wore on her upper body.\nAshii Nermani first appeared in the adventure scenario The Rival, published in 1998's The Far Orbit Project, by Timothy S. O'Brien. The Far Orbit Project was a supplement to West End Games' Star Wars: The Roleplaying Game and had the same theme of the previous publication, Pirates \u0026 Privateers, as it followed the privateering vessel Far Orbit. Nermani's report is intercepted by the players, which leads them to go and track down the pirates that are sullying their reputation and that of the Alliance.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_HoloVision",
  "/wiki/0_ABY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Solar_Terrors",
  "/wiki/Pirate/Legends",
  "/wiki/Terrorist/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Ringali_Shell",
  "/wiki/Death/Legends",
  "/wiki/Imperial_Advisor",
  "/wiki/Coh_Veshiv",
  "/wiki/Propaganda/Legends",
  "/wiki/Time/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Venslas_Beeli",
  "/wiki/Privateer/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Far_Orbit",
  "/wiki/Frigate/Legends",
  "/wiki/Capture_of_Coh_Veshiv",
  "/wiki/Advisor/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Color/Legends",
  "/wiki/The_Rival",
  "/wiki/1998",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/Timothy_S._O%27Brien",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Standard_week/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}