{
 "name": "Ashu",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mahran"
     ]
    },
    {
     "name": "Planet(s) of origin",
     "values": [
      "Mahranee"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Extinction of family name",
     "values": [
      "19 BBY",
      "during the atrocity on Mahranee"
     ]
    }
   ]
  }
 ],
 "content": "The Ashu were a prominent family of Mahran on the planet Mahranee during the Clone Wars, a conflict between the Galactic Republic and Confederacy of Independent Systems, comprised of many noted warriors and statesmen.\nFrom the planet Mahranee, this Mahran family was comprised of a warrior and statesmen path, of which family members could choose one to follow. Its members included Rakshu and her three children: Firstborn Ashu-Nyamal who followed the warrior path, Secondborn Teegu who easily soothed quarrels, and Thirdborn artist-to-be Kamu.\nIn 19 BBY during the Clone Wars between the Confederacy of Independent Systems and Galactic Republic, the Separatists targeted Mahranee for its plentiful resources and Republic support. They attempted to win over the planet with false promises, which the government refused. The Separatists launched a mass genocide of the Mahran known as the Atrocity on Mahranee. Sent by the Republic, the family was evacuated on the Consular-class cruiser of Jedi General Chubor, crewed by clone troopers younger than Nya. However, the ship was attacked by a Separatist fleet commanded by Count Dooku, Separatist Head of State who Nya was familiar with. Chubor pleaded with Dooku to spare the lives of all the innocent families and passengers. However, the Separatists continued their attack, killing the entire family. A transmission of the attack was broadcast to the Jedi Order, aware of this Dooku stated that their deaths were the fault of the Jedi Order and the Galactic Republic.\nThe Ashu family appeared in the 2015 novel Dark Disciple, written by Christie Golden.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mahran",
  "/wiki/Mahranee",
  "/wiki/19_BBY",
  "/wiki/Atrocity_on_Mahranee",
  "/wiki/Planet",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Warrior",
  "/wiki/Politics",
  "/wiki/Rakshu",
  "/wiki/Gender",
  "/wiki/Ashu-Nyamal",
  "/wiki/Teegu",
  "/wiki/Artist",
  "/wiki/Kamu",
  "/wiki/Mahranee_government",
  "/wiki/Chubor%27s_Republic_frigate",
  "/wiki/Consular-class_cruiser_(Charger_c70_retrofit)",
  "/wiki/Jedi_General",
  "/wiki/Chubor",
  "/wiki/Clone_trooper",
  "/wiki/Starship",
  "/wiki/Fleet",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Head_of_State",
  "/wiki/Death",
  "/wiki/Jedi_Order",
  "/wiki/Jedi",
  "/wiki/2015",
  "/wiki/Dark_Disciple",
  "/wiki/Christie_Golden",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}