{
 "name": "Ask_Aak",
 "display_name": "Ask Aak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Malastare"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.80 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange-brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Malastare delegation",
      "Loyalist Committee",
      "Malastare delegation",
      "Loyalist Committee"
     ]
    }
   ]
  }
 ],
 "content": "Ask Aak was a Gran male senator who represented the planet Malastare in the Galactic Senate during the final years of the Republic. At the time of the Separatist Crisis Aak was a member of Supreme Chancellor Sheev Palpatine's Loyalist Committee. A proponent of military action against the Confederacy of Independent Systems, the senator advocated the use of the clone trooper army in order to defend the Republic. The result was the establishment of the Grand Army of the Republic and the subsequent outbreak of the Clone Wars.\nDuring the Secessionist Movement, a period of political tension between the Galactic Republic and the Confederacy of Independent Systems, Ask Aak represented the planet Malastare in the Galactic Senate, replacing the assassinated Aks Moe. He was a part of the inner circle of Supreme Chancellor Sheev Palpatine—secretly Darth Sidious, the Dark Lord of the Sith who was manipulating the political crisis. Aak was present in Palpatine's office when Jedi Knight Obi-Wan Kenobi sent a holographic message to Coruscant warning that the Commerce Guild and the Corporate Alliance had formed an alliance with Count Dooku, a Sith Lord and political leader of the Separatists. Aak stated that the debate over military action was over and that the Republic needed the clone army that Kenobi discovered had been created in secret on Kamino. Senator Bail Organa of Alderaan disagreed that the debate was over, believing that the Senate would not approve the use of the clones prior to a Separatist attack.\nAfter the meeting in the Chancellor's office, Junior Representative Jar Jar Binks of Naboo proposed that Palpatine be given emergency executive power in order to approve the use of the clone army. The Senate approved the measure, and the clone troopers became the Grand Army of the Republic and were put into action during the First Battle of Geonosis. Aak was later with Palpatine and other Senators, who watched as tens of thousands of clones departed for more battles against the Separatists during the Clone Wars.\nWhen Palpatine was rescued from General Grievous at the Battle of Coruscant in 19 BBY, Ask was among the Senators who greeted him on the landing platform. Glad to be rescued, Palpatine stopped in second place but was still quick to get in. He was later in the Senate when Palpatine proclaimed the Galactic Empire, a government that replaced the Republic.\nAsk Aak was a Gran with orange-brown skin and black eyes, of which Aak had three. Aak claimed to be patriotic to the Republic and was a steady supporter of Palpatine and the war, questioning or threatening any who did not support the conflict.\nSenator Ask Aak first appeared in the 2002 film Star Wars: Episode II Attack of the Clones. The character was portrayed by Steven Boyle. He later appeared in Star Wars: Episode III Revenge of the Sith, portrayed by Paul Spence.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ask_Aak",
  "/wiki/Ask_Aak/Legends",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Databank_A-Z",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Chancellors,_Senators_and_Other_Statesmen_of_the_Republic",
  "/wiki/Malastare",
  "/wiki/Gran",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Malastare_delegation",
  "/wiki/Loyalist_Committee",
  "/wiki/Senator",
  "/wiki/Planet",
  "/wiki/Galactic_Senate",
  "/wiki/Standard_year",
  "/wiki/Time",
  "/wiki/Separatist_Crisis",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Clone_trooper",
  "/wiki/Army",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Clone_Wars",
  "/wiki/Politics",
  "/wiki/Assassin",
  "/wiki/Aks_Moe",
  "/wiki/Darth",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Emperor%27s_office",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Hologram",
  "/wiki/Coruscant",
  "/wiki/Commerce_Guild",
  "/wiki/Corporate_Alliance",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Sith_Lord",
  "/wiki/Mission_to_Kamino_(Separatist_Crisis)",
  "/wiki/Kamino",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Alderaan",
  "/wiki/Junior_Representative",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Naboo",
  "/wiki/Cloning",
  "/wiki/Trooper",
  "/wiki/19_BBY",
  "/wiki/Eye",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Steven_Boyle",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Paul_Spence",
  "/wiki/StarWars.com",
  "/wiki/The_Creatures_of_Episode_III",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Technology",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Clone_Wars_Begin",
  "/wiki/Databank_(website)"
 ]
}