{
 "name": "Astar_Vox",
 "display_name": "Astar Vox",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic Implants on right cheek"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Ulgo",
      "House Teral"
     ]
    }
   ]
  }
 ],
 "content": "Astar Vox was a Human male mercenary during the Cold War between the Galactic Republic and the resurgent Sith Empire. Astar fought for House Ulgo during the Alderaan Civil War and laid siege to House Teral's fortess until a Jedi Consular convinced him to change sides.\nWhile Astar Vox was leading the Ulgo forces against House Teral, the Consular visited Astar Vox at his camp with an offer to join House Teral. Astar Vox told the Jedi that he only negotiated with his equals in combat. He decided to test the Jedi in battle before talking. He started by sending a pack of his Akk dogs against the Jedi.\nThe Consular quickly defeated the dogs. However, Vox wasn't ready to talk yet. He decided the fight was a bit too easy and the Jedi needed to prove himself more. He decided to next send a group of Ulgo War droids against the Jedi.\nAfter the Jedi destroyed the droids, Vox was impressed, but still not entirely convinced. He decided to test the Jedi one final time, this time against Ulgo's fiercest champions, promising this would be the final test.\nAfter the Ulgo Champions were defeated, Vox was truly impressed and finally decided to accept the Jedi's offer.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_Ulgo",
  "/wiki/House_Teral",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Mercenary/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Alderaan_Civil_War",
  "/wiki/The_Barsen%27thor",
  "/wiki/Jedi_Consular",
  "/wiki/Astar_Vox%27s_camp",
  "/wiki/Jedi/Legends",
  "/wiki/Akk_dog/Legends",
  "/wiki/Droid/Legends"
 ]
}