{
 "name": "Asu",
 "display_name": "Asu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  }
 ],
 "content": "Asu was a male human who lived in Meevai Village on Keelia sometime after the Clone Wars. He was married to Haru.\nLocal raider Lord Izuma, who took over the B1-series battle droids left behind on Keelia by the Confederacy of Independent Systems, at one point demanded his bride Haru's grandfather, the village chief, as collateral to avoid unnecessary conflict with the villagers. Haru and Asu both volunteered to go in his stead, despite repeated protests from her sister Saku. Haru and Asu's wedding ceremony took place the night before they were to be taken.\nOn the day following the wedding, Haru and Asu turned themselves in to Izuma. Saku and others had secretly organized an ambush on the raiders, but their plans were foiled. When Izuma was ready to execute Saku for being the leader, Jedi F intervened and saved her. F's companion Valco destroyed Izuma's ship, thus disabling his B1-series battle droids. In the ensuing chaos, Izuma's associates fled. Izuma then took Haru as hostage. In a swift move, F struck down the raider, and saved Haru, Asu, and the rest of the villagers.\nSometime later, Asu and other villagers thanked F for her help, and said their farewell to F as the Jedi left the planet.\nAsu first appeared in the Star Wars: Visions short film \"The Village Bride.\" He was voiced by Yuma Uchida in the original Japanese audio and by Christopher Sean in the English dub.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Meevai_Village",
  "/wiki/Keelia",
  "/wiki/Clone_Wars",
  "/wiki/Haru",
  "/wiki/Lord",
  "/wiki/Izuma",
  "/wiki/B1-series_battle_droid",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Saku",
  "/wiki/Jedi",
  "/wiki/F",
  "/wiki/Valco",
  "/wiki/Izuma%27s_starship",
  "/wiki/The_Village_Bride",
  "/wiki/Christopher_Sean",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_Visions_Season_One_Companion",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/Category:Images_of_Asu"
 ]
}