{
 "name": "Atai Molec",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zygerria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zygerrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems",
      "Zygerrian Slave Empire",
      "Zygerrian Slave Empire"
     ]
    }
   ]
  }
 ],
 "content": "Atai Molec was the Zygerrian male Prime Minister to Queen Miraj Scintel during the Clone Wars. He was also captain of the Zygerrian royal guard.\nDuring the Clone Wars, Atai Molec and Count Dooku spoke with Commander Darts D'Nar about his last shipment of Kiros's colonists. Molec was surprised that D'Nar had not left yet. As Republic Jedi General Obi-Wan Kenobi entered to speak with D'Nar, Molec growled when Dooku introduced him to Kenobi.\nAs Molec was about to whip one of his slaves, he was stopped by a slave. He then saw the slave's master in Zygerrian armor and that he flew one of their ships. At first, Molec was distrusful of him when he demanded to speak to the Queen about Bruno Denturri. However, Molec brought in the man known as Lars Quell before the queen. Molec was then told that a man in Zygerrian armor had tried to free one of the enslaved colonists. Molec then realized that it was Kenobi. Molec then brought Kenobi before the Queen to punish him for the Jedi's crimes against their empire. However, Molec, the Queen and their guards were then attacked by Quell and his slave, who revealed themselves to be Anakin Skywalker and his apprentice, Ahsoka Tano. Though Molec was knocked down by Tano, the Queen and their guards were eventually able to subdue the Jedi.\nLater, Molec visited a caged Tano and revealed that the Queen had promised that after Skywalker was tamed, Tano would be his slave to do with whatever he desired. As an act of defiance, Tano then telekinetically pushed Molec off a precipice, nearly sending him falling to his death. In retaliation, Molec electrocuted Tano several times with the shock collar she was wearing as a slave.\nMolec then invited Count Dooku to Zygerria to speak with the Queen about her defiance in not killing Skywalker. Dooku decided on his arrival that the Jedi should be killed immediately. Molec agreed with the Count to kill the Jedi ; Miraj, however, refused these terms and was unwilling to let Anakin die. Dooku then deemed that Scintel was unfit to be queen. Molec then stood by as Dooku Force-choked her, an act that would prove fatal. Skywalker escaped however, taking the dying Miraj with him.\nHaving usurped Miraj, Molec later became king and had a son, Sono.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Atai_Molec",
  "/wiki/Atai_Molec/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Friends_Like_These",
  "/wiki/Zygerria",
  "/wiki/Zygerrian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Zygerrian_Slave_Empire",
  "/wiki/Prime_Minister",
  "/wiki/Queen",
  "/wiki/Miraj_Scintel",
  "/wiki/Clone_Wars",
  "/wiki/Captain_of_the_Guard",
  "/wiki/Zygerrian_royal_guard",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Commander",
  "/wiki/Darts_D%27Nar",
  "/wiki/Kiros",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Slavery",
  "/wiki/Ahsoka_Tano",
  "/wiki/Bruno_Denturri",
  "/wiki/Anakin_Skywalker",
  "/wiki/Death",
  "/wiki/Shock_collar",
  "/wiki/Sono_Molec",
  "/wiki/Category:Audio_files_of_Atai_Molec",
  "/wiki/Category:Images_of_Atai_Molec",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Kidnapped",
  "/wiki/Slaves_of_the_Republic",
  "/wiki/Escape_from_Kadavo",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)"
 ]
}