{
 "name": "Atin_Skirata",
 "display_name": "Atin Skirata",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Born",
     "values": [
      "32 BBY",
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Omega Squad",
      "Omega Squad",
      "Mandalorians",
      "Clan Skirata",
      "Clan Skirata"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Walon Vau"
     ]
    }
   ]
  }
 ],
 "content": "RC-3222, also known as Atin , the Mando'a word for \"persistent\", or \"stubborn\", was a clone commando in the Galactic Republic's Omega Squad during the Clone Wars. He was trained by Sergeant Walon Vau.\nDuring his training, Atin gained several scars from battle. These were partly due to the regular training, but also for another reason: Walon Vau. Vau was a ruthless training sergeant, making his soldiers fight each other, or fight him. Vau made Atin choose after he lost his first squad, who were killed in training while trying to rescue him. Atin did not want to fight his brother clones, and instead opted to fight Vau. Vau nearly killed Atin with a Mandalorian saber. Vau's training was brutal, and Kal Skirata saw him as a sadist. He joined a second squad after being the sole survivor of his first squad.\nIn 22 BBY, Atin's fellow squadmates died at the Battle of Geonosis, leaving him to be reassigned. To get Atin out of his survivor's guilt after his squadmates died, Vau took his knife to the clone, leaving a scar that stretched from his right eye to the left side of his chin, distinguishing him from his fellow clones. Atin soon after became part of the newly formed Omega Squad, along with three other clones who had lost the rest of their squads, Darman, Fi and Niner.\nThree months after the Battle of Geonosis, he accompanied Omega Squad on a mission to the world of Qiilura.He helped in the capture of the Separatist scientist, Doctor Ovolot Qail Uthan, and also in the defeat of the Separatist forces there, who were under the command of Ghez Hokan. During the mission, he was injured by Hurati.\nA month later, Atin participated in the Galactic City spaceport hostage siege and helped to take out the Korunnai terrorists.\nDuring a mission at the Corellian–Perlemian hyperspace intersection, Atin and the rest of Omega Squad captured some terrorists connected to a terror cell on Coruscant. They were assigned with Delta Squad and Kal Skirata to destroy the terrorist network. During the mission, Atin met up again with his former training sergeant, Walon Vau. Sev, a member of Delta Squad who had also trained under Vau, tried to protect Vau from Atin and had uneasy feelings towards Atin at first, but Kal Skirata made them cooperate. After the mission was over, Atin got his chance to take out his feelings on Vau. He engaged Vau in nothing but a black bodysuit and with no weapons except a standard-issue commando vibroblade. They fought until Atin was in a position to kill Vau, but before Atin could deal the killing blow, Bardan Jusik burst in, separated them both with the Force, and ordered Atin to stand down.\nDuring the course of the Coruscant mission, Atin became romantically involved with a Twi'lek waitress named Laseema.\nAbout 65 days after the Coruscant mission, Atin accompanied the Null-class ARC trooper Prudii on a mission to the droid factory on Olanet. Atin had volunteered to do this, while the rest of Omega Squad were resting on Coruscant for a few days, so that he could learn Prudii's technique of infiltrating droid factories and making them produce substandard droids that could be defeated more easily.\nThe mission was successful, but while they were there, Atin began to question the official Republic Intelligence figures for the strength of the Separatist Droid Army. They claimed that there were quadrillions of droids, but on Olanet, Atin could only see evidence for just a few hundred million.\nThey were extracted from Olanet by a TIV, which under Prudii's orders detoured and attacked a Separatist droid transport near to Cato Neimoidia. This was an action that Atin thought was a bit crazy, because the droids were probably of a spiked batch, but Prudii explained that if they stopped taking shots at Separatists at whatever chance they had, then the Separatists may realize that the Republic had sabotaged their droids. Afterward they headed to an RV point near Drall in the Corellian system, to meet up with Kal Skirata, who had recently returned from a mission on Kamino. Atin was glad to see him again.\nA week later, Atin was sent with Omega Squad to the world of Gaftikar, to aide the Null-class ARC trooper, A'den in training the local Gaftikari resistance forces. They were transported there aboard the Core Conveyor, along with the 2nd Airborne Company of the 212th Attack Battalion. The clones of the Airborne Company showed a dislike to Omega Squad, because of their Mandalorian heritage. Atin asked them why they had a problem with this and found out that the Airborne Company had fought against the Mandalorian Protectors, resulting in many casualties. Atin found this whole incident disconcerting, as it was the first case he found of clone troopers disliking other clone troopers, despite the fact that he was already aware of the heated rivalry between the Nulls and the Alpha-class ARC troopers. Afterward, he tried to take his mind off the incident, by reading a letter that Laseema had sent him.\nAtin and the rest of Omega Squad were dropped onto Gaftikar from the air, wearing Clone paratrooper wings that they had fitted onto their armor and they were soon found by A'den, who showed them the location of the rebel's camp. The job of training the local Marit resistance fighters had originally fallen to Sull, but he had gone MIA. The Marits got on well with all the clones, including Atin. When they offered him some of their stew, A'den told him \"not to ask\" about it and he happily tucked in. However, he then learned that the Marits had a custom of eating their dead and that the stew contained the grandmother of one of the lizards, something that prompted Atin to throw up. Fi made a number of jokes about this.\nAfterward, he accompanied Darman on a reconnaissance mission into Gaftikar's capital city, Eyat, where they spotted Sull. They followed him back to his apartment and when they confronted him, things turned violent and Sull fired on them and hit Atin in the groin with his knee, but Atin succeeded in getting a vibroblade to the ARC's throat. They took him back to the camp, where they handed him over to A'den. Sull was convinced that the Republic wanted to kill him, something that was confirmed when two Covert Ops clone troopers attacked Darman, in the mistaken belief that he was Sull. Darman killed the troopers and Atin dug a grave for them, to give them a Mandalorian-style funeral.\nA few days later, he participated in the Battle of Gaftikar along with the rest of Omega Squad, who were ordered to identify comm stations on the planet, to target them for V-19 Torrent starfighters to destroy. Afterward, they went to take out the Gaftikar HoloNet relay center. Atin climbed onto the roof to disable the satellite relay up-link, but the building suddenly exploded, causing him to break his ankle. Fi didn't come out so well and went into a coma, so Atin stood watch by his bacta tank aboard the Leveler, because he had bad memories from being in bacta, so he wanted to be there to comfort Fi in case he came around.\nThe Leveler took them back to Coruscant and Atin accompanied Darman and Niner to the Arca Company Barracks, to meet up with Corr, who would be taking Fi's place in Omega Squad. Corr was a bit nervous, but Atin said he knew how he felt, as he had been one of Walon Vau's trainees and had had to get used to being with Skirata's trainees in Omega Squad. Here Atin first met Mace Windu.\nAtin met Kal again on Coruscant a few months later and was introduced by him to the newly born Venku Skirata. Kal took the opportunity to officially adopt all of Omega Squad into Clan Skirata, with Atin becoming Atin Skirata.\nAtin and the rest of Omega were sent to Haurgab to assassinate a Separatist leader. Atin and Omega succeeded but soon became over run by hostiles and got trapped in a sand storm. They are eventually rescued by a LAAT/i.\nDuring the Battle of Coruscant, Atin feared he would not make it home and married Laseema over comms.\nHe was well-versed in communication and technology, as well as a small amount of demolitions, though most of such operations were left to Darman, Omega Squad's expert on that subject.\nAtin discovered the Katarn Armor's weakness to Verpine Shatter Guns the hard way, and wound up in a fair amount of pain from it, although it did not seriously injure him.\nAtin was recognizable for his large scar on his face, which was still healing during Omega's Mission to Qiilura. He was moderately humorous, but mostly his humor consisted of replying to Fi's jokes. He would go dead serious in combat however, much like all Republic Commandos.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Atin_Skirata",
  "/wiki/Mandalorian/Legends",
  "/wiki/Atin_Attan",
  "/wiki/Kamino/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Omega_Squad",
  "/wiki/Clan_Skirata",
  "/wiki/Walon_Vau",
  "/wiki/Etain_Tur-Mukan",
  "/wiki/Mando%27a/Legends",
  "/wiki/Clone_commando/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Beskad/Legends",
  "/wiki/Kal_Skirata",
  "/wiki/Unidentified_clone_commando_squad_(RC-3222)",
  "/wiki/22_BBY/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Darman_Skirata",
  "/wiki/Fi_Skirata",
  "/wiki/Niner_Skirata",
  "/wiki/Mission_to_Qiilura",
  "/wiki/Qiilura",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Ovolot_Qail_Uthan",
  "/wiki/Ghez_Hokan",
  "/wiki/Hurati",
  "/wiki/Galactic_City_spaceport_hostage_siege",
  "/wiki/Korun/Legends",
  "/wiki/Mission_to_the_Corellian-Perlemian_Intersection",
  "/wiki/Corellian_Run/Legends",
  "/wiki/Perlemian_node",
  "/wiki/Hyperspace/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Delta_Squad/Legends",
  "/wiki/Mission_to_Coruscant_(Clone_Wars)",
  "/wiki/RC-1207/Legends",
  "/wiki/Knuckle_plate_vibro_blade",
  "/wiki/Bardan_Jusik",
  "/wiki/The_Force/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Laseema",
  "/wiki/Null-class_Advanced_Recon_Commando",
  "/wiki/Prudii_Skirata",
  "/wiki/Sabotage_of_Olanet_Droid_Factory",
  "/wiki/Droid/Legends",
  "/wiki/Olanet",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Traffic_Interdiction_Vessel",
  "/wiki/Cato_Neimoidia/Legends",
  "/wiki/Drall_(planet)",
  "/wiki/Corellian_system",
  "/wiki/Mission_to_Kamino_(Clone_Wars)",
  "/wiki/Gaftikar",
  "/wiki/A%27den_Skirata",
  "/wiki/Core_Conveyor",
  "/wiki/2nd_Airborne_Company/Legends",
  "/wiki/212th_Attack_Battalion/Legends",
  "/wiki/Mandalorian_Protectors/Legends",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Clone_paratrooper/Legends",
  "/wiki/Marit",
  "/wiki/Alpha-30",
  "/wiki/Eyat",
  "/wiki/Vibroblade/Legends",
  "/wiki/Covert_Ops_clone_trooper",
  "/wiki/Battle_of_Gaftikar",
  "/wiki/V-19_Torrent_starfighter/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Leveler",
  "/wiki/Arca_Company_Barracks",
  "/wiki/RC-5108/8843",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Venku_Skirata",
  "/wiki/Republic_Commando:_Hard_Contact",
  "/wiki/Omega_Squad:_Targets",
  "/wiki/Republic_Commando:_Triple_Zero",
  "/wiki/Star_Wars_Insider",
  "/wiki/Odds",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Standard_year/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Squad/Legends"
 ]
}