{
 "name": "Atour Riten",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Death Star I"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Janissariad",
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Atour Riten was a Human male commander and librarian who served in the Imperial Navy and the Janissariad during the Balduran Civil War and the Galactic Civil War in 0 BBY.\nAt some point Atour served in the Janissariad during the Balduran Civil War which left a distaste for government in his mouth. Atour did his apprenticeship in the Baobab Archives on Manda. He later served as an archivist for the Dorismus Athenaeum on Corellia and the Holorepository on the wheelworld Arkam 13.\nAtour was assigned as the chief librarian onboard the Death Star, as he had a habit of collecting sensitive information about his personal enemies, and believed that he had been placed on the Death Star to prevent him from releasing any of his secrets. He was given the official rank of Commander, although he didn't personally consider it to be worth much. After arriving on the station, Atour reprogrammed his personal droid P-RC3 to be ultimately loyal to him instead of the Empire. He also used the droid to access a copy of the Death star plans, simply in case he ever found use for them.\nAtour considered himself to be mainly non-political, not caring much between the Empire and the Rebel Alliance, but after the Death Star's superlaser was tested on the planet of Despayre and destroyed it, Atour was horrified at what the Empire had done. After the Destruction of Alderaan, he dedicated the rest of his life to defeating the Empire, which he unwittingly did by sending a copy of the Death Star plans to Danuta, which were then stolen by the Rebel Alliance. Atour developed a plan to escape the Death Star, determined to avoid helping the Empire anymore. Atour spent some time in the Hard Heart cantina, where he eventually overheard a group of individuals discussing the Empire's recent actions. Atour then approached them, and revealed to them that he had access to several important codes and other controls that would allow them to leave the Death Star, explaining his detailed plan. The group agreed, and later, during the Battle of Yavin, they got their chance to escape.\nAtour lowered the security to the Detention Block, helping the crew of the Millennium Falcon to rescue Princess Leia. Riten then aided Villian Dance, Celot Ratua Dil, Memah Roothes, Teela Kaarz and Kornell Divini in deserting the Death Star. The initial plan, however, was to use his droid P-RC3 to trick Bay Door Control into giving their escape shuttle clearance to leave the Death Star so that he would also escape with the group. P-RC3 was taken by security and Riten was forced to take the droid's place. Atour successfully tricked the controllers of the landing bay doors to allow the shuttle to escape, even after he was notified by Kaarz that the Death Star would likely be destroyed in the battle. At peace with the fact that he had helped his new friends escape, Atour Riten perished on the Death Star.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Janissariad",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Balduran_Civil_War",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Baobab_Archives",
  "/wiki/Manda/Legends",
  "/wiki/Dorismus_Athenaeum/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Holorepository",
  "/wiki/Wheelworld",
  "/wiki/Arkam_13",
  "/wiki/P-RC3",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Danuta",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Villian_Dance",
  "/wiki/Celot_Ratua_Dil",
  "/wiki/Memah_Roothes",
  "/wiki/Teela_Kaarz",
  "/wiki/Kornell_Divini",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Atour_Riten",
  "/wiki/Death_Star_(novel)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}