{
 "name": "Atris",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Lost Jedi",
      "Jedi High Council",
      "Lost Jedi",
      "Galactic Republic",
      "Sith"
     ]
    }
   ]
  }
 ],
 "content": "Atris was a Human female who served as a Jedi historian, and later as a Jedi Master and Jedi Council member during the Mandalorian Wars and the Jedi Civil War. She was deeply committed to the Order and was a fierce adherent of the Jedi Code. But Atris' faith in the righteousness of the Jedi wavered when her personal hero, Meetra Surik, turned her back on the Council to join rogue Knights Revan and Malak and their faction of Jedi during the Mandalorian Wars. Atris chose not to go to war, but this decision left her bitter and conflicted.\nWhen Surik returned to face the Council's judgment after the devastating events of the Battle of Malachor V, Atris was the first to condemn her, suggesting that she had fallen to the dark side just as Revan had. Over time, Atris grew to hate Surik for complicating her black-and-white view of the Jedi, the Sith, and the Force. During the Dark Wars, Atris called a secret Jedi convocation on the Miraluka world of Katarr in an attempt to find the threat that was stalking the Jedi. She then leaked knowledge of the conclave's existence in the hopes of drawing out the Sith. She succeeded, but with dire consequences; Darth Nihilus devastated the surface of the planet, wiping out all life on Katarr, including the Jedi gathered there.\nHowever, Atris survived, and she remained in seclusion, surrounding herself with Echani Handmaidens who could not feel the Force. She planned to rebuild the Jedi Order, and established a Jedi Academy in the old irrigation system on Telos IV. However, she was heavily influenced by the many Sith holocrons she had collected in her efforts to find and understand the Sith. The holocrons fed her bitterness, and she slowly and quietly fell to the dark side, consequently becoming the new Darth Traya, the Queen of Betrayal. Per the machinations of her mentor, Kreia, Surik and the new Darth Traya confronted each other once more on Telos, where Surik convinced Atris to turn away from the dark side. Atris then remained in the Jedi Academy, waiting to be judged for her actions by the new Jedi Council.\nAfter the end of the Great Sith War that was started by the Sith Lords Exar Kun and Ulic Qel-Droma, the Jedi historian Atris attempted to revise the broken system of Jedi apprenticeship. She argued that there was little wonder why Kun and Qel-Droma fell to the dark side of the Force, when the Jedi had liberal instruction practices in place, such as dozens of Padawans training under a single Master, the radical bonds of reciprocal apprenticeship, and Jedi beginning their training in their teens and later. She invoked thousand-year old recommendations first suggested by the Jedi Master Simikarty, lobbying for the restriction of Padawans that a Master could have at one time, and also limiting the age of Jedi candidates.\nAtris also advocated prohibiting romantic involvement for Jedi, citing that the First Great Schism had been started by two lovers. She even endorsed adoption of a more austere interpretation of the Jedi Code which was favored by the Draethos Jedi Master Odan-Urr, in memory of his death at the hands of Exar Kun at the Jedi Academy on Ossus. Her arguments found powerful purchase amongst the Jedi, and she was appointed to High Council.\nWhen the Mandalorian Wars erupted in the year 3964 BBY, the Galactic Republic came to the Jedi for assistance. However, Atris resisted the call to protect the inhabitants of the Outer Rim Territories, instead staunchly defending the council's decision to meditate and reflect before taking action.\nMany Jedi did not understand how the Council could sit idly while innocents died, and the order was split when two Jedi Knights named Revan and Malak chose to go to war. Many followed them, including the Jedi Meetra Surik. Atris had held a strong admiration for Surik, viewing her as something of a hero as well as a close friend. When she and Revan left the Order to join the war, rejecting everything that Atris believed in, Atris felt personally betrayed. Atris condemned Revan, his followers, and the \"freethinking\" teachings of his former Jedi Master, fellow historian Kreia. Revan's eventual turn to the dark side came as little surprise to Atris. Indeed, when Revan met Atris years later asking what happened to Surik, Atris made little effort to conceal her contempt.\nAfter the war's end, only one of the Jedi who had followed Revan to war returned to face the council: Meetra Surik. She stood before them as an echo in the Force, having cut herself off from it after the final battle at Malachor V. Surik was so defiant, so certain of the rightness of her actions that she caused Atris to doubt herself. Atris wanted to punish Surik for this, and became convinced that she had fallen to the dark side along with all of the others who had followed Revan. She felt that exile was too lenient of a punishment for Surik's betrayal, and believed that she would only join Revan again if she was free. The other Masters warned her to be mindful of her feelings, but Atris insisted that Surik ought to have died at Malachor V, because when she stood before them, it was if she was already dead. The Council decided not to tell Surik that she had become a wound in the Force, which was the result of her actions at Malachor.\nAtris kept Surik's lightsaber after the trial, carrying it with her always. Even many years later, she insisted that the Council was right to be cautious. But deep down, she continued to question the actions of the Council, Surik, and herself.\nIn 3954 BBY Revan came to the Temple Archives to find out what happened to his trusted General Meetra Surik. He accessed the file on Surik and found it lacking in information about her whereabouts. Behind him, Atris spoke out, during their conversation she revealed that Surik had disconnected herself from the Force because of the guilt she carried over her actions during the Mandalorian Wars. Although Revan felt responsible for Surik's fate, he refused to give her the satisfaction of seeing his guilt and grief. She stormed out of the room.\nAfter the death of Darth Malak at the hands of a redeemed Revan, the Jedi Order's infrastructure was decimated. To make matters worse, some thing was systematically hunting and killing what Jedi there were left. Atris rallied a secret Jedi convocation on Katarr, a colony world of the Miraluka, where the threat could be assessed and the future of the Order discussed. However, Atris leaked knowledge of the session in hopes of drawing out this threat so that it could be fought. Unfortunately, she greatly underestimated its strength. The Sith arrived in the form of Darth Nihilus, who proved to be too powerful for the Jedi. Through the Force, he devoured all life on the planet, including the Jedi and Miraluka . Atris, having not attended the Conclave, survived, along with a handful of other Masters who went into hiding.\nAtris took refuge under a polar ice cap on the planet Telos IV, where she began to build a secret Jedi academy in an old irrigation system. Here she hid most of the Jedi's most valuable artifacts and resources, including many Sith holocrons.\nShe sought to remedy what she saw as a fundamental flaw of the Jedi Order: the lack of any mechanism to prevent Jedi from falling to the dark side, and repeatedly wreaking havoc on the galaxy. To that end, she trained a group of half-sisters, specially equipped and trained to resist Force powers and, if necessary, use their Echani combat skills to subdue wayward Jedi. Atris planned to eventually rebuild the Jedi Order, but she greatly overestimated her own ability to resist the dark side, becoming corrupted by delving into the forbidden knowledge of her collection of Sith holocrons.\nIn 3951 BBY, Meetra Surik and her companions landed on Telos IV, having narrowly escaped the destruction of the Peragus Mining Facility at Peragus II. Upon hearing that the Telos Security Force held an individual called the Jedi Exile and her party under house arrest for their suspected involvement in the explosion of the mining facility, Atris desired to uncover the cause of the explosion, knowing that the consequences of its loss would be tremendous. Therefore, she sent one of her Handmaidens by the name of Brianna, to steal their ship, the Ebon Hawk, as well as T3-M4 who, fortunately for her, was on board. The ship and droid were dissected for information, though little of value was actually found.\nUpon discovering the loss of her ship, Surik managed to trace the Ebon Hawk to the polar plateau where Atris's academy was hidden. Once she found her way inside, Atris had Surik's companions placed in force cages while the Handmaidens brought Meetra Surik before her to be questioned. Not long before this, Atris had discovered Surik's identity, and was surprised at the revelation—she had not expected to see her again after the Council sentenced her to Exile.\nAt first she hoped that Surik had returned to admit that the Council had been right and to face up to her crimes, but that was not the case. Surik's presence stirred unpleasant feelings which Atris had all but forgotten, and hoped lost. These feelings showed themselves when she accused Meetra Surik of walking the dark path, when Atris' words were the ones that sounded bitter and resentful. In fact, she was so angry about what Surik did that she refused to believe that Surik had meant to help others in the Mandalorian Wars, and said she simply went off for the adventure and the excitement of battle. Atris continued to berate Surik by blaming her for the destruction of Peragus II. She was shocked to learn the Sith were behind it, and even more shocked when she learned the Sith were hunting Meetra Surik. She reluctantly accepted Surik's offer of help in defeating them, and instructed her to gather other Jedi on Dantooine so that action could be taken and a Council could be had.\nAfter departing Telos IV, Surik discovered that T3-M4 had downloaded Atris's archives. It seemed that Atris had kept a holo record of her trial, as well as a list of the remaining Jedi Masters—despite her claim that she was the \"last of the Jedi\" because T3 had been able to slice into the historian's files and copy them, locating the Jedi Masters for Atris's proposed meeting proved easier.\nAs Atris sought desperately to understand Surik's motives, which was part of the reason for her keeping of the holocrons, she clung even more desperately to her perfect view of the Jedi. However, in light of Surik's choices, she knew that either she or the Council was wrong. Though she placed Surik in the wrong, it only made her more unsettled, as, inwardly, she respected her choice. It built up a pressure that finally exploded when Kreia, who had then revealed her former identity as Darth Traya after she had killed the three Council members Zez-Kai Ell, Kavar, and Vrook Lamar when they reconvened on Dantooine, stripped Atris of her self-denials and allowed her to finally accepting that she was betrayed by her dark persona; Atris embraced herself as Darth Traya, the Queen of Betrayal, and was told by Kreia that Meetra Surik would return to her sanctum on Telos to confront her for the last time.\nAfter being informed by an Onderonian colonel named Tobin of the Jedi academy on Telos, who had been in turn informed by Kreia, Darth Nihilus attacked Telos, believing that he could feed on what Jedi were there.\nWhen Surik, who was searching for Kreia after having been left by the former Sith, returned to the Academy, Darth Traya clashed with her in a lightsaber duel, and was defeated. Surik, however, spared her life. This action was something Traya believed Meetra Surik would never have done. However, it led her to forgo the moniker of Darth Traya and for Atris to chose to let go of the Jedi; to be exiled from the Order to find her human self once more. Atris was held captive in her sanctum until judged by Mical and the new Jedi Council; the disciples of Meetra Surik.\nAtris was extremely dedicated to the Jedi Order, and believed in their righteousness to the point of arrogance and fanaticism. She was impatient with dissenters, and took accusations against the Jedi very personally. When many Jedi left the order to follow Revan to war, Atris was eager to write them all off as traitors and Sith, even Meetra Surik after she returned to face the Council.\nDuring the Dark Wars, Atris became reclusive, and obsessed with preserving what she could of the Jedi legacy, including the Sith relics which would ultimately lead her down the path to the dark side. She was bitter and untrusting, surrounding herself with Echani warriors trained to resist the Force. Though she claimed to be building a Jedi Academy, she made no efforts to bring Force-sensitives to train. In fact, despite knowing the locations of the Jedi Masters Zez-Kai Ell, Vrook Lamar, Kavar, and Lonna Vash, she made no attempt to contact them, and none of them knew that she was still alive.\nIt was ironic that despite the fact that Atris championed various causes, such as the limitation of the amount of Padawans a single Master could have, or the fact that she attempted to preserve Jedi knowledge, she herself never took a Padawan.\nAtris wore an all-white variation of the traditional robes of a Jedi historian.\nAtris was a very powerful Jedi Master, using powers such as Force suppression, Droid Disable, and Force stun. After her fall to the dark side, she proved to be as proficient with dark-sided Force powers as well, including Force choke, Force drain, Force horror, Force lightning, and Force affliction. She was also a masterful lightsaber practitioner, using the deadly lightsaber form Juyo.\nHaving been a Jedi Watchman, Atris spoke and comprehended several languages, including Basic, Sith, Old Galactic Standard, and the Echani language. She was also an adept negotiator.\nAtris is voiced by Elizabeth Rider. However, Grey DeLisle, who also voiced Brianna the Handmaiden, voices Atris during combat. Her concept art was drawn by Brian Menze, who went on to create her in-game model as well.\n\"Atris\" is an anagram of \"Taris,\" a planet from the video game Star Wars: Knights of the Old Republic. It is also an anagram of \"Trias\", who was an important character in Planescape: Torment, another game in which Chris Avellone was the lead designer. Like Atris, Trias initially appears as a benign ally, but later betrays the player. Additionally, \"atris\" is the ablative and dative plural of Latin \"ater\", \"dark, malevolent, obscure\".\nIn the Champions of the Force miniature set, the Jedi Guardian figure resembles Atris, though she is never identified as a Guardian at any time. In fact, she is classified as a Jedi Consular in the game files. In promotional material for The Sith Lords, she is represented as the personification of the light side of the Force; an analogue to Darth Nihilus, although the two never interact within the game. This is ironic, as Atris has embraced various levels of dark side corruption throughout the narrative.\nThough the ending where Atris is explicitly stated to have become Darth Traya was cut , the Knights of the Old Republic II: The Sith Lords: Prima Official Game Guide provides this information. This is reinforced by the final version of the game, where Kreia says this to Atris, who had been overtaken and betrayed by the dark side: \"But there must always be a Darth Traya, one that holds the knowledge of betrayal. Who has been betrayed in their heart, and will betray in turn.\"\nThere is an error in the Knights of the Old Republic II: The Sith Lords: Prima Official Game Guide, which shows a picture of Atris fighting Darth Nihilus in the black robes pictured above., which is explicitly stated in a cut version of The Sith Lords. A misprint in Star Wars: The Ultimate Visual Guide on page 27 says the Handmaiden Brianna; the picture above is Atris and not Brianna.\nAtris' Jedi historian robes are very similar in design to Jocasta Nu's, another Jedi librarian; the difference being that Atris wears white, while Nu wears yellow and black.\nIf the Jedi Exile is set as a male, some discussion with the Echani Handmaiden Brianna reveals that Atris may have harbored feelings for the Exile, and the Exile's decision to leave the Jedi for the Mandalorian Wars was in fact the trigger for her eventual fall to the dark side. This further justifies the bitterness of her attitude when she first meets the Exile earlier in the game. In cut content, Atris openly confesses these feelings to the Sith holocrons shortly after the Exile leaves the academy.\nWith a male Exile, Atris privately orders Brianna to stow away on the Ebon Hawk, presumably to spy on the Exile. And when the other five Handmaidens discover their sister missing, Atris lied to them, saying that Brianna had willingly left with the Exile for reasons that weren't known to her, making it seem that Brianna had voluntarily renounced her oath.\nIn addition to stopping Darth Traya and allowing Atris to choose to find her true self after their battle, the player has an opportunity to kill Atris, or to leave her at the mercy of the Sith holocrons.\nThere is some indication that Atris was originally planned to be the player's party member at some point, most probably after Kreia's departure for Malachor V. For example, the name of her appearance set is \"Party_NPC_Atris\". An unused party member portrait for Atris is also present in the game files. Furthermore, she is the most prominent figure in promotional material for the game, comparable to Bastila Shan in the first game. Bastila was a party member and played a major role in the plot, whereas Atris' role is relatively small.\nShould the Jedi Exile be a male, Brianna would not simply join the Exile out of belief that Atris may have been wrong but rather that Atris had personally sent her to watch the Exile and study him and to make sure that he does not contact the Sith. Originally, Mical, also known as the Disciple, would not only be a spy for Admiral Carth Onasi or Admiral Cede but also for Atris. En route to Telos shortly after the Exile's confrontation with the Jedi Masters in the Jedi Enclave, the Disciple would contact Atris and inform her of the Sith's pending attack.\nWhen the Exile returned to Dantooine to confront the Jedi Masters at the rebuilt Jedi Enclave, a party member was to note Atris was not present at the meeting and ask why she was not there. This party member would then figure out that both Atris and Kreia had been corrupted by the dark side.\nCut content from her dialog with Kreia indicates that Atris's fall involved Kreia making references to Telos, and how twice the choices of the Jedi had marked the planet for destruction, first by Revan as Telos was to host the Jedi and their lore in the avenue of a sudden attack, then by Darth Nihilus because Atris chose to hide there.\nDuring Atris' battle with the Exile, at some point, she would use the Exile's first lightsaber against her, claiming it is not hers to wield anymore.\nOriginally, the light side and dark side endings differed from each other more significantly than in the final game. One possible ending featured Kreia's redemption and Atris's total shift to the dark side, which culminated in the scene where Atris attacked the player wearing a black robe and claimed that she, not Kreia, was Darth Traya. Her dark side model remained in the PC version of the game and can appear in the main menu if the CurSithLord option is set to 1 in swkotor2.ini. An Action Replay mod is needed to view it on the Xbox. You may also use the model in the KOTOR/TSL Save Game Editor. If the KOTOR Save Editor is used, the code for her dark side model is Unique_Darth_Traya, indicating she was meant to become the new Darth Traya.\nLater on, the dark side model of Atris  was planned to be put in the final game for the confrontation with Atris, but it was removed a few weeks before the game was released, with the reason that the presence of the dark side model was confusing the game testers.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Atris_(officer)",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Lost_Jedi",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Jedi_historian",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/Jedi_Civil_War",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Revan/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Revanchist",
  "/wiki/Battle_of_Malachor_V",
  "/wiki/Jedi/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Dark_Wars",
  "/wiki/Conclave_at_Katarr",
  "/wiki/Miraluka/Legends",
  "/wiki/Katarr/Legends",
  "/wiki/Darth_Nihilus",
  "/wiki/Echani/Legends",
  "/wiki/Handmaiden_Sisters",
  "/wiki/Telosian_Jedi_Academy",
  "/wiki/Telos_IV",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Kreia",
  "/wiki/Darth/Legends",
  "/wiki/3996_BBY",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Simikarty",
  "/wiki/First_Great_Schism",
  "/wiki/Draethos_(species)",
  "/wiki/Odan-Urr/Legends",
  "/wiki/Ossus/Legends",
  "/wiki/3964_BBY",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/3963_BBY",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Trial_of_Meetra_Surik",
  "/wiki/Malachor_V",
  "/wiki/Wound_in_the_Force",
  "/wiki/Meetra_Surik%27s_first_lightsaber",
  "/wiki/3954_BBY",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/File:Kreia_admit_it.ogg",
  "/wiki/Visas_Marr",
  "/wiki/The_galaxy/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/3951_BBY",
  "/wiki/Skirmish_at_Peragus_II",
  "/wiki/Peragus_Mining_Facility",
  "/wiki/Peragus_II",
  "/wiki/Telos_Security_Force",
  "/wiki/Brianna",
  "/wiki/Ebon_Hawk",
  "/wiki/T3-M4",
  "/wiki/Skirmish_on_Telos",
  "/wiki/Force_cage",
  "/wiki/Dantooine/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Zez-Kai_Ell",
  "/wiki/Kavar",
  "/wiki/Vrook_Lamar",
  "/wiki/Tobin_(Human)",
  "/wiki/Duel_in_the_Telosian_Jedi_Academy",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Mical",
  "/wiki/Lonna_Vash",
  "/wiki/Force_suppression",
  "/wiki/Ionize",
  "/wiki/Force_Stun",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_drain/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Force_Slow",
  "/wiki/Form_VII/Legends",
  "/wiki/Jedi_Watchman/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Sith_(language)",
  "/wiki/Old_Galactic_Standard",
  "/wiki/Elizabeth_Rider",
  "/wiki/Grey_Griffin",
  "/wiki/Brian_Menze",
  "/wiki/Taris/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Chris_Avellone",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Champions_of_the_Force_(Star_Wars_Miniatures)",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Jedi_Consular",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/Jocasta_Nu/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Admiral/Legends",
  "/wiki/Carth_Onasi",
  "/wiki/Cede",
  "/wiki/Category:Images_of_Atris",
  "/wiki/Knights_of_the_Old_Republic_9",
  "/wiki/Knights_of_the_Old_Republic_29",
  "/wiki/The_Old_Republic:_Revan",
  "/wiki/The_Old_Republic:_Revan_(audiobook)",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cartel_Market",
  "/wiki/Chronicles_of_the_Old_Republic",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/February_7",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Vandar_Tokare",
  "/wiki/Dorjander_Kace",
  "/wiki/Lucien_Draay",
  "/wiki/3959_BBY",
  "/wiki/Chief_Librarian/Legends",
  "/wiki/Ostar-Gal"
 ]
}