{
 "name": "Attichitcuk",
 "display_name": "Attichitcuk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chewbacca's family"
     ]
    }
   ]
  }
 ],
 "content": "Attichitcuk was the father of the Wookiee Chewbacca, who when introducing himself to Han Solo, referred to himself as \"Chewbacca, son of Attichitcuk.\" He and Chewbacca's mother lived in the city of Rwookrrorro on the planet Kashyyyk. By the year 19 BBY, Attichitcuk was already a light-furred elderly Wookiee. Nevertheless, he participated in the Battle of Kashyyyk, serving as a gunner aboard an Oevvaor Jet Catamaran piloted by Zittaasabba and Wullffwarro. The old Wookiee threw thermal detonators at the enemy, having practiced his throw in virtual-reality games played on a mind evaporator headest. He later went on to mentor the Trandoshan Doshanalawook, daughter of Cradossk and clutchmate of Bossk. With his help, Doshanalawook eventually made a name for saving Wookiees from slavery, taking on the alias Chainbreaker.\nAttichitcuk was first mentioned in Star Wars canon in the 2018 Star Wars Anthology film Solo: A Star Wars Story. In the film, Chewbacca mentions him in Shyriiwook, though his name was annotated in the screenplay. Joe Schreiber's junior novelization of the film, presents the conversation translated to Galactic Basic Standard so the reader can understand what Chewbacca says to Han.\nIn Star Wars Legends, Attichitcuk, then known as \"Itchy,\" was created by George Lucas for The Star Wars Holiday Special, a variety show aired by CBS on November 17, 1978, where he was played by actor Paul Gale.\nAttichutcuk's appearance was designed by Joe Johnston, who had worked as head storyboard artist on the Star Wars original trilogy. In his conceptual drawings, Johnston described Attichitcuk as a \"350-375 years old\" Wookiee. Many of Attichitcuk's characteristics can also be attributed to Ralph McQuarrie, who recalled drawing \"an old Wookiee getting up out of his chair and several females and children.\"\nAround October 2002, Attichitcuk was to be reinvented during production of Star Wars: Episode III Revenge of the Sith, the prequel trilogy's conclusion. According to concept artist Sang Jun Lee, \"Chewbacca's father\" was meant to be killed during the course of the movie, which would have prompted Chewie to run away and meet Han Solo. This concept, however, didn't make it into the final film. In January 2003, Lucas told the creation team that a young Han Solo would be featured and that by the time of Episode III, he was being raised on Kashyyyk by Chewbacca. Eventually, both ideas were utterly abandoned.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Attichitcuk",
  "/wiki/Attichitcuk/Legends",
  "/wiki/Special:Upload",
  "/wiki/Wookiee",
  "/wiki/Gender",
  "/wiki/Chewbacca%27s_family",
  "/wiki/Parent",
  "/wiki/Chewbacca",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca%27s_mother",
  "/wiki/Rwookrrorro",
  "/wiki/Planet",
  "/wiki/Kashyyyk",
  "/wiki/Standard_year",
  "/wiki/19_BBY",
  "/wiki/Hair",
  "/wiki/Battle_of_Kashyyyk",
  "/wiki/Oevvaor_Jet_Catamaran",
  "/wiki/Zittaasabba",
  "/wiki/Wullffwarro",
  "/wiki/Thermal_detonator",
  "/wiki/Mind_evaporator",
  "/wiki/Trandoshan",
  "/wiki/Doshanalawook",
  "/wiki/Cradossk",
  "/wiki/Clutchmate",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Attichitcuk",
  "/wiki/Star_Wars",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Shyriiwook",
  "/wiki/Joe_Schreiber",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Star_Wars_Legends",
  "/wiki/George_Lucas",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/CBS",
  "/wiki/November_17",
  "/wiki/1978",
  "/wiki/Paul_Gale",
  "/wiki/Joe_Johnston",
  "/wiki/Original_trilogy",
  "/wiki/Ralph_McQuarrie",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Prequel_trilogy",
  "/wiki/Sang_Jun_Lee",
  "/wiki/2003",
  "/wiki/Deck_the_Halls",
  "/wiki/Life_Day_1",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Tooth_and_Claw",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/The_Tree_of_Life",
  "/wiki/Life_Day_Treasury",
  "/wiki/The_LEGO_Star_Wars_Holiday_Special",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/StarWars.com",
  "/wiki/The_Art_of_Star_Wars_Episode_III:_Revenge_of_the_Sith"
 ]
}