{
 "name": "Atton Repness",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Atton Repness was a New Republic training officer who specialized in remedial pilot training but also abused his position to run a black market ring. He was eventually caught by the New Republic when pilot trainee Lara Notsil anonymously provided them with evidence she gathered against him.\nAtton Repness was trained on the low-gravity world of Vogel 7 and he walked with a slight limp. His career in the New Republic eventually drifted to the training of the worst pilot candidates.\nStudents who transferred to his remedial group would sometimes have their scores altered by Repness, particularly those desperate to be pilots. Most of these pilots would have been washed out of the program but Repness worked \"wonders\" with them and thus had a high success rate. They were essentially blackmailed into helping him steal starfighters.\nThese pilots were generally desperate enough to go along with his plans and because they were of poorer quality, they died in battle faster thus covering his crimes double-fold. Few pilots refused him but Tyria Sarkin did and he was astonished. He begged her to give him a day to put his affairs in order which she agreed to whereby he worked up a psychological profile establishing her as a pathological liar and claimed that she made sexual advances towards him. He also showed her that her true testing scores were way below what she thought they were. Sarkin received a mark for gross insubordination and graduated bottom of her class.\nOwing to his test score manipulation, Repness was promoted from Major to Colonel. He was an ambitious officer and often volunteered for extra duties including duty officer on Coruscant and given command of the training frigate Tedevium. He was the duty officer debriefing Wraith Squadron when Warlord Zsinj attempted a fake ambush on the group while on leave but Garik Loran saw through the trap. Ton Phanan, who was also being debriefed and knew Tyria Sarkin's secret, decided upon a plan to expose the Colonel's shady dealings.\nAfter some cajoling, Phanan and Garik Loran managed to convince the Aldivian farm girl Lara Notsil—who was actually Imperial intelligence agent Gara Petothel in disguise—to enter the New Republic pilot training program. Their plan was to have her appear struggling in need of help with her scores, fitting the stereotype Repness favored in his dealings. This she did and, true to form, he made his customary proposition. The plan was to set off an ion-bomb in the atmosphere of a planet to simulate an accidental explosion but the ship would be diverted to a secret landing site. Being trained by Imperial Intelligence, Petothel had already broken into his quarters and downloaded all the information pertaining to his black-market ring. She also took apart his bug-neutralizing device and turned it into a recorder.\nIt turned out that Repness had gotten extremely paranoid as the years went on and often used his jammer. This paranoia extended to mumbling to himself as he worked and he revealed all of his passwords. Instead of going through with the plan, Petothel forwarded all the information about Repness to General Airen Cracken anonymously so she could not be labeled with the status of a traitor and would be able to join Rogue Squadron or Wraith Squadron.\nWith the trap set, she confronted Repness in his office and announced her intention to expose the colonel. Repness retorted that she wouldn't get the chance as he was going to write a new psychological profile about her and that nobody would believe her. He then struck Petothel very hard, very fast. She was rendered unconscious and he administered a sedative, knocking her out for three days. However, Cracken was alerted, and she was found and soon recovered. Repness' dealings were successfully exposed and he was arrested.\nRepness had a fondness for requisitioning the latest equipment. At the time of his arrest, he had just been given a brand new X-wing and a factory new astromech which were given to \"Notsil\" who renamed the droid \"Tonin\"  as a stab at the disgraced officer. She was admitted to Wraith Squadron soon after.\nWhen Petothel left the squadron to join Zsinj some time later, she described her X-wing and droid as a souvenir of a personal victory over \"a vehement idiot named Repness\".",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Atton_Rand",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gara_Petothel",
  "/wiki/Pilot/Legends",
  "/wiki/Vogel_7",
  "/wiki/Starfighter/Legends",
  "/wiki/Tyria_Sarkin_Tainer",
  "/wiki/Major/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Tedevium",
  "/wiki/Wraith_Squadron",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/Garik_Loran",
  "/wiki/Ton_Phanan",
  "/wiki/Aldivy",
  "/wiki/Imperial_intelligence",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/Tonin",
  "/wiki/X-Wing:_Wraith_Squadron",
  "/wiki/X-Wing:_Iron_Fist",
  "/wiki/X-Wing:_Solo_Command",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Wraith_Squadron_(article)",
  "/wiki/Star_Wars_Gamer_9",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}