{
 "name": "Aubrie_Wyn",
 "display_name": "Aubrie Wyn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 35 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 22 BBY",
      "Jabiim"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Padawan Pack",
      "Padawan Pack",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Sirrus"
     ]
    }
   ]
  }
 ],
 "content": "Aubrie Wyn was the female Human Jedi Padawan of Jedi Master Sirrus and a Jedi healer who served as a Jedi Commander during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. At the age of thirteen, Wyn and her Master were sent to Jabiim to aid the Galactic Republic in the Battle of Jabiim. After the death of Sirrus, Wyn was assigned to the Padawan Pack. When the Republic forces were pushed back by the Separatist-allied Jabiimi Nationalists, the members of the Pack chose to hold off the Nationalist Army at the Cobalt Station long enough for the remaining troops to evacuate. She died on the last day of the battle killing Alto Stratus, the leader of the Jabiimi Nationalists.\nThe female Human Aubrie Wyn was a Force-sensitive who was born around 35 BBY. As a member of the Jedi Order, she trained as a Jedi Padawan under Jedi Master Sirrus during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Wyn was one of the best healers at the Jedi Temple on Coruscant, and she had been selected for advanced training with Jedi Master Mace Windu. Sirrus even believed she was destined to serve on the Jedi Council. However, before that could happen, she and her Master were dispatched to fight on Jabiim.\nNot expecting the savagery of the fighting at Jabiim, Wyn and her Master joined the advance at Outpost Shear in search of Jedi General Obi-Wan Kenobi. Wyn objected to Sirrus's motion to heal a wounded Nationalist soldier, believing that he would only fight again after he had recovered from his injuries. Regardless, she healed the soldier, leaving her to wonder if the Jedi were soldiers or doctors. Sirrus and Wyn rejoined the others at the camp after the outpost was captured, where Wyn tended to the injured.\nShortly thereafter, Stratus launched a massive attack on the Shelter Base. Despite the fact that Skywalker, Kenobi, Alpha, Sirrus, and Wyn arrived in time in a landspeeder with reinforcements at the battle site, the Nimbus commandos planted charges that broke the legs of one of the All Terrain Armored Transports before retreating. While Skywalker and Wyn secured their portion of the base, Kenobi, Sirrus, and Alpha rushed to the fallen AT-AT to rescue the clones. The AT-AT exploded unexpectedly, and Kenobi, Sirrus, and Alpha, who did not have time to flee the scene of the explosion, were included in Jabiim's list of victims. While Sirrus died, Kenobi and Alpha were captured by Separatist commander Asajj Ventress and transported to Rattatak. After the death of Sirrus, Wyn became one of the orphaned Jedi Commanders who comprised the Padawan Pack.\nBy the thirtieth day of battle, eighteen Jedi and nine thousand clones had been killed. General Leska, now the highest-ranking Jedi on Jabiim, ordered the Padawan Pack to avoid the front lines and protect a supply convoy headed toward Cobalt Station, as she refused to send more Padawans to their deaths. By the thirty-second day of battle, while guarding a convoy of All Terrain Experimental Transports and All Terrain Tactical Enforcers, the Padawans were attacked by Stratus's droid forces. Several members of the Pack battled against the droids while Wyn and Windo Nend remained with the convoy. Upon their return, the two Padawans got the convoy moving. Meanwhile, Skywalker and Wyn led the convoy in their landspeeder. Skywalker reported that they defeated the flanking force, while Wyn informed him of the news back from the Shelter Base—the Republic lost three more forward positions. Wyn was adjusting well, but Skywalker was having a much harder time. Kenobi's presumed death had clearly had a bad effect on Skywalker: he had become unstable and reckless, which was clearly felt by the other Padawans, especially Tae Diath, who had well-developed telepathic abilities.\nBy the thirty-fourth day of battle, the convoy protected by the Padawan Pack walked directly into a minefield set up by Alto Stratus's Nimbus commandos. Unable to safely navigate the field, the trapped convoy was quickly attacked by Stratus's forces. While other members of Padawan Pack fought back against their attackers, Wyn held back the Nationalists at Windo Nend's side. The Jabiimi Nationalists soon retreated, allowing the convoy to continue on to Cobalt Station. Once there, while enjoying a brief break in the rain, Wyn and the Padawans witnessed Confederate reinforcements landing on the planet. During a communication with Orliss Gillmunn, the Padawans were informed that General Leska had gone missing and that they were now the highest ranking members of the Grand Army of the Republic on Jabiim. Cobalt Station was the last remaining Republic fortification on the planet, and it stood between Stratus's approaching forces and Monsoon Mesa, the evacuation site for the remaining Jabiimi Loyalists and clone troopers.\nDespite their likelihood of defeat, all of the Padawans agreed to remain at Cobalt Station in order to buy time for the escaping Republic forces. Wyn was initially reluctant to commit herself to what would be an almost certain death, as she was supposed to train with Mace Windu on Coruscant, and as her Master believed, become a member of the Jedi Council. Skywalker offered to send her and Windo Nend to the mesa, but she ultimately decided to stay and fight on her own. All the Jedi, including Anakin, decided to stay as well inspired by Aubrie's speech. The nine Padawans began to prepare for their final battle, mobilizing all combat-ready equipment and surviving clones.\nAt the very last moment, Wyn informed Skywalker that they received a message from Supreme Chancellor Palpatine. Skywalker was ordered to evacuate along with the rest of the Republic forces. He didn't want to abandon his fellow Padawans, but the Chancellor convinced Anakin that they would die anyway, with or without him. Skywalker eventually succumbed to Palpatine's arguments and left Cobalt Station on his Zephyr-G swoop. Aubrie Wyn, a witness to Anakin's conversation with the Chancellor, was sympathetic to Skywalker's decision and, before leaving, she asked him to take the holocron of her deceased teacher, Sirrus, with him. The Confederates eventually attacked and found the defense of Cobalt Station to be far stronger than they had anticipated.\nOn the forty-third day of the battle, the battle had finally reached Separatist commander Alto Stratus's stronghold. As the battle raged, the Padawans fell one by one, sometimes together. Wyn was the last Jedi to stay alive. Taking up the lightsaber of her fallen comrade Vaabesh, she confronted Alto Stratus face-to-face. Wounded from an earlier hit, Stratus had to defend himself from a grounded position. As Wyn moved in for the kill, Stratus hit her square in the chest with a blaster at point-blank range. As she fell forward, her lightsabers plunged into Stratus' chest, killing him as well.\nIn the end, however, her sacrifice proved to be in vain: the Galactic Republic was forced to retreat, leaving the Loyalists on the planet behind cursing at the retreating forces. Following the evacuation, Anakin Skywalker was shown a monument for fallen Jedi built by the planet's natives at the dawn of the Republic on the Republic hospital world of New Holstice. Skywalker added the names of his fallen comrades to the monument, including Aubrie Wyn, by whispering their names into memory moths which would in turn be whispered for eternity by the moth's wings. The struggles of Wyn and the Padawan Pack on Jabiim were later covered up by the administration of Supreme Chancellor Palpatine in an effort to keep negative news of the warfront from reaching the public.\nWyn had light skin, brown eyes, and she wore a Padawan braid in her brown hair. She believed that other people made choices for her since her early childhood. Sirrus believed she was destined for service on the Jedi Council. After she and her Master were assigned to fight on Jabiim, Wyn was upset at the change of plans, since she was had been marked for advanced training with Jedi Master Mace Windu, which both she and her Master believed was a honor. Following Sirrus's death, Aubrie Wyn remained calm and collected, unlike Anakin Skywalker whose mind became chaotic and unfocused. She came to believe there was nothing fair about the entire Clone Wars as Anakin was recalled to the evacuation site. Wyn kept her promises, was also loyal to her friends, and quite selfless, even willing to sacrifice her own live during the battle for Cobalt Station.\nAubrie Wyn was regarded as one of best Jedi healers at the Coruscant Jedi Temple.\nWyn wore simple, brown Jedi apparel and carried a blue-bladed lightsaber. Sirrus entrusted a holocron to Wyn, to return it to the Jedi Temple on Coruscant. Knowing she would not survive a forthcoming battle for Cobalt Station, Wyn passed the holocron on to Anakin Skywalker. In this way, Wyn was able to keep her promise to her master.\nAubrie Wyn first appeared in the 2003 comic book Republic 55, written by W. Haden Blackman and pencilled by Brian Ching.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/35_BBY/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Jabiim/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Padawan_Pack",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sirrus",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_healer/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Battle_of_Jabiim",
  "/wiki/Jabiimi_Nationalists",
  "/wiki/Nationalist_Army",
  "/wiki/Cobalt_Station",
  "/wiki/Alto_Stratus",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Reproduction",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/File:Aubrie_Force_heal.jpg",
  "/wiki/Outpost_Shear",
  "/wiki/Jedi_General/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Unidentified_Jabiimi_soldier_1",
  "/wiki/Force_healing/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Rattatak/Legends",
  "/wiki/File:Windo_and_Aubrie_fighting.jpg",
  "/wiki/General/Legends",
  "/wiki/Leska",
  "/wiki/All_Terrain_Experimental_Transport",
  "/wiki/All_Terrain_Tactical_Enforcer/Legends",
  "/wiki/Windo_Nend",
  "/wiki/Shelter_Base",
  "/wiki/Tae_Diath",
  "/wiki/Mine/Legends",
  "/wiki/Nimbus_commando",
  "/wiki/Monsoon_Mesa",
  "/wiki/Zephyr-G_swoop/Legends",
  "/wiki/Master_Sirrus%27s_holocron",
  "/wiki/File:Alto_and_Aubrie_death.jpg",
  "/wiki/Commander/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Vaabesh",
  "/wiki/File:Memorymoths.jpg",
  "/wiki/Loyalist/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/New_Holstice/Legends",
  "/wiki/Memory_moth/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Padawan_braid/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Holocron/Legends",
  "/wiki/2003",
  "/wiki/Republic_55",
  "/wiki/W._Haden_Blackman",
  "/wiki/Brian_Ching",
  "/wiki/Republic_56",
  "/wiki/Republic_57",
  "/wiki/Republic_58",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_119",
  "/wiki/The_Official_Star_Wars_Fact_File_125",
  "/wiki/The_Official_Star_Wars_Fact_File_128",
  "/wiki/The_Official_Star_Wars_Fact_File_129",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/35_BBY",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Republic_61"
 ]
}