{
 "name": "Audila",
 "display_name": "Audila",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red",
      "white",
      "blue"
     ]
    }
   ]
  }
 ],
 "content": "Audila was a Togruta female living during the Cold War. She was the wife of Juran Reb.\nJuran and Audila first met Risha when the latter, at the age of fourteen, rushed to explore the galaxy. They became both friends and business partners, and the couple stayed in touch with her after Risha went her own way.\nIn 3643 BBY, Audila was kidnapped by a group of assassins while her husband was at work. The kidnappers threatened to kill Audila if Risha didn't meet them at the Czerka mining complex on Tatooine. Risha appeared as expected, but the lead assassin refused to release Audila, saying that his \"liege\" wanted no witnesses. It was then that Risha's partner, the Voidhound, arrived and defeated the assassin leader. Audila was very angry at Risha, blaming the incident on her and asking for reasons. Risha refused to explain that the assassin was after her because of her royal status on Dubrillion. As a result, Audila threatened to sever ties with her. Risha asked Audila to trust her and then gave Audila and her husband some credits to get off Tatooine. Audila accepted them but reminded Risha that she'd want an answer to the events someday.\nJuran and Audila eventually settled on Byllura, running a little frontier mercantile exchange. She sent a short note to Risha, letting her know that they were okay.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Togruta/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Juran_Reb",
  "/wiki/Risha_Drayen",
  "/wiki/The_galaxy/Legends",
  "/wiki/3643_BBY",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Voidhound",
  "/wiki/Dubrillion/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Byllura",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}