{
 "name": "Augwynne Djo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Singing Mountain Clan"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Djo family",
      "New Republic",
      "Witches of Dathomir",
      "Singing Mountain Clan",
      "Singing Mountain Clan"
     ]
    }
   ]
  }
 ],
 "content": "Augwynne Djo was a force-sensitive female human who was the clan mother of the Singing Mountain Clan of the Witches of Dathomir, and eventually rose to be the nominal Queen of Dathomir by 8 ABY, however this was little more than a constitutional formality. Djo was the grandmother of Teneniel Djo, great-grandmother of Tenel Ka, and great-great grandmother of Allana Solo.\nAugywnne Djo had many adventures as clan mother. She once helped Jedi Knight Jax Pavan on his journey to learn the secrets of the Sith Lord Darth Ramage. She also once drove away the Nightsisters, another witch clan, with help from the New Republic, and gained the deed to Dathomir in exchange for 3 favors requested by smuggler Han Solo.\nBorn on the planet of Dathomir decades before the founding of Emperor Palpatine's Galactic Empire, Augwynne Djo was a female Human and a member of the Witches of Dathomir, a society dominated by Force-sensitive women.\nAt some point before the rise of the Empire in 19 BBY, she had become the clan mother of the Singing Mountain Clan, a coven of witches that claimed the territory located in the vicinity of an eponymous landform. Mother Augwynne and her sisters were the guardians of a ruined Star Temple, a type of mysterious pyramid built by the ancient, extragalactic Kwa species in order to protect a powerful artifact capable of transport across the galaxy.\nDuring her tenure as clan mother, the life of Augwynne Djo unfolded in tragedy. All four of her daughters ended up being lost to her, either through death or betrayal. Djo's oldest daughter, Barukka, had dabbled in the forbidden teachings of the dark side of the Force, and the clan mother had been forced to cast her out. Another one of her daughters, Allaya Djo, acted as the clan's warmaster and bore a daughter named Teneniel, but met an untimely death in battle. But worst of all was the loss of Gethzerion, who had always been Mother Augwynne's favorite. Gethzerion and Barukka, both lost to the dark side, became Nightsisters and attempted to murder their own mother, a plan that was only foiled by the sacrifice of their youngest sister Kara'Teel, who gave her life to protect Augwynne. However, following these tragedies, Augwynne decided to adopt Aelta.\nIn 19 BBY, Jedi Knight Jax Pavan visited Dathomir in order to search a Star Temple. After landing on the Singing Mounain, Jax was escorted to Djo's quarters by sisters Magash Drashi and Duala Aidu. After conversing for a bit, Djo granted him permission to journey to the Star Temple. When Pavan returned from the temple, Djo and the other sisters agreed to help Pavan open the SD41263.I holocron in order to learn the secrets of the Sith Lord Darth Ramage. The holocron would only activate after being provided blood from a Force-sensitive being. Djo, Aida, Pavan, and Drashi each donated blood to open the holocron. When the Jedi returned from his infiltration of Kantaros Station, Pavan had his mind cleared of his dark knowledge by Djo, per a request Pavan had made prior.\nDuring the Galactic Civil War, Augwynne informed Jedi Knight Rachi Sitra about a danger one of the Nightsisters, Kyrisa, had represented to her clan. After the murder of her daughter Aelta at the hands of Gethzerion, Augwynne adopted Chastina and gave her a necklace once belonging to Gethzerion.\nIn 8 ABY, Augwynne was present when New Republic members Han Solo, Chewbacca, and Leia Organa arrived at the Singing Mountain Clan. Djo declared Han a free man from the slavery of the Nightsisters after Leia presented his case. Learning Han owned the deed to Dathomir, she gave him the chance to make three requests in order to gain it. Han asked Djo to get him off Dathomir, give him the gold and gems that were plentiful on the planet, and find a way to get Leia to marry him. However, she did not complete Han's third request, as she believed she could not force Leia to marry Han. Augwynne went to her chambers, conversing with the Council of Sisters  about the danger of fighting the Nightsisters. Djo had no choice but to lead the sisters of the Singing Mountain Clan against the Nightsisters in order to give Han time to get the Millennium Falcon off Dathomir. She requested help from the Red Hills Clan and Frenzied River Clan however neither clan offered forces or assistance. Thanks to Jedi Knight Luke Skywalker, Chume'da Isolder of the Hapes Consortium, Han Solo, Leia Organa, Chewbacca, and her granddaughter Teneniel, the sisters of the Singing Mountain Clan were able to drive the Nightsisters away. Augwynne and the sisters were finally rid of the Nightsisters when they were shot down trying to escape Dathomir by the forces of warlord Zsinj whose empire ruled the Quelii sector. After the Battle of Dathomir, Augwynne became the owner of Dathomir when Han Solo turned over the deed. Around the same time, her surviving daughter Barukka returned from the dark and rejoined the clan, much to Augwynne's joy. Augwynne advocated for Dathomir's membership in the New Republic.\nIn 23 ABY, Luke and Augwynne's great-granddaughter Tenel Ka Djo came to Dathomir for Augwynne's help in finding the resurgent Nightsisters and the Shadow Academy. Augwynne spoke with the Council of Sisters. When returning, she stated to Luke that visitors would be coming by and could answer their questions. After Great Canyon Clan visitors Vonnda Ra and Vilas came by and told the story of the Nightsisters, Luke and Tenel decided to go to the Great Canyon. Before their departure, Augwynne gave them cloaks and hugged Tenel, embracing her before sending them off. That same year, Augwynne's favorite rancor died and Tenel Ka kept two of the animal's smaller teeth, which she used as the hilt for her lightsaber. In 24 ABY, she and the rest of the Djo family visited Tenel when she graduated from the Jedi Praxeum on Yavin 4.\nDjo had pale eyes and hair the color of moonlight. She was tall and regal, with facial features considered handsome by her fellow Humans, as well as graceful, long-fingered hands. By 19 BBY, she had the appearance of a sixty-year old woman.\nUnlike her fellow sisters, Djo was more welcome to outsiders. She was shrewd and calculating, having been able to manipulate Han Solo into the bargain that gained her the deed to Dathomir. She tended to stick to her clan laws, but tended to break them at times.\nDjo was skilled in Allyan Magic, exhibiting many force abilities. Using the force, she could absorb and dissipate energy, heal, control pain, conjure shields, communicate with others at long distances, read people's thoughts and feel their emotions, use telekinesis, kill people telekinetically, create storms telekinetically, comprehend speech, transfer force, and drain people of knowledge. She also knew how to swim, which she taught her great-granddaughter, Tenel Ka.\nWhen in full regalia, Mother Djo wore a tunic of glittering yellow scales over a hide robe with black lizard shapes sewn around the hem. Her ceremonial headdress was made of smooth golden wood, and was decorated with cabochons of yellow tigereye. On other occasions, Djo was known to wear a coronet of aurodium.\nAugwynne Djo first appeared in the 1994 novel, The Courtship of Princess Leia, written by Dave Wolverton.\nOddly, Cracken's Threat Dossier states that she was the one to have married Han and Leia Solo, however this contradicts The Courtship of Princess Leia. This article assumes the The Courtship of Princess Leia is correct. Star Wars Encyclopedia incorrectly states that Augwynne took over as the clan's mother due to the death of her daughter Allaya. However, multiple sources establish that she was mother long before the death of Allaya. This article assumes that those sources are correct.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Singing_Mountain_Clan",
  "/wiki/Djo_family",
  "/wiki/New_Republic",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Clan_mother",
  "/wiki/Queen/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Monarchy/Legends",
  "/wiki/Teneniel_Djo",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Allana_Solo",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jax_Pavan",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Ramage",
  "/wiki/Nightsisters/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Coven/Legends",
  "/wiki/Singing_Mountain/Legends",
  "/wiki/Sister_(Witches_of_Dathomir)",
  "/wiki/Star_Temple",
  "/wiki/Extra-galactic",
  "/wiki/Kwa",
  "/wiki/Species/Legends",
  "/wiki/Infinity_Gate",
  "/wiki/The_galaxy/Legends",
  "/wiki/Death/Legends",
  "/wiki/Barukka",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Allaya_Djo",
  "/wiki/Gethzerion",
  "/wiki/Kara%27Teel",
  "/wiki/Aelta",
  "/wiki/Jedi_Knight",
  "/wiki/Magash_Drashi",
  "/wiki/Duala_Aidu",
  "/wiki/SD41263.I",
  "/wiki/Holocron/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Infiltration_of_Kantaros_Station",
  "/wiki/Kantaros_Station",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Rachi_Sitra",
  "/wiki/Kyrisa",
  "/wiki/Chastina",
  "/wiki/Necklace/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Slavery/Legends",
  "/wiki/Gold/Legends",
  "/wiki/Council_of_Sisters",
  "/wiki/Tannath",
  "/wiki/Azbeth",
  "/wiki/Shen_(Dathomiri)",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Red_Hills_Clan",
  "/wiki/Frenzied_River_Clan",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Chume%27da",
  "/wiki/Isolder",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/Zsinj%27s_Empire",
  "/wiki/Quelii_sector",
  "/wiki/Battle_of_Dathomir_(Hunt_for_Zsinj)",
  "/wiki/23_ABY/Legends",
  "/wiki/Shadow_Academy",
  "/wiki/Great_Canyon_Clan",
  "/wiki/Vonnda_Ra",
  "/wiki/Vilas",
  "/wiki/Great_Canyon_(Dathomir)/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Tenel_Ka_Djo%27s_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/24_ABY/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yavin_4/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Color/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Dathomir_Magic",
  "/wiki/Force_power/Legends",
  "/wiki/Tutaminis",
  "/wiki/Force_healing/Legends",
  "/wiki/Control_Pain",
  "/wiki/Force_barrier/Legends",
  "/wiki/Projective_Telepathy",
  "/wiki/Receptive_Telepathy",
  "/wiki/Telekinesis/Legends",
  "/wiki/Telekinesis/Legends#Force_Kill",
  "/wiki/Telekinesis/Legends#Force_Whirlwind",
  "/wiki/Comprehend_Speech",
  "/wiki/Transfer_Force",
  "/wiki/Drain_Knowledge",
  "/wiki/Wood/Legends",
  "/wiki/Aurodium/Legends",
  "/wiki/1994",
  "/wiki/The_Courtship_of_Princess_Leia",
  "/wiki/Dave_Wolverton",
  "/wiki/Cracken%27s_Threat_Dossier",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Category:Images_of_Augwynne_Djo",
  "/wiki/The_Last_Jedi_(novel)",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/The_Courtship_of_Princess_Leia_(audiobook)",
  "/wiki/Young_Jedi_Knights:_Shadow_Academy",
  "/wiki/Young_Jedi_Knights:_Lightsabers",
  "/wiki/Young_Jedi_Knights:_Crisis_at_Crystal_Reef",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Template:SWGTCG",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Republic:_Infinity%27s_End",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_139",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_Essential_Atlas",
  "/wiki/0_BBY/Legends",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}