{
 "name": "Aurin Leith",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Aurin Leith was a Human female doctor who served as a member of the Alliance to Restore the Republic during the Galactic Civil War.\nBorn on Coruscant, Aurin attended the Byblos Academy of Medicine on the planet Byblos, ultimately graduating and becoming a doctor. She worked at the University Faculty Medical Center on Ralltiir when she honed her skills. She eventually joined the Rebel Alliance and became a hospital ship medic. She was stationed on the Pharos.\nSoon after joining the Rebellion, Aurin was assigned to \"temporary detached duty\" to Koris Haslam's commando group, which consisted of Haslam, Melenna Seltrayne, Gowan Ch'lessan, Liak, and Barsoulentinial Enkhet. They were ordered to keep Gebnerret Vibrion, the head of a Rebel cell imprisoned by the Galactic Empire on Selnesh, from spilling any secrets, either by freeing him or killing him. Vibrion was an elderly Human afflicted with Zithrom's syndrome and required continuous doses of Clondex to survive, thus necessitating the addition of Dr. Leith to the team. Aurin was unhappy with the prospect of killing Vibrion, since it conflicted with her medical oath to \"do no harm.\" She eventually agreed to give him a dose of conergin to knock him out if it became necessary for Haslam to kill him\nThe commandos planned to enter the prison with Haslam posing as an Imperial officer, Gowan and Enkhet posing as stormtroopers, Melenna and Gowan posing as smugglers suspected of Rebel sympathies, and Aurin posing as a passenger on Melenna's ship to Sestooine picked up by mistake. Upon entering the prison, Haslam claimed he was a member of Imperial Intelligence and convinced the guards to exit Vibrion's cell block and shut off the security cameras. Aurin was able to treat Vibrion, who had managed to sneak some Clondex into the prison, and the team proceeded to escape through the access tunnels.\nUnfortunately, when the team reached the hangar bay Aurin spotted a stormtrooper ambush. With no time to warn the others, she was forced to shoot the trooper herself, breaking her medical oath. The team was able to escape, and Aurin was awarded the Field Achievement Award given to all field operatives who survive a mission. Still upset over having had to kill, she threw it in a drawer and never looked at it again.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Aurin_(disambiguation)",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Byblos_Academy_of_Medicine",
  "/wiki/Byblos/Legends",
  "/wiki/University_Faculty_Medical_Center",
  "/wiki/Ralltiir/Legends",
  "/wiki/Hospital_ship/Legends",
  "/wiki/Pharos",
  "/wiki/Koris_Haslam",
  "/wiki/Melenna_Seltrayne",
  "/wiki/Gowan_Ch%27lessan",
  "/wiki/Liak",
  "/wiki/Barsoulentinial_Enkhet",
  "/wiki/Gebnerret_Vibrion",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Selnesh/Legends",
  "/wiki/Zithrom%27s_syndrome",
  "/wiki/Clondex",
  "/wiki/Conergin",
  "/wiki/Mission_to_Selnesh",
  "/wiki/Smuggler/Legends",
  "/wiki/Sestooine",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Field_Achievement_Award",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Do_No_Harm",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}