{
 "name": "Auromae Iselo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Melbu"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Amber"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Reddish-brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cloud-Riders"
     ]
    }
   ]
  }
 ],
 "content": "Auromae Iselo was a male Melbu bounty hunter. Possessing a strong sense of justice, his frustration with the number of political targets he was assigned by the Galactic Empire inspired him to pursue and punish violent criminals, joining Enfys Nest's Cloud-Riders gang as a vigilante.\nHailing from a world that was at some point devastated by the Galactic Empire, the male Melbu Auromae Iselo worked as a bounty hunter during the Empire's reign. After becoming frustrated with the number of political bounties he was being assigned by the Empire, he ceased to work within the corrupt bureaucracy and instead became a vigilante. By 10 BBY, Iselo had joined up with the Cloud-Riders, a group led by the human Enfys Nest who opposed the Empire and its criminal allies.\nIn 10 BBY, Iselo was amongst the Cloud-Riders who accompanied Nest to the planet Savareen in order to find a group of criminals led by the thief Tobias Beckett and associated with the Crimson Dawn syndicate. The criminals had just managed to steal a large amount of raw coaxium from the planet Kessel and were on Savareen to have it refined before handing it over to Crimson Dawn's leader, Dryden Vos.\nThe Cloud-Riders, who needed the coaxium to use against the Empire, confronted Beckett and his allies in a standoff outside a cantina in a village on the Pnakotic Coast. Initially Iselo and the other Cloud-Riders kept their weapons aimed at the criminals as Nest addressed them, but after a failed bluff by the criminal Han Solo claiming that there were thirty mercenaries waiting to reinforce them, Nest removed her helmet and lowered her weapon before heading into the cantina for a drink and the Melbu and his allies followed suit.\nIn the cantina, Nest explained the Cloud-Riders fight against the Empire and syndicates to Beckett's gang and appealed to them to join forces against Vos. All bar Beckett were won over by the speech, and after the thief had left the village, Solo and the others worked with Iselo and the other Cloud-Riders to set a trap for Vos and Beckett, who they suspected would betray them.\nIselo and several other Cloud-Riders, including Nest, gave their headwear to the inhabitants of village they were in and then hid nearby as the villagers impersonated the Cloud-Riders as decoys. When Vos arrived on his yacht, the First Light, he dispatched his Hylobon Enforcers led by Aemon Gremm to attack the Cloud-Riders and reclaim the coaxium from them as he had been informed by Beckett that Solo had betrayed him and sided with Nest. The real coaxium however, was with Solo, who boarded the yacht with his allies to meet with Vos.\nAfter the Hylobon surrounded the villagers and reported their apparent success to Vos, they discovered that the false Cloud-Riders did not in fact have the coaxium, at which point Iselo and the other true Cloud-Riders attacked the enforcers. The Melbu rushed at the foe on foot and battle with them, ultimately standing over two of the defeated Hylobon with his blaster on them after the enforcers were overwhelmed.\nWith the Hylobon enforcers defeated and Vos left undefended, Solo his comrades ultimately killed Vos and Beckett and returned the coaxium to Nest. Once the coaxium was secured on the Cloud-Riders' speeder bikes, Iselo and the others waited by the bikes as Nest exchanged a few final words with Solo. The group then mounted the bikes and waited for Nest to launch first, taking off and leaving the village behind. The Cloud-Riders then traveled to a rendezvous with the leader of the Partisans rebel movement, Saw Gerrera, to whom they gave the coaxium to aid in his fight against the Empire.\nIselo had amber eyes and mottled green and reddish-brown skin. While serving the Empire, Iselo was frustrated with being given political targets as his strong sense of justice prompted him to seek out and punish violent criminals instead.\nIselo wore red and black robes while riding with the Cloud-Riders, including a red cowl that hid his Melbu respirator horns. He also covered his face with a silver mask and wore a red and white belt and black boots. The Melbu carried a white blaster rifle and a tuft of hair from a loyal bantha he once used as a mount.\nAuromae Iselo was portrayed by Derek Arnold in the 2018 Star Wars Anthology film Solo: A Star Wars Story and was identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo.\nAuromae's design was inspired by a drawing made by Louie Lunt Davies, the then seven year old child of creature designer Jake Lunt Davies and his name is an anagram of their name. Louie's father had taken some of their drawings since the production of the Star Wars sequel trilogy began in 2014. Star Wars: Episode VIII The Last Jedi director Rian Johnson highly considered to use Auromae in the film and Jake drew him in a casino outfit for the Canto Bight sequence, but his inclusion was ultimately dropped.\nAccording to Jake, Louis became really excited upon knowing that Iselo had been selected and more when he informed them that Iselo had been sculpted. Shortly afterwards, Jake emailed Lucasfilm Story Group's Pablo Hidalgo telling him the story and asking him if the character's could be somehow based off Louie's name and Hidalgo semi-anagrammed it into Auromae Iselo.\nIselo's costume was later reused in the 2019 television show The Mandalorian.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Melbu",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cloud-Riders",
  "/wiki/File:Enfys-Allies.ogg",
  "/wiki/Bounty_hunter",
  "/wiki/Politics",
  "/wiki/Galactic_Empire",
  "/wiki/Enfys_Nest",
  "/wiki/File:Enfys_and_Beckett.ogg",
  "/wiki/Imperial_Era",
  "/wiki/Bounty",
  "/wiki/10_BBY",
  "/wiki/Human",
  "/wiki/Planet",
  "/wiki/Savareen",
  "/wiki/Beckett%27s_gang",
  "/wiki/Thief",
  "/wiki/Tobias_Beckett",
  "/wiki/Crimson_Dawn",
  "/wiki/Raid_on_Kessel",
  "/wiki/Coaxium",
  "/wiki/Kessel",
  "/wiki/Dryden_Vos",
  "/wiki/File:Enfys-Drink.ogg",
  "/wiki/Cantina",
  "/wiki/Pnakotic_Coast_village",
  "/wiki/Pnakotic_Coast",
  "/wiki/Han_Solo",
  "/wiki/Mercenary",
  "/wiki/File:Aemon-Empty.ogg",
  "/wiki/Yacht",
  "/wiki/First_Light",
  "/wiki/Hylobon_Enforcers",
  "/wiki/Aemon_Gremm",
  "/wiki/Hylobon",
  "/wiki/Blaster",
  "/wiki/Death",
  "/wiki/Speeder_bike",
  "/wiki/Partisans",
  "/wiki/Saw_Gerrera",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Blaster_rifle",
  "/wiki/Hair",
  "/wiki/Bantha",
  "/wiki/Jake_Lunt_Davies",
  "/wiki/Derek_Arnold",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Louie_Lunt_Davies",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/2014",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Rian_Johnson",
  "/wiki/Canto_Bight",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/2019",
  "/wiki/The_Mandalorian",
  "/wiki/Category:Images_of_Auromae_Iselo",
  "/wiki/Solo:_A_Star_Wars_Story_Read-Along_Storybook_and_CD",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_6",
  "/wiki/StarWars.com",
  "/wiki/Entertainment_Weekly%27s_The_Ultimate_Guide_to_Han_Solo",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Dee_Tails",
  "/wiki/Phil_Szostak",
  "/wiki/Chapter_1:_The_Mandalorian"
 ]
}