{
 "name": "Aurra Sing",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    },
    {
     "name": "Born",
     "values": [
      "51 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 21 and 10 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Palliduvan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "56 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Fiery brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Biocomputer"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Cad Bane's group",
      "Hutt Clan",
      "Krayt's Claw"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Boba Fett"
     ]
    }
   ]
  }
 ],
 "content": "Aurra Sing was a Force-sensitive female Palliduvan who left the Jedi Order to take up the life of a bounty hunter. Operating prior to and during the Clone Wars, she was present on Tatooine, where she watched the Boonta Eve Classic podrace, during the Trade Federation's invasion of the planet Naboo. During this time, she also became acquainted with Weequay pirate captain, Hondo Ohnaka. After the outbreak of the Clone Wars and the death of fellow bounty hunter Jango Fett, Sing trained Fett's son, Boba Fett, and helped him in an unsuccessful attempt to kill Jedi Master Mace Windu, who killed Jango on Geonosis. After parting ways with Boba, Sing took jobs from Ziro the Hutt and Cad Bane. Sing's bounty hunter career, however, ultimately came to an end with her death at the hands of Tobias Beckett.\nBorn to a father she never knew and a mother too poor to raise her, Aurra Sing was a Force-sensitive Palliduvan who became part of the Jedi Order. Eventually she left the Order to become a bounty hunter, taking her lightsaber with her. She would later tell others of her past with the Jedi, but her word was not taken as fact.\nAs a feared hunter known for her chalk-white skin and built-in comlink antenna, Aurra Sing was an expert sniper and trained assassin who would work for anyone who paid her. She was a known associate of Jango Fett and was at one point involved in a relationship with Hondo Ohnaka. On Nar Shaddaa, she and fellow bounty hunters Cad Bane and Vorhdeilo met Sith Lord, Darth Maul. Sing picked up a transmission that Jedi were on their way to Hutta Town to investigate. Together with Bane's group, despite Sing's suspicions about Maul, they attended Xev Xrexus's Cartel's auction of the Jedi Padawan Eldra Kaitis.\nDuring the auction, Sing, Bane, and Vorhdeilo spoke with Maul aboard their ship. Together, they planned to take Kaitis from Jee Kra, who had successfully won the padawan in the auction. Sing and her compatriots killed Kra's crew. Sing, Maul and the others met Kra and Kaitis at his ship. After Maul subdued Kra and his remaining crew, Sing spoke with Bane about about leaving or killing Maul after their job was done. Having discovered the theft, Xrexus ordered the ship shot down.\nAfter the group crashed onto the moon of Drazkel below, Xrexus allowed the rest of the bidders to hunt them down for sport and offered Kaitis to anyone who captured her. Maul and Kaitis split off from the group to distract the hunters, instructing the bounty hunters to steal a ship. Turning the tables on the hunters, Bane, Sing, and Vorhdeilo set a trap. Bane lured a group of Trandoshan hunters into a kill zone, where Sing sniped them from a distance and Vorhdeilo attacked them at close range. The group then stole a Ohnaka Gang starship and picked up Maul, who promised they would be compensated.\nTen years before the start of the Clone Wars, Sing was on the Outer Rim world of Tatooine during the time of the Boonta Eve Classic podrace. Sing watched the podrace from a balcony on Beggar's Canyon, and became impressed by the flying skills displayed by Anakin Skywalker. A hologram image depicting Jabba Desilijic Tiure paying Sing as two of his underlings dragged the injured podracer Neva Kee away from his crashed Podracer was acquired some time later by the Coruscant Security Force police inspector Tan Divo. All identifying authentimarks were scrubbed from the hologram, making it impossible to confirm its legitimacy, but if true, the image suggested Sing had a hand in Kee's demise. Divo developed a theory that Farwan \u0026 Glott, the original manufacturers of Kee's podracer, hired Sing to take out Kee so that they could acquire the podracer customization secrets that he refused to reveal.\nAt some point prior to 22 BBY, Sing was vacationing aboard the Halcyon, along with the Clawdite bounty hunter, Zam Wesell, where she was hired by a man named Colram Vestig for protection against the Hutts, whom he owed a great sum of credits. As Vestig was negotiating with Sing, his son Wilmar approached to pester his father about his promises to let him join a safari to the planet Numidian Prime to see the native Predavorexxes. Vestig shooed his child away, and soon after, they were approached by a representative of the Hutts aboard the Halcyon. Sing attacked the man, but he informed her and Vestig that his bosses now had possession of the boy, and they followed him to Numidian Prime to retrieve him. As they were departing the ship, the droid D3-O9 warned Sing that the Halcyon was approaching a solar storm, which had caused all other passenger excursions from departing as scheduled. This, however, did not deter the bounty hunter.\nThey were led to a band of Weequays, who had Wilmar held at gunpoint. They let loose a wild Predavorexx to attack Sing, much to the alarm of the representative who had been sent to collect Sing, who was still down on the ground with her when the creature attacked. The Hutts began to gamble on Sing's chances of success, but to their collective dismays, Aurra came out victorious in the match. With the help of Wessell, who had taken on the form of a Weequay in order to sneak behind the child's captors, Sing defeated the Weequays. She then returned to the transport and flew back to the Halcyon, where she returned Wilmar to Vestig. The Halcyon narrowly avoided the solar storm. Shortly after, the Hutts finalized their purchase of the pleasure vessell, and so the bounty hunter pair decided to cut their vacation short and slink off at the next spaceport.\nDuring the Clone Wars, Sing joined up with Boba Fett to kill Mace Windu for revenge for Boba's father, who Windu had killed on Geonosis. Boba, under the name of \"Lucky,\" boarded the Endurance as a clone cadet. After his first attempt on Windu's life failed, he contacted Sing to ask for advice. Sing told him to blow up the reactors, much to Boba's surprise. After Boba successfully destroyed the Endurance's reactors, sending it crashing towards Vanqor, he got into one of the escape pods along with several of the other cadets. Once they were away from the plummeting vessel, the pod was docked by Slave I. Bossk and Sing entered the pod to confront Boba. After telling him that the other cadets must be launched into space, due to the fact that they were \"living witnesses,\" Boba reluctantly came aboard Slave I and jettisoned the pod from Slave I's docking area. Although the group of bounty hunters escaped, the cadets were saved by Anakin Skywalker and Windu, who had escaped the Endurance in their Jedi starfighters.\nSing and her crew reached the crashed cruiser before the Jedi. There, she encountered and executed multiple clone survivors, shooting them in the back or chest. She later abducted Admiral Kilian, Commander Ponds, and a naval officer from the crash site of the Endurance on Vanqor. After Skywalker and Windu triggered their bomb in the crash site, Boba convinced Sing to go back to get the two Jedi's heads to bring to Count Dooku, who might pay them for their trouble. Sing, along with Boba and Castas, went to the crash site. Due to the ship falling apart, and R2-D2's interference, Sing decided to blow up the crash site. As they left, Bossk contacted Sing, telling that a explosion happened near where the Jedi landed. Sing then ordered Bossk to jam all transmissions from the planet. When Sing and her team returned to Slave I, they saw Windu's Jedi starfighter taking off. Unbeknownst to Sing, only R2-D2 was aboard. Though Slave I took out the Jedi fighter's communications, Artoo reached the hyperspace rings and escaped. Knowing that Windu would not hold a grudge against them, she decided to motivate Windu by using the hostages.\nWhen contacting Windu to come and find her, Sing shot Ponds and later ejected his body into space after Boba wouldn't do it. The group of bounty hunters then docked on Florrum for a visit with Sing's old flame Ohnaka to see if he would give them any advice. During a visit in the bar with Hondo, Sing overheard Castas communicating via hologram to a friend on Coruscant. After hearing him calling her an old hag, she shot him. Plo Koon and Ahsoka Tano later caught up with her. After having a quarrel in a room, Sing fled, leaving a discouraged Boba behind. Tano chased her, but after getting an order from Koon, she went to free the hostages. Sing got suspicious, so she went to go and stop the Padawan. After Tano pursued her, she fled on Slave I, but because of a wing failure caused by Tano, the ship crashed. Sing was presumed dead by the Jedi. Unknown to them, Hondo salvaged her out of Slave I's wreckage.\nSing was later hired by Ziro the Hutt to assassinate Senator Padmé Amidala in retaliation for imprisoning him. She tracked the Senator to Alderaan, where Amidala was due for a conference on refugee concerns. Infiltrating the conference through the vents and snapping the neck of several Senate Commandos, Sing set up a sniper position. Only the timely intervention of Tano gave Amidala a flesh wound, forcing Sing to flee.\nSing later made a second attempt on Amidala's life when she tracked down the Senator, not being fooled by the BD-3000 luxury droid acting in her place. But once again, Tano interfered. Sing outdrew Tano as she grazed the Padawan, but Amidala used a stun blaster on her. Sing was then arrested and brought to Coruscant.\nLater in the Clone Wars, Sing escaped Republic captivity and teamed up with Cad Bane's bounty hunter team for the raid on the Republic Senate Building, with the object of taking hostages to free Ziro the Hutt from his imprisonment. During the hostage siege Aurra covered Bane's entrance to the building by positioning herself at the top of a nearby building and taking out the Senate Commandos who attempted to stop him with a sniper rifle. After Bane eliminated the remaining Senate Commandos, Aurra shot a dying trooper who was lying on the ground. Later she aided Shahan Alama in searching for the Jedi Knight Anakin Skywalker, whose presence in the Senate Building threatened to thwart Bane's plan. Eventually, with the help of Robonino, the hunters managed to render Skywalker unconscious. When the Hutt crime lord was freed, Sing successfully left the crime scene along with the rest of the group.\nAt some point before 10 BBY, Tobias Beckett took a job for Crimson Dawn crime lord Dryden Vos which resulted in the death of Sing. Sing's death pleased Vos, and he gave Beckett a bonus. Sing's death was later recalled to Beckett while talking with Lando Calrissian, who was also pleased by her demise due to his large debt to her, though Beckett claimed that he just gave Sing a push and that it was the fall that killed her.\nSing's former flame Hondo Ohnaka included her in his book The Secrets of the Bounty Hunters and reflected on his past with her. While he believed the galaxy was safer with her dead, he found that there were times when he missed his old lover. In 34 or 35 ABY, during the war between the First Order and the Resistance, the droid D3-09 told the tale of her exploits with Zam Wessell during their stay aboard the Halcyon, reflecting that both bounty hunters had met grisly fates.\nAurra Sing was one of the most powerful and ruthless bounty hunters in the galaxy. She had no qualms about killing, whether it be executing wounded clone troopers or former partners such as Castas. Despite her ruthlessness, Sing was also somewhat of a mother figure to Boba Fett during his teenage years, sometimes addressing him as \"Honey\" and stopping him from drinking alcohol in Hondo Ohnaka's bar. Despite this, she was also selfish, and she abandoned Fett to save herself after the boy was captured by Plo Koon.\nSing also tried to serve as a mentor to Fett, as shown by when she tried to make him murder the helpless Clone Commander Ponds and, when he hesitated, she simply shoved him aside and killed Ponds herself. Aurra Sing also had a romantic relationship with Hondo Ohnaka, and though they were no longer lovers, Ohnaka still referred to her as \"My Dear.\" Consequently, after Sing and Boba arrived at Ohnaka's base, he asked if Boba was his son. Even with their past, Ohnaka refused to help Sing when she tried to lure Ahsoka Tano and Plo Koon into a trap.\nSing was very skilled markswoman as she effortlessly shot several Senate Commandos with a sniper rifle without being seen. She posed a considerable amount of strength as she snapped the neck of a Senate Commando and was even able to completely close her large hand around the smaller Ahsoka Tano's throat.\nThe character of Aurra Sing was first conceived in a sketch labeled \"Babe Fett\" by Lucasfilm's Doug Chiang. Chiang had made the sketch as a result of George Lucas' request to have more characters fill out the podracing sequence in the 1999 film Star Wars: Episode I The Phantom Menace. In the film, Sing was played by model Michonne Bourriague in a cameo appearance. She was voiced by Jaime King in the Star Wars: The Clone Wars TV series.\nThe dark strip of makeup across Aurra Sing's eyes in the The Clone Wars episode Assassin is a homage to a similar look worn by Daryl Hannah in the 1982 classic film Blade Runner, which starred Star Wars actor Harrison Ford. In May 2018, Kyle Newman, King's husband, revealed that Sing was planned to be killed in one of the unfinished episodes of the Clone Wars series. Sing's death was later revealed in the 2018 Star Wars Anthology film Solo: A Star Wars Story.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Aurra_Sing",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Dangerous_Debt",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Halcyon_Legacy_2",
  "/wiki/Star_Wars:_Jedi_vs._Sith_(book)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Aurra_Sing",
  "/wiki/Nar_Shaddaa",
  "/wiki/51_BBY",
  "/wiki/21_BBY",
  "/wiki/10_BBY",
  "/wiki/Palliduvan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Biocomputer",
  "/wiki/Jedi_Order",
  "/wiki/Cad_Bane%27s_group",
  "/wiki/Hutt_Clan",
  "/wiki/Krayt%27s_Claw",
  "/wiki/Boba_Fett",
  "/wiki/Force-sensitive",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_Wars",
  "/wiki/Tatooine",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Podracing",
  "/wiki/Trade_Federation",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Planet",
  "/wiki/Naboo",
  "/wiki/Time",
  "/wiki/Weequay",
  "/wiki/Pirate",
  "/wiki/Captain",
  "/wiki/Hondo_Ohnaka",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Cloning",
  "/wiki/Death",
  "/wiki/Bounty",
  "/wiki/Jango_Fett",
  "/wiki/Jedi_Master",
  "/wiki/Mace_Windu",
  "/wiki/Geonosis",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Cad_Bane",
  "/wiki/Tobias_Beckett",
  "/wiki/Reproduction",
  "/wiki/Aurra_Sing%27s_father",
  "/wiki/Aurra_Sing%27s_mother",
  "/wiki/Jedi",
  "/wiki/Comlink",
  "/wiki/Antenna",
  "/wiki/Sniper",
  "/wiki/Assassin",
  "/wiki/Vorhdeilo",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Hutta_Town",
  "/wiki/Xev_Xrexus",
  "/wiki/Xrexus_Cartel",
  "/wiki/Auction_of_Eldra_Kaitis",
  "/wiki/Padawan",
  "/wiki/Eldra_Kaitis",
  "/wiki/Starship",
  "/wiki/Jee_Kra",
  "/wiki/Moon_of_Drazkel",
  "/wiki/Skirmish_on_the_moon_of_Drazkel",
  "/wiki/Trandoshan",
  "/wiki/Ohnaka_Gang",
  "/wiki/Standard_year",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Beggar%27s_Canyon",
  "/wiki/Hologram",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Podracer_(profession)",
  "/wiki/Neva_Kee",
  "/wiki/Podracer",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Law_enforcement_agency",
  "/wiki/Inspector",
  "/wiki/Tanivos_Exantor_Divo",
  "/wiki/Farwan_%26_Glott",
  "/wiki/22_BBY",
  "/wiki/Halcyon",
  "/wiki/Clawdite",
  "/wiki/Zam_Wesell",
  "/wiki/Colram_Vestig",
  "/wiki/Credit",
  "/wiki/Wilmar",
  "/wiki/Numidian_Prime",
  "/wiki/Predavorexx",
  "/wiki/Droid",
  "/wiki/D3-O9",
  "/wiki/Solar_storm",
  "/wiki/Spaceport",
  "/wiki/Parent",
  "/wiki/Endurance",
  "/wiki/Clone_cadet",
  "/wiki/Reactor",
  "/wiki/Vanqor",
  "/wiki/Escape_pod",
  "/wiki/Cadet",
  "/wiki/Slave_I",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Realspace",
  "/wiki/Anakin_Skywalker",
  "/wiki/Delta-7B_Aethersprite-class_light_interceptor",
  "/wiki/Admiral",
  "/wiki/Shoan_Kilian",
  "/wiki/Clone_Commander",
  "/wiki/CT-411",
  "/wiki/Clone_navigation_officer",
  "/wiki/Mission_to_Vanqor",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Castas",
  "/wiki/R2-D2",
  "/wiki/Starfighter",
  "/wiki/Hyperspace_transport_ring",
  "/wiki/Florrum",
  "/wiki/Cantina",
  "/wiki/Coruscant",
  "/wiki/Plo_Koon",
  "/wiki/Ahsoka_Tano",
  "/wiki/Second_mission_to_Florrum",
  "/wiki/Hutt",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Raid_on_Ziro%27s_Palace",
  "/wiki/Alderaan",
  "/wiki/Alderaan_Refugee_Conference",
  "/wiki/Refugee",
  "/wiki/Senate_Commando",
  "/wiki/BD-3000_luxury_droid",
  "/wiki/Stun",
  "/wiki/Galactic_Republic",
  "/wiki/Senate_hostage_crisis",
  "/wiki/Galactic_Senate_Building",
  "/wiki/Sniper_rifle",
  "/wiki/Shahan_Alama",
  "/wiki/Jedi_Knight",
  "/wiki/Robonino",
  "/wiki/Crime_lord",
  "/wiki/Crimson_Dawn",
  "/wiki/Dryden_Vos",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/34_ABY",
  "/wiki/35_ABY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/The_galaxy",
  "/wiki/Clone_trooper",
  "/wiki/Alcohol",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Doug_Chiang",
  "/wiki/George_Lucas",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Michonne_Bourriague",
  "/wiki/Jaime_King",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Assassin_(episode)",
  "/wiki/1982",
  "/wiki/Harrison_Ford",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Darth_Maul_(2017)_2",
  "/wiki/Darth_Maul_(2017)_3",
  "/wiki/Darth_Maul_(2017)_4",
  "/wiki/Darth_Maul_(2017)_5",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Age_of_Republic_-_Jango_Fett_1",
  "/wiki/Star_Wars:_I_Am_a_Padawan",
  "/wiki/Lightsaber_Lost",
  "/wiki/Death_Trap",
  "/wiki/R2_Come_Home",
  "/wiki/Lethal_Trackdown",
  "/wiki/Hostage_Crisis",
  "/wiki/Hostage_Crisis_(short_story)",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark_(audiobook)",
  "/wiki/Hunt_for_Ziro",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_3",
  "/wiki/Beyond_the_Clouds",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_One",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_The_Force_Awakens:_Head-to-Head",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Star_Wars:_The_Secrets_of_the_Bounty_Hunters",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Jedi_Master_Magazine_2",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Kamino",
  "/wiki/Battle_of_Sullust",
  "/wiki/20_BBY",
  "/wiki/ARC_Troopers",
  "/wiki/Nightsisters",
  "/wiki/Heist_on_Vandor",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/19_BBY",
  "/wiki/Vandor",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones"
 ]
}