{
 "name": "Ausar Auset",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kintan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Saleucami"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kajain'sa'Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ausar Auset was a male Kajain'sa'Nikto Jedi Master who served the Jedi Order and the Galactic Republic as a General during the Clone Wars.\nA male Force-sensitive Kajain'sa'Nikto, Ausar Auset was discovered by the Jedi Order at an early age; leading him to think of himself as a Jedi first and a Nikto second. Studying the ways of the Force as well as his native culture, Auset constructed a blue-bladed lightsaber before passing his Trials of Knighthood and ascending to the rank of Jedi Knight. At some point during his studies, Auset became acquainted with the famed Jedi hero Sharad Hett and the two had mutual respect between each other.\nAttaining the rank of Jedi Master, Jedi Auset dutifully reported to the Coruscant Jedi Temple at the start of the Clone Wars; a deadly conflict between the Galactic Republic and the Confederacy of Independent Systems. Master Auset took up the rank of General within the Grand Army of the Republic and led his clone troopers against the Separatist Droid Army. As the war neared its end, Master Auset was one of many Masters fighting on the front lines during the Siege of Saleucami. Master Auset was forced to fight against the Morgukai Shadow Army, an army of cloned Nikto warriors; though his Jedi sense of detachment allowed him to do so effectively. During the battle, Auset formed a strong camaraderie with fellow Master A'Sharad Hett, and stood in battle with him while Master Oppo Rancisis guided events through battle meditation. During the fighting, Master Auset was caught in an explosion from enemy fire, and was killed instantly while his compatriots looked on helplessly.\nWhile there was no time to recover Auset's body, the explosion that took the Nikto Jedi's life exposed underground tunnels that would eventually contribute to the Republic's victory against the Separatists on the planet. During a break in the fighting, at the pyre of Master Rancisis, the surviving Jedi spoke the names of their fallen brethren whose bodies could not be recovered. Along with Jedi Durnar, Xeltek, and T'Bolton, Master Auset's name was uttered over the burning corpse of the Thisspiasian Master.\nOstrander speculated that Auset was born in 75 BBY on Kintan.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kintan/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Saleucami/Legends",
  "/wiki/Kajain%27sa%27Nikto/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Nikto/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Sharad_Hett",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Siege_of_Saleucami/Legends",
  "/wiki/Morgukai_Shadow_Army",
  "/wiki/Darth_Krayt",
  "/wiki/Oppo_Rancisis/Legends",
  "/wiki/Battle_meditation",
  "/wiki/Funeral_of_Oppo_Rancisis",
  "/wiki/Durnar",
  "/wiki/Xeltek",
  "/wiki/T%27Bolton",
  "/wiki/Thisspiasian/Legends",
  "/wiki/75_BBY",
  "/wiki/Republic_74",
  "/wiki/Republic_76",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Republic:_Siege_of_Saleucami",
  "/wiki/Jedi_Council_Forums",
  "/wiki/John_Ostrander"
 ]
}