{
 "name": "Ava_Jaxo",
 "display_name": "Ava Jaxo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3641 BBY",
      "A-77"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic ArmyRepublic Special Forces",
      "Republic ArmyRepublic Special Forces",
      "Republic Special Forces"
     ]
    }
   ]
  }
 ],
 "content": "Ava Jaxo was a Human female Sergeant who served in the Republic Army and was an associate of the commander of Havoc Squad during the Cold War and the Galactic War.\nAva Jaxo was a Sergeant in the Republic Special Forces around 3643 BBY. While serving on Coruscant, she worked undercover ops for General Elin Garza out of an apartment in Black Sun territory, assisting the new commander of Havoc in countering the Black Sun crime syndicate and again during the commander's rescue attempt of the kidnapped Senator Zorin Krasul.\nLater in the war, Jaxo was imprisoned by the Empire on the remote asteroid prison colony A-77. Jaxo was allowed to slip out of her cell and make contact with Republic Special Forces by General Arkos Rakton in order to lure the commander to the asteroid prison. The commander was dispatched to the prison to rescue Jaxo and 314 other prisoners of war being held there. When the commander was deep in the prison, Raxton commenced bombardment of the asteroid and left the commander with a choice: to save the prisoners from the bombardment by venting the service level where Jaxo was hiding, or to save Jaxo at the cost of the prisoners' lives. Jaxo pleaded the commander to save her and let the other prisoners die, but the commander decided to save the prisoners, and Ava perished.\nJaxo appears as part of the missions \"The Black Sun's Poison,\" \"Public Relations,\" \"A Little R and R,\" \"Catching Up,\" and \"Objective: A-77\" in Star Wars: The Old Republic, and is a possible love interest for a male character.\nJaxo's fate is determined by the player's decision: she can be left to die so that other prisoners may escape, or she can be saved, causing the prisoners to be killed in the bombardment. Both options result in her disappearance from the game. If the commander saves Jaxo, however, the player will later receive a letter from her. Jaxo disjointedly writes that she is overcome with guilt for what she asked the commander to do and that she has put in for a psychological dismissal from the Republic Army, and she concludes by telling the commander to \"stay strong.\" There are no known appearances of Jaxo later in the game, and the letter is the last contact with her for the rest of the Trooper storyline.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/3641_BBY",
  "/wiki/A-77_(prison)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Army",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Sergeant/Legends",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Havoc_Squad",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/3643_BBY",
  "/wiki/General/Legends",
  "/wiki/Elin_Garza",
  "/wiki/Ava_Jaxo%27s_apartment",
  "/wiki/Black_Sun_territory",
  "/wiki/Black_Sun/Legends",
  "/wiki/Zorin_Krasul",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Arkos_Rakton",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel"
 ]
}