{
 "name": "Aved Luun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jawa"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kalit's clan"
     ]
    }
   ]
  }
 ],
 "content": "Aved Luun was a female Jawa shaman from Tatooine. By 4 ABY, she and her mate Kalit led a clan that almost got into a war with another clan led by Jawas Wittin and Herat, who arranged raids and stealing salvaged goods from other Jawas and accused Luun and Kalit's clan for the actions.\nThose tensions led to Kalit attempting to use Tatooine's crime lord Jabba the Hutt as a mediator for the conflicts with Wittin and Herat. Luun frequented the Hutt's palace, where Kalit went alongside Herat and Wittin to resolve their conflicts prior to 4 ABY's Battle of the Great Pit of Carkoon. Luun suspected Wittin's betrayal—while indeed Herat and Wittin were plotting to have Jabba's help in conquering her and Kalit's clan, to Kalit's good fortune, the subsequent Battle of the Great Pit of Carkoon led to Wittin's death.\nAved Luun was a female Jawa native to her species' homeworld, Tatooine. By 4 ABY, she had become a shaman as well as the mate of Kalit, a Jawa chief and king. Luun and Kalit led a clan together.\nBy 4 ABY, Luun and Kalit's clan had conflicts with a rival clan led by the Jawas Wittin and Herat that almost led to a war. Wittin's clan stole salvaged goods and water, and organized raids on other Jawas, with the help of Nebit, another of the planet's Jawas. Wittin falsely accused Kalit's clan of staging the raids, which continued alongside the accusations even as the Jawa elders believed Kalit's innocence. Kalit approached Tatooine's crime lord Jabba the Hutt—whose palace and excursions on the luxury sail barge Khetanna would both include Luun's physical presence—to mediate their conflicts.\nLuun suspected Wittin's betrayal around the time that Kalit was present in Jabba's Palace along with both Wittin and Herat when the Alliance to Restore the Republic's Heroes of Yavin unrelatedly arrived to rescue one of the Hutt's prisoners, Han Solo. While Wittin and Herat indeed planned to have Jabba help them conquer Kalit and Luun's clan, to Kalit's good fortune, the events that followed Solo's rescue attempts led to the Battle of the Great Pit of Carkoon and Wittin's death.\nAved Luun had yellow eyes.\nLuun had a degree of Force-attunement.\nLuun wore brown Jawa robes with a bandolier strapped across the chest.\nAved Luun's origins lie within a production photo for 1983's original trilogy film, Star Wars: Episode VI Return of the Jedi. She was first mentioned in the 1998 Jabba's Palace Limited expansion set of Decipher, Inc.'s Star Wars Customizable Card Game, which used a modified image of one of the Jawas in the aforementioned photo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Kalit%27s_clan",
  "/wiki/Shaman/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Kalit/Legends",
  "/wiki/Wittin%27s_clan",
  "/wiki/Wittin/Legends",
  "/wiki/Herat",
  "/wiki/Crime_lord/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Battle_of_the_Great_Pit_of_Carkoon",
  "/wiki/Death/Legends",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Chief/Legends",
  "/wiki/King/Legends",
  "/wiki/Water/Legends",
  "/wiki/Nebit/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Luxury-class_sail_barge",
  "/wiki/Khetanna/Legends",
  "/wiki/Time/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/Siege_of_Jabba%27s_Palace",
  "/wiki/Prisoner/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Force-attunement",
  "/wiki/Robe/Legends",
  "/wiki/Bandolier/Legends",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/1998",
  "/wiki/Jabba%27s_Palace_Limited",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_23",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Databank_(original)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Jabba%27s_Palace",
  "/wiki/Star_Wars_Insider_60",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Return_of_the_Jedi_Giant_Collector%27s_Compendium:_Heroes,_Villains,_Creatures_%26_Droids"
 ]
}