{
 "name": "Aven_Cholus",
 "display_name": "Aven Cholus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pencael IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the RepublicScandium TeamGale Team",
      "Scandium Team",
      "Gale Team"
     ]
    }
   ]
  }
 ],
 "content": "Aven Cholus was a Human Rebel infiltrator and pilot.\nAven Cholus was born on Pencael IV, daughter of a rich family. She was on good terms with her brother Senn, and both of them trained during their childhood to became pilots. The Cholus family wanted to send both of their children to the Imperial Academy. However, Aven was a firm believer in freedom, and could not stand to serve the Empire. She found a chance to join the Alliance to Restore the Republic and rejected her family to do so.\nAven became a pilot to infiltrator Scandium Team, under the leadership of lead pilot Jouffer Talamiin. During the battle of Gendrah-Narvin, Talamiin was injured and had to retire; Aven then replaced him as lead pilot.\nAven then fought against the Empire in the Battle of Fendry, and was awarded with the Alvace Star for leading her squadron out of a dangerous situation while chased by Imperial forces.\nAven also fought in the Wellte-ir Massacre, where most of the Scandium Team was killed. Aven rescued the five survivors of the Team from the Umber Banks. However, the Scandium Team was dismantled after that.\nThe Rebel command assigned Aven to the Gale Team, replacing previous commander Ozik Poyiu. However, Aven was not comfortable with the Gales, because they were all former smugglers; and they, in turn, were uncomfortable with their new commander because they preferred to have a former smuggler as commander. Besides, Aven blamed herself for the Wellte-ir Massacre. All this caused the Gale Team to decrease their performance. Aven was blamed for that, demoted and retired from this role.\nDuring the rest of her career, she was a shuttle pilot, until retirement in the first days of the New Republic.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Aven_(disambiguation)",
  "/wiki/Pencael_IV",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Scandium_Team",
  "/wiki/Gale_Team",
  "/wiki/Infiltrator/Legends",
  "/wiki/Senn_Cholus",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Jouffer_Talamiin",
  "/wiki/Battle_of_Gendrah-Narvin",
  "/wiki/Battle_of_Fendry",
  "/wiki/Alvace_Star",
  "/wiki/Wellte-ir_Massacre",
  "/wiki/Umber_Banks",
  "/wiki/Ozik_Poyiu",
  "/wiki/New_Republic/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Cracken%27s_Rebel_Operatives_(article)",
  "/wiki/Star_Wars_Adventure_Journal_11"
 ]
}