{
 "name": "Averdon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Averdon was a Human male who worked as an ambassador for the Galactic Republic during the Cold War with the reconstituted Sith Empire. He was assigned to Nar Shaddaa, where he attempted to negotiate an alliance with members of the Hutt Cartel.\nA male Human, Averdon worked as an ambassador for the Galactic Republic during the Cold War with the Sith Empire. Around the year 3643 BBY, Averdon worked on Nar Shaddaa, the moon of Nal Hutta, the homeworld of the Hutts. Averdon was attempting to gain allies for the Republic within the Hutt Cartel, and he had begun entering into an alliance with the Hutt Bareesh Fenn'ak Torill. The Hutts had sold the Republic the Nikto Sector to use as a base of operations, but the area was overrun by the Nikto street gang the Kintan Kings.\nWhen a Republic-allied individual recovered Republic passcodes stolen from Minister Plennid by the Kintan Kings near Deucalon Spaceport, they gave the passcodes to Averdon in Bareesh's Mercantile Exchange. Averdon and Bareesh then asked the individual's help in recovering a shipment of cybernetic combat implants  which had been stolen by the Kintan Kings. Averdon and the Hutt warned them about the Kings, who had killed a Jedi who had been helping the ambassador and left their body in the streets.\nThe individual traveled to the Nikto Sector and recovered the implants, fighting their way through the gang's forces in the process. When they delivered the implants to Bareesh's contact Nurkolas, Nurkolas tried to convince them to steal some of the implants. When they refused to be bribed, Nurkolas acquiesced and contacted Averdon and Bareesh. Averdon told the individual that the Kings had begun a slaving operation, which the individual quickly shut down. But by doing so, they incurred the personal wrath of the Kings' leader, the Mountain. In order to stop the Mountain from detonating bombs across Nar Shaddaa, the individual faced down the five Nikto brothers and defeated them, despite their Morgukai training.\nIn doing so, the individual discovered that Bareesh was the former leader of the Kings. Bareesh asked them not to reveal this to Averdon, reasoning that it would be the end of his alliance with the Republic, but the individual instead pressured him to reveal the truth of his past to the ambassador. Knowing the Republic was short on allies on Nar Shaddaa, Averdon agreed to work with Bareesh, but said that he would keep an eye on the Hutt.\nAverdon would later contact the individual and thank them, informing them that the Republic had ceased contact with Bareesh, and that they were looking for new allies on Nar Shaddaa.\nAverdon was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. He appears as part of the main Republic set of side missions, and the player can choose to reveal Bareesh's past for light side points or not to for dark side points.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/3643_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Bareesh_Fenn%27ak_Torill",
  "/wiki/Nikto_Sector",
  "/wiki/Nikto/Legends",
  "/wiki/Kintan_Kings",
  "/wiki/Minister",
  "/wiki/Plennid",
  "/wiki/Deucalon_Spaceport",
  "/wiki/Bareesh%27s_Mercantile_Exchange",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Nurkolas",
  "/wiki/The_Mountain",
  "/wiki/Morgukai",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}