{
 "name": "Avga Rosene",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zuzabol"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Avga Rosene was a Zuzabol member of the Resistance who worked as part of a fueling crew stationed at the Resistance base on the planet D'Qar around thirty years after the Battle of Endor. Following the Battle of Takodana, Rosene was at the landing zone of the YT-1300 light freighter known as the Millennium Falcon shortly after it landed on D'Qar but headed over to the T-70 X-wing starfighter Black One as its pilot Poe Dameron dismounted. While at the Resistance base, Rosene wore brown clothing that covered the entire body, including the head.\nAvga Rosene first appeared in the film Star Wars: Episode VII The Force Awakens, which was released on December 18, 2015. The character was one of a pair labeled as a fueling crew on the Resistance base who were played by actors Kiran Shah and Arti Shah. The character did not receive a name in the film, but was given one by Lucasfilm Story Group member Pablo Hidalgo, who created Avga Rosene as a shorting of the term \"aviation gas\" and part of the word kerosene. The name was then revealed as part of a costume exhibition.\nRosene also appeared in the non-canon video game Disney Infinity 3.0, which was released in conjunction with the film. In the game, Avga is owed a favor by the smuggler Athgar Heece, who sends the player to help Avga destroy junk that is preventing the Resistance member's transport from landing on the planet Takodana. Once the starship lands, Avga has the player disguise a set of contraband as an astromech droid so it can be smuggled off world.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Zuzabol",
  "/wiki/Resistance",
  "/wiki/Fuel",
  "/wiki/Resistance_base",
  "/wiki/Planet",
  "/wiki/D%27Qar",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Battle_of_Takodana",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Black_One",
  "/wiki/Pilot",
  "/wiki/Poe_Dameron",
  "/wiki/Color",
  "/wiki/Clothing",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/December_18",
  "/wiki/2015",
  "/wiki/Kiran_Shah",
  "/wiki/Arti_Shah",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Video_game",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/Smuggler",
  "/wiki/Athgar_Heece",
  "/wiki/Transport",
  "/wiki/Takodana",
  "/wiki/Starship",
  "/wiki/Astromech_droid",
  "/wiki/Poe_Dameron_26",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/File:Avga_Rosene_tweets_Pablo_Hidalgo.png",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_Updated_and_Expanded_Edition"
 ]
}