{
 "name": "Awdrysta Pina",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "24",
      "500 BBY",
      "Irkalla"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Awdrysta Pina, known as the Green Blade, was a male Human Jedi Master who led the Jedi Order as its Grand Master during the time of the First Great Schism.\nA Force-sensitive Human, Awdrysta Pina was a member of the Jedi Order, achieving the rank of Jedi Master and ultimately Grand Master during the years before the First Great Schism. Despite having a taste for battle, the grim Jedi spent his time away from Ossus, the Jedi world, and preferred to wander the long forgotten space lanes of the galaxy's Outer Rim. During his time as a Jedi, Pina constructed twin katanas, imbuing them with the Force and channeling his power through twin emerald focusing crystals. Despite his craving for battle, Pina believed that order and structure were the underlying base of civilization, and therefore responded with earnest when the Order' leaders summoned him to Ossus to combat the Legions of Lettow.\nLeading the Jedi forces against the Legions and their leader, Xendor, Pina crushed resistance on Chandrila, Brentaal IV, Metellos and Coruscant before tracking Xendor to Columus. During the fighting, Pina's forces slew fierce warriors such as Sethul Asaiage and Tun Bohoi before Pina finally struck down Xendor himself.\nDespite the victory and the death of the Legions' leader, Pina had not sated his need to destroy all those involved. Tracking Xendor's lover Arden Lyn to Irkalla in the Unknown Regions, Pina attacked Lyn but his katana shattered upon the powerful Kashi Mer talisman she wore around her neck. Mortally wounded by the flying shards of his own blade, Pina's desire to end Lyn's life did not die. Drawing upon the Force, Pina employed the rarely-used technique called morichro to cease all of Lyn's body functions, ultimately resulting in the stoppage of her heart. Pina died during the process, and Lyn would have too if not for the intervention of unknown individuals. Lyn's body was suspended in a stasis field deep within a tomb, only to reawaken some 24,000 years later during the reign of the Galactic Empire.\nAccording to The Emperor's Pawns author Abel G. Peña, Pina's name originally was \"Waldan L'lacielo,\" an anagram of fellow author Daniel Wallace. This name was changed in editing; Peña later went on to split the anagram and use it for the first names of General Grievous's victims Waldan Bridger and L'lacielo Sageon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/24,500_BBY",
  "/wiki/Irkalla",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/First_Great_Schism",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Ossus/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Force-imbued_blade",
  "/wiki/Legions_of_Lettow",
  "/wiki/Xendor",
  "/wiki/Battle_of_Chandrila_(First_Great_Schism)",
  "/wiki/Battle_of_Brentaal_IV_(First_Great_Schism)",
  "/wiki/Battle_of_Metellos_(First_Great_Schism)",
  "/wiki/Battle_of_Coruscant_(First_Great_Schism)",
  "/wiki/Columus/Legends",
  "/wiki/Battle_of_Columus",
  "/wiki/Sethul_Asaiage",
  "/wiki/Tun_Bohoi",
  "/wiki/Arden_Lyn",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Duel_on_Irkalla",
  "/wiki/Kashi_Mer_Dynasty",
  "/wiki/Kashi_Mer_talisman",
  "/wiki/Morichro/Legends",
  "/wiki/4_BBY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/The_Emperor%27s_Pawns",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Daniel_Wallace",
  "/wiki/Grievous/Legends",
  "/wiki/Waldan_Bridger",
  "/wiki/L%27lacielo_Sageon",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars_Gamer_5",
  "/wiki/Wizards.com",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Star_Wars:_Force_and_Destiny_Core_Rulebook",
  "/wiki/Biel_Ductavis",
  "/wiki/10,966_BBY",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Star_Wars:_Blogs"
 ]
}