{
 "name": "Axtor_Bridgeman",
 "display_name": "Axtor Bridgeman",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.72 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    }
   ]
  }
 ],
 "content": "Axtor Bridgeman was an aging tramp freighter captain operating in the Minos Cluster some time during the Galactic Civil War.\nAxtor first became involved in freighting cargo between the stars when his father was offered a position on a freighter in return for repair work. Axtor's father signed on immediately and advanced through the ranks. Axtor was given the opportunity to accompany his father on a trip and that experience made Axtor desire to be a freighter captain himself.\nAxtor did not want to work for a large commerce guild so he gambled and borrowed a loan from a loan shark, Yerkys ne Dago. in order to buy his own ship, the Dynasty. His goal was to repay his loan, and although made enough money to pay the interest, he was unable to reduce the size of his loan.\nAxtor was an easy-going man although he was not one for rules and regulations. He had been hauling freight for a while and had started looking towards retirement if he ever found a way to repay his loan. He was older with greying hair and wrinkles starting to form around his face. He also had the large, strong hands of a mechanic, an inheritance from his father.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Tramp_freighter",
  "/wiki/Captain/Legends",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Loan_shark",
  "/wiki/Yerkys_ne_Dago",
  "/wiki/Dynasty",
  "/wiki/Galaxy_Guide_6:_Tramp_Freighters",
  "/wiki/Galaxy_Guide_6:_Tramp_Freighters_(Second_Edition)",
  "/wiki/Platt%27s_Smugglers_Guide"
 ]
}