{
 "name": "Ayk Arko",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Hok"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sebolto's drug cartel"
     ]
    }
   ]
  }
 ],
 "content": "Ayk Arko was a male Gran who worked with the Dug crime lord Sebolto during the waning years of the Galactic Republic. He was wanted for questioning by the planet Coruscant's Security Force, who put a bounty on his head. The bounty hunter Jango Fett found Arko on the planet Malastare and captured him alive in the year 32 BBY.\nThe male Gran Ayk Arko was a criminal active in the final decades of the Galactic Republic. By the year 32 BBY, he was wanted for questioning by the internal affairs department of the Security Force of the planet Coruscant. The force placed a bounty on the Gran's head, offering 5000 for his capture alive, or 2500 for his death. In 32 BBY; however, Arko was on the planet Malastare, where he had become associated with a drug cartel run by the dug King Sebolto.\nWhile on Malastare in 32 BBY, Arko spent time in the planet's jungles, where he encountered the bounty hunter Jango Fett. Fett, who was in the jungles attempting to reach Sebolto's Palace, captured Arko alive and later claimed the full bounty on his head from the Coruscant Security Force.\nArko was a male Gran with black eyes and pink skin. Upon meeting Fett in the jungle's of Malastare he attacked the hunter with a blaster immediately, but was bested by him in combat.On Malastare the Gran wore black and brown clothing.\nAyk Arko first appeared in the Prima Games strategy guide for the LucasArts video game Star Wars: Bounty Hunter, as well as in the game itself. Both were released in 2002, with the guide slightly preceding the game. In the game Arko is an optional secondary bounty who players can choose to capture or kill for his bounty, or simply kill for no profit. Given that it is more profitable to capture Arko rather than kill him this article assumes that as part of 100% game completion this is the option players took.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Hok/Legends",
  "/wiki/Gran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sebolto%27s_drug_cartel",
  "/wiki/Dug/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Sebolto",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Malastare/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Credit",
  "/wiki/Death/Legends",
  "/wiki/King/Legends",
  "/wiki/Canon",
  "/wiki/Sebolto%27s_Palace",
  "/wiki/Eye/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Prima_Games",
  "/wiki/Star_Wars:_Bounty_Hunter:_Prima%27s_Official_Strategy_Guide",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Bounty_Hunter",
  "/wiki/2002"
 ]
}