{
 "name": "Azanti Zhug",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Duro",
      "Nar Shaddaa"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Zhug brothers"
     ]
    }
   ]
  }
 ],
 "content": "Azanti Zhug was a male Duros bounty hunter from the planet Duro and a leader of a bounty hunter group called the Zhug brothers. After the group was cast out from Duro due to their violent acts against a rival family, Azanti and his group eventually settled on the moon Nar Shaddaa during the years around the Dark Wars. When the local Exchange crime lord G0-T0 set a bounty on Jedi, the Zhug brothers were eager to collect the large sum.\nIn 3951 BBY, Meetra Surik—a former Jedi Knight—arrived on the moon, G0-T0 instructed the bounty hunters not to disturb her. When Surik was trapped by the Exchange, bounty hunters took that as the end of the truce, and the Zhug brothers confronted Surik's companions. During a brief fight on the landing pad of the starship Ebon Hawk, Azanti and his companions were killed.\nAzanti Zhug was a male Duros from the planet Duro and a leader in the bounty hunting organization known as the Zhug brothers, who considered themselves a \"family\" due to their shared cause of seizing their former homeworld of Duro for their own. Sometime around the Jedi Civil War, Azanti and the rest of the Zhug brothers were banished from Duro after their violent acts against a rival family. They eventually settled on Nar Shaddaa, the moon of Nal Hutta, around the time of the Dark Wars. While they were there the local Exchange crime lord G0-T0 set a bounty on Jedi, and they didn't hesitate to take the job.\nIn 3951 BBY, G0-T0 arranged a meeting of various bounty hunter factions aboard his yacht, the Visionary, when Meetra Surik, a former Jedi Knight known as the Jedi Exile, arrived on Nar Shaddaa. After G0-T0 had told the hunters not to interfere with Surik while she was on the moon, Azanti and Dezanti Zhug, the two Zhug leaders representing their organization at the meeting, reacted strongly to this new restriction. After calling G0-T0 mad for not letting them hunt when she was so close, the Zhug brothers were provoked into bickering with the other bounty hunters.\nAfter Surik left her companions—the Zabrak Bao-Dur; the former Jedi Master Kreia; the Ebon Hawk's pilot, Atton Rand; and the Echani handmaiden Brianna—to attend a meeting with G0-T0's head of operations on the moon, the Quarren Visquis, she ended up being imprisoned by Visquis and G0-T0. The bounty hunters considered this to be the end of the truce, and Azanti and two of his fellow Zhug brothers confronted Surik's companions as they discussed strategy on the landing pad where their light freighter, the Ebon Hawk, was berthed. However, instead of taking the opportunity to ambush the crew, Azanti decided to try to intimidate them with threats, stating that Surik was \"a criminal\" and ordering them to surrender her to him. Surik's companions were not scared by the threats, and Azanti Zhug, along the two Zhug brothers accompanying him, were killed in the brief ensuing exchange of fire.\nSoon after the death of Azanti Zhug, eight Zhug brothers failed in their subsequent attack against Surik aboard the Visionary where she was held as a prisoner. Eventually, Dezanti Zhug led their last attempt to collect the bounty on the Jedi on the surface of Dxun, failing in that attempt as well.\nAzanti Zhug considered his group to be very dangerous, important, and famous bounty hunters. He was very eager to collect the bounty on the Jedi, and he didn't show much respect to his fellow bounty hunters or to his bounties. This was shown by his actions on the Visionary, when he and his fellow Zhug leader demeaned the other bounty hunters present and openly called G0-T0 mad. Zhug also decided to threaten the Meetra Surik's companions rather than kill them when he had the chance, and this decision ultimately led to his death.\nAzanti Zhug was one of the Zhug brothers, a minor villainous group of bounty hunters featured in Star Wars: Knights of the Old Republic II: The Sith Lords, a video game released by Obsidian Entertainment at the end of 2004. In the game, the player controlling the Jedi Exile is allowed to visit several planets after leaving Telos IV. This article assumes that the Jedi Exile visits Nar Shaddaa as the first planet, as presented in Knights of the Old Republic II: The Sith Lords: Prima Official Game Guide.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Duro/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/3951_BBY",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Red",
  "/wiki/Zhug_brothers",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Unidentified_Duros_family",
  "/wiki/Moon/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Dark_Wars",
  "/wiki/Exchange",
  "/wiki/Crime_lord/Legends",
  "/wiki/G0-T0",
  "/wiki/Bounty/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(First_Jedi_Purge)",
  "/wiki/Refugee_Landing_Pad",
  "/wiki/Starship/Legends",
  "/wiki/Ebon_Hawk",
  "/wiki/Death/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Time/Legends",
  "/wiki/Yacht/Legends",
  "/wiki/Visionary",
  "/wiki/Dezanti_Zhug",
  "/wiki/Zabrak/Legends",
  "/wiki/Bao-Dur",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kreia",
  "/wiki/Pilot/Legends",
  "/wiki/Atton_Rand",
  "/wiki/Echani/Legends",
  "/wiki/Handmaiden_Sisters",
  "/wiki/Brianna",
  "/wiki/Quarren/Legends",
  "/wiki/Visquis",
  "/wiki/Prison/Legends",
  "/wiki/Light_freighter/Legends",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide",
  "/wiki/Prisoner/Legends",
  "/wiki/Dxun/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Hanharr",
  "/wiki/Mira",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Video_game",
  "/wiki/Obsidian_Entertainment",
  "/wiki/2004",
  "/wiki/Telos_IV",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_Old_Republic:_Revan",
  "/wiki/Wizards.com",
  "/wiki/Knights_of_the_Old_Republic_Miniatures_Preview_5"
 ]
}