{
 "name": "Azkul",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Dantooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue right",
      "white left"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Darth Revan's Sith Empire",
      "Exchange",
      "Azkul's mercenaries",
      "Czerka Arms"
     ]
    }
   ]
  }
 ],
 "content": "Azkul was a Sith veteran of the Jedi Civil War who later became a mercenary in the employ of the Exchange.\nAzkul served under Darth Malak during the Jedi Civil War as a Sith commando in an elite Sith Special Forces detachment. A good many former military personnel—Republic and Sith alike—suddenly found themselves out of a job with the end of the war. Many of them, with no homes left to return to, turned to mercenary work, including Azkul. He journeyed to Dantooine and began making plans to overthrow the lawful Republic government there with his mercenary army.\nIn 3951 BBY, he was hired by the Exchange to assassinate the Khoonda Administrator Terena Adare so Dantooine could be used for further illegal activities by the crime syndicate. Unfortunately for Azkul and his mercenaries, Meetra Surik and the Jedi Master Vrook Lamar were on the planet. Azkul had a small team capture Vrook , the team was ambushed by Surik and her allies. When she came out of the crystal cave, Azkul tried to recruit Surik. She refused and the former Sith commando sent his group against her, but they too were easily dispatched.\nAt Khoonda, Surik and Vrook, with their combined efforts, were able to rally the settlers and conform a stronger militia, repair the inactive Battle droids and autoturrets  and strengthen the minefields around the administration building, which caused heavy casualties. They also used Surik's computer expertise to reprogram the droids and the turrets which previously fired on everything to only target the attackers, which saved militia who would later help in the breach of the Khoonda. Surik also sealed the door to the armory, which caused Azkul to be forced to attack through the main militia force. Azkul, his right-hand man Dopak, and eight to ten of his men remained alive for a final assault on the administrator, but he was betrayed by Dopak and finally defeated.\nIf Surik helps Azkul invade Khoonda, he later appears on Citadel Station, aiding the Telos Security Force in their fight against the Sith forces.\nSurik can also manipulate Azkul into thinking that she will help him, which will be admired by Kreia. Mandalore the Preserver would give caution on how Azkul knows who to trust because he knew his kind. Teammates who have very strong senses in justice will despise such an act, though, while Brianna will instantly despise joining Azkul to where which response results in being influence-related. This act will not lead to a Dark Side shift, but no Light Side shift either.\nAzkul has an alignment score of 50 , perhaps in keeping with his status as a mercenary .",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3951_BBY",
  "/wiki/Dantooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Exchange",
  "/wiki/Azkul%27s_mercenaries",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Sith/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Mercenary/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Sith_trooper_(Sith_Empire)",
  "/wiki/Khoonda",
  "/wiki/Terena_Adare",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Vrook_Lamar",
  "/wiki/Crystal_Cave_(Dantooine)",
  "/wiki/Khoonda_Militia",
  "/wiki/Battle_droid/Legends",
  "/wiki/Autoturret/Legends",
  "/wiki/Dopak",
  "/wiki/Citadel_Station",
  "/wiki/Telos_Security_Force",
  "/wiki/Kreia",
  "/wiki/Canderous_Ordo",
  "/wiki/Brianna",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords"
 ]
}