{
 "name": "Azlin_Rell",
 "display_name": "Azlin Rell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Azlin Rell was a human male Jedi Knight who served the Jedi Order around 382 BBY, during the High Republic Era. A naturally humble and self-effacing individual, Rell deeply trusted in the Force and cared about undertaking his duties as a Jedi. He was also a longtime friend of the Wookiee Jedi Arkoff. He was assigned on a service tour of the Outer Rim Territories and the frontier, accompanied by his astromech droid, C-9. During the tour, Rell went on various missions, once visiting the Relik moons.\nAround 382 BBY, Rell came to the planet Tiikae to assist a trade outpost threatened by a large herd of migrating grass sharks. Finding the task too large for himself and C-9 to handle, he made a distress call which was answered by Jedi Master Zallah Macri and her Padawan, Kevmo Zink. Together, the group was able to successfully divert the creatures.\nAfterwards, Macri and Zink were sent on a search for a stolen Force artifact while Rell wrote some reports and made some repairs, before planning to return to the Jedi outpost on the moon Jedha. However, while en route, Rell was asked to search for the pair on the planet Dalna as the Jedi had lost contact with them. Rell's search led him to find only the Master and apprentice's mysteriously calcified remains.\nAzlin Rell achieved the rank of Jedi Knight by around 382 BBY, during the High Republic Era. He was sent on a tour of duty to the Outer Rim Territories, accompanied by his astromech droid, C-9. Two months into the tour, Rell and C-9 visited one of the Relik moons, where the droid found a strangely charged alloy which it used to fashion itself a new arm, which allowed it to detect electromagnetic fields. When Rell pointed out that this made C-9 more sensitive to people approaching than its master was at times, the droid cheekily suggested they call the arm its Jedi hat. Rell spent several years on the frontier.\nAround 382 BBY, Rell ventured to the planet Tiikae to assist in deflecting a large herd of migrating grass sharks away from a trade outpost. Finding himself unable to complete the task on his own, he sent out a short-range distress call which was received by Jedi Master Zallah Macri and her Padawan, Kevmo Zink, who were operating out of the Port Haileap Jedi outpost and had just completed a rescue mission on the ocean moon of Amloch. They had been due to return to Haileap, but Macri had decided to stay on the moon for one more day, allowing them to hear Rell's call and arrive in time to help the settlement.\nWhile Macri and Zink rode skimboards and diverted the sharks away from the outpost, Rell and C-9 worked on a way to encourage the creatures to take a different route, while the outpost itself was evacuated. Rell and C-9 discovered that the sharks used Tiikae's magnetic field to choose their migration path, and since the last migration five years before, the field had shifted enough that the sharks' new chosen migration path took them too close to the settlement. With his droid's assistance, Rell repeated the trick the two had performed on the Core Worlds planet Alderaan to keep flocks of night-lethers away from tall buildings, using a comm beacon to make an artificial signal which would lead the sharks down a different canyon, away from the outpost.\nZink and Macri spent some time rerouting the herd while Rell searched for a solution, and as sunset approached, the Padawan contacted Rell to ask how much longer the operation would take. Rell responded that he and C-9 needed just a few more minutes just as Zink's skimboard failed, causing the Pantoran to leap away from the vehicle, leaving him on the ground near the herd. Macri moved to protect her apprentice by diverting the grass sharks, which shortly moved away of their own accord when Rell and C-9 activated their beacon to reroute them. Zink told Rell that whatever he had done was working, and Macri asked him to come pick up Zink while she tracked the herd to ensure the solution continued to work. Rell acknowledged that he was on his way.\nRell arrived in his shuttle to pick up Zink from the grassland, lowering the ramp for the Padawan to board. Zink made his way to the cockpit to meet Rell in person for the first time, and Rell thanked him for his help. He informed Zink that Macri had messaged him that she would meet them back at the spaceport, where Macri and Zink's starship was located. Sitting in the copilot chair, Zink expressed how impressed he was with how Rell had diverted the herd, asking how it had been done. When Rell explained, Zink briefly thought that the Jedi Knight had changed Tiikae's entire magnetic field. Rell, appearing slightly embarrassed, elaborated on how he and C-9 had reconfigured a comms beacon. Zink was impressed, and C-9 was proud, but Rell demurred that he had simply done his job. Zink insisted that Rell's feat had still been incredible, and Rell mentioned how he had used the trick on Alderaan. As Rell piloted his shuttle to the settlement, Zink asked him what the best thing to eat there was.\nAfter Zink and Macri had showered, they joined Rell in a tavern to eat fish stew. Macri arrived at the table last, and after she ordered a portion of stew, Rell slid her a mug of the local sour tea. After thanking Rell, Macri announced that she and Zink would need to leave immediately after the meal, as they were needed on the planet Hynestia to investigate the theft of the Rod of Seasons, an artifact belonging to the queen, five days prior. Zink asked why the Hynestians wanted Jedi involved, and Macri explained that the stolen object was a Force artifact. Surprised, the Padawan nearly knocked over his own mug of tea, and glanced at Rell after settling himself to see that the Jedi Knight was attempting not to smile at Zink's enthusiasm.\nZink invited Rell to come with them, but Rell politely declined, explaining that he had to finish up some reports and repairs, before returning to the Jedi outpost on the moon Jedha to check in. The activity did not appeal to the enthusiastic Pantoran, who said it was too bad, as he wanted to hear more about what Rell had been doing for the last few years. Rell said he had been doing much the same as Zink had, and the Padawan took a moment to discern if Rell was teasing him before agreeing and raising his mug in a salute.\nMacri and Zink's mission took them to the planet Dalna to investigate the Path of the Open Hand, a cult based there which they identified as likely suspects in the case. During the course of their investigation, the Jedi pair discovered that the cult were indeed responsible for the theft, and eventually snuck into the Path's compound to retrieve the stolen Rod of Seasons and other artifacts the cult had taken. However, they were confronted by the Path's leader, the Mother, who unleashed a bizarre creature she named the Leveler on them, which overwhelmed and killed them. In the aftermath, the Path of the Open Hand swiftly abandoned Dalna.\nWhen days had passed with no contact from the stricken master and apprentice, Rell was contacted by Jedi Master Lahru while he was en route to Jedha, the emergency message asking him to stop at Dalna to check in on them. Upon receiving the message, which mentioned the Path of the Open Hand, Rell refreshed himself on what he knew about the cult due to the extensive research he had performed during his time on the frontier. Aware that the Path preached non-interference with the Force, Rell became concerned about the trouble Macri and especially Zink could have gotten into with them.\nRell found that there had been no contact from them in days, and Jinx Pickwick, Ferdan's sheriff, had notified the outpost of the Jedi's abandoned skiff, with some locals wanting to confiscate it. Breaking into the starship, Rell and C-9 downloaded the information on its computer onto a datapad. When Rell spoke to Pickwick, although the sheriff was reluctant to involve herself with the situation, she informed him that the Path had departed Dalna two days before, in a large starship they had been constructing for months. She also told him about Zink's role in assisting members of the cult to survive during recent heavy flooding. Rell then spoke with Lady Jara, the owner of the boarding house where Macri and Zink had stayed, who was quick to blame the Path for their disappearance.\nThe night of his arrival, Rell ventured to the Path's abandoned compound with C-9. On the way there, the droid took a shortcut through a field of lompop flowers to avoid a section of the road too muddy for it, and Rell let himself be comforted by C-9's mutterings. Upon arriving at the compound, Rell found signs that it had been abandoned quickly, including spilled grain and the remnants of personal belongings. Rell made his way to a locked door leading to the underground caverns which comprised a significant portion of the complex. Steadying himself, Rell reached for the Force but found it to be unusually thin, which unsettled him. Aligning himself with the Force, Rell patted his droid on the dome, before drawing his lightsaber and cutting open the door, kicking it in to enter.\nTaking out his glow rod, Rell ordered C-9 to stay there and be ready to send an emergency burst back to their ship if anything were to happen, promising to use his comlink to keep in touch. Venturing into the caverns, Rell called out but received no reply. He reached out with his Force senses, but detected very little. Upon reaching an intersection at the bottom of the first staircase, Rell pushed out with the Force again and moved instinctively towards where he sensed an unusual sensation that felt almost like a yearning of sorts. Walking with his eyes shut, Rell went on a twisting route through the tunnels until he nearly stumbled upon hitting a wall that he discovered was not physical, but something mirroring the Force back at him, reflecting his growing dread.\nExamining the large chamber he found himself in, Rell saw an odd scatter of what looked like pulverized stone on the floor. Rell knelt down to examine the pile, but flung himself away upon touching what he immediately recognized as a Jedi cloak, not stopping until he reached the wall. Shining his light upon the remains, Rell was horrified to discover the pile was the remains of a Jedi whose body had been calcified and broken into pieces. Rell recognized that the remains were those of Kevmo Zink. Despite his horror, Rell steeled himself and walked past the remains, promising to return, and reached into the Force again, sensing the dread which permeated the room. Taking it step by step, Rell followed the strange Force thread while trying to remain confident, determined to locate Macri's remains while trying to ignore his memories of her and her Padawan.\nRell stopped, reaching out to connect with the Living Force to reassure himself, before pressing on. He found Macri's remains in another chamber with automatic lighting, sensing a hidden door beyond which powerful Force artifacts had formerly been stored. As he knelt beside Macri's remains, which consisted of her robes, belt, boots and utility items in addition to what was left of her body, Rell thought about how to collect them for funerary rites, knowing that both of the fallen pair's robes could be brought back to Coruscant. He also realized that both of the lightsabers belonging to the fallen Jedi were missing. Rell was filled with dread over how Macri and Zink had been destroyed, identifying that he was afraid.\nRell was later reunited with his longtime friend, the Wookiee Jedi Arkoff, and Arkoff's former Master, Ravna, when the three joined together to fight in a battle on Dalna against the Path of the Open Hand. During the battle, Rell fell victim to an unseen force unlike anything the Jedi had previously encountered.\nAzlin Rell was a Force-sensitive human male with tan skin and short-cropped dark hair. Not a naturally fearful person, he trusted in the Force and accepted it as part of him, but he was also careful and cautious. He preferred the company of droids to other people. Rell avoided taking pride in his accomplishments, remaining humble and stating that he had simply been doing his job. Taking credit for being a hero embarrassed him, as he felt that he was simply doing what was required of him and all any Jedi could do. He enjoyed Kevmo Zink's company, finding him easy to laugh with. Rell was serious and did not mind doing reports, leading the enthusiastic Zink to be confused about whether or not the older Jedi was teasing him. He considered a solid research background to be essential to completing missions with satisfactory outcomes, a philosophy which saved him on several occasions.\nRell's first thought upon hearing of missing Jedi was that something terrible had happened to them, a guess which would prove to be correct. He had a gesture of brushing his fingers against his lightsaber to comfort himself, which he performed only when alone. Rell was deeply unsettled by the sensation of the aftermath of the Leveler's birth and subsequent killing of Zink and Zallah Macri, which turned to horror when he discovered they were dead. He took pieces of the pair's robes to be returned to the Jedi for their funerals, and was grieved by their deaths, especially Zink's.\nRell could sense the Force around him and align himself with it, in addition to using it to sense things around him. He sensed emotions tied to locations, and upon entering the Mother's former listening room on Dalna, could sense the vault where her stolen artifacts had once been kept. He knew how to pilot starships, and could calibrate communication beacons.\nRell was typically accompanied by his personal astromech droid, C-9, and owned a comlink to communicate with it. On his tour of the Outer Rim, Rell travelled in a standard single shuttle. He wielded a lightsaber with a pale blue blade, which he carried in a holster. Rell used a glow rod in dark areas.\nAzlin Rell first appeared in the 2022 young-adult novel The High Republic: Path of Deceit, written by Tessa Gratton and Justina Ireland for the Star Wars: The High Republic multimedia project.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rell",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance:_Precedent",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Knight",
  "/wiki/382_BBY",
  "/wiki/High_Republic_Era",
  "/wiki/The_Force",
  "/wiki/Jedi",
  "/wiki/Wookiee",
  "/wiki/Arkoff",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Galactic_Frontier",
  "/wiki/Astromech_droid",
  "/wiki/C-9",
  "/wiki/Relik_moons",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Planet",
  "/wiki/Tiikae",
  "/wiki/Grass_shark",
  "/wiki/Distress_signal",
  "/wiki/Jedi_Master",
  "/wiki/Zallah_Macri",
  "/wiki/Padawan",
  "/wiki/Kevmo_Zink",
  "/wiki/Species",
  "/wiki/Mission_to_Dalna_(Macri_and_Zink)",
  "/wiki/Theft_of_the_Rod_of_Seasons",
  "/wiki/Force_artifact",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/Dalna",
  "/wiki/Death",
  "/wiki/Standard_month",
  "/wiki/Droid",
  "/wiki/Charged_alloy",
  "/wiki/Electromagnetic_field",
  "/wiki/Hat",
  "/wiki/Standard_year",
  "/wiki/Port_Haileap",
  "/wiki/Ocean_moon_of_Amloch",
  "/wiki/Haileap",
  "/wiki/Standard_day",
  "/wiki/Skimboard",
  "/wiki/Shark",
  "/wiki/Magnetic_field",
  "/wiki/Core_Worlds",
  "/wiki/Alderaan",
  "/wiki/Night-lether",
  "/wiki/Standard_minute",
  "/wiki/Pantoran",
  "/wiki/Entry_ramp",
  "/wiki/Cockpit",
  "/wiki/Spaceport",
  "/wiki/Starship",
  "/wiki/Pilot",
  "/wiki/Diet",
  "/wiki/Shower",
  "/wiki/Cantina",
  "/wiki/Fish_stew",
  "/wiki/Stew",
  "/wiki/Sour_tea",
  "/wiki/Hynestia_Prime",
  "/wiki/Rod_of_Seasons",
  "/wiki/Unidentified_Hynestian_queen",
  "/wiki/Hynestian",
  "/wiki/Tea",
  "/wiki/Path_of_the_Open_Hand",
  "/wiki/Religion",
  "/wiki/Path_compound",
  "/wiki/Elecia_Zeveron",
  "/wiki/Nameless",
  "/wiki/Great_Leveler",
  "/wiki/Lahru",
  "/wiki/Jinx_Pickwick",
  "/wiki/Sheriff",
  "/wiki/Skiff",
  "/wiki/Computer",
  "/wiki/Datapad",
  "/wiki/Gaze_Electric",
  "/wiki/Water",
  "/wiki/Lord",
  "/wiki/Jara_(Theelin)",
  "/wiki/Lompop",
  "/wiki/Flower",
  "/wiki/Grain",
  "/wiki/Lightsaber",
  "/wiki/Glowrod",
  "/wiki/Comlink",
  "/wiki/Eye",
  "/wiki/Jedi_robes",
  "/wiki/Living_Force",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Coruscant",
  "/wiki/Ravna_(Jedi)",
  "/wiki/Night_of_Sorrow",
  "/wiki/Force-sensitive",
  "/wiki/Hair",
  "/wiki/Reproduction",
  "/wiki/Holster",
  "/wiki/2022",
  "/wiki/The_High_Republic:_Path_of_Deceit",
  "/wiki/Tessa_Gratton",
  "/wiki/Justina_Ireland",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/The_High_Republic:_Path_of_Deceit_(audiobook)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/232_BBY",
  "/wiki/Template:LightOfTheJediDate",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}