{
 "name": "Azoora",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Aduba-3"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wroonian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Azoora was a female Wroonian who lived on the Outer Rim world of Aduba-3 during the era of the Galactic Civil War. Known for her beauty among the residents of the spaceport Tun Aduban, Azoora frequented the town's nightlife and developed a troublesome reputation. In 0 ABY, Azoora had an encounter with Rebel hero Han Solo, although it was interrupted when Azoora's jealous \"boyfriend\" Warto attacked the offworlder.\nA Wroonian, Azoora was a native of the Outer Rim world of Aduba-3. Well known among the local spacers, Azoora earned a reputation as \"trouble\"—and also earned the attention of Warto, a hulking Boltrunian who styled himself as Azoora's boyfriend. Warto was known to threaten any other men whom he saw talking to Azoora.\nAzoora frequented Locru's Central Saloon in the spaceport of Tun Aduban, where in 0 ABY she encountered notorious smuggler and Rebel hero Han Solo. Solo approached Azoora at the bar, and after a short flirtation, Solo accepted Azoora's offer to leave with her and take a walk. However, Solo was quickly interrupted by a stranger and Azoora slipped away in the crowd.\nSolo soon found himself accosted by Warto, who attacked him for flirting with his \"girlfriend,\" although Warto was sent packing in a barroom brawl by Solo's Wookiee friend Chewbacca. Two years later, Azoora met with Rebel historian Voren Na'al, who was trying to piece together the story of Solo's travels after the Battle of Yavin. Azoora gave Na'al information about the local swoop gangs before threats from her current boyfriend forced Na'al to cut the interview short.\nA blue-skinned Wroonian, Azoora was regarded as beautiful by the men who encountered her, although she had a troublesome reputation on Aduba-3. Azoora had a flirtatious nature, something that tormented her self-proclaimed boyfriend, Warto.\nAzoora first appeared in Star Wars  7, written by Roy Thomas and Howard Chaykin and released in 1977. Although she went unnamed in her first appearance, her name was given in the next issue, Star Wars  8. In her lone comic appearance, Azoora was illustrated by Chaykin.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Aduba-3/Legends",
  "/wiki/Wroonian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Tun_Aduban",
  "/wiki/0_ABY/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Warto",
  "/wiki/Spacer/Legends",
  "/wiki/Boltrunian/Legends",
  "/wiki/Locru%27s_Central_Saloon",
  "/wiki/Smuggler/Legends",
  "/wiki/Ramiz",
  "/wiki/Wookiee/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Voren_Na%27al/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Swoop_gang/Legends",
  "/wiki/Star_Wars_(1977)_7",
  "/wiki/Roy_Thomas",
  "/wiki/Howard_Chaykin",
  "/wiki/1977",
  "/wiki/Star_Wars_(1977)_8",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Starhoppers_of_Aduba-3",
  "/wiki/Star_Wars_Gamer_4"
 ]
}