{
 "name": "Azzameen family",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation",
     "values": [
      "Twin Suns Transport Services",
      "Alliance to Restore the Republic",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "The Azzameen family was a family of traders who owned a small shipping business, the Twin Suns Transport Services.\nDuring the Galactic Civil War, the Azzameen family had a contract with the Rebel Alliance to deliver bacta to one of the Alliance bases serving as a hospital for Rebels wounded on Hoth. During one such trip, the Imperial Star Destroyer Corrupter arrived and attacked both the Alliance forces and the family vessels. In the aftermath of that battle the family was then declared traitors to the Empire and a warrant for capture was issued against them.\nThe Azzameens took what they could from their base and escaped before the Imperials arrived and took control of their shipyards and their base. The Azzameens found refuge on-board the Mon Calamari Star Cruiser Defiance. While the youngest son, Ace, enlisted with the Rebels as a fighter pilot, the rest of the family concentrated on getting back at the Viraxo and rebuilding the company.\nTheir first act was to raid the Viraxo station where Antan Azzameen was being held. Later Aeron recruited Ace to make a little run to pick-up a damaged probe droid in the Saila Na system to help keep track of the Viraxo. After an attempted assassination of K'Armyn Viraxo that turned-out to be a trap, they focused more on rebuilding their family business. They attacked at least two Viraxo supply depots in the next couple months for cargo to sell to the Rebels. During the first raid they discovered that the Viraxo were shipping arms for Black Sun; this discovery led to a quick strike against an Imperial Communications Station to plant a listening device on a satellite to better monitor the Viraxo-Black Sun alliance.\nAce had to lead one raid to bust Emon out of prison, and he later evaded the guns of Darth Vader's Super Star Destroyer to rescue Aeron from a base in the Vergesso Asteroids about to fall to an Imperial assault. After the Rebellion came under attack from mercenaries claiming to be working for the Sullustans, Ace and Aeron were tasked with finding their base, as their freighters would draw less attention than an Alliance ship. They found the base  and it turned out to be their old home station. Now that their mission was personal, the Alliance had no trouble recruiting Aeron and Emon to help them reclaim the station and expose the mercenaries. During the battle Emon spotted his uncle Antan's personal ship fleeing the mercenary base. Ace also recovered the Azzameen Family Crest during this endeavor and put it on display at his quarters as part of his collection.\nThey didn't have time to investigate their suspicions however; shortly after the battle, Antan informed them that Thomaas and Galin had been captured by the Imperials at the Rebel hospital and sent to a space station orbiting Kessel. Though they attempted to rescue them, they were unsuccessful: an Imperial Star Destroyer emerged from hyperspace and Antan revealed that he had led his family into a trap as part of a deal with the Empire. He escaped, and so did his niece and nephews with the help of Dunari. Ace would later go on to fight at the Battle of Endor.\nThe Azzameen family owned and operated a number of vessels, including two YT-1300 light freighters: Sabra and Selu, as well as the YT-2000 light freighter Otana. The family also owned the Firespray-31-class patrol and attack craft Andrasta, the GR-75 medium transport Vasudra, the modified Action IV transport Big Score, and several Toscan 8-Q starfighters.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Azameen",
  "/wiki/Human/Legends",
  "/wiki/Twin_Suns_Transport_Services/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Hospital_(XQ2_Platform)",
  "/wiki/Hoth/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Corrupter_(Imperial-class)",
  "/wiki/Battle_of_Hospital",
  "/wiki/Imperialization_of_Azzameen_assets",
  "/wiki/Mon_Calamari_Star_Cruiser",
  "/wiki/Defiance/Legends",
  "/wiki/Rescue_of_Antan_Azzameen",
  "/wiki/Viraxo_Industries_(platform)",
  "/wiki/Mission_to_the_Saila_Na_system",
  "/wiki/Damaged_Viper_probe_droid",
  "/wiki/Probe_droid/Legends",
  "/wiki/Saila_Na_system",
  "/wiki/Assassination_attempt_on_K%27Armyn_Viraxo",
  "/wiki/Black_Sun/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Vergesso_Asteroids/Legends",
  "/wiki/Battle_of_the_Bajic_Shipyards",
  "/wiki/Mission_to_meet_Bothan_delegation",
  "/wiki/Unidentified_mercenary_(Falcon%27s_Nest_mercenaries)",
  "/wiki/Sullustan/Legends",
  "/wiki/Reconnaissance_of_mercenary_base",
  "/wiki/Carida_system/Legends",
  "/wiki/Battle_of_Azzameen_Station",
  "/wiki/Kessel_Station",
  "/wiki/Kessel/Legends",
  "/wiki/Mission_to_Kessel_Station",
  "/wiki/Devastator/Legends",
  "/wiki/Dunari",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Sabra",
  "/wiki/Selu",
  "/wiki/YT-2000_light_freighter",
  "/wiki/Otana",
  "/wiki/Firespray-31-class_patrol_and_attack_craft/Legends",
  "/wiki/Andrasta",
  "/wiki/GR-75_medium_transport/Legends",
  "/wiki/Vasudra",
  "/wiki/Action_IV_transport",
  "/wiki/Big_Score",
  "/wiki/Toscan_8-Q_starfighter",
  "/wiki/Gender/Legends",
  "/wiki/Antan_Azzameen",
  "/wiki/Tomaas_Azzameen/Legends",
  "/wiki/Galin_Azzameen/Legends",
  "/wiki/Emon_Azzameen",
  "/wiki/Aeron_Azzameen",
  "/wiki/Ace_Azzameen/Legends",
  "/wiki/Star_Wars:_X-Wing_Alliance",
  "/wiki/LucasArts",
  "/wiki/Star_Wars:_X-Wing_Alliance:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_33"
 ]
}