{
 "name": "B'arin Apma",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Galactic RepublicCuy'val Dar",
      "Cuy'val Dar"
     ]
    }
   ]
  }
 ],
 "content": "B'arin Apma was a Human male who was one of the seventy-five Mandalorian warriors that were selected by Jango Fett to help train elite clones on Kamino, as part of the one hundred members of the Cuy'val Dar.\nBrotherhood, stamina, loyalty. These were the three pillars upon which B'arin Apma rested his entire life. These were also the three main tenets that he drilled into the clone troopers he trained. He believed these were as essential to a superior soldier as marksmanship and courage.\nB'arin Apma was created for an exclusive Entertainment Earth 7 action figure pack.\nThe actual figure comes with a Mitrinomon Z-6 jetpack instead of the Merr-Sonn JT-12 jetpack style shown in the promo pictures and box art. It is suspected the figure may have originally been intended to be Walon Vau, but the head did not fit the character so the idea may have been scrapped.\nThis figure has an all-new head, all-new legs, and arms and a torso taken from existing Jango Fett action figures. Arms were modified to remove the flame-thrower projectile and grappling line. Legs were modified by removing the Jango holsters, and uses the newer multi-articulate jointed system. The arms are not multi-jointed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Gray",
  "/wiki/Mandalorian/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cuy%27val_Dar",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Mitrinomon_Transports/Legends",
  "/wiki/Z-6_jetpack/Legends",
  "/wiki/Merr-Sonn_Munitions,_Inc./Legends",
  "/wiki/JT-12_jetpack/Legends",
  "/wiki/Walon_Vau",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_30th_Anniversary_Collection"
 ]
}