{
 "name": "B'ree",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Copper"
     ]
    }
   ]
  }
 ],
 "content": "B'ree was a Rodian male weapons merchant who lived on the Outer Rim Sith world of Korriban during the Jedi Civil War between the Galactic Republic and Sith Empire. He ran a kiosk in the settlement of Dreshdae, at which he sold weapons. In 3956 BBY, his sales increased after a power struggle at Dreshdae's Sith Academy.\nDuring the Jedi Civil War, a conflict between the Galactic Republic and the Sith Empire, B'ree lived on the Outer Rim Sith controlled planet of Korriban. By 3956 BBY, B'ree owned a kiosk near a landing pad in Dreshdae, a settlement on the planet. The majority of his stock consisted of arms brought to him through Mandalorian raider contacts he maintained. The Sith were dangerous, so B'ree encouraged newcomers to purchase his weaponry for defense.\nLater in the same year, former Dark Lord of the Sith Revan, who had lost his memories and retrained as a Jedi, arrived on Korriban during his search for the Star Forge. Revan approached the Rodian, who recognized the former as the champion of the Ahto City swoop track, located on the Inner Rim waterworld of Manaan. B'ree discussed his stock and opinions on the Sith. The Jedi later infiltrated the Sith Academy on the planet, killing Sith Master Uthar Wynn and redeeming his apprentice, Yuthura Ban. With no leaders, the Academy fell into a power struggle, causing B'ree's sales to increase drastically, a fact he later mentioned to Revan.\nB'ree was a Rodian male with copper-colored skin and black eyes.\nB'ree viewed the Sith as obnoxious, but understood that they were dangerous. He thus attempted to sell his weapons to newcomers of Korriban, to help them defend themselves. The Rodian was not shy about sharing his opinion on the Sith, even to strangers. B'ree believed that trouble was good for his business, especially when caused by the Sith.\nThe Rodian watched swoop racing and viewed Revan as a celebrity after he became champion of the Ahto City swoop track.\nB'ree wore a green and teal suit with bronze-colored boots, a harness, and a utility belt equipped with a holster.\nHe owned and sold several types of weapons, including blaster pistols, blaster rifles, grenades, mines, and melee weapons. Among his stock was the personal blaster pistol of Mandalorian Neo-crusader Cassus Fett.\nB'ree appeared as a non-player character in the 2003 video game Star Wars: Knights of the Old Republic, developed by BioWare. Interactions with B'ree are optional and have no effect on plot, quests, or alignment. B'ree will use new dialogue if the player talks to them after becoming the champion of the Ahto City swoop track on Mannan and after destabilizing the Sith Academy on Korriban.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Star_Tours/Legends",
  "/wiki/Bree_Starlighter",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Korriban",
  "/wiki/Jedi_Civil_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Dreshdae",
  "/wiki/3956_BBY",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Mandalorian/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Standard_year/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Amnesia/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Star_Forge",
  "/wiki/Ahto_City_swoop_track",
  "/wiki/Inner_Rim",
  "/wiki/Waterworld/Legends",
  "/wiki/Manaan/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Uthar_Wynn",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Yuthura_Ban",
  "/wiki/Eye/Legends",
  "/wiki/Swoop_racing/Legends",
  "/wiki/Ahto_City",
  "/wiki/Swoop_track",
  "/wiki/Clothing/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Harness",
  "/wiki/Utility_belt/Legends",
  "/wiki/Holster/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Mine/Legends",
  "/wiki/Cassus_Fett%27s_heavy_blaster_pistol",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Cassus_Fett",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/BioWare",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_Essential_Atlas"
 ]
}