{
 "name": "Ba'kif",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Stybla family",
      "Defense Hierarchy Council",
      "Chiss Expansionary Defense Fleet",
      "Stybla family",
      "Defense Hierarchy Council",
      "Chiss Expansionary Defense Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Ba'kif, previously known as Stybla'ba'kif and his core name Labaki during his time as a member of the Stybla family, was a Chiss male who served as the Supreme General of the Chiss Expansionary Defense Fleet and was a member of the Defense Hierarchy Council of the Chiss Ascendancy.\nBefore being promoted to the rank of flag officer, Ba'kif has been a member of the Stybla family and known by the name Stybla'ba'kif with the core name \"Labaki.\" He developed a close friendship with Mitth'oor'akiord, who would later become the Patriarch of the Mitth family.\nJust after Ba'kif was appointed General, he recommended that Mitth Aristocra Mitth'urf'ianico should recruit a Chiss named Kivu'raw'nuru, or Vurawn, to the Mitth family. Ba'kif suggested Vurawn be transferred to the Taharim Academy on Naporar after his acceptance to the Mitth.\nAfter an attack on Csilla, the Nine Ruling Families convened with Ba'kif to discuss their next steps. Ba'kif deduced that the attack was meant to distract the Chiss Ascendancy from an event that had already occurred. During the meeting, an aide of Ba'kif's located Senior Captain Mitth'raw'nuruodo \"Thrawn\" on Naporar.\nBa'kif and Thrawn traveled to the Dioya system in hopes of examining the wreckage of a refugee ship. They deduced that, due to the damage pattern destroying the ship rather than demobilizing the ship, the attacking force had not been pirates. Ba'kif and Thrawn donned boarding suits and boarded the drifting craft.\nA blue-skinned Chiss male, Supreme General Ba'kif both admired the tactical genius of Senior Captain Thrawn and saw the officer's political ineptitude. Ba'kif was capable of making \"soothing noises\" to mollify politicians of the Chiss Syndicure even as his thoughts dwelled on tactical matters and strategic planning. Ba'kif was steadfast about enforcing the separation of powers between the Syndicure and the Chiss Defense Force, taking opportunities to \"remind\" the civilian leaders that only the Defense Hierarchy Council had authority over the military.\nBa'kif first appeared in the 2020 novel Thrawn Ascendancy: Chaos Rising, written by Timothy Zahn as the first novel of Star Wars: The Ascendancy Trilogy. In that trilogy, Ba'kif serves as a mentor, benefactor, supporter, and occasional detractor of the trilogy's titular character, Thrawn.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Stybla_family",
  "/wiki/Defense_Hierarchy_Council",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Core_name",
  "/wiki/Supreme_General",
  "/wiki/Military_rank",
  "/wiki/Flag_officer",
  "/wiki/Mitth%27oor%27akiord",
  "/wiki/Patriarch",
  "/wiki/Mitth_family",
  "/wiki/General",
  "/wiki/Aristocra",
  "/wiki/Mitth%27urf%27ianico",
  "/wiki/Rematching",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Taharim_Academy",
  "/wiki/Naporar",
  "/wiki/Attack_on_Csilla",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Ba%27kif%27s_aide",
  "/wiki/Senior_Captain",
  "/wiki/Dioya_system",
  "/wiki/Pirate",
  "/wiki/Chiss_Syndicure",
  "/wiki/Chiss_Defense_Force",
  "/wiki/2020",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Timothy_Zahn",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)"
 ]
}