{
 "name": "Babu_Frik",
 "display_name": "Babu Frik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kijimi"
     ]
    },
    {
     "name": "Born",
     "values": [
      "50 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Anzellan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "0.22 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Spice Runners of Kijimi",
      "Citizens' Fleet",
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Babu Frik was an Anzellan male who lived during the time of the New Republic Era and the war between the First Order and the Resistance. He maintained a workshop where he worked as a droidsmith among the Spice Runners of Kijimi. He could reprogram or modify almost any droid, regardless of its security measures. He spoke a fractured, heavily accented form of Basic known as Anzellan.\nBabu Frik worked for the Spice Runners of Kijimi on the planet of Kijimi for some time before the Cold War. When Zorii Bliss and Poe Dameron and members of the gang went to Quintil to rescue Tomasso, Bliss asked after Frik. Later, after Bliss and Dameron were inducted as Spice Runners, Bliss brought Dameron and their damaged droid companion EV-6B6 to Babu, who fixed the droid for them. When Dameron abandoned the group to join the New Republic, Babu allowed him to take a holographic disguise matrix so he could sneak offworld. Sometime after the Battle of Crait, Kijimi fell under First Order occupation, which made life more difficult for Babu and the band of spice runners.\nDuring the war between the First Order and the Resistance, a group of Resistance members consisting of Rey, Finn, Chewbacca, BB-8, C-3PO, and the now Resistance Commander Poe Dameron recovered a Sith dagger. While C-3PO was able to translate the Sith inscriptions on the dagger, his programming prevented him from revealing the translation to anyone. When Chewbacca was captured along with the dagger, the group went to Kijimi to find Babu Frik in order to retrieve the information in C-3PO's memory banks following the recommendations of Poe.\nBabu was able to bypass C-3PO's programming restrictions to allow C-3PO to speak the translation. Aware that the procedure would erase his memory, C-3PO decided to undergo it as he knew there was no other way to have a chance at defeating Darth Sidious. The protocol droid later regained his memory from a backup carried by R2-D2. Babu tinkered with C-3PO's main processing unit in order to locate the text of the inscription and override the programming preventing C-3PO from speaking the translation. During the procedure, C-3PO's photoreceptors became red as he spoke the words. After completing the translation C-3PO was rebooted with no memory, leaving him only with his base factory programming.\nUpon the departure of the Resistance fighters, Babu Frik contacted Jannah and the rest of Company 77 on Kef Bir in the hope that they would be able to aid the fighters on their quest to find the Emperor's wayfinder which would lead them to the Sith world of Exegol. While Frik was busy working on a battle droid, Sidious gave the order to use one of his Xyston-class Star Destroyers to destroy Kijimi. While Frik escaped with Bliss, leaving his battle droid behind, the snow-covered planet was obliterated by the Sith Star Destroyer's axial superlaser.\nAlthough Dameron feared his old friends had been killed, both Babu Frik and Zorii Bliss joined with Lando Calrissian and the Citizens' Fleet. The two flew a BTA-NR2 Y-wing starfighter during the Battle of Exegol against the Sith Eternal forces, including the Final Order. Zorii and Babu destroyed one of the Xyston-class Star Destroyers during the battle and later celebrated the defeat of the Emperor and the Sith Eternal on Ajan Kloss with the rest of the freedom fighters. Later, Frik joined the Resistance itself.\nBabu Frik was a character created for the 2019 film Star Wars: Episode IX The Rise of Skywalker, the third and final installment of the Star Wars sequel trilogy. He was voiced by British actress Shirley Henderson. He was first revealed during the 2019 Force Friday merchandise reveal.\nAccording to sound editors David Acord and Matthew Wood, Henderson learned to puppeteer for the role so she could \"improv and actually move the character's mouth. She was puppeteering while she was doing the improv for the character. She came up with that language and performed it that way. We preserved all of her production sounds, and that was entirely shot on set, live, with her own movement.\"\nBabu Frik originated in a January 2018 version of the story. Then called \"Babu Zazi,\" he was going to give the heroes an almost-finished device that could have shut down all First Order technology when completed. According to special effects artist Neal Scanlan, though he isn't sure if it's actually true, he believes that when J.J. Abrams screened The Rise of Skywalker to Steven Spielberg, Spielberg asked Abrams what happened to Babu Frik, as the character was supposedly originally going to die when Kijimi was destroyed as recalled to Ivan Manzella. Henderson herself expressed surprise upon Frik's reappearance during the Battle of Exegol sequence, where he was inserted by the Industrial Light \u0026 Magic crewmembers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kijimi",
  "/wiki/50_BBY",
  "/wiki/Anzellan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Spice_Runners_of_Kijimi",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Resistance",
  "/wiki/Time",
  "/wiki/New_Republic_Era",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Babu_Frik%27s_workshop",
  "/wiki/Droidsmith",
  "/wiki/Droid",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Anzellan_(language)",
  "/wiki/Planet",
  "/wiki/Cold_War",
  "/wiki/Zorii_Bliss",
  "/wiki/Poe_Dameron",
  "/wiki/Quintil",
  "/wiki/Tomasso",
  "/wiki/EV-6B6",
  "/wiki/New_Republic",
  "/wiki/Holographic_disguise_matrix",
  "/wiki/Battle_of_Crait",
  "/wiki/Spicerunner",
  "/wiki/Rey_Skywalker",
  "/wiki/Finn",
  "/wiki/Chewbacca",
  "/wiki/BB-8",
  "/wiki/C-3PO",
  "/wiki/Commander",
  "/wiki/Blade_of_Ochi_of_Bestoon",
  "/wiki/Sith",
  "/wiki/Mission_to_Kijimi",
  "/wiki/Darth_Sidious",
  "/wiki/R2-D2",
  "/wiki/Jannah",
  "/wiki/Company_77",
  "/wiki/Kef_Bir",
  "/wiki/Emperor%27s_wayfinder",
  "/wiki/Exegol",
  "/wiki/Unidentified_battle_droid",
  "/wiki/Derriphan",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Destruction_of_Kijimi",
  "/wiki/Battle_droid",
  "/wiki/Axial_superlaser",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Comeuppance",
  "/wiki/Battle_of_Exegol",
  "/wiki/Sith_Eternal_military",
  "/wiki/Final_Order",
  "/wiki/Sith_Eternal",
  "/wiki/Ajan_Kloss",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/Shirley_Henderson",
  "/wiki/Force_Friday",
  "/wiki/David_Acord",
  "/wiki/Matthew_Wood",
  "/wiki/January",
  "/wiki/2018",
  "/wiki/Neal_Scanlan",
  "/wiki/J.J._Abrams",
  "/wiki/Steven_Spielberg",
  "/wiki/Ivan_Manzella",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Poe_Dameron:_Free_Fall",
  "/wiki/Poe_Dameron:_Free_Fall_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_(Screen_Comix)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/The_Rise_of_Skywalker_(Little_Golden_Book)",
  "/wiki/The_LEGO_Star_Wars_Holiday_Special",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/General_Equipment_(I)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/StarWarsKids.com",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/Reproduction",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/January_29",
  "/wiki/2020",
  "/wiki/June_24",
  "/wiki/April_14",
  "/wiki/May_31"
 ]
}