{
 "name": "Bacca",
 "display_name": "Bacca",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rwookrrorro"
     ]
    }
   ]
  }
 ],
 "content": "Bacca, often remembered as the Great Bacca, was a male Wookiee from Kashyyyk who lived centuries prior to the Old Sith Wars era. He was famed for crafting a ceremonial sword that came to symbolize leadership among his people. Many centuries after his death, Bacca's lineage was still alive through the family of Attichitcuk and his son Chewbacca.\nThe Wookiee male known as Bacca was born on Kashyyyk several centuries before the Old Sith Wars. He originated from Rwookrrorro, the capital city of his people, and his name meant into as \"ally\" or \"friend\" in Shyriiwook, the main Wookiee language. At some point when Bacca had already grown old, he discovered a crashed starship during an expedition in the Nother World. That encounter marked the first time a Wookiee realized that life existed outside of Kashyyyk. Bacca scavenged metallic debris from the wreckage and used it to craft a vibroblade. That weapon, which came to be known as Bacca's Ceremonial Blade, became the symbol of Wookiee independence. Bacca himself rose to become the first great Wookiee Chieftain.\nFollowing Bacca's death, his Ceremonial Blade was passed down from chieftain to chieftain as a symbol of leadership. At some point, Bacca's descendant Rothrrrawr raided the Nother World, hoping to defeat a vicious terentatek called the Great Beast in a ritual combat. However, the ambitious warrior only managed to wound the beast, breaking off the blade inside the creature's hide. He fled only with the hilt of the blade, which continued to be passed down through the generations. A generation later, in 3956 BBY, the blade was finally recovered by Revan and put back together with its handle.\nThe name of Bacca was also carried with many Wookiees after him, marking them as descendants of his prestigious lineage. Those individuals included members of Attichitcuk's family such as Chewbacca and his nephew Lowbacca, and others like Kybacca and Weebacca.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Rwookrrorro/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Old_Sith_Wars",
  "/wiki/Bacca%27s_Ceremonial_Blade",
  "/wiki/Attichitcuk%27s_family",
  "/wiki/Attichitcuk/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Shyriiwook/Legends",
  "/wiki/Language/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Shadowlands/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Wookiee_Chieftain",
  "/wiki/Death/Legends",
  "/wiki/Rothrrrawr",
  "/wiki/Terentatek/Legends",
  "/wiki/Great_Beast",
  "/wiki/3956_BBY",
  "/wiki/Revan/Legends",
  "/wiki/Lowbacca",
  "/wiki/Kybacca",
  "/wiki/Weebacca",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.19",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_74",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Galactic_Battlegrounds"
 ]
}