{
 "name": "Bachenkall",
 "display_name": "Bachenkall",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Bachenkall, a male Human Imperial Navy officer, was one of the Star Dreadnought Executor's helmsmen during the events leading up to the Battle of Hoth. He was trained in capital ship piloting and tactics at the Imperial Training Academy on Raithal, and he eventually rose to the rank of warrant officer. In 3 ABY, Bachenkall was present in the crewpits of the Executor, serving under Lieutenant Commander Ardan, when Darth Vader entered the bridge to discuss the findings of a Viper probe droid. The droid had discovered the location of Echo Base, the Rebel Alliance's headquarters in the Hoth system.\nThe Human male Bachenkall served in the Imperial Navy during the Galactic Civil War. He graduated from the Imperial Training Academy on the planet Raithal, a naval school that trained pilots in capital starship helm tactics. By early 3 ABY, Bachenkall had risen to the rank of warrant officer and served with the Imperial Death Squadron aboard the Star Dreadnought Executor, the personal flagship of Lord Darth Vader, as a helmsman under Lieutenant Commander Ardan's supervision.\nIn 3 ABY, Bachenkall was present within the Executor's starboard command pit when Vader strode across the bridge's command walkway to discuss the findings of a Viper probe droid in the Hoth system with Fleet Admiral Kendal Ozzel and Captain Firmus Piett. Along with the rest of the crewmen within the command pit, Bachenkall watched in fearful silence as the Dark Lord passed above them. The probe droid's data revealed the location of Echo Base, the Rebel Alliance's headquarters on the planet Hoth, leading to the Executor's participation in the subsequent Battle of Hoth.\nBachenkall was typical of graduates of the Empire's Training Academy on Raithal, where he was trained in capital starship helm tactics. Bachenkall and the other members of the pit crew displayed fearful deference at the presence of Darth Vader as he stalked across the upper command walkway of the Executor's bridge to learn of the Viper probe droid's report in the Hoth system.\nBachenkall made his first appearance in the film Star Wars: Episode V The Empire Strikes Back as an unidentified extra among Darth Vader's bridge crew. The character's name and elements of his backstory were introduced in the Dagobah Limited expansion set of Decipher, Inc.'s Star Wars Customizable Card Game, released in April 1997.\nThe character name \"Bachenkall\" is an anagram of Decipher game playtester Chuck Kallenbach.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Helm_officer/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Raithal_Academy/Legends",
  "/wiki/Raithal/Legends",
  "/wiki/Warrant_Officer/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Lieutenant_Commander/Legends",
  "/wiki/Ardan",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Viper_probe_droid/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Hoth_system/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Death_Squadron/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Fleet_Admiral/Legends",
  "/wiki/Kendal_Ozzel/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Firmus_Piett/Legends",
  "/wiki/Probe_droid/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Dagobah_Limited",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/April",
  "/wiki/1997",
  "/wiki/Tuckerization",
  "/wiki/Chuck_Kallenbach",
  "/wiki/The_Empire_Strikes_Back_Notebook",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/Jedi_Council_Forums",
  "/wiki/October_23",
  "/wiki/2013",
  "/wiki/May_15",
  "/wiki/2009"
 ]
}