{
 "name": "Baeshana",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cularin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarasin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Wyrd"
     ]
    }
   ]
  }
 ],
 "content": "Baeshana was a female Tarasin and a member of the Wyrd Force witch living on the planet Cularin during the waning years of the Galactic Republic.\nA Force-sensitive Tarasin, Baeshana lived on the planet Cularin during the final decades of the Galactic Republic. A member of the Wyrd, Baeshana was trained in the ways of the Force by the group and eventually was skilled enough to be considered a witch. During her time as a Wyrd sister, Baeshana employed a bodyguard named Veshin.\nWhen the Clone Wars erupted across the galaxy, a conflict between the Republic and the Confederacy of Independent Systems, Baeshana resided the village of the Zhadorii irstat. Residing in the camp's central tent, she was visit when the village was attacked by a band of mercenaries and freedom fighters known as the Heroes of Cularin.\nIn Hunting the Wyrd the identity of the Wyrd sister and bodyguard that the player characters fight in the central hut varies, depending on player level. Upper-level players fight Baeshana and Veshin, but Mid-Level players fight Naelora and Kosaa instead, while High-Level players face Torunin and Savina. It is also possible for the players to avoid the hut, so the fight against Baeshana doesn't even have to take place.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Tarasin",
  "/wiki/Gender/Legends",
  "/wiki/Wyrd",
  "/wiki/The_Force/Legends",
  "/wiki/Witch/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Veshin",
  "/wiki/Canon",
  "/wiki/Clone_Wars/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Zhadorii_irstat",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Hunting_the_Wyrd",
  "/wiki/Naelora",
  "/wiki/Kosaa",
  "/wiki/Torunin",
  "/wiki/Savina"
 ]
}