{
 "name": "Bahb",
 "display_name": "Bahb",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zeltros"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zeltron"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance of Free Planets"
     ]
    }
   ]
  }
 ],
 "content": "Bahb was a male Zeltron, who, along with three other Zeltrons—Jahn, Marruc and Rahuhl, volunteered to be attaché to Princess Leia Organa in 4 ABY. Despite Leia's dislike of Zeltrons, Admiral Ackbar felt it was essential to assign the boys to her in order to retain diplomatic ties to their homeworld. Bahb and the other Zeltrons were delighted to work with Leia, of whom they'd heard many stories, and well as Han Solo—although they initially mistook him for Lando Calrissian.\nTheir first assignment was to a diplomatic party on Kabray. Unfortunately, the Nagai had targeted the gathering as an opportunity to hamstring the Alliance, and captured the entire party and Leia's newly arrived group. Trapped in a room, the four Zeltrons devised a plan, hoisting Jahn up to the ceiling where he jumped on an incoming Nagai guard. The Zeltrons then turned the tables on the Nagai raiding party, capturing them all and turning their guns on them. Their fierce efforts impressed both Han and Leia, who began to warm up to the Zeltrons. Their efforts were also noticed by the Nagai leadership who would later target their homeworld.\nReturning to Endor with their captured prisoners, Bahb and the Zeltrons handed them over for interrogation. They were there when the invading Nagai fleet came out of hyperspace, and were the first to detect them with Leia. Bahb and Jahn then ran off to find and warn Luke Skywalker in the forest. After warning him and returning to the tracking station to watch the fighter squadrons engaged in space, the four Zeltrons were unexpectedly caught up in a ground battle against a force of Maccabrees and Nagai who had sneaked onto the moon's surface. After repelling the first warrior, many more arrived, one grabbing Bahb around the neck. Only the timely arrival of Luke Skywalker who discovered the Maccabree's weakness, saved the lives of the Zeltrons. They then evacuated Endor along with the rest of the Alliance.\nHaving fled Endor, Bahb and the Zeltron boys also took part in the Battle of Zeltros. The planet had in part been identified as a target due to their efforts on Kabray. During the battle they were captured by the Tofs who mistakenly identified them as important Alliance commanders. They were then imprisoned on the Tof flagship  Merriweather . Luke Skywalker, teamed up with Hoojibs and Hiromi, led a successful mission to rescue them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_(1977)_108",
  "/wiki/Zeltros/Legends",
  "/wiki/Zeltron/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/Kabray",
  "/wiki/Jahn",
  "/wiki/Marruc",
  "/wiki/Rahuhl",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/4_ABY/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Nagai",
  "/wiki/Skirmish_on_Kabray",
  "/wiki/Den_Siva",
  "/wiki/Maccabree",
  "/wiki/Second_Battle_of_Endor",
  "/wiki/Endor/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Battle_of_Zeltros",
  "/wiki/Tof",
  "/wiki/Merriweather",
  "/wiki/Hoojib/Legends",
  "/wiki/Hiromi",
  "/wiki/Star_Wars_(1977)_95",
  "/wiki/Star_Wars_(1977)_96",
  "/wiki/Star_Wars_(1977)_97",
  "/wiki/Star_Wars_(1977)_101",
  "/wiki/Star_Wars_(1977)_99",
  "/wiki/Star_Wars_(1977)_100",
  "/wiki/Star_Wars_(1977)_103",
  "/wiki/Star_Wars_(1977)_104",
  "/wiki/Star_Wars_(1977)_105",
  "/wiki/Star_Wars_(1977)_106",
  "/wiki/Star_Wars_(1977)_107",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Marvel_Series",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/Wizards.com",
  "/wiki/Zeltros:_Pleasure_Planet",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/The_Forgotten_War:_The_Nagai_and_the_Tofs",
  "/wiki/StarWars.com"
 ]
}