{
 "name": "Bail Antilles  (Galactic Alliance)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 130 and 137 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "Triumvirate",
      "Triumvirate"
     ]
    }
   ]
  }
 ],
 "content": "Bail Antilles, a Human male, was a politician who rose through the ranks of the Galactic Alliance bureaucracy and became one of the three members of the government's ruling Triumvirate at some point before 130 ABY. He was known to be a level-headed individual who carefully considered his options, and he often provided the swing vote between his fellow Triumvirs, Gial Gahan and Nu Toreena. Based on the Alliance capital world of Coruscant, Antilles had a daughter named Ona.\nAntilles served in the Triumvirate during the Alliance's Sith–Imperial War with the Galactic Empire, which saw numerous Alliance member worlds defect to the enemy. When Rear Admiral Piers Petan proposed striking at a lightly-guarded Emperor Roan Fel at the planet Caamas, Antilles's vote was the deciding factor. Although Jedi Master Kol Skywalker and Admiral Gar Stazi both suspected a trap, Antilles felt that the dying Alliance needed to take the risk. The Empire sprang their trap at the Battle of Caamas, and the outmatched Alliance surrendered and conceded the war. The Triumvirs were replaced by loyal Imperial bureaucrats, and Antilles died at some point before 137 ABY.\nBail Antilles was a Human male who came from a family that was dedicated to governmental service. Prior to 130 ABY, he became a politician in the Galactic Federation of Free Alliances, a constitutional federation of member worlds and allied autonomous states. At some point, he sired a daughter, Ona Antilles. Antilles's personal charisma, connections, and family name allowed him to rise through the political ranks, and he eventually became a member of the Galactic Alliance's ruling Triumvirate. On the Alliance's capital world of Coruscant, Antilles served alongside the Mon Calamari Gial Gahan and the Ithorian Nu Toreena, all three of them having been elected by the Galactic Alliance Senate. Each Triumvir worked individually with specific government offices and advisory councils, and the three often consulted with members of the Alliance-allied New Jedi Order. A majority was required before the Triumvirate could make decisions or set policies, and the level-headed Antilles often cast the deciding vote.\nThe Triumvirate faced a crisis in the year 127 ABY. The Jedi had been working with the Yuuzhan Vong—a species hated and feared by the galactic community due to a war of conquest they had initiated a century prior—to restore ravaged worlds with Yuuzhan Vong terraforming technology in an effort called the Ossus Project. The project was secretly sabotaged by the mysterious One Sith, however, and lethal mutations began to occur in the terraformed worlds' populations. The galaxy was outraged, but the Jedi convinced the Galactic Alliance to stand behind the Yuuzhan Vong. When the Galactic Empire called for retribution and declared war on the Alliance, Antilles, Gahan, and Toreena found themselves leading their government through the Sith–Imperial War.\nAs the Empire exploited the failure of the Ossus Project to draw new worlds into its influence, the Alliance lost system after system, as well as vital military support. Many of the war plans concocted by Antilles and the Triumvirate failed, but the Empire struggled against the Force abilities of the Jedi. However, one year into the conflict, the Sith emerged from hiding and entered the fighting on the Empire's side. The Empire won victory after victory over the next two years, and by 130 ABY, factions within the Alliance who felt that their organization was grievously suffering sought a quick end to the war. When the Human Rear Admiral Piers Petan received intelligence that Emperor Roan Fel and a light escort would be covertly meeting with representatives of the Hapes Consortium and Chiss Ascendancy in orbit near the planet Caamas, he came before the Triumvirate on Coruscant with a plan: send all available ships to Caamas, capture or kill Fel, and force a peace upon the Empire.\nAlso present at the meeting were Human Jedi Master Kol Skywalker and Duros Admiral Gar Stazi, both of whom expressed a belief that the intelligence had been planted in order to lure the Galactic Alliance Core Fleet away from Coruscant and into a trap. Gahan stood by the Jedi and cast his vote against the action while Toreena supported Petan, which left the decision to Antilles. He reluctantly obliged, believing that they had to take the risk despite their misgivings. The Battle of Caamas was indeed a trap, and the Alliance fleet was defeated while the Sith simultaneously attacked the Jedi present on a defenseless Coruscant. Petan surrendered to Imperial Grand Admiral Morlish Veed, which brought the war to an end. The Empire took control of every Alliance member world, and the Galactic Alliance ceased to exist.\nThe Empire preserved the Alliance bureaucracy, adapting the existing political and governmental services for its new regime; although the Triumvirate was retained, Antilles and his comrades were quickly replaced with loyal Imperial bureaucrats. The Triumvirate became an executive body at the command of the Emperor, who was soon afterward usurped from his throne by the Sith Lord Darth Krayt and sent into exile. Lord Krayt's Empire was challenged by Admiral Stazi, who had escaped from Caamas and formed the Galactic Alliance Remnant, and Ona Antilles served Stazi as a lieutenant. Bail Antilles died at some point prior to 137 ABY, by which time Ona no longer thought of him.\nBail Antilles was able to rise through the Galactic Alliance's political ranks due to his family name, connections, and personal charisma. As a member of the Triumvirate, he was known to carefully consider all options and not unwaveringly follow any particular organization or policy. Antilles was seen as level-headed, and he often provided the swing vote between the Jedi-sympathetic Gial Gahan and the quick–fix–seeking Nu Toreena. When deciding whether or not to attack the Empire at Caamas, Antilles considered the opposing viewpoints of both Piers Petan and Gar Stazi before ultimately choosing to risk the attack—Antilles felt that the Alliance, bereft of support from a number of systems, was slowly bleeding to death.\nAntilles's hair was brown, his eyes were blue, and his skin was light in color. He could speak Galactic Basic Standard, Durese, High Galactic, Mon Calamarian, and Sullustese, and he possessed fine clothing, a blaster pistol, an encrypted comlink, and a datapad.\nBail Antilles was introduced to the Star Wars Expanded Universe by John Ostrander and Jan Duursema, authors of the comic series Star Wars: Legacy. He first appeared in a flashback in the series' twentieth issue, which was penciled by Omar Francia and released in February 2008. Further information on the character was provided in 2009's Legacy Era Campaign Guide, written by Rodney Thompson, Sterling Hershey, and Gary Astleford.\nThe name \"Bail Antilles\" has a long history in both Star Wars Canon and Legends, having first appeared in George Lucas's 132-page rough draft of the original Star Wars film, completed in May 1974. That character was eventually renamed Bail Organa, and a different Bail Antilles was later mentioned in the 1999 film Star Wars: Episode I The Phantom Menace. Murder on the Executor, a 2009 Wizards of the Coast roleplaying adventure, additionally used \"Bail Antilles\" as an alias for an agent of the Rebel Alliance. Stephen J. Sansweet of Lucasfilm Ltd. has established that \"Antilles\" is a very common name in the Star Wars universe, analogous to the family names \"Jones\" and \"Smith\" in some English-speaking countries.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Bail_Antilles_(disambiguation)",
  "/wiki/130_ABY",
  "/wiki/137_ABY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Triumvirate_(Galactic_Alliance)",
  "/wiki/Politics/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Gial_Gahan",
  "/wiki/Nu_Toreena",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Ona_Antilles",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Fel_Empire",
  "/wiki/Rear_Admiral/Legends",
  "/wiki/Piers_Petan",
  "/wiki/Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Caamas/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kol_Skywalker",
  "/wiki/Admiral/Legends",
  "/wiki/Gar_Stazi",
  "/wiki/Battle_of_Caamas",
  "/wiki/Death/Legends",
  "/wiki/Antilles_family_(Galactic_Alliance)",
  "/wiki/Reproduction/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Galactic_Alliance_Senate",
  "/wiki/Advisor/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Standard_year/Legends",
  "/wiki/127_ABY",
  "/wiki/Jedi/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Species/Legends",
  "/wiki/Galactic_community",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Time/Legends",
  "/wiki/Terraforming/Legends",
  "/wiki/Biot",
  "/wiki/Ossus_Project",
  "/wiki/Saboteur/Legends",
  "/wiki/One_Sith",
  "/wiki/Mutant",
  "/wiki/The_galaxy/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/128_ABY",
  "/wiki/Sith/Legends",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Galactic_Alliance_Core_Fleet",
  "/wiki/Galactic_Alliance_Defense_Fleet",
  "/wiki/Space_warfare",
  "/wiki/Battle_of_Coruscant_(Sith%E2%80%93Imperial_War)",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Morlish_Veed",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Lieutenant/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Durese/Legends",
  "/wiki/High_Galactic/Legends",
  "/wiki/Mon_Calamarian",
  "/wiki/Sullustese/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Star_Wars",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Legacy_(2006)_20",
  "/wiki/Omar_Francia",
  "/wiki/February",
  "/wiki/2008",
  "/wiki/2009",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Rodney_Thompson",
  "/wiki/Sterling_Hershey",
  "/wiki/Gary_Astleford",
  "/wiki/Canon",
  "/wiki/George_Lucas",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/May",
  "/wiki/1974",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Bail_Antilles/Legends",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Murder_on_the_Executor",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Roleplaying_game",
  "/wiki/Bail_Antilles_(Rebel_Alliance)",
  "/wiki/Agent/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Stephen_J._Sansweet",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Legacy_(2006)_42",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Cal_Omas",
  "/wiki/28_ABY/Legends",
  "/wiki/40_ABY",
  "/wiki/Cha_Niathal",
  "/wiki/Darth_Caedus",
  "/wiki/41_ABY",
  "/wiki/Natasi_Daala",
  "/wiki/44_ABY",
  "/wiki/Saba_Sebatyne",
  "/wiki/Haydnat_Treen",
  "/wiki/Merratt_Jaxton",
  "/wiki/Wynn_Dorvan",
  "/wiki/Padnel_Ovin",
  "/wiki/Abeloth",
  "/wiki/Rokari_Kem",
  "/wiki/Category:Images_of_Bail_Antilles_(Galactic_Alliance)",
  "/wiki/Legacy_(2006)_0",
  "/wiki/Legacy_(2006)_15",
  "/wiki/Legacy_(2006)_8",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Legacy_(2006)_1",
  "/wiki/Legacy_(2006)_21",
  "/wiki/March_31",
  "/wiki/2010",
  "/wiki/July_16",
  "/wiki/2011",
  "/wiki/Databank_(original)",
  "/wiki/July_6",
  "/wiki/Fate_of_the_Jedi:_Apocalypse"
 ]
}