{
 "name": "Baji",
 "display_name": "Baji",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Moltok"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ho'Din"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Baji was a male Ho'Din healer who mainly worked in the rain-forests of Yavin 4. He always spoke in rhyme, and, like almost all his species, he was a botanist. He was very peaceful but loathed the Empire. In 5 ABY, Baji met Luke Skywalker, who was searching for the Lost City of the Jedi, and Ken, who was fleeing the city. Later Trioculus arrived, searching for the city on Kadann's orders, and captured Baji. He forced him to help heal the new Emperor's blindness. Baji was forced to remain in Imperial service, serving as a staff physician. Nevertheless, at some point he made it to Barenth, where he continued his botanical research.\nBaji lived in a hut buried within Yavin 4's rain-forests. His hut had very little in it, only containing a bed made out of leaves and a table with a few chairs. He would collect plant species he feared might go extinct, and when a ship came from Moltok, he would send his collection off with them for other botanists to study.\nLuke Skywalker met Baji while seeking the Lost City of the Jedi. Into this encounter arrived Ken and DJ-88, both of whose presence proved temporary. Baji and Ken later met again when the Empire set the forest afire during its own search for the Lost City. Ken offered Baji shelter in the City, but Baji refused—one of Moltok's transports was scheduled to arrive the next day. This rejection ultimately proved unwise as stormtroopers soon came to arrest the Ho'Din healer, desiring him to cure the ersatz emperor Trioculus' blindness. Certain seeds were necessary to effect the cure. Baji was then drafted, at gunpoint, into the Empire as Trioculus' personal physician.\nThe next day, desiring to learn more about healing agents, he visited the planet Barenth, which was home to a series of unique healing plants. Discovering an ancient laboratory, he chose to explore it. He found his healing plants at last but only as an groundquake struck. He gathered some plants and left. Later he would came back only to find it in a heaping pile of rubble—on the surface at least. The plants were not destroyed; however, they were contaminated. Baji was forced to make a decision—to leave the planet with the plants that he had initially found or stay on Barenth and do what he could to help. He would eventually decide to stay and cure the contaminated plants.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Baji",
  "/wiki/Moltok/Legends",
  "/wiki/Ho%27Din/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Species/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Lost_City_of_the_Jedi",
  "/wiki/Ken",
  "/wiki/City/Legends",
  "/wiki/Trioculus",
  "/wiki/Rajah_Ubooki",
  "/wiki/Barenth",
  "/wiki/DJ-88",
  "/wiki/Barenth_healing_plant",
  "/wiki/Groundquake/Legends",
  "/wiki/The_Lost_City_of_the_Jedi",
  "/wiki/Queen_of_the_Empire",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Secrets_of_Star_Wars:_Shadows_of_the_Empire",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}