{
 "name": "Bajjo",
 "display_name": "Bajjo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pijal's moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Opposition"
     ]
    }
   ]
  }
 ],
 "content": "Bajjo was a human female performing artist from the moon of the Inner Rim planet Pijal who lived during the Republic Era. She was a member of the Opposition, a Pijali political performance troupe led by Halin Azucca. Around 40 BBY, the Opposition protested the signing of the Governance Treaty due to its support of the Czerka Corporation and was framed for violent attacks on Czerka facilities as a result. While in hiding on Pijal's moon, Azucca informed the Jedi Qui-Gon Jinn and Obi-Wan Kenobi of the troupe's framing, and an Opposition member corroborated her claim by citing Bajjo and other members' artistic pasts as proof of their innocence.\nThe human Bajjo was a female individual who hailed from the moon of the Inner Rim planet Pijal. During the Republic Era, the performing artist joined the Opposition, a political performance troupe of Pijali natives led by Halin Azucca. For some time, the group hosted theatrical performances on Pijal that showcased its opinions on local issues while also being informative to the public. During these exhibitions, Bajjo focused her eye-lenses to create abstract holograms. By around 40 BBY, the Opposition began to protest the Governance Treaty, believing that the motion would cede irrevocable power to the Czerka Corporation, which had been exploiting the resources of Pijal and its moon for centuries.\nShortly after voicing its dissent to the treaty, the troupe was framed by the Pijali monarchy for several violent attacks on Czerka facilities, which forced the group into hiding on Pijal's moon. When Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, visited Pijal's moon, they were attacked by a secret division of Pijali royal guards called blackguards. Opposition members rescued them, and Azucca explained to the Jedi that their troupe had been framed for the recent attacks. An Opposition member corroborated Azucca's claim by citing Bajjo's and other members' innocuous pasts as proof of their innocence.\nAs a performing artist in the Opposition, Bajjo enjoyed participating in her troupe's exhibitions to express political opinions. She protested the signing of the Governance Treaty but was unwilling to resort to violence in the process. One of Bajjo's colleagues described her past occupation as an artist to be innocuous.\nBajjo was mentioned in Master \u0026 Apprentice, a 2019 novel by Claudia Gray.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Pijal%27s_moon",
  "/wiki/Human",
  "/wiki/Pijali",
  "/wiki/Gender",
  "/wiki/Opposition",
  "/wiki/File:Bajjo.ogg",
  "/wiki/Artist",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Pijal",
  "/wiki/Republic_Era",
  "/wiki/Politics",
  "/wiki/Halin_Azucca",
  "/wiki/40_BBY",
  "/wiki/Governance_Treaty",
  "/wiki/Czerka_Arms",
  "/wiki/Opposition_hideout",
  "/wiki/Moon",
  "/wiki/Jedi",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Unidentified_Opposition_member",
  "/wiki/File:Opposition.ogg",
  "/wiki/Homeworld",
  "/wiki/Time",
  "/wiki/Eye",
  "/wiki/Glass",
  "/wiki/Hologram",
  "/wiki/Standard_century",
  "/wiki/Pijali_monarchy",
  "/wiki/Jedi_Master",
  "/wiki/Padawan",
  "/wiki/Royal_guard_(Pijal)",
  "/wiki/Blackguard",
  "/wiki/Master_%26_Apprentice",
  "/wiki/2019",
  "/wiki/Claudia_Gray",
  "/wiki/Master_%26_Apprentice_(audiobook)",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Standard_year",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/32_BBY"
 ]
}