{
 "name": "Bakkar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bakkar's family",
      "Ronto Roasters"
     ]
    }
   ]
  }
 ],
 "content": "Bakkar, nicknamed \"the Butcher,\" was a human male who owned the restaurant Ronto Roasters in Black Spire Outpost on the planet Batuu. A big fan of podracing, Bakkar originally hailed from the planet Tatooine and came from a family that worked as butchers for four generations. Bakkar opened his restaurant with the goal of bringing his famous ronto meat to new customers after moving to Batuu with his droid, 8D-J8.\nBakkar had an unusual way of grilling his meats, utilizing a podracer engine that he purchased and modified. In 34 ABY, 8D-J8's reprogramming that was intended to make the droid man the grill had the side effect of him talking too much; in order to solve the issue, Bakkar contacted the Utai Mubo—8D-J8's original programmer—who eventually agreed to help fix the droid.\nBakkar was a fourth-generation butcher who grew up on the planet Tatooine, where his family's specialty was the ronto creature. He was a big fan of the podracing sport even after it was outlawed across the galaxy. He sold different kinds of specialty meats, but like his family, ronto was what he was largely known for. He left Tatooine when he came of age, dreaming of selling his family's famous meat on another Outer Rim Territories planet. Once he had earned enough credits, he bought a smelter droid, 8D-J8, who was later designated as a pitmaster droid. 8D-J8 never left his side.\nBakkar traveled to the Outer Rim planet Batuu, where he bought a podracing engine from Savi \u0026 Son Salvage at a fair price that he could use to cook his meats. With his ronto recipe ready to go, he opened a restaurant called Ronto Roasters in the Black Spire Outpost settlement in order to bring the ronto to new customers. Bakkar built a large, elaborate mechanical grill, with 8D-J8 serving as the pitmaster of the restaurant, as Bakkar had had the Utai droid scrapper Mubo reprogram him so that his sole duty was to turn the spit, making sure that the meat was cooked evenly and well.\nBakkar employed several others to help run the establishment alongside the droid. The human was a collector of podracing flags, which he displayed in Ronto Roasters despite the sport being banned. He also enjoyed watching reruns of races, showcasing his fandom. Due to his being a butcher, Bakkar was aptly nicknamed \"the Butcher.\"\nBakkar and his pitmaster sold several meats and vegetables at Ronto Roasters, but the establishment's best-selling dish was the Ronto Wrap, which was made with the signature Clutch Sauce. Ronto Roasters also sold drinks, with Bakkar's signature beverage being the Tatooine Sunset. On multiple occasions, the Artiodac chef Strono Tuggs tried to persuade Bakkar to share his family's secret spice rub for Ronto Wraps, but Bakkar always refused. Tuggs respected it being a secret, but he still attempted to make out the recipe for himself.\nIn 34 ABY, Tuggs published a cookbook titled The Official Black Spire Outpost Cookbook. In the book, he discussed Bakkar and his secret recipe while also proclaiming that Bakkar's stand in Black Spire Outpost had the \"most delicious\" meat one could find in the Outer Rim Territories. The historian Eloc Throno also discussed Bakkar's restaurant and signature dishes in his book Traveler's Guide to Batuu, recommending the food there. Bakkar Spire, a location in Black Spire Outpost, shared its name with Bakkar. In the same year, the local mechanic Salju took Resistance spy Vi Moradi on a tour of Black Spire Outpost that included a visit to Ronto Roasters. Salju told Moradi about Bakkar and his nickname of \"the Butcher,\" and she warned the spy not to bring up podracing around him, as he was \"crazy\" for it.\nIn Strono Tuggs's second cookbook, The Life Day Cookbook, the Artiodac included a recipe for an Eopie Roast made of the eopie creature. While Tuggs had initially been wary of using the eopie's tough meat, after sampling a slice of its rump from Bakkar at Ronto Roasters, he was impressed by how tender Bakkar was able to make it as well as how seemingly magical his special seasoning for it was. As with his ronto seasoning, Bakkar was not quick to share the secret even with a friend such as Tuggs. The chef was only able to obtain the recipe by trading him a vibroknife, which he felt was more than a fair deal.\nAlso in 34 ABY, Bakkar messaged Mubo, as he was frustrated with Mubo's reprogramming of 8D-J8. Mubo insisted that his job had been done correctly, as the droid turned the spit, but Bakkar told him that his droid refused to stop talking. Mubo asked if Bakkar had tried deactivating and reactivating him in order to fix the issue.\nMubo then reminded Bakkar that he had already reprogrammed 8D-J8 several times and that Bakkar was simply never pleased with the results. Bakkar insisted that another reprogramming was necessary, or he would need to fasten a restraining bolt onto the droid. Mubo beseeched him not to put a bolt on the pitmaster, but Bakkar pointed out that 8D-J8 needed to stop talking as he had begun thinking himself to be a droid chef despite simply being a pitmaster. Mubo relented, and despite being swamped with orders, he told Bakkar that he would stop by later.\nBakkar had a love for podracing and was willing to talk about it at length, and displayed boyish passion when watching reruns of the sport. He also longed to share his ronto meat with others. He was overwhelmed by his droid's constant talking, and despite the programmer Mubo's resistance to performing yet another reprogramming on 8D-J8, Bakkar's threat of using a restraining bolt on the machine forced the Utai to give in. Bakkar was a human male with light skin, light-colored hair, and dark eyes.\nBakkar was a skilled chef, having been a fourth-generation butcher. His dishes were praised in both Traveler's Guide to Batuu and The Official Black Spire Outpost Cookbook. The latter noted, however, that it was possible that most of the credit could be given to 8D-J8.\nBakkar utilized a podracer engine in place of a traditional cooking grill. He wore blue clothing covered by red-brown robes along with a brown hat.\nBakkar was created as part of the backstory for the real-world Ronto Roasters restaurant at the Star Wars: Galaxy's Edge themed land, which opened in 2019 at Disneyland Park and Disney's Hollywood Studios Park. He then made a full appearance in the Star Wars: Datapad app, which pictured him for the first time.\nAlthough Star Wars: Datapad depicts Bakkar as a man with short, light-colored hair, he is shown with long, brown hair in the 2019 recipe book Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook. As Datapad uses a live-action image as opposed to a drawn illustration, such as the one featured in the cookbook, this article presents Datapad's image as the canonical depiction.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Tatooine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bakkar%27s_family",
  "/wiki/Ronto_Roasters",
  "/wiki/Restaurant",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Podracing",
  "/wiki/Homeworld",
  "/wiki/Ronto",
  "/wiki/8D-series_smelter_droid",
  "/wiki/8D-J8",
  "/wiki/Podracer_engine",
  "/wiki/34_ABY",
  "/wiki/Programmer",
  "/wiki/Smelter_droid",
  "/wiki/Utai",
  "/wiki/Mubo",
  "/wiki/Droid",
  "/wiki/The_galaxy",
  "/wiki/Dream",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Credit",
  "/wiki/Pitmaster_droid",
  "/wiki/Savi_%26_Son_Salvage",
  "/wiki/City",
  "/wiki/Collector",
  "/wiki/Vegetable",
  "/wiki/Ronto_Wrap",
  "/wiki/Clutch_Sauce",
  "/wiki/Tatooine_Sunset",
  "/wiki/Artiodac",
  "/wiki/Chef",
  "/wiki/Strono_Tuggs",
  "/wiki/Book",
  "/wiki/The_Official_Black_Spire_Outpost_Cookbook",
  "/wiki/Historian",
  "/wiki/Eloc_Throno",
  "/wiki/Traveler%27s_Guide_to_Batuu",
  "/wiki/Foodstuff",
  "/wiki/Bakkar_Spire",
  "/wiki/Standard_year",
  "/wiki/Technician",
  "/wiki/Salju",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Vi_Moradi",
  "/wiki/The_Life_Day_Cookbook",
  "/wiki/Eopie_Roast",
  "/wiki/Eopie",
  "/wiki/Vibro-knife",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Restraining_bolt",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Podracer",
  "/wiki/Clothing",
  "/wiki/Robe",
  "/wiki/Hat",
  "/wiki/In-universe",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/2019",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
  "/wiki/Category:Images_of_Bakkar",
  "/wiki/Galaxy%27s_Edge:_Black_Spire",
  "/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
  "/wiki/File:DroidProblems1_GEDatapad.png",
  "/wiki/File:DroidProblems2-GEDatapad.png",
  "/wiki/File:DroidProblems3-GEDatapad.png",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Star_Wars:_The_Life_Day_Cookbook",
  "/wiki/Time",
  "/wiki/First_Order",
  "/wiki/Template:Galaxy%27s_Edge_Date",
  "/wiki/Star_Wars:_Galaxy%27s_Edge_trading_cards"
 ]
}