{
 "name": "Balancesheet",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ghostling Nest of the Assembler"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Assembler"
     ]
    }
   ]
  }
 ],
 "content": "Balancesheet was a member of the Assembler species, large arachnids that grew many semi-autonomous nodes. Balancesheet was originally a node of the infamous information broker, a much smaller version of his creator, Kud'ar Mub'at. It had been given the specific task of maintaining and organizing Mub'at's financial records, hence its name. Over time, it developed an advanced sense of independence for a node; Mub'at feared such an occurrence, and re-ingested any other such nodes it discovered. However, due to Balancesheet's important role, Mub'at was reluctant to absorb the node.\nDuring the Bounty Hunter Wars, Balancesheet, unknown to its creator, revealed that it too possessed the ability to create its own nodes. Balancesheet made a node which was used to trick its master into thinking it was still attached to the neural cord Mub'at kept it on, allowing Balancesheet to detach itself from the web. After escaping Mub'at's possession, it had business conversation with Prince Xizor, which resulted in its master's downfall and death.\nBalancesheet also obtained a used freighter from Black Sun, after convincing Xizor that Boba Fett should not be killed. It also obtained half of the bounty on the renegade stormtrooper Trhin Voss'on't by tricking Fett, an action which Fett never forgot. With the reward from this bounty, Balancesheet was able to fund its newly independent lifestyle.\nWhile it carried on its master's role as an infochant, Balancesheet was once outbid by 8t88 on a contract from Jerec to track down the location of the legendary Valley of the Jedi.\nBalancesheet later struck a deal with Fett for information on the cyborg bounty hunter D'harhan, in exchange for giving him a bounty.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/BalanceSheet",
  "/wiki/Ghostling_Nest_of_the_Assembler",
  "/wiki/Assembler",
  "/wiki/Species/Legends",
  "/wiki/Kud%27ar_Mub%27at",
  "/wiki/Bounty_Hunter_Wars",
  "/wiki/Prince/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Death/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Trhin_Voss%27on%27t",
  "/wiki/Information_broker/Legends",
  "/wiki/8t88/Legends",
  "/wiki/Jerec_(Inquisitor)",
  "/wiki/Valley_of_the_Jedi",
  "/wiki/D%27harhan",
  "/wiki/The_Mandalorian_Armor",
  "/wiki/Slave_Ship",
  "/wiki/Hard_Merchandise",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_25",
  "/wiki/Wizards.com",
  "/wiki/Kyle_Katarn%27s_Tale",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Databank_(original)"
 ]
}