{
 "name": "Balanhai Savit",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Third Fleet",
      "Imperial Navy's officer corps",
      "Third Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Balanhai Savit was a male human who served the Galactic Empire as one of the twelve Grand Admirals in the Imperial Navy. A member of a highly prominent musical family on Coruscant with wide-reaching political influence, Savit's prestigious background and artistic talents enabled his advancement. By 0 BBY, he was the commanding officer of the navy's Third Fleet, which he led from his flagship, the Star Destroyer Firedrake.\nSavit was secretly opposed to Project Stardust and the Death Star battlestation, and undertook several efforts to undermine its construction. After Savit was exposed by Grand Admiral Thrawn, a skirmish ensued between Thrawn's flagship Chimaera and several vessels of the Third Fleet. Ultimately, Savit was defeated and arrested.\nBalanhai Savit was a male human whose family was prominent on Coruscant due to their music programs. As such, they had a strong cultural position that forced others to be politically aware of him. Savit himself was a gifted composer, conductor, and performer; during the Republic Era, he performed his composition To the Stars at one of his mother's cultural galas—a work which he later transformed into a full opera. His performances attracted the attention of prominent figures such as Governor Grazlos and Supreme Chancellor Sheev Palpatine, leading certain figures to credit his naval commission to his contacts and favors among the Coruscanti elite. Nevertheless, he was frustrated by the politics which he considered endemic to the inner workings of the Galactic Republic.\nAfter the Republic's transition into the Galactic Empire, Savit served in the Imperial Navy and eventually attained the highly decorated rank of Grand Admiral, gaining command of the Third Fleet. His flag was aboard the Star Destroyer Firedrake, under the immediate command of his subordinate, Captain Boulag.\nSavit eventually came to know of an Imperial construction project known as Stardust, the codename for the construction of a massive superweapon with the capability to destroy entire planets; he even learned the top-secret name of the battlestation: the Death Star. Savit felt that the construction of the Death Star was an extraordinary waste of resources that could be otherwise used to strengthen the Imperial Navy, and further predicted that the station was vulnerable to attack and destruction. Among those few Imperials aware of the project, he was not alone in these concerns; both Generals Jylia Shale and Cassio Tagge were outspoken opponents of \"Tarkin's folly,\" though Shale's career was marginalized as a result. Savit did not openly voice his concerns with the project, but his resentment for the project grew and eventually manifested itself in a desire to save the resources of the Empire from being squandered.\nSavit devised a scheme to work with pirates in the Esaga sector, whereby he would hire Imperial contractors to steal turbolaser components and other supplies for the Stardust project. Using the cover of gralloc attacks on their freighters, Savit's pirates would feign hyperdrive malfunctions and disappear from their transfer point in the Kurost sector. With the Empire assuming the disappearances were unfortunate accidents, the freighters would rendezvous in relatively close star systems and offload their stolen cargo. In the process, Savit's Third Fleet would undertake anti-piracy operations in the Esaga, both as a cover for Savit's actual dealings with the pirates and as a means to clear out competition against his criminal allies. In an effort to further mask his dealings, Savit communicated with the pirates via the G77 encryption, a code accessible only to the Empire's twelve Grand Admirals. By 0 BBY, Savit's thefts had proved a significant delay to Stardust's imminent completion.\nThe delays to Stardust prompted Grand Moff Wilhuff Tarkin to request a conference with Emperor Palpatine and several high-ranking officials on Coruscant to discuss the matter. To Savit's dismay, however, the Emperor would abruptly change the meeting point to the Firedrake. The location of Savit's flagship in the Sev Tok system was considered closer for the participants—especially Grand Admiral Thrawn, who was preoccupied dealing with the Lothal campaign in the Outer Rim Territories—though both Savit and Thrawn suspected the move was political in nature.\nThough Savit was familiar Thrawn's exploits, this was his first meeting with the Chiss. In addition to Savit, Thrawn, and Tarkin, the meeting was attended by Orson Callan Krennic, the director of the Death Star project, to discuss Krennic's Project Stardust, as well as the Emperor via hologram projection. The meetings addressed the concerns with Stardust—the very same supply-chain problems that Savit had secretly created. Though Thrawn pointed out that Savit was more capable in dealing with the issue given his familiarity with Governor Haveland's gralloc troubles, Tarkin expressed that Savit had duties elsewhere and recommended Thrawn handle the logistical issues. A wager was proposed where Thrawn was tasked with handling the gralloc issue; if he did so in a standard week, his TIE Defender program would gain funding previously earmarked for Stardust.\nAfter the meeting, Savit escorted the Thrawn back to his shuttle. He reflected on the alien Grand Admiral's physical impressiveness but also his political incompetence, evidenced by his cluelessness regarding the infighting between Krennic and Tarkin. Though Savit appeared to help Thrawn's mission by providing him information on the grallocs, he actually hoped that the Chiss's investigation would \"take the heat\" off his own operations while being unable to solve the problem.\nSavit's treason was exposed during the skirmish against the Third Fleet, during which Thrawn offered a chance at a possible redemption by helping them against another threat, but Savit refused. ISB Major Dayja Collerand boarded the bridge and arrested Savit.\nAs a son of one of Coruscant's most prominent musical families, Savit was aware of his family's status and reflected it in conversations; he considered veiled political threats against them unacceptable. As a musician, he was a skilled composer, conductor, and player, immersing himself into his craft in a way that mirrored his command style in the Imperial Navy.\nDespite Savit's professed disdain for the political infighting in the Empire , he also considered himself adept at playing others' politics against each other, such as with Krennic and Tarkin. He was proud of his status as a Grand Admiral and considered himself superior to civilian officials such as Governor Haveland; he generally accorded other high-ranking military officers similar professional respect, though his respect for Thrawn was colored by humanocentrism. Savit was regarded as efficient and highly capable as an officer, though Tarkin believed that Savit lacked Thrawn's tactical and problem-solving proficiency.\nSavit's personal criticism of the Death Star's construction was rooted in his belief in supremacy of the Imperial Navy, favoring the expansion and strengthening of the fleet through programs such as Thrawn's TIE Defender. This antipathy drove him to treason against his Empire, working against the battlestation's construction, and his eventual downfall. Nevertheless, he held that someone would eventually find out how to destroy it.\nBalanhai Savit appeared in the 2019 novel Thrawn: Treason, written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Third_Fleet",
  "/wiki/Grand_Admiral",
  "/wiki/Imperial_Navy",
  "/wiki/Music",
  "/wiki/Coruscant",
  "/wiki/Politics",
  "/wiki/0_BBY",
  "/wiki/Commanding_officer",
  "/wiki/Navy",
  "/wiki/Flagship",
  "/wiki/Star_Destroyer",
  "/wiki/Firedrake",
  "/wiki/Project_Stardust",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battlestation",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Skirmish_against_the_Third_Fleet",
  "/wiki/Chimaera",
  "/wiki/Fleet",
  "/wiki/Republic_Era",
  "/wiki/To_the_Stars",
  "/wiki/Balanhai_Savit%27s_mother",
  "/wiki/Opera",
  "/wiki/Governor",
  "/wiki/Grazlos",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Officer",
  "/wiki/Coruscanti",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Commander",
  "/wiki/Captain",
  "/wiki/Boulag",
  "/wiki/Superweapon",
  "/wiki/General",
  "/wiki/Jylia_Shale",
  "/wiki/Cassio_Tagge",
  "/wiki/Skulk",
  "/wiki/Brierly_Ronan",
  "/wiki/Eli_N._Vanto",
  "/wiki/Pik",
  "/wiki/Waffle",
  "/wiki/Pirate",
  "/wiki/Esaga_sector",
  "/wiki/Turbolaser",
  "/wiki/Gralloc",
  "/wiki/Freighter",
  "/wiki/Hyperdrive",
  "/wiki/Kurost_transfer_point",
  "/wiki/Kurost_sector",
  "/wiki/Star_system",
  "/wiki/Anti-piracy_campaign_in_the_Esaga_sector",
  "/wiki/Encryption_G77",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Galactic_Emperor",
  "/wiki/Sev_Tok_system",
  "/wiki/Admiral",
  "/wiki/Lothal_campaign",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Chiss",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Director",
  "/wiki/Hologram",
  "/wiki/Standard_week",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Alien",
  "/wiki/Skirmish_with_Grysk_warships",
  "/wiki/Grysk",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Major",
  "/wiki/Dayja_Collerand",
  "/wiki/Imperial_officer",
  "/wiki/Xenophobia#Humanocentrism",
  "/wiki/2019",
  "/wiki/Thrawn:_Treason",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn:_Treason_(audiobook)",
  "/wiki/Aftermath_(novel)",
  "/wiki/Darth_Vader_(2015)_1"
 ]
}