{
 "name": "Bala-Tik",
 "display_name": "Bala-Tik",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic left leg"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Guavian Death Gang"
     ]
    }
   ]
  }
 ],
 "content": "Bala-Tik was a human male who worked as a negotiator for the Guavian Death Gang. He handled a deal with the famed smuggler Han Solo by paying for Solo to haul rathtars, a deal that Solo also made with Kanjiklub.\nThe human male Bala-Tik served the criminal Guavian Death Gang as a leader and frontman during the reign of the New Republic. During his time with the gang, he encountered the smuggler Han Solo and managed to shake several profitable leads out of him, although Solo let the Guavians down at least once. The smuggler eventually took out a loan of fifty thousand credits from the gang in order to hunt rathtars for King Prana; however, he failed to pay it back within a timely manner and the leaders of the gang soon became tired of his delays and excuses. Less than a year before the First Order's attack on the village of Tuanul in 34 ABY, Bala-Tik was on the planet Kaddak on the forty-fifth level of the city known as the Sliver with three Guavian security soldiers.\nSometime after Supreme Leader Snoke's assumption of leadership within the First Order, he obtained the Smuggler's Guide previously owned by Gamma-bit 669753 from spoils of battle between Guavian Death Gang and Droid Gotra. In the book he wrote about the capabilities of the Guavian security soldiers and his own process of mechamorphosis that started with cybernetic leg. Then he wrote how their security soldiers intercepted binary transmission from the Droid Gotra, that ordered members of Gotra and Cyban Front to strike high-value data caches on Terminus, Little Petrovi, and Corbett Cluster. Guavians then broadcast their own counteracting broadcast, that ordered to position soldiers to intercept them. Later in the book he described their plan to launch a strike on Nantoon to rule over the galaxy's underworld. However, the gang lost the Smuggler's Guide to the lieutenant Razoo Qin-Fee of the Kanjiklub during the skirmish in the Cronese Mandate.\nWhile in the Sliver, the Guavians were approached by four members of Kanjiklub, a criminal group with whom the gang were often in conflict. Kanjiklub's topboss, Tasu Leech, had overheard the protocol droid C-3PO mention that Solo had borrowed money from the Guavian Death Gang, and revealed to Bala-Tik that the smuggler had also borrowed fifty thousand credits from Kanjiklub to hunt rathar. The two groups of criminals found common ground in their hatred of Solo and agreed to confront him together over his debts, with Leech and Bala-Tik shaking hands on the agreement.\nIn 34 ABY, Bala-Tik and a group of security soldiers caught up with Solo while he was hunting on the planet Nantoon and then followed him in a nonmilitary transport when he left the world in his Baleen-class heavy freighter Eravana. Solo, who was unaware of the criminals pursuing him, traveled to the Western Reaches in order to locate his old YT-1300 light freighter the Millennium Falcon. The Eravana stopped in the Jakku system, where a tracker onboard the Falcon had signaled from, and managed to pick up the freighter. Shortly after the Falcon was pulled onboard the Eravana, Bala-Tik and the Guavians revealed themselves by docking with Solo's freighter.\nBala-Tik and a five-man team of security soldiers disembarked their ship and began marching through the ship until they found Solo and his co-pilot Chewbacca in one of the Eravana's corridors. The frontman demanded Solo repay them their money, also revealing that he knew about the loan from Kanjklub. The smuggler claimed Kanjiklub were lying, to which Bala-Tik responded that Solo could tell that to the group himself. Five members of Kanjiklub then revealed themselves in the corridor behind Solo, led by Leech. The smuggler promised both groups that he would deliver what he owed them, but Bala-Tik and Leech were unimpressed due to his previous work for them.\nBala-Tik then noticed the BB-series astromech droid BB-8, who was hiding between Solo and Chewbacca. Remembering that the group known as the First Order was searching for a similar BB unit and two fugitives, Bala-Tik pointed out BB-8, causing Kanjiklub to start searching the ship for the fugitives. Before Bala-Tik could make a move for the droid, the three rathtars that Solo had caught on Nantoon were set free by Rey and Finn, the two fugitives that Bala-Tik had mentioned who had been on the Falcon when Solo found it. Hearing the rathtars roar, Bala-Tik ordered his men to kill Solo and Chewbacca and grab BB-8; however, one of the rathtars attacked his team from behind before they could open fire and grabbed two of the soldiers.\nBala-Tik and his remaining men fled forward toward Solo and then down a corridor to their left while the rathtar killed the pair it had grabbed. Kanjiklub were also attacked by a rathtar and forced to flee, allowing Solo and his companions to escape. Bala-Tik managed to regroup with one member of his gang in one of the ship's corridors to take account of their losses, although as he spoke the frontman witnessed a third member of his gang being killed by a rathtar and was forced to flee while firing ineffectually at the beast. Solo managed to reach the Falcon with Chewbacca, BB-8, Finn, and Rey and then escape onboard it, killing one of the rathtars in the process. Bala-Tik witnessed the Falcon depart through one of the Eravana's hangar doors and then gave orders via comlink that his men should contact the First Order and warn them that Solo had the droid.\nBala-Tik stood 1.8 meters tall and had fair skin, brown eyes and brown hair. He spoke with a harsher form of the clipped accent commonly found in the galactic Core Worlds. He had a cybernetic left leg, which he concealed. Bala-Tik frequently used Solo and Chewbacca as sources of information, a relationship that he valued for the Death Gang despite growing increasingly impatient with the Corellian smuggler's schemes. He knew enough about Solo to bring several guards with him aboard the Eravana, believing Solo to be foolish enough to start a blaster fight near a ship's airlock.\nBala-Tik was a confident and experienced individual, not one to waste time on false pleasantries. When he met Solo on the Falcon, he was bursting with barely controlled anger and spoke in clipped tones.\nLike all Guavians, Bala-Tik carried the latest in black market weapons technology. This included a percussive cannon manufactured by Tostovin Munitions, which fired particularly explosive blaster bolts. He wore a black gorraslug-leather long coat with armored lining, a pair of black sparadillo armored boots and a pair of ribbed black pants that concealed his cybernetic right leg.\nBala-Tik was portrayed by Scottish actor Brian Vernel in the 2015 film Star Wars: Episode VII The Force Awakens. The novelization of the film written by Alan Dean Foster contains notable differences to the film in terms of Bala-Tik's dialogue, with most of his lines being extended. During his initial interaction with Solo, the smuggler suggests that the Guavians accompany him in bringing the rathtars to Prana so that they can claim the reward together, but Bala-Tik rejects the idea as he believes Solo will try and escape. As these scenes contradict the amount of dialogue shown in the film, this article assumes them to be non-canon.\nBala-Tik also appeared in two episodes of the non-canon series of video shorts LEGO Star Wars: The Resistance Rises voiced by James Arnold Taylor. In the episode \"Hunting for Han,\" Bala-Tik brings a pair of musical instruments to the castle of Maz Kanata, which Kanata had hired him to locate. The frontman then demands that in exchange for the instruments, Kanata must tell him where Han Solo is so that he can track him down to reclaim his debt. As the pair discuss Solo's debt, Tasu Leech and several Kanjiklub members enter the castle also demanding to know where Solo is. Leech, Bala-Tik, and several other patrons of the castle argue over who has the greatest claim to vengeance on Solo, which quickly turns into a full-on brawl.\nKanata ends the fighting by using a lightsaber to partially collapse part of the castle's roof on the fighters. To prevent further fighting, Solo's old friend Lando Calrissian directed the fighters to Jakku to search for Solo. Bala-Tik quickly leaves with the other patrons, forgetting to collect the instruments he had brought Kanata.\nIn the following episode, \"Rey Strikes Back,\" Bala-Tik and his comrades arrive on Jakku on board a Resistance transport and immediately spot the Millennium Falcon. The group races toward it, but is run down by Rey's speeder before they can reach it.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Adventures:_Flight_of_the_Falcon",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Helmets",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Cyborg",
  "/wiki/Limb",
  "/wiki/Guavian_Death_Gang",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Rathtar",
  "/wiki/Kanjiklub",
  "/wiki/New_Republic",
  "/wiki/Credit",
  "/wiki/King",
  "/wiki/Grevoth_Prana_IX",
  "/wiki/Standard_year",
  "/wiki/First_Order",
  "/wiki/Attack_on_Tuanul",
  "/wiki/Tuanul",
  "/wiki/34_ABY",
  "/wiki/Planet",
  "/wiki/Kaddak",
  "/wiki/Level_45",
  "/wiki/City",
  "/wiki/The_Sliver",
  "/wiki/Guavian_security_soldier",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Gamma-bit_669753",
  "/wiki/Droid_Gotra",
  "/wiki/Book",
  "/wiki/Mechamorphosis",
  "/wiki/Binary",
  "/wiki/Cyban_Front",
  "/wiki/Terminus",
  "/wiki/Little_Petrovi",
  "/wiki/Corbett_Cluster",
  "/wiki/Strike_on_Nantoon",
  "/wiki/Galaxy",
  "/wiki/Lieutenant",
  "/wiki/Razoo_Qin-Fee",
  "/wiki/Skirmish_in_the_Cronese_Mandate",
  "/wiki/Cronese_Mandate",
  "/wiki/Topboss",
  "/wiki/Tasu_Leech",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Nantoon",
  "/wiki/Transport",
  "/wiki/Baleen-class_heavy_freighter",
  "/wiki/Eravana",
  "/wiki/Western_Reaches",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Jakku_system",
  "/wiki/Freighter",
  "/wiki/Starship",
  "/wiki/Pilot",
  "/wiki/Chewbacca",
  "/wiki/BB-series_astromech_droid",
  "/wiki/Astromech_droid",
  "/wiki/BB-8",
  "/wiki/Droid",
  "/wiki/Rey_Skywalker",
  "/wiki/Finn",
  "/wiki/Comlink",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Core_Worlds",
  "/wiki/Blaster",
  "/wiki/Airlock",
  "/wiki/Black_market",
  "/wiki/Percussive_cannon",
  "/wiki/Tostovin_Munitions",
  "/wiki/Gorraslug",
  "/wiki/Gorraslug-leather",
  "/wiki/Clothing",
  "/wiki/Armor",
  "/wiki/Sparadillo",
  "/wiki/Boot",
  "/wiki/Cybernetics",
  "/wiki/Brian_Vernel",
  "/wiki/2015",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Alan_Dean_Foster",
  "/wiki/LEGO_Star_Wars:_The_Resistance_Rises",
  "/wiki/James_Arnold_Taylor",
  "/wiki/Hunting_for_Han",
  "/wiki/Takodana_Castle",
  "/wiki/Maz_Kanata",
  "/wiki/Lightsaber",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Rey_Strikes_Back",
  "/wiki/Resistance_transport",
  "/wiki/Rey%27s_speeder",
  "/wiki/Poe_Dameron_9",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens:_Rey%27s_Story",
  "/wiki/The_Force_Awakens:_Rey%27s_Story_(audiobook)",
  "/wiki/The_Force_Awakens:_Finn%27s_Story",
  "/wiki/The_Force_Awakens_(Golden_Book)",
  "/wiki/Han_%26_Chewie_Return!",
  "/wiki/The_Force_Awakens_Adaptation_2",
  "/wiki/The_Force_Awakens_Adaptation_3",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/Minecraft_Star_Wars",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Episode_VII:_The_Force_Awakens",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Awakenings",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Before_the_Awakening",
  "/wiki/Poe_Dameron",
  "/wiki/Resistance"
 ]
}