{
 "name": "Baldarek",
 "display_name": "Baldarek",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Reelo BarukBaruk's Bar",
      "Baruk's Bar"
     ]
    }
   ]
  }
 ],
 "content": "\"Red Eye\" Baldarek was a Chiss bartender who worked in Baruk's Bar on Nar Shaddaa during the Empire Reborn conflict.\nPrior to the Clone Wars, Baldarek worked as a bartender in the galaxy. As the Chiss were an unusual sight in the wider galaxy, he picked up the nickname \"Red-Eye\", after his distinctive glowing eyes. During this period, Baldarek visited the pleasure world of Zeltros, in the Inner Rim. He partied there for a week, becoming mesmerized by the scent of Zeltron pheromones. Some of his recollections of his time there made it into the tourist guide, \"Luxury on the Inner Rim\".\nMuch later, Baldarek was employed by Reelo Baruk, a Rodian crime lord on Nar Shaddaa. He worked in Baruk's Bar, a cantina frequented by Baruk's thugs. In 12 ABY, Kyle Katarn visited the bar while trying to track down Baruk. Recommending a ruby bliel to Katarn, the Jedi instead asked for a Corellian ale. The grimy nature of the bar also prompted Katarn to specify a clean glass.\nWhen Katarn sought information on Baruk's whereabouts from Baldarek, the bartender lured him into a trap by keeping his attention away from a group of thugs who were about to attack Katarn. The bartender succeeded in this role and activated a metal shield to seal the area behind the bar for protection. The attackers, however, were less successful and all died at the blade of Katarn's lightsaber. Katarn then unsealed the bar and threatened the bartender, who revealed Baruk's location. Katarn eventually tracked down Baruk and killed him.\nIt is suspected that with the death of his employer, Baldarek left Nar Shaddaa and sought employment elsewhere. By 14 ABY, he'd found employment for a Hutt crime lord on the planet Nar Kreeta. The Hutt had kidnapped a group of local Mining Guild elders, and was amusing himself by pitting them against his pet rancor. This drew the attention of the New Jedi Order, who dispatched Kyle Katarn and Jaden Korr to deal with the situation. While infiltrating the base, Korr encountered Baldarek in the Hutt's cantina.\nWhile working for the underworld, Baldarek often encountered danger, and showed little courage or aptitude for dealing with it. He left fighting to other thugs, and often hid to avoid trouble himself. When directly confronted he cowered in front of Jedi Knights, and quickly broke under pressure.\nBaldarek had trouble speaking Basic, and often erred in his grammar, which may be explained by the nature of the little known Cheunh language: he could not distinguish between the singular and plural forms of words, and as such, often added the plural -s to all his nouns.\nBaldarek first appeared in the Mission to Nar Shaddaa in the game Star Wars: Jedi Knight II: Jedi Outcast; Baldarek can optionally be killed by the player  during the fray which has no effect to the remainder of the game. Later a Chiss bartender, who looks identical to Baldarek, appears on the Mission on Nar Kreeta in the PC, Playstation 4 and Nintendo Switch version of Star Wars: Jedi Knight: Jedi Academy as a background figure. This article assumes the two bartenders are the same individual, and that Katarn does not kill Baldarek in Jedi Outcast. This is based, in part, on email confirmation from Cory J. Herndon who wrote Zeltros: Pleasure Planet which identified Baldarek by name for the first time. The name \"Baldarek\" is based on Baldrick, a character from the British TV series Blackadder.\nThe voice actor for Baldarek in Jedi Outcast was Nick Jameson. The role was credited as simply \"Bartender\". His in-game model can be used as a character skin for both Jedi Knight II: Jedi Outcast and Jedi Academy multiplayer.\nBaldarek was actually added as an in-game NPC character for the mission on Nar Kreeta on the PC, Playstation 4 and Nintendo Switch version because he doesn't give a voice and he also doesn't moan or scream if the player decides to kill him. Baldarek also doesn't appear on the Xbox version of Nar Kreeta.\nThere is a hidden NPC in Jedi Academy entitled 'RebornChiss', which is basically Baldarek with two red lightsabers and dark force powers. He will attack the player, but is reasonably easy to defeat; it is unknown if this model was going to have any further use in the game, as the name applies he could have started working with the Cult but this seems to have been cut. It is also notable that there is a 'RebornRodian', 'RebornTrandoshan' and 'RebornWeequay', possibly implying that mercenaries would also become working for the cult, possibly under the leadership of Baldarek.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Redeye_(disambiguation)",
  "/wiki/Chiss/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Reelo_Baruk",
  "/wiki/Baruk%27s_Bar",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Empire_Reborn",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Zeltros/Legends",
  "/wiki/Inner_Rim",
  "/wiki/Zeltron/Legends",
  "/wiki/Luxury_on_the_Inner_Rim",
  "/wiki/Kyle_Katarn",
  "/wiki/Rodian/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/12_ABY/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Empire_Reborn)",
  "/wiki/Ruby_bliel",
  "/wiki/Corellian_ale/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Nar_Kreeta",
  "/wiki/14_ABY/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Unidentified_Hutt_crime_lord_(Nar_Kreeta)",
  "/wiki/Mining_Guild_elders",
  "/wiki/Rancor/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Mission_to_Nar_Kreeta",
  "/wiki/Jaden_Korr",
  "/wiki/File:Kyles_bartender_advice.ogg",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Cheunh/Legends",
  "/wiki/Star_Wars:_Jedi_Knight_II:_Jedi_Outcast",
  "/wiki/Star_Wars:_Jedi_Knight:_Jedi_Academy",
  "/wiki/Cory_J._Herndon",
  "/wiki/Zeltros:_Pleasure_Planet",
  "/wiki/Nick_Jameson",
  "/wiki/Star_Wars:_Tiny_Death_Star",
  "/wiki/Canon",
  "/wiki/Wizards.com",
  "/wiki/Red-Eye_Baldarek/Email"
 ]
}