{
 "name": "Baleeq_Soobo",
 "display_name": "Baleeq Soobo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ortolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Baleeq Soobo was a male Ortolan colonist who served as Chief Engineer of the Tromper Crags Geothermal Plant on the planet Hoth during the Galactic War between the Galactic Republic and the Sith Empire. The geothermal power station was his life's work, and Soobo was very proud of the facility, which was to become the heart of his peoples' future colony.\nA Republic aligned individual was sent to destroy the plant to prevent it from falling into Imperial hands, as it had been captured by the White Maw pirates, no one knew the status of the colonists, and the Republic did not have the manpower to keep the plant from other hostiles. The individual drove off the pirates, but when Soobo realized the purpose of their mission and was informed of Imperial forces about to attack, he begged the individual not to destroy the plant but to help defend it.\nThe individual agreed and fought along side Soobo and his comrades against the Imperial mercenaries sent to capture the plant. He used a vibrosword in combat. After the mercenaries were defeated, Soobo pledged to fight for what was theirs, and immediately start building a defense system to protect the plant from future Imperial attacks. He also requested the individual to update the Republic of their plans. He later sent some credits as thanks, reporting that work on the defense system was progressing very well.\nBaleeq Soobo goes unnamed during his actual appearance, his name is only revealed in the follow-up letter he sends after the mission is finished.\nIf you destroy the plant anyway, the horrified Soobo has his people evacuate, but chooses to stay himself and await death with the plant's destruction, as he has no where else to go.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ortolan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Colonist/Legends",
  "/wiki/Chief_Engineer",
  "/wiki/Tromper_Crags_Geothermal_Plant",
  "/wiki/Planet/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/White_Maw",
  "/wiki/Pirate/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Mercenary/Legends",
  "/wiki/Vibrosword/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}