{
 "name": "Balfus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Balfus was a Wookiee male who lived on the planet Kashyyyk sometime between 44 BBY and 32 BBY. During the preparations for Life Day, an important Wookiee festivity, he was taken by Trandoshan hunters and held in captivity along with other Wookiees and Jedi Master Qui-Gon Jinn. The Wookiees and Jinn were eventually saved by Jinn's Padawan, Obi-Wan Kenobi, with help from other Wookiees, resulting in the Trandoshan hunters surrendering and returning the prisoners.\nBalfus was a Wookiee male who lived on Kashyyyk, a planet in the Mid Rim's Mytaranor sector, sometime between 44 BBY and 32 BBY. In the lead-up to Life Day, an important Wookiee festivity, Trandoshan hunters took advantage of the Wookiees' weakness during the holiday to capture Balfus. Jedi Master Qui-Gon Jinn—who was on Kashyyyk with his Padawan, Obi-Wan Kenobi, to study the Wookiees—asked Brennonn, a Wookiee who lived in the same village as Balfus, of the latter's whereabouts; Brennonn replied that he was missing. The Trandoshans later attacked the Wookiee village, capturing other Wookiees and Jinn himself.\nThe Wookiees were eventually freed by Kenobi, who first freed Jinn by opening his cage with the Force and throwing his Master's lightsaber to him. As Jinn was freed, other Wookiee warriors arrived to support the two Jedi. The hunters then surrendered and released the captive Wookiees.\nBalfus was mentioned in the comic story \"Life Day,\" published in the third issue of the Star Wars Adventures comic book on February 3, 2021. The comic story was written by Michael Moreci and illustrated by Megan Levens and Charlie Kirchoff and was the first of a two-part story that continued with \"Life Day Part 2\" in the fourth issue on March 24, 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookiee",
  "/wiki/Gender",
  "/wiki/Planet",
  "/wiki/Kashyyyk",
  "/wiki/44_BBY",
  "/wiki/32_BBY",
  "/wiki/Life_Day",
  "/wiki/Trandoshan",
  "/wiki/Hunting",
  "/wiki/Prisoner",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Mytaranor_sector",
  "/wiki/Brennonn",
  "/wiki/Rescue_of_Qui-Gon_Jinn",
  "/wiki/Telekinesis",
  "/wiki/The_Force",
  "/wiki/Qui-Gon_Jinn%27s_lightsaber",
  "/wiki/Life_Day_(comic)",
  "/wiki/Star_Wars_Adventures_(2020)_3",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/February_3",
  "/wiki/2021",
  "/wiki/Michael_Moreci",
  "/wiki/Megan_Levens",
  "/wiki/Charlie_Kirchoff",
  "/wiki/Life_Day_Part_2",
  "/wiki/Star_Wars_Adventures_(2020)_4",
  "/wiki/March_24",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Teacher",
  "/wiki/Standard_year",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Reproduction",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Death",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}