{
 "name": "Ballin_Dreshig",
 "display_name": "Ballin Dreshig",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "16 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Sandy white"
     ]
    }
   ]
  }
 ],
 "content": "Ballin Dreshig was a Human male slicer operating in the galaxy by 10 ABY.\nDreshig was a slicer operating in the early years of the New Republic. He often preferred to work with individuals of a similar temperament and background. The slicer would leave and electronic signature card after every job which contained a piece of wry humor, often directed at the victim of his work.\nDreshig's TracSheet was number 33689553-SWYU-266396 and his crimes included the unlawful accessing of classified government information, illegal replication and dissemination of classified information, and corporate espionage.\nDreshig was often sullen, and was also extremely egotistical. He believed that he was \"owed\" by the galaxy at larger and refused to bend to the limitations of social environments. Dreshig's beliefs led him to the conclusion that no information should be hidden from him. He maintained that he was one of the best slicers in the galaxy, but in reality he had an exaggerated sense of his skills. As such, Dreshig saw any systems that was considered to be \"unbreakable\" to be a personal affront to his genius. His personal pride would often result in a conflict if his works and achievements were upstaged.\nDreshig was tall and generally unkempt, with a pallid complexion and his eyes showed that he went without sunlight for long periods of time. He also had a number of radiation scars on his hands.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/16_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/TracSheet",
  "/wiki/Radiation/Legends",
  "/wiki/Galaxy_Guide_11:_Criminal_Organizations",
  "/wiki/Platt%27s_Starport_Guide",
  "/wiki/Platt%27s_Smugglers_Guide"
 ]
}