{
 "name": "Baltan Carid",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Carid"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians"
     ]
    }
   ]
  }
 ],
 "content": "Baltan Carid, in Mando'a Car'ika was a male Human Mandalorian warrior during the Second Galactic Civil War. He had a dark blue tattoo of a vine starting somewhere below his armor line and ending right under his chin. His hair was white by then, with no hint to what its former color might have been. He was a brusquely cheerful man, and very loud. He usually fought without his helmet, and often forgot that he didn't need to shout to be heard over the helmet comlink on the rare occasions when he did wear one. He often made jokes and seemed in almost constant good humor. He wore bright violet Mando armor\nBoba Fett had last seen Carid slaying Yuuzhan Vong with an 'Imperial-era blaster' at the fight on Caluula Station before a meeting he held on Mandalore about the state of the Mandalorian people.\nCarid would later participate in the Second Battle of Fondor, helping Fett take down Imperial Moffs aboard the Turbulent-class Star Destroyer Bloodfin. Carid along with Fett and Novoc Vevut took down all the stormtroopers guarding the Moffs before killing the Moffs themselves. Carid and Vevut chased Sith apprentice Tahiri Veila into an airlock docking tube, and Carid shot Darth Caedus' knee instead of killing him outright, as Fett wanted to leave Caedus for his sister, Jaina Solo, to fight another time.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Clan_Carid",
  "/wiki/Mandalorian/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Mando%27a/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Tattoo/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Caluula_Station",
  "/wiki/Mandalore/Legends",
  "/wiki/Second_Battle_of_Fondor",
  "/wiki/Moff/Legends",
  "/wiki/Turbulent-class_Star_Destroyer",
  "/wiki/Bloodfin_(Star_Destroyer)",
  "/wiki/Novoc_Vevut",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Tahiri_Veila",
  "/wiki/Darth_Caedus",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}