{
 "name": "Bandwin_Cor",
 "display_name": "Bandwin Cor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "near the Mako-Ta Space Docks"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Rebel Alliance Starfighter Command",
      "Massassi Group",
      "Rebel Alliance Starfighter Command",
      "Massassi Group"
     ]
    }
   ]
  }
 ],
 "content": "Bandwin Cor was a human male who served as a colonel and later general in the Alliance to Restore the Republic during the Galactic Civil War. He worked with the rebel pilots and gave them demerits for their misconducts. During the Galactic Civil War, he notably trained many pilots for the Alliance and he sacrificed himself during the Assault on the Mako-Ta Space Docks as an attempt to free the pilots from their entrapment inside Mon Calamari Star Cruisers.\nBandwin Cor served as a Colonel in the Alliance to Restore the Republic during the Galactic Civil War. Shortly prior to Operation Buckler, Cor wrote an official report to General Jan Dodonna on whether Alliance Starfighter Command should use X-wing starfighters as its backbone. Cor also mentioned in the report that General Antoc Merrick and Commander Garven Dreis agreed, and also wrote on some advantages of having the X-wing as the primary starfighter of Starfighter Command. Cor finished the report by confirming that supplemental materials would follow which would hopefully persuade the accountants. Cor's report was later included in The Rebel Files.\nDuring Operation Handoff when Senator Mon Mothma fled to Dantooine with the help of the Spectres and Gold Squadron, she created a report that detailed several members of Alliance High Command, which included Cor and was later added to The Rebel Files. Sometime following the Vulpter data raid and the establishment of Base One on Yavin 4, Cor created a flight patrol schedule to patrol the area around Yavin and the Gordian Trace Relays. Cor was part of a subsequent report on the UT-60D U-wing starfighter/support craft composed by General Merrick in which Merrick stated that both Cor and General Dodonna approved his evaluation of the UT-60D. Both reports were also added to The Rebel Files.\nAlthough Merrick was in charge of the Starfighter Command, Merrick deferred to Colonel Cor for day-to-day decisions. Cor worked closely with General Jan Dodonna for the most efficient utilization of starfighter resources in the Gordian Reach–the sector that encompassed Yavin. Early in the rebellion, Cor was capable of issuing demerits to his pilots for infractions, such as a messy ready room in Base One.\nShortly after the Eadu Flight Station was destroyed, the Alliance High Command held a meeting on the recently confirmed superweapon, known as the Death Star. Cor attended the meeting and watched as individuals such as Jyn Erso and Admiral Raddus campaigned for an attack on the Scarif vault to obtain the plans for the Death Star. However, with much opposition, the high command could not go through with the plan. After Cor and the others left, Erso took matters into her own hands and led a strike team to attack the vault on Scarif. Raddus soon followed with a large portion of the Alliance Fleet and although they were successful, it led to the deaths of Erso, Raddus, Merrick and many others.\nAfter the Battle of Scarif, Cor was in the war room of Base One along with General Dodonna, General Vanden Willard, Princess Leia Organa, and others directing the attack against the Death Star during the Battle of Yavin. Cor's statement during the battle that Red Squadron and Gold Squadron were en route and nearing visual range of the Death Star was included in a partial transcript of conversations in the war room, and was added in The Rebel Files. During the evacuation of Yavin 4, Lieutenant Wedge Antilles wrote a patrol report of a flight conducted by Snoop 2, a Patrol X-wing, to Colonel Cor of Yavin's perimeter. The report was included in The Rebel Files.\nDuring the Galactic Civil War he trained up many rebel pilots for the Alliance and was promoted to general. He later attended a meeting at the Mako-Ta Space Docks, held by Mothma, on the Alliance's plan to obtain more Mon Calamari Star Cruisers. There, Cor stood between General's Davits Draven and Jan Dodonna and they watched as Organa addressed her plan for to prompt mutiny of Mon Cala's merchant fleet. Mothma approved of this and Organa was soon successful, obtaining many cruisers for the Alliance. The cruisers were outfitted for war with mainly Shu-Torun technology and soon after, a party was held to celebrate this. However, when their new fleet prepared to scatter, their hyperdrives failed to respond as the Shu-Torun technology had been sabotaged by it's queen, Trios. Darth Vader's Death Squadron then arrived and began attacking the cruisers, destroyed General Vanden Willard flagship Yavin's Hope' first.\nOrgana and Cor led a strike team to board Trios' ship before it could escape. They engaged her soldiers and Cor pulled Organa back as a shot almost hit her, saying she was too valuable to lose. Organa replied that everyone was too valuable to lose and that everyone was dying. They soon sent the Shu-Torun soldiers running and they made for the bridge, where Trios was. They made it to the bridge and started gunning down the soldiers. Organa spotted Trios running away and tried to go for her. Cor told her to stay back as the gunfight ensued but Organa said it was the only choice and ran for Trios. The gunfight soon drew to a close and Cor and Draven began looking through the ships database for a way to get the cruisers moving again. Organa returned after failing to catch Trios and Draven discovered that if they flew something at the cruiser's hanger doors, they could open and free the starfighters from their entrapment. Cor volunteered to take a shuttle out there as he had trained many of those pilots and he flew it through the fighting towards the cruisers. However, TIE fighters soon intercepted him and the slowness of his shuttle meant he could not evade them. Cor's ship exploded into a fireball before long.\nBandwin Cor was a human male with black hair and brown skin and eyes. He was an efficient leader, having a large role in the Alliance Starfighter Command. Despite being only a Colonel at the time, Cor worked closely with Generals like Jan Dodonna. Col Takbright knew him for giving the rebel pilots demerits for their wrongdoings. During a firefight on Trios' ship, he rescued Organa from one of the blaster shots and told her she was too valuable to lose. After, Draven deduced that they needed to have someone fly at the hanger doors of cruisers to make them open. Cor volunteered himself, as he had trained half of the pilots they intended to free.\nGeneral Antoc Merrick often referred to Bandwin Cor for day-to-day decisions, despite being a higher rank than him at the time. He was also a good teacher, having taught half of the rebel pilots. Cor's skills eventually got him promoted to a general and during the Assault on the Mako-Ta Space Docks, he led a strike team with Leia Organa onto Trios' ship.\nBandwin Cor wore a beige brown shirt with a beige jacket over it. He also wore beige trousers with a brown belt and silver belt buckle. He always had his rank insignia on the right side of the jacket.\nBandwin Cor first appeared as a background character in the anthology film Rogue One: A Star Wars Story. He was then identified through Star Wars: Rogue One: The Ultimate Visual Guide. Star Wars lead writer Kieron Gillen was the one who came up with killing off Cor, as he thought about how the heroes rose through the ranks so quickly.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/1_ABY",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Starfighter_Command",
  "/wiki/Massassi_Group",
  "/wiki/Colonel",
  "/wiki/General",
  "/wiki/Galactic_Civil_War",
  "/wiki/Rebel_pilot",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Mon_Calamari",
  "/wiki/Star_Cruiser",
  "/wiki/Operation_Buckler",
  "/wiki/Jan_Dodonna",
  "/wiki/X-wing_starfighter",
  "/wiki/Antoc_Merrick",
  "/wiki/Commander",
  "/wiki/Garven_Dreis",
  "/wiki/The_Rebel_Files",
  "/wiki/Operation_Handoff",
  "/wiki/Senator",
  "/wiki/Mon_Mothma",
  "/wiki/Dantooine",
  "/wiki/Spectres",
  "/wiki/Gold_Squadron",
  "/wiki/Alliance_High_Command",
  "/wiki/Time",
  "/wiki/Vulpter_data_raid",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Yavin_Prime",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Standard_day",
  "/wiki/Starfighter",
  "/wiki/Gordian_Reach",
  "/wiki/Sector",
  "/wiki/Demerit",
  "/wiki/Pilot",
  "/wiki/Eadu_Flight_Station",
  "/wiki/Mission_to_Eadu",
  "/wiki/Superweapon",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Jyn_Erso",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/Scarif_vault",
  "/wiki/Rogue_One",
  "/wiki/Battle_of_Scarif",
  "/wiki/Scarif",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Vanden_Willard",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Battle_of_Yavin",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Evacuation_of_Yavin_4",
  "/wiki/Lieutenant",
  "/wiki/Wedge_Antilles",
  "/wiki/Snoop_2",
  "/wiki/Patrol_X-wing",
  "/wiki/Davits_Draven",
  "/wiki/Mutiny_on_Mon_Cala",
  "/wiki/Mon_Cala",
  "/wiki/Mon_Cala_Mercantile_Fleet",
  "/wiki/Cruiser",
  "/wiki/Shu-Torun",
  "/wiki/Hyperdrive",
  "/wiki/Queen",
  "/wiki/Trios",
  "/wiki/Anakin_Skywalker",
  "/wiki/Death_Squadron",
  "/wiki/Yavin%27s_Hope",
  "/wiki/Trios%27_ship",
  "/wiki/Bridge_(starship)",
  "/wiki/Shuttle",
  "/wiki/Col_Takbright",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars_(Marvel_Comics_2015)",
  "/wiki/Kieron_Gillen",
  "/wiki/Duty_Roster",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars_(2015)_51",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Databank_(website)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_ABY",
  "/wiki/Death",
  "/wiki/Star_Wars_(2015)_49",
  "/wiki/Star_Wars_(2015)_50",
  "/wiki/File:KieronGillen-Death-January-10-2019.png"
 ]
}