{
 "name": "Bane Nothos",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Bane Nothos was, at one time, an aspiring Imperial District Commander, responsible for the territory surrounding the Roche asteroid field. Nothos was a brilliant tactical officer, and earned an appointment by Emperor Palpatine to disrupt and destroy Admiral Gial Ackbar's Shantipole Project, which was being headed by Verpine living among the Roche asteroids. To assist with this mission, he was assigned a new EF76 Nebulon-B escort frigate to maintain control of the asteroid field.\nNothos planted an Imperial agent, Salin Glek, among the project's staff to serve as a spy and informant. He allowed Shantipole to run its course, hoping to take possession of fully operative B-wing starfighters, rather than just plans and designs.\nUsing intelligence garnered by Glek, Nothos attacked the project, and even obtained possession of the B-wing prototypes. He was able to anticipate Ackbar's actions for a time, but Rebel agents, including Ackbar, were able to foil his attempt to take control of the project; the Rebels even managed to steal Nothos's Nebulon-B frigate in the process, further infuriating the Imperial commander. The Shantipole Project was a complete success for the Alliance, and Nothos was subsequently demoted.\nFollowing the Shantipole debacle, he was sent to to lead the Imperial Outer Rim Territories Patrol Fleet. While there, he was captured by a group of Alliance spies. He was being transported to an Alliance penal world aboard the Celestial when he staged an escape. While the transport ship suffered a hyperdrive malfunction and was lost in Otherspace, Nothos made good his escape, though he was afterward forced to submit to the authority of Grand Moff Ravik following his rescue aboard Ravik's ship. While in Otherspace, the Imperials made contact with Ber'asco, the leader of a Charon Death Cult, who patrolled Otherspace in his ship, the Desolate.\nNothos was later confronted with a group of Alliance agents dispatched to take control of the Celestial, and tried to rescue the crew of the transport from Otherspace. The Alliance agents found themselves forced to fight aboard the Desolate, and Nothos attempted to toss a thermal detonator into the melee to ensure their death. The detonator exploded before he could throw it, however, and tore open a huge hole in the ship's hull.\nNothos and his Imperial subordinates were believed to have been killed in the explosion, but Nothos somehow survived. He was captured and put into cryogenic sleep, while Ber'asco engaged in a strange mental battle with Ravik. When Ravik defeated the Charon leader, Ber'asco's mind took control of Nothos's body, and used it to hunt down Ravik. In a battle on the planet Stronghold, Ber'asco nearly defeated Ravik using Nothos's body, but the stronger Ravik crushed him in his iron grip, causing both Ber'asco and Nothos to perish.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Bane",
  "/wiki/3_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/District_Commander",
  "/wiki/Roche_asteroid_field",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Shantipole_Project",
  "/wiki/Verpine/Legends",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Salin_Glek",
  "/wiki/A/SF-01_B-wing_starfighter/Legends",
  "/wiki/Battle_of_Roche_(Galactic_Civil_War)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Imperial_Outer_Rim_Territories_Patrol_Fleet",
  "/wiki/Celestial_(starship)",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Ravik/Legends",
  "/wiki/Ber%27asco",
  "/wiki/Charon",
  "/wiki/Charon_Death_Cult",
  "/wiki/Desolate",
  "/wiki/Stronghold_(planet)",
  "/wiki/Star_Wars:_Rebellion_(video_game)",
  "/wiki/Strike_Force:_Shantipole",
  "/wiki/Otherspace_(adventure)",
  "/wiki/Otherspace_II:_Invasion",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars:_Rebellion:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_14",
  "/wiki/Strongholds_of_Resistance"
 ]
}