{
 "name": "Bansee",
 "display_name": "Bansee",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "White Worms"
     ]
    }
   ]
  }
 ],
 "content": "Bansee was a human female member of the White Worms gang on the planet Corellia. She caught the eye of the gang's leader, Lady Proxima, for being the best rat catcher amongst the scrumrats her age and was made Third Girl. In 13 BBY, she was present when the scrumrat Han escaped from Proxima in the Den of the White Worms.\nBansee was a human female from the planet Corellia who served as a scrumrat in the White Worms gang of Coronet City. As the best rat catcher out of all of the girls her age, Bansee caught the attention of the leader of the gang, Lady Proxima, who made her Third Girl.\nIn the year 13 BBY, Bansee was present in the den when fellow scrumrat Han was brought before Proxima by Moloch, one of the gang's lieutenants. Han, who had returned from a trade with no goods for Proxima, used a rock to break a shutter behind the gang leader and bathe her in light, which burned her skin. Using the distraction, Han then pushed through the other scrumrats and escaped.\nAfter an individual infiltrated the White Worms in order to retrieve a client's datapad, Bansee tasked them with \"sending a message\" to one of the gangs enemies in order to prove their loyalty. The individual succeeded in the task, but Bansee ended up threatening them with a stun baton and questioning who they worked for. The individual managed to avoid Bansee's wrath and ultimately acquired the datapad they were after.\nOne of the older scumrats, Bansee was clever and a tough fighter, but mean-spirited and humorless. The Corellian's talent with the pipe she called the \"rat hammer\" caught Lady Proxima's attention, and the scumrat did not hesitate to use it on anyone who displeased her. Despite holding the rank of Third Girl, she was ambitious and eager to climb higher within the gang, possibly by becoming one of Moloch's thugs. She had tan skin, brown hair, and brown eyes.\nBansee wore a gray brine-stained robes with a brown belt and boots. She carried a satchel for stolen parts, wore a red light-filter headband, and used a battered pipe known as the \"rat hammer\" as a makeshift weapon. She also made use of a stun baton.\nBansee first appeared in the 2018 Anthology Series film, Solo: A Star Wars Story. The character was first identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Corellian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/White_Worms",
  "/wiki/Planet",
  "/wiki/Eye",
  "/wiki/Lord",
  "/wiki/Proxima",
  "/wiki/Rat",
  "/wiki/Scrumrat",
  "/wiki/Third_Girl",
  "/wiki/13_BBY",
  "/wiki/Han_Solo",
  "/wiki/Den_of_the_White_Worms",
  "/wiki/Coronet_City",
  "/wiki/Standard_year",
  "/wiki/Moloch",
  "/wiki/Lieutenant",
  "/wiki/Unfinished_Business_(Outer_Rim)",
  "/wiki/Datapad",
  "/wiki/Stun_baton",
  "/wiki/Rat_hammer",
  "/wiki/Hair",
  "/wiki/Salt",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Stun",
  "/wiki/Baton",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}