{
 "name": "Bant'ena Fhernan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 21 BBY",
      "Lanteeb"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Bant'ena Fhernan was a Human female Corellian from the planet Corellia who lived during the Clone Wars.\nEarly in the war, she accompanied a research team to Niriktavi Bay on Taratos IV, despite the misgivings of her mother, Mata Fhernan. While there, the Confederacy of Independent Systems invaded the planet, and murdered most of her colleagues and took her captive. She was given to Lok Durd, who forced her to create a bioweapon that would turn organic matter to mush. She later met the two Jedi Anakin Skywalker and Obi-Wan Kenobi. Skywalker promised to free her and to save her loved ones that the Confederacy kept under constant surveillance. Durd found out about the arrangement and threatened her nephews, finally convincing Fhernan to give the two Jedi up to Durd. Although the Jedi, informed by Skywalker and Kenobi of Fhernan and her family, managed to rescue all but one of her friends and family, Fhernan remained unaware of their safety and continued to work for Durd, eventually resulting in a terrorist attack on Chandrila using her weaponry.\nFhernan immediately regretted allowing herself to be controlled by her loved ones, constantly thinking about how many mothers and fathers had been lost on Chandrila to innocent civilians. In the midst of this, the Jedi had sent reinforcements to Skywalker and Kenobi, and Jedi Master Taria Damsin was sent to rescue Fhernan and destroy Durd's compound. Once it was discovered that there would be complications in both setting off the explosives and escaping, Fhernan volunteered to stay behind and set them off herself in an attempt to right all of her wrongs. Damsin agreed, and once she had cleared the area, Fhernan detonated the bombs, killing herself and destroying all of Durd's base.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Lanteeb/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Niriktavi_Bay",
  "/wiki/Taratos_IV",
  "/wiki/Mata_Fhernan",
  "/wiki/Lok_Durd/Legends",
  "/wiki/Bioweapon/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Chandrila/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Taria_Damsin",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Bant%27ena_Fhernan",
  "/wiki/Clone_Wars_Gambit:_Stealth",
  "/wiki/Clone_Wars_Gambit:_Stealth_(audiobook)",
  "/wiki/Clone_Wars_Gambit:_Siege",
  "/wiki/Clone_Wars_Gambit:_Siege_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}