{
 "name": "Banu_Hydia",
 "display_name": "Banu Hydia",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3694 BBY",
      "Imynusoph"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Banu Hydia was a male Duros scout active around 3700 BBY, for whom the Hydian Way was named. He encountered Freia Kallea as she was charting her way through space, initially as a rival, but eventually alongside her.\nHydia became involved in the Kallea story when he was hired by the Neimoidians Thoax and Farge Osaax to eliminate her, but he refused. He met with Kallea in a cantina on Denon while she was looking for a shortcut between the Corellian Run and the Rimma Trade Route. They discussed the perils of the Itani Nebula and the black holes of the Tyus Cluster. Though Hydia cautioned Kallea of the dangers involved, she ignored them and went on to chart the route regardless. Kallea was successful in finding her route, but the Osaaxes hired Gran thugs to imprison her on Malastare. Hydia intervened and freed Kallea, while giving the Gran a warning from the powers in Brentaal, as well as Kallea insight into her new enemies.\nSoon after returning to Brentaal, Kallea's interest in extending the route surged. She returned to Malastare despite Hydia's warning and was shot down onto the world of Nuvar. Six years passed before Hydia was able to locate Kallea on the planet. While he was swore to secrecy, she returned to Brentaal where Kallea disguised herself as a Bureau of Ships and Services agent to see if her family still mourned her, and then found that during her captivity, her route had been blazed to the Rimma Trade Route. Hydia joined Kallea in charting the last segments of the route, from the Rimma to the Corellian Trade Spine. They both pushed through the clouds of the Tosste system and found the planet of Terminus.\nHydia believed the journey to believe over, but Kallea desired revenge on the Neimoidians. While Kallea lured the Osaaxes to Imynusoph, a treasure world with a purported peaceful species of natives, Hydia traveled to Brentaal to notify her benefactor Sival Brentioch that she was still alive. The Osaaxes took the bait and arrived for a banquet in their name at a temple on the planet, however were horrified to find Kallea there with control of the Imyni. The Neimoidians alerted their Gran and Dug guards to protect them from the natives, but then saw the fleet from Brentaal as it arrived with Sival and Hydian. In the battle that followed, Hydian saved Kallea, but became mortally wounded himself. As he laid dying on the temple floor, Sival revealed himself to Kallea, and Hydia urged them to go. After Hydia died, the Neimoidians were arrested, and Kallea and Sival took his body to Brentaal where it was buried. The route that Kallea charted would be named the \"Hydian Way\" in his honor.\nHydia's involvement with Freia Kallea was immortalized in the Brentaalian opera The Kallea Cycle, where Hydia was portrayed by Amaro Fonteen. Much controversy was created when the role was given to a Human versus the traditional choice of a Duros double-bass vocalist.\nIn the centuries after his death, differing theories on Hydia's contribution to the Hydian Way appeared, especially during the age of the Galactic Empire. Imperial archivists had claimed that his role was exaggerated.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3694_BBY",
  "/wiki/Imynusoph/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Scout/Legends",
  "/wiki/3700_BBY/Legends",
  "/wiki/Hydian_Way/Legends",
  "/wiki/Freia_Kallea/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Thoax_Osaax",
  "/wiki/Farge_Osaax",
  "/wiki/Cantina/Legends",
  "/wiki/Denon/Legends",
  "/wiki/Corellian_Run/Legends",
  "/wiki/Rimma_Trade_Route/Legends",
  "/wiki/Itani_Nebula/Legends",
  "/wiki/Black_hole/Legends",
  "/wiki/Tyus_Cluster",
  "/wiki/Gran/Legends",
  "/wiki/Malastare/Legends",
  "/wiki/Nuvar",
  "/wiki/Bureau_of_Ships_and_Services/Legends",
  "/wiki/Corellian_Trade_Spine/Legends",
  "/wiki/Tosste_system",
  "/wiki/Terminus/Legends",
  "/wiki/Sival_Brentioch",
  "/wiki/Imyni/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Amaro_Fonteen",
  "/wiki/Brentaal_IV/Legends",
  "/wiki/The_Kallea_Cycle",
  "/wiki/Human/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/StarWars.com",
  "/wiki/Slugthrowers:_An_Overview_of_Popular_Music_and_Musicians_in_a_Galaxy_Far,_Far_Away"
 ]
}