{
 "name": "Barada",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Klatooine"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Barada was a Klatooinian who served the crime lord Jabba the Hutt before 0 BBY, and would continue to serve Jabba up to four years after the Battle of Yavin. When Jabba attempted to execute a group of Rebels at the Great Pit of Carkoon on the planet Tatooine, Barada was one of the crime lord's minions who traveled with the prisoners to the pit. At the execution, however, the Rebels fought to free themselves, and in the struggle the Jedi Knight Luke Skywalker slashed Barada with his lightsaber and killed the Klatooinian.\nThe Klatooinian male Barada was born on the planet Klatooine but became enslaved to the Hutt crime lord Jabba Desilijic Tiure four years after the Battle of Yavin. He worked as a mechanic and skiff guard in Jabba's Palace on the desert planet Tatooine, and was responsible for the gangster's entire pool of repulsorlift vehicles, which included his sail barge Khetanna, in addition to serving as muscle.\nBarada was in the Hutt's employ when Jabba was in possession of the smuggler Han Solo frozen in carbonite. Solo's companions in the Alliance to Restore the Republic hoped to rescue their comrade, planting some of their number in Jabba's court: Princess Leia Organa, and then Jedi Knight Luke Skywalker, both attempted to free Solo, but ended up Jabba's captives along with the Wookiee Chewbacca. After Jabba's rancor failed to kill Skywalker, the crime lord demanded that Solo, Skywalker and Chewbacca all be executed at the Great Pit of Carkoon, where they would be fed to the sarlacc. Barada was among the henchmen Jabba assigned to ride in a secondary skiff, to travel alongside the skiff carrying the prisoners to the pit. Once at the pit, Skywalker's astromech droid R2-D2, who was serving in Jabba's court, armed the Jedi with his lightsaber, which he used to quickly slay all of the henchmen on the skiff with him. The Jedi then leaped across to the vehicle carrying Barada, and killed a number of the men on it before the Klatooinian attacked him. Skywalker dodged the blow and slashed at Barada, knocking him into the pit of the sarlacc. The Rebels went on to slay Jabba and destroy his sail barge, killing many other members of his court in the process and escaping. Barada was killed by Skywalker's green lightsaber. Languishing in the Pit of Carkoon, Barada would be slowly digested by the sarlacc over the next thousand years. Barada was mentioned as having famously maintained Jabba's skiffs in an artist's journal, which was restored, expanded, and displayed at the Graf Archive at some point after 34 ABY.\nBarada had green skin and blue eyes. Although a slave, Barada found reasonable contentment with his lot, and helped maintain Jabba Desilijic Tiure's repulsorlift vehicles. He was experienced and knew how to mind the Hutt's vile tempers.\nBarada wore a white shirt, blue pants and an orange bandana while at the Great Pit of Carkoon. The Klatooinian also wore a backpack and carried a battle-staff weapon.\nBarada first appeared in James Kahn's novelization of the 1983 film Star Wars: Episode VI Return of the Jedi, the final installment of the Star Wars original trilogy. He was played uncredited by stuntman Dirk Yohan Beer. Concept sketches on him were drawn, and later maquettes were crafted. Barada was executed as a costume made of a slip-on mask and gloves representing hands. Several \"Barada-like\" aliens were crafted for the scene of the sarlacc.\nBarada, as well as fellow skiff guard Klaatu and the species Nikto, are all references to the phrase Klaatu barada nikto from the 1951 science fiction film The Day The Earth Stood Still.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Barada",
  "/wiki/Barada/Legends",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/Databank_(website)",
  "/wiki/Klatooine",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Klatooinian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/0_BBY",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Death",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Planet",
  "/wiki/Jedi_Knight",
  "/wiki/Luke_Skywalker",
  "/wiki/Lightsaber",
  "/wiki/Slavery",
  "/wiki/Technician",
  "/wiki/Skiff",
  "/wiki/Security_guard",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Desert",
  "/wiki/Repulsorlift",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Rancor",
  "/wiki/Sarlacc",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Unidentified_artist",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Graf_Archive",
  "/wiki/34_ABY",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/James_Kahn",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi_(novel)",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Dirk_Yohan_Beer",
  "/wiki/Klaatu",
  "/wiki/Nikto",
  "/wiki/1950s#1951",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Complete_Vehicles",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/In-universe",
  "/wiki/Poe_Dameron",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Amilyn_Holdo",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Databank_(original)"
 ]
}