{
 "name": "Barcel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Barcel was a human male who served in the Galactic Empire's navy as a communications officer on the bridge of Prelate Verge's personal Imperial II-class Star Destroyer, the Herald. During the hunt for former Imperial Governor Everi Chalis in 3 ABY, Barcel informed Captain Tabor Seitaron when word came that the Rebel Alliance's 61st Mobile Infantry, which Chalis was traveling with, had captured a facility on the planet Sullust. The communications officer also reported to Seitaron when Chalis attempted to escape Sullust aboard a stolen shuttle.\nBarcel was a human male who served in the navy of the Galactic Empire during the Galactic Civil War. By the year 3 ABY, he was the communications officer on the bridge of the Imperial II-class Star Destroyer Herald, the personal Star Destroyer of the Imperial Ruling Council member Prelate Verge. Shortly after the Battle of Hoth, Captain Tabor Seitaron, Verge's guest aboard the Herald, prepared the numerous worlds along the Rimma Trade Route, including Sullust, Malastare, and Tshindral, for an anticipated attack by the Rebel Alliance's 61st Mobile Infantry.\nWhen the 61st captured the Inyusu Tor mineral processing facility on Sullust, Barcel was alerted to the event and was quick to inform Seitaron. The duty officers on the Herald's bridge then applauded the captain, who asked for Verge and a channel to the TIE fighters of Vixus Squadron. The squadron subsequently traveled to Sullust and the Herald followed suit to assist the local Imperial forces in engaging the 61st and apprehending the former Governor Everi Chalis, whom Verge and Seitaron were tracking down.\nLate into the battle against the 61st on Sullust, Barcel approached Verge and Seitaron at the bridge, informing them that a shuttle was leaving one of the transport stations below. Seitaron asked if it was broadcasting clearance codes, and Barcel told him they were codes the captain had warned to watch out for. Deducing that the shuttle was being piloted by Chalis, Seitaron ordered for the stolen vessel to be pulled aboard the Herald with a tractor beam and departed the bridge with Verge to confront the ex-governor. Ultimately, Chalis set off twenty ion bombs inside her shuttle, causing a power surge in the Herald and forcing its withdrawal from Sullust.\nBarcel had a competent but overeager impression on Seitaron. He referenced the captain's past orders and predictions when relaying information to him.\nBarcel appeared in Battlefront: Twilight Company, a 2015 novel written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/File:BarcelTransport-BTC.ogg",
  "/wiki/Communications_Officer",
  "/wiki/Bridge_(starship)",
  "/wiki/Prelate",
  "/wiki/Verge",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Herald",
  "/wiki/Governor",
  "/wiki/Everi_Chalis",
  "/wiki/3_ABY",
  "/wiki/Captain",
  "/wiki/Tabor_Seitaron",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Siege_of_Inyusu_Tor",
  "/wiki/Inyusu_Tor_mineral_processing_facility",
  "/wiki/Planet",
  "/wiki/Sullust",
  "/wiki/Imperial_officer",
  "/wiki/Thief",
  "/wiki/Shuttle",
  "/wiki/File:BarcelTabor-Thunderstrike-BTC.ogg",
  "/wiki/Galactic_Civil_War",
  "/wiki/Standard_year",
  "/wiki/Star_Destroyer",
  "/wiki/Imperial_Ruling_Council",
  "/wiki/Battle_of_Hoth",
  "/wiki/Rimma_Trade_Route",
  "/wiki/Malastare",
  "/wiki/Tshindral",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Vixus_Squadron",
  "/wiki/Squadron",
  "/wiki/Imperial_Garrison_(Sullust)",
  "/wiki/Transport",
  "/wiki/Pilot",
  "/wiki/Starship",
  "/wiki/Tractor_beam",
  "/wiki/Ion_bomb",
  "/wiki/File:BarcelTabor-Codes-BTC.ogg",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/2015",
  "/wiki/Alexander_Freed",
  "/wiki/Category:Audio_files_of_Barcel",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Rebel_Files"
 ]
}