{
 "name": "Barduun",
 "display_name": "Barduun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "45 ABY",
      "Base Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorian Protectors"
     ]
    }
   ]
  }
 ],
 "content": "Barduun was a Mandalorian mercenary hired by Marvid and Craitheus Qreph to enter the unknown monolith stationed below Base Prime in the heart of the Chiloon Rift. With the Force-sensitive mercenary Savara Raine acting as the key to entering the gate between Base Prime and the monolith, Barduun became Force-sensitive, but he was also rendered insane and began to use the dark side of the Force, drawing on fear and anger from others. His insanity prompted him to betray the Qrephs and help Han Solo and Ohali Soroc  escape from the brothers' clutches. During the escape, he fought the Qrephs' Nargon guards in their clone laboratory. In the laboratory, Solo found his own clone and also a younger clone of his wife, Leia, which Solo dubbed as \"Creepy Leia\". Barduun helped Solo get close to the gate between the base and the monolith, but when Barduun tried to force him to enter past the gate, Solo refused. Barduun was adamant that the only way to defeat the Qrephs was to enter the gate and become Force-sensitive. When Barduun tried to force Solo into the gate, he defended himself. In the process Barduun lost Creepy Leia and also ended up dead when Solo shot him down. His remnants were blown away by the turrets that defended the gate.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/45_ABY",
  "/wiki/Base_Prime",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mandalorian_Protectors/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Marvid_Qreph",
  "/wiki/Craitheus_Qreph",
  "/wiki/Chiloon_Rift",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Vestara_Khai",
  "/wiki/Space%E2%80%93time-warping_gate",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Ohali_Soroc",
  "/wiki/Prisoner/Legends",
  "/wiki/Nargon",
  "/wiki/Cloning/Legends",
  "/wiki/Laboratory/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Leia_biot",
  "/wiki/Crucible_(novel)",
  "/wiki/Crucible_(audiobook)"
 ]
}