{
 "name": "Barel Ovair",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown",
      "Orange-yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Sith Empire"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Eison Gynt"
     ]
    }
   ]
  }
 ],
 "content": "Barel Ovair was a prestigious Human male Jedi Master and scholar of the Old Republic. He was the scion of a respected line of Jedi Knights who were all secretly spies working for the Emperor of the reconstituted Sith Empire. Ovair took Eison Gynt, a highly skilled Nautolan Padawan and a fourth-generation Jedi, as his apprentice, but abandoned him during a mission to the tomb of the Sith Lord Naga Sadow on Yavin 4.\nWhen Ovair returned to Coruscant alone weeks afterward, he claimed that Gynt had been killed. However, Gynt resurfaced on Coruscant years later, possessed by Sadow's spirit and determined to kill Ovair. Ovair defeated Gynt in combat, slaying him, and was lauded as a hero for his triumph. It was not until many years later that the Jedi historian Gnost-Dural connected Ovair and his family line to the Sith Emperor.\nBarel Ovair was a Human male Jedi Master from a respected family line of Jedi. Secretly, he and his family were spies working for the reconstituted Sith Empire in the years prior to the outbreak of the Great Galactic War. In his role as a Jedi Master, Ovair took a talented young Nautolan Padawan named Eison Gynt, a fourth-generation Jedi, as his apprentice. As fellow Jedi scholars, Ovair and Gynt traveled the galaxy, studying the Force and taking on increasingly daring tasks for the Jedi Order. One of their missions took them to the Valley of the Dark Lords, the resting place of many Sith Lords, on the planet Korriban.\nTheir career together culminated with an ambitious mission in 3756 BBY to explore the tomb of the Sith Lord Naga Sadow on the moon Yavin 4. The mission was ostensibly to rid the temple of dark-side energies for the good of the Order, but in truth, Ovair was under orders by the Sith Emperor of the Sith Empire to eliminate any remnant of Sadow's power, which the Emperor viewed as a potential threat to his planned invasion of the Republic. During the mission, Ovair and Gynt were attacked by Massassi warriors native to the moon, and were forced to go deep within the tomb. Ovair returned to Coruscant weeks later without his Padawan, incoherent and injured. After recovering from his ordeal, Ovair reported to the Galactic Senate that Gynt had been killed during the mission. However, Gynt was in fact still alive and had fallen under the influence of Sadow's spirit.\nGynt resurfaced on Coruscant several years after the failed mission to Yavin 4, dressed in Massassi warrior robes and possessed by the spirit of Sadow. After finding his former Master, Gynt attacked him in full view of the public. While Gynt's borrowed dark-side abilities were formidable, the undercover Sith defeated and killed his former Padawan. Ovair was interviewed by the Jedi High Council after the duel, but his triumph was praised, and he came under no suspicion.\nIndeed, he was hailed as a hero by the Galactic Republic for his actions. Over a century later, Jedi historian Gnost-Dural questioned why the spirit of Sadow would have sought vengeance against Ovair specifically, and made the connection between Ovair and the Sith. He realized that Ovair and his Jedi ancestors were in fact spies working on behalf of the Sith Emperor. The historian deduced that Ovair had used Gynt to draw out Sadow's spirit to eliminate it prior to the invasion of the Republic.\nOvair was ostensibly a respected Jedi scholar, though he concealed his true allegiances so well that they were not discovered for centuries; even when driven half-insane by his ordeal on Yavin 4, Ovair did not allow his cover to slip. Alongside his Padawan Gynt, Ovair grew more and more ambitious in his expeditions across the galaxy, culminating in the mission to Yavin 4. Ovair had fair skin with brown hair and eyes, although his eyes would turn orange-yellow when his corruption by the dark side of the Force was revealed.\nWhen the spirit of Naga Sadow possessed Gynt, who had been considered the most promising Padawan in the Jedi Order at the time of his selection, Ovair was still able to overcome the formidable dark powers of Sadow occupying the body of such a talented Jedi. Ovair's skills at subterfuge were sufficient to conceal his identity until years later when reviewed by Jedi historian Gnost-Dural; he concealed his strength in the dark side even as he resided within the walls of the Jedi Temple. Ovair wielded a purple double-bladed lightsaber.\nBarel Ovair was introduced in Timeline 7: Peace for the Republic?, a video released on April 16, 2010 as part of the Galactic Timeline series of lore videos published on the official website for the 2011 BioWare video game Star Wars: The Old Republic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Eison_Gynt",
  "/wiki/Timeline_7:_Peace_for_the_Republic%3F",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_historian",
  "/wiki/Ovair_family",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Tenebrae",
  "/wiki/Nautolan/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mission_to_Yavin_4",
  "/wiki/Naga_Sadow%27s_tomb",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Force_ghost",
  "/wiki/Duel_on_Coruscant_(Inter%E2%80%93Sith_Wars_Period)",
  "/wiki/Time/Legends",
  "/wiki/Gnost-Dural",
  "/wiki/Sith_Emperor/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/The_galaxy/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Valley_of_the_Dark_Lords/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Korriban",
  "/wiki/3756_BBY",
  "/wiki/Moon/Legends",
  "/wiki/Massassi/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Sith_apparel",
  "/wiki/Force_power/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/April_16",
  "/wiki/2010",
  "/wiki/Galactic_Timeline",
  "/wiki/2011",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Timeline_8:_The_Jedi_Civil_War",
  "/wiki/Timeline_10:_The_Exar_Kun_War",
  "/wiki/Category:Images_of_Barel_Ovair",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY"
 ]
}