{
 "name": "Bargthron",
 "display_name": "Bargthron",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Zeltros"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tof"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Bargthron was a Tof pirate, and was second in command under an unidentified Supreme of the invasion force during the Battle of Zeltros in 4 ABY.\nAfter the initial invasion of Zeltros, the Tof were able to capture the leader of the Nagai forces on Zeltros, Den Siva. The Tof then forced Den to betray his men by threatening the Zeltron Dani at the time a Tof prisoner.\nThe leader of the Tof invasion force, Supreme put Bargthron in charge of Den and a Tof armada to capture the remaining Nagai on Zeltros. Bargthron and his men caught the Nagai by surprise and began to slaughter them and the Maccabree warriors. When resistance was minimal, Bargthron began to interview the Nagai prisoners, including Han Solo. Bargthron quickly realized that the Nagai prisoners were worthless to the Tof and ordered their immediate execution. Unfortunately for Barghthron and his Tof forces, Leia Organa and Dani had escaped from their Tof captors. The two women killed Bargthron and three of his kinsmen, saving Solo and the rest of the prisoners.\nThe women's appearance also helped ignite a revolt by the prisoners which included many Zeltrons. The prisoners overwhelmed their would-be attackers and destroyed Bargthron's armada. The invasion was defeated when the forces of the Alliance, Hiromi Empire, Nagai, and the native Zeltrons banded together to repel it.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Zeltros/Legends",
  "/wiki/Tof",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Unidentified_Tof_Supreme",
  "/wiki/Supreme",
  "/wiki/Battle_of_Zeltros",
  "/wiki/Nagai",
  "/wiki/Den_Siva",
  "/wiki/Zeltron/Legends",
  "/wiki/Dani",
  "/wiki/Maccabree",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/Hiromi_Empire",
  "/wiki/Star_Wars_(1977)_106"
 ]
}