{
 "name": "Barkale",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kintoni"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 4-5 ABY",
      "Kintoni"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Barkale was the Imperial Governor of Kintoni around 4 to 5 ABY.\nPrior to the Battle of Yavin Barkale was a popular figure in Kintoni politics, and a regular fixture of high society functions; at one such event, Emperor Palpatine himself pointed the governor out to Mara Jade as a man to watch.\nAfter Palpatine's death, Barkale eventually surrendered to Rebel Alliance forces led by General Crix Madine, who liberated Kintoni and placed the governor under house arrest. Barkale was a less than co-operative prisoner, quite aware that the Alliance, while suspicious of his activities, had insufficient concrete evidence of wrongdoing to bring charges against him and insistent that he should be given his freedom without delay.\nSubsequently, Barkale was rescued by Mara Jade, who was on Kintoni by chance, on the run from forces loyal to Ysanne Isard. He brought her to his secret home at 455 Tinegris Street, where he revealed a huge fortune in Imperial credits siphoned off from the sector treasury, cleaned out in advance of the Rebel liberation of Kintoni, as well as a collection of rare artwork which he boasted contained some of the most valuable specimens outside of the Emperor's personal collection.\nHowever, when Barkale volunteered to reward Mara handsomely for her services, she turned the tables on the governor, revealing that he had been under suspicion for filing crooked reports and quietly taking money from his treasury for months, explaining that she had been charged with investigating the governor. When Barkale tried to resist, she charged him with treasonous embezzlement and carried out the sentence immediately.\nAfter Barkale's execution, Mara passed on the location of his townhouse and and ill-gotten gains to Madine, who took the money for the Alliance.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kintoni/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/General/Legends",
  "/wiki/Crix_Madine/Legends",
  "/wiki/Ysanne_Isard",
  "/wiki/455_Tinegris_Street",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Treason/Legends",
  "/wiki/Death/Legends",
  "/wiki/Mara_Jade:_A_Night_on_the_Town",
  "/wiki/Star_Wars_Tales_1",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}