{
 "name": "Barlen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  }
 ],
 "content": "Barlen was a male merchant of the Gran species. During the Cold War, he sold weapons in the town of Jiguuna, on the planet Nal Hutta. He operated a market stall next to the Hutt crime lord Suudaa Nem'ro's palace and paid some of his profits to the criminal.\nThe male Gran Barlen lived on the planet Nal Hutta during the Cold War between the Galactic Republic and the Sith Empire. During the war, he worked as a weapons seller in Jiguuna, an industrial town controlled by a Hutt crime lord named Suudaa Nem'ro. Barlen sold several varieties of blaster pistol and blaster rifle and accepted credits as payment at his stall in Jiguuna's marketplace, which was located next to Nem'ro's Palace. As all merchants in Jiguuna were, Barlen was expected to pay some of the profits from his stall to one of Nem'ro's lieutenants at the crime lord's palace. The stall included a shooting practice target which was marked from use.\nBarlen had pink skin and gray eyes.\nWhile at the stall, he wore brown clothing and carried a backpack and a blaster rifle on his back.\nBarlen appeared in the video game Star Wars: The Old Republic, which was released by BioWare in 2011. He appears as a weapons vendor on the planet Nal Hutta, the starting planet for players of the bounty hunter and Imperial Agent classes. In Star Wars: The Old Republic Explorer's Guide, a game guide released by Prima Games alongside The Old Republic, Barlen is represented on a map of Jigunna showing the location of various vendors and other characters.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Gran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Species/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Arms_dealer/Legends",
  "/wiki/City/Legends",
  "/wiki/Jiguuna",
  "/wiki/Planet/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Nem%27ro%27s_Palace",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Factory/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Lieutenant/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Backpack/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Imperial_Agent",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Prima_Games"
 ]
}