{
 "name": "Barlex",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Parjai Squad",
      "Parjai Squad"
     ]
    }
   ]
  }
 ],
 "content": "Barlex was a Republic clone trooper sergeant, and senior Non-commissioned officer  of Parjai Squad during the Clone Wars between the Republic and the Confederacy of Independent Systems. By 21 BBY he developed a strong dislike for Mandalorians due to several of the mercenaries fighting for the Confederates, and he expressed this to the clone commandos of Omega Squad.\nBarlex was a Kamino-bred clone of Mandalorian bounty hunter Jango Fett, and served the Grand Army of the Republic in the Clone Wars between the Republic and the Confederacy of Independent Systems. In 21 BBY, he was a sergeant and senior NCO of Parjai Squad, part of the paratrooper 2nd Airborne Company. This company was itself a part of the 212th Attack Battalion of the 7th Sky Corps, assigned to the Third Systems Army.\nEn route to the planet Gaftikar before continuing to Mirial aboard the Republic auxiliary freighter Core Conveyor, he met with the clone commandos of Omega Squad in the ship's hangar. He greeted the commandos with a snide remark about their armor, which was fitted with winged jetpack. The clone Commando Fi almost hit Barlex in the face when he extended his wings, and proceeded to make several attempts at humor. The NCO however was unsmiling, and pointed out to the Mandalorian-trained commandos that members of their adopted culture were often fighting for the Separatists as mercenaries. This led to the compartment going quiet before the squad's Sergeant Niner both subtly and unofficially reprimanded Fi. Barlex then walked off without a word when the Niner suggest they contact their Jedi commander, General Arligan Zey.\nBy the time Barlex met Omega Squad, he had become weary of supporting special forces and had lost ten clone brothers to Mandalorians. Like other members of the 2nd Airborne, this meant he held strong feelings of animosity towards them and their culture. He thus resented Omega Squad due to their adopting the Mandalorian mindset, and made several vindictive comments to the squad. However, he dropped the topic and walked off after a moment when Niner suggested they get in contact with General Zey, with Darman believing the sergeant withheld a final comment.\nAs a clone of Jango, Barlex was also a human male and stood at a height of 1.83 meters.\nBarlex appeared in the 2007 novel Republic Commando: True Colors, part of the Republic Commando series written by Karen Traviss. In 2009, he was later mentioned in the final book in the series Imperial Commando: 501st.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Parjai_Squad",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Non-commissioned_officer/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Clone_commando/Legends",
  "/wiki/Omega_Squad",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_paratrooper/Legends",
  "/wiki/2nd_Airborne_Company/Legends",
  "/wiki/Company/Legends",
  "/wiki/212th_Attack_Battalion/Legends",
  "/wiki/7th_Sky_Corps/Legends",
  "/wiki/Third_Systems_Army/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Gaftikar",
  "/wiki/Mirial/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Core_Conveyor",
  "/wiki/Starship/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Commando/Legends",
  "/wiki/Katarn-class_commando_armor",
  "/wiki/Jetpack/Legends",
  "/wiki/Fi_Skirata",
  "/wiki/Niner_Skirata",
  "/wiki/Jedi/Legends",
  "/wiki/Commander/Legends",
  "/wiki/General/Legends",
  "/wiki/Arligan_Zey",
  "/wiki/Darman_Skirata",
  "/wiki/2007",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Republic_Commando",
  "/wiki/Karen_Traviss",
  "/wiki/2009",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Databank_(original)",
  "/wiki/Standard_day/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Labyrinth_of_Evil"
 ]
}