{
 "name": "Barney",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Belderone"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance of Free Planets"
     ]
    }
   ]
  }
 ],
 "content": "Barney was a native of Belderone.\nBelderone was home to an All Terrain Armored Transport factory, which drew the attention of Alliance to Restore the Republic heroes Luke Skywalker and Leia Organa. As Barney and his best friend, Flint, tried to casually spy on Skywalker, a trio of Imperial assassins attempted to eliminate the Rebel crew. The two friends watched as Skywalker's skills helped him easily eliminate the assassins. Barney and Flint then decided to help the Rebels fight the Galactic Empire's presence on Belderone. However, the Empire did not attack the Rebel base on the neighboring world of Kulthis, as the Rebels had predicted. Instead, Sith Lord Darth Vader ordered an AT-AT assault on Barney's home village on Belderone itself. As the Rebels signaled their allies to attack the AT-ATs, Flint and Barney jumped in a landspeeder and sped toward their home town in hopes of warning the general populace, especially Flint's unaware mother. Unfortunately, Flint's piloting skills failed him and he crashed the craft just on the outskirts of the city, and Flint and Barney were both knocked unconscious.\nAfter the crash Barney was badly injured, while Flint was recruited by the Empire. Recovering, Barney continued working with the Alliance of Free Planets. Luke Skywalker trained a number of recruits, giving them standard Rebel training on the forest moon of Endor. Many of the trainees, including Barney, wanted to be trained as Jedi instead. Skywalker, however, refused to train them in the Force.\nBarney accompanied Skywalker and Organa on a mission to Naldar, to free the people from the Dark Lord of Belderone, who had conquered Naldar. It was revealed that the Dark Lord was in fact Barney's old friend, Flint. With the help of Barney, Skywalker was able to turn Flint from the Dark side of the Force.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Belderone/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Flint",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Kulthis",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Landspeeder/Legends",
  "/wiki/Zana",
  "/wiki/Endor/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Naldar",
  "/wiki/Subjugation_of_Naldar",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars_Annual_(1977)_3",
  "/wiki/Star_Wars_(1977)_92",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}