{
 "name": "Barokki",
 "display_name": "Barokki",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Barokki's division",
      "Imperial Officer Corps",
      "Barokki's division",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Barokki was a human male colonel that served in the Galactic Empire early during its reign.\nDuring the early rule of the Galactic Empire, Barokki served as an Imperial colonel with his own division and was part of the Imperial Officer Corps. Eventually, Barokki personally presented a report to Emperor Sheev Palpatine on the performance of his division. Dissatisfied with his division's performance, Darth Vader, Palpatine's enforcer, began to Force choke Barokki. After some time, Palpatine ordered Vader to release him, thanked Barokki for the report, and hoped that his division would demonstrate better performance in the following weeks.\nEventually, furious of Vader's quick rise to power and authority, Barokki and an accomplice, a fellow Imperial officer, decided to assassinate the Sith Lord. In the first attempt, a mercenary contract from Emperor Palpatine's office was sent to Chanath Cha, Ramat Cha, and Bhada Cha to kill Vader, and a Jedi sighting was faked at a bar on Cabarria. Vader was able to defeat the bounty hunters and discover that the contract originated from Palpatine's office.\nA second attempt was attempted on Vader's return to Coruscant in his personal starship. During Vader's arrival, he became aware of individuals with Level 1A1 and had access to the highest levels of the Imperial Executive Building, including Palpatine's office. The starship was then incorrectly identified as being part of a Separatist splinter cell and subsequently had its transmissions jammed. Unable to transmit the clearance codes, Vader's ship was targeted by a Coruscant Security Force missile platform. Vader's ship crashed on the surface of Coruscant but he, along with Ninth Sister, survived. Believing that it was Palpatine himself testing Vader's abilities, he confronted his Sith Master at the former Jedi Temple where he learned that it was not his master who was behind the attacks.\nAs Vader meditated to uncover the truth, Barokki met undercover with his fellow conspirator in The Room of Masks located in the Uscru District on Coruscant. There, Barokki was told by his accomplice that Vader had survived both attempts and that Vader was recently seen with Emperor Palpatine with no signs of abnormality. Barokki's accomplice believed that either Vader was not smart enough to find the trace to the Emperor's office, or they had an accommodation. Barokki was baffled by the relationship between Palpatine and Vader. After Barokki's co-conspirator complained about Vader's unexpected rise to power with no restrictions and wondered if he was a servant or bodyguard, Barokki responded that he believed it was something more, and informed his colleague that Palpatine had made Vader the leader of the Inquisitorius program. Barokki continued, stating that it didn't matter and that they couldn't stop their attempts to eliminate Vader, believing that clarification and better management would come after Vader was dealt with.\nAlthough Barokki's counterpart doubted that they could continue, Barokki persisted, and stated that Vader was either good, or lucky, or both, and that he would eventually die if they continued, as everything died. During Barokki's conversation with the other officer, Vader had a vision of the time he had Force chocked Barokki and understood that he was part of the assassination attempts. After Vader approached Palpatine with what he had learned, Palpatine called on the elite officers of the Imperial Officer Corps to an auditorium, including Barokki and his counterpart.\nThere, Palpatine stated that the officers would form the core of the Empire's efforts to bring peace to the galaxy, and understood that there were several elements of hierarchy that may confuse them, and that it was time to eliminate such thoughts. He then introduced Vader, stating that he was his voice, and that any command from Vader was a command of himself. Vader then called upon Corin Ferro, Zorta Bingan, Joon Strephi, Tomas Azoras, and Barokki, who began to grow nervous, to step forward. Vader then announced that he had been the target of two assassination attempts by members of the Imperial Officer Corps, and although he did not know the exact identities of his attackers, he had his suspicions. Vader continued, stating that it did not matter as he would always survive, and that every time he would survive. Vader then mentioned that the five of the officers, including Barokki, chosen at random would not, and Force choked them all to death. As Vader began to leave, Barokki's co-conspirator watched on.\nBarokki was a human male with red hair and light skin. Jealous of Darth Vader's unexpected rise to power in the Imperial hierarchy, Barokki took part in assassination attempts to eliminate Vader. Despite both attempts failing, Barokki believed that Vader would eventually die, as all things died, if they continued their plot against him. He did not have a regard on how Vader served Emperor Palpatine, and believed that everything would be clearer once Vader had been eliminated.\nAs an Imperial officer, Barokki was skilled enough to be considered an elite member of the Imperial Officer Corps, despite his division's poor performance. Barokki was able to work with his accomplice in setting up the conspiracy against Darth Vader and attempted to create tension between Palpatine and Vader by having the mercenary contract link to the Emperor's office, although all of his efforts were fruitless.\nAs a colonel in the Empire, Barokki donned an early version of the Imperial military uniforms. His cap contained an officer's disk and had a rank insignia plaque on the left side of his chest. When Barokki was undercover to meet his co-conspirator, he wore a helmet with a protrusion at the top and three stacked visors.\nBarokki first appeared, albeit unnamed, in the 2017 canon comic Darth Vader  8, and later identified in the 2018 Darth Vader  12. Both were written by Charles Soule and pencilled by Giuseppe Camuncoli.\nThere were several inconsistencies with Barokki's uniform. In The Dying Light, Part II, Barokki is depicted as being outfitted with a rank insignia plaque consisting of four red squares above four blue ones. In The Rule of Five, Part II, however, he is depicted as having six red squares above another six red squares, and later with at least five red squares above five blue squares.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/19_BBY",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Barokki%27s_division",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Colonel",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Division",
  "/wiki/Anakin_Skywalker",
  "/wiki/Force_choke",
  "/wiki/Time",
  "/wiki/Standard_week",
  "/wiki/Unidentified_Imperial_officer_(Coruscant)",
  "/wiki/Imperial_officer",
  "/wiki/Assassination_attempts_on_Darth_Vader",
  "/wiki/Sith_Lord",
  "/wiki/Mercenary",
  "/wiki/Chanath_Cha",
  "/wiki/Ramat_Cha",
  "/wiki/Bhada_Cha",
  "/wiki/Death",
  "/wiki/Jedi",
  "/wiki/Unidentified_bar_(Cabarria)",
  "/wiki/Cabarria",
  "/wiki/Bounty_hunter",
  "/wiki/Emperor%27s_office",
  "/wiki/Vader%27s_starship",
  "/wiki/Level_1A1",
  "/wiki/Imperial_Executive_Building",
  "/wiki/Starship",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Separatist_holdouts",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Unidentified_missile_platform",
  "/wiki/Ninth_Sister",
  "/wiki/Sith_Master",
  "/wiki/Imperial_Palace",
  "/wiki/Meditation",
  "/wiki/The_Room_of_Masks",
  "/wiki/Uscru_District",
  "/wiki/Bodyguard",
  "/wiki/Inquisitorius",
  "/wiki/Assassin",
  "/wiki/Officer",
  "/wiki/Corps",
  "/wiki/Coruscant_auditorium",
  "/wiki/The_galaxy",
  "/wiki/Corin_Ferro",
  "/wiki/Zorta_Bingan",
  "/wiki/Joon_Strephi",
  "/wiki/Tomas_Azoras",
  "/wiki/Color",
  "/wiki/Hair",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Hat",
  "/wiki/Officer%27s_disk",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Helmet",
  "/wiki/2017",
  "/wiki/Darth_Vader_(2017)_8",
  "/wiki/2018",
  "/wiki/Darth_Vader_(2017)_12",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Category:Images_of_Barokki",
  "/wiki/Darth_Vader_(2017)_21",
  "/wiki/Darth_Vader_(2017)_11"
 ]
}