{
 "name": "Barrison Draay",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3996 BBY",
      "Toprawa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Draay family",
      "Draay Trust",
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Arca Jeth"
     ]
    }
   ]
  }
 ],
 "content": "Barrison Draay was a male Human Jedi Knight during the time of the Great Sith War. He was the husband of Krynda Draay and the father of Lucien Draay.\nBefore joining the Jedi Order, Barrison was a financer who established the Draay Trust: A powerful holding company created to support non-Jedi Draays. He was a close friend of Haazen, his family steward, with whom he was a Padawan of Master Arca Jeth, and of Alok Adasca, head of Adascorp. Many people said he could not be a Jedi and still run the company or look after his workers, but he managed to do so.\nDuring their time as padawans, Haazen was often trying to capture a Nautolan smuggler named Dossa, but he failed each time. One time, Dossa blasted a pillar and made it come down on Haazen, but Barrison arrived and used the Force to suspend the pillar in the air, allowing Haazen to get out of the way. Also during their time as Padawans, the two of them became friends with another student: Krynda Hulis, padawan to Vodo-Siosk Baas. While both had feelings for her, Krynda only reciprocated Barrison's feelings.\nEventually, Barrison and Krynda were both knighted by Arca Jeth, the Jedi Master saying he was pleased that his doubts about Barrison had been proven wrong. Haazen came into the ceremony and asked why he wasn't knighted. Master Jeth said Haazen's lack of discipline and orbiting the successes of his friends while not furthering his skills meant he had failed as a Jedi. After Haazen shouted at Master Jeth and stormed off, Barrison followed him. Haazen accused him of using his money to ensure he would get both Knighthood and Krynda. Barrison punched him for saying that, but quickly regretted it. He said he wouldn't interfere with the Order's decision, but that he would try to find a way Haazen could still serve him.\nBarrison was able to find a way for Haazen to continue his work: Haazen became his assistant.\nBarrison became a great Jedi warrior and during the Great Sith War, won the Battle of Toprawa. During the war, Haazen was a body man, separating friendly from enemy bodies. After the Battle of Toprawa, Haazen was approached by Dossa, who was now allied with the Sith and offered Haazen to get him anything he wanted. Haazen said he wanted the life Barrison had, money, Krynda, everything. Dossa had Haazen lead Barrison and his company of Jedi into the Ansharii Caverns, under the pretense of a remaining Sith base. Dossa detonated a bomb, killing everyone but Haazen, who lost his right eye, arm and legs, however.\nAlthough a good fighter, Barrison lacked any type of precognitive abilities that his wife had. She would later blame this lack of foresight for his death. Years after his death, Haazen would later say that his son, Lucien, had the same qualities.\nUnfortunately, because of Barrison's death, Krynda was consumed by sorrow and guilt for not foreseeing the coming of the Sith War. After years of training new students, she eventually created a Covenant dedicated to preventing the rise of the Sith at any cost. However, Haazen had been manipulating everyone behind the scenes.\nLucien and his former Padawan Zayne Carrick dueled before Barrison's statue, which was damaged by orbital bombardment and collapsed on the former. Zayne then took the opportunity to impale the helpless Jedi. However, it turned to be a ruse to get close to Haazen to trust Zayne enough to let him get close to his gauntlet and cut it off. Lucien stated that his father would have never stood for what Haazen had done and used Haazen's dismembered mechanical hand to redirect Republic fire on the Estate. Lucien survived, despite the loss of his eyes. On a remote moon which Lucien bought, he assembled a True Covenant, combining both his parents beliefs, accepting that though prophecies can't be changed, they will at least endure as Jedi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3996_BBY",
  "/wiki/Toprawa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Draay_family",
  "/wiki/Draay_Trust",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Arca_Jeth",
  "/wiki/Haazen",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Krynda_Draay",
  "/wiki/Lucien_Draay",
  "/wiki/Master",
  "/wiki/Alok_Adasca",
  "/wiki/The_Adasca_BioMechanical_Corporation_of_Arkania",
  "/wiki/Nautolan/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Dossa",
  "/wiki/Vodo-Siosk_Baas",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Battle_of_Toprawa_(Great_Sith_War)",
  "/wiki/Sith/Legends",
  "/wiki/Ansharii_Caverns",
  "/wiki/Jedi_Covenant",
  "/wiki/Zayne_Carrick",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Gauntlet_of_Kressh_the_Younger",
  "/wiki/Dismemberment/Legends",
  "/wiki/True_Covenant",
  "/wiki/Knights_of_the_Old_Republic_9",
  "/wiki/Knights_of_the_Old_Republic_12",
  "/wiki/Knights_of_the_Old_Republic_18",
  "/wiki/Knights_of_the_Old_Republic_19",
  "/wiki/Knights_of_the_Old_Republic_20",
  "/wiki/Knights_of_the_Old_Republic_29",
  "/wiki/Knights_of_the_Old_Republic_31",
  "/wiki/Knights_of_the_Old_Republic_33",
  "/wiki/Knights_of_the_Old_Republic_35",
  "/wiki/Lost_Tribe_of_the_Sith:_Sentinel",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_Handbook",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}