{
 "name": "Barra-Rona-Ban",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Barra-Rona-Ban was a Cerean male Jedi Master who served the Jedi Order as the Chief Librarian of the Jedi Temple Archives in the years after the New Sith Wars. In 990 BBY, he was tricked by the Sith Lord Darth Zannah to allow her access to the Archives when she went to the Jedi Temple under the alias of Nalia Adollu, the Padawan learner of Ban's friend Anno Wen-Chii.\nA Force-sensitive Cerean male, Barra-Rona-Ban lived near the end of the New Sith Wars. Accepted into the Jedi Order, Ban befriended a fellow student, the Pyn'gani Anno Wen-Chii, during his training, and the two eventually visited Wen-Chii's homeworld, Polus. The Cerean ascended to the rank of Jedi Master and was made Chief Librarian of the Jedi Archives of the Jedi Temple on the planet Coruscant, maintaining offices in one of the Archives' main halls.\nIn 990 BBY, the Sith Lord Darth Zannah took up the alias of Nalia Adollu, Wen-Chii's Padawan learner, to infiltrate the Jedi Temple and research information about a disease that had befallen her Master, Darth Bane. Under her alias, she met with Ban, who granted her access to the Archives after exchanging some pleasantries with whom he believed to be the student of his old friend.\nA venerable and wizened Jedi Master with an eye for detail, Barra-Rona-Ban was made Chief Librarian of the Jedi Archives. His office was covered with journals, notes, and datacards, and the Cerean spent his time focusing his attention on the library. Ban was unable to recognize \"Adollu\" as the Sith she truly was and instead fell for her lies. While talking to the young woman, Ban was friendly and helped her in getting access to the Archives. Ban disliked snow and ice and did not plan to visit Polus again to see his old friend Wen-Chii.\nThe character Barra-Rona-Ban was created by author Drew Karpyshyn for his novel Darth Bane: Rule of Two, which was published in 2007. The Jedi Master later received an entry in The Complete Star Wars Encyclopedia .",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Cerean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Chief_Librarian/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/990_BBY",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Nalia_Adollu",
  "/wiki/Padawan/Legends",
  "/wiki/Anno_Wen-Chii",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Pyn%27gani",
  "/wiki/Jedi_training/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Polus",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Book/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Time/Legends",
  "/wiki/Library/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Water/Legends",
  "/wiki/Drew_Karpyshyn",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/2007",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/Gnost-Dural",
  "/wiki/3650_BBY",
  "/wiki/Restelly_Quist/Legends",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)"
 ]
}