{
 "name": "Barriss_Offee",
 "display_name": "Barriss Offee",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mirial"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.66 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Barriss Offee's Initiate clan",
      "Jedi assault team",
      "Barriss Offee's Initiate clan",
      "Jedi assault team",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Luminara Unduli"
     ]
    }
   ]
  }
 ],
 "content": "Barriss Offee was a female Mirialan Jedi Knight. She carried a blue lightsaber and trained as a Padawan under Jedi Master Luminara Unduli. Offee participated in the First Battle of Geonosis that began the Clone Wars and continued to serve alongside Unduli throughout the war. Offee preferred studying ancient Jedi texts to fighting. During her time as a Jedi Padawan, Offee struck up a friendship with Ahsoka Tano, the Padawan learner of Anakin Skywalker. Though rather different in personality, the two bonded through shared experience in combat, including at the Second Battle of Geonosis.\nAs the Clone Wars continued, Offee grew disillusioned with the Jedi's role in the wars, believing they had lost their way from the ideals that the Jedi Order was supposed to represent, and wary of the Jedi Council in particular. Deciding to act on her concerns, she orchestrated the bombing of the Jedi Temple as a means to foment further distrust of the Jedi. Despite their previous friendship, she allowed Tano to be framed for orchestrating the bombing, but ultimately confessed after being confronted by Anakin Skywalker, just before Tano was about to be convicted of the crime, even going as far to impersonate former Sith apprentice Asajj Ventress to frame her former friend. However, Skywalker ended up catching Offee and bringing her to justice, clearing his Padawan's name. Offee expressed her views of the Jedi Order in front of the tribunal, showing that she had been corrupted by the dark side before being taken away.\nSome time prior to the border dispute on Ansion, Barriss Offee, a female Mirialan, was born on the planet Mirial. She was found to be Force-sensitive and was brought into the Jedi Temple to train as a Jedi. She became Padawan to Jedi Master Luminara Unduli.\nAt some point, she studied lightsaber techniques with Tutso Mara, and the two grew to become close. At one point she was sent by Unduli to retrieve an old book. During the mission, she encountered a creature and many traps. When she finally reached the location of the book, she picked up the book and it turned to sand. Later, she returned and told her master that she had failed. Unduli told Offee that she did not fail because she never expected Offee to actually bring it back, that it was about the journey and everything she did to find the book.\nOffee, along with Unduli, sat in on a meeting between the Jedi Council and Supreme Chancellor Sheev Palpatine, who discussed the growing influence of the Secessionist Movement, and the threat of an imminent war between them and the Galactic Republic. After, Offee was present in Chancellor Palpatine's office with other senators and Jedi as the issue of whether Palpatine should take emergency powers was debated.\nLater, Offee, along with her master, were part of the Jedi assault team sent to rescue Senator Padmé Amidala, Jedi Knight Obi-Wan Kenobi, and his Padawan Anakin Skywalker from the execution arena on Geonosis. The Mirialan survived the battle, as did her master, though the Clone Wars had only just begun. After the battle, Offee had trouble sleeping and volunteered to watch over several injured Jedi in the Temple clinic, and due to what Jedi Master Depa Billaba later described as Offee's special attention, the injured were able to recover.\nFour months into the war, Offee and her master traveled to the planet Ilum, where Offee was to complete her final lightsaber. However, they became embroiled in a Separatist ambush. The Jedi Temple on Ilum was nearly destroyed during the engagement, but Offee and Unduli were saved by Grand Master Yoda. As her Master became a Jedi General, Offee did not go out to war with her and instead remained at the Jedi Temple on Coruscant and continued to volunteer in the medical clinic where she found solace in helping the injured Jedi.\nAround 21 BBY, Offee returned to her Master's side and accompanied her back to Geonosis in order to assist the forces of Anakin Skywalker, alongside his Padawan learner of almost the same age as Offee, Ahsoka Tano, to infiltrate a large Geonosian droid and weapons factory. Offee and her master found Tano and Skywalker arguing over their tactical strategy upon arrival, and Offee unintentionally annoyed Tano with her authoritative personality. Leaving their masters to launch a frontal attack, both Padawans sneaked through the Geonosian catacombs below in order to plant explosive grenades from within. They were, however, discovered by Poggle the Lesser and his Geonosian super tank. After Tano was rendered unconscious, Barriss was left with a choice: the bombs, or Tano's life. Ultimately, Offee and Tano decided to use the tank to destroy the reactor, knowing the explosion would kill them in the process. However, due to the tough exterior armor of the tank, both Padawans survived, much to the relief of their respective masters. Following their ordeal, Offee and Tano, having strengthened their bond, temporarily retired from the battlefield in order to recuperate.\nShortly after Offee and Tano recovered from their wounds, they were tasked with making a supply run to Mace Windu on Dantooine from a station near Ord Cestus aboard the medical frigate TB-73. Unknown to either Padawan, a swarm of Geonosian brain worms had been brought on board by infected clone trooper Scythe. Soon, the rest of the clones of Tango Company were infected. Offee was infected herself after she and Tano were separated. She proceeded to stalk her friend across the ship, attacking and nearly killing her with her lightsaber. Offee again chased Tano around the ship, but Tano escaped. Eventually, as the ship neared a medical station, Offee was freed from the parasite's brain control after Tano ruptured the coolant system, causing low temperatures that would kill the worms. Offee begged for Tano to kill her instead of letting her stay infected, but Tano sliced the parasite in half instead, freeing her friend. When the ship docked at the medical station, Both Tano and Offee were taken to the medical wing of the station by Jedi Master Kit Fisto to recover.\nAt some point, Offee was captured on the planet Felucia, but she was rescued by Jedi General Aayla Secura and Clone Commander CC-5052 \"Bly.\" Offee was present in the Jedi Temple on Coruscant when General Grievous sent a message to the Order, informing them of the capture of fellow Jedi Eeth Koth. Offee witnessed his brutal torture and left the room along with the younglings after they were dismissed by Master Yoda.\nAt some point in 21 BBY, shortly before Cato Parasitti's assassination attempt on Senator Padmé Amidala, Offee trained with Tano in the Jedi Temple. Offee was very critical of her friend's unorthodox fighting methods, stating that duels were meant to prepare Jedi for real encounters on the battlefield, and using non-traditional tactics served no purpose. Although Tano disagreed, the two acknowledged this difference in opinion as a result of their master's vastly different teaching style.\nDuring the Battle of Umbara, Offee flew her starfighter alongside her friend Tano and Republic forces attacking the Separatist blockade over the planet of Umbara. After the blockade was broken through, ground forces, including Anakin Skywalker and his 501st Legion as well as Jedi Master Obi-Wan Kenobi and his 212th Attack Battalion, were able to land onto the planet to combat the local resistance. Offee later attended the faux funeral of Master Kenobi after he was seemingly assassinated by bounty hunter Rako Hardeen.\nSometime later, Offee was promoted to Jedi Knight and the military rank of Jedi General. In these new positions, Offee spent most of her time in contemplation at the Jedi Temple on Coruscant. In the last year of the war, Offee's views on the Jedi and their role in the galaxy became distorted, and she eventually came to believe that both the Jedi and the Republic had lost their way. Offee came into contact with Letta Turmond, a Coruscanti who opposed the Jedi's involvement in the Clone Wars. Offee shared Turmond's beliefs and decided that it was time to make a statement against the Order. Showing Turmond how to use nano-droids as a bomb, Offee had Turmond feed the droids to her husband, Jackar Bowmani, a munitions expert at the Jedi Temple. The nano-droids exploded when Bowmani went into the Temple hangar, killing several Jedi, clones, civilians, and Republic military personnel.\nOffee attended the funeral for the fallen Jedi, which included her old friend Mara. Afterward, she Force choked Turmond in her prison cell before she could reveal Offee's involvement, allowing Tano to be accused of killing Turmond. She then pretended to help Tano investigate the murder via comlink, providing her false intel and leading her to an abandoned explosive warehouse containing crates of nano-droids, the same droids found at the scene of the crime. Offee then attacked Tano herself, disguised as former assassin Asajj Ventress.\nAfter Tano was discovered by Republic clones, she was blamed for the bombing and put back under containment. After a short Council meeting, Offee's former friend was expelled from the Jedi Order. Anakin Skywalker, angry and suspicious of his Padawan's expulsion, interrogated Ventress, who revealed that someone had stolen her lightsabers. Visiting Offee in her Temple chambers, Skywalker spoke to her, and then attacked her with her own lightsaber. Offee, in self-defense, used the Force to grab Ventress' lightsabers, which she had hidden in a nearby vase, thereby revealing herself. Though Offee was able to defend herself and stand her ground for a prolonged period of time, Skywalker captured her. Skywalker burst in during Tano's trial with Offee, who was handcuffed and being led by several Jedi Temple Guards, one of whom would eventually become the future Grand Inquisitor. Skywalker demanded that she tell the full truth; Offee admitted she did it because she had come to believe the Jedi were the ones responsible for the war, and that they were the real villains of the conflict. Offee claimed that the Jedi have become Sith-like, as if they were not like they used to be. Offee was then taken away while Tano was cleared of all charges. Tano was offered to return to the Order, but she refused and left, feeling betrayed by both the Order and her former friend.\nOffee's betrayal had a deep impact on Ahsoka Tano and the Jedi Order itself. Months after Offee's arrest, Ki-Adi-Mundi supported the idea of executing the fallen Jedi Quinlan Vos, citing Offee's treachery as a sign that the Jedi had a problem with traitors within their own ranks. Unduli was shaken by the betrayal of her Padawan, eventually seeking solace by turning her attention to repairing the damage Separatist attacks had brought to Kachirho on the planet Kashyyyk. Ultimately, she spent months preparing for the eventual Battle of Kashyyyk.\nEventually, the Jedi Order fell with the final stage of Darth Sidious' plans for the galaxy, and the Republic was transformed into the tyrannical Galactic Empire. One year into the reign of the Empire, Tano was still haunted by Offee's betrayal and later expressed her belief that while Offee's actions were wrong, she did have a point about the Jedi and the Republic, and that if they had truly listened to her, they might have been able to stop Darth Sidious before it was too late. Listening to what Tano had to say about her former friend, Senator Bail Prestor Organa took it to mean that, unlike people like Offee who focused on the past or those who would focus on the future, they needed to focus on the present.\nBarriss Offee was a Mirialan female who had brown-blackish hair and tattoos, blue eyes, olive skin, and a height of 1.66 meters. Offee was considered a seemingly ideal example of a Jedi Padawan by some members of the Order. She was an intelligent, daring and studious individual, able to memorize the entire layout of the system of Geonosian catacombs when her master asked her to. She was also quite selfless, as she pleaded with her friend Ahsoka Tano to kill her when she was being mind-controlled by a brain worm, though Tano refused.\nHowever, as the Clone Wars dragged on, Offee grew to believe that the Republic and Jedi Order were the ones responsible, viewing the latter's role in the war as a betrayal of the Order's ideals. Her growing disillusionment eventually led her to bomb the Jedi Temple, killing several civilians, clones and fellow Jedi, including her friend Tutso Mara. She even murdered her co-conspirator Letta Turmond to keep her betrayal a secret and framed her friend Tano for the deed. Reflecting on her former friend's actions, Tano believed Offee had been trying to convince her to have sympathy for her or outright convince her join together against the Jedi. However, she deemed the way Offee worked her into the plot, by framing her to take away her choices, to be the worst thing she could have done.\nIn doing all of this, however, she fell to the influence of the dark side; during her duel with Anakin Skywalker, he chastised her for not getting rid of Ventress' red lightsabers, to which she snidely responded, \"I think they suit me.\" When taken before the court, Offee finally confessed her crimes, thereby acquitting Tano, but nevertheless maintained her belief that the Jedi and the Republic had lost their way, expressing no remorse for bombing the Jedi Temple or framing Ahsoka, although a sad look given toward her friend indicated she at least regretted the rift these actions had now created between them.\nAs with any other Jedi, Barriss Offee was Force-sensitive. She was skilled in the use of telekinesis, enabling her to utilize Force push during battle. She was trained in Form III. She was also skilled in Jar'Kai; with Ventress' lightsabers, she was able to overwhelm Tano—who, at the time, had use of only one lightsaber. When she was against Skywalker and tapped into the dark side, Offee was able to duel Anakin on even footing for a time, but lost when Skywalker became angered and used the dark side himself, and Offee was distracted by presence of other Jedi. Stass Allie passed on healing expertise to Offee. She also had some piloting skills, which she demonstrated during the Battle of Umbara.\nAs a Padawan, Offee wore a hybrid Mirialan-Jedi Padawan outfit including a black robe and a dark blue cape. She carried a blue-bladed lightsaber before eventually using Ventress's red lightsabers.\nOffee was portrayed in Star Wars: Episode II Attack of the Clones by Nalini Krishan. She was voiced by Meredith Salenger in the 2008 Star Wars: The Clone Wars TV series.\nOffee was introduced in the novel The Approaching Storm, which was written by Alan Dean Foster. Offee was also featured widely in a number of other Expanded Universe products, in which she eventually advanced to the rank of Jedi Knight and was also a noted healer, but these have been re-branded as Star Wars Legends, and details found within them cannot be considered canon. Offee was originally meant to have been depicted in Star Wars: Episode III Revenge of the Sith being killed as part of Order 66, but this scene was cut along with the deaths of Luminara Unduli and Shaak Ti. A non-canon animatic was made of Offee's death showing her on Felucia fighting battle droids at the time of Order 66 when an AT-TE walks up behind her and shoots her. Interestingly, toward the end of this animatic her lightsaber was depicted as being green. Unused footage from Attack of the Clones was going to be used for this appearance. Her scrapped death in Episode III would later be incorporated into the third issue of the Legends Revenge of the Sith comic adaptation.\nOffee was originally written to die in \"The Wrong Jedi,\" but Dave Filoni \"had plans\" for the character and cut the scene. The 2018 reference book Star Wars: The Dark Side later stated that Offee had been acting as a double agent for the Sith, but the episode itself established that she was acting out of a hate for the dark side, despite tapping into it herself. This article assumes \"The Wrong Jedi\" is correct. Additionally, a Star Wars: Card Trader Iconic Moments card about Offee's fall claimed it was a result of a serum that changed the Force inside of her. However, Leland Chee stated the card was never approved by his team.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Barriss_Offee",
  "/wiki/Barriss_Offee/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Barriss_Offee",
  "/wiki/Mirial",
  "/wiki/Mirialan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Barriss_Offee%27s_Initiate_clan",
  "/wiki/Jedi_assault_team",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Luminara_Unduli",
  "/wiki/Jedi_Knight",
  "/wiki/Lightsaber",
  "/wiki/Padawan",
  "/wiki/Jedi_Master",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Ahsoka_Tano",
  "/wiki/Anakin_Skywalker",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/Jedi_High_Council",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Imperial_Palace",
  "/wiki/Sith_apprentice",
  "/wiki/Asajj_Ventress",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/File:Barriss_Offee_during_a_dangerous_mission.jpg",
  "/wiki/Time",
  "/wiki/Border_dispute_on_Ansion",
  "/wiki/Ansion",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_training",
  "/wiki/Tutso_Mara",
  "/wiki/Book",
  "/wiki/Sab%C3%A9",
  "/wiki/File:FiveFamousJediContinueToFailToDetectTheSith-AotC.jpg",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Separatist_Crisis",
  "/wiki/Chancellor",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Petranaki_Arena",
  "/wiki/Geonosis",
  "/wiki/Sleep",
  "/wiki/Jedi_Temple_medical_bay",
  "/wiki/Depa_Billaba",
  "/wiki/Standard_month",
  "/wiki/Ilum",
  "/wiki/Barriss_Offee%27s_lightsaber",
  "/wiki/Ambush_at_Ilum",
  "/wiki/Jedi_Temple_(Ilum)",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Jedi_General",
  "/wiki/File:OldThumbnail-Weapons-Factory.png",
  "/wiki/21_BBY",
  "/wiki/Geonosian",
  "/wiki/Droid",
  "/wiki/Geonosis_primary_droid_foundry",
  "/wiki/Geonosian_catacombs",
  "/wiki/Grenade",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Super_tank",
  "/wiki/Tank_(vehicle)",
  "/wiki/Death",
  "/wiki/File:BarrissInfected-BrainInvaders.jpg",
  "/wiki/Mace_Windu",
  "/wiki/Dantooine",
  "/wiki/Ord_Cestus",
  "/wiki/Pelta-class_frigate",
  "/wiki/TB-73",
  "/wiki/Brain_worm",
  "/wiki/Clone_trooper",
  "/wiki/CT-9544",
  "/wiki/Cloning",
  "/wiki/Tango_Company",
  "/wiki/Temperature",
  "/wiki/Kit_Fisto",
  "/wiki/Felucia",
  "/wiki/General",
  "/wiki/Aayla_Secura",
  "/wiki/CC-5052",
  "/wiki/Jedi_temple",
  "/wiki/Coruscant",
  "/wiki/Grievous",
  "/wiki/Capture_of_Eeth_Koth",
  "/wiki/Eeth_Koth",
  "/wiki/Torture",
  "/wiki/Jedi_Initiate",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Cato_Parasitti",
  "/wiki/Assassin",
  "/wiki/Lightsaber_duel",
  "/wiki/File:BarrissOffee-SWZ.png",
  "/wiki/Battle_of_Umbara",
  "/wiki/Barriss_Offee%27s_Delta-7B_Aethersprite-class_light_interceptor",
  "/wiki/Umbara_blockade",
  "/wiki/Umbara",
  "/wiki/Blockade",
  "/wiki/501st_Legion",
  "/wiki/212th_Attack_Battalion",
  "/wiki/Umbaran_Militia",
  "/wiki/Funeral_of_Obi-Wan_Kenobi",
  "/wiki/Bounty_hunter",
  "/wiki/Rako_Hardeen",
  "/wiki/File:BarrissDisguised-TCWs5BR2.png",
  "/wiki/The_galaxy",
  "/wiki/Letta_Turmond",
  "/wiki/Coruscanti",
  "/wiki/NM-K_reconstitutor",
  "/wiki/Jackar_Bowmani",
  "/wiki/Funeral_of_the_Jedi_Temple_bombing_victims",
  "/wiki/Force_choke",
  "/wiki/Comlink",
  "/wiki/Abandoned_munitions_warehouse",
  "/wiki/File:BarrissInCourt-TWJ.png",
  "/wiki/Duel_at_the_Jedi_Temple",
  "/wiki/Asajj_Ventress%27s_lightsabers",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Stuncuffs",
  "/wiki/Jedi_Temple_Guard",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Sith",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Death_penalty",
  "/wiki/Quinlan_Vos",
  "/wiki/Kachirho",
  "/wiki/Kashyyyk",
  "/wiki/Battle_of_Kashyyyk",
  "/wiki/Order_66",
  "/wiki/Darth",
  "/wiki/Grand_Plan",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Era",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Hair",
  "/wiki/Tattoo",
  "/wiki/Eye",
  "/wiki/Dark_side_of_the_force",
  "/wiki/Telekinesis",
  "/wiki/Force_push",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Form_III",
  "/wiki/Jar%27Kai",
  "/wiki/Stass_Allie",
  "/wiki/Force_healing",
  "/wiki/Pilot",
  "/wiki/Clothing",
  "/wiki/Cloak",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Nalini_Krishan",
  "/wiki/Meredith_Salenger",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Approaching_Storm",
  "/wiki/Alan_Dean_Foster",
  "/wiki/Star_Wars_Legends",
  "/wiki/Jedi_healer/Legends",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Shaak_Ti",
  "/wiki/All_Terrain_Tactical_Enforcer",
  "/wiki/Star_Wars:_Episode_III_%E2%80%94_Revenge_of_the_Sith_3",
  "/wiki/Star_Wars:_Episode_III_%E2%80%94_Revenge_of_the_Sith",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Dave_Filoni",
  "/wiki/2018",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Attack_of_the_Clones_Read-Along_Storybook_and_CD",
  "/wiki/Queen%27s_Hope",
  "/wiki/A_Jedi%27s_Duty",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Weapons_Factory",
  "/wiki/Legacy_of_Terror",
  "/wiki/Brain_Invaders",
  "/wiki/Grievous_Intrigue",
  "/wiki/The_Deserter",
  "/wiki/Darkness_on_Umbara",
  "/wiki/Deception",
  "/wiki/Star_Wars:_Forces_of_Destiny%E2%80%94Ahsoka_%26_Padm%C3%A9",
  "/wiki/Sabotage_(episode)",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/To_Catch_a_Jedi",
  "/wiki/Destiny_(episode)",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Gone_with_a_Trace",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Ahsoka_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Tales_from_Wild_Space:_The_Journey",
  "/wiki/Star_Wars_Adventures_(2017)_20",
  "/wiki/The_Lost_Stories,_Part_3",
  "/wiki/Star_Wars_Adventures_(2017)_32",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Barriss_Offee",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_72",
  "/wiki/Star_Wars_Helmet_Collection_77",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Delta-7_Aethersprite_Expansion_Pack",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Coruscant_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Pelta-class_Frigate_Expansion_Pack",
  "/wiki/Venator-class_Star_Destroyer_Expansion_Pack",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Mace_Windu_and_Other_Force_Users",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Exegol,_the_Unknown_Regions,_and_Wild_Space",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Databank_(website)",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/January_31",
  "/wiki/2020",
  "/wiki/Star_Wars:_The_Complete_Saga",
  "/wiki/November_2",
  "/wiki/2007",
  "/wiki/File:CardTraderBarrissApproval.png"
 ]
}