{
 "name": "Barrow_Oicunn",
 "display_name": "Barrow Oicunn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Republic Navy",
      "Galactic Republic Navy",
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Barrow Oicunn was a male human who served as an officer in the Navy of the Galactic Republic, and then later in that of the Galactic Empire. Although fully committed to the cause of the Republic, Oicunn viewed it as weak. As a lieutenant, he participated in the Battle of Coruscant, which the Republic won. After the Clone Wars came to an end, the Republic was replaced by the Galactic Empire. As Oicunn's devotion had been noticed by Emperor Palpatine, he was made one of the first Imperial officers to serve on one of the Venator-class Star Destroyers tasked with protecting the top-secret project known as the Death Star.\nBarrow Oicunn was a Human male who served in the navy of the Galactic Republic during the Clone Wars against the Confederacy of Independent Systems. He participated in the Battle of Coruscant, in which the Separatist Navy launched an attack on the planet Coruscant, capital of the Republic, but were ultimately defeated by the Republic forces.\nLater that year, the Confederacy was defeated and the Clone Wars came to an end, after which the Republic transitioned into the Galactic Empire under Galactic Emperor Sheev Palpatine. Oicunn became a captain in the Imperial Navy's officer corps, and with his devotion having been noted by the Emperor, he was selected as one of the first Imperial officers to serve aboard one of the Venator-class Star Destroyers tasked with protecting the top-secret Imperial project to construct the Death Star superweapon.\nOicunn at one point worked in one of the crew pits of the Star Destroyer's bridge while Palpatine, Sith Lord Darth Vader, and Governor Wilhuff Tarkin oversaw the Death Star's construction through the bridge's viewport. The captain at some point piloted a VT-49 Decimator for the Empire against an X-wing starfighter, destroying the enemy fighter above a terrestrial body.\nAlthough fully committed to the cause of the Republic, Oicunn viewed it as weak. His devotion was enough to be noticed by the Emperor. Oicunn had light skin, brown hair, and blue eyes.\nWhile serving the Empire, Oicunn wore a gray Imperial officer's uniform including a cap with an officer's disk. The uniform also included black boots, black gloves, and a black belt also bearing a disk. He bore a rank insignia plaque with four blue squares upon his left breast. He piloted a VT-49 Decimator.\nBarrow Oicunn first appeared in the prequel trilogy film Star Wars: Episode III Revenge of the Sith, which was released on May 19, 2005. Oicunn's scene was filmed September 17, 2003 at Fox Studios, Sydney. Only one of the bridge's two crew pits was created for the set, with a different frame range of the footage of Oicunn and other characters in the pit then being mirrored with some small alterations for the one shot showing the second pit in the film.\nIn the current Star Wars canon, the character was first identified in the mobile card game Star Wars: Force Collection, which initially launched in 2013. Although the launch of Force Collection predates the Star Wars canon reset of 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon. The name originated in the Star Wars Legends continuity, where the surname Oicunn was first used for the character in Dressing a Galaxy: The Costumes of Star Wars, a reference book written by Trisha Biggar and published on October 11, 2005. The first name Barrow was then provided by James Floyd to Daniele F. for use in an entry to the StarWars.com Hyperspace feature, \"What's The Story?\" which was published on November 18, 2005.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Barrow_Oicunn",
  "/wiki/Barrow_Oicunn/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Officer",
  "/wiki/Imperial_Navy",
  "/wiki/Lieutenant",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Imperial_officer",
  "/wiki/Unidentified_Venator-class_Star_Destroyer_(Death_Star)",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Project_Stardust",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Confederacy_of_Independent_Systems_Navy",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Capital",
  "/wiki/Republic_Military",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Captain",
  "/wiki/Superweapon",
  "/wiki/Star_Destroyer",
  "/wiki/Bridge_(starship)",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Death_Star",
  "/wiki/Viewport",
  "/wiki/Pilot",
  "/wiki/VT-49_Decimator",
  "/wiki/X-wing_starfighter",
  "/wiki/Starfighter",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Hat",
  "/wiki/Officer%27s_disk",
  "/wiki/Boot",
  "/wiki/Glove",
  "/wiki/Belt",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Breast",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/May_19",
  "/wiki/2005",
  "/wiki/September_17",
  "/wiki/2003",
  "/wiki/Fox_Studios,_Sydney",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/2013",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars_Legends",
  "/wiki/Dressing_a_Galaxy:_The_Costumes_of_Star_Wars",
  "/wiki/Trisha_Biggar",
  "/wiki/October_11",
  "/wiki/James_Floyd",
  "/wiki/Daniele_F.",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/November_18",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Galactic_Empire_Conversion_Kit",
  "/wiki/VT-49_Decimator_Expansion_Pack_(X-Wing:_Second_Edition)",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/The_Making_of_Star_Wars_Revenge_of_the_Sith",
  "/wiki/Creating_the_Worlds_of_Star_Wars:_365_Days",
  "/wiki/In-universe",
  "/wiki/April_24",
  "/wiki/2022",
  "/wiki/Star_Wars:_Blogs"
 ]
}