{
 "name": "Barratk'l",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuzzem"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Golden"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order",
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Barratk'l was a female Yuzzem Jedi Master of the New Jedi Order and member of the Jedi High Council in 44 ABY.\nAt some point in her life, Barratk'l was badly wounded in her throat. While the damage was being repaired, she requested that her vocal cords be thinned, allowing her speech to be more understandable to other species. A line of white fur marked the scar on her throat.\nBarratk'l was stationed on Nal Hutta when she was recalled to Coruscant and asked to join the Jedi High Council, after being nominated by acting Grand Master Kenth Hamner. She accepted, and attended a Council meeting after Galactic Alliance Chief of State Natasi Daala refused to release Jedi Knights Valin and Jysella Horn from carbonite even after the Force psychosis that had been affecting several Jedi in the order had been seemingly cured with the death of Abeloth at the hands of exiled Grand Master Luke Skywalker. When Hamner insisted that the Jedi do their best to avoid confrontation with the forces of the Galactic Alliance, Barratk'l supported him along with Cilghal and Kam and Tionne Solusar. The meeting was soon interrupted by Jedi Knight Leia Organa Solo and her husband Han Solo, who informed the Council about a force of Mandalorians sent to repress a slave protest on Blaudu Sextus.\nAfter Master Saba Sebatyne explained the relationship between the Octusi and their masters, Barratk'l questioned Hamner after he wondered how the semi-sentient Octusi were able to understand the ways they were not free, asking him if he thought slavery was acceptable if the slaves were unable to realize they were enslaved. Hamner told her that she should know better than that, he pointed out a Octusi in a hologram of the protest holding a sign with chains on it, despite the fact the Octusi were never enslaved with chains. Barratk'l and the rest of the Council pondered what this meant, and Hamner suggested that the anti-slavery organization Freedom Flight might be behind it. Barratk'l defended the organization, and denied suspicion from the other Council members that she was assisting Freedom Flight. She was grateful to Hamner after he told the others that he doubted she was involved with them. Barratk'l and the rest of the Council decided to send Jedi Knights Sothais Saar and Avinoam Arelis to Blaudu Sextus in order to end the revolt and discover who had incited it before the Mandalorians put it down forcefully, in order to prevent a massacre and make sure the Octusi and their masters worked things out peacefully.\nNot long after, Barratk'l attended another Council meeting where Jedi Knight Jaina Solo and Lando Calrissian arrived on Coruscant to brief them on her mission in the Maw assisting Grand Master Skywalker, Jedi Knight Ben Skywalker, and their Sith \"allies\". When Jedi Solo informed them that she and Calrissian had been attacked by Sith pirates on their way back to Coruscant, Barratk'l suspected that the Skywalkers had been betrayed and killed, but Jedi Solo informed her that they were still alive. She then showed them information gathered by Jedi Knight Jaden Korr on a series of pirate attacks and missing ships, some of which had been in possession of the Sith. Jedi Master Corran Horn studied the map and information further, and informed Barratk'l and the rest of the Council that the Sith had gathered a large war fleet.\nWhen the Council went out onto Pinnacle Platform to welcome back the Jedi Knights who had contracted the Force psychosis and had been sent to Shedu Maad, they were interrupted when the situation on Blaudu Sextus worsened. They gather around a datapad and watched as Mandalorian commander Belok Rhal and his forces carried out a massacre on the planet, including killing reporter Madhi Vaandt, who had been covering the story. Jedi Saar and Arelis stopped the massacre and captured the Mandalorians, going against their orders to end the revolt. Barratk'l and the other masters, with the exception of Hamner, decided that it was the will of the Force that had changed the Jedi's mission, and that they should support a galaxy wide slave revolt. Hamner insisted that it was an unwise decision that would cause Daala to think the Jedi had betrayed the Galactic Alliance, but Han Solo revealed the deal that Hamner had made with Admiral Nek Bwua'tu to prevent Daala from attacking and the Jedi from launching their StealthX wing to assist Grand Master Skywalker until the situation between the Order and Daala had been worked out. Barratk'l and the rest of the Council were angry with Hamner for not revealing this to them, and relieved him of his position as acting Grand Master and his seat on the Council.\nAs the Council prepared to launch the StealthX wing to assist Grand Master Skywalker, Barratk'l was one of four Council members leading the wing. However, she would be taking five other Jedi to rendezvous with Jedi Saar and Arelis, in order to assist the several slave revolts occurring throughout the galaxy. Before they could launch, Master Hamner confronted them, demanding they cease their actions, believing them to be treason. They told Hamner that he no longer had any power, and had lost their confidence by hiding his deal with Bwua'tu. Hamner insisted they listen to him because Grand Master Skywalker had appointed him as the acting Grand Master, but Barratk'l told him that he had been the only one that Daala would agree to, and asked him if he had ever considered why that was. Hamner counted that he had expected more from her, and that she placed little value in loyalty. She countered back that her loyalty was to the Order, not him, and told the other Masters that they must begin preparing to launch now, before they missed their opportunity to launch. Barrakt'l and the other Masters then headed toward their ships as Master Sebatyne and Hamner began dueling. They were able to launch but Sebatyne was forced to kill Hamner to prevent him from sabotaging the hangar controls.\nMaster Barratk'l met up with Jedi Knights Sothais Saar and Avinoam Arelis and another five Jedi Knights. They worked for a month helping those that were slaves, until the call came for everyone to be ready and meet. Her team also came home and worked alongside Jedi and the G.A. to free Coruscant of Sith.\nIn 44 ABY the Jedi Order withdrew from the Galactic Federation of Free Alliances and moved their base of operations to the mining world of Shedu Maad in the Transitory Mists which separates the GA from the Hapes Consortium.\nShe was also at the Wedding of Jagged Fel and Jaina Solo.\nDespite her fearsome appearance, Barratk'l was thought by Kenth Hamner to have a large amount of patience and good-natured common sense.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Yuzzem",
  "/wiki/Gender/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/44_ABY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Kenth_Hamner",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Valin_Horn",
  "/wiki/Jysella_Horn",
  "/wiki/Carbonite/Legends",
  "/wiki/Force_psychosis",
  "/wiki/Abeloth",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Cilghal",
  "/wiki/Kam_Solusar",
  "/wiki/Tionne_Solusar",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Blaudu_Sextus",
  "/wiki/Saba_Sebatyne",
  "/wiki/Octusi",
  "/wiki/Sentience/Legends",
  "/wiki/Freedom_Flight",
  "/wiki/Sothais_Saar",
  "/wiki/Avinoam_Arelis",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Mission_to_the_Maw",
  "/wiki/The_Maw/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Jaden_Korr",
  "/wiki/Corran_Horn",
  "/wiki/Pinnacle_Platform",
  "/wiki/Shedu_Maad",
  "/wiki/Datapad/Legends",
  "/wiki/Belok_Rhal",
  "/wiki/Madhi_Vaandt",
  "/wiki/Nek_Bwua%27tu",
  "/wiki/StealthX",
  "/wiki/Treason/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Transitory_Mists",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/Wedding_of_Jagged_Fel_and_Jaina_Solo",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/43_ABY",
  "/wiki/Kyp_Durron",
  "/wiki/Kyle_Katarn",
  "/wiki/Octa_Ramis"
 ]
}