{
 "name": "Barrut",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "aboard the Fortitude",
      "Ikkrukk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "First Order military",
      "First Order military"
     ]
    }
   ]
  }
 ],
 "content": "Barrut was a human female who served as a colonel in the First Order military during the war between the First Order and the Resistance. In 34 ABY, the colonel was in command of the Maxima-A class heavy cruiser Fortitude, and attacked the planet Ikkrukk.\nBy 34 ABY, Colonel Barrut served the First Order. Sometime after the evacuation of D'Qar, Barrut was assigned the Maxima-A class heavy cruiser the Fortitude to go to Ikkrukk and take it over. However, the Ikkrukkians refused to leave their homeworld in their hands, so she ordered to attack Grail City, the capital. Although the Ikkrukkians under the command of Prime Minister Grist activated the deflector shields over the city in time, Barrut and her fellows had the help of a group of First Order sympathizers, who killed the engineers, deactivating them. As the Black Squadron, a starfighter squadron which served the Resistance and was send to Ikkrukk by General Leia Organa to search allies following the collapse of the New Republic, Barrut supervised the battle from the Fortitude, assuring her lieutenant that it was just a matter of time to win the battle. Upon realizing the presence of Black Squadron, she ordered them to be shot down, promising to put the pilots in commendations if they managed to destroy the X-wing starfighters before the shield could be reactivated.\nShortly afterwards, sometime after the Battle of Crait, Wing Commander Poe Dameron, Black Squadron's Black Leader, arrived to the scene aboard a starfighter and blew up one of the turrets of the Fortitude. Upon witnessing this, Barrut ordered her lieutenant to communicate her with Dameron, informing the pilot that if he wanted to negotiate it would have been before attacking them. The pilot responded that he didn't wanted to negotiate and revealed himself to Barrut, who dismissed his claims, assuring him that Poe Dameron was killed during the evacuation of D'Qar, but Dameron immediately told her that her people lied to her and that he wasn't dead and neither was the Resistance, taking the opportunity to reveal to her that Supreme Leader Snoke, his flagship the Supremacy, twenty other Star Destroyers and the Fulminatrix had all been obliterated, leading Barrut's crew to question if General Armitage Hux was leading the First Order. Furious, Barrut replied to her crew that Dameron must have lied about their losses, ordering them to shoot down Dameron. As such, Dameron performed an special maneuver with his teammates and got several TIEs destroyed, which in turn damaged the Fortitude, causing Barrut to order her lieutenant a damage report. However, the shield over Grail City was gone down, leading Barrut to order fire on the city given that their bombardment cannons were still online. But it was too late for that. With Black Squadron's help, Prime Minister Grist activated the city's defensive systems and fired on the Fortitude, destroying it and killing Barrut in the process.\nA female human, Barrut served the First Order military, holding the rank of colonel and commanding the Fortitude. Barrut had no qualms on taking over Ikkrukk even if that meant killing thousands of innocents.\nBarrut was confident that they would win the battle over Grail City. She had her men in high esteem, promising her pilots to put them on commendations if they managed to shoot down Black Squadron.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/34_ABY",
  "/wiki/Fortitude",
  "/wiki/Ikkrukk",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/First_Order",
  "/wiki/First_Order_military",
  "/wiki/Unidentified_First_Order_lieutenant",
  "/wiki/Colonel",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Resistance",
  "/wiki/Maxima-A_class_heavy_cruiser",
  "/wiki/Battle_of_Grail_City",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/D%27Qar",
  "/wiki/Ikkrukkian",
  "/wiki/Homeworld",
  "/wiki/Grail_City",
  "/wiki/Capital",
  "/wiki/Prime_Minister",
  "/wiki/Grist",
  "/wiki/Deflector_shield",
  "/wiki/City",
  "/wiki/Ikkrukk_First_Order_sympathizers",
  "/wiki/Engineer",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Starfighter",
  "/wiki/Squadron",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/New_Republic",
  "/wiki/Pilot",
  "/wiki/X-wing_starfighter",
  "/wiki/Battle_of_Crait",
  "/wiki/Wing_Commander",
  "/wiki/Poe_Dameron",
  "/wiki/Black_Leader",
  "/wiki/Unidentified_starfighter",
  "/wiki/Turret",
  "/wiki/Death",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Flagship",
  "/wiki/Supremacy",
  "/wiki/Star_Destroyer",
  "/wiki/Fulminatrix",
  "/wiki/Armitage_Hux",
  "/wiki/Military_rank",
  "/wiki/Poe_Dameron_30",
  "/wiki/Poe_Dameron_31"
 ]
}