{
 "name": "Barshnis Choard",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shelkonwa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Barshnis Choard was the Human male Imperial Governor of Shelsha sector in 0.5 ABY. He had broad shoulders, black hair, and a bad temper. He had a son named Crayg.\nChoard was involved in a plot to declare the independence of the entire Shelsha sector. Although the exact details of the masterminding of this plot remain foggy due to the shifting allegiance of Choard, Vilim Disra and Caaldra, an associate of his in the BloodScar pirates and by Disra's manipulation of the whole plot in particular, Choard was a willing participant. His actions were uncovered by a combination of Disra's betrayal of the plot as a political power play, and the investigations of Emperor's Hand Mara Jade and the Hand of Judgment .\nThough Jade originally ordered the governor's execution, a delay caused by Marcross in which Choard almost managed to escape and confusion sown by Caaldra resulted in the decision to let Choard stand a public trial for his treason against the Galactic Empire.\nChorad was highly ambitious and hoped to gain a great deal of power through his plot to take over the Shelesa sector. As could be easily seen, he was not scrupulous as to the methods he used to gain power. He was easily angered by problems, but was also highly prone to manipulation by someone who knew the proper ways to do so, as Disra found out.\nAlthough listed as a governor, his position as head of a sector seems more fitting for someone with a title of Moff; however, several comparisons of these ranks are made in reference to Choard, and the error may have been an intentional statement of rank, even if a seeming continuity contradiction. However, it is possible for one to hold the post of Sector Governor without having been given the dignity of Moff and he was Governor of a somewhat unimportant sector.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Shelkonwa",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Shelsha_sector",
  "/wiki/0_ABY/Legends",
  "/wiki/Crayg_Choard",
  "/wiki/Vilim_Disra",
  "/wiki/Caaldra",
  "/wiki/BloodScar",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Hand_of_Judgment",
  "/wiki/Saberan_Marcross",
  "/wiki/Skirmish_on_Shelkonwa",
  "/wiki/Treason/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Allegiance_(novel)",
  "/wiki/Allegiance_(audiobook)",
  "/wiki/Choices_of_One",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}