{
 "name": "Bartle",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Coruscani ogre"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Almost 3 meters"
     ]
    }
   ]
  }
 ],
 "content": "Bartle was a male Coruscani ogre who resided on the planet Coruscant during the last years of the Galactic Republic. In around 31 BBY, Bartle and his Human associate Ilok witnessed a speeder crash in the Coruscant undercity that caused great damage to their neighborhood and the pair confronted a group of spacers who they believed were responsible for the collision.\nBartle was a male Coruscani ogre who lived in the undercity of the planet Coruscant, during the latter years of the Galactic Republic. Around 31 BBY, Bartle and his Human acquaintance Ilok witnessed a speeder piloted by a group of Believer Sith-worshipping cultists collide with a building in the Coruscant undercity and ignite a fire. The Coruscani ogre and his companion joined a crowd of angry local residents who gathered at the scene, disgruntled by the destruction that had been wrought to their neighborhood by the crash.\nA team of spacers in pursuit the cultists arrived at the wrecked speeder in the wake of the crash and Ilok and Bartle confronted them, suspecting the spacers of responsibility for the collision. A fight soon erupted and at Ilok's command, Bartle and three Trandoshan thugs from the crowd assisted the Human with attacking the spacers. However Ilok, Bartle and the Trandoshans were defeated and the spacers departed to resume tracking the Believers.\nBartle stood at just under three meters in height and he had the appearance of cross between a rancor— a type of large, predatory reptomammal— and a Gungan, an aquatic sentient species from the planet Naboo. He had no ears and a long sloped snout, similar to that of a Gungan. As was common for Coruscani ogres, his body was covered by scars and burns, intermixed by a scattering of blotches of fur. Bartle was capable of speech and spoke a language that his Human associate Ilok could comprehend. At the time of the Believers' speeder crash in the Coruscant undercity, he wore a loincloth as his solitary item of clothing.\nThough he had a threatening appearance, Bartle was not as fearsome as he looked. During his encounter with the Believer-hunting spacers, the Coruscani ogre was confused and just wanted to please Ilok, so he did as the Human commanded him. In combat, Bartle could fight by throwing objects but preferred to just wade into a brawl and batter his adversaries directly.\nBartle was created by Morrie Mullins and appeared in Coruscani Dawn a 2002 roleplaying adventure that formed part of the Living Force campaign and debuted at the fan convention Celebration II.\nIn Coruscani Dawn, the player characters roleplay as the spacers that Bartle and his associate Ilok encounter. It is possible for the players to pacify Ilok and Bartle peacefully via diplomacy or a mind trick; alternatively the standoff can escalate into a fight. If the player characters are in the middle or upper roleplaying experience tiers, Ilok and Bartle are joined in the brawl by a trio of Trandoshan thugs, otherwise the pair fight alone. At the discretion of the gamemaster, the player co-ordinating the role-playing game, it is possible for Bartle to grow bored and stop fighting or for him to develop a sudden fear of lightsaber weapons, if any of the spacers are armed with such a blade. If so, Ilok shouts at Bartle and is momentarily distracted, allowing the player characters to escape. It is possible instead for Bartle to be incapacitated or killed as a result of the fight. The adventure also advises that if the players are short of time, the encounter with Ilok and Bartle can be omitted entirely from the adventure.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscani_ogre",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Ilok",
  "/wiki/Speeder/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Pilot/Legends",
  "/wiki/Believers",
  "/wiki/Sith/Legends",
  "/wiki/Sith_cult/Legends",
  "/wiki/City/Legends",
  "/wiki/Fire/Legends",
  "/wiki/Coruscani_Dawn",
  "/wiki/Canon",
  "/wiki/Sith_Cultist",
  "/wiki/Trandoshan/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Reptomammal/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Water/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Ear/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Language/Legends",
  "/wiki/Loincloth",
  "/wiki/Clothing/Legends",
  "/wiki/Morrie_Mullins",
  "/wiki/2002",
  "/wiki/Roleplaying_game",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Celebration_II",
  "/wiki/Mind_trick/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Death/Legends",
  "/wiki/Time/Legends",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Belly_of_the_Beaast",
  "/wiki/The_New_Essential_Guide_to_Alien_Species"
 ]
}