{
 "name": "Barthalemew Windsloe",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 25 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Barthalemew Windsloe was a male Human and Rebel Alliance sympathizer who lived during the Galactic Civil War. He pretended to be a wealthy playboy on the planet Ord Sabaok around 0 ABY and used 'friendly' card games with Imperial Navy officers to learn information about the Galactic Empire.\nBy 0 ABY Windsloe lived on the planet Ord Sabaok in the Core Worlds and became a key figure among the social elite there. He would regularly spend his evenings in exclusive clubs, where he would play card games against Imperial Navy officers. The officers would sometimes discuss military and political matters and Windsloe would note down anything useful to the Alliance that he heard. He would compile this information into periodic reports and then beam them to a cargo freighter that made weekly runs through Ord Sabaok. The freighter's captain would then pass this information on to Alliance Intelligence.\nWinsloe was handsome, charming and vain, which made him popular among the social elites of Ord Sabaok. He was also a good listener and a great joker. However, he was also more serious and intelligent than he let on to his Imperial companions.\nAs a full-time gambler Windsloe was quite skilled at both gambling and bluffing.\nWindlose was quite wealthy and had ready access to 25,000 credits that he used for gambling. Befitting a playboy he had several suits of the most fashionable clothing and he always carried around a Sabacc deck.\nBarthalemew Windsloe was designed by Paul Sudlow for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Mike Vilardi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/25_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ord_Sabaok",
  "/wiki/0_ABY/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sabacc/Legends",
  "/wiki/Paul_Sudlow",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Mike_Vilardi",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}