{
 "name": "Bartol",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  }
 ],
 "content": "Bartol was a human boy who lived in an agricultural colony on the planet Sedri Minor during the High Republic Era. He had friends named Reff and Julus. Bartol encountered Jedi Knight Keeve Trennis in a field of Vratixian barley while she was investigating there.\nBartol and Trennis walked through the barley together and came upon a hole in the ground. Bartol, without a second thought, jumped into the hole, and Trennis used the Force to guide him to a safe landing. The hole led to an underground tunnel, and at the end they came upon the bodies of Ceret and Bartol's friend Julus. Ceret was still alive, but Julus was not so lucky. With further investigation Trennis discovered that Ceret had a plantlike substance in his head. While she was distracted with Ceret, Bartol was grabbed by the leg by one of the plantlike appendages in the tunnel. Trennis cut Bartol loose and was confronted by the Drengir. Ceret, who was possessed by the Drengir, grabbed Bartol while Trennis was busy fighting with her lightsaber. Just when all seemed lost, Jedi Master Avar Kriss came through the top of the tunnel and cut the Drengir in half. Bartol and Trennis were saved and Ceret was free of the Drengir. However, before they could escape, more Drengir appeared with Jedi Master Sskeer now under their control.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Planet",
  "/wiki/Sedri_Minor",
  "/wiki/High_Republic_Era",
  "/wiki/Reff",
  "/wiki/Julus",
  "/wiki/Jedi_Knight",
  "/wiki/Keeve_Trennis",
  "/wiki/Vratixia_renanicus",
  "/wiki/Mission_to_Sedri_Minor",
  "/wiki/The_Force",
  "/wiki/Ceret",
  "/wiki/Drengir",
  "/wiki/Jedi_Master",
  "/wiki/Avar_Kriss",
  "/wiki/Sskeer",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Bartol",
  "/wiki/The_High_Republic_(2021)_2",
  "/wiki/The_High_Republic_(2021)_3",
  "/wiki/The_High_Republic_(2021)_4",
  "/wiki/The_High_Republic_(2021)_5",
  "/wiki/The_High_Republic_(2021)_7",
  "/wiki/Category:Images_of_Bartol"
 ]
}