{
 "name": "Basal Moor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Basal Moor was an Alliance Intelligence operative who was rescued from TransGalMeg Industries, Incorporated headquarters on Pako Ramoon by the Xi'Dec extraction agents K'lial and Diskio Khzrry. The details of his successful extraction were given in a report written by Rebel agent Kara Via, which General Airen Cracken attached to the dossier on the Khzrrys included in Cracken's Rebel Operatives.\nBasal Moor had been assigned to infiltrate TransGalMeg Industries, Incorporated's headquarters, a mission which carried significant risk of capture. Accordingly, the Khzzrys were assigned as backup in case Moor was apprehended. When Moor fell into the hands of TGM's security, the Khzzrys entered the headquarters on a rescue mission.\nUsing their usual cover as family recruiters, the Khzzrys approached the security guards who were escorting Moor through the lobby of the headquarters. K'lial evaded the guards to put two of its left arms around Moor, claiming that the two Xi'Dec wished to invite Moor to join their family unit, and tried to lead him away to discuss matters in private. Via later surmised that K'lial probably slipped the codekeys to Basal's arm restraints out of the lead guard's pockets at this point.\nThe guards were confused by K'lial's matrimonial interest in a Human, not to mention the fact that K'lial and its spouse Diskio did not appear to be the same species either  Via presumed that during this conversation, K'lial freed Moor from his restraints.\nEventually, the guards gave up on the conversation, and attempted to arrest both Xi'Dec. Diskio, however, had used a remote control unit to signal its ground speeder under the pretense of calling a matrimonial lawyer. The speeder crashed through the lobby window as Diskio pulled out two concealed blasters and began to lay down cover fire. The three Rebels entered the vehicle and made their getaway.\nAs the speeder drove out of the lobby, K'lial stuck its head out out the outer hatch and announced that Moor had accepted the \"proposal.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/TransGalMeg_Industries,_Incorporated",
  "/wiki/Pako_Ramoon",
  "/wiki/Xi%27Dec/Legends",
  "/wiki/K%27lial_Khzrry",
  "/wiki/Diskio_Khzrry",
  "/wiki/Kara_Via",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Stun_cuffs",
  "/wiki/Marriage/Legends",
  "/wiki/Species/Legends",
  "/wiki/Landspeeder/Legends",
  "/wiki/Lawyer/Legends",
  "/wiki/Blaster/Legends"
 ]
}