{
 "name": "Bathos",
 "display_name": "Bathos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Cadriaan"
     ]
    }
   ]
  }
 ],
 "content": "Bathos was the High Lady of Tapani House Cadriaan around during the Galactic Civil War. She was born into one of the lesser noble families of House Cadriaan, but rose in society through a series of shrewd marriages. Bathos' last husband was the former High Lord who lived long enough to allow her to build her own powerbase and successfully claim the leadership after his death.\nLady Bathos maintained her position through her talent for building strong alliances with a selection of different organizations and individuals. She fostered friendships with prominent titled commoners who were impressed by her good business sense. The High Lady also had a personality cult with the house military. However, she was not universally liked and there were several Cadriaan lords and ladies who considered their claim to the house leadership more legitimate. Bathos was aware of these threats from within and was careful to protect her flanks.\nThe High Lady maintained a sprawling garden paradise on Procopia called the Alaphoe Gardens located on Lalos Island. She entertained lavishing at the gardens and during Capital Season everybody who was or intended to be somebody tried to be seen at her parties.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_Cadriaan",
  "/wiki/High_Lord",
  "/wiki/Tapani",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Procopia/Legends",
  "/wiki/Alaphoe_Gardens",
  "/wiki/Lalos_Island",
  "/wiki/Capital_Season",
  "/wiki/Lords_of_the_Expanse",
  "/wiki/Player%27s_Guide_to_Tapani"
 ]
}