{
 "name": "Batono",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Czerka Corporation",
      "Chodo Habat's herd"
     ]
    }
   ]
  }
 ],
 "content": "Batono was a Human male and a former employee of Czerka Corporation. He disagreed with many of their practices and began to seek shelter with the Ithorians on Citadel Station. The leader of the Ithorians, Chodo Habat, put Batono in a secure apartment.\nUnluckily for Batono, both Czerka and the Telos Security Force were after him. Czerka wanted to silence him while the TSF wanted him to testify against Czerka before the Telosian Council. Eventually, Dol Grenn would hire the services of Meetra Surik, who quickly found where Batono had gone.\nWhen he was found, Batono was very resistant to leaving his apartment, though Surik persuaded him to come and testify against Czerka. Batono agreed and he left with Surik, only to run into two of Czerka's mercenaries, which Surik defeated handily. Batono was handed to the TSF safely and he thanked Surik. Grenn then gave 300 credits to Surik.\nAlternatively, for the dark side choice, the player can kill Batono and go to Jana Lorso to claim the reward of 200 credits for his elimination.\nIt is also possible for the player to find Batono, go to Jana Lorso and inform her of this, and she arranges for some mercenaries to \"take care of him\" when the player returns to Batono and convinces him to leave the safety of his apartment.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Chodo_Habat%27s_herd",
  "/wiki/Jana_Lorso",
  "/wiki/Ithorian/Legends",
  "/wiki/Citadel_Station",
  "/wiki/Chodo_Habat",
  "/wiki/Telos_Security_Force",
  "/wiki/Telosian_Council",
  "/wiki/Dol_Grenn",
  "/wiki/Meetra_Surik",
  "/wiki/Mercenary/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords"
 ]
}