{
 "name": "Bava",
 "display_name": "Bava",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Bava was a male Yuuzhan Vong who caught Sal Ghator stealing from the Extolled's crops. After the Yuuzhan Vong War, he was allowed to live on Zonama Sekot, where he attempted to build a community in La'okio.\nIn 35 ABY, Bava took his complaint of Ghator and his fellow ex-warriors to one of the Jedi Knight overseers of Zonama Sekot, Tahiri Veila. When Ghator told Bava and Veila that nothing would grow in their own section of the village  because Yun'o had disgraced them . Ghator had blamed this on the former heretics for their downfall by the end of the war. Bava rebutted this argument by reminding Ghator that it was the late Supreme Overlord Shimrra Jamaane who almost led the Yuuzhan Vong to ruin via the war with his own heresy and, because of the former warriors' unwillingness to change, it was now the warriors who were the new Shamed Ones, rather than the Extolled. For this, Ghator smacked Bava across the face, something that Tahiri Veila would have been unable to stop even if she wanted; she had wanted to subtly remind Bava that trying to cast the former Yuuzhan Vong warriors as new Shamed Ones was one of their previous society's negative attributes that they needed to move beyond.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Sal_Ghator",
  "/wiki/Extolled",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Zonama_Sekot/Legends",
  "/wiki/La%27okio",
  "/wiki/35_ABY/Legends",
  "/wiki/Warrior_caste",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Tahiri_Veila",
  "/wiki/Yun%27o",
  "/wiki/Jeedai_heresy",
  "/wiki/Supreme_Overlord",
  "/wiki/Shimrra_Jamaane",
  "/wiki/Shamed_Ones",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Bava",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}