{
 "name": "Baze Malbus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Jedha"
     ]
    },
    {
     "name": "Born",
     "values": [
      "53 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Scarif"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.80 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Guardians of the Whills",
      "Partisans",
      "Alliance to Restore the Republic",
      "Rogue One",
      "Rogue One"
     ]
    }
   ]
  }
 ],
 "content": "Baze Malbus was a human male born on the desert moon of Jedha fifty-three years before the Battle of Yavin. Once a devoted member of the Guardians of the Whills, Malbus became a freelance assassin during the age of the Galactic Empire. Nevertheless, he maintained a deep friendship with Chirrut Îmwe, who also served with the Guardians. Following the destruction of Jedha City, Malbus and Îmwe became part of the Rebel group known as Rogue One. After Îmwe's death in an explosion during the Battle of Scarif, Malbus rushed the Imperial death troopers with his MWC-35c \"Staccato Lightning\" repeating cannon and was killed by a C-25 fragmentation grenade.\nBaze Malbus was a human male born in 53 BBY on the desert moon of Jedha who joined the Guardians of the Whills alongside Chirrut Îmwe, his close friend since childhood. As members of the religious order, they were tasked with guarding the Temple of the Kyber in Jedha City.\nIn the aftermath of the Proclamation of the New Order, the holy city of NiJedha was occupied by the armed forces of the Galactic Empire. The harsh conditions of Imperial occupation transformed Malbus into a cynical soldier. Although Baze lost his faith in their religion, he remained lifelong friends with the spiritual Îmwe despite their differences.\nBy 0 BBY, approximately two decades into the Age of the Empire, Malbus and Îmwe encountered Jyn Erso and Captain Cassian Andor of the Rebel Alliance in NiJedha. During the ensuing insurgent attack on Imperial troops, Îmwe came to Erso and Andor's aid and defeated a group of stormtroopers, leading Malbus to shoot several more troopers in order to protect his blind comrade. The two friends and their Rebel acquaintances were subsequently captured and taken to the Catacombs of Cadera by Saw Gerrera's followers. Imprisoned with Andor while Jyn spoke with Gerrera, Andor recognized the Imperial defector Bodhi Rook, whom he had been tasked with locating. When the Death Star obliterated NiJedha, Andor managed to free Malbus along with Îmwe, telling Malbus to free Rook as he left to locate Jyn. Malbus obliged and rendezvoued with his new rebel comrades, who barely escaped the blast zone in Andor's ship.\nMalbus and Îmwe followed the Rebels on their mission to Eadu—the location of Galen Erso, Jyn's father and the chief scientist responsible for the creation of the Empire's new battle station. When Îmwe decided to follow Andor and Rook, who had gone to \"look around,\" Malbus followed his friend out of the ship. The assignment led to a firefight between Imperial and Alliance forces, resulting in the death of the elder Erso. Malbus and Îmwe both fired on stormtroopers and Imperial fighters as they tried to make their escape. After the battle, Malbus accompanied his allies to the Alliance headquarters on Yavin 4.\nShortly after their arrival, Jyn Erso made an unsuccessful attempt to persuade the Alliance leaders in sending a fleet to Scarif, believing her late father's revelation that a fatal flaw in the Death Star's design could be found in its schematics. In spite of the Alliance leadership's unwillingness to act, Erso was joined by Malbus, Îmwe, and a group of soldiers in an unsanctioned mission to Scarif. The newly formed Rogue One successfully infiltrated the Imperial stronghold, but were forced to fight a battle against the planet's garrison while Erso and Andor searched for the plans in the Imperial security complex. During the battle, Malbus and his squad fired on the garrison that was deployed to combat them before fleeing from a All Terrain Armored Cargo Transport. Malbus would later fire on the walker but failed to bring it down. However, the transport was then destroyed by a T-65B X-wing starfighter.\nAs the battle wore on and their squad suffered heavy losses, Malbus and the others were tasked with helping Rook make contact with the Alliance Fleet. Îmwe sacrificed his life to help deactivate the planetary deflector shield to allow the signal through, causing Malbus to begin repeating his good friend's mantra. After witnessing the explosion of SW-0608 in the distance, Malbus proceeded to kill several death troopers, maintaining the offensive and ultimately gunning them all down. Malbus himself was later killed by a grenade from a fallen trooper, but before he died, Malbus was able to glance at Chirrut's body for one last time. Though the remaining members of Rogue One also perished, their sole mission ended in the successful transmission of the Death Star plans to the Alliance Fleet.\nBaze Malbus was a human male who stood at 1.80 meters. He had brown eyes, long black hair, and tan skin. Unlike the deeply spiritual Chirrut Îmwe, whom he regarded as his best friend and moral compass, Malbus had lost his sense of spirituality, including his belief in the Force, as a result of enduring the harsh conditions of Imperial occupation on Jedha. In contrast to Îmwe, Malbus developed a pragmatic viewpoint but ultimately reaffirmed his faith in the Force after his friend's death on Scarif.\nMalbus was highly adept at long-range combat. His preferred weapon was the MWC-35c \"Staccato Lightning\" repeating cannon, and he was strong enough to operate it with relative ease, utilize it with expert marksmanship, although it was a weapon not designed for handheld operation.\nMalbus utilized a MWC-35c \"Staccato Lightning\" repeating cannon.\nBaze Malbus is portrayed by Jiang Wen in the Star Wars Anthology Series film Rogue One: A Star Wars Story. Wen's casting in the film was first announced on August 15, 2015. At this time, the first photo of the character was released as well. The first footage of the character was shown in the Rogue One teaser trailer on April 7, 2016.\nBaze and Chirrut replaced another pair featured in early treatments of the story—that of the aliens Senna and Lunak. Lunak was cut entirely from the final version of the movie, while Senna eventually became the mercenary Moroff.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Guardians_of_the_Whills_(novel)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Jedha",
  "/wiki/53_BBY",
  "/wiki/0_BBY",
  "/wiki/Scarif",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Guardians_of_the_Whills",
  "/wiki/Partisans",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rogue_One",
  "/wiki/Desert",
  "/wiki/Moon",
  "/wiki/Battle_of_Yavin",
  "/wiki/Assassin",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Chirrut_%C3%8Emwe",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Jedha_City",
  "/wiki/Death",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_trooper",
  "/wiki/Baze%27s_repeating_cannon",
  "/wiki/C-25_fragmentation_grenade",
  "/wiki/Reproduction",
  "/wiki/Temple_of_the_Kyber",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/City",
  "/wiki/Imperial_Military",
  "/wiki/Soldier",
  "/wiki/Standard_decade",
  "/wiki/Jyn_Erso",
  "/wiki/Captain",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Battle_on_Jedha",
  "/wiki/Troop",
  "/wiki/Stormtrooper",
  "/wiki/Trooper",
  "/wiki/Catacombs_of_Cadera",
  "/wiki/Saw_Gerrera",
  "/wiki/Bodhi_Rook",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Mission_to_Eadu",
  "/wiki/Eadu",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Parent",
  "/wiki/Scientist",
  "/wiki/Battle_station",
  "/wiki/Alliance_Military",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/All_Terrain_Armored_Cargo_Transport",
  "/wiki/Alliance_Cabinet",
  "/wiki/Navy",
  "/wiki/Death_Star_plans",
  "/wiki/Planet",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/Garrison",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Deflector_shield",
  "/wiki/SW-0608",
  "/wiki/Grenade",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/The_Force",
  "/wiki/MWC-35c_%22Staccato_Lightning%22_repeating_cannon",
  "/wiki/Jiang_Wen",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/August_15",
  "/wiki/2015",
  "/wiki/April_7",
  "/wiki/2016",
  "/wiki/Alien",
  "/wiki/Lunak",
  "/wiki/Mercenary",
  "/wiki/Moroff",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Lost_Stars_(webcomic)",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Guardians_of_the_Whills:_The_Manga",
  "/wiki/Star_Wars:_Boots_on_the_Ground",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_1",
  "/wiki/Rogue_One_Adaptation_2",
  "/wiki/Rogue_One_Adaptation_3",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Rogue_One_Adaptation_5",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/LEGO_Star_Wars_Movie_Short",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Images_of_Baze_Malbus",
  "/wiki/StarWars.com",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Rogue_One",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_169",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Art_of_Coloring:_Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Top_Trumps",
  "/wiki/Top_Trumps:_Star_Wars:_Rogue_One",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Rebel_Alliance_Conversion_Kit",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_56",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Star_Wars_Helmet_Collection_77",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/The_Heroes_of_Rogue_One",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Databank_(website)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_-_The_Official_Mission_Debrief",
  "/wiki/The_Art_of_Rogue_One:_A_Star_Wars_Story"
 ]
}