{
 "name": "Bazine Netal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chaaktil"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "55 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Delphi Kloda's combat school"
     ]
    }
   ]
  }
 ],
 "content": "Bazine Netal was an alias used by a human female mercenary. Born on the Inner Rim world Chaaktil, she was raised in an orphanage and began training under the former Kanjiklub pirate Delphi Kloda at his  combat school. Eventually, she became a bounty hunter and eventually killed her former mentor Kloda during a mission. She was present in Takodana Castle approximately thirty years after the Battle of Endor. Netal informed the First Order of the presence of BB-8 in Kanata's castle.\nThe human who later adopted the alias Bazine Netal was born on the Inner Rim planet Chaaktil with a name that she later kept secret. As a child, she was taken from an orphanage in Chaako City by Delphi Kloda and raised in Kloda's combat school, where she learned a range of deadly martial arts. There, Kloda nicknamed her \"Chaakrabbit.\"\nReaching fourteen years of age, Kloda sent her to steal an item from one of his competitors. This was quickly discovered by her mark, who singed the inexperienced learner with a flamethrower. Despite this, she was able to kill her attacker and complete her goal, though she was left with burn scars on the left side of her scalp.\nThereafter, \"Chaakrabbit\" became a feared bounty hunter and master of disguise, learning from teachers other than Kloda as well. At some point, she adopted the pseudonym \"Bazine Netal.\" She based her operations on Chaaktil around Suli's cantina.\nSix years after leaving Chaako City, Netal received an assignment from an anonymous client. Her assignment was to retrieve a steel case which was in the possession of former Imperial stormtrooper Jor Tribulus. Netal's client warned her that a competitor known as \"Narglatch\" would also be hunting for the case.\nNetal visited Kloda in order to borrow his ship, the Sparrowhawk. Kloda leant her the vessel on the condition that she take Kloda's student, the skilled Pantoran slicer Orri Tenro, along on her mission as a part of his training. Reluctantly, Netal agreed, hoping that Tenro's slicing ability would outweigh the risk he posed to her mission. As they left for the planet Vashka, Tenro proved to be incompetent with anything aside from computers.\nOn Vashka, Netal and Tenro infiltrated the medcenter where Tribulus was most recently recorded as a patient. There they were able to learn the location of Tribulus's retirement facility. Before disembarking for that site, Netal injected Tenro with a poison which rendered him unconscious.\nNetal discovered that the retirement home had been overtaken by apidactyls. She made her way inside the building by distracting the apidactyls with a thermal detonator. There she met Aric Nightdrifter, a retired stormtrooper who had been living in the building, and he led her to Tribulus's remains.\nNetal was taken by surprise when Kloda appeared and revealed that he was Narglatch, and he had raised Netal for the sole purpose of sending her after the case in order to steal it himself. After taking the case from Tribulus's corpse and disarming Netal, Kloda trapped Netal in the grave of apidactyl wax and escaped.\nUsing the materials Nightdrifter had buried with Tribulus, Netal was able to escape the building. She threw a detonator ahead of Kloda's narglatch, creating a hole in the ground and trapping Kloda. After a brief struggle, Netal killed Kloda and returned to the Sparrowhawk with the case.\nDuring the First Order's conflict with the Resistance, Netal served as a spy with a direct line to the First Order. Located at Maz Kanata's castle on Takodana, Netal posed as Grummgar's girlfriend.\nAs the Millennium Falcon's captain Han Solo arrived there with the fugitives Rey, Finn, and BB-8 in 34 ABY, she informed the Order of the wanted droid's sighting, just as a Resistance-sympathetic spy informed its organization likewise. Soon, the First Order military assaulted the site, ultimately sparking the first battle of the First Order-Resistance War.\nLater, Netal was hired by a employer to search for the Millennium Falcon. She heard a rumor that IG-88 nearly caught it, so she met with IG-88 to discuss about the Millennium Falcon. During their discussion, IG-88 told Netal the story of when he almost caught the Falcon with Agent Kallus. IG-88 also told Netal that he almost had the Millennium Falcon again, but the bounty hunter Boba Fett got to Solo and the Falcon first. Netal responded that IG-88 had a lot of excuses and that her employer only paid for results. Before she left to continue her search, Netal informed IG-88 that someone knew where the Falcon was and that they would tell her where it was.\nNetal later met with two droids, Doc and Teetee. They told Netal a story of when they encountered the Millennium Falcon on Lotho Minor. After the story, Netal told them that it wasn't even close to what she wanted. When she asked where she could find the Falcon, the pair didn't know as they hadn't seen it since Lotho Minor. Netal became angry but Teetee said that he knew the bounty hunter Embo had come into contact with her quarry. Netal left the droids and went to find Embo.\nNetal made her way to Felucia where she found Embo. Knowing that Embo's funding from the New Republic had stopped, she made a deal with the Kyuzo where in exchange for credits, he would give her information she needed, about his encounter with the Millennium Falcon. After Embo told Netal a story of when he failed to capture the Falcon on a space station not long after the Battle of Endor, Netal questioned why it had been so hard to capture one ship. Following Embo's response, Netal replied that she would do more than try and capture it, she would succeed. After paying Embo the credits they agreed upon, he told her that he had heard the ship had surfaced somewhere. Finding the information from Embo interesting, Netal added that if there was anyone that wanted to capture the Falcon as much as her employer, it would be \"her\". Netal then set off for her next destination.\nAfter arriving on Corellia, Netal captured one of the most skilled White Worms children so she could talk to Lady Proxima about the Millennium Falcon. She threatened to kill Proxima and the skilled child if she didn't tell her about the Millennium Falcon. Proxima told Netal a story of when Han returned to Corellia for parts for the Millennium Falcon. During this, Moloch, who served the White Worms, captured Han and Chewbacca and brought them to Proxima. Proxima told Han he would be punished because he owed her coaxium and had given her face scars from the sunlight. Chewbacca gave Han a thermal detonator which he used to explode the window which brought in sunlight. The sunlight damaged Proxima's face again and blinded her right eye as Han and Chewbacca made their escape. After the story, Netal became frustrated about that they did not capture the Millennium Falcon. Proxima suggested that Netal visit Gannis Ducain on Jakku, as she understood he had gotten his hands on the Falcon at one point.\nNetal found Ducain and was told his story of how he stole the Falcon from Solo and its time with him, ultimately learning that Ducain was trying to return it to Solo, before the Irving Boys stole it from him. After the story, Ducain left to join the Resistance and Netal became mad. As she left, Proxima contacted Netal saying that she had found the Falcon and that Netal should find Hondo Ohnaka on Batuu with it.\nBazine Netal was intelligent and calculating, traits that served her well in her job. She was also elusive, as she was skilled at playing lowly aliens and would not reveal her past to anyone. She was extremely secretive and tended to work alone.\nBazine Netal was a human female who stood at 1.7 meters. She had black hair, dark eyes, and fair skin.\nNetal used Rishi eel ink to conceal her fingerprints. She also kept several small thermal detonators inside the hollow wedges of her boots.\nBazine Netal first appeared in the short story \"The Perfect Weapon,\" written by Delilah S. Dawson. She was portrayed by Anna Brewster in Star Wars: Episode VII The Force Awakens.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lando%27s_Luck",
  "/wiki/Flight_of_the_Falcon,_Part_5:_Grand_Theft_Falcon",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Pirate%27s_Price",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Bazine_Netal",
  "/wiki/Chaaktil",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Delphi_Kloda%27s_combat_school",
  "/wiki/Mercenary",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Kanjiklub",
  "/wiki/Pirate",
  "/wiki/Delphi_Kloda",
  "/wiki/Bounty_hunter",
  "/wiki/Death",
  "/wiki/Mission_to_Vashka",
  "/wiki/Takodana_Castle",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/First_Order",
  "/wiki/BB-8",
  "/wiki/Maz_Kanata",
  "/wiki/Reproduction",
  "/wiki/Youngling",
  "/wiki/Chaako_City_orphanage",
  "/wiki/Chaako_City",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Chaakrabbit",
  "/wiki/Delphi_Kloda%27s_competitor",
  "/wiki/Flamethrower",
  "/wiki/Teacher",
  "/wiki/Suli%27s_cantina",
  "/wiki/City",
  "/wiki/Steel",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper",
  "/wiki/Jor_Tribulus",
  "/wiki/Narglatch",
  "/wiki/Starship",
  "/wiki/Sparrowhawk",
  "/wiki/Pantoran",
  "/wiki/Slicer",
  "/wiki/Orri_Tenro",
  "/wiki/Vashka",
  "/wiki/Computer",
  "/wiki/Vashka_City_Medcenter_One",
  "/wiki/Vashka_Valley_Retirement_Facility_48",
  "/wiki/Poison",
  "/wiki/Vashkan_apidactyl",
  "/wiki/Thermal_detonator",
  "/wiki/Aric_Nightdrifter",
  "/wiki/Wax",
  "/wiki/Detonator",
  "/wiki/Cold_War",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Takodana",
  "/wiki/Grummgar",
  "/wiki/Millennium_Falcon",
  "/wiki/Captain",
  "/wiki/Han_Solo",
  "/wiki/Rey_Skywalker",
  "/wiki/Finn",
  "/wiki/34_ABY",
  "/wiki/Droid",
  "/wiki/First_Order_military",
  "/wiki/Battle_of_Takodana",
  "/wiki/First_Order-Resistance_War",
  "/wiki/IG-88B",
  "/wiki/Agent",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Boba_Fett",
  "/wiki/Doc",
  "/wiki/Teetee",
  "/wiki/Lotho_Minor",
  "/wiki/Embo",
  "/wiki/Felucia",
  "/wiki/New_Republic",
  "/wiki/Kyuzo",
  "/wiki/Credit",
  "/wiki/Unidentified_space_station_(Lando_Calrissian)",
  "/wiki/Corellia",
  "/wiki/White_Worms",
  "/wiki/Lord",
  "/wiki/Proxima",
  "/wiki/Moloch",
  "/wiki/Chewbacca",
  "/wiki/Coaxium",
  "/wiki/Eye",
  "/wiki/Gannis_Ducain",
  "/wiki/Jakku",
  "/wiki/Time",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Batuu",
  "/wiki/Alien",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Hair",
  "/wiki/Rishi_eel_ink",
  "/wiki/Boot",
  "/wiki/The_Perfect_Weapon",
  "/wiki/Delilah_S._Dawson",
  "/wiki/Anna_Brewster",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/5-Minute_Star_Wars_Villain_Stories",
  "/wiki/Lando%27s_Luck_(audiobook)",
  "/wiki/The_Perfect_Weapon_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens_(Golden_Book)",
  "/wiki/Chaos_at_the_Castle",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_3",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Flight_of_the_Falcon,_Part_1:_Spy_Games",
  "/wiki/Star_Wars_Adventures_(2017)_14",
  "/wiki/Flight_of_the_Falcon,_Part_2:_The_Planet_of_Misfit_Droids",
  "/wiki/Star_Wars_Adventures_(2017)_15",
  "/wiki/Flight_of_the_Falcon,_Part_3:_Home_Again",
  "/wiki/Star_Wars_Adventures_(2017)_16",
  "/wiki/Flight_of_the_Falcon,_Part_4:_Lady_and_the_Tramp",
  "/wiki/Star_Wars_Adventures_(2017)_17",
  "/wiki/Star_Wars_Adventures_(2017)_18",
  "/wiki/Pirate%27s_Price_(audiobook)",
  "/wiki/Star_Wars_Adventures:_Flight_of_the_Falcon",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Ultimate_Sticker_Collection:_Star_Wars:_The_Force_Awakens",
  "/wiki/The_Art_of_Star_Wars:_The_Force_Awakens",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Empire_at_War_(Star_Wars:_Destiny)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/StarWarsKids.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Saga_of_Rey",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Tobias_Beckett_and_Other_Characters_From_the_Underworld",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Bazine_Netal",
  "/wiki/Star_Wars:_The_Force_Awakens:_Head-to-Head",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu"
 ]
}