{
 "name": "Bazzra",
 "display_name": "Bazzra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "dark side hellscape"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Knights of Ren",
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "Bazzra was a Force-sensitive Twi'lek female who served as a member of the Knights of Ren during the reign of the Galactic Empire. Between 3 ABY and 4 ABY, Bazzra accompanied the Knights as they undertook a heist at Fortress Vader on behalf of Lady Qi'ra, the leader of Crimson Dawn.\nSometime prior to the last years of the Galactic Civil War, Bazzra became a member of the Knights of Ren. Bazzra and the knights followed the dark side of the Force and an ideology based on the red-bladed lightsaber called Ren while they were lead by an individual of the same name. During the Imperial Era, the knights remained in hiding on multiple backwater planets to avoid the Galactic Empire.\nBazzra and the knights were eventually recruited by Lady Qi'ra to join Crimson Dawn and help her defeat the Empire. At Qi'ra request, the knights were tasked with infiltrating Fortress Vader in order to recover the Screaming Key from Vader's vault. After the Night Buzzard arrived on the Gahenn Plains of the planet Mustafar which was where Fortess Vader was located. The knights went towards the Fortess from the south on their speeder bikes. They arrived at an old entrance to the Sith cave which was was covered behind flowing lava, leaving Bazzra and the knights to use the Force in order to get past the lava flow and enter the cave.\nAs they entered the cave, Bazzra noticed what appeared to be a helmet lying on the floor. After the mask, which seemed to still have a Sith Lord's severed head inside, activated in front of Bazzra, she blasted the artifact out of panic. Through the cave, the knights made their way to the castle, where they encountered Vaneé, who called various Lava Troopers when the knights attacked him. Bazzra and the knights killed most of the trooper while Ren entered Vader's vault and stole the Screaming Key. Unfortunately, the knights were soon met with the arrival of Darth Vader himself, who quickly killed one of the knights while Ren told the rest of them to run while he engaged on duel with the Sith Lord. After Ren managed to flee the duel, the knights quickly escaped the fortress with the key on their possession.\nHaving the Screaming key on their posesion, Qi'ra sent the knights to a Dark side hellscape where so they could serve as protectors of The Archivist, who was going there to recover an item for Crimson Dawn. While some of the knights were uneasy about the place, Bazzra was on Ren's side and agreed that they didn't have much choice on the matter. After Ren activated the screaming key with the Force, Bazzra and the rest were startled by the agonizing sound that the key produced, which also woke up various petrified dark side creatures that started to attack them.\nWhile running away from the creatures of the hellscape, Ren put the Archivist under Bazzra's protection, and she carried her through the hellscape with the Force as the Archivist couldn't keep up. As blasters proved to be inefective against the creatures, Ren took charge with his saber while Bazzra continued to the Archivist towards the center of the hellscape. As one of the giant creatures came near the two, Bazzra pushed the Archivist out of the way, resulting in her demise as she was crushed under a giant fist.\nBazzra was known among her fellow knights for having a foul mouth. She was also shown to be easily frightened by Darth Momin's helmet seemingly coming to life an attacking her.\nBazzra was Force-sensitive and an adept of the dark side of the Force but, like most Knights of Ren, she was untrained and this resulted in her powers being stunted. Despite this, she has shown to use the Force to enhance her speed and movement like her displays at the Heist at Fortress Vader or when she protected the Archivist on the dark side hellscape. Bazzra was also shown to be skilled with her blaster pistol.\nLike the rest of the knights, Bazzra had a helmet and wore black clothing that covered her entire body, including her Lekku. She also had a Blaster pistol and an axe.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Dark_side_hellscape",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Knights_of_Ren",
  "/wiki/Crimson_Dawn",
  "/wiki/Massif",
  "/wiki/Force-sensitive",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Heist_at_Fortress_Vader",
  "/wiki/Lord",
  "/wiki/Qi%27ra",
  "/wiki/Standard_year",
  "/wiki/Galactic_Civil_War",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Color",
  "/wiki/Lightsaber",
  "/wiki/Ren_(lightsaber)",
  "/wiki/Ren_(human)",
  "/wiki/Ren",
  "/wiki/Planet",
  "/wiki/Fortress_Vader",
  "/wiki/Screaming_Key",
  "/wiki/Night_Buzzard",
  "/wiki/Mustafar",
  "/wiki/Sith_cave",
  "/wiki/Mask_of_Lord_Momin",
  "/wiki/Darth_Momin",
  "/wiki/Vane%C3%A9",
  "/wiki/Anakin_Skywalker",
  "/wiki/The_Archivist",
  "/wiki/Blaster_pistol",
  "/wiki/Ax",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Crimson_Reign_1",
  "/wiki/Crimson_Reign_4",
  "/wiki/Bounty_Hunters_25",
  "/wiki/Crimson_Reign_5",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Crimson_Reign",
  "/wiki/Death",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}