{
 "name": "Bea_(Human)",
 "display_name": "Bea  (Human)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Figg Hall"
     ]
    }
   ]
  }
 ],
 "content": "Bea was a female Human who lived on Cloud City during the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire. There she worked as a receptionist in Figg Hall, a public space in the city's Tourist District for residents or visitors to speak to representatives of the city. As such, she could arrange meetings with Lando Calrissian, the Baron Administrator of the city, or Lobot, Calrissian's chief administrative aid. Bea worked alongside the protocol droid B-7G, and was polite and efficient while at work. A pretty woman, she could be charmed into showing the city's official records, but would alert Lobot to individuals of interest viewing such material.\nBea first appeared in The Jewel of Yavin, an adventure module released in 2014 by Fantasy Flight Games for Star Wars: Edge of the Empire. Bea is listed as a character that players might interact with to look up official files on other characters in the adventure, but as her involvement is completely optional this article does not assume such a meeting took place.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Figg_Hall",
  "/wiki/Cloud_City/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Tourist_District",
  "/wiki/City/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Baron_Administrator/Legends",
  "/wiki/Lobot/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/B-7G",
  "/wiki/The_Jewel_of_Yavin",
  "/wiki/2014",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Edge_of_the_Empire"
 ]
}