{
 "name": "Beast of Marka Ragnos",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "By 5000 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Korriban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Terentatek"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Owner(s)",
     "values": [
      "Marka Ragnos"
     ]
    }
   ]
  }
 ],
 "content": "The Beast of Marka Ragnos was a Sithspawn terentatek that was kept as a pet by Marka Ragnos, an ancient Dark Lord of the Sith and ruler of the Sith Empire. Following Ragnos' demise in 5000 BBY, the Beast was left to guard the resting place of its master on the planet Korriban. After centuries of isolation in Ragnos' caverns, the Beast was ultimately slain by a rising star of the reconstituted Sith Empire who had entered the tomb as part of the Sith Academy's trials.\nAs its name implied, the Beast of Marka Ragnos once belonged to the Dark Lord of the Sith Marka Ragnos, who ruled over the Sith Empire for a standard century. The Beast was a giant terentatek, a species of Sithspawn. Legend held that Ragnos, despite considering the Beast his \"pet,\" used to beat it at night in order to increase its ill emotions. The same legend also reported that the Beast was only fed with blood between two periods of deprivation, which gave it an unquenchable thirst for more.\nBy dint of torture, Ragnos' pet was ultimately turned into an embodiment of pure hatred. When Ragnos died in the year 5000 BBY, the Beast was left to guard the burial chamber of its master, nestled in the Valley of the Dark Lords on the planet Korriban. For many centuries, the Beast of Marka Ragnos served its purpose, and no one who had seen it lived to tell the tale.\nAround 3643 BBY, Overseer Tremel of the Sith Academy on Korriban ordered a promising Sith Warrior to enter the tomb as a test of worth. Tremel advised his acolyte to hold nothing back, as he considered the creature to be \"doom itself.\" The Sith Warrior discovered the reliquary containing an ancient Sith carving that could summon the Beast and meditated around it for a moment, prompting the creature to appear. True to its mission, the Beast confronted the Sith Warrior but was ultimately slain. Since Ragnos' pet had been a great source of dark side energy on the planet, its death caused a disturbance in the Force.\nLike all terentatek, the Beast of Marka Ragnos was a massive biped distinguished by its thick forearms, the spines growing from its back, and a pair of poisonous tusks. Its thick, hairless hide had a grayish hue.\nAs a non-sentient life-form, the Beast only used brute force to attack its enemies, but it could also stun them with a blow of its fists. Its powers were great enough to impress a confirmed Sith Overseer and prompt him to advise caution about fighting the creature. In fact, Tremel explained that a vergence in the Force was located on the Beast, which was itself a source of dark energy.\nThe Beast of Marka Ragnos appears in the Sith Warrior class mission \"Slaying the Beast\" in Star Wars: The Old Republic, a massively multiplayer online roleplaying game released by BioWare and LucasArts on December 20, 2011.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/5000_BBY/Legends",
  "/wiki/3643_BBY",
  "/wiki/Korriban",
  "/wiki/Terentatek/Legends",
  "/wiki/Color/Legends",
  "/wiki/Marka_Ragnos",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sithspawn/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Death/Legends",
  "/wiki/Tomb_of_Marka_Ragnos",
  "/wiki/Planet/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Cave/Legends",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Burial/Legends",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Species/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Diet/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Valley_of_the_Dark_Lords/Legends",
  "/wiki/Overseer_(Sith)",
  "/wiki/Tremel",
  "/wiki/Sith_Acolyte",
  "/wiki/Meditation/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Disturbance_in_the_Force/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Tooth/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Stun/Legends",
  "/wiki/Vergence/Legends",
  "/wiki/Sith_Warrior",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Reproduction/Legends",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Golden_Age_of_the_Sith_3",
  "/wiki/Fate_of_the_Jedi:_Ascension"
 ]
}