{
 "name": "Beatas",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ploovo's Protocol Team"
     ]
    }
   ]
  }
 ],
 "content": "Beatas was a dark-green-skinned Klatooinian mercenary and the operative leader of Ploovo's Protocol Team.\nBeatas began his career as a juvenile delinquent, and was lucky enough to avoid slavery for all of his life. When he was old enough, he began working as a hired thug for different criminals. It was during this time that he worked under the light of the Timja Suns, which caused the yellow color of his eyebrows. He used a heavy blaster pistol and grenades. At some time, he worked for Gotal loan shark Thar Lasan and his organization in the Corporate Sector. Lasan died unexpectedly and his organization was merged with Ploovo Two-For-One's around 5 BBY. As one of Lasan's assets, Beatas began working for Ploovo. Plovoo assigned Beatas to Ploovo's Protocol Team, collecting money from debtors. Beatas discovered that he enjoyed his new work: Should he find a debtor who had missed a payment, Beatas would hit this person until the money \"miraculously\" appears. In some cases, even the debtor is confused when the money appeared. Beatas also enjoyed the word \"miraculous\", his favorite and the longest in his lexicon. Due to his enjoyment of the job, Beatas was very loyal to Ploovo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Klatooinian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Ploovo%27s_Protocol_Team",
  "/wiki/Mercenary/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Timja_Suns",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Loan_shark",
  "/wiki/Thar_Lasan",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Ploovo_Two-For-One/Legends",
  "/wiki/5_BBY/Legends",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}