{
 "name": "Beaumont Kin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lerct"
     ]
    },
    {
     "name": "Born",
     "values": [
      "5 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Resistance Intelligence",
      "Resistance Army",
      "Exegol landing team",
      "Resistance Intelligence",
      "Resistance Army",
      "Exegol landing team"
     ]
    }
   ]
  }
 ],
 "content": "Beaumont Kin was a human male historian and educator, who was on track to become one of the youngest professors at Lerct Historical Institute when he joined in the Resistance during their war with the First Order as a Resistance trooper. He participated in the attack on Kashyyyk and the Battle of Exegol.\nBorn around 5 BBY, Beaumont Kin was a human male and the son of a mother and father who he claimed told him he was \"useless.\" According to Kin, this was the reason he threw away a promising future to join the Resistance, though it was unclear to fellow Resistance member Daz Crano if he was serious or not and Kin did not confirm. He attended the Arhul Hextrophon School of Embedded Journalism, and met the Rebel Alliance historian Voren Na'al there.\nKin had a fascination with the early Republic era that followed the vanquishing of the Sith. This led him to visiting sites in Malachor, Moraband and Devaron in his quest to learn more about the ancient Jedi and Sith and the long-forgotten conflicts that affected the galaxy.\nBy 21 ABY, he had earned his doctorate and was working on his dissertation at the Lerct Historical Institute on Hosnian Prime as a junior research assistant with Professor Re-Bec Arclarka as his mentor. Kin used a semester's worth of grants to lead an archeological expedition to Yoturba. Near the end of it they were visited by Jedi Master Luke Skywalker and the famed explorer Lor San Tekka. While the latter were there, the dig uncovered an ancient Sith holocron.\nKin sought to become an educator, and was on track to become one of the youngest professors at Lerct Historical Institute when the Hosnian system was destroyed. He abandoned his academic career and joined the Resistance, becoming a captain in the intelligence division.\nHe served in the Resistance Army as a Resistance trooper during their war with the First Order and participated in an attack against the First Order blockade of the Wookiee homeworld of Kashyyyk. While serving with the Resistance, he became acquainted with the legendary Rebel hero Chewbacca and was close enough that he called the Wookiee by his nickname of \"Chewie.\" Kin was aboard the Millennium Falcon as they approached Kashyyyk and sent coordinates to Daz Crano. They landed and freed a group of captured Wookiees, and Chewbacca ran off. Kin and Crano chased after. They stopped at the edge of the Black Forest while Chewbacca fought First Order troopers.\nKin, Nien Nunb, and Crano continued their search for Chewbacca before the Wookiee emerged with more freed brethren. Later, the Resistance party was traveling through the forest when Chewbacca trapped the First Order troopers in order to free more slaves. Kin and the rest arrived just in time to support Chewbacca.\nStationed at the Resistance base on Ajan Kloss, Kin took part in combat training alongside Rose Tico and Kaydel Connix, becoming close with both of them. He helped Rey decipher the ancient Jedi texts that she had brought from the planet of Ahch-To, where Luke Skywalker had kept watch over them.\nIn 35 ABY, Kin was present along with the rest of the Resistance at the Battle of Exegol. He was dropped off by a transport hauler, the Fortitude, along with Resistance troopers and Orbaks, and participated in the ground assault on the Resurgent-class Star Destroyer Steadfast.\nKin was a human with blond hair, blue eyes, and light skin. His personality made it difficult for others to discern if he was joking or being serious, something that people told him frequently. He was very studious, and his knowledge of certain topics such as the Sith and the Jedi proved helpful to the Resistance. He was particularly fascinated with Sith attempts to stave off death, such as pillaging worlds that had a reputation in genetic sciences. Kin also claimed to Crano that his parents thought he was useless.\nBeaumont Kin was fluent in nine languages, including the Wookiee language of Shyriiwook, and was able to translate the languages for others, though he struggled to understand certain dialects. He claimed to be something of a historian and shared his knowledge of Kashyyyk's history with his comrades during the attack on the planet. Being fluent in so many languages and being well versed on the ancient Jedi language, Kin helped Rey Skywalker decipher the texts during the Resistance's time on Ajan Kloss.\nHe also could wield a blaster pistol.\nHe wore a water-shedding weatherproof field jacket, and protective antiglare goggles. He had code cylinders in his shoulder pocket, and had notes on Jedi texts in his breast pocket. He wielded a EL-16 blaster rifle and an ERDT Glie-44 blaster pistol.\nBeaumont Kin appeared in the 2019 film Star Wars: Episode IX The Rise of Skywalker, the final installment of the Star Wars sequel trilogy. He was portrayed by Dominic Monaghan. The character first appeared in the 2019 comic \"Ghosts of Kashyyyk, Part 1\" by John Barber, part of the Journey to Star Wars: The Rise of Skywalker publishing program, where he was identified as Beaumont. His surname \"Kin\" was revealed in previews for Topps' 2020 Star Wars: The Rise of Skywalker Series 2 trading card set, which previewed trading cards autographed by Monaghan for the character.\nThe Rise of Skywalker director J.J. Abrams wrote the part of Kin with Dominic Monaghan in mind, having previously worked with him in the ABC TV series Lost. While Monaghan wasn't contacted for the 2015 film Star Wars: Episode VII The Force Awakens, Abrams later offered him the role of the Beaumont Kin, which Monaghan got after England won against Colombia in the Round of 16 of the 2018 FIFA World Cup as part of a bet with Abrams.\nAlthough Star Wars: The Rise of Skywalker: The Visual Dictionary states that Kin was aspiring to become a professor, Star Wars: The Rise of Skywalker: A Junior Novel established that he had used to be one.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Beaumont_Kin",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Lerct",
  "/wiki/5_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Resistance_Intelligence",
  "/wiki/Resistance_Army",
  "/wiki/Exegol_landing_team",
  "/wiki/Historian",
  "/wiki/Educator",
  "/wiki/Professor",
  "/wiki/Lerct_Historical_Institute",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance_trooper",
  "/wiki/Blockade_of_Kashyyyk",
  "/wiki/Kashyyyk",
  "/wiki/Battle_of_Exegol",
  "/wiki/Reproduction",
  "/wiki/Beaumont_Kin%27s_mother",
  "/wiki/Beaumont_Kin%27s_father",
  "/wiki/Daz_Crano",
  "/wiki/Arhul_Hextrophon_School_of_Embedded_Journalism",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Voren_Na%27al",
  "/wiki/Galactic_Republic",
  "/wiki/Sith",
  "/wiki/Malachor",
  "/wiki/Moraband",
  "/wiki/Devaron",
  "/wiki/Jedi",
  "/wiki/21_ABY",
  "/wiki/Hosnian_Prime",
  "/wiki/Re-Bec_Arclarka",
  "/wiki/Yoturba",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/Lor_San_Tekka",
  "/wiki/Sith_holocron",
  "/wiki/Hosnian_system",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Captain",
  "/wiki/Wookiee",
  "/wiki/Homeworld",
  "/wiki/Chewbacca",
  "/wiki/Millennium_Falcon",
  "/wiki/Black_Forest",
  "/wiki/Nien_Nunb",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Ajan_Kloss",
  "/wiki/Rose_Tico",
  "/wiki/Kaydel_Ko_Connix",
  "/wiki/Rey_Skywalker",
  "/wiki/Sacred_Jedi_texts",
  "/wiki/Ahch-To",
  "/wiki/35_ABY",
  "/wiki/YC-123B_transport_hauler",
  "/wiki/Fortitude_(transport)",
  "/wiki/Orbak",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Language",
  "/wiki/Shyriiwook",
  "/wiki/Translator",
  "/wiki/Planet",
  "/wiki/Blaster_pistol",
  "/wiki/Code_cylinder",
  "/wiki/EL-16_blaster_rifle",
  "/wiki/Eirriss_Ryloth_Defense_Tech",
  "/wiki/Glie-44_blaster_pistol",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/Dominic_Monaghan",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ghosts_of_Kashyyyk,_Part_1",
  "/wiki/John_Barber",
  "/wiki/Journey_to_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2020",
  "/wiki/J.J._Abrams",
  "/wiki/2015",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_27",
  "/wiki/Ghosts_of_Kashyyyk,_Part_2",
  "/wiki/Star_Wars_Adventures_(2017)_28",
  "/wiki/Ghosts_of_Kashyyyk,_Part_3",
  "/wiki/Star_Wars_Adventures_(2017)_29",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/2019_Topps_Star_Wars:_The_Rise_of_Skywalker_Series_1",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Star_Wars_Insider",
  "/wiki/200_Reasons_Why_We_Love_Star_Wars",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/Battle_of_Endor",
  "/wiki/October_22",
  "/wiki/December_5",
  "/wiki/December_3"
 ]
}