{
 "name": "Bec_Lawise",
 "display_name": "Bec Lawise",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mileva"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Scipio"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Siniteen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.74 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems",
      "Separatist Senate",
      "Separatist Senate"
     ]
    }
   ]
  }
 ],
 "content": "Bec Lawise was a Siniteen male politician who served as the Separatist Congress Leader in the Confederacy of Independent Systems. Representing his homeworld of Mileva, Speaker Lawise presided over the Separatist Senate alongside Confederate Head of State Dooku for much of the Clone Wars, an intergalactic conflict between the Confederacy and Galactic Republic, governing with a light touch and reining in the ideologically diverse senate during the tumultuous conflict.\nDuring the Clone Wars, Speaker Lawise participated in a peace conference as one of three Confederate delegates on the neutral planet Mandalore in an ill-fated attempt to negotiate a peaceful resolution to the war. In the final year of the war, Dooku, seeking to deplete Republic funds, secretly coerced the replacement of the InterGalactic Banking Clan's leadership with Baron Rush Clovis, a Separatist ally. Speaker Lawise and Republic Senator Padmé Amidala were sent to Scipio to oversee Clovis's inauguration. The event took a turn when Dooku forced Clovis to increase interest rates on the Republic, but not the Confederacy. Lawise opposed Dooku's underhanded tactics and was further outraged when the Head of State attempted to have Senator Amidala arrested, a principled stance that would cost him his life.\nBec Lawise hailed from the astronomical object Mileva, the homeworld of the Siniteen species. During the final years of the Galactic Republic's reign, a crisis emerged when a large number of those serving in the Galactic Senate opted to abscond from the Republic, seeking to leave behind what they perceived to be a corrupt and self-serving government. In large part coalesced by Count Dooku of Serenno, these worlds formed into the Confederacy of Independent Systems, a nascent alternative to the long-standing Republic. Among those to join the Confederacy was Lawise, a veteran politician, who would serve as a delegate in the Separatist Senate and would go on to act as the Separatist Congress Leader under the title of Speaker.\nLawise presided over the Separatist Congress alongside Dooku, the Confederacy's Head of State, in the Raxus Secundus city Raxulon. The congress existed primarily for mutual defense among its members and to dispute mediation and interplanetary issues, free of the archaic and rules and protocols that invited corruption into the halls of the Republic Senate. Speaker Lawise, noted for his principled nature, governed the congress with a light touch, but kept the ideologically diverse group reined in with core ideological beliefs, such as minimal taxation and trade regulation and far greater control over sovereign territory than would be ceded under the Republic. In 22 BBY, with the continued growth and acceleration of the Confederacy, talks of war with the Republic spread, and each group amassed reserves of armies. Full-scale war broke out with the First Battle of Geonosis, and the conflict quickly escalated into pan-galactic warfare. Though at odds with the Galactic Republic, Lawise held no personal enmity towards his Republic counterparts and remained friends with many across enemy lines.\nIn 21 BBY, Confederate Senator Mina Bonteri of the Japrael sector and Republic Senator Padmé Amidala met and privately negotiated to introduce an initiative to open the Confederacy and Republic up to a peaceful resolution to the war. Bonteri presented the peace initiative before the Separatist congress. Lawise was seated in the gallery of the Senate chamber, where he watched Bonteri speak in favor of the bill. While Bonteri argued that both the Confederacy and Republic could coexist, Senator Voe Atell of the Corporate Alliance argued against that notion. Unlike Bonteri, who belonged to the Confederate Senate's Peace Faction, Atell belonged to the War Faction and believed that the Republic had to be destroyed for the Confederacy to exist in peace. When Atell voiced her opinion that the Corporate Alliance would not support the bill, Senator Kerch Kushi spoke up and stated that, unlike the Republic, corporations did not control the Confederacy, a direct strike at Atell's stance. The Senate broke into arguing, but Dooku, participating in the meeting via hologram, brought the chamber to silence. Dooku put the motion to a voice vote as required by the Bylaws of Independent Systems. Lawise rose from his seat alongside many enthusiastic senators and voiced his support for the bill while applauding. After hearing from the opposition, Dooku declared those supporting the peace initiative as the victors.\nThough the Separatist Senate passed the peace initiative and reached out to the Republic, Senator Amidala had a more difficult time muscling the Galactic Senate on Coruscant to support the motion. While the Senate was voting for the bill, however, Confederate General Grievous carried out an attack on Coruscant's power grid. The bill was immediately recalled as the senate entered lockdown. Likewise, the Separatist Congress repealed its vote for the initiative when an alleged Republic attack resulted in the death of Senator Bonteri.\nDespite the failure of Senator Bonteri and Senator Amidala's earlier peace negotiations, the Confederacy and Republic again entered negotiations in 20 BBY. The first-ever peace conference between the two was sanctioned by both governments, with the neutral planet Mandalore to host the precarious meetings. Speaker Lawise was among the three Confederate delegates chosen to represent the Confederacy during these meetings, alongside Voe Atell and Senator Amita Fonti. Among the three delegates from the Republic were Senator Amidala and Senators Bail Organa and Mon Mothma, longtime proponents of peace. The conference was held in the throne room of the Mandalorian ruler, Duchess Satine Kryze, who would mediate the meeting, in the capital city of Sundari. Though Kryze had strict rules regarding weaponry in the city, the two delegations were each allowed a small contingent of security forces, with the Separatist diplomats escorted by BX-series droid commandos. In addition, the Republic delegates were accompanied by Jedi Padawan Ahsoka Tano.\nTensions ran high during the conference, as the Republic delegates were seemingly reluctant to formally declare the Confederacy as a legitimate state. Senator Atell demanded that Senator Amidala do so, to Lawise and Fonti's agreement. Before Amidala could speak, the meeting was interrupted by Lux Bonteri, the son of the late Mina Bonteri, who stated that he had something to say about the legitimacy of the Separatists. Lawise scoffed at Bonteri's presence, and Atell asked the Speaker what he was doing at the meeting. While the two delegations conversed privately about Bonteri's sudden appearance, the young man walked up and bowed to Duchess Kryze, who allowed him to speak. Bonteri took up a podium before the conference and, after introducing himself and mentioning the late Mina, turned to the Confederate delegation and accused Count Dooku of murdering his mother. Lawise stood up immediately and yelled that Bonteri was lying, then ordered the commando droids to arrest him. While the droids grabbed Bonteri, Duchess Satine interjected, demanding them to stop. Senator Atell respectfully asked Kryze to leave the matter to them. Bonteri was led out of the throne room, warning the Confederate delegates that they were being deceived and would be betrayed by Dooku like his mother.\nWith Bonteri gone, Lawise reconvened with the Republic delegates and apologized for the rude interruption, and asked that they continue with the meeting. Secretly, Senator Amidala let Tano leave the meeting to rescue Bonteri, but while doing so opened a firefight between the Confederate and Republic forces stationed outside the city. With both sides in open hostility, the peace conference quickly broke down and the delegates left Mandalore.\nIn 19 BBY, worries grew in both the Confederacy and Republic regarding the InterGalactic Banking Clan, an influential commerce guild that funded both governments on neutral grounds. Before the war had started, the Banking Clan had formed an alliance with the nascent Confederacy, but by the final year of the war the Banking Clan had grown unstable and its assets came under scrutiny. Both the Republic and Confederacy operated on debt and relied heavily on the Banking Clan for necessary funds. An investigation into the Banking Clan's reserves by Republic Senator Amidala and a former Republic Senator-turned-Separatist ally, Baron Rush Clovis, revealed that the bank was on the verge of bankruptcy and had little credits in its vaults. After further intrigue and a hearing before the Republic Senate, the leadership of the Banking Clan, the Core Five, were arrested on charges of corruption. Clovis, secretly in league with Dooku to take control of the banks, was endorsed by both the Republic and Confederacy to become the new head of the banks. With these endorsements, Clovis was elected the new leader of the Banking Clan.\nTo oversee the important transfer of power, the Confederacy sent Congress Leader Lawise to Scipio, the location of the Banking Clan. Likewise, the Republic sent Senator Amidala to monitor the proceedings. Lawise arrived at Scipio before Senator Amidala and Clovis and met with a dignitary from the Banking Clan while they awaited their arrival. Once they landed outside the neutral zone of the Main Vault fortress, Lawise and his security walked up to the unloading ramp to greet them. Lawise welcomed Clovis back to Scipio and added that the Separatist government had great hopes for him. Clovis thanked the senator, then addressed both Lawise and Amidala to explain how the transfer of power would be conducted. Only Lawise and Amidala were allowed inside the neutral zone of the city, and their respective forces had to remain stationed outside. Both senators agreed to the conditions and the party began walking towards the city entrance.\nClovis lead them to the Main Vault, where the Core Five were being handed their formal sentence by the Muun government. The five former leaders were charged with embezzlement and led away for imprisonment. With Lawise and Amidala standing on either side of him, Clovis approached the center of the room to begin the transfer of power. Before the dignitaries, Clovis stated that he had no interest in controlling the banks but rather was devoted to reestablishing them to their prior glory, to the applause of those present. Lawise walked over to Amidala and asked if Clovis was up to the task, and she responded that the new leader would not stop until he achieved his goal. Lawise replied that he hoped she was right for all of their sakes and joined in the applause.\nThough Clovis had joined forces with Dooku to rise to the leadership, he had no intention of letting Dooku leverage him into absolving the Confederacy of its debts. Dooku, however, threatened Clovis' new position by outright refusing on behalf of the Confederacy to pay the interest on its loans, which would completely collapse the Banking Clan. With the fate of the banks in the balance, Clovis had no alternative but to raise the interest rates on the Republic's loans. With both Lawise and Amidala still present on Scipio and unaware of Dooku's underhanded tactics, the two were invited to the Main Vault to hear this verdict from Clovis. Clovis announced to the senators that, according to a new order of the Traxus Division, interest rates on the Republic were to be raised in an effort to stabilize the banks. Lawise and Amidala were each caught unguarded by the announcement and looked at each other in shock. Senator Amidala protested and tried to gain Clovis' attention, but the new leader and his dignitaries left the meeting, leaving Lawise and Amidala alone to digest the news.\nAs part of his next step to taking control of the banks, Dooku arrived at Scipio with an armada to occupy the planet. Dooku sent a fleet of gunships to destroy Senator Amidala's forces stationed outside the city, and once they were decimated, Dooku and his troops entered the neutral zone. Lawise was brought to Clovis' office to meet with the Banking Clan leader and Dooku, who had his droids take Amidala hostage. The Republic senator was thrown to the ground before Lawise and Clovis, who looked on in horror. Amidala asked Clovis what was happening, and he replied desperately that he didn't want any of this to happen. Dooku interrupted and told Clovis to tell her how to rose to power. Though Clovis protested, Dooku claimed that Amidala was a Separatist for aiding in his rise and that he had been assured that she would join in their cause. When she refused, the Head of State ordered her arrest. Lawise tried to intervene on her behalf, telling Dooku that they couldn't arrest her and that his actions would not be supported by the Separatist Congress. Dooku quickly glared at Lawise when suddenly, Amidala grabbed a blaster from one of the battle droids beside her and aimed the weapon at the Count. Using the Force, Dooku took control of Amidala's movements and redirected her blaster towards Speaker Lawise, who yelled in vain for Dooku to stop. Dooku forced Amidala to shoot Lawise twice in the chest, killing him.\nAs had once been predicted by Lux Bonteri, Speaker Lawise was deceived and betrayed by Dooku, just as the late Mina Bonteri was. Once Lawise's body hit the floor, Amidala fell to her knees in horror, while Clovis exclaimed to Dooku that his death was not part of their deal. With Lawise dead, it seemed that the Confederacy would continue with its takeover of the Banking Clan. Instead, a Republic fleet invaded the planet to drive the Confederacy away, but before they arrived Dooku and his armada left the planet and their droids stationed in the city behind. During the ensuing battle, Clovis committed suicide to save Senator Amidala, and the Republic occupied Scipio.\nIn the aftermath of the chaos, the Muun government dissolved the Banking Clan and ceded control of its remaining assets to the Republic, which promised that the banks would return to their former standing once the war ended. Speaker Lawise was heavily mourned in the Separatist Congress. In a far cry from the principled and cordial Lawise, many in the Senate gained a deeper enmity towards Amidala and the Republic due to allegedly killing him, despite Dooku's secret role in the assassination.\nBec Lawise was a wide-bodied Siniteen male with yellow eyes and pale pink skin. Lawise was noted for his principled and amicable behavior as a politician, not only being able to assert order in the Separatist Senate but maintaining close relationships with many senators across enemy lines in the Republic. Despite this, Lawise was devoted to the Separatist cause and wanted them to grant the Confederacy legitimacy and recognition as a separate entity from the Republic. Though able to govern his senate with a light touch, Lawise was not averse to finding himself against his fellow Separatists and denounced transgressive members, such as Lux Bonteri, of actions such as treason. Lawise was quick to defend Count Dooku against Bonteri's claims of murder and had the young man arrested for his interruption of the peace conference on Mandalore.\nLike many, Lawise believed that groups such as the InterGalactic Banking Clan should remain neutral, and, with Senator Amidala, held to the belief that maintaining the banks' integrity was vital. Lawise had high hopes for Rush Clovis' promise to restructure the banks and respected Amidala's opinion of him as well. Lawise opposed Dooku's scheme to take control of the Banking Clan, a stance which drew the Head of State's ire. Lawise tried to convince Dooku to stop with the threat that the Separatist Senate, under his control, would not support his actions, an upstanding position that would lead to his murder.\nBec Lawise first appeared in the Star Wars: The Clone Wars television series third season episode \"Heroes on Both Sides.\" He was first identified by name in the accompanying episode guide on StarWars.com. Lawise had a speaking role in the fourth season episode \"A Friend in Need,\" where he is portrayed by voice actor Corey Burton. Burton reprised the role in the sixth season episode \"Crisis at the Heart.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bec_Lawise",
  "/wiki/Bec_Lawise/Legends",
  "/wiki/Mileva",
  "/wiki/19_BBY",
  "/wiki/Scipio",
  "/wiki/Siniteen",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Separatist_Senate",
  "/wiki/Politics",
  "/wiki/Separatist_Congress_Leader",
  "/wiki/Head_of_State",
  "/wiki/Dooku",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Republic",
  "/wiki/Confederate%E2%80%93Republic_peace_conference",
  "/wiki/Planet",
  "/wiki/Mandalore",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Core_Five",
  "/wiki/Baron",
  "/wiki/Rush_Clovis",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Invasion_of_Scipio",
  "/wiki/Separatist_Crisis",
  "/wiki/Galactic_Senate",
  "/wiki/Count",
  "/wiki/Serenno",
  "/wiki/Raxus_Secundus",
  "/wiki/Raxulon",
  "/wiki/22_BBY",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/21_BBY",
  "/wiki/Mina_Bonteri",
  "/wiki/Japrael_sector",
  "/wiki/Confederate%E2%80%93Republic_peace_initiative",
  "/wiki/Voe_Atell",
  "/wiki/Corporate_Alliance",
  "/wiki/Peace_Faction",
  "/wiki/War_Faction",
  "/wiki/Kerch_Kushi",
  "/wiki/Bylaws_of_Independent_Systems",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Bombing_of_Coruscant%27s_central_power_distribution_grid",
  "/wiki/Central_power_distribution_grid",
  "/wiki/20_BBY",
  "/wiki/Amita_Fonti",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Mon_Mothma",
  "/wiki/Grand_Salon",
  "/wiki/Duke",
  "/wiki/Satine_Kryze",
  "/wiki/Sundari",
  "/wiki/BX-series_droid_commando",
  "/wiki/Jedi_Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Lux_Bonteri",
  "/wiki/Main_Vault_fortress",
  "/wiki/Main_Vault",
  "/wiki/Traxus_Division",
  "/wiki/The_Force",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/StarWars.com",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/A_Friend_in_Need",
  "/wiki/Corey_Burton",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/Crisis_at_the_Heart",
  "/wiki/Category:Images_of_Bec_Lawise",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_92",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Separatists",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_BBY",
  "/wiki/Pursuit_of_Peace",
  "/wiki/Battle_of_Mon_Cala",
  "/wiki/Skirmish_in_Theed",
  "/wiki/The_Academy",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Mission_to_Utapau",
  "/wiki/An_Old_Friend",
  "/wiki/The_Rise_of_Clovis"
 ]
}