{
 "name": "Becky Smoochenbacher",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Becky Smoochenbacher was a human female individual who lived on the Upper Ring of the Wheel that Zander Freemaker liked. During the Battle of Endor Becky was an Imperial weapons technician, but she defected and rescued the Freemakers at the same time she confessed her love for Zander. After the intense battle, the two were reunited at the Rebellion's celebration at Bright Tree Village on Endor.\nBecky Smoochenbacher lived on the Wheel, a space station in the Abrion system during the Galactic Civil War. Zander Freemaker, a mechanic and a member of the Freemakers family was infatuated with her. He constantly made references to her, much to the annoyance of Zander's sister Kordi.\nDuring the Freemakers' quest to build the Arrowhead starship, Zander was distracted by the sight of Becky while fleeing with Kordi and his younger brother Rowan, causing them to crash their speeder bike into a column in the Lower Ring. Zander's infatuation with Becky kept him motivated through the Freemakers' arduous quest to gather the parts to build the Arrowhead.\nPrior to the Battle of Endor, Becky joined the Galactic Empire and became an Imperial weapons technician aboard the second Death Star. However, Becky decided to defect after seeing that Zander and his family and the Mon Calamari shipbuilder Quarrie had been captured by Imperial stormtroopers. She retrieved Rowan's Kyber Saber and freed the Freemakers from captivity. This allowed Rowan to defeat the Imperial hunter droid M-OC, ensuring the destruction of the superweapon.\nFollowing the Battle of Endor, Becky joined the rebel celebrations at Bright Tree Village, where she shared her first kiss with Zander.\nBecky Smoochenbacher had long flowing, blonde hair and fair skin. Though she had joined the Galactic Empire, she decided to defect after encountering her love interest Zander Freemaker on the second Death Star during the Battle of Endor.\nBecky Smoochenbacher is voiced by Dove Cameron in \"Return of the Return of the Jedi,\" the series finale of LEGO Star Wars: The Freemaker Adventures, which premiered on August 16, 2017. According to Leland Chee, Becky is the mother of Zander's daughter Moxie.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Upper_Ring/LEGO",
  "/wiki/The_Wheel#Behind_the_scenes",
  "/wiki/Zander_Freemaker",
  "/wiki/Battle_of_Endor",
  "/wiki/Imperial_weapons_technician",
  "/wiki/Treason",
  "/wiki/Freemakers/LEGO",
  "/wiki/Time",
  "/wiki/Bright_Tree_Village",
  "/wiki/Endor",
  "/wiki/Abrion_system",
  "/wiki/Galactic_Civil_War",
  "/wiki/Kordi_Freemaker/LEGO",
  "/wiki/Quest_to_build_the_Arrowhead",
  "/wiki/Arrowhead_(Freemakers)",
  "/wiki/Rowan_Freemaker/LEGO",
  "/wiki/Speeder_bike",
  "/wiki/Lower_Ring",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Mon_Calamari",
  "/wiki/Quarrie",
  "/wiki/Stormtrooper",
  "/wiki/Kyber_Saber",
  "/wiki/Hunter_droid/LEGO",
  "/wiki/M-OC/LEGO",
  "/wiki/Dove_Cameron",
  "/wiki/Return_of_the_Return_of_the_Jedi",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/August_16",
  "/wiki/2017",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Leland_Chee",
  "/wiki/Moxie_Freemaker/LEGO",
  "/wiki/Zander%27s_Joyride",
  "/wiki/Return_to_the_Wheel",
  "/wiki/The_Pit_and_the_Pinnacle",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/Scouting_for_Leia/A_Mission_with_Maz"
 ]
}