{
 "name": "Beedo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Beedo was a Rodian who was under Jabba Desilijic Tiure's employ on Tatooine. Shortly before the Battle of Yavin, Beedo accompanied Jabba to Docking Bay 94 in Mos Eisley and was near the Millennium Falcon as Jabba and the smuggler Han Solo conversed.\nThe Rodian was then present in Jabba's Palace in 4 ABY when a group of Solo's comrades tried to rescue Solo, who had been frozen in carbonite and displayed as a decoration in the Hutt's throne room. After Beedo witnessed the Jedi Luke Skywalker slay Jabba's pet rancor Pateesa, the crime lord ordered that the prisoners be executed at the Great Pit of Carkoon; however, Solo and his allies managed to ultimately kill Jabba and escape.\nBeedo was a Rodian male who was rumored to work as a bounty hunter for the Hutt crime lord Jabba Desilijic Tiure during the reign of the Galactic Empire. In 0 BBY, Beedo accompanied another Rodian, Ront Byrnloo, two other humans, and Jabba to Docking Bay 94 in Mos Eisley spaceport on Tatooine in search of the smuggler Han Solo. Solo had dumped a shipment of spice belonging to Jabba, which caused the Hutt had placed a bounty on him. The group found no sign of Solo himself, but did discover his starship, the Millennium Falcon.\nAs they poked around beneath the Falcon, Solo arrived in the docking bay, having just killed Beedo's cousin, Greedo, another bounty hunter in Jabba's employ. Solo greeted Jabba, causing the thugs to spin and aim their blasters at the smuggler. Solo then managed to work out a deal with Jabba based on a new job he had just taken, so the Hutt called off Beedo and his comrades and they left the docking bay alongside their employer.\nFour years later, Beedo was one of two Rodians present in Jabba's Palace when the droids C-3PO and R2-D2 arrived bearing a message from the Jedi Knight Luke Skywalker. As the pair entered the Hutt's throne room, the Rodian was stood to the left of the door operating a control panel. When R2-D2 then projected the holographic form of Skywalker, Beedo turned to listen to the Jedi's message. Skywalker asked that Jabba considered freeing Solo, who had failed to repay Jabba for the lost spice and been frozen in carbonite for display in the Hutt's throne room.\nBeedo then later stood in the doorway of the throne room as the Max Rebo Band performed the song Jedi Rocks for the court. When the song ended, the crime lord demanded the band play an encore; however, the second performance abruptly ended when the Twi'lek dancer Oola refused Jabba's advances and so was dropped into a pit beneath the throne room to be eaten by Pateesa, the Hutt's pet rancor. Beedo was amongst the court members who rushed forward to watch her demise, but afterwards turned in surprise as the sound of blaster fire came from outside the room.\nPrincess Leia Organa, disguised as the bounty hunter Boushh, then entered the courtroom leading the Wookiee Chewbacca in chains. Beedo watched as Jabba and \"Boushh\" negotiated over a bounty that the Hutt had placed on Chewbacca. However, Organa was unsatisfied with the amount the crime lord was offering and produced a thermal detonator in order to threaten him into paying more. As many courtiers cowered in fear, Jabba laughed and offered the princess a compromise that satisfied her. Beedo, who had retreated further back into the entryway, then watched as Chewbacca was dragged away.\nThat night, Beedo was sleeping in one of the courtroom's booths when Organa snuck back into the room to free Solo. She succeeded in freeing him from the carbonite, but the pair were caught by Jabba, who had laid in wait in order to catch Organa in the act. Beedo was again sleeping in one of the booths the next day when Skywalker arrived to free his friends. Beedo awoke and gathered around Skywalker as he made demands of Jabba, but after the Jedi threatened the Hutt with a blaster he and the Gamorrean Jubnuk were dropped into the rancor pit.\nBeedo laughed as he watched the rancor devour Jubnuk, but was shocked when Skywalker managed to kill the beast. Jabba then demanded that Skywalker, Solo and Chewbacca be taken to the Great Pit of Carkoon and fed to the sarlacc there as an alternate means of execution. The Hutt and many of his courtiers then traveled to the pit to witness the execution, but Skywalker and his comrades managed to escape and kill Jabba in the process.\nBeedo had green skin and black eyes. The Rodian laughed at the demise of his colleague Jubnuk.\nThe character that would eventually be identified as Beedo first appeared in the 1977 film Star Wars: Episode IV A New Hope, in which he was one of three Rodian characters that appeared in Mos Eisley all wearing identical costumes. One of these was Greedo, who was named in the film, but the other two remained unidentified. Two similarly dressed Rodians then appeared in Jabba's Palace in the 1983 film Star Wars: Episode VI Return of the Jedi. One of those Rodians was first identified as Beedo in early Return of the Jedi spin off materials, including a Topps trading card set. This name was then first used in canon in the 2017 reference book Star Wars: Geektionary: The Galaxy from A - Z. One of the two Rodians from the Docking Bay scene in A New Hope—both of whom had never been previously named— was then also revealed to be Beedo on the one hundred and first episode of The Star Wars Show in 2018.\nBeedo's costume in Return of the Jedi reused a jacket that previously been worn by female Rebels in Echo Base in the 1980 film Star Wars: Episode V The Empire Strikes Back.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Beedo",
  "/wiki/Beedo/Legends",
  "/wiki/Rodia",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/File:Solo-Twerps.ogg",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Tatooine",
  "/wiki/Battle_of_Yavin",
  "/wiki/Docking_Bay_94",
  "/wiki/Mos_Eisley",
  "/wiki/Millennium_Falcon",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/4_ABY",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Hutt",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Bounty_hunter",
  "/wiki/Crime_lord",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/0_BBY",
  "/wiki/Ront_Byrnloo",
  "/wiki/Human",
  "/wiki/Spaceport",
  "/wiki/Spice",
  "/wiki/Bounty",
  "/wiki/Starship",
  "/wiki/Death",
  "/wiki/Greedo",
  "/wiki/Blaster",
  "/wiki/Droid",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/Jedi_Knight",
  "/wiki/Hologram",
  "/wiki/Max_Rebo_Band",
  "/wiki/Jedi_Rocks",
  "/wiki/Twi%27lek",
  "/wiki/Oola",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Boushh",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Thermal_detonator",
  "/wiki/Sleep",
  "/wiki/Standard_day",
  "/wiki/Gamorrean",
  "/wiki/Jubnuk",
  "/wiki/Sarlacc",
  "/wiki/Color",
  "/wiki/Eye",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2017",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/The_Star_Wars_Show",
  "/wiki/2018",
  "/wiki/Echo_Base",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars",
  "/wiki/StarWarsKids.com",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_ABY",
  "/wiki/1983_Topps_Star_Wars:_Return_of_the_Jedi_Series_1"
 ]
}