{
 "name": "Beelzlit_Grathan",
 "display_name": "Beelzlit Grathan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 3663 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Dromund Kaas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Grathan"
     ]
    }
   ]
  }
 ],
 "content": "Beelzlit Grathan was a Human male Sith Acolyte of the Sith Empire who was the son of Cellvanta Grathan and Lord Grathan.\nRaised on Dromund Kaas, Beelzlit was trained in the Force by his mother, Cellvanta.\nIn 3643 BBY, Lord Grathan revolted against the Empire, and Darth Baras, through his apprentice Dri'kill Ba'al, saw a weakness in him: Beelzlit Grathan, his secret son. The Sith apprentice sent Darth Baras' new apprentice to kill him. Beelzlit and his mother were present inside Grathan's chamber, when Baras' apprentice arrived to eliminate them. Beelzlit loved his mother and was willing to protect her until they both engaged the Sith.\nBadly defeated, Beelzlit and Cellvanta had no idea why they would deserve to die under the rule of the Sith. His mother believed that the only way to save themselves was to convince the apprentice in killing Grathan instead, so her son could take his father's place. Beelzlit didn't want his mother to die, and was willing to sacrifice his life to protect her. The apprentice refused, and killed both Cellvanta and Beelzlit.\nIf Beelzlit is spared by the warrior, Cellvanta convinces Darth Baras' apprentice to kill Grathan in order to protect Beelzlit from harm and allow him to continue his training and take his father's place as Lord of the Sith. Although the noble warrior becomes a close friend of the Grathan family, Beelzlit decides to shut him/her up by sending Ralesk, his father's best assassin, to wait for the apprentice in a hangar in Dromund Kaas spaceport. Ralesk fails in his attempt, being defeated by the Sith warrior, and Beelzlit's secret could threaten to resurface.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Beelzlit_Grathan",
  "/wiki/3663_BBY",
  "/wiki/3643_BBY",
  "/wiki/Dromund_Kaas",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Grathan",
  "/wiki/Sith_Acolyte",
  "/wiki/Cellvanta_Grathan",
  "/wiki/Lord/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Grathan%27s_revolt",
  "/wiki/Darth_Baras",
  "/wiki/Dri%27kill_Ba%27al",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Ralesk",
  "/wiki/Dromund_Kaas_spaceport",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}