{
 "name": "Beesar Tal-Apurna",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chadra-Fan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  }
 ],
 "content": "Beesar Tal-Apurna was a Chadra-Fan female who lived during the High Republic Era with her wife, Teemank. Immediately following the Great Hyperspace Disaster, Teemank left to join the Republic Defense Coalition, despite being told that she was too old and Tal-Apurna begging her not to. Teemank was killed in battle against the Nihil marauders during the Battle of Kur, leaving Tal-Apurna miserable. When a Jedi came to request that she act as a spy and watch for Doctor Kisma Uttersond, a Chadra-Fan collaborator with the Nihil, Tal-Apurna did so to avenge Teemank.\nTal-Apurna managed to stow away on Uttersond's starship when the doctor, who was intending to betray the Nihil for his own benefit, joined a Nihil convoy that was transporting creatures known as the Nameless. The convoy was attacked by Galactic Republic forces led by Jedi Master Emerick Caphtor and private investigator Sian Holt, and Tal-Apurna confronted Uttersond as he tried to release one of the creatures on Caphtor. When Uttersond's associate, Arathab Fal, arrived, Tal-Apurna stunned the doctor, though was attacked by Fal. The Chadra-Fan spy was rescued by Holt, who asked Tal-Apurna to pilot her starship to the Starlight Beacon space station, taking Uttersond as their prisoner. When they arrived, however, they found Starlight had been attacked by the Nihil.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chadra-Fan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/High_Republic_Era",
  "/wiki/Teemank",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Republic_Defense_Coalition",
  "/wiki/Death",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Battle_of_Kur",
  "/wiki/Jedi",
  "/wiki/Spy",
  "/wiki/Doctor",
  "/wiki/Kisma_Uttersond",
  "/wiki/Starship",
  "/wiki/Convoy",
  "/wiki/Nameless",
  "/wiki/Attack_on_a_Nihil_convoy",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Master",
  "/wiki/Emerick_Caphtor",
  "/wiki/Sian_Holt",
  "/wiki/Arathab_Fal",
  "/wiki/Stun",
  "/wiki/Pilot",
  "/wiki/Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/Prisoner",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Beesar_Tal-Apurna",
  "/wiki/Category:Images_of_Beesar_Tal-Apurna",
  "/wiki/The_High_Republic:_Trail_of_Shadows_4",
  "/wiki/The_High_Republic:_Trail_of_Shadows_5",
  "/wiki/Star_Wars"
 ]
}