{
 "name": "Beez",
 "display_name": "Beez",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireLightning Battalion",
      "Lightning Battalion"
     ]
    }
   ]
  }
 ],
 "content": "A member of the Lightning Battalion holding the rank of sergeant, Beez served during the Icarii Campaign under Colonel Abal Karda. He notably saw action at Camp 40, where Imperial forces caught an Icarii war party attempting a sneak attack and blew them to pieces with a heavy artillery barrage.\nWhen Boba Fett arrived on Vestar in pursuit of Karda, now an Enemy of the Empire wanted for shooting dead his commanding officer, he rescued Beez and some of his squadmates from an ill-fated bar fight with a large Wookiee and demanded information about their former commander.\nLike other members of the ground forces, Beez was disdainful of the officer in charge of the overall campaign, General Nim, who never faced the Icarii in battle himself; when he learned that Nim had been murdered by Karda, he claimed that the general \"had it coming\". Conversely, he expressed some sympathy for Nim's murderer, Colonel Karda, who he insisted was the best officer he had ever served under.\nBeez also filled Fett in on the nature of the Icarii Queen Selestrine, explaining how the wealth of her tribe was woven into her hair, her precognitive powers and her supposed death at Karda's hands. The bounty hunter would use this information to deduce the contents of the mysterious kneebshide casket carried by Karda as his pursuit progressed.\nIn common with many veterans of the campaign, the Icarii instilled a lasting fear in Beez, who suffered a flashback and hallucinated that the Icarii were coming when he discussed them with Boba Fett.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Lightning_Battalion",
  "/wiki/Boba_Fett:_Enemy_of_the_Empire",
  "/wiki/Sergeant/Legends",
  "/wiki/Icarii_Campaign",
  "/wiki/Colonel/Legends",
  "/wiki/Abal_Karda",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Vestar/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/General/Legends",
  "/wiki/Nim",
  "/wiki/Icarii",
  "/wiki/Selestrine",
  "/wiki/Boba_Fett:_Enemy_of_the_Empire_1",
  "/wiki/Boba_Fett:_Enemy_of_the_Empire_2",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}