{
 "name": "Beezer_Fortuna",
 "display_name": "Beezer Fortuna",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Jedha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Partisans"
     ]
    }
   ]
  }
 ],
 "content": "Beezer Fortuna was a male Twi'lek who lived during the Age of the Empire. A cousin of Bib Fortuna, Fortuna was a member of the Partisans led by Saw Gerrera, and was on Jedha at the time of the Destruction of Jedha City.\nA male Twi'lek from the species' homeworld of Ryloth, Beezer Fortuna was a member of the Fortuna clan, a powerful Twi'lek family with close connections to the criminal underworld of the galaxy. He stood out from other Twi'leks by his dried-out, desiccated lekku and his comparatively small pupils. He was also the cousin of Bib Fortuna, who worked on the remote desert world of Tatooine as majordomo of the Hutt crime lord Jabba Desilijic Tiure. Fortuna despised his family's connection to the underworld, and was always considered to be the most politically-minded of his clan.\nDuring the Clone Wars, Fortuna witnessed the occupation of Ryloth by the Confederacy of Independent Systems, as well as its later liberation by the combined efforts of the Grand Army of the Republic, the Jedi Order, and Twi'lek freedom fighters under the leadership of Cham Syndulla. The efforts of the liberators inspired Fortuna, and he became a seditionist in the Twi'lek capital city of Lessu. After the war ended, the Galactic Empire came to Ryloth, and Fortuna fought against the Imperial occupation. He was rounded up by the Empire alongside other seditionists in Lessu. However, he and his fellows were freed in a raid by Saw Gerrera's Partisans, and Fortuna became loyal to Saw, choosing to fight the Empire rather than follow his clan's example of seeking profits in the underworld.\nAround six months before the Destruction of Jedha City, Fortuna helped recruit both Chirrut Îmwe and Baze Malbus into the partisans. This relationship did not last long, however. Just before Baze and Chirrut were to load up the orphans to help them escape Jedha on a Sentinel-class ship, Fortuna, along with two other partisans, attempted to take the ship for themselves, planning on driving it into the Star Destroyer that hovered above Jedha. They believed this would destroy the Star Destroyer and send a powerful message to the Empire. Îmwe and Malbus were able to take the ship back, convincing Fortuna and the other two partisans that it would look bad on Gerrera if word got out that the orphans who were attempting escape were denied because of the partisans' actions. This event ended any communications between Îmwe and Malbus and Gerrera's partisans.\nAs of 0 BBY, Fortuna assisted Gerrera with operational planning, serving as one of Gerrera's chief strategists in the Catacombs of Cadera near Jedha City on Jedha. He was part of the group who intercepted the Imperial pilot Bodhi Rook after he defected from the Empire, carrying a message recorded by Galen Erso on Eadu. Fortuna and his compatriots leveled their weapons at the pilot, though Rook convinced Fortuna's group to take him to Gerrera. They led him to Benthic, who in turn brought Rook to Gerrera. In the wake of a skirmish between the Partisans and Imperial forces in Jedha City, Cassian Andor, an agent of the Rebel Alliance, and his allies Jyn Erso, Malbus and Îmwe, were captured by Gerrera's cell after Andor killed one of his Partisans. At the time of their arrival in the catacombs, Fortuna was in conversation with a fellow Partisan at a dejarik table at the base. Shortly after, the Empire conducted a test-firing of its Death Star superweapon, and its superlaser destroyed Jedha City. The single-reactor ignition caused a shock wave of debris that engulfed the Partisan base.\nA pale-skinned Twi'lek male, Beezer Fortuna had a gaunt physique and thin, desiccated lekku. He had piercing blue eyes and sharp, angular features. As one of Saw Gerrera's Partisans, Fortuna wore dark robes and carried an electro-prod staff.\nBeezer Fortuna draws inspiration from early pre-production maquette sculpts for Bib Fortuna. The character's production nickname was \"Cousin Bib,\" so Pablo Hidalgo integrated that detail into his backstory when writing Star Wars: Rogue One: The Ultimate Visual Guide. His name arises from early draft scripts from Star Wars: Episode VI Return of the Jedi, which referred to Bib Fortuna as \"High Beezer of Hoth.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Beezer_(disambiguation)",
  "/wiki/Guardians_of_the_Whills_(novel)",
  "/wiki/Chewbacca_and_Other_Aliens_of_the_Rebellion_and_the_Resistance",
  "/wiki/Ryloth",
  "/wiki/0_BBY",
  "/wiki/Jedha",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Partisans",
  "/wiki/Imperial_Era",
  "/wiki/Bib_Fortuna",
  "/wiki/Saw_Gerrera",
  "/wiki/Time",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Jedha_City",
  "/wiki/Species",
  "/wiki/Homeworld",
  "/wiki/Fortuna_family",
  "/wiki/The_galaxy",
  "/wiki/Lekku",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Majordomo",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Politics",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Order",
  "/wiki/Twi%27lek_Resistance",
  "/wiki/Cham_Syndulla",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Lessu",
  "/wiki/Galactic_Empire",
  "/wiki/Raid_in_Lessu",
  "/wiki/Standard_month",
  "/wiki/Chirrut_%C3%8Emwe",
  "/wiki/Baze_Malbus",
  "/wiki/Sentinel-class_landing_craft",
  "/wiki/Starship",
  "/wiki/Star_Destroyer",
  "/wiki/Star",
  "/wiki/Catacombs_of_Cadera",
  "/wiki/Pilot",
  "/wiki/Bodhi_Rook",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Eadu",
  "/wiki/Benthic",
  "/wiki/Battle_on_Jedha",
  "/wiki/Imperial_Military",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Jyn_Erso",
  "/wiki/Death",
  "/wiki/Dejarik",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Superlaser",
  "/wiki/Reactor",
  "/wiki/Eye",
  "/wiki/Robe",
  "/wiki/Electro-prod_staff",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Guardians_of_the_Whills:_The_Manga",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_1",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_55",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Heroes_of_Rogue_One",
  "/wiki/Databank_(website)",
  "/wiki/StarWars.com",
  "/wiki/File:TwitterCap_pablohidalgo_RogueOneUVGdump.png"
 ]
}