{
 "name": "Beju",
 "display_name": "Beju",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Gala"
     ]
    },
    {
     "name": "Born",
     "values": [
      "60 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Galacian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Beju-Tallah dynasty",
      "Syndicat"
     ]
    }
   ]
  }
 ],
 "content": "Prince Beju was the prince of the planet Gala and the son of Queen Veda and the late King Cana. Initially, he secretly sided with the Syndicat, who offered to help Beju take over Gala in exchange for power. Beju planned on thwarting his planet's elections by cutting off the bacta supply and reinstate it when the people started suffering, which would make the Prince look like a hero and make the other two candidates for the elections look inferior. However, his plan backfired when Jedi Master Qui-Gon Jinn and Padawan Obi-Wan Kenobi exposed the plot. Kenobi disguised himself as the Prince due to their apparent similar looks–both being adolescent boys of similar height. Obi-Wan acted like the arrogant Prince to help the ploy, which made thwarting Beju and the Syndicat's nefarious plan much easier.\nFortunately for Beju, Queen Veda did not know about his transactions, so he was able to proceed with the elections. When everyone found out that Veda had been poisoned, Beju arranged for her to be locked up for protection. He had a brief sword duel with Obi-Wan Kenobi and managed to wound him, but was no match for the Padawan's Force-powered reflexes. The fight was brought to a halt by Viso, Veda's blind supporter. Beju was then tested by the Mark of the Crown, which would determine if he was the rightful heir. The results turned out negative, to Beju's dismay, showing that Elan, his half-sister, was in fact the true heir. However, after being coxed by Kenobi, he honorably dropped out of the election and turned his attention to arresting leading Council Minister Lonnag Giba for the attempted murder of Veda.\nLater, Beju backed the remaining candidate Wila Prammi and met Elan for the first time. Both siblings were reconciled.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Beju",
  "/wiki/Gala",
  "/wiki/60_BBY/Legends",
  "/wiki/Galacian",
  "/wiki/Gender/Legends",
  "/wiki/Blue",
  "/wiki/Beju-Tallah_dynasty",
  "/wiki/Syndicat",
  "/wiki/Prince/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Veda_(Galacian)",
  "/wiki/King/Legends",
  "/wiki/Cana",
  "/wiki/Galacian_Gubernatorial_election,_44_BBY",
  "/wiki/Bacta/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Sword/Legends",
  "/wiki/Duel_on_Gala",
  "/wiki/The_Force/Legends",
  "/wiki/Viso",
  "/wiki/Elan_(Galacian)",
  "/wiki/Lonnag_Giba",
  "/wiki/Wila_Prammi",
  "/wiki/Jedi_Apprentice:_The_Hidden_Past",
  "/wiki/Jedi_Apprentice:_The_Mark_of_the_Crown",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Standard_year/Legends",
  "/wiki/44_BBY/Legends",
  "/wiki/Reproduction/Legends"
 ]
}