{
 "name": "Beke Mon'z",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "18 ABY",
      "Yavin 4"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ishi Tib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "New Republic Security Bureau",
      "New Republic Security Bureau",
      "Spice Runners of Kijimi"
     ]
    }
   ]
  }
 ],
 "content": "Beke Mon'z was an Ishi Tib male operative of the New Republic Security Bureau. Working for Officer Sela Trune, Mon'z infiltrated the smuggler gang known as the Spice Runners of Kijimi as a pilot. After the Spice Runners undertook a heist, they discovered that Mon'z had been siphoning part of the reward. Having learned that Mon'z was a traitor—but unaware of his allegiance to the New Republic—the Spice Runners killed him on the moon Yavin 4, subsequently becoming stranded until they recruited the resident Poe Dameron to be their pilot.\nDuring the time of the New Republic, Beke Mon'z served as an operative in the New Republic Security Bureau. He worked for Officer Sela Trune, who had a vendetta against the smuggler gang known as the Spice Runners of Kijimi. Trune sent Mon'z to infiltrate the Spice Runners, and the New Republic agent did so successfully, acting as the pilot of a Spice Runner group led by Vigilch, flying the XS stock light freighter Ragged Claw.\nWhile part of the Spice Runners, Mon'z fed intel on the gang to Trune. In 18 ABY, after the Spice Runners pulled off a heist on the astronomical object Kellgar Seven, gaining a large reward as a result, Mon'z skimmed from the score, passing portions of it to both the New Republic and the Spice Runners' competitors. His Spice Runner accomplices discovered that Mon'z had stolen from them; however, they were unaware that he was an agent of the New Republic. Following the heist, the group escaped to the moon Yavin 4, where they killed Mon'z for his treachery.\nAfter Trune was summoned to Yavin 4 due to reports of potential Spice Runner activity on the moon, the body of Mon'z was discovered at the docks of the Wetyin's Colony settlement. Without a pilot for the Ragged Claw, the Spice Runners were left stranded on Yavin 4, though they managed to escape with the help of the young resident and aspiring pilot Poe Dameron. Some time after the death of her operative, Trune remained haunted by visions of Mon'z's body, though was still unsure whether the Spice Runners had deduced his true purpose.\nAn Ishi Tib male, Beke Mon'z had green skin and a small figure. Following his death, his work was identified as sloppy by Trune, while Vigilch described the Ishi Tib as being sneaky.\nWhile infiltrating the Spice Runners, Mon'z piloted the XS stock light freighter Ragged Claw.\nBeke Mon'z was mentioned in the novel Poe Dameron: Free Fall, written by Alex Segura and published in 2020.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/18_ABY",
  "/wiki/Yavin_4",
  "/wiki/Ishi_Tib",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Security_Bureau",
  "/wiki/Spice_Runners_of_Kijimi",
  "/wiki/Officer",
  "/wiki/Sela_Trune",
  "/wiki/Smuggler",
  "/wiki/Pilot",
  "/wiki/Heist_on_Kellgar_Seven",
  "/wiki/Death",
  "/wiki/Moon",
  "/wiki/Poe_Dameron",
  "/wiki/New_Republic_Era",
  "/wiki/Vigilch",
  "/wiki/XS_stock_light_freighter",
  "/wiki/Ragged_Claw",
  "/wiki/Kellgar_Seven",
  "/wiki/Yavin_4_docks",
  "/wiki/Wetyin%27s_Colony",
  "/wiki/Time",
  "/wiki/Marinda_Gan",
  "/wiki/Poe_Dameron:_Free_Fall",
  "/wiki/Alex_Segura",
  "/wiki/2020",
  "/wiki/Poe_Dameron:_Free_Fall_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY"
 ]
}