{
 "name": "Belaya",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Zhar Lestin"
     ]
    }
   ]
  }
 ],
 "content": "Belaya was a Human female Jedi Guardian who resided in the Jedi Enclave on the planet Dantooine during the Jedi Civil War. A student of the renowned Jedi Master Zhar Lestin, Belaya was devoted to the Jedi traditions but struggled with controlling her emotions. She became very close to Juhani, a Cathar Padawan whose emotions were similarly volatile.\nA test of humility devised by Juhani's Master, Quatra, resulted in Juhani lashing out in anger and falling to the dark side when she mistakenly believed she had killed her Master. After the fallen Padawan fled to the nearby Ancient Grove, her dark emotions turned the surrounding kath hounds aggressive, but the Jedi Council would not permit Belaya to attempt to redeem her dear companion.\nWhen Revan, a former Jedi Knight who had lost his memories, arrived at the Jedi Enclave, Belaya confronted him about not being dressed in Jedi apparel, then apologized for her behavior. In Revan's final trial to become a Jedi once again, Master Lestin instructed him to confront and cleanse the darkness in the Ancient Grove. Revan spared Juhani and convinced her to return to the light. Afterward, Belaya expressed her gratitude to Revan for his actions, and she was reunited with Juhani until the redeemed Jedi joined Revan's quest to find the Star Forge and defeat Darth Malak and his Sith Empire.\nBelaya was a young, Force-sensitive female citizen of the Galactic Republic. During the time that the Jedi Knight–turned–Dark Lord of the Sith Darth Revan battled the Republic in the Jedi Civil War, Belaya sought a deeper knowledge of the Force and traveled to the Jedi Enclave on the Outer Rim planet Dantooine. Jedi Master Zhar Lestin, a Twi'lek male member of the Jedi Council there, trained her as a Jedi.\nAs Belaya continued her studies, she struggled with controlling her emotions, and her Master often reminded her that she must learn to do so. The Cathar Juhani, a fellow female Jedi learner, also had difficulties with managing her emotions. Throughout their time at the Enclave, Belaya and Juhani were dear companions to each other, spending many nights alone together under the stars.\nBy 3956 BBY, Belaya had become a Jedi Guardian, a path that focused more on combat skills than mental abilities in service to the Jedi Order and the Force. Meanwhile, Juhani had not yet completed her own training with Master Quatra.\nIn 3956 BBY, as part of a plan to end the Jedi Civil War, Jedi Padawan Bastila Shan brought the amnesiac Revan to the Enclave in order to convince its Council to retrain him in the light as a Jedi again. As Revan headed toward the Council Chambers, Belaya sensed the power of the Force within him and assumed he was a Padawan learner who had come to the Enclave.\nBelaya, not recognizing to whom she spoke, stopped Revan and demanded to know why he was not wearing the customary Jedi apparel. To Belaya, his attire suggested he might have been mocking the Jedi traditions and neglecting his studies, but he explained that he was not a Jedi and was accompanying Shan. Belaya spoke of Shan's reputation as a master of battle meditation, although she had also heard Shan took too much pride in her own abilities. As she could feel how strong the Force was within Revan, Belaya disbelieved his claim that he was not already part of the Jedi Order and suspected him of jesting in poor taste, accusations that Revan did not appreciate. Apologizing for how she had addressed him and acknowledging that she had much to learn, Belaya wished Revan well in his stay on Dantooine. Afterward, Revan completed several weeks of apprentice training before being deemed ready for the three trials to become a Padawan.\nDuring his first two trials, Belaya congratulated Revan on his quick progress toward the rank of Padawan, which she had discussed with their mutual teacher, Master Lestin. Their teacher also advised Revan to journey to the Crystal Cave on the Khoonda plains as he learned to alter his newly-constructed lightsaber. When Revan told Belaya he had heard about a cave with lightsaber crystals, she warned the student that the cave was dangerous and he should not involve himself in matters that were beyond him. She wished him luck in his training and for the Force to be with him.\nBelaya's companion Juhani was tested by Master Quatra near the end of the Cathar's training, but she lashed out in anger and mistakenly believed she had killed her Master. The enraged Juhani thus fell into darkness and fled to the nearby Ancient Grove, which was tainted by her embrace of her dark power and had its surrounding kath hounds turn violent, attacking local settlers. Because Belaya had always been close to Juhani, the Jedi Council would not allow her to approach the fallen Padawan, believing her intercession may be more harmful than helpful.\nIn the days following Juhani's fall, Revan was assigned by Master Lestin to enter the Ancient Grove as part of his third and final trial. The Jedi trainee was to cleanse the Grove's darkness without the assistance of any other Jedi at the academy; thus, neither Revan's companion Shan nor his acquaintance Belaya could be involved.\nRevan approached the Grove and was ambushed by Juhani. Although he defeated her in their duel, he refused to kill her; instead, he convinced her to return to the Enclave and seek the judgement of the Council. After the Council told Juhani the truth of Quatra's test and welcomed her return to the Jedi Order, Master Lestin informed Belaya of Revan's success in his trials.\nWhen Belaya spoke to Revan, she expressed her gratitude for his part in Juhani's redemption. After acknowledging the completion of his tests and the construction of his lightsaber, she cautioned him that he still had much to learn; as his power grew, he would struggle as other Jedi did with constant temptations to slip to the dark side.\nBelaya and Juhani, reunited at the Enclave, spent time together in the courtyard that Belaya frequented while Revan investigated the ruins on Dantooine. Soon afterward, Juhani left Belaya to join Revan's quest to find the Star Forge and defeat Darth Malak. During their search, Malak's Sith Empire bombarded the Enclave, resulting in many Jedi casualties. Malak was ultimately defeated by Revan; however, most members of the Jedi Order were killed by Sith forces during the subsequent Jedi purge.\nBelaya was a Human female with a light skin tone, brown eyes, and brown hair that she styled in a sleek, short ponytail. She was devoted to honoring the Jedi traditions and saw some deviations as making a mockery of them; for instance, she thought it was inappropriate to make jokes about the Jedi Order and disapproved when others did not wear Jedi robes. Although she was critical of Bastila Shan's pride, Belaya displayed her own through the unsolicited advice she gave to Revan before he rejoined the Order. She saw sacrifice and discipline as ways to achieve mastery, but she had not mastered her own emotions despite repeated warnings that she must learn to do so. When she met Revan, she was quick to form judgments based on his attire and acknowledged her mistakes in how she approached him.\nBelaya shared a deep connection with Juhani, whom she described as her dear companion, and the Council was aware that they had always been close. When Juhani fell, the Council did not permit Belaya to attempt Juhani's redemption herself; that instead became a trial for Revan while Belaya remained in the Enclave. When Revan succeeded at returning Juhani to the light side, Belaya was joyous but composed in expressing her gratitude.\nIn accordance with Jedi custom, Belaya wore a standard brown robe with a white tunic underneath, along with brown pants and dark gloves.\nBelaya appeared in the 2003 video game Star Wars: Knights of the Old Republic, developed by BioWare. She does not have a unique visual appearance, instead wearing robes common to other Jedi and sharing a head with several other female Human non-player characters. Belaya's first dialogue occurs in an unavoidable encounter when the player enters the Enclave courtyard for the first time, but further interactions are optional and dependent upon the status of other quests. The character Juhani and the quests on Dantooine were primarily written by Peter Thomas, whose notes are found in Belaya's game files.\nTo complete the first Jedi trial, the player is required to learn and recite the Jedi Code. Belaya is one of the characters who can teach it to them, along with Jedi Knight Deesra Luur Jada or Masters Dorak, Vrook Lamar, or Vandar Tokare.\nIf the player completed the Jedi trials by saving Juhani, Belaya can later offer commentary on two possible outcomes of the optional Sandral-Matale feud sidequest. Regarding the dark side option that leads to members of the Sandral and the Matale families killing each other and the player battling the Matale droids, Belaya wonders what dark force could have destroyed so many droids and killed so many people. If the player convinces the lovers Rahasia Sandral and Shen Matale to flee together to the Enclave instead of reconciling with their families, Belaya is glad that the player helped the couple find a way to remain together. Notes in her Dantooine dialogue tree indicate she was planned to comment if the player convinced Matale to return to his father or completed the light side option where the parents accepted the couple, but no lines were scripted for those outcomes.\nIn the non-canon storylines, the player can kill Juhani at the Ancient Grove, and an unavoidable encounter with Belaya will trigger upon returning to the Enclave. Belaya is heartbroken and furious at the player and the Jedi Council for their roles in Juhani's death. She believes Revan did not give Juhani a chance and that the Council should have sent a more experienced Jedi. To Belaya, they all failed to believe Juhani deserved better and was worth saving. Regardless of the player's intentions, Belaya cannot be consoled for her loss and Revan cannot stop her from running away.\nAfter Belaya's disappearance, the player can ask Vandar or Vrook about her. Vandar will express his concerns that she may have done something rash, saying of her, \"She had always been close to Juhani, and her death may have hit Belaya… hard.\" Vrook will observe that Belaya failed to show up for a lesson with Master Lestin and was seen leaving the Enclave; he does not know where she may have gone and warns against forcing her to return should the player encounter her.\nIf Revan killed Juhani on Dantooine, another automatic encounter with Belaya occurs during the quest to find the Star Map on the Outer Rim Sith world of Korriban. Belaya fell to the dark side after Juhani's death and became a student at the Sith Academy. Wearing a dark Jedi Knight robe, Belaya confronts Revan at the Academy's entrance and angrily questions their presence. She threatens to expose them if they are acting on behalf of the Jedi Council. Regardless of Revan's words, combat with Belaya is unavoidable; she ignites her red-bladed lightsaber and attempts to avenge Juhani. She has learned dark side abilities, such as wounding through choking and electrical shocks, manipulating minds to slow another's thoughts or produce fear, and draining life from others to heal herself. After killing her, Revan can loot credits, a droid shield, and Echani battle armor from her body.\nIf Dantooine has not yet been attacked, Revan can return there and tell Master Lamar of Belaya's fate. Disturbed by her fall and considering it a failing of the Jedi as her teachers, Lamar cautions Revan not to give in to darkness lest they experience a fate similar to Belaya's.\nJuhani was the first character in the Star Wars universe to be portrayed as LGBTQ+, specifically lesbian, although the exact nature of her relationship with Belaya, as well as Belaya's sexuality, was implied but not outright stated within the game. In a question-and-answer series on LucasArts' now-defunct LucasForums, Knights of the Old Republic co-designer David Gaider wrote of Dantooine and Korriban that the player \"could run into Juhani's former lover as well ,\" a description of events that only matches Belaya.\nIn 2013, Gaider further addressed the subject of how the writing team's assumptions about the player base's response to LGBTQ+ representation led to self-censoring Juhani's dialogue. At the first GaymerX convention, he said that Juhani had mentioned she had a female lover by saying they were very close. Although the dialogue is inexact, the description matches Belaya's character.\nAfter the 2021 announcement of Star Wars: Knights of the Old Republic – Remake, Gaider commented via Twitter on LGBTQ+ representation in the original game, saying that Juhani's past relationships could not be referred to as anything other than \"friends.\" Knights of the Old Republic: Prima's Official Strategy Guide, which was released by Prima Games in 2003, and Belaya's entry in the 2008 reference book The Complete Star Wars Encyclopedia described Belaya as \"friends\" with Juhani, while the game itself used the euphemistic phrase \"dear companion.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Jedi/Legends",
  "/wiki/Canon",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Belaya_Rist",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Zhar_Lestin",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Planet/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Juhani",
  "/wiki/Cathar_(planet)",
  "/wiki/Padawan/Legends",
  "/wiki/Quatra",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Death/Legends",
  "/wiki/Ancient_Grove",
  "/wiki/Kath_hound/Legends",
  "/wiki/Dantooine_Jedi_Enclave_Council",
  "/wiki/Revan",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Amnesia/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Forge",
  "/wiki/Darth_Malak",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Time/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Revan/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Cathar/Legends",
  "/wiki/Local_day/Legends",
  "/wiki/Star/Legends",
  "/wiki/3956_BBY",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Bastila_Shan",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Battle_meditation",
  "/wiki/Standard_week/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Teacher/Legends",
  "/wiki/Crystal_Cave_(Dantooine)",
  "/wiki/Khoonda_plains",
  "/wiki/Revan%27s_lightsaber",
  "/wiki/Lightsaber_crystal",
  "/wiki/May_the_Force_be_with_you/Legends",
  "/wiki/Colonist/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Rakatan_ruins_(Dantooine)",
  "/wiki/Attack_on_Dantooine_(Jedi_Civil_War)",
  "/wiki/Battle_of_Rakata_Prime",
  "/wiki/Sith/Legends",
  "/wiki/First_Jedi_Purge",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Glove/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Peter_Thomas",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Deesra_Luur_Jada",
  "/wiki/Vrook_Lamar",
  "/wiki/Vandar_Tokare",
  "/wiki/Sandral-Matale_feud",
  "/wiki/Sandral_family",
  "/wiki/Matale_family",
  "/wiki/Sentinel_droid",
  "/wiki/Droid/Legends",
  "/wiki/Rahasia_Sandral",
  "/wiki/Shen_Matale",
  "/wiki/Ahlan_Matale",
  "/wiki/Korriban",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Dark_Jedi_robe",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Force_Slow",
  "/wiki/Mind_trick/Legends",
  "/wiki/Force_drain/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Droid_shield",
  "/wiki/Echani_battle_armor",
  "/wiki/Star_Wars",
  "/wiki/LucasArts",
  "/wiki/David_Gaider",
  "/wiki/2013",
  "/wiki/2021",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_%E2%80%93_Remake",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Prima_Games",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Category:Images_of_Belaya",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Old_Republic:_Revan",
  "/wiki/May_15",
  "/wiki/2018",
  "/wiki/March_19",
  "/wiki/February_13",
  "/wiki/March_1",
  "/wiki/2010",
  "/wiki/March_28"
 ]
}