{
 "name": "Bela_Hara",
 "display_name": "Bela Hara",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Barab I"
     ]
    },
    {
     "name": "Died",
     "values": [
      "27 ABY",
      "Baanu Rass  over Myrkr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Barabel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi OrderWild Knights",
      "Wild Knights",
      "New Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Saba Sebatyne"
     ]
    }
   ]
  }
 ],
 "content": "Bela Hara was a female Barabel Jedi Knight of the New Jedi Order, who was the hatchmate of Tesar Sebatyne and Krasov Hara. Bela was trained in the ways of the Force by Saba Sebatyne and was a member of the Force-sensitive squadron, known as the Wild Knights, that was formed by her Master. Bela participated in several campaigns throughout the Yuuzhan Vong War; most notably she was a member of the Myrkr strike team and was one of many to die during that disastrous mission.\nDue to Barabel mating customs, it was impossible for Bela to know if she shared a father with Tesar Sebatyne. However, while aware that she was definitely the sister of Krasov Hara, the two referred to themselves as hatchmates, along with Tesar. The three were each trained in the ways of the Jedi by Tesar's mother, Saba Sebatyne. Bela's experiences with her two hatchmates resulted in them sharing an extremely strong connection through the Force, which served them well as members of the Wild Knights; allowing them to sense the intentions and feelings of the others during combat.\nAfter Saba decided that her three apprentices would go to the Jedi academy to continue their Force training under Jedi Master Luke Skywalker, the Wild Knights set out for Yavin 4. However, the academy had been destroyed by the Yuuzhan Vong, and the squadron was forced to fight its way through Yuuzhan Vong held space to rendezvous with the New Jedi Order.\nThe three hatchmates were then nominated by Master Skywalker to aid in a mission to hunt voxyn. The team was tasked with gaining voxyn samples so as to help Cilghal confirm her theory that voxyn came from a common template. During this mission a New Republic ship was attacked by the Yuuzhan Vong and the hatchmates impressed their fellow Jedi, including Kyp Durron, with their control of the Jedi battle meld.\nBela, along with Tesar and Krasov, chose to go to Myrkr as part of the strike team. Bela became the fourth Jedi to die during the disastrous mission, after having been bitten by an amphistaff. Tesar and Krasov used telekinesis to levitate the body of their beloved hatchmate for some time, until they were forced to use it to lure out feral voxyn; they felt that Bela would have been honored to help her hatchmates, and the remainder of the strike team to escape. Shortly after Bela's death, Krasov was killed when a voxyn spat acid at her face.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Barab_I/Legends",
  "/wiki/27_ABY/Legends",
  "/wiki/Baanu_Rass",
  "/wiki/Myrkr/Legends",
  "/wiki/Barabel/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Wild_Knights",
  "/wiki/New_Republic/Legends",
  "/wiki/Saba_Sebatyne",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Tesar_Sebatyne",
  "/wiki/Krasov_Hara",
  "/wiki/The_Force/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Myrkr_strike_team",
  "/wiki/Mission_to_Myrkr",
  "/wiki/Kyp_Durron",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Cilghal",
  "/wiki/Jedi/Legends",
  "/wiki/Force_meld",
  "/wiki/Amphistaff",
  "/wiki/Telekinesis/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Bela_Hara",
  "/wiki/The_New_Jedi_Order:_Recovery",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_Destiny%27s_Way",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}