{
 "name": "Bela Kiwiiks",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Well before 3663 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red",
      "White and blue stripes"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Ngani Zho"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Kira Carsen"
     ]
    }
   ]
  }
 ],
 "content": "Bela Kiwiiks was a female Togruta Jedi Master who served the Jedi Order and the Galactic Republic during the Great Galactic War, the Cold War, and the Galactic War with the resurgent Sith Empire. One of the apprentices of Ngani Zho, she fought as a Jedi Knight in the Battle of Rhen Var alongside Satele Shan, Jaric Kaedan, and Syo Bakarn. In the aftermath of the Sacking of Coruscant and the end of the Great Galactic War, all four former students of Zho were appointed to the Jedi High Council as Jedi Masters, and in the decade following the Treaty of Coruscant Kiwiiks took on a young woman named Kira Carsen as her apprentice when she discovered the teenage Human on the moon of Nar Shaddaa.\nIn 3643 BBY, the Council began to sense a dark presence on the Republic capital of Coruscant, and Kiwiiks was sent to the planet with her Padawan to investigate. Kiwiiks was soon joined by fellow Council member Orgus Din and his former apprentice, who discovered that the Republic's secret superweapon projects were in danger of being discovered by the Empire, and she traveled to the desert world of Tatooine at the request of the Republic general Var Suthra in order to secure the Shock Drum weapon.\nA Force-sensitive Togruta, Bela Kiwiiks was discovered by the Jedi Order and trained as a Jedi by the Human Jedi Master Ngani Zho, along with Satele Shan, Syo Bakarn, and Jaric Kaedan. By the year 3663 BBY, Kiwiiks had achieved the rank of Jedi Master, and she fought alongside other Jedi and the forces of the Republic Military in the Great Galactic War against the resurgent Sith Empire. During the course of the conflict, she became friends with her fellow Jedi Masters Orgus Din and Tol Braga, relationships that would continue throughout her friends' lives.\nNear the end of the war, she participated in the Battle of Rhen Var alongside Zho's other former students—Satele Shan, Syo Bakarn, and Jaric Kaedan—where the four aided the Forty-fifth Battalion in the fight against the Imperial military. Between the four of them, they had fought on the ash plains of Lenico IV and against Gelpog the Tyrant on his asteroid-hives, and they were all powerful warriors in their own right. Under Shan's leadership, the Republic and Jedi forces were able to drive the Empire off of the icy planet, and Shan single-handedly defeated the Dark Councilor Darth Mekhis in a duel.\nIn 3653 BBY, the Empire attacked the Republic capital of Coruscant in what would become known as the Sacking of Coruscant, and they used the captive world as a bargaining chip to force the Republic to sign the Treaty of Coruscant and end the war. During the Sacking, six members of the Jedi High Council were killed, including Grand Master Zym. However, after Shan discovered the Order's ancient homeworld of Tython in 3651 BBY and was elevated to the rank of Grand Master as a result, the remaining Masters decided to appoint Kaedan, Kiwiiks, Bakarn, and Shan as the newest Council members.\nThe Jedi Order decided to relocate to Tython a year after its discovery when the Senate postponed the reconstruction of the Jedi Temple indefinitely, and the Council oversaw the construction of a new Temple over the next three years. As the Order began to rebuild their ranks, the galaxy settled into a tense Cold War in which neither the Empire nor the Republic openly engaged the other galactic power. In 3645 BBY, Kiwiiks traveled to the neutral moon of Nar Shaddaa on a mission for the Order, and was surprised to find a young Human female attempting to steal her ship's hyperdrive when she returned to the spaceport.\nSensing the power of the Force within the eighteen-year-old girl, whose name was Kira Carsen, Kiwiiks decided to take her on as her Padawan and returned to Tython. The headstrong young woman occasionally chafed under her master's more conservative and passive teachings, but the two soon developed a strong bond between master and apprentice. The pair traveled to many planets during their time together, including the agriworld of Uphrades, but always returned to the Order's homeworld of Tython.\nBy 3643 BBY, Kiwiiks and her Padawan were on Tython during a Flesh Raider uprising. At the time, a talented Padawan, whom Orgus Din chose to take on as his Padawan, had defeated a Dark Jedi apprentice named Callef, who was found carrying a Jedi lightsaber. Further investigation discovered that the Flesh Raiders were taught to use the Force, which Kiwiiks assumed they learned from a holocron the Padawan had found. However, Din realized that the perpetrators behind the attacks was his former Padawan, Bengel Morr, presumed dead in the Sacking of Coruscant. While Din and his Padawan remained on Tython to stop Morr, Kiwiiks and Carsen journeyed to Coruscant to investigate a dark presence on the Republic capital.\nDin and his Padawan, now a full-fledged Jedi Knight, went to Coruscant too and met with Kiwiiks and Carsen during a meeting with General Var Suthra and Doctor Eli Tarnis, regarding the controversial Planet Prison a superweapon that could ionized a planet's atmosphere, disabling any ships that tried to leave and safely blockading the planet without loss of life. Kiwiiks expressed concern regarding the design files that had been stolen, but Tarnis was seemingly unconcerned about the security risks. Tarnis brushed off her protest, stating that the files were too encrypted for anyone to understand, but Var Suthra informed the Jedi that his agents were searching tirelessly for the files.\nWhile Din, Kiwiiks, and Suthra met with Supreme Chancellor Dorian Janarus aboard the Chancellor's cruiser Founder, Din ordered his former apprentice to aid the Republic agents in recovering the files. Kiwiiks also left her Padawan with the Knight and Tarnis, suggesting that Carsen's security expertise might be useful.\nLater, when the Knight recovered the stolen files, an SIS agent decrypted them and discovered that they contain information on all of the Republic superweapon projects. Kiwiiks immediately departed for Tatooine to secure the Shock Drum. But shortly after her arrival at the Shock drum facility, she was attacked and defeated by Darth Angral's apprentice, Lord Praven. He took her captive and acquired the Shock Drum, but left the facility staff unharmed. Kiwiiks and the superweapon were taken to a cave in the Dune Sea, where Angral ordered the weapon activated and for Kiwiiks to be left near it. Kiwiiks put herself into a deep trance to protect herself from the intense vibrations emanating from the weapon. Thankfully, the Knight and Carsen, now the Knight's Padawan, arrived in time to save her, deactivating the Shock Drum with Praven's transmitter. As the Knight ordered the Shock Drum destroyed, Carsen came clean to Kiwiiks about her past as a Child of the Emperor. Kiwiiks told her former student that her past doesn't matter, but what's important is that she is proud of her.\nKiwiiks was then returned to Tython to recover from her ordeal. She would've nearly had a shortly recovery when Angral combined all the superweapon projects into the Desolator in an attempt to destroy the Jedi Order. Thankfully, the Knight and Carsen defeated Angral and saved Tython. When the two came before the Jedi Council, Kiwiiks lamented the untimely death of Din, who was killed by Angral before his confrontation with the Knight. Master Shan added that while they lost one of their greatest masters, in his place stands the Knight, a Jedi without equal. She then turned to Carsen, glad that she managed to reject the Sith Emperor during their confrontation with Angral. On the Knight and Kiwiiks' recommendation, the Council granted Carsen the rank of Jedi Knight.\nHowever, Var Suthra informed the Council that they are receiving reports of hostilities across the galaxy. Kiwiiks remarked that even in death, Angral had finally inspired the Sith to violence. Shan added that the Knight, whom she christens as the Hero of Tython, to be their most valuable against the rising darkness and the Force had shown her that the weight of the galaxy rest on their shoulders.\nAbout a year later, the Hero and Carsen joined a strike team formed by Tol Braga in a daring plan to capture the Emperor, bring him to Tython and redeem him to the light side. But before they departed, Masters Shan, Kiwiiks and Kaedan requested a moment of their time. Braga's former team member Jomar Chul had received a Force vision revealing that if the Hero joins the mission, it will fail and the Jedi Knight will fall to the dark side and join the Sith. Braga dismissed his concerns, stating that the future is always in motion and that the Council doesn't place judgment solely on visions. Nonetheless, the Hero chose to defer to the decision of the Council. Kiwiiks expressed confidence in the Hero's loyalty, and Shan agreed with her. As Chul stormed out of the Council chamber, frustrated that they won't heed his warning, Kaedan pleaded Braga to reconsider but the Kel Dor was certain his plan would work.\nWhen Braga's team never returned from their mission, the Council feared that they had failed. After many months, the Hero and their companions returned, accompanied by Lord Scourge, the Emperor's Wrath, who had suddenly switched sides. Scourge explained to the Council that centuries ago, he had a vision that the Emperor will destroy the galaxy but the Hero will be the one to stop him. Renewed war is only a diversion to conceal the Emperor's true plan, threatening the death of all living things. He explained that a thousand years ago, the Emperor used a life-sapping ritual on his home planet of Nathema, consuming all life on the planet and used those life essences to become immortal. Now he plans on recreating the ritual on a galactic scale to become virtually unstoppable. But the ritual requires billions of simultaneous deaths, which he plans on initiating on Belsavis. Kiwiiks worried that the Emperor had finally discovered the location of the Republic prison planet, which the Jedi have hidden for decades. Scourge stated that once the sacrifice occurs, the ritual cannot be stopped and insisted they save Belsavis. Kaedan didn't trust the Sith, to the point where he holds his lightsaber to his throat. However, the Hero vouched for Scourge's relative trustworthiness and the Sith insisted that he's better off working against the Emperor than imprisoned. Shan consented to an alliance but warned the Hero not to become too reliant on Scourge.\nKiwiiks was later stationed on Corellia during a significant battle, where she was cornered by two Sith assassins. The Sith showed her a holo of Master Braga, corrupted to the dark side by the Emperor, who ordered them to kill her. Thankfully, the Hero of Tython arrived to her rescue once again. When the Hero explained to Kiwiiks their intent to rally the Jedi to stop Braga from committing mass genocide, the Togruta admitted that she never fully recovered from her ordeal on Tatooine. Instead, she felt that she should help evacuate the wounded, an idea the Hero agreed with.\nMaster Kiwiiks was a proficient warrior who could hold her own against Sith and Imperial troopers during the Great Galactic War, but later in her life the years began to wear on the Togruta. Kiwiiks utilized her green-bladed lightsaber with great skill in combat. During her assignment to Tatooine, she was easily able to take out the complement of Imperial troopers and war droids sent to seize control of the Shock Drum Facility, but Praven's greater strength and size allowed him to defeat the Jedi Master.\nWhen Kiwiiks was left to die before the Shock Drum, she survived only by entering a healing trance and shielding herself from most of the damaging vibrations. However, the trance consumed much of her power.\nBela Kiwiiks first appeared in The Old Republic—The Lost Suns 1, the first issue of the The Lost Suns arc of the Star Wars: The Old Republic comic series. She appears alongside Jaric Kaedan, Syo Bakarn, and Satele Shan in a flashback to the Battle of Rhen Var, though does not appear again in the series. Her next appearance is in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by LucasArts and BioWare on December 20, 2011. She is a recurring character throughout the Jedi Knight class storyline, first appearing in the Tython mission \"Enemy Force\".\nDuring the flashpoint \"The Nathema Conspiracy\", if the Outlander is a Jedi Knight of the dark side alignment, Bela Kiwiiks will seek to stop them and join the Order of Zildrog led by Vinn Atrius, only to be sacrificed as fuel to awaken Zildrog by GEMINI 16 on Nathema. If the Jedi Knight remained on the Light Side they will encounter Servant One instead, while the other classes face antagonists from their own class stories.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3663_BBY",
  "/wiki/Togruta/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Ngani_Zho",
  "/wiki/Kira_Carsen",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Battle_of_Rhen_Var",
  "/wiki/Satele_Shan",
  "/wiki/Jaric_Kaedan",
  "/wiki/Syo_Bakarn",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Human/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/3643_BBY",
  "/wiki/Tarnis_(Sith_Lord)",
  "/wiki/Coruscant/Legends",
  "/wiki/Orgus_Din",
  "/wiki/Hero_of_Tython",
  "/wiki/Superweapon/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/General/Legends",
  "/wiki/Var_Suthra",
  "/wiki/Shock_Drum",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Tol_Braga",
  "/wiki/Forty-fifth_Battalion",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Battle_on_the_Ash_Plains_of_Lenico_IV",
  "/wiki/Lenico_IV",
  "/wiki/Engagement_in_the_asteroid-hives_of_Gelpog_the_Tyrant",
  "/wiki/Gelpog",
  "/wiki/Asteroid/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dark_Council",
  "/wiki/Darth_Mekhis",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/3653_BBY",
  "/wiki/Capital/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Zym",
  "/wiki/Tython/Legends",
  "/wiki/3651_BBY",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Temple_(Tython)/Legends",
  "/wiki/3648_BBY",
  "/wiki/The_galaxy/Legends",
  "/wiki/3645_BBY",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Agriworld/Legends",
  "/wiki/Uphrades",
  "/wiki/Flesh_Raider_uprising",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Callef",
  "/wiki/Holocron/Legends",
  "/wiki/Bengel_Morr",
  "/wiki/Planet_Prison",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Dorian_Janarus",
  "/wiki/Darth_Angral",
  "/wiki/Praven",
  "/wiki/Dune_Sea/Legends",
  "/wiki/Children_of_the_Emperor",
  "/wiki/Desolator_(superweapon)",
  "/wiki/Tenebrae",
  "/wiki/Jomar_Chul",
  "/wiki/Force_vision/Legends",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Scourge",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Nathema",
  "/wiki/Belsavis/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Battle_of_Corellia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_1",
  "/wiki/Star_Wars:_The_Old_Republic,_The_Lost_Suns",
  "/wiki/Star_Wars:_The_Old_Republic_(comics)",
  "/wiki/LucasArts",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Alliance_Commander",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Order_of_Zildrog",
  "/wiki/Vinn_Atrius",
  "/wiki/Zildrog",
  "/wiki/GEMINI_16",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Servant_One",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Hall_Hood",
  "/wiki/Timeline_1:_Treaty_of_Coruscant",
  "/wiki/The_Holonet",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_1:_Treaty_of_Coruscant",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound",
  "/wiki/Battle_of_Ilum",
  "/wiki/In-universe",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Video_game"
 ]
}