{
 "name": "Beldorion",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nal Hutta"
     ]
    },
    {
     "name": "Died",
     "values": [
      "13 ABY",
      "Nam Chorios"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "9 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Beldorion was a Hutt Jedi Knight serving the Jedi Order and the Galactic Republic roughly four hundred years before the founding of the Galactic Empire. After being sent to Nam Chorios, he fell to the dark side and established himself as the ruler of the planet. He was killed in a lightsaber duel with Leia Organa Solo in 13 ABY.\nDiscovered by the Jedi Order before 400 BBY, records indicate that Beldorion was the only known Hutt to enter into the Order. He was trained at the Jedi Temple on Coruscant. During his training, he and other Jedi Initiates were taken to the Caves of Masposhani, where they ran races, and to dark worlds like Af'El and Y'nybeth to hone their Force sense. Beldorion graduated from the academy and was taken as a Padawan by a Jedi Master. Following years of travel and study, Beldorion passed his Trials of Knighthood and was elevated to the rank of Jedi Knight. Taking on missions from the Jedi High Council, Beldorion was dispatched to Nam Chorios with fellow Knight Taselda in 400 BBY.\nWhile on the planet the two Jedi Knights failed to complete their mission when they fell to the lure of the dark side of the Force and abandoned the Order. Beldorion cast aside Taselda as the weaker half of the team and established himself as the ruler of the world. Providing his subjects with honorifics which he should be addressed by such as \"Beldorion of the Ruby Eyes\" and \"Beldorion the Splendid,\" Beldorion was corrupt and enslaved many. While originally prepared as Beldorion's meal, the Droch known as Dzym came to conspire with the Hutt, helping the Dark Jedi remain strong and youthful in exchange for the freedom to access the planet's rare Tsil stones.\nAvoiding the Great Jedi Purge, it wasn't until 13 ABY that Beldorion's relatively unopposed rule was disrupted by the arrival of Jedi Callista Ming. While she was unsuccessful in getting to the Hutt and imprisoned, her disappearance drew the attention of additional Jedi: Luke Skywalker, the founder of the rebuilt Order, and his twin sister, Leia Organa. Like Ming, Organa was also captured by the Hutt who divulged stories from the past, recalling the histories of Jedi Masters Thon and Yoda. During her captivity, Organa was able to regain possession of her lightsaber and engage her captor in a duel. Though the centuries-old Dark Jedi was powerful, Organa was able to move more freely and bisected the Hutt at the mid-section.\nBeldorion was somewhat adept in the Force, though by the time Leia Organa Solo encountered him in 13 ABY, his strength had greatly decayed as a result of centuries of Dzym feeding off his energy. Nevertheless, he was still powerful enough to generate huge Force storms. Additionally, he was able to use Telekinesis to summon a glass, though when he attempted the same feat with a tray he was unsuccessful. When angered by his servant, Liegeus Vorn, he would occasionally use the Force to inflict painful migraines as punishment. Beldorion had some skill using Force persuasion, and his gaze was considered by some to be hypnotic. However, he failed to use this power to influence Leia Organa Solo, who was only marginally trained in the Force and was drugged at the time.\nUnlike most Hutts, Beldorion used the Force to maintain a muscular form, allowing him to retain his prowess with a lightsaber after several centuries of life. Having crafted a lightsaber with a purple blade, Beldorion would change the trajectory of his lightsaber strikes in a battle, demonstrating some attributes of the seventh form of lightsaber combat.\nAdditionally, his immense strength enabled him to swing his blade with a massive force nearly sufficient to break the wrists of a Human. However, his skills with a lightsaber were not sufficient to defeat Leia Organa Solo, who killed him at the conclusion of their brief duel.\nIn The New Essential Chronology, The New Essential Guide to Characters, Balance Point, and Conviction, his name is erroneously spelled Beldorian.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/13_ABY/Legends",
  "/wiki/Nam_Chorios/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/400_BBY",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Caves_of_Masposhani",
  "/wiki/Masposhani",
  "/wiki/Af%27El",
  "/wiki/Y%27nybeth",
  "/wiki/Force_sense/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Jedi_academy",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Knighting_ceremony/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Taselda",
  "/wiki/Droch",
  "/wiki/Dzym",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Tsil",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Callista_Ming",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Thon",
  "/wiki/Yoda/Legends",
  "/wiki/Sai_tok/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_storm_(weather)",
  "/wiki/Telekinesis/Legends",
  "/wiki/Liegeus_Vorn",
  "/wiki/Mind_trick/Legends",
  "/wiki/Lightsaber",
  "/wiki/Form_VII/Legends",
  "/wiki/Planet_of_Twilight",
  "/wiki/The_New_Jedi_Order:_Balance_Point",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Wizards.com",
  "/wiki/The_Planet_of_Twilight",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_140",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}