{
 "name": "Bell Zettifar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "250 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.78 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Loden Greatstorm",
      "Indeera Stokes"
     ]
    }
   ]
  }
 ],
 "content": "Bell Zettifar was a human male who was the Padawan of Jedi Master Loden Greatstorm. Born in 250 BBY, Zettifar was discovered by the Jedi Order at the age of three. Zettifar and Master Greatstorm were stationed on the Elphrona Outpost, where they helped keep the peace. Zettifar wielded a standard green lightsaber, and was the owner of a charhound named Ember.\nBell Zettifar was a human male born in 250 BBY. At some point, he was identified to be Force-sensitive by the Jedi Order and apprenticed to the Twi'lek Jedi Master Loden Greatstorm. Zettifar trained as his Padawan for multiple years.\nWhen Zettifar was eighteen, the Legacy Run was destroyed in what became known as the Great Hyperspace Disaster and sent pieces of the starship hurtling across the galaxy. Zettifar and Greatstorm were part of the Republic response team sent to the Hetzal system to protect the evacuating civilians. On the surface of Hetzal Prime, the two Jedi confronted a group of security guards that were preventing a large group of citizens from attaining passage offworld as was ordered by Minister Zeffren Ecka. Zettifar and his master ended up having to fight off a force of attacking pirates as well as deal with the guards.\nIn the aftermath of the Great Disaster, Zettifar and his master traveled to a Jedi outpost on the planet Elphrona. They were stationed there with Indeera Stokes, Jedi Master Porter Engle, and the charhound Ember. Zettifar continued to be trained by Greatstorm, who worked to help him master controlled descent from a great height by aid of the Force. Zettifar was unsuccessful with learning the maneuver and had to be saved by Stokes, who Greatstorm had positioned on the ground in case his Padawan was in danger. Zettifar was embarrassed that he had to be saved, but he then went to eat with Stokes when Engle announced that he was making Nine-Egg Stew. However, their meal was interrupted when the Jedi received a distress signal from the Blythe family. The four Jedi showed up at the Blythe homestead and found that they had been kidnapped. They chased down the Nihil raiders that had captured them, splitting up at one point so Stokes could get a ship and Engle could take care of the enemy rearguard.\nZettifar and Greatstorm recovered the mother, Erika, and defended her as the enemy ship strafed the area. When they pursued the ship into space, Zettifar would leave his master's side to save the daughter, Bailen, whom the Nihil had ejected into space in an attempt to lose their pursuers.\nZettifar travelled on Starlight Beacon as it was being towed through hyperspace by the Halcyon and other Republic ships to Eiram. After it arrived in orbit, he went to the surface of the planet to assist with the aid efforts.\nZettifar was present with other Jedi on a Longbeam cruiser as it made its way through the Nefitifi system nebula, searching for the Nihil. He informed his master, Indeera Stokes, that there were no transmissions in the Nefitifi system. The Jedi reached out with the Force and were able to locate a Nihil ship. Bell and the other Jedi boarded it, using rebreathers to neutralize the Nihil's gas attacks. Zettifar was pleased that he was taking the fight to the Nihil, but cautioned himself to not feel vengeance against his enemies. The Jedi proceeded to take over the ship and capture prisoners.\nThey travelled to Starlight Beacon to drop off the prisoners for interrogation. Bell was tasked with checking the supplies in the medical tower. After that, his master advised him to take some time to recuperate. Zettifar and his friend Burryaga Agaburry agreed to meditate together, but Zettifar wanted to see his pet charhound, Ember, first. The group watched as Chancey Yarrow and Nan were taken to a detention cell.\nSoon after, refugees from the Nihil attacks started to arrive at Starlight Beacon. Zettifar assisted with the wounded but started to dwell too much on the pain and injuries. Agaburry took him aside and told Zettifar that he needed to take a break before he became overwhelmed. They left the medical tower and went to the observation deck where Zettifar talked to the Wookiee about his distress at not realizing that his former master had been captured and tortured by the Nihil. The padawan regretted not trying to do something to rescue Greatstorm. The two padawans went to spar. During the session, Zettifar felt as something was off on Starlight Beacon, but couldn't place it. Agaburry confirmed the feeling. As they pondered what to do, the docking bay doors opened and Zettifar realized that more refugees were arriving. As the padawans went to help out, Zettifar came across Ghirra Starros who was leaving the station. He felt that she was up to something, but was unable to sense anything with the Force.\nThe Jedis onboard Starlight Beacon assembled to discuss the attack on Chespea Temple. While most wanted to concentrate on the refugees of the various Nihil attacks, Zettifar suggested the more important task was to figure out what was effecting the Force users on the station.\nSeveral days after the Nihil saboteurs arrived on Starlight Beacon, they met Zettifar as he was giving out rations. He finished his duties and talked to Stokes about investigating the disruption of the Force they were feeling. She told him that she was going to do it, and refused his help. He was sent to finish his tasks, such as inventorying the refugee's cargo manifests. She tried to assuage his fears of losing another master by telling him she would be with other Jedi and she would be careful. He returned to the medical tower and continued to help with patients.\nAfter Stokes was attacked in the cargo bay by a Nameless and brought to the medical tower, Zettifar was horrified that he hadn't felt his master being attacked through the Force. He stayed with his master through the evening, missing the nightly distribution of rations. Agaburry stopped by with the food, and inquired about Stokes. Zettifar said he couldn't connect to his master through the Force. Agaburry suggested they try to work together but Zettifar discovered that they still couldn't access the Force and it felt like it was distorted and far away.\nZettifar was still in the medical tower when the bombs planted by the Nihil exploded, heavily damaging the station. He tried to calm the patients as the lights went out and emergency power engaged. He tried to contact the Hub, but couldn't get through. He comforted Ember and strategized with Agaburry about their next steps. A droid pointed out that an Eiram medical cruiser had approached the station. Zettifar pondered how to make contact with it when Agaburry suggested using an LT-16 droid. The droid responded that its transmission range was limited but Zettifar figured out that they could boost it by providing more power. Once the droid made contact with the cruiser, Zettifar transmitted a message about the situation on the station. The medical cruiser assessed the situation and transmitted the results of its scan. The padawan was shocked at the damage to the station and learned that it was slowly falling out of orbit. After looking closer at the scan provided by the Eiram, Zettifar determined that the maintenance shafts could be used to travel to other parts of the station.\nZettifar and Agaburry made their way back to the main docking bay, where they rejoined the other Jedi. Elzar Mann sent Zettifar and Agaburry to help calm the crowd in the docking bay. As they did, the station suffered some structural failure, which caused Zettifar to lose his footing. As he steadied himself against a wall, he could feel heat emanating from it. He realized that there was a problem with the auxiliary power and reported it to the rest of the Jedi. Stellan Gios instructed him and Agaburry to assist with the repairs. As it became more apparent that the station was going to tear in half, Zettifar vowed to return to the medical tower so he could be with Ember and Stokes. Zettifar returned to the docking bay to calm the passenger trapped there and to check on the status of the medical tower. He returned to work on the auxiliary power systems and managed to get them stabilized. Agaburry suggested they go look for Orla Jareni and they went to the cargo bay. He discovered her desiccated corpse on the deck and commed Gios with the bad news. The Jedi Master directed Zettifar to put up a containment field around the remains. Zettifar and Agaburry realized that Assek had also been investigating the Force disturbance and continued to search for her. They soon found her husked remains in the cargo bay. Zettifar comforted his friend who was distraught over the loss of his master.\nThe two padawans returned to the quartermaster's office and informed Mann about the deaths of the two Jedi Masters. He quickly came up with a plan of action and ordered the padawans to find non-Force users to assist with blocking off parts of the station to prevent the threat from reaching the rest of the Jedi. Zettifar led a group of people to the airlocks and showed them how to manually close them. As he worked, he came up with an idea that would allow some of the people trapped on the station to flee. He proposed that people board the ships in the cargo bay and then force open the doors. With the area sealed off, the explosive decompression would be lessened and the ships could then safely depart the station. To prep for the plan, Zettifar checked the cargo manifests to make sure all excess items could be dumped to increase space for passengers. He came upon several ships that were described as carrying live rathtars. He was checking the ships and inadvertently released several of the creatures.\nZettifar drew his lightsaber and started to attack the rathtars, but was blocked by Agaburry. The Wookiee informed him that the creatures reproduced by fission so it was prudent not to slice them in half. Zettifar was able to stab one through its body, killing it. The rathtars were distracted by an emergency flare and Zettifar and the others were able to flee the cargo bay, sealing it behind them. He returned to the quartermaster's office and reported to the Jedi. He also explained his plan for getting some of the passengers off of Starlight Beacon. Gios ordered him to return to the medical tower to assess the situation there and come up with a plan to rescue the patients. He made his way back to the medical tower and checked on Ember and Stokes. He then worked on the problem of saving the patients stuck in the medical tower. He realized that if he could separate the tower from Starlight Beacon, the medical cruiser would be able to catch it in a tractor beam and dock with it using one of the internal air locks that would then be accessible. He contracted Gios and detailed his plan. The Jedi Master thought about how Zettifar had matured during this crisis and predicted he would become a great Jedi Knight. After clearing his plan with Gios, Zettifar constructed a crude bomb and planted at the base of the medical tower and sealed the air locks. The detonation blew the tower clear of Starlight Beacon. As the Eiram moved the tower clear of the station, Zettifar felt the Force returning to him and wondered how the remaining Jedi could cope with the limitations they were experiencing.\nAfter confirmed everyone was safe, he called back to the Starlight Beacon to see if he could be of any more assistance. Gios congratulated him on ingenuity but regretfully informed him that Agaburry was presumed dead after being attacked by a pair of rathtar in the cargo bay. Zettifar took a shuttle from the Eiram medical cruiser and headed back to the station, determined to help in any way possible. As he got close, he started to be affected by the Nameless and managed to pull away from the station. He realized if he went back onboard, he would become ineffective. He reached out to the station, and got in touch with Affie Hollow who was working on restoring the escape pods. She asked him to visually confirm the escape pods would not be damaged when launching.\nAfter the destruction of Starlight Beacon, Zettifar landed on Eiram and assisted the Jedi with doing the final repairs on the desalination plant. He returned to the shuttle and went to search for Agaburry, refusing to believe he was dead.\nBell Zettifar was created for the Star Wars: The High Republic multimedia project, a narrative initiative to explore the Jedi centuries before the events of Star Wars: Episode I The Phantom Menace. He first appeared in the initial release of High Republic media, simultaneously debuting in the novel Light of the Jedi by Charles Soule as well as the young readers book The Great Jedi Rescue by Cavan Scott on January 5, 2021. Zettifar was first revealed to the public ahead of the initiative's release on October 21, 2020 in a StarWars.com article that gave an overview of some of the Jedi Padawans that would be introduced in the upcoming project.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Set_For_Life",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_Trail_of_Shadows_1",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/250_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Loden_Greatstorm",
  "/wiki/Indeera_Stokes",
  "/wiki/Padawan",
  "/wiki/Jedi_Master",
  "/wiki/Reproduction",
  "/wiki/Elphrona_Outpost",
  "/wiki/Lightsaber",
  "/wiki/Charhound",
  "/wiki/Ember_(charhound)",
  "/wiki/Force-sensitive",
  "/wiki/Twi%27lek",
  "/wiki/Legacy_Run",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Starship",
  "/wiki/The_galaxy",
  "/wiki/Hetzal_system",
  "/wiki/Hetzal_Prime",
  "/wiki/Minister",
  "/wiki/Zeffren_Ecka",
  "/wiki/Elphrona",
  "/wiki/Porter_Engle",
  "/wiki/Ember",
  "/wiki/Controlled_descent",
  "/wiki/The_Force",
  "/wiki/Nine-Egg_Stew",
  "/wiki/Blythe_family",
  "/wiki/Blythe_homestead",
  "/wiki/Nihil",
  "/wiki/Erika_Blythe",
  "/wiki/Bailen_Blythe",
  "/wiki/Hyperspace",
  "/wiki/Halcyon",
  "/wiki/Eiram",
  "/wiki/Longbeam_cruiser",
  "/wiki/Nefitifi_system_nebula",
  "/wiki/Nefitifi_system",
  "/wiki/Starlight_Beacon",
  "/wiki/Burryaga_Agaburry",
  "/wiki/Chancey_Yarrow",
  "/wiki/Nan",
  "/wiki/Starlight_Beacon_detention_center",
  "/wiki/Wookiee",
  "/wiki/Ghirra_Starros",
  "/wiki/Chespea_Temple",
  "/wiki/Saboteur",
  "/wiki/Nameless",
  "/wiki/Droid",
  "/wiki/Eiram_medical_cruiser",
  "/wiki/Unidentified_LT-16_droid",
  "/wiki/Elzar_Mann",
  "/wiki/Stellan_Gios",
  "/wiki/Orla_Jareni",
  "/wiki/Airlock",
  "/wiki/Rathtar",
  "/wiki/Bell_Zettifar%27s_lightsaber",
  "/wiki/Shuttle",
  "/wiki/Affie_Hollow",
  "/wiki/Escape_pod",
  "/wiki/Desalination_plant",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/Standard_century",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Charles_Soule",
  "/wiki/The_High_Republic:_The_Great_Jedi_Rescue",
  "/wiki/Cavan_Scott",
  "/wiki/January_5",
  "/wiki/2021",
  "/wiki/October_21",
  "/wiki/2020",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Bell_Zettifar",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Showdown_at_the_Fair",
  "/wiki/The_High_Republic:_Trail_of_Shadows_2",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Battle_for_Starlight",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Soule_Man",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Geonosis_and_Other_Outer_Rim_Planets",
  "/wiki/Star_Wars:_Inner_Jedi",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)"
 ]
}