{
 "name": "Bellow",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Benglor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "501st Legion",
      "501st Legion"
     ]
    }
   ]
  }
 ],
 "content": "\"Bellow\" was a clone trooper who served in the 501st Legion of the Galactic Republic during the Clone Wars. On a mission to investigate Confederacy of Independent Systems activity on the planet Benglor in 22 BBY, Bellow served under Jedi General Anakin Skywalker and Clone Captain Rex.\nDuring the mission, Bellow discovered parts of a B1-series battle droid while trekking through jungle with Skywalker and several other clones. After searching for more clues, Bellow was attacked by a creature that caught and ate him.\nBellow was the nickname of a clone trooper serving in the 501st Legion of the Grand Army of the Republic during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Like all of the Republic's clone troopers, he was created and trained on the planet Kamino as a clone of the human bounty hunter Jango Fett. During the Clone Wars in 22 BBY, he served under Jedi General Anakin Skywalker and Clone Captain Rex on a mission to the planet Benglor in order to investigate Separatist activity there.\nBellow trekked through the hot jungle of Benglor with Skywalker, Rex and two other clones, in search of Separatists. Just as Skywalker began considering ending the mission due to the extreme heat, the clone Hardcase discovered goo on one of the nearby trees, which he alerted the others to as a potential clue.\nBellow then discovered a B1-series battle droid head in a sand mound near the goo, and claiming that his evidence was better than Hardcase's, presented it to Rex and the Jedi. As the clones discovered more parts of the droid, Skywalker realized the pieces had been purposefully left as a trail for them to find. However, before he could warn the others of the potential trap, Bellow discovered more of the goo and called out to the others.\nSkywalker called out to the clone as a large creature emerged from the undergrowth behind Bellow and attacked him. The clone had time only to turn and cry out in horror as the creature wrapped its tongue around him and then swallowed the trooper. When Skywalker then ordered the others to retreat, Hardcase refused and attacked the creature in order to avenge Bellow. The Jedi was then forced to save Hardcase, and ultimately slew the creature with aid from Rex. Rex later told Clone Commander CC-2224 the tale of Bellow's death during the Separatist siege of the planet Hisseen.\nAs a clone of Jango Fett, Bellow had tan skin, brown eyes, and black hair that he wore in a mohawk. He stood 1.83 meters tall.\nBellow wore Phase I clone trooper armor with the blue stripes of the 501st on each arm.\nBellow appeared in a flashback in the 2020 comic book Star Wars Adventures: The Clone Wars – Battle Tales 1, which was written by Michael Moreci and illustrated by Arianna Florean.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bellows_(clone_trooper)",
  "/wiki/Kamino",
  "/wiki/22_BBY",
  "/wiki/Benglor",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/501st_Legion",
  "/wiki/Clone_trooper",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Benglor",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Planet",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/B1-series_battle_droid",
  "/wiki/Jungle",
  "/wiki/Unidentified_quadruped_(Benglor)",
  "/wiki/Death",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Trooper",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Hardcase",
  "/wiki/Tree",
  "/wiki/Jedi",
  "/wiki/Droid",
  "/wiki/Time",
  "/wiki/Tongue",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Siege_of_Hisseen",
  "/wiki/Hisseen",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Limb",
  "/wiki/2020",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales_1",
  "/wiki/Michael_Moreci",
  "/wiki/Arianna_Florean",
  "/wiki/Category:Images_of_Bellow",
  "/wiki/Databank_(website)",
  "/wiki/Clone_template",
  "/wiki/Battle_of_Christophsis",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Christophsis",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year"
 ]
}