{
 "name": "Bella_(Twi%27lek)",
 "display_name": "Bella  (Twi'lek)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Lok"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent SystemsSabaoth Squadron",
      "Sabaoth Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Bella was a female Twi'lek who served the Confederacy of Independent Systems as a lieutenant to Captain Cavik Toth during the Clone Wars. In 22 BBY, she flew a personal assault transport and commanded the destroyer Reaver.\nBella was Cavik Toth's most trusted lieutenant. She oversaw the test of Toth's new weapon Trihexalon on Point Modie on the planet Maramere. Jedi Master Adi Gallia and Reti intervened to protect the innocents. Despite the results showing that the test was successful, Bella wanted to finish off the city. However, Adi Gallia managed to stop any more severe damage to the city.\nBella was then on the Sabaoth Destroyer Reaver commencing a salvage run on the Orbital Defense Cannon. However the Lok Revenants had the same idea which resulted in her forces on a Tug of War for the parts, Bella lost all of the parts but she did have a back-up plan in case of this. She sent a couple of Sabaoth Frigates to try to stop the Tritus from heading to Lok but even that had failed. She then went to Lok with Toth make a stand against the Lok Revenants but the pirates placed the Orbital Defense Cannon on one of Lok's moons known as Khons which started the Second Battle of Lok.\nAfter the defenses failed and Nym destroyed the foundry. Lieutenant Bella decided to take the fight with Nym in her personal assault transport. Despite overwhelming firepower she was killed in a dogfight with Nym.\nBella, like Toth, was cruel and heartless. Bella was adamant on destroying Point Modie with the Trihexalon despite reaching satisfying conclusions on the weapons test. While she could come up with back-up plans in case of failure, she didn't tolerate it calling her forces 'incompetent worms' and threatened them by saying that \"if you want to live another day kill them all\". Like Toth, she didn't seem to accept defeat even when she was facing it.\nThere are two ways to defeat Bella. One is to dogfight her; the second is to wait until her craft slows down to a crawl and target her for the Orbital Defense Cannon. This requires timing but if done correct her ship will suffer a direct hit from the cannon and will be destroyed. \"Bella\" in Italian means Beauty.\nShe is voiced by Sterling James in the game Star Wars: Jedi Starfighter.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Lok/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Sabaoth_Squadron/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Cavik_Toth",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Bella%27s_assault_transport",
  "/wiki/Reaver_(Sabaoth_destroyer)",
  "/wiki/Trihexalon",
  "/wiki/Point_Modie",
  "/wiki/Maramere",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Reti",
  "/wiki/Sabaoth_Destroyer",
  "/wiki/Orbital_Defense_Cannon",
  "/wiki/Sabaoth_Frigate",
  "/wiki/Tritus",
  "/wiki/Khons",
  "/wiki/Second_Battle_of_Lok",
  "/wiki/Nym/Legends",
  "/wiki/Worms",
  "/wiki/Sterling_James",
  "/wiki/Star_Wars:_Jedi_Starfighter",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}