{
 "name": "Ben_Quadinaros",
 "display_name": "Ben Quadinaros",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tund"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Toong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.63 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  }
 ],
 "content": "Ben Quadinaros was an inexperienced Toong podracer pilot who raced on the amateur circuits before entering the Boonta Eve Classic podrace on the planet Tatooine in 32 BBY. He rented a BT310 quadra-Podracer for the competition, and prior to the race, he conversed with fellow racer Teemto Pagalies in the hangar of the Mos Espa Grand Arena. On the day of the race, Quadinaros waved to the cheering crowd as his name was announced by the race's commentator, Fodesinbeed Annodue; however, when the Hutt crime lord Jabba Desilijic Tiure signaled for the competition to begin, Quadinaros' vehicle stalled on the starting grid.\nThe racer hammered his fists against his vehicle as a group of DUM-series pit droids attended to it, although to no avail. As the rest of the racers neared the end of their first lap, Quadinaros' engines finally ignited just as the vehicle's energy binders deactivated. The four engines thus flew free of the vehicle and exploded, leaving Quadinaros sat on the floor of the arena as other pilots raced past. Despite his embarrassing loss, Quadinaros persisted in podracing and was billed as the racer Sebulba's arch-nemesis on the poster The Sport's Greatest Rivalry during the Clone Wars.\nBen Quadinaros was a Toong male from the planet Tund in the Tund system who became a famous podracer on his homeworld. After racing on amateur circuits that prepared races to be safe and had few accidents, he joined the professional circuits by participating in the Boonta Eve Classic on the planet Tatooine, in the Grand Arena of the city Mos Espa. Despite being the least experienced racer taking part in the event, Quadinaros was rumored to be the one to watch. The Toong rented a BT310 quadra-Podracer from the manufacturer Balta-Trabaat in Mos Espa specially for the race.\nPrior to the race, Quadinaros presented himself alongside the other racers at the venue's hangar, where his vehicle was stored. While in the hanger, he walked past the Dug racer Sebulba as the latter received a massage from the Twi'lek enslaved twins Ann and Tann Gella. After the pod of the human racer, Anakin Skywalker, was brought into the hangar, the Toong, who was nervous before the race, chatted with the Veknoid podracer Teemto Pagalies near the entrance to the building. Prior to the race, the Nuknog podracer Ark Roose attempted to sabotage Skywalker's vehicle but instead crippled Quadinaros' podracer.\nAs the setup for the race began, Quadinaros' podracer was pulled from the hangar to the starting line by a dewback. The racer stood amongst his competitors' vehicles and smiled and waved to the crowd as the race's Troig commentator, Fodesinbeed Annodue, listed him first while announcing the participants. Once the participants had been introduced, each of their flags were carried in procession across the starting grid, including Quadinaros' flag, which consisted of five separate thin, triangular flags: the top two red; the bottom two orange; and the central flag yellow.\nOn Annodue's command, Quadinaros and the other racers started their engines as the race track was cleared of non-participants. When the event's host, crime lord Jabba Desilijic Tiure, sounded the start of the race, Quadinaros' power couplings failed, which resulted in his engine malfunctioning and failing to ignite, causing the vehicle to stall. As other racers left the starting grid, Skywalker also encountered engine troubles, and as Annodue commented on the two racers stuck on the starting grid, four of the Toong's DUM-series pit droids raced out to aid him as he hammered his fists into the display screen of his podracer's cockpit and tried in vain to restart the engines.\nAs the rest of the racers passed through the Canyon Dune Turn, Quadinaros' pit droids left his pod and returned to the side of the race track. Despite their intervention, the BT310 suffered total breakdown and the power couplings deactivated before more pit droids, aiming to avoid collisions, could arrive and move the vehicle away from the starting grid.\nLosing his composure, the Toong cursed and continued to hammer on the podracer's display screen causing the vehicle's energy binders to switch off, meaning that when the vehicle's engine did suddenly ignite, all four of his engines detached from the vehicle's cockpit and flew off individually, exploding as they crashed into arena walls or the ground. Even as his pod slowly lowered to the ground, Quadinaros continued to curse and pound his fists into it until other racers reached the end of their first lap and rushed past him, prompting the Toong to duck and cover his head with his arms, although he was in fact perfectly safe and soon abandoned the race. Ultimately, Skywalker won the race and left Tatooine to join the Jedi Order.\nDespite his embarrassing loss at the Boonta Eve Classic, Quadinaros persevered with the sport and was eventually billed as Sebulba's greatest rival. The Toong would go on to win the Boonta Eve Classic at some point before podracing became less popular on Tatooine. During the Republic Era, a sporting poster titled The Sport's Greatest Rivalry was produced under the name Codenka Mafurias, which, according to artist Janyor of the planet Bith, was presumably the alias of an art workshop bankrolled by Marlo the Hutt. The poster depicted Quadinaros as an underdog with Sebulba as his arch-rival, showing the Toong racing in a BT310 quadra-Podracer across a rocky landscape.\nIn 19 BBY, Skywalker, by then a Jedi Knight, had a copy of The Sport's Greatest Rivalry hung on the wall of his personal quarters in the Jedi Temple on the planet Coruscant. Later in the Clone Wars, an altered version of the poster that only showed Quadinaros and his vehicle hung in Galactic Republic clone trooper barracks in Fort Anaxes on the world of Anaxes. In 2 BBY, Jedi Padawan Ezra Bridger also had the altered version of the poster on the wall of his cabin on the VCX-100 light freighter Ghost. Shortly after the Hosnian Cataclysm in 34 ABY, Jaynor published A History of Persuasive Art in the Galaxy, a book that included mention of Quadinaros in relation to The Sport's Greatest Rivalry. In addition, Quadinaros was mentioned in an artist's journal, which was restored, expanded, and displayed at the Graf Archive at some point no earlier than 34 ABY.\nBen Quadinaros was more comfortable on the amateur podracing circuits and was quite terrified of the Boonta Eve Classic, panicking shortly before the race about the fact that he would be competing in such an impressive and dangerous competition. The fact that he was using a vehicle he had rented at the last moment only increased this anxiety. However, he hoped the race would end a streak of bad luck.\nDespite Toongs being extremely timid by nature, he overcame his shyness to become a podracer and participate in the sport. The racer was short by Toong standards at 1.63 meters in height, but was the tallest entrant in the Boonta Eve Classic. He was innovative, pudgy, and comic-faced, with yellow skin and orange eyes. He had three antennas on top of his head and spoke in a language other than Galactic Basic Standard.\nAt the time of the Boonta Eve Classic, Quadinaros was a largely inexperienced rookie podracer, having only raced on relatively safe amateur tracks that were the antithesis of the chaotic and dangerous professional circuit. However, he later came to be billed as rival to the famous podracer Sebulba.\nBen Quadinaros wore a gray bodysuit while participating in the Boonta Eve Classic and used a hastily put-together BT310 quadra-Podracer that he had rented specially for the race. The BT310 was difficult to control for any rider, but especially hard to master for amateurs like Quadinaros. His vehicle had seen better days, but was faster than any of the other podracers in the Boonta Eve Classic bar that of Anakin Skywalker. The rental had been hastily prepared before being rented to the Toong and so did not match the specifications given for it. It was decorated with scarlet and brown flames on a gray and silver background.\nBen Quadinaros was created for the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. In the revised rough draft of the film's script, Quadinaros was not included among a list of the pilots participating in the podrace, with a Slide Paramita of Tund mentioned instead. Paramita was not used in the film, but he was developed into a separate character for the 1999 Star Wars Legends video game Star Wars Episode I: Racer. In one of The Phantom Menace's deleted scenes, Quadinaros is shown referring to a datapad and checking his podracer cockpit's display screen as other racers start their engines. He then throws the datapad toward his engines and hammers his fists on the screen.\nConceptual art for Quadinaros in The Phantom Menace was created by designers Terryl Whitlatch and Iain McCaig, with Whitlatch producing three pieces in 1996 showing the anatomy and range of movement for the character and McCaig producing two different costume concepts on May 21, 1997. A Model Build/Shoot Gantt chart for the film dated February 27, 1998, listed a pair of puppet arms for \"Ben Quad\" as being needed for use between May 10 and May 24 of that year.\nIn Whitlatch's pieces, the character was labeled \"Ben Cuvidoros,\" and in McCaig's, the labels named him \"Ben Quadidaros.\" Quadinaros' final name was likely derived from the \"quadra-Pod\" racing engines of his vehicle. His name was misspelled as \"Quadiaros\" in the Databank entry for the Tund system on StarWars.com. In the 2016 reference book Star Wars: Complete Locations, Quadinaros' flag is erroneously listed as belonging to the racer Mawhonic, while Quadinaros is incorrectly shown to be using the flag that belongs to the racer Clegg Holdfast.\nDuring a featurette for the fourth season of the Star Wars: The Clone Wars television show, supervising director Dave Filoni asked lead designer Kilian Plunkett if he believed that Quadinaros should appear in the show, but Plunkett responded that there was no room for the character as they should leave some mystery to the racer. They then joked that perhaps the Boonta Eve Classic was the only race he ever lost and that they could make a documentary-style series on the character.\nQuadinaros is featured in the non-canon LEGO Star Wars: The Freemaker Adventures episode \"Race on Tatooine,\" which aired on July 18, 2016. He was voiced by Dee Bradley Baker speaking an alien language. In the episode, Quadinaros helps the Hutt crime lord Graballa lure the Freemaker family into a trap on Tatooine after the criminal threatens to snap his antenna off. The podracer contacts the family to hire them as a replacement pit crew and claims that his usual crew have caught sand rot. The three Freemaker siblings accept and travel to Tatooine to work on a decoy podracer they believe belongs to the Toong. Quadinaros then introduces them to his \"sponsor,\" revealing Graballa with several of the Hutt's henchmen. The Freemakers realize that Quadinaros has betrayed them, but Graballa explains that the Toong did not do so willingly and dismisses him.\nQuadinaros then participates in the 29th Annual Bricklayers' Classic at the Mos Espa Grand Arena and manages to reach first place by the third lap; however, the Freemakers catch up with him, having escaped Graballa's clutches in the decoy podracer they had been working on. The family crashes into Quadinaros' podracer and causes his engines to separate from his cockpit, leaving him in the dust as they fly on to win the race.\nQuadinaros also appears in LEGO Star Wars: Droid Tales, a non-canon series retelling the events of each of the original trilogy and prequel trilogy films. The first episode, \"Exit from Endor,\" aired on July 6, 2015. In it, Quadrinaros is shown in the protocol droid C-3PO's retelling of The Phantom Menace; however, his podracer explodes on the starting grid before the Boonta Eve Classic even has begun. \"Gambit on Geonosis,\" the final episode of the series, aired on November 2, 2015. It features a retelling of the 1983 film Star Wars: Episode VI Return of the Jedi, with Quadinaros appearing in the retelling as one of several allies that join the Jedi Luke Skywalker and his friends in fighting Jabba during the skirmish at the Great Pit of Carkoon on Tatooine. Aboard Jabba's sail barge, Quadinaros and the other allies form a pyramid acrobatic formation.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Ben_Quadinaros",
  "/wiki/Ben_Quadinaros/Legends",
  "/wiki/Ben",
  "/wiki/Tund",
  "/wiki/Toong",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/File:Annodue-Engine_Trouble.ogg",
  "/wiki/Podracer",
  "/wiki/Podracer_(profession)",
  "/wiki/Podracing",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/32_BBY",
  "/wiki/BT310_Quadra/Legends",
  "/wiki/Racer",
  "/wiki/Teemto_Pagalies",
  "/wiki/Hangar",
  "/wiki/Mos_Espa_Grand_Arena",
  "/wiki/Standard_day",
  "/wiki/Fodesinbeed_Annodue",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Limb",
  "/wiki/DUM-series_pit_droid",
  "/wiki/Engine",
  "/wiki/Energy_binder",
  "/wiki/Sebulba",
  "/wiki/The_Sport%27s_Greatest_Rivalry",
  "/wiki/Clone_Wars",
  "/wiki/File:Quadinaros_Intro.ogg",
  "/wiki/Tund_system",
  "/wiki/Homeworld",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Balta-Trabaat",
  "/wiki/Dug",
  "/wiki/Twi%27lek",
  "/wiki/Slavery",
  "/wiki/Ann_Gella",
  "/wiki/Tann_Gella",
  "/wiki/Anakin_Skywalker%27s_Podracer",
  "/wiki/Human",
  "/wiki/Anakin_Skywalker",
  "/wiki/Veknoid",
  "/wiki/Nuknog",
  "/wiki/Ark_Roose",
  "/wiki/Dewback",
  "/wiki/Troig",
  "/wiki/File:Annodue-Power_Coupling.ogg",
  "/wiki/Mos_Espa_podrace_circuit",
  "/wiki/Power_coupling",
  "/wiki/Cockpit",
  "/wiki/Canyon_Dune_Turn",
  "/wiki/Droid",
  "/wiki/Jedi_Order",
  "/wiki/Republic_Era",
  "/wiki/Codenka_Mafurias",
  "/wiki/Artist",
  "/wiki/Janyor",
  "/wiki/Bith_(planet)",
  "/wiki/Marlo",
  "/wiki/19_BBY",
  "/wiki/Jedi_Knight",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Galactic_Republic",
  "/wiki/Clone_trooper",
  "/wiki/Clone_barracks",
  "/wiki/Fort_Anaxes",
  "/wiki/Anaxes",
  "/wiki/2_BBY",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ezra_Bridger",
  "/wiki/Classic_Podracer",
  "/wiki/VCX-100_light_freighter",
  "/wiki/Ghost",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/34_ABY",
  "/wiki/A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Book",
  "/wiki/Unidentified_artist",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Graf_Archive",
  "/wiki/File:Quadinaros.ogg",
  "/wiki/Eye",
  "/wiki/Antenna",
  "/wiki/Language",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Clothing",
  "/wiki/1999",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Slide_Paramita",
  "/wiki/Star_Wars_Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Episode_I:_Racer",
  "/wiki/Datapad",
  "/wiki/Terryl_Whitlatch",
  "/wiki/Iain_McCaig",
  "/wiki/1996",
  "/wiki/May_21",
  "/wiki/1997",
  "/wiki/February_27",
  "/wiki/1998",
  "/wiki/May_10",
  "/wiki/May_24",
  "/wiki/Databank_(website)",
  "/wiki/Star_system",
  "/wiki/StarWars.com",
  "/wiki/2016",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Mawhonic",
  "/wiki/Clegg_Holdfast",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Dave_Filoni",
  "/wiki/Kilian_Plunkett",
  "/wiki/File:Graballa-Quadinaros.ogg",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Race_on_Tatooine",
  "/wiki/July_18",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Alien",
  "/wiki/Graballa/LEGO",
  "/wiki/Freemakers/LEGO",
  "/wiki/Sand_rot",
  "/wiki/Mission_to_Tatooine_(Kyber_Saber)",
  "/wiki/29th_Annual_Bricklayers%27_Classic",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Original_trilogy",
  "/wiki/Exit_from_Endor",
  "/wiki/July_6",
  "/wiki/2015",
  "/wiki/3PO-series_protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Gambit_on_Geonosis",
  "/wiki/November_2",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Khetanna",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/The_Bad_Batch_(episode)",
  "/wiki/Choose_Your_Destiny:_A_Podracer_Mission",
  "/wiki/Star_Wars_Rebels:_Steps_Into_Shadow",
  "/wiki/Star_Wars_Rebels",
  "/wiki/The_Holocrons_of_Fate",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/From_Trenches_to_Wrenches:_The_Roger_Story_(episode)",
  "/wiki/The_Prisoner_of_Tatooine",
  "/wiki/Star_Wars:_The_Complete_Saga",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Four",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Star_Pilot_(2015)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars_Made_Easy",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Maker_Lab",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition",
  "/wiki/The_Star_Wars_Archives:_Episodes_I%E2%80%93III,_1999%E2%80%932005",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Inside_Intel:_Podracing",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Land,_Sea_and_Air_Speeders_(II)",
  "/wiki/Category:Audio_files_of_Ben_Quadinaros",
  "/wiki/Category:Images_of_Ben_Quadinaros",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Wrong_Jedi",
  "/wiki/A_Death_on_Utapau",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Standard_year",
  "/wiki/In-universe",
  "/wiki/Poe_Dameron",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Amilyn_Holdo",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide",
  "/wiki/Databank_(original)"
 ]
}