{
 "name": "Bender  (rancor)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rancor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nirama's public asteroid"
     ]
    },
    {
     "name": "Owner(s)",
     "values": [
      "Riboga the Hutt",
      "Nirama"
     ]
    }
   ]
  }
 ],
 "content": "Bender was a young rancor owned by the crime lord Nirama. A naming day gift from Riboga the Hutt circa 53 BBY, Bender was not much bigger than a Wookiee, with his name tattooed on his left shoulder in both Basic and Huttese. Nirama kept him well fed, giving Bender small animals and allowing him to hunt them for himself.\nIn 31 BBY, a secret movement within Nirama's Organization calling themselves the Cell stole Bender away from where Nirama was keeping him on Nirama's public asteroid. A couple of days later, they used him to test the prowess of a group of new recruits that had just started working on the asteroid, unleashing him upon them inside an abandoned restaurant, Mokada's Place. The recruits were actually spies for Nirama, and had heard him speak the name \"Bender\" earlier. Noticing the tattoos and realizing that Bender was only trying to play with them, not hunt them, the recruits were able to subdue the rancor without harming him, impressing the Cell. Later, after the spies were extracted from their mission, they reported Bender's location to Nirama. He immediately sent a squad to Mokada's, and they found him tied up in the kitchen. Bender later died in 19 BBY, after he was eaten by his father, Dinky.\nBender's canonical fate was decided through a poll among the official RPGA playing teams of TopWorld.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bender_(droid)",
  "/wiki/19_BBY/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Nirama%27s_public_asteroid",
  "/wiki/Riboga",
  "/wiki/Hutt/Legends",
  "/wiki/Nirama",
  "/wiki/Crime_lord/Legends",
  "/wiki/Naming_day",
  "/wiki/53_BBY/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Organization",
  "/wiki/The_Cell",
  "/wiki/Mokada%27s_Place",
  "/wiki/Dinky",
  "/wiki/RPGA",
  "/wiki/TopWorld",
  "/wiki/The_Hand_(adventure)"
 ]
}