{
 "name": "Bendu",
 "display_name": "Bendu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Atollon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Unknown"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Force"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Kanan Jarrus"
     ]
    }
   ]
  }
 ],
 "content": "Bendu was a Force-sensitive entity who resided on the remote planet of Atollon and claimed to represent the center of the Force, between the light side and the dark side. Bendu encountered Jedi Knight Kanan Jarrus in 2 BBY. He developed a friendly relationship with Kanan and his Padawan Ezra Bridger and helped the two Jedi repair their relationship and deal with their fears and anxieties. Despite his wisdom and powers, Bendu refused to take sides in any conflict, and was angered when Kanan called him a coward for not intervening during the Battle of Atollon, which caused him to unleash a storm against both the rebel and Imperial forces on Atollon.\nAn ancient being, Bendu claimed to represent the center of the Force, standing between the light and the dark side. As he rested peacefully on the planet Atollon, Bendu acquired countless knowledge over the years of his lifespan as he meditated in the Force. During this time, he always chose not to interfere in the ways and teachings from the Jedi or Sith, but he chose to still aid force-sensitives, training them to overcome their fears and internal conflict through personal trials.\nAt some point in his life, Bendu became familiar with the Sith and the process of fusing Jedi and Sith holocrons together, witnessing the results and consequences of such a vergence.\nBy 3 BBY, Bendu still lived on Atollon where the Phoenix Cell maintained a base.\nSometime later, Bendu called out to the Jedi Knight Kanan Jarrus, who was meditating outside Chopper Base. Kanan had retreated into meditation after losing his sight during a Mission to Malachor. Bendu called out to Kanan and eventually led him into a series of mesas in the wilderness. When Kanan finally arrived, Bendu told the Jedi Knight that his imbalance had awoken him from his slumber. After introducing himself, he allowed Kanan to identify himself as a Jedi Knight. Bendu listened as Kanan told him about his fear that his apprentice Ezra Bridger was falling to the dark side. When Kanan showed him the Sith holocron that Ezra had obtained on Malachor, Bendu explained that an object could not make someone good or evil. However, he stressed that only a person could choose to change themselves. Bendu then took an interest in Kanan's sensor beacon, which the Jedi had used to ward off several krykna, arachnid predators that were indigenous to Atollon.\nBendu then destroyed the sensor marker. When Kanan protested, he told the Jedi that he would never regain his sight but that he could teach Kanan to see through his other senses. When Kanan agreed to take his lesson, Bendu instructed the Jedi to empty his mind, turn around and walk forward. Kanan was quickly surrounded by two krykna which did not attack him. Bendu then explained that Kanan's bad experience with creatures stemmed from not seeing them for what they actually were. Kanan began to make peace with the krykna but was startled when he sensed that Ezra was in danger. After igniting his lightsaber, Kanan realized that the krykna had been feeding off his fear and emotions. When Kanan deduced that he had isolated himself from everyone and the Force, Bendu commented that he had finally regained his Force connection. Before leaving to rescue Ezra, Kanan left the Sith holocron with Bendu. Bendu then inspected the object and laughed.\nAfter the former Sith Maul kidnapped the other crew of the Ghost, Kanan and Ezra traveled on a speeder bike to Bendu's lair in Atollon's wilderness. The two Jedi were surrounded by several krykna but Bendu awoke and scared them away. When Bendu asked the two Jedi whether they had come for a chat, Ezra related to the Force-wielder their predicament with Maul. Ezra and Kanan explained that Maul desired both the Sith holocron and Kanan's own Jedi holocron. While Bendu was unfamiliar with Maul, he remarked that the convergence of the Sith and Jedi holocrons would be dangerous.\nBendu corrected Ezra's view that the holocrons were merely libraries and pointed out that they could grant clarity of vision but also produce chaos. When Ezra reiterated that he needed the Sith holocron in order to save his friends, Bendu optioned that the object was a source of imbalance between him and his master Kanan. However, he told the boy that he needed to enter a cave inhabited by krykna in order to retrieve the Sith holocron. Before entering the cave, Kanan instructed his apprentice to leave his lightsaber behind and to use a comlink instead. When asked why, Kanan explained that his apprentice needed to learn how to resolve problems without a lightsaber. Kanan then went in after him when Ezra's comlink was damaged by krykna, asking Bendu to keep an eye on their lightsabers. Remaining outside, Bendu remarked to himself and a curious dokma that perhaps the two would mend their bond or perhaps they would be eaten instead, but brushed off the latter option as being the way of things.\nThe two Jedi successfully managed to retrieve the Sith holocron after a trial which involved Ezra learning to overcome his fear of the krykna and forgiving himself for the events on Malachor, mending the frayed bond between himself and his master; outside the cave, Bendu sensed this and smiled. After Ezra and Kanan returned from the cave, Bendu expressed satisfaction that the imbalance between master and apprentice had been resolved. However, he warned the two Jedi that their true test had just begun. Since Maul was unable to open the Jedi holocron, Bendu told the pair that the task would have to fall on one of them. When Ezra suggests they could wield the power of both holocrons, Bendu warned him that it came with a price. He stressed that once a secret was known, it could not be unknown.\nAfter Maul used the dark side of the Force to torment Ezra with Force visions, Ezra and Kanan traveled into the wilderness to seek help from Bendu. Bendu had been expecting them and remarked that they were \"not exactly quiet creatures.\" When Ezra told Bendu that Maul had resurfaced, Bendu replied that joining the holocrons together would bring great wisdom and danger at the same time. Ezra admitted that this was the price of his power and that his vision was incomplete because he let go before the holocrons could reveal their full secrets.\nBendu remarked that this was not a good sign. When Bendu asked Ezra what he wanted, he advised Ezra and Kanan not to turn around. Despite his warnings, the two Jedi turned around and saw Maul watching them from atop a dune. When Kanan turned back around Bendu was gone. Maul then persuaded Ezra to come with him to Dathomir in return for keeping the location of Chopper Base a secret. Kanan and Sabine followed Maul and Ezra to Dathomir. Following a skirmish with the spirits of fallen Nightsisters, they discovered that the Jedi Master Obi-Wan Kenobi held the key to destroying the Sith.\nWhile the Mandalorian weapons expert Sabine Wren was undergoing instruction with the Darksaber, she went to a rock to contemplate on her fears and struggles about her family. Ezra went to comfort her and reassured her that Kanan meant well. Realizing that Ezra was right, Sabine went into the wilderness to clear her mind. As she left, Bendu surfaced but did not initiate contact with her.\nEventually, Grand Admiral Thrawn located the rebel forces at Atollon and ambushed them there. Kanan went to the wilderness to seek out Bendu for help. However, Bendu refused to help Kanan in order to keep his neutrality and blamed him for bringing the war to Atollon. Kanan then called Bendu a coward, which led to Bendu rising into a ball of smoke and exclaiming that perhaps it was the will of the Force to destroy the Jedi \"and all your kind,\" which he vowed to carry out. While Kanan returned to Chopper Base, the Empire initiated an orbital bombardment on Atollon.\nAfter Thrawn landed on Atollon and trapped the rebel leaders at Chopper Base, all were drawn to look at a gathering storm in the sky, with one bolt of lightning almost striking Thrawn himself. Two glowing yellow eyes appeared in the midst of the clouds and Bendu's echoing voice proclaimed his identity. He then cried \"I bring death!\" and unleashed powerful lightning strikes onto the ground, destroying two AT-AT walkers and several grounded rebel starfighters. Desiring his world to be left in peace, Bendu ordered both Rebels and Imperials alike to leave Atollon, killing several death troopers with his lightning strikes as emphasis. Kanan and his fellow Rebels then attempted to flee on the Ghost; noticing the fleeing rebel ships, Bendu called out to Kanan by name and struck the Ghost with lightning, though not hard enough to destroy it. One A-wing was destroyed by him but the others escaped, so Bendu increased his onslaught on the Imperials, demanding again that they leave. Dismissing the attack as \"Jedi devilry,\" Thrawn ordered his forces to shoot at the eye of the storm. Bendu was struck by fire coming from the remaining walkers and a squad of death troopers, causing the huge Force entity to fall from the sky and crash to ground.\nAfter the defeated rebel forces abandoned the system, Thrawn found Bendu lying wounded on the ground and asked him what sort of creature he was. The defiant Bendu replied that he was one far beyond Thrawn's power to destroy. When Thrawn disagreed, Bendu warned him that he could see where the Chiss could not; his defeat, like \"many arms surrounding him in a cold embrace.\" Angered and unnerved by this prediction, Thrawn attempted to finish Bendu by shooting him with his blaster, but the Force entity vanished before the blast could touch him and let out a deep, echoing laugh of mockery that left the Chiss admiral highly unsettled.\nAfter the invasion of Atollon, Bendu disappeared.\nThe Bendu's warning to Thrawn eventually came true when Ezra Bridger defeated the Grand Admiral aboard his flagship with the help of several purrgil, the \"many arms\" of the creatures holding him in their \"cold embrace,\" just as the Bendu had prophesied.\nBendu was a wise and enigmatic being which resembled a giant rocky monolith with two eyes, a flat nose, and a long beard. He was a powerful entity who could control nature including the krykna spiders of Atollon. Bendu could also sense the presence of other Force-wielders from a distance. He was a wise and patient teacher who believed that other Force-sensitive beings needed to learn to overcome their fears and imbalances through personal trials. He taught Kanan how to overcome his blindness as well as his fear of krykna by teaching the Jedi Knight how to rely on his senses.\nWhile recognizing that the Sith holocron was dangerous, Bendu believed that only the user had the power to change themselves for better or worse. Bendu was immensely powerful and had the power to destroy a sensor marker with a mere flick of his hands. Bendu recognized that the convergence of Sith and Jedi holocrons had the power to produce clarity of vision but could also lead to chaos. He was concerned with the relationship between Kanan and his apprentice Ezra and believed that the two needed to repair it.\nBendu felt at peace living on Atollon and was angered when the rebels unintentionally lured the Empire to his planet. He was insulted when Kanan pleaded for him to break his neutrality and fight the Empire. Bendu was ambivalent to the galaxy's problems. Despite his patience, wisdom, and powers, Bendu entered into a rage when Kanan accused him of cowardice for not wanting to help the rebels during the Battle of Atollon, showing a degree of pride and a desire for respect. Still, Bendu was not intimidated by Thrawn even after being wounded by him and predicted the Grand Admiral's defeat.\nBendu was Force-sensitive, his connection being great, as was his power in the Force. Bendu was an immensely powerful being who possessed incredible connections to the Force and could perceive the emotions of others. He also had the power to appear and disappear at will. Despite his ability to create powerful storms by manipulating the nature around him, he was knocked to the ground when Grand Admiral Thrawn directed artillery fire at him. Bendu also had the power of foresight and predicted Thrawn's defeat. After warning Thrawn about his future, Bendu laughed and disappeared as Thrawn shot at him.\nBendu was created and developed for the third season of the animated television series Star Wars Rebels, and made his debut in the season's first episode, Star Wars Rebels: Steps Into Shadow. The character is voiced by famed Doctor Who actor Tom Baker. The term \"Bendu\" first appears in the original script for Star Wars as the name of the Jedi Knights, the \"Jedi-Bendu.\"\nAfter the conclusion of the third season, series executive producer Dave Filoni revealed that Ahsoka Tano met Bendu during the events of \"The Mystery of Chopper Base.\" Though these events were never depicted on screen, Filoni tweeted dialogue from their encounter as well as artwork illustrating the event. During their conversation, Bendu mentioned Tano's upcoming confrontation with her former master. When Tano explained that she had to know the truth, Bendu retorted that everything would change as a result of their encounter, including her. As the Togruta failed to see his point, he clarified that \"change\" meant death. Tano asked then if she would die, but Bendu acted as if she was affirming it, and so replied that he did not know that before telling her goodbye.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bendu_(disambiguation)",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Special:Upload",
  "/wiki/Atollon",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/The_Force",
  "/wiki/Kanan_Jarrus",
  "/wiki/Force-sensitive",
  "/wiki/Planet",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Jedi_Knight",
  "/wiki/2_BBY",
  "/wiki/Padawan",
  "/wiki/Ezra_Bridger",
  "/wiki/Jedi",
  "/wiki/Battle_of_Atollon",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/3_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Phoenix_Cell",
  "/wiki/Chopper_Base",
  "/wiki/Meditation",
  "/wiki/Mission_to_Malachor",
  "/wiki/Sith_holocron_(Malachor)",
  "/wiki/Malachor",
  "/wiki/Sensor_beacon",
  "/wiki/Krykna",
  "/wiki/Kanan_Jarrus%27_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Mission_to_Reklam_Station",
  "/wiki/Sith",
  "/wiki/Maul",
  "/wiki/Ghost",
  "/wiki/Speeder_bike",
  "/wiki/Kanan_Jarrus%27_holocron",
  "/wiki/Holocron_fusion",
  "/wiki/Cave",
  "/wiki/Ezra%27s_second_lightsaber",
  "/wiki/Comlink",
  "/wiki/Dokma",
  "/wiki/Force_vision",
  "/wiki/Dathomir",
  "/wiki/Skirmish_on_Dathomir",
  "/wiki/Nightsisters",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Mandalorian",
  "/wiki/Sabine_Wren",
  "/wiki/Darksaber",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Orbital_bombardment",
  "/wiki/Death",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Death_trooper",
  "/wiki/Chiss",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Purrgil",
  "/wiki/Star_Wars_Rebels_Season_Three",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels:_Steps_Into_Shadow",
  "/wiki/Tom_Baker",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Jedi-Bendu",
  "/wiki/Dave_Filoni",
  "/wiki/The_Mystery_of_Chopper_Base",
  "/wiki/Anakin_Skywalker",
  "/wiki/Togruta",
  "/wiki/The_Holocrons_of_Fate",
  "/wiki/Visions_and_Voices",
  "/wiki/Trials_of_the_Darksaber",
  "/wiki/Zero_Hour",
  "/wiki/Thrawn:_Alliances_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Way_of_the_Force",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Walkers_and_Ground_Vehicles_of_the_Empire_and_First_Order",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Bendu",
  "/wiki/Star_Wars",
  "/wiki/File:Bendu_tweet.png",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/File:AhsokaBenduMeeting.jpg",
  "/wiki/The_Star_Wars:_Rough_Draft"
 ]
}