{
 "name": "Bene",
 "display_name": "Bene",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Bene was a Force-sensitive human female Padawan of the Jedi Order who lived during the final years of the Galactic Republic. In the waning days of the Clone Wars, Bene was killed by the Sith Lord Darth Vader during the execution of Order 66 and the siege of the Jedi Temple.\nBene was a Jedi Padawan during the final days of the Clone Wars, when Supreme Chancellor Sheev Palpatine, who was secretly the Dark Lord of the Sith Darth Sidious, declared the Jedi Order traitors to the Galactic Republic. Executing Order 66 on Coruscant, the Sith Lord Darth Vader and the 501st Legion marched on the Jedi Temple to purge its occupants, including Bene. As the clone troopers stormed the Temple, Bene fought alongside Padawan Whie Malreaux and Battlemaster Cin Drallig against Vader. Despite their combined efforts, Bene, Malreaux and Drallig were killed by the new Lord of the Sith with Malreaux being the first to fall. Bene then attacked Vader in concert with Drallig, but Vader batted Bene's blade aside before grabbing her by the throat and strangling her whilst he dueled Drallig one-handed, killing the trainee Jedi before finishing off Drallig.\nThe duel between Bene and Vader was recorded by the Temple's surveillance system, allowing Jedi Master Obi-Wan Kenobi to discover her fate while reviewing the security logs. Recognizing the Sith who led the attack as his one-time apprentice, Jedi Knight Anakin Skywalker, Kenobi deactivated the holographic recording as he was unable to watch it through to its completion. Bene's death along with the other Jedi in the Temple led Kenobi to confront Vader on Mustafar, where the former friends fought until Kenobi emerged as the victor.\nBene was a young human female who, at the time of the Clone Wars, possessed brown hair, brown eyes, and fair skin. She rallied to the Temple's defense, opposing a former Jedi-turned-Sith and his legion of clones. She was among the Jedi who tried to defeat Vader, but ultimately died defending the Temple.\nAs a Jedi, Bene was Force-sensitive—a being who possessed a strong connection to the Force. She was trained in lightsaber combat, possessing a blue lightsaber, though her dueling skills did not help her to defeat Vader.\nMousy McCallum, daughter of the Star Wars prequel trilogy producer Rick McCallum, portrayed Bene in the 2005 film Star Wars: Episode III Revenge of the Sith.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bene",
  "/wiki/Bene/Legends",
  "/wiki/Bene_(mineral)",
  "/wiki/19_BBY",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Force-sensitive",
  "/wiki/Padawan",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Standard_day",
  "/wiki/Clone_Wars",
  "/wiki/Death",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Order_66",
  "/wiki/Siege_of_the_Jedi_Temple",
  "/wiki/Imperial_Palace",
  "/wiki/Jedi",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Treason",
  "/wiki/501st_Legion",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Clone_trooper",
  "/wiki/Jedi_temple",
  "/wiki/Whie_Malreaux",
  "/wiki/Battlemaster",
  "/wiki/Cin_Drallig",
  "/wiki/Lord",
  "/wiki/Sith",
  "/wiki/Lightsaber_duel",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Time",
  "/wiki/Jedi_Knight",
  "/wiki/Hologram",
  "/wiki/Duel_on_Mustafar",
  "/wiki/Mustafar",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Legion",
  "/wiki/Cloning",
  "/wiki/Midi-chlorian",
  "/wiki/The_Force",
  "/wiki/Jedi_training",
  "/wiki/Lightsaber_combat",
  "/wiki/Mousy_McCallum",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Rick_McCallum",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)"
 ]
}