{
 "name": "Benkudi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dug"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Benkudi was a Dug male criminal who operated in Mos Espa, Tatooine. He had worked for the Hutts and for Human aspiring crime lord Kaeline Ungasan. He was also a casual friend of Ree, a Twi'lek podracer working for the Hutts.\nAt some point, Ree left the Hutts and began working for Ungasan in a plot involving a new podracing event in Ando Prime, the Ungasan Cross Country. Ungasan changed the course every time it was raced, supposedly to provide new and exciting challenges; there was a secret reason, but Benkudi did not know it. Nevertheless, being an opportunistic informer, Benkudi wanted to sell anything he knew to the Hutts.\nHowever, at this point, the Hutts were already aware of Ungasan's podracing activities. They used one of their employees, Jer Blankuna, to hire independent agents to find Ree. Blankuna pretended to be Ree's worried father, and he falsely claimed to have been contacted by Benkudi. The agents followed this trail. Ree, who was familiar with Benkudi's traits, advised Ungasan to silence him. Ungasan in turn sent four contract workers of the CSA with vibrodaggers to beat Benkudi up. Nevertheless, Benkudi told the independent agents everything he knew, and some things he believed—like Ungasan being a former lieutenant for the Hutts.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dug/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Mos_Espa/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Human/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Kaeline_Ungasan",
  "/wiki/Ree",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Podracer/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Ando_Prime/Legends",
  "/wiki/Ungasan_Cross_Country",
  "/wiki/Time/Legends",
  "/wiki/Jer_Blankuna",
  "/wiki/Vibrodagger/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Snow_Job",
  "/wiki/Star_Wars_Gamer_2"
 ]
}