{
 "name": "Benthic",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Yar Togna"
     ]
    },
    {
     "name": "Born",
     "values": [
      "32 BBY",
      "Yar Togna"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tognath"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.90 meters"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cloud-Riders",
      "Partisans"
     ]
    }
   ]
  }
 ],
 "content": "Benthic \"Two Tubes,\" also known simply as \"Tubes,\" was a male Tognath mercenary pilot who flew alongside his eggmate and brother, Edrio. The two shared the nickname derived from the breathing apparatus that allowed their Tognath physiology to process oxygen atmospheres. Benthic's homeworld Yar Togna was conquered and occupied by the Galactic Empire, forcing him to flee as a refugee. Desiring to strike back at the Empire, Benthic allied himself with Enfys Nest's Cloud-Riders and later Edrio and Benthic allied with Saw Gerrera sometime before the Battle of Yavin.\nBenthic was born on the planet Yar Togna. Sometime during the Age of the Empire, the world was conquered by the Galactic Empire, forcing Benthic, along with his eggmate/brother Edrio, to flee and become refugees. While many of his people were exploited by criminal syndicates like Crimson Dawn after fleeing their homeworld, Benthic joined Enfys Nest's Cloud-Riders, a pirate group that took revenge on the Empire and crime lords who subjugated his people. In 10 BBY, Benthic accompanied Nest and his fellow Riders to a rendezvous with Han Solo and his crew on Savareen, convincing them to turn against Dryden Vos from Crimson Dawn, which ended with the Riders taking the coaxium.\nDesiring to strike back against the Empire, Benthic and Edrio later joined the Partisans, a rebel militia led by Saw Gerrera, eventually becoming Gerrera's second-in-command.\nIn 0 BBY, the Partisans were engaged in an insurgency on the desert moon Jedha with Imperial forces. Sometime later, the Imperial pilot Bodhi Rook defected from the Empire and sought out Gerrera with a message from Galen Erso. Benthic, Edrio, and an assortment of Partisan soldiers met with the Gigoran mercenary Moroff, who brought Rook to them. After Benthic briefly interrogated Bodhi, he ordered his men to put a bag over his head and bring him to Gerrera for further interrogation.\nShortly thereafter, Benthic led several soldiers to ambush an Imperial kyber transport. During the intense firefight in Jedha City, Cassian Andor, who had traveled to Jedha with Jyn Erso seeking out Gerrera, killed one of the Partisans in self-defense. Soon after, the Imperial transport was defeated.\nBenthic took the pair for hostiles and ordered his troops to contain them, along with Baze Malbus and Chirrut Îmwe. They took them back to the Catacombs of Cadera, and Benthic gave Jyn to Gerrera while the rest were put in cells inside the catacombs. During this time, Director Orson Krennic ordered the Death Star to destroy Jedha City. The shock wave from the city being destroyed caused the Partisans' nearby hideout to collapse into rubble. During this time, Benthic rushed outside and quickly evacuated his fellow Partisans into escape shuttles before personally escaping from the base.\nFollowing the Battle of Yavin, Benthic led the surviving Partisans in continuing the fight against the Empire on Jedha. Benthic was later approached by the Rebel Alliance's representatives Princess Leia Organa, Luke Skywalker, and Captain Han Solo. At first, Benthic thought they should kill them. However, Organa offered the Alliance's continued support of the Partisans on Jedha. He was told that the Empire was going to continue taking kyber crystals from Jedha. Despite his doubts, Benthic accepted Organa's offer and discussed the arrangement.\nAt Ai-jed, Benthic was joined by Skywalker and saw the Empire's latest defilement on Jedha. Benthic told Skywalker and Solo that they would destroy it.\nSometime later, Organa recruited the help of Benthic and his Partisans for a mission to Shu-Torun. The mission, led by Organa, was to deal a catastrophic blow to Shu-Torun's economy. Benthic agreed to join based on the fact that he had an opportunity to destroy an Imperial world, not concerning himself with Organa's aspirations. When Benthic and his crew arrived on-world, they quickly made a plan to annihilate the planet—a destruction greater than Jedha's. Benthic learned that if he destroyed the Spike, the whole planet and everyone on it would go with it. With the forced help of R2-D2 and Skywalker subdued, the Spike was ready to be blown.\nAs fate would have it, Organa rushed in and persuaded Benthic not to destroy the Spike, saying that wasn't the \"dream\" of the Partisans—an ideal originating with Saw Gerrera. Benthic agreed and they escaped Shu-Torun aboard the Millennium Falcon. Benthic requested that he and that Partisans be dropped off at Salobea, which he described as \"something else for the Partisans.\" Once there, Solo recounted the time he met Benthic when he was a member of the Cloud Riders and told the leader of the Partisans that he doesn't have to be anything he doesn't want to be especially with the right motivation. Benthic heeded the words and implied that he would change.\nBenthic first appeared in the 2016 Star Wars Anthology film Rogue One: A Star Wars Story, where he was played by Aidan Cook. His name and species were revealed during San Diego Comic-Con 2016.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story_Read-Along_Storybook_and_CD",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Guardians_of_the_Whills_(novel)",
  "/wiki/Star_Wars_Book_IX:_The_Ashes_of_Jedha",
  "/wiki/Star_Wars_Book_XIII:_The_Scourging_of_Shu-Torun",
  "/wiki/Yar_Togna",
  "/wiki/32_BBY",
  "/wiki/Tognath",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Cloud-Riders",
  "/wiki/Partisans",
  "/wiki/Mercenary",
  "/wiki/Pilot",
  "/wiki/Eggmate",
  "/wiki/Edrio",
  "/wiki/Oxygen",
  "/wiki/Atmosphere",
  "/wiki/Homeworld",
  "/wiki/Galactic_Empire",
  "/wiki/Refugee",
  "/wiki/Enfys_Nest",
  "/wiki/Saw_Gerrera",
  "/wiki/Battle_of_Yavin",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Conquering_of_Yar_Togna",
  "/wiki/Species",
  "/wiki/Crimson_Dawn",
  "/wiki/Pirate",
  "/wiki/Crime_lord",
  "/wiki/10_BBY",
  "/wiki/Showdown_on_Savareen",
  "/wiki/Han_Solo",
  "/wiki/Beckett%27s_gang",
  "/wiki/Savareen",
  "/wiki/Dryden_Vos",
  "/wiki/Coaxium",
  "/wiki/0_BBY",
  "/wiki/Jedha_insurgency",
  "/wiki/Desert",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/Imperial_Military",
  "/wiki/Bodhi_Rook",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Soldier",
  "/wiki/Gigoran",
  "/wiki/Moroff",
  "/wiki/Battle_on_Jedha",
  "/wiki/Kyber_crystal",
  "/wiki/Transport",
  "/wiki/Jedha_City",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Jyn_Erso",
  "/wiki/Troop",
  "/wiki/Baze_Malbus",
  "/wiki/Chirrut_%C3%8Emwe",
  "/wiki/Catacombs_of_Cadera",
  "/wiki/Director",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/City",
  "/wiki/Shuttle",
  "/wiki/Yavin_Prime",
  "/wiki/Battle_for_Jedha",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Luke_Skywalker",
  "/wiki/Captain",
  "/wiki/Crystal",
  "/wiki/Ai-jed",
  "/wiki/Drill_citadel",
  "/wiki/R2-D2",
  "/wiki/Millennium_Falcon",
  "/wiki/Salobea",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Aidan_Cook",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_2",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_5",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_6",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_7",
  "/wiki/Andor_(television_series)",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Rogue_One_Adaptation_2",
  "/wiki/Rogue_One_Adaptation_3",
  "/wiki/Star_Wars_(2015)_38",
  "/wiki/Star_Wars_(2015)_39",
  "/wiki/Star_Wars_(2015)_40",
  "/wiki/Star_Wars_(2015)_41",
  "/wiki/Star_Wars_(2015)_42",
  "/wiki/Star_Wars_(2015)_43",
  "/wiki/Star_Wars_(2015)_62",
  "/wiki/Star_Wars_(2015)_63",
  "/wiki/Star_Wars_(2015)_64",
  "/wiki/Star_Wars_(2015)_65",
  "/wiki/Star_Wars_(2015)_66",
  "/wiki/Star_Wars_(2015)_67",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/Saw%27s_Renegades_Expansion_Pack",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_55",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_77",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/July_20",
  "/wiki/File:Edrio_reveal.png"
 ]
}