{
 "name": "Bentilais san Sk'ar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kalee"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Shiva IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaleesh"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Approx. 3 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kolkpravis",
      "Izvoshra",
      "Izvoshra",
      "Galactic Empire",
      "Imperial Army",
      "Imperial Army"
     ]
    }
   ]
  }
 ],
 "content": "Bentilais san Sk'ar was a Kaleesh general in the Galactic Empire who served during the Galactic Civil War. Originally a warlord on his native Kalee, his resistance forces had been routed by Imperial Captain Thrawn, who leveled the planet Oben with his Star Destroyers. Accepting defeat, Sk'ar allowed himself to be captured by Captain Rel Bentin, who brought him before Emperor Palpatine. Seeing Sk'ar's potential, Palpatine accepted him into the ranks of his Imperial armies and sent him to bring order to remote, outlying worlds.\nSk'ar embarked on a campaign across the Jahilid Drift, conquering several worlds and making a name for himself in the Imperial military. Preferring to use divide and conquer tactics rather than flat out bombardment, Sk'ar's plans put his troops at lessened risk while putting the worlds he overran under stronger Imperial control. His campaigns eventually brought him to Shiva IV; however, there he was thwarted by agents of the Alliance to Restore the Republic. Attempting to evade defeat, he was killed when the Wookiee Chewbacca threw a solid steel gun mount at his ship, causing Sk'ar's aircraft to explode.\nBentilais san Sk'ar was a Kaleesh who was born during the time of the Galactic Republic. He lived on the planet Kalee and was originally a revolutionary, but eventually became the ruler of the planet's western hemisphere. When the insectoid Yam'rii species invaded Kalee, Sk'ar joined the Kolkpravis, a group of Kaleesh tribal warriors who were resisting the Yam'rii. He served under the leadership of Qymaen jai Sheelal and became one of the Izvoshra, eight elite soldiers who were personally answerable to Sheelal and served as his bodyguards. However, after the Yam'rii petitioned to the Galactic Senate, the Republic intervened and ended the conflict, enforcing crippling economic sanctions on the Kaleesh.\nPeace did not last long; the Yam'rii desecrated Kaleesh burial grounds on the colony world Oben, as a consequence, Sheelal gathered the Izvoshra and flew to Oben where they planned to re-establish hostilities with the Yam'rii. Their ship crashed into the Jenuwaa Sea, however, as a result of the InterGalactic Banking Clan's intervention at the behest of Count Dooku, the Confederacy of Independent Systems' Head of State who hoped to utilise Sheelal for the ensuing Separatist war effort. Dooku had had Sheelal ejected from the ship before it crashed, but unbeknownst to the Count, Sk'ar had also survived, though alone. Thus, the warrior rallied the Kolkpravis under his leadership. They slaughtered all of the Yam'rii on Oben and Sk'ar had his people re-locate there.\nFollowing the rise of the Galactic Empire, Sk'ar violently resisted Imperial rule for over a decade, although his forces were finally routed by Captain Thrawn, who was usually able to study his adversaries' art and devise a strategy to defeat them from there. In the case of the Kaleesh, Thrawn was unable to comprehend the works of art, and so leveled the planet Oben with his Star Destroyers.\nSk'ar recognized superior tactics when he saw them and held no ill will against the victors since his people had died with honor. Instead, the general was taken aback by the sheer power of the technology wielded by his adversaries. Waiting in the remains of his razed headquarters, Sk'ar was approached by Captain Rel Bentin, to whom he offered his life or his services. Bentin, intimidated by the towering figure of Sk'ar, brought the Kaleesh before Emperor Palpatine. The Emperor was impressed by Sk'ar's courage in the face of almost certain death and knew full well what a Kaleesh warlord could achieve, as he had used the services of Sheelal during the Clone Wars. Seeing a purpose for Sk'ar in his Empire, Palpatine sent the Kaleesh general to bring some of the more remote worlds on the edge of known space into line.\nWith an Imperial strike force under his command, Sk'ar set out to vindicate Palpatine's judgment. He conquered the worlds of Pral, Koltine, and others located within the Jahilid Drift, and began to earn a degree of respect amongst his peers. Even the Empire's more xenophobic officers recognized the successes of General Sk'ar. Unlike his colleagues, however, the Kaleesh excelled at undermining his adversaries through subterfuge and trickery, putting his soldiers at lesser risk and allowing for more significant control over conquered worlds. Leading from the front, Sk'ar equipped himself with a strong personal energy shield that was impervious even to close-range blaster attacks.\nSk'ar hoped to be able to use his divide and conquer tactics on the world of Shiva IV. The two dominant governments on the planet, the Twelve Tribes of T'Syriél and the Calian Confederacy, had warred incessantly for years, until 2 ABY, when they were able to make peace in a ceremony known as the Concordat of Peace. Hoping to open up old wounds, Sk'ar hired both Humans from the Confederacy and T'Syriél from the Twelve Tribes, hoping that if either a member of the Confederacy or the Twelve Tribes stumbled upon his Shiva IV operation, they would immediately think their former rivals had broken the truce.\nEquipping the T'Syriél outcasts with heavily modified stormtrooper armor, Sk'ar began laying the groundwork for his conquest of Shiva IV. First, he ringed the planet with microscopic space mines, before utilizing an anti-matter bomb against the city of K'avor, leveling it entirely. He then began acquiring allies within the Calian and Twelve Tribes high command, promising Ygal Delois, kin and aide of the Confederate leader Aron Peacebringer, a position as ruler of the planet following the Imperial occupation. He enlisted Delois to prepare a mock-up of a Calian aerial battleship, which would drop an anti-matter bomb on Shiva IV's capital city of Illyriaqüm. Sk'ar would then conscript an army from the enslaved populace, since Shiva IV was home to what the general considered some of the galaxy's fiercest fighters.\nDispatching his troops to Illyriaqüm to kidnap Peacebringer during the first anniversary of the Concordat of Peace, he was given custody of not one leader but two: Alliance to Restore the Republic member Leia Organa was also present, having been stranded on Shiva IV by the micro space mines. While beating Peacebringer personally, Sk'ar had Organa tortured by his ally Delois, instilling rage in the Calian leader. As Sk'ar set off on his mission to destroy Illyriaqüm, he gave his men orders not to harm Organa, as Palpatine had requested that privilege for himself.\nPalpatine's order proved to be damaging to Sk'ar's operation: since the guards were not to harm her, Organa escaped, bringing Peacebringer along with her. Hijacking one of the Shivan aircraft, she set off after Sk'ar and his mock Calian airship. The Kaleesh sent TIE/LN starfighters after them, but the general's pilots were no match for Organa's own piloting skills. Peacebringer and Organa then boarded the airship, wreaking havoc on the main deck, while Sk'ar brayed orders at his men in futility.\nThe situation worsened for Sk'ar when a team of Rebels who had been searching for Organa, comprising Lando Calrissian, Chewbacca, and Luke Skywalker, joined the foray, along with Peacebringer's blood brother, Demarch Kéral Longknife of the Twelve Tribes. Skywalker defeated Delois in combat, prompting Sk'ar to make his escape. He was stopped in his tracks by Calrissian, who attempted to gun the Kaleesh general down. However, Sk'ar's personal energy shield allowed him to simply walk up to his assailant and violently strike him, effectively removing him from the battle. Making it to one of the Shivan aircraft, Sk'ar hurtled away from the mock airship, but was spotted by Chewbacca. The Wookiee, with no practical weapon in sight, picked up a solid steel gun mount and hurled it at the Kaleesh's ship. Sk'ar perished in the subsequent explosion.\nThough he preferred to manipulate and undermine his enemies, Bentilais san Sk'ar was a bloodthirsty individual who would commit acts of genocide or violence without any particular purpose in mind. His bombing of K'avor did not work into his final plan for Shiva IV at all, and he tortured both Leia Organa and Aron Peacebringer without asking any questions. Though he lessened the risk to his men through his tactics, he did not particularly respect them, often barking out orders and chiding them for their incompetence. He would use his towering size of about three meters in height, unusually large for a Kaleesh, to intimidate and strike fear into the hearts of his enemies. Sk'ar's intimidating look was completed with hairless grey skin and piercing red eyes.\nSupremely confident, Sk'ar considered it an honor to work for the Empire, the only adversary that had ever beaten him. Unlike others, he did not seek revenge for the destruction of his people, and he had a great respect for the power of technology. He paid proper service to the wishes of his master, Palpatine, and would strictly obey his commands. Conversely, Sk'ar had little more than contempt for pacifist entities such as Peacebringer and Organa, though he did acknowledge that Shiva IV was home to some of the galaxy's finest combatants.\nSk'ar was created by Chris Claremont, Carmine Infantino and Walt Simonson for a two-issue arc in Marvel Comics' Star Wars series in 1981. His species, like those of many other early Expanded Universe figures, was never identified, and his character remained undeveloped until fleshed out in the 2007 Hyperspace publication Aliens in the Empire, which gave his full name and retconned him as a Kaleesh. He was later referenced in the Wizards of the Coast sourcebook Galaxy at War in 2009, which further expanded his backstory.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/San_(disambiguation)",
  "/wiki/Kalee/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Shiva_IV",
  "/wiki/Kaleesh/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Kolkpravis",
  "/wiki/Izvoshra/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/General/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Oben",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Rel_Bentin",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Jahilid_Drift",
  "/wiki/Troop/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Death/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Steel/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Insectoid/Legends",
  "/wiki/Yam%27rii/Legends",
  "/wiki/Species/Legends",
  "/wiki/Huk_War",
  "/wiki/Grievous/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Jenuwaa_Sea",
  "/wiki/InterGalactic_Banking_Clan/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Head_of_State/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Kaleesh%E2%80%93Imperial_conflict",
  "/wiki/Kaleesh_Resistance",
  "/wiki/Bombardment_of_Oben",
  "/wiki/Realspace/Legends",
  "/wiki/Subjugation_of_the_Jahilid_Drift",
  "/wiki/Pral",
  "/wiki/Koltine",
  "/wiki/Speciesism",
  "/wiki/Personal_energy_shield/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Twelve_Tribes_of_T%27Syri%C3%A9l",
  "/wiki/Calian_Confederacy",
  "/wiki/2_ABY/Legends",
  "/wiki/Concordat_of_Peace",
  "/wiki/Human/Legends",
  "/wiki/T%27Syri%C3%A9l",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Space_mine",
  "/wiki/Anti-matter_bomb",
  "/wiki/K%27avor",
  "/wiki/Destruction_of_K%27avor",
  "/wiki/Ygal_Delois",
  "/wiki/Aron_Peacebringer",
  "/wiki/Calian_aerial_battleship",
  "/wiki/Illyriaq%C3%BCm",
  "/wiki/The_galaxy/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Torture/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Pilot/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Demarch",
  "/wiki/K%C3%A9ral_Longknife",
  "/wiki/Chris_Claremont",
  "/wiki/Carmine_Infantino",
  "/wiki/Walter_Simonson",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/1981",
  "/wiki/2007",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Aliens_in_the_Empire",
  "/wiki/Retcon",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Galaxy_at_War",
  "/wiki/2009",
  "/wiki/Category:Images_of_Bentilais_san_Sk%27ar",
  "/wiki/Star_Wars_(1977)_53",
  "/wiki/Star_Wars_(1977)_54",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Legendary_Authors",
  "/wiki/Star_Wars_Insider_146",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Heir_to_the_Empire",
  "/wiki/Standard_year/Legends",
  "/wiki/The_New_Essential_Guide_to_Alien_Species"
 ]
}