{
 "name": "Beol_De%27Rruyet",
 "display_name": "Beol De'Rruyet",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "De'Rruyet Industries"
     ]
    }
   ]
  }
 ],
 "content": "Beol De'Rruyet was a human male who was the founder of De'Rruyet Industries, operating from the planet Midarr. During the Imperial Era, De'Rruyet acquired a Path engine, an ancient Nihil hyperdrive that De'Rruyet claimed he was able to replicate, revolutionizing lightspeed travel. Due to the resulting effect on the economy that such technology would make, Domina Tagge of the House of Tagge wished to prevent De'Rruyet from releasing the device, recruiting the rogue archaeologist Doctor Chelli Aphra to investigate the Path engine and verify De'Rruyet's claims.\nHowever, De'Rruyet and his company were unable to create a functioning replica of the Path engine; despite his lack of success, De'Rruyet intended to unveil the device and give the impression that it worked. He was unaware of the danger it posed if it was activated, but made plans to run away with his money in the event that the Path engine did not live up to his claims. On the day before the expo was set to occur, De'Rruyet's headquarters was attacked by General Vukorah of the Unbroken Clan, who wished to acquire the Path engine.\nDuring the time of the Galactic Empire, Beol De'Rruyet was the founder of the company De'Rruyet Industries, based out of De'Rruyet Center on the planet Midarr. De'Rruyet and his company were a rival of the Tagge Corporation, led by Lady Domina Tagge. Around 3 ABY, De'Rruyet, on a clandestine network for the purchase and sale of rare artifacts, discovered a Path engine, an ancient hyperdrive used by the Nihil marauder organization that allowed them to access unconventional hyperspace routes known as Paths. De'Rruyet met with the smuggler Remy, who had found the device within a wrecked Nihil starship on the planet Dol'har Hyde, on the planet Corellia to buy the Path engine.\nAfter obtaining the Path engine, De'Rruyet attempted to replicate the device. He claimed that he had found a way to do so and that his discovery would revolutionize lightspeed travel. With his company having created a reproduction of the Path engine and installed it into a starship, De'Rruyet was set to unveil the technology at the De'Rruyet Industries confluence on Midarr. However, the device that he had obtained was only a part of the larger hyperdrive system, and could not work on its own; indeed, in the days leading up to the confluence, the replica was not yet complete, and would combust if it were to be activated, posing potential for catastrophe at the expo. Worried that the Path engine would not work as he had claimed, De'Rruyet booked a one-way ticket to the planet Mon Cala so that he could run with the money if the device did fail.\nBelieving that De'Rruyet's discovery would either drastically change the galactic economy or end the ongoing Galactic Civil War—both of which would financially ruin her dynasty—Domina Tagge wished to stop her rival from releasing the technology. Tagge recruited the rogue archaeologist Doctor Chelli Aphra to determine the origins of the Path engine and whether De'Rruyet's claims were true before the expo could take place.\nOn the day before the confluence was to take place, De'Rruyet gave an interview to numerous reporters, affirming the revolutionary nature of the hyperdrive and his intention to unveil it. As his company prepared for the expo, however, one of De'Rruyet's employees warned him that the reproduction of the device was incomplete. De'Rruyet, determined to please his investors, ordered the protesting employee to make the device appear convincing. He was then approached by Aphra and the smuggler Sana Starros—disguised as interns—who provided him with caf. De'Rruyet retched at the taste, claiming it was not what he had ordered, and disparaged the \"interns\" before walking away. Unknown to De'Rruyet, Aphra had stolen his access card, and she and Starros proceeded to inspect the Path engine replica before investigating his office.\nEntering his office to find Aphra and Starros at his desk, De'Rruyet confronted the two. Aphra claimed that they were investigators on behalf of the Empire, telling De'Rruyet that the Emperor would be disappointed with the fraud. De'Rruyet pulled his blaster on Aphra, asserting that the engine was a success, and Starros ordered him to call off the demonstration and surrender the device. They were interrupted, however, by the arrival of General Vukorah of the Unbroken Clan criminal syndicate, who also wished to acquire the Path engine. Blasting a hole through the wall of De'Rruyet Center, Vukorah held the interns and workers hostage until they could make the device operational. De'Rruyet rushed to the main hall, despite protest from Aphra to wait, where Vukorah pointed her blaster at him, requesting that he join her on the demonstration stage.\nDe'Rruyet was frequently harsh and dismissive toward his employees and interns at De'Rruyet Industries. He was also particular about his caf and was impatient when made to wait for it to be delivered. Though his attempt to replicate the Path engine was not met with success, De'Rruyet nevertheless insisted that the device would be revolutionary. He demanded that his employees give the appearance that the Path engine was functional, wishing to impress his investors and believing that there was no risk of his fraud being discovered. However, with the prospect of his engine failing likely, De'Rruyet intended to take his money and run in the event that it did not work. Doctor Aphra remarked that De'Rruyet would need to have a large ego to believe that he could replicate the device.\nBeol De'Rruyet was a human male with black hair, brown eyes, and light skin.\nDe'Rruyet wore a white tunic with gold lining and khaki wrappings on the sleeves, as well as brown pants and black shoes. He wielded a blaster pistol, which he kept in a holster on his belt. De'Rruyet also carried an access card, which he kept unsecured in an outside pocket. De'Rruyet utilized a starship, in which he had the reproduced Path engine installed.\nBeol De'Rruyet first appeared, albeit through a hologram, in the comic Doctor Aphra  6, written by Alyssa Wong, penciled by Ray-Anthony Height and Robert Gill, and published by Marvel Comics on November 25, 2020.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Doctor_Aphra_(2020)_10",
  "/wiki/Doctor_Aphra_(2020)_18",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/De%27Rruyet_Industries",
  "/wiki/Planet",
  "/wiki/Midarr",
  "/wiki/Imperial_Era",
  "/wiki/Path_engine",
  "/wiki/Nihil",
  "/wiki/Hyperdrive",
  "/wiki/Lightspeed",
  "/wiki/Domina_Tagge",
  "/wiki/House_of_Tagge",
  "/wiki/Archaeologist",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/De%27Rruyet_Industries_confluence",
  "/wiki/Currency",
  "/wiki/Standard_day",
  "/wiki/De%27Rruyet_Center",
  "/wiki/General",
  "/wiki/Vukorah",
  "/wiki/Unbroken_Clan",
  "/wiki/Galactic_Empire",
  "/wiki/Tagge_Corporation",
  "/wiki/Lord",
  "/wiki/3_ABY",
  "/wiki/Tase_Somer%27s_black_market_network",
  "/wiki/Pirate",
  "/wiki/Hyperspace_route",
  "/wiki/Path",
  "/wiki/Smuggler",
  "/wiki/Remy_(smuggler)",
  "/wiki/Starship",
  "/wiki/Dol%27har_Hyde",
  "/wiki/Corellia",
  "/wiki/Mon_Cala",
  "/wiki/The_galaxy",
  "/wiki/Galactic_Civil_War",
  "/wiki/Journalist",
  "/wiki/Sana_Starros",
  "/wiki/Caf",
  "/wiki/Darth_Sidious",
  "/wiki/Blaster",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Blaster_pistol",
  "/wiki/Holster",
  "/wiki/Belt",
  "/wiki/Hologram",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Doctor_Aphra_(2020)_6",
  "/wiki/Alyssa_Wong",
  "/wiki/Ray-Anthony_Height",
  "/wiki/Robert_Gill",
  "/wiki/Marvel_Comics",
  "/wiki/November_25",
  "/wiki/2020",
  "/wiki/Category:Images_of_Beol_De%27Rruyet",
  "/wiki/Doctor_Aphra_(2020)_7",
  "/wiki/Doctor_Aphra_(2020)_8",
  "/wiki/Doctor_Aphra_(2020)_9",
  "/wiki/Star_Wars_(2020)_29",
  "/wiki/Doctor_Aphra_(2020)_1",
  "/wiki/Standard_week",
  "/wiki/Battle_of_Hoth",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Doctor_Aphra:_The_Engine_Job",
  "/wiki/Standard_year",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Databank_(website)"
 ]
}