{
 "name": "Beon Beonel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Espirion"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Alder-Espirion"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green and yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red and black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alderaan Flotilla"
     ]
    }
   ]
  }
 ],
 "content": "Beon Beonel was an Alder-Espirion hybrid who lived on the planet Espirion. He acted as chief of the Alder-Espirion population when the Alderaanian Princess Leia Organa sent representatives to the planet in 0 ABY to urge them to join her in rescuing all Alderaanians who had survived the Galactic Empire's destruction of their homeworld.\nUpon meeting the Alderaanian representatives, Jora Astane and Uwa Pareece, Beonel immediately rejected the offer after seeing that Astane was disgusted by his hybrid heritage. Although he rejected a second attempt by Pareece to set up talks, Beonel was swayed by a message from Organa to the many Alderaanians who had joined her cause when they came under attack by an Imperial Star Destroyer. Beonel then sent the starship Espirion Multi to aid the Alderaanians and destroy the Star Destroyer, joining their cause after the battle.\nBeon Beonel was the chief of the Alder-Espirions, a species of hybrids between human immigrants from the planet Alderaan and the Espirions native to the Alder-Espirion homeworld of Espirion. In 0 ABY, shortly after Alderaan was destroyed by the Galactic Empire, Alderaanian Princess Leia Organa set off on a mission to rescue all Alderaanians who had survived the incident by being off world, as they were being hunted by the Empire. The Alder-Espirion population was one of the groups she intended to visit and recruit to her cause; however, she was forced to cancel her plans to visit the planet after Imperial forces pursuing her demanded she exchange herself for an Alderaanian hostage on the planet Skaradosh.\nIn her place, Organa instead sent two representatives to meet with the Alder-Espirion: Jora Astane and Uwa Pareece. As chief of his species, Beonel attended a meeting with the pair set up by the Espirion Consul Rill. He immediately recognized that Astane was disgusted by his mixed ancestry and abandoned the talks, unwilling to tolerate such bigotry despite Pareece's attempts to persuade him that Astane did not represent the rest of the Alderaanian survivors' opinions.\nPareece then had Rill contact Beonel and promise that Organa would meet him in person, but the chief was still not interested in working with the Alderaanians and told the representatives as much when they ran into him boarding a vessel in one of Espirion's spaceports. The pair then returned to the Alderaanian fleet that had gathered above Espirion to meet with Organa after she returned from Skaradosh. Organa's return was followed by the arrival of an Imperial Star Destroyer that had also been at Skaradosh, and the princess was forced to greet the Alderaanian fleet with a speech warning of the impending danger and inspiring it to fight.\nOrgana's astromech droid, R2-D2, transmitted the speech to the surface of Espirion without Organa knowing, and Beonel was among those who saw the transmission. Moved by what he heard, Beonel sent the starship Espirion Multi to aid the Alderaanian fleet, and with the vessel's aid, the Alderaanians destroyed the Star Destroyer. Beonel then joined the ensuing celebrations and met with Organa, claiming that Espirion did not fear the Empire's wrath for what it had done, as the planet was strongly defended. He and his people then joined the Alderaanian survivors, who soon began voting for a new leader after Organa left to return to the Rebel Alliance. Beonel and the Alderaanians ultimately left Espirion to travel to a new world.\nBeon Beonel was an Alder-Espirion with gray hair, green-and-yellow eyes, and red-and-black skin. Assuming that the Alderaanian representatives sent to meet with him might be prejudiced against his hybrid species, he was unwilling to hear out their offer when this proved true, as he was greatly offended and believed that his people should not have to tolerate any bigotry, even if it only came from a minority of the other Alderaanians.\nWithin the speech she gave to the Alderaanian fleet, Leia Organa described the peaceful, unprejudiced Alderaanian society she hoped to lead, one that Beonel had dreamed of living in for his entire life. He was so swayed by the speech that he aided and joined the Alderaanian survivors despite the bigots among them and the attention it would bring from the Empire.\nBeonel wore gray and tan robes while meeting with the Alderaanians, in a style that matched the clothing of Rill and other Espirions.\nBeon Beonel first appeared in the comic book Princess Leia 4, which was released on June 3, 2015 with writing by Mark Waid and illustrations by Terry Dodson. He then went on to appear in the next and final issue of the Star Wars: Princess Leia mini-series, which was released on July 1, 2015. In one panel of the final issue, Beonel's eyes are mistakenly depicted as white with blue pupils instead of yellow and green.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Espirion",
  "/wiki/Alder-Espirion",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alderaan_Flotilla",
  "/wiki/Hybrid",
  "/wiki/Planet",
  "/wiki/Chief",
  "/wiki/Espirion_(species)",
  "/wiki/Alderaanian",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/0_ABY",
  "/wiki/Mission_to_rescue_the_survivors_of_Alderaan",
  "/wiki/Alderaan",
  "/wiki/Galactic_Empire",
  "/wiki/The_Disaster",
  "/wiki/Homeworld",
  "/wiki/Jora_Astane",
  "/wiki/Uwa_Pareece",
  "/wiki/Dreed%27s_Star_Destroyer",
  "/wiki/Starship",
  "/wiki/Espirion_Multi",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Species",
  "/wiki/Human",
  "/wiki/Tula",
  "/wiki/Skaradosh",
  "/wiki/Consul",
  "/wiki/Rill",
  "/wiki/Spaceport",
  "/wiki/Fleet",
  "/wiki/R2-series_astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Robe",
  "/wiki/Clothing",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Princess_Leia_4",
  "/wiki/June_3",
  "/wiki/2015",
  "/wiki/Mark_Waid",
  "/wiki/Terry_Dodson",
  "/wiki/Princess_Leia_5",
  "/wiki/Star_Wars:_Princess_Leia",
  "/wiki/July_1",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Marvel_Comics"
 ]
}