{
 "name": "Berisse Sai",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lothal"
     ]
    },
    {
     "name": "Born",
     "values": [
      "20 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Executor",
      "Endor system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Death Squadron",
      "Imperial Navy's officer corps",
      "Death Squadron",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Berisse Sai was a human female officer in the Imperial Navy during the Galactic Civil War. She befriended a fellow officer Ciena Ree, and served the Death Squadron aboard the Imperial-class Star Destroyer Devastator following her graduation from the Imperial Academy on Lothal. Later she served aboard the Executor-class Star Dreadnought Executor. She was killed when the Executor was destroyed at the Battle of Endor.\nBerisse Sai graduated from the Imperial Academy on Lothal a year before the Battle of Yavin. Lieutenant Sai was stationed aboard the Imperial-class Star Destroyer where she befriended Lieutenant Ciena Ree, a Jelucani graduate from the Royal Imperial Academy on Coruscant, and promised to show her around the Star Destroyer. After learning about the destruction of Alderaan, she offered some sympathy for the Alderaanian Imperial officer Nash Windrider, remarking that his entire planet had turned traitor.\nFollowing the destruction of the Death Star, Sai and Ree were ordered to take a Gozanti-class freighter to the Yavin system to rendezvous with Darth Vader and bring him back to the Devastator. Their commander ordered them to keep their mission secret and to maintain communications silence unless otherwise ordered by Lord Vader. During the hyperspace journey, Berisse asked Ciena whether they were supposed to fly to the totally silent Death Star without asking questions.\nCiena responded that it would make more sense when they got there. Sai introduced herself as Berisse and Ciena followed suit. Upon exiting hyperspace, the two stumbled upon the wrecked remains of the Death Star, which had been destroyed by the Rebel Alliance starfighter pilot Luke Skywalker. After picking up a signal from Darth Vader's TIE Advanced x1, Berisse helped Ciena extend the docking tube onto the top of Vader's TIE fighter.\nAfter boarding the freighter, Vader ordered Ciena and Berisse to remain in the hold for the remainder of the voyage. He then took command of the freighter for their return journey to the Devastator. During the return journey, an apologetic Berisse remarked that Vader could be a little overpowering at first glance. When Berisse added that she was frightened by his respirator, Ciena warned that he could be monitoring them right now. Berisse kept quiet for the rest of the journey.\nSeveral days later, Berisse was resting in her bunk when Ciena raised the matter of Windrider's stressed state. Berisse thought that Ciena was thinking about Nash because it was the only thing that kept her from thinking about her fellow Jelucani officer Thane Kyrell. Ciena denied having any romantic feelings for Thane. Berisse responded that she had observed Ciena's infatuation with Thane during her off-duty hours. When Ciena returned to the subject of Nash, Berisse responded that he was taking extra shifts to keep himself busy. Berisse supported Ciena's suggestion that they invite Thane out for grav-ball.\nTwo years after the Battle of Yavin, Berisse along with Nash and Ciena were transferred to Vader's flagship, the Super Star Destroyer Executor. Berisse's birthday occurred shortly before the Battle of Hoth.\nFollowing the escape from Cloud City, Berisse met with Ciena and Nash. When Ciena asked why people would join the Rebellion, Berisse dismissed them as misfits and robbers who hated normal society. When Berisse and Nash asked why she had raised the matter, Ciena confided that she was still affected by Thane's alleged suicide. Berisse and Nash were unaware that Thane had joined the Rebel Alliance. When Nash expressed disbelief that Thane would commit suicide, Berisse explained that they were all affected by the destruction of the Death Star.\nAfter Nash had pressed Ciena for more information about Thane, Berisse speculated that it was something that had happened on his homeworld of Jelucan. Nash shared pointed out that Thane had been physically abused by his father Oris Kyrell, stating that he had seen scars on his back. Berisse then departed and let Ciena and Nash spend time together.\nIn the period leading up to the Battle of Endor, the Executor was dispatched to the Hudalla system. During that time, Berisse noticed that Ciena had been angry for the past three weeks. Ciena was angry that her mother Paron Ree had been framed and imprisoned for embezzlement. Despite being close friends, Ciena did not confide in Berisse because of her friend's loyalty to the Empire. While waiting, Berisse assisted Ciena in a flamethrower training session by operating the holographic visuals. Shortly later, the Executor exited hyperspace in the Hudalla system and discovered a large Imperial fleet. Both Berisse and Ciena expressed bemusement. The Imperial fleet had been dispatched to lure rebel starfighters into a trap, leading to a dogfight.\nFollowing the dogfight, Berisse and her comrades were dispatched to the Endor system, which harbored the second Death Star. Berisse, Ciena, and Nash were among the hundreds of Imperial personnel invited to greet Emperor Palpatine. Prior to the Emperor's arrival, Berisse expressed elation but worried that their view would be obscured by the large gathering. While traveling to the hangar in a turbolift, Ciena expressed her shock that the Empire had built another Death Star. By contrast, Berisse regarded the existence second Death Star as a positive development and marveled at how long they had taken to construct it. When Ciena expressed skepticism, Berisse sharply responded that they had to rebuild the Death Star in order to honor the memory of Imperials who had died during the Battle of Yavin. She remarked that the existence of the second Death Star would end opposition to the Emperor's rule and cause the Rebellion to melt away. Nash supported Berisse's arguments and reassured Ciena that rebuilding the Death Star would send a clear message to the rebels that their luck had run out and that the Empire was the only galactic authority. While Nash was talking to Ciena, Berisse reminded her comrades to move into position to await the arrival of the Emperor's shuttle.\nDuring the Battle of Endor, Berisse perished after the Executor crashed into the second Death Star and exploded. The battle also saw the deaths of the Emperor and Darth Vader, turning the tide of the Galactic Civil War against the Empire. Berisse's comrades Ciena Ree and Nash Windrider survived the battle and would participate in the Battle of Jakku, the Empire's last stand against the New Republic, the successor government created by the Rebel Alliance.\nBerisse Sai was a human woman from Lothal with tan skin and a stout physique. She had dark, shining, tightly braided hair. Berisse struck a friendship with her fellow Imperial Navy officers Ciena Ree and Nash Windrider. Berisse enjoyed hanging out with her fellow officers, often offering to meet up at the cantina. She was aware of Ciena's feelings for Thane. Berisse had a habit of telling jokes, some of which were not repeatable to Ciena's parents. Nonetheless, Ciena felt comfortable confiding in her, noting that she was helpful, sympathetic, matter-of-fact, and practical. Berisse's relationship with Ciena became strained after Ciena's mother Verine Ree was framed for embezzlement. Berisse grew disconcerted with Ciena's bad moods. Ciena found herself no longer able to confide in Berisse, fearing that Berisse would question her loyalty to the Empire.\nBerisse was firmly devoted to the Empire and viewed the rebels as robbers and misfits who could not fit into normal society. She later sought to justify the existence of the second Death Star by claiming that it would end resistance to the Empire and that building it would honor the memory of fallen Imperials who had died during the destruction of the first Death Star. Despite their differences, Ciena was grief-stricken by the loss of her friend Berisse.\nBerisse Sai first appeared in Lost Stars, a young adult novel written by Claudia Gray as part of Journey to Star Wars: The Force Awakens series. Gray mentally pictured Sai as being portrayed by America Ferrera.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lothal",
  "/wiki/20_BBY",
  "/wiki/4_ABY",
  "/wiki/Executor",
  "/wiki/Endor_system",
  "/wiki/Human",
  "/wiki/Lothalite",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Death_Squadron",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Imperial_officer",
  "/wiki/Imperial_Navy",
  "/wiki/Galactic_Civil_War",
  "/wiki/Officer",
  "/wiki/Ciena_Ree",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Devastator",
  "/wiki/Academy_for_Young_Imperials",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Death",
  "/wiki/Battle_of_Endor",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Lieutenant",
  "/wiki/Jelucan",
  "/wiki/Royal_Imperial_Academy",
  "/wiki/Coruscant",
  "/wiki/Star_Destroyer",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/Alderaanian",
  "/wiki/Nash_Windrider",
  "/wiki/Planet",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Yavin_system",
  "/wiki/Anakin_Skywalker",
  "/wiki/Commander",
  "/wiki/Sith_Lord",
  "/wiki/Hyperspace",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Luke_Skywalker",
  "/wiki/Darth_Vader%27s_TIE_Advanced",
  "/wiki/TIE_Advanced_x1",
  "/wiki/TIE_line",
  "/wiki/Freighter",
  "/wiki/Standard_day",
  "/wiki/Thane_Kyrell",
  "/wiki/Standard_hour",
  "/wiki/Grav-ball",
  "/wiki/2_ABY",
  "/wiki/Yavin_Prime",
  "/wiki/Flagship",
  "/wiki/Super_Star_Destroyer",
  "/wiki/Birthday",
  "/wiki/Battle_of_Hoth",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Cloud_City",
  "/wiki/Thief",
  "/wiki/Suicide",
  "/wiki/Homeworld",
  "/wiki/Parent",
  "/wiki/Oris_Kyrell",
  "/wiki/Hudalla_system",
  "/wiki/Time",
  "/wiki/Standard_week",
  "/wiki/Paron_Ree",
  "/wiki/Prison",
  "/wiki/Flamethrower",
  "/wiki/Star_system",
  "/wiki/Fleet",
  "/wiki/Dogfight_in_the_Hudalla_system",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Hangar",
  "/wiki/Turbolift",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Endor",
  "/wiki/Darth",
  "/wiki/Battle_of_Jakku",
  "/wiki/New_Republic",
  "/wiki/Hair",
  "/wiki/Navy",
  "/wiki/Cantina",
  "/wiki/Lost_Stars",
  "/wiki/Claudia_Gray",
  "/wiki/Journey_to_Star_Wars:_The_Force_Awakens",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Lost_Stars_(audiobook)",
  "/wiki/Lost_Stars_(webcomic)",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Galactic_Empire_Conversion_Kit",
  "/wiki/Imperial_Academy",
  "/wiki/Imperial_cadet"
 ]
}