{
 "name": "Berkelium Shyre",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic lower-half from the waist down"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Berkelium Shyre, also known by the codename \"The Repairman,\" was a Human male technician who lived on the planet Malastare. By the year 1 BBY, he secretly worked for the Rebel Alliance, an insurrectionist organization that had declared war on the Galactic Empire.\nAround 11 BBY, Berkelium Shyre migrated to the planet Malastare during its transition from the Galactic Empire's rule to a state of independence. An anti-Imperialist, Shyre joined the local resistance movement, but later lost the entire lower half of his body when a thermal detonator exploded in the middle of a group of saboteurs he had been helping. He created prosthetic replacements to replace his destroyed limbs, thus making him a machine from the waist down. While he was no longer able to serve in a combatant role, Shyre adapted to his injured state by applying his skills as a technician. In public, he became a businessman and owner of a maintenance store; privately, he continued to participate in activities that undermined the Empire's hold over Malastare.\nAfter living on Malastare for ten years, Shyre became one of the earliest supporters of the Alliance to Restore the Republic by 1 BBY, approximately six months after the start of the Galactic Civil War, a galaxy-wide conflict between the Alliance and the Empire. His support for the budding rebellion against Emperor Palpatine and the New Order involved working in secret to strengthen the Alliance's influence over Malastare. One of his primary contacts in the Rebellion was Juno Eclipse, a Human female officer who defected from the Imperial Navy and joined the Alliance Fleet as captain of the flagship Salvation. The two developed a friendship, which later evolved into a one-sided romantic attraction on Shyre's part. Eclipse still grieved over the death of Galen Marek, Darth Vader's former apprentice whom she fell in love with just prior to Marek's demise on the Death Star.\nSeeking to regroup with the Alliance Fleet, Eclipse visited Shyre on Malastare and inquired about its secret coordinates. Shyre revealed that the fleet was hiding in the Inner Rim, just off of the Hydian Way. Before she could leave, Shyre tried to convince her to remain with him on Malastare, in the hopes that they could start a life together. Eclipse, still unable to overcome her grief over Marek's death, rejected Shyre's advances.\nWhen General Rahm Kota—a Jedi Master and survivor of Order 66—arrived on Malastare shortly after escaping from captivity on Cato Neimoidia, Shyre provided sanctuary to the Jedi general and his squad. Shortly afterward, Shyre met Starkiller, an unstable clone of Marek that Vader created on Kamino in an attempt to replace the original apprentice. Unaware of the clone's origin, Shyre mistook Starkiller to be the same man that Juno Eclipse loved. The clone, however, regarded Shyre as a security risk. Thus, he performed a mind wipe via the Force on Shyre, causing the mechanic to lose his memories of the past few days. As a result, Shyre not only forgot about Starkiller and Kota, but also his last encounter with Eclipse.\nBerkelium Shyre was an expert technician who was also extremely loyal to the Rebel Alliance. Though forced to cope with the condition of being a cyborg from the waist down, the high gravity on his adopted home planet of Malastare greatly strengthened the upper Human half of Shyre's body. Outwardly, Shyre was an enthusiastic supporter of the Rebellion and a firm believer in its cause for freedom against the Galactic Empire. However, Juno Eclipse noticed how Shyre's face physically reflected the psychological strain of secretly supporting an insurrectionist movement against a galactic-wide hegemonic force.\nHe sympathized with Juno Eclipse, regarding her feelings of loss and remorse over the death of Galen Marek. Although Shyre did not know the identity of the man whom Eclipse loved, he nevertheless attempted to support Eclipse emotionally as a friend. As their time together wore on, however, his attraction to her became romantic. Ultimately, Shyre hoped to develop a relationship with Eclipse on Malastare. From Eclipse's perspective, Shyre was smart, loyal, brave and good-humored; an overall good man.\nBerkelium Shyre first appeared in Sean Williams's novelization of the video game Star Wars: The Force Unleashed II.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Blue",
  "/wiki/Cybernetics/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Juno_Eclipse/Legends",
  "/wiki/The_Force_Unleashed_II_(novel)",
  "/wiki/Technician/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Malastare/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Organization",
  "/wiki/Declaration_of_Rebellion/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/11_BBY/Legends",
  "/wiki/Imperialization/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Civil_war",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Captain/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Salvation_(Nebulon-B)",
  "/wiki/Death/Legends",
  "/wiki/Galen_Marek",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Battle_on_Death_Star_I",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Inner_Rim",
  "/wiki/Hydian_Way/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Rahm_Kota/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Rescue_of_Rahm_Kota",
  "/wiki/Cato_Neimoidia/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/General/Legends",
  "/wiki/Kota%27s_squad",
  "/wiki/Subject_1138",
  "/wiki/Cloning/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Gravity/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Sean_Williams",
  "/wiki/Star_Wars:_The_Force_Unleashed_II",
  "/wiki/The_Force_Unleashed_(novel)"
 ]
}