{
 "name": "Bern_Nuladeg",
 "display_name": "Bern Nuladeg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "ThonBoka"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Renatasian Confederation",
      "Zero Squadron",
      "Zero Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Bern Nuladeg was a Renatasian fighter pilot who became one of the final warriors avenging his fallen homeworld during the Imperial Period. Nuladeg was a decorated soldier and flight instructor when the Galactic Empire invaded the Renatasia system and killed millions—including Nuladeg's entire family—and leading to the destruction of Renatasian society. Afterward Nuladeg joined up with old friend Klyn Shanga in a vigilante group called the Renatasian Confederation, which sought to avenge their home by killing Vuffi Raa, whom they blamed for betraying Renatasia to the Imperials and whom they named the \"Butcher of Renatasia.\" Nuladeg flew with the Confederation when they tracked Raa down in the ThonBoka nebula, but was killed in the ensuing battle.\nA Human male, Bern Nuladeg was a native of Mathilde, capital of the planet Renatasia III, site of a long-isolated Human colony that had forgotten its origins and, by the Imperial Period, had only just started to explore the further reaches of its system. Nuladeg grew into a family man and pursued a military career, earning ace status as a fighter pilot during a war with one of Mathilde's neighbors, and eventually becoming the commander of the nation-state's flight academy. However, first contact with the wider galaxy changed everything. Renatasia was visited by two offworlders—a starfish-like being named Vuffi Raa and scholar Osuno Whett—who spent over a year among the Renatasians before transmitting their data to the Galactic Empire and paving the way for a brutal invasion. The Imperial attack in 13 BBY essentially destroyed Renatasian society, resulting in millions of casualties. This number included Nuladeg's entire family, who were killed as sport by a few off-duty Imperial stormtroopers. The troopers' commander, who had taken Nuladeg's former flight academy as his base of operations refused to punish them, dismissing the killings as a \"prank.\" That night, Nuladeg sneaked onto the premises and killed the man himself, with a bayonet to the brain.\nLittle remained for Nuladeg, and what was left of his people, except vengeance. Nuladeg joined a ragtag vigilante group formed from across national lines called the Renatasian Confederation, led by Klyn Shanga, an old friend with whom he had started his piloting career many years before. As one of Shanga's few acquaintances left from before the Imperial invasion, he quickly became one of Shanga's most trusted men, although he refused an official appointment to the position of right-hand man, citing his own impulsiveness. And while the Empire was too powerful to challenge, they had a more manageable target for their anger: Vuffi Raa, now called the \"Butcher of Renatasia,\" upon whom they placed responsibility for Renatasia's demise. In 3 BBY, their hunt for Vuffi Raa led them to the asteroid belt of Oseon system, where they had tracked the Millennium Falcon, a freighter upon which Raa was traveling. The encounter was disastrous for the Confederation—Nuladeg was one of only a couple dozen survivors.\nNuladeg continued to fly with Shanga's Confederation after their near-destruction in the Oseon, reforming for a new campaign aimed at the \"Butcher.\" Their quest for justice led them into cahoots with Sorcerer of Tund Rokur Gepta, a bloodthirsty Force adept who had a murderous grudge against Lando Calrissian, a gambler traveling with Vuffi Raa. Their hunt eventually led them to the ThonBoka, an isolated region in the Centrality home to a previously unknown space-dwelling race called the Oswaft. Shanga brought Nuladeg with him aboard Gepta's flagship Wennis as they negotiated their partnership, but Nuladeg was fixated with the knowledge that the \"Butcher\" was within his grasp and attempted to steal a pinnace to go after Vuffi Raa himself—he was foiled, however, and thrown in the ship's brig.\nGepta intended to brutally execute Nuladeg, but Shanga went to bat for his friend, ultimately securing his release upon their arrival at the ThonBoka. Gepta was true to his word, and when it came time to go after the Millennium Falcon, Nuladeg was back in the cockpit of his starfighter. Flying alongside Shanga and the few Renatasians left in their band, Nuladeg tracked down the Falcon in the ThonBoka and began an all-out assault, but found themselves vastly outgunned. Nuladeg was one of the last Renatasians left by the end of the battle, when he was killed—not by the Falcon, but by Gepta's Wennis, eliminating potential interference for the sorcerer's showdown with Calrissian.\nA small, wiry man who maintained his jovial sense of humor even as he faced death at the hands of Rokur Gepta, Bern Nuladeg embodied the devil-may-care attitude of the Renatasian Confederation in its final days. His home destroyed, Nuladeg felt that he had little to fear from Gepta—to him, the only thing that mattered was bringing justice to Vuffi Raa. Nuladeg was willing to risk anything in order to avenge his family and his home, often not thinking about the risks or the potential consequences. Nuladeg was well aware of his own impulsiveness, although it was a tendency that he allowed few people to see. Nuladeg had a habit of smoking cigars while in a dogfight, joking that he'd bite his tongue without it.\nBern Nuladeg appeared in Lando Calrissian and the Starcave of ThonBoka, written by L. Neil Smith and released in 1983.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/ThonBoka",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Renatasian_Confederation",
  "/wiki/Zero_Squadron",
  "/wiki/Renatasian",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Renatasia_system",
  "/wiki/Klyn_Shanga",
  "/wiki/Vuffi_Raa",
  "/wiki/Nebula/Legends",
  "/wiki/Battle_of_ThonBoka",
  "/wiki/Mathilde",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Renatasia_III",
  "/wiki/Ace/Legends",
  "/wiki/Commander/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Starfish",
  "/wiki/Osuno_Whett",
  "/wiki/13_BBY/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Bayonet/Legends",
  "/wiki/Asteroid_belt",
  "/wiki/Oseon_system",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Sorcerers_of_Tund/Legends",
  "/wiki/Rokur_Gepta",
  "/wiki/The_Force/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Centrality/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Oswaft",
  "/wiki/Flagship/Legends",
  "/wiki/Wennis",
  "/wiki/Pinnace",
  "/wiki/Cigarra/Legends",
  "/wiki/Lando_Calrissian_and_the_Starcave_of_ThonBoka",
  "/wiki/L._Neil_Smith",
  "/wiki/1983",
  "/wiki/Lando_Calrissian_and_the_Flamewind_of_Oseon"
 ]
}