{
 "name": "Berooken",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3653 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Office of the Supreme Chancellor",
      "Galactic Senate",
      "Office of the Supreme Chancellor",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Berooken was a male Mon Calamari politician who served as the Supreme Chancellor of the Galactic Republic during the latter days of the Great Galactic War between the Republic and the reconstituted Sith Empire. Berooken was in office in 3653 BBY, when the Empire's Dark Council proposed that the two governments convene to discuss the possibility of a peace agreement after nearly three decades of war. The Galactic Senate agreed to the call for peace, but the Chancellor chose not to attend the peace summit on Alderaan on the advice of the High Council of the Jedi Order. In the Chancellor's place, Berooken sent the Cerean Senator Paran Am-Ris to represent the Republic Senate in the conference.\nThe summit ultimately turned out to be nothing more than a diversion crafted by the Sith in order to draw attention away from their true target—the Republic's capital world of Coruscant. While the delegates from the two galactic superpowers began their deliberations on Alderaan, the Empire attacked the capital in a massive invasion that came to be known as the Sacking of Coruscant. During the attack, the leader of the Sith force, Darth Angral, breached the Senate Tower and killed Supreme Chancellor Berooken. As a result of the Sacking of Coruscant and Berooken's death, Senator Am-Ris was forced to agree to the Sith-authored Treaty of Coruscant, which firmly placed the Republic as the war's loser.\nIn 3681 BBY, the reconstituted Sith Empire emerged from hiding in the Unknown Regions and launched a interstellar conflict of unrivaled proportions that quickly spread across the galaxy. This Great Galactic War between the Empire and the preeminent galactic government, the Republic, dragged on for twenty-eight years and crippled the Republic both politically and economically. In the latter stages of the war, Berooken, a Mon Calamari politician, was elected to the position of Supreme Chancellor, the leader of the Republic's Galactic Senate. During Berooken's term in 3654 BBY, the Senate was presented with a proposal for peace from the Empire's ruling Dark Council. Having narrowly survived twenty-eight years of war and several supply crises, the Senate welcomed the potential respite, however suspicious the offer may have been. The High Council of the Jedi Order was much less eager to believe the Sith, and advised the Senate and the Chancellor to ignore the apparent trap. Although the Senate overruled the Jedi and accepted the offer, the Council managed to convince Chancellor Berooken to remain on the Republic capital world of Coruscant during the deliberations.\nThe arrangements were made for a peace summit to be held on the Core World of Alderaan in 3653 BBY. To represent the Republic on Alderaan, Chancellor Berooken selected Cerean Senator Paran Am-Ris, who was accompanied to the planet by a delegation from the Jedi Order, consisting of Jedi Master Dar'Nala, Jedi Knight Satele Shan, and several others. While the Republic and Imperial delegations convened to discuss a possible cessation of hostilities, Berooken presided over a session of the Galactic Senate. During the session, the congress heard the testimonies of Jedi Master Orgus Din and Republic Special Forces Division Lieutenant Harron Tavus regarding the Sith withdrawal from the Minos Cluster. The Chancellor was encouraged by their reports, stating that the end of the Empire's offensive in the Cluster was a positive sign that peace between the two superpowers was possible.\nIn truth, the Sith were wholly uninterested in a ceasefire with the Republic; the Empire sought victory, and used the conference on Alderaan as a diversion from its true goal—Coruscant itself. As the Senate session came to a close, Imperial battle cruisers entered the planet's atmosphere and began bombarding the Senate District. The leader of the Sith assault, Darth Angral, disembarked his vessel and led a contingent of Imperial soldiers in a raid outside the Senate Tower. Berooken was able to leave the Senate Chamber and make it to the executive offices, where the Chancellor contacted Senator Am-Ris to warn him of the Empire's deception while the office staff fled the building. As Berooken demanded that the Cerean break off the peace talks, Angral broke through the wall of the office and killed the Chancellor, beheading him. Berooken's death was witnessed by the Republic and Jedi delegation on Alderaan, sparking a short duel between Satele Shan and Lord Baras, the Sith delegate. As the Sith forces settled in to begin an occupation of the Coruscant, Angral adopted the Chancellor's office as his own while overseeing the operation.\nThe attack on the capital, which came to be known as the Sacking of Coruscant, gutted both the Republic and the Jedi Order. The delegation on Alderaan was forced to submit to Imperial demands and sign the Treaty of Coruscant—a Sith-authored document that was heavily biased toward the Empire and firmly placed the Republic as the loser of the Great Galactic War. In the period that immediately followed the signing of the treaty, Am-Ris stepped in as an interim Supreme Chancellor to fill the void left in the aftermath of Berooken's murder. When the Senate reconvened for the first time following the attack, it unanimously elected Senator Dorian Janarus of Coruscant to relieve Am-Ris of the position.\nBerooken had blue skin, a coloration uncommon for members of the Mon Calamari species. Berooken decorated the executive offices with a number of art pieces, including bone carvings from the Mon Calamari homeworld, an oil landscape painting from Alderaan, and a wooden sculpture reminiscent in design to the mythical Zillo Beasts of Malastare. On the day of the Chancellor's death, Berooken garbed himself in a regal white robe with a high golden collar.\nDuring the war, the Chancellor was grateful for the service performed by the Republic's defenders, and made a point to thank Master Din and Lieutenant Tavus for what Berooken deemed to be \"valiant service.\" Nonetheless, Chancellor Berooken was a proponent for peace in a time when much of the galaxy was embroiled in violent warfare. Although the idea of a ceasefire was not popular with all of the Chancellor's colleagues in the Senate, such as the Alderaanian delegation, Berooken was in agreement with a majority of Republic leaders that it was a proposition worth pursuing. Berooken intended to be present at the peace conference on Alderaan, but the Jedi High Council was able to talk the Supreme Chancellor out of attending for fear of a Sith betrayal. Regardless, Berooken remained involved in the peace process and the news that the Sith had ended their offensive in the Minos Cluster encouraged Berooken that peace was indeed a possibility. Upon discovering that the Imperials had no interest in allowing the war to end in a draw, Chancellor Berooken's first priority was to alert Senator Am-Ris on Alderaan and warn him of the Sith attack. Even as Senators and the Chancellor's own office staff fled the Senate Building, Berooken worked to appraise the Republic delegations of the attack. Berooken's final words were a plea to break off the talks, but they were ultimately disregarded by Am-Ris, who gave in to the demands of the Sith.\nThe Mon Calamari Supreme Chancellor was created for Star Wars: The Old Republic, Threat of Peace, a webcomic created as a prelude to LucasArts' and BioWare's online video game Star Wars: The Old Republic. The comic was initially released exclusively online through the Star Wars: The Old Republic official website, but is currently in re-release as comic book issues published by Dark Horse. In the series, the Chancellor appears in only the first issue, Act I: Treaty of Coruscant. The Mon Calamari was mentioned in the 2011 novel The Old Republic: Deceived. In both the comic series and the novel, the Chancellor goes unnamed. Berooken was finally given a name and gender in the 2011 book The Journal of Master Gnost-Dural.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/3653_BBY",
  "/wiki/Coruscant/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Office_of_the_Supreme_Chancellor",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Alderaan_peace_conference",
  "/wiki/Alderaan/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Paran_Am-Ris",
  "/wiki/Sith/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Darth_Angral",
  "/wiki/Senate_Building",
  "/wiki/Death/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3681_BBY",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Galactic_economy",
  "/wiki/3654_BBY",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Dar%27Nala",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Orgus_Din",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Lieutenant/Legends",
  "/wiki/Harron_Tavus",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Minos_Cluster_Campaign",
  "/wiki/Harrower-class_dreadnought",
  "/wiki/Atmosphere/Legends",
  "/wiki/Senate_District",
  "/wiki/Starship/Legends",
  "/wiki/Imperial_soldier",
  "/wiki/Sai_cha/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Galactic_Republic_Chancery_election,_3653_BBY",
  "/wiki/Dorian_Janarus",
  "/wiki/Blue",
  "/wiki/Species/Legends",
  "/wiki/Chancellor%27s_Suite",
  "/wiki/Dac",
  "/wiki/Wood/Legends",
  "/wiki/Zillo_Beast/Legends",
  "/wiki/Malastare/Legends",
  "/wiki/White",
  "/wiki/Gold/Legends",
  "/wiki/Alderaanian/Legends",
  "/wiki/Star_Wars:_The_Old_Republic,_Threat_of_Peace",
  "/wiki/Star_Wars_comic_books",
  "/wiki/LucasArts",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_(comics)",
  "/wiki/Dark_Horse_Comics",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_1:_Treaty_of_Coruscant",
  "/wiki/2011",
  "/wiki/The_Old_Republic:_Deceived",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Category:Images_of_Berooken",
  "/wiki/The_Old_Republic:_Deceived_(audiobook)",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Timeline_6:_Onslaught_of_the_Sith_Empire",
  "/wiki/Timeline_1:_Treaty_of_Coruscant",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/Ruusan_Reformation",
  "/wiki/First_Supreme_Chancellor",
  "/wiki/Fillorean",
  "/wiki/15,500_BBY",
  "/wiki/Pers%27lya",
  "/wiki/11,987_BBY",
  "/wiki/Contispex_I/Legends",
  "/wiki/11,947_BBY",
  "/wiki/Contispex_II",
  "/wiki/Contispex_XI",
  "/wiki/11,591_BBY",
  "/wiki/Contispex_XIX",
  "/wiki/10,966_BBY",
  "/wiki/Biel_Ductavis",
  "/wiki/Blotus",
  "/wiki/Rianitus_Period",
  "/wiki/Nagratha",
  "/wiki/7786_BBY",
  "/wiki/Fattum",
  "/wiki/5010_BBY",
  "/wiki/Pultimo",
  "/wiki/5000_BBY/Legends",
  "/wiki/Vocatara",
  "/wiki/4800_BBY",
  "/wiki/Sidrona",
  "/wiki/3996_BBY",
  "/wiki/Tol_Cressa",
  "/wiki/3963_BBY",
  "/wiki/Leontyne_Saresh",
  "/wiki/Jebevel_Madon",
  "/wiki/Galena_Rans",
  "/wiki/Vedij",
  "/wiki/3017_BBY",
  "/wiki/Genarra",
  "/wiki/1032_BBY/Legends",
  "/wiki/Tarsus_Valorum/Legends",
  "/wiki/1000_BBY",
  "/wiki/992_BBY",
  "/wiki/Female_Supreme_Chancellor",
  "/wiki/Anwis_Eddicus",
  "/wiki/700_BBY",
  "/wiki/Signet_Mezzileen",
  "/wiki/Eixes_Valorum",
  "/wiki/Vaila_Pecivas",
  "/wiki/60_BBY/Legends",
  "/wiki/Thoris_Darus",
  "/wiki/52_BBY/Legends",
  "/wiki/Frix",
  "/wiki/48_BBY/Legends",
  "/wiki/Kalpana_(Supreme_Chancellor)",
  "/wiki/40_BBY/Legends",
  "/wiki/Finis_Valorum/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/19_BBY/Legends"
 ]
}