{
 "name": "Berun Modrul",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dantooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Khoonda",
      "Khoonda Militia",
      "Khoonda Militia"
     ]
    }
   ]
  }
 ],
 "content": "Berun Modrul was a member of the Khoonda Militia 3951 BBY, second in command to Zherron. He was an opinionated young male Human who often suspected he knew better than Zherron what was best and had wanted to try to compromise with Azkul and the mercenaries. When Meetra Surik asked Modrul what he thought of the Jedi, he was one of the few who didn't have a problem with her mentioning that they tried to help the settlers wherever they could and even solving a murder. Modrul later fought in the Battle of Khoonda and realized that Zherron had been right about the mercenaries all along. It is unknown whether Modrul later joined Zherron and the Khoonda Militia in the Battle of Telos IV or if he stayed on Dantooine.\nIn the game, the player has the option to turn Berun into the new captain and Zherron into his subordinate by revealing to Administrator Adare that Zherron is endangering Khoonda by spying upon the mercenaries. This decision awards the player neither dark nor light side points, and thus its canonicity is unknown, although this is mutually exclusive with a quest that the exile should recover atmospheric sensors for one of the militia members, Saedhe. If the player discovers the hidden cameras on the sensors, question the militia member about it and decides to return it at the original price, the player is awarded light side points.\nEven if the player does make Berun the new Militia captain, Zherron is immediately reinstated as the militia has knowledge of Azkul's attack on Khoonda.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Khoonda",
  "/wiki/Khoonda_Militia",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/3951_BBY",
  "/wiki/Zherron",
  "/wiki/Azkul",
  "/wiki/Mercenary/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Calder_Nettic",
  "/wiki/Battle_of_Khoonda",
  "/wiki/Battle_of_Telos_IV",
  "/wiki/Saedhe",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords"
 ]
}