{
 "name": "Beru_Whitesun_Lars",
 "display_name": "Beru Whitesun Lars",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.65 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Beru Whitesun's family",
      "White Suns",
      "Lars family"
     ]
    }
   ]
  }
 ],
 "content": "Beru Whitesun Lars, born Beru Whitesun, was a human female from the planet Tatooine. She was married to Owen Lars, the stepbrother of Jedi Knight Anakin Skywalker, the Chosen One, whose son, Luke, they raised after his father turned to the dark side of the force and his mother died in childbirth.\nIn 0 BBY, the Lars family purchased two droids who, unbeknownst to them, possessed stolen plans for the Death Star, an Imperial superweapon. Imperial stormtroopers tracked the droid to Lars' homestead, where they interrogated and murdered both she and her husband. When Skywalker discovered that his family had been killed, he left Tatooine with Kenobi to train as a Jedi, joining the Rebel Alliance and destroying the Death Star in the Battle of Yavin.\nDuring her youth, Beru Whitesun had a dream of setting up her own cafe or restaurant in Anchorhead. She had this dream because, during her school years, she entered in a cooking class, and the teacher told Whitesun that her blue-milk cheese was the best he had ever tasted, prompting her to have such dream as the instructor said that it appeared that she was born to make blue-milk cheese.\nOn a supply run in Mos Espa, Whitesun stopped at Watto's junk shop to have her portable nav fixed. There, the girl met Watto's slave, Shmi Skywalker, who fixed the device for cheap. Sometime later, Whitesun introduced Shmi to moisture farmer Cliegg Lars, who shortly freed and married Skywalker. Whitesun assisted Skywalker with locating and deprogramming the chips of former slaves, including Skywalker. Whitesun eventually fell in love with Owen Lars, son of Cliegg Lars, so they began dating. Shortly before the outbreak of the Clone Wars, Shmi Skywalker Lars, Owen's stepmother, was abducted by Tusken Raiders, an event that brought Anakin Skywalker, Shmi's son, and Senator Padmé Amidala, to the Lars moisture farm, where they were received by Cliegg. Skywalker arrived too late to save his mother, who passed away in his arms, prompting him to slaughter the Tuskens. When he returned, a funeral was held at the farm. During the funeral, Whitesun served blue milk and cheese to everyone. Whitesun continued to support others on Tatooine working to free enslaved people. She fed and comforted newly freed people and their families.\nThree years later, Whitesun had already married Owen and taken on his last name. Both alone after Cliegg's death, Owen and Beru decided to have a child, but problems of infertility precluded them to have one, leading them to consider seeing one of the fertility droids at Mos Eisley. When the galactic conflict came to a close, Beru and Owen became the guardians of their new nephew, Luke Skywalker, after his father turned to the dark side of the Force and became Darth Vader and his mother died in childbirth. Obi-Wan Kenobi, the Jedi Master and friend of Anakin, delivered infant Luke to the Lars homestead. After receiving Luke, Beru told Owen that they would be raising his stepbrother's son as their own.\nFor the next nineteen years, Lars and her husband raised Skywalker like a son. Lars would often defend Skywalker's interests against Owen, who was overprotective of him out of fear that he would follow in Anakin's footsteps and try to become a Jedi Knight. A year after the Great Drought, Owen was abducted by the Wookiee bounty hunter Krrsantan for unpaid water taxes to the Hutt crime lord Jabba Desilijic Tiure. Lars sought after her husband armed with a rifle, telling a nine-year-old Skywalker to stay safe within the homestead.\nIn 9 BBY, Luke and Owen carried out work at the homestead, all the while being observed from a distance by Kenobi, who left some spare parts for a toy T-16 skyhopper for Luke. As they worked, however, Luke ran away from the labor, climbed on top the homestead, and pretended to podrace, all while Owen and Beru looked for Luke. Upon spotting Luke, Beru laughed while Owen expressed disappointment.\nNot long after, during his rescue of Princess Leia Organa of Alderaan, Luke's twin sister, Kenobi had set off the wrath of the former Inquisitor Reva Sevander, who now wanted to kill Luke. Upon being told by Owen, Beru asked how Sevander had found out where they lived, and Owen admitted that he did not know, adding that Kenobi was gone. He then told Beru that they needed to leave the homestead, but Beru asserted that she would not leave her home. Owen told her that, if they stayed, they would need help, but Beru told her husband that they were enough. She then pulled out two rifles from the homestead, tossed one to Owen, and the two went to position themselves for Sevander's attack.\nThat night, lying to Luke that tusken raiders were on the hunt along the Jundland Wastes, Owen instructed Luke to run if anything happened. Beru then shared an embrace with Luke, and holding back tears, told her nephew that everything would be all right. Owen and Beru then left Luke to prepare for Sevander's impending arrival. Upon her arrival, Owen and Beru began shooting at Sevander, who dodged the shots with her lightsaber. Owen then faced Sevander alone, but when she knocked him down, he called to his wife, informing her that Sevander was on her way to her. Beru managed to distract Sevander long enough for Luke to escape the homestead, but was swiftly knocked down by the former Inqusitor. With Sevander gone, Owen and Beru exited the homestead and began desperately calling out for Luke. Just then, Kenobi returned from his confrontation with Darth Vader and landed by the homestead. Beru relayed the news to Kenobi, who went to look in the Dune Sea but was swiftly called back over by Beru, who saw a weeping Sevander carry Luke back to the homestead. While Kenobi consoled Sevander, Owen and Beru carried Luke back home.\nIn 2 BBY, Kenobi, following a brief confrontation with the former Sith apprentice Maul, visited the Lars moisture farm but watched from a distance. Kenobi heard Lars calling out to a seventeen-year-old Luke from within the homestead, and saw Skywalker running back toward the house against a binary sunset.\nBy 0 BBY, Skywalker, now nineteen, wanted to explore the wider galaxy, having never left Tatooine. Though Owen refused numerous times to let Skywalker go when he wished to leave home and join the Academy, Lars convinced her husband to let Skywalker go after staying on for only one more season. This decision coincided with the aftermath of the theft of the Death Star plans and Darth Vader's capture of Princess Leia Organa over Tatooine.\nAround this time, Skywalker and Owen purchased two droids from a Jawa sandcrawler that stopped by their homestead. These two droids were the protocol droid C-3PO and the astromech droid R2-D2, who were being hunted by the Empire. Before dinner, Skywalker cleaned the two droids in the garage where he found a message from Organa meant to be received by Kenobi. Skywalker told his aunt and uncle about this recording at the dinner table which prompted discussion about the relationship between Kenobi and Skywalker's father. Owen also discussed Skywalker staying another season on the farm, which Lars intervened and tried to reason with her husband that Skywalker shouldn't stay on the farm forever. In this conversation she likened Skywalker with his father, an idea that Owen was not fond of. After dinner Skywalker returned to the garage and found that R2-D2 had fled the homestead. The next morning Skywalker told Lars that he'd had some chores to do and went with C-3PO to look for R2-D2, who was secretly carrying the stolen Death Star plans. A concerned Owen could not find Luke, who was supposed to have the two droid to the south ridge by midday. He spoke to his wife about it, who told him that Skywalker had left early to complete some chores and that he had taken the two droids with him. While Skywalker was away, however, Imperial stormtroopers, who were searching for plans located in R2-D2's memory banks, were led to the Lars homestead by Owen's purchase of the droids from the Jawas. A squad of stormtroopers killed Beru and Owen and burned their home.\nBeyond from the realm of the living, acknowledging her and her husband's deaths, Lars reflected on the role that Skywalker played in her life, remembering herself bustling around the kitchen serving blue milk and haggling Owen to let their nephew attend the Imperial Academy. As she speculated that had Owen let Skywalker go, they could be still alive, Lars remembered various moments of her life, finally resting comfortably with the knowledge that Skywalker went off with Kenobi, met Organa, destroyed the Death Star battle station and saved the galaxy.\nDespite the recent loss of his adoptive family, Skywalker did not grieve until soon after the battle, when his love interest, Nakari Kelen, was killed on the planet Omereth. Kelen's death provided Skywalker a moment to consider his losses, and he wept upon thinking of his uncle and aunt. Skywalker later returned to Tatooine to recover Kenobi's journal, which contained stories of the Jedi's few encounters with the Lars family.\nIn the weeks after the Battle of Yavin, Darth Vader searched for the pilot responsible for destroying the Death Star, discovering that the pilot was the son he never knew he had. Vader, accompanied by Doctor Chelli Lona Aphra, revisited the abandoned homestead and followed Skywalker's trail. While assessing the destruction, Aphra speculated that Skywalker might have never left Tatooine, had his family been spared.\nIn contrast to her husband Owen, who was was gruff and harsh, Beru Whitesun Lars was warm and loving. She always tried to spoil Skywalker every time she had a chance. She loved her nephew and regarded him as her son in all but name.\nLars was a human female who stood at 1.65 meters. She had brown hair, blue eyes, and light skin.\nDuring the Clone Wars, Beru wore light robes in various shades of brown and blue.\nThe character of Beru Lars has existed in one form or another since the rough draft of \"The Star Wars\" in 1974. In this draft, Beru and Owen Lars are anthropologists; there is also a character named \"Clieg Whitsun.\" In the 1975 version of the script, the Larses own a moisture ranch, but they are the parents of Skywalker's cousin, Leia. In a later version, it was finalised that they would be the Aunt and Uncle of Luke Skywalker, and that Beru protects Skywalker from violent outbursts by Owen. By the early 1976 version, the element of the Larses being killed by Imperial stormtroopers was added to the story.\nBritish actress Shelagh Fraser was cast to play Aunt Beru in Star Wars. Fraser's first day of shooting was April 1, 1976; the shots of the Lars' charred skeletons were filmed a few days prior. When post-production on the film began, sound mixer Derek Ball traveled to Fraser's house and recorded additional dialogue. In the mono soundmix of the first release of Star Wars, different takes for Beru's lines were used. All subsequent home video sound mixes use the same take that was used in the initial theatrical Dolby mixes.\nIn the 1981 National Public Radio Star Wars radio drama adapted by Brian Daley and directed by John Madden, Beru was voiced by Anne Gerety.\nOn July 7, 2000, StarWars.com announced that sixteen-year-old Australian actress Bonnie Maree Piesse would be playing the role of a younger Beru in Episode II. Piesse would approach Beru as being a little shy, the idea being that it was the introduction of Luke into her life that matured her. George Lucas wanted to make sure that Beru's costume was similar to the one worn in the first film to help establish a visual connection. Her wardrobe was also partially inspired by that of Skywalker's friend Camie in A New Hope. The first time fans would hear the name \"Beru Whitesun\" was in September 2000, when Lucasfilm began registering domain names featuring names of characters and other things from the upcoming film. This same month, Piesse and the crew were filming the Tatooine scenes in Tunisia. Lucas also filmed part of a scene for Episode III in which a stand-in actor playing Obi-Wan delivers baby Luke to Owen, played by Joel Edgerton. However, this would be changed during the Episode III shoot in September 2003. Lucas filmed Ewan McGregor handing the baby to Piesse, with Owen being played by a stand-in—Edgerton would be shot and added in almost a year later. Lucas made this change because he \"felt it would be better if Luke were handed over to a woman.\"\nAt least one shot of Beru did not make the final 1977 cut of Star Wars: before the family dinner scene, there is a shot of Beru filling a pitcher of blue milk from a dispenser in a portion of the kitchen not visible in the film. Also, a popular production still from the film reveals that the dinner scene was shot, or at least rehearsed, with the family members sitting in different seats than in the film.\nA more substantial Beru scene was cut from Attack of the Clones: after Anakin Skywalker returns to the farm with his mother's body, Beru helps Amidala prepare a meal, featuring blue milk, for Skywalker, having a short conversation with Amidala about Naboo and her own reluctance to travel. Nonetheless, this scene does appear in the film's novelization. A shot of Beru and the Larses waving goodbye to Anakin and Padmé was also shot but not used in the final film.\nDuring Piesse's break from acting after escaping from the cult NXIVM, she received a message from Deborah Chow, the director of the Obi-Wan Kenobi television series. After realizing the message was for casting, Piesse joined a call from Portugal and Chow convinced her to return to the role of Beru Lars. Chow was very excited to bring Edgerton and Piesse back to play Owen and Beru Lars, respectively, and she said their return was part of what made the series special. Piesse got to embody Lars in a different way, and her portrayal was a middle space between Lars starting to be a mother and Shelagh Fraser's portrayal in the original trilogy. Piesse felt like she did not need to try too hard to embody Lars because it was a character that \"just fits so easily.\" Piesse prepared by healing, nourishing, and strengthening herself to have all the energy she needed to be on set. On March 29, 2021, Lucasfilm confirmed Piesse as a cast member of the live-action Disney+ television series Obi-Wan Kenobi. Piesse has said she would like to reprise her role in a second season or an adjacent film for Obi-Wan Kenobi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Beru_Whitesun_Lars",
  "/wiki/Beru_Whitesun_Lars/Legends",
  "/wiki/Lars_(disambiguation)",
  "/wiki/Luke_Skywalker",
  "/wiki/Beru_Whitesun_Lars_(short_story)",
  "/wiki/Queen%27s_Hope",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Star_Wars_(2015)_7",
  "/wiki/Obi-Wan_3",
  "/wiki/Luke_on_the_Bright_Side",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Beru_Whitesun_Lars",
  "/wiki/Tatooine",
  "/wiki/0_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Beru_Whitesun%27s_family",
  "/wiki/White_Suns",
  "/wiki/Lars_family",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Marriage",
  "/wiki/Owen_Lars",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Chosen_One",
  "/wiki/Skywalker_family",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Death",
  "/wiki/Droid",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Galactic_Empire",
  "/wiki/Superweapon",
  "/wiki/Stormtrooper",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Yavin",
  "/wiki/Dream",
  "/wiki/Restaurant",
  "/wiki/Anchorhead",
  "/wiki/Standard_year",
  "/wiki/Unidentified_cooking_instructor",
  "/wiki/Blue-milk_cheese",
  "/wiki/Mos_Espa",
  "/wiki/Watto%27s_junkshop",
  "/wiki/Navigation_computer",
  "/wiki/Slavery",
  "/wiki/Shmi_Skywalker_Lars",
  "/wiki/Moisture_farmer",
  "/wiki/Cliegg_Lars",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Clone_Wars",
  "/wiki/Tusken_Raider",
  "/wiki/Mission_to_rescue_Shmi_Skywalker_Lars",
  "/wiki/Senator",
  "/wiki/Lars_Homestead",
  "/wiki/Funeral_of_Shmi_Skywalker_Lars",
  "/wiki/Blue_milk",
  "/wiki/Cheese",
  "/wiki/Fertility_droid",
  "/wiki/Mos_Eisley",
  "/wiki/The_galaxy",
  "/wiki/Darth",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Master",
  "/wiki/Great_Drought",
  "/wiki/Wookiee",
  "/wiki/Bounty_hunter",
  "/wiki/Krrsantan",
  "/wiki/Water",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Rifle",
  "/wiki/9_BBY",
  "/wiki/Luke_Skywalker%27s_toy_T-16_skyhopper",
  "/wiki/Podracing",
  "/wiki/Rescue_of_Leia_Organa",
  "/wiki/Princess",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Alderaan",
  "/wiki/Inquisitor",
  "/wiki/Reva_Sevander",
  "/wiki/Jundland_Wastes",
  "/wiki/Reva%27s_double-bladed_Inquisitor_Lightsaber",
  "/wiki/Fight_on_a_barren_moon",
  "/wiki/2_BBY",
  "/wiki/Mission_to_Tatooine_(Imperial_Era)",
  "/wiki/Sith_apprentice",
  "/wiki/Maul",
  "/wiki/Galaxy",
  "/wiki/Time",
  "/wiki/Imperial_Academy",
  "/wiki/Battle_of_Scarif",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Jawa",
  "/wiki/Sandcrawler",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Parent",
  "/wiki/Farm",
  "/wiki/Squad",
  "/wiki/Death_Star",
  "/wiki/Battle_station",
  "/wiki/Nakari_Kelen",
  "/wiki/Omereth",
  "/wiki/The_Journals_of_Ben_Kenobi",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Bonnie_Burton",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/1974",
  "/wiki/Clieg_Whitsun",
  "/wiki/Adventures_of_the_Starkiller,_Episode_I:_The_Star_Wars",
  "/wiki/Leia_Organa_Solo",
  "/wiki/1976",
  "/wiki/Shelagh_Fraser",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/April_1",
  "/wiki/1981",
  "/wiki/National_Public_Radio",
  "/wiki/Star_Wars_(radio)",
  "/wiki/Brian_Daley",
  "/wiki/John_Madden",
  "/wiki/Anne_Gerety",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/July_7",
  "/wiki/2000",
  "/wiki/StarWars.com",
  "/wiki/Bonnie_Maree_Piesse",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/George_Lucas",
  "/wiki/September",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Tunisia",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Joel_Edgerton",
  "/wiki/2003",
  "/wiki/Ewan_McGregor",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones_(novelization)",
  "/wiki/Deborah_Chow",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Original_trilogy",
  "/wiki/March_29",
  "/wiki/2021",
  "/wiki/Disney%2B",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Attack_of_the_Clones_Read-Along_Storybook_and_CD",
  "/wiki/The_Prequel_Trilogy_Read-Along_Storybook_and_CD_Collection",
  "/wiki/Star_Wars:_Attack_of_the_Clones_Graphic_Novel_Adaptation",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/Revenge_of_the_Sith_(Golden_Book)",
  "/wiki/Revenge_of_the_Sith_Read-Along_Storybook_and_CD",
  "/wiki/Part_I",
  "/wiki/Part_VI",
  "/wiki/Star_Wars_(2015)_15",
  "/wiki/Star_Wars_(2015)_20",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Twin_Suns_(episode)",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_A_New_Hope_Graphic_Novel_Adaptation",
  "/wiki/Episode_IV:_A_New_Hope_Read-Along_Storybook_and_CD",
  "/wiki/The_Original_Trilogy_Read-Along_Storybook_and_CD_Collection",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/The_Hero%27s_Journey_Begins",
  "/wiki/The_Original_Trilogy_Stories",
  "/wiki/Master_and_Apprentice_(short_story)",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Added_Muscle",
  "/wiki/Time_of_Death",
  "/wiki/Desert_Son",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Star_Wars:_Heroes_Path",
  "/wiki/Heir_to_the_Jedi",
  "/wiki/Heir_to_the_Jedi_(audiobook)",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure_(audiobook)",
  "/wiki/Doctor_Aphra:_An_Audiobook_Original",
  "/wiki/Doctor_Aphra_(script)",
  "/wiki/Star_Wars_(2015)_5",
  "/wiki/Darth_Vader_(2015)_7",
  "/wiki/Doctor_Aphra_(2016)_7",
  "/wiki/Star_Wars_(2015)_32",
  "/wiki/Star_Wars_(2015)_41",
  "/wiki/Star_Wars_(2015)_58",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Stories_of_Jedi_and_Sith_(audiobook)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Darth_Vader_(2020)_1",
  "/wiki/Darth_Vader_(2020)_19",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/The_Legends_of_Luke_Skywalker",
  "/wiki/The_Legends_of_Luke_Skywalker_(audiobook)",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/LEGO_Star_Wars_Terrifying_Tales",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Princess_Leia:_Royal_Rebel",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_11",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_6",
  "/wiki/Droid_Directory",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/LEGO",
  "/wiki/LEGO_Classic_Star_Wars",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/32_BBY",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/August_25",
  "/wiki/2007",
  "/wiki/Micro_Beru",
  "/wiki/Star_Wars_Insider_58",
  "/wiki/Mythmaking:_Behind_the_Scenes_of_Attack_of_the_Clones",
  "/wiki/TheForce.net",
  "/wiki/October_6",
  "/wiki/2017",
  "/wiki/The_Making_of_Star_Wars_Revenge_of_the_Sith",
  "/wiki/The_Evolution_of_Star_Wars:_Exploring_the_Lost_Cut",
  "/wiki/Star_Wars_Insider_41",
  "/wiki/September_30",
  "/wiki/2019",
  "/wiki/July_27",
  "/wiki/2020",
  "/wiki/May_24",
  "/wiki/2022",
  "/wiki/Entertainment_Weekly",
  "/wiki/March_10"
 ]
}