{
 "name": "Beryl Thorne",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Beryl Thorne was a Human female smuggler operating during the Cold War and Galactic War.\nBeryl Thorne first met Risha when the latter, still a young girl, rushed to explore the galaxy and the two became friends and partners in crime. However, on a botched raid on an Imperial treasury station, Thorne was captured and Risha was forced to abandon her to save her own skin. Thorne was sold to a Hutt and was forced to fight her way to freedom. Despite harbouring bitterness towards Risha, Thorne still maintained occasional contact.\nIn 3643 BBY Beryl was operating on Taris alongside her droid AR-G0 and her partner Tyrodall, until the latter faked his death by the Rakghouls and established his own operation. During that time Risha send her newfound smuggler captain to perform a delivery for Beryl as part of the plan to break into a secret vault hidden in Tarisian ruins that contained a means to acquire Nok Drayen's treasure. Upon meeting the smuggler, Thorne sent him on a mission to deliver a package to Doctor Vernan, a Republic scientist, in exchange for the location of the radiation vault. While the smuggler was performing this task, Agent Soganti of Republic Customs Office began a search of Thorne's warehouse for contraband. After acquiring the location of the vault, the captain warned Thorne that Soganti was onto her, forcing her to get off planet. The Voidhound once again met up with Thorne on the planet Quesh, where she was stranded as part of the crew of Captain Ozzik, a Republic privateer.\nThorne later struck out on her own and obtained her own ship. As the Galactic War broke out, Thorne turned down a privateer contract in favor of ferrying war supplies until the Galactic Senate later passed a bill forbidding people with criminal records from doing so. Subsequently, she lost AR-G0 escaping Nar Shaddaa when infighting amongst the Hutt Cartel began. As a result of these string of events, Thorne found herself barely scraping by.\nAround 3637 BBY, Thorne learned of Garblaque the Hutt planning on escaping the conflict in his luxury dreadnaught called Haven. In order to pay for the ship, he began auctioning off thousands of tickets to the ship, which would embark on a ten-year pleasure cruise in order to wait out the galactic conflict. Thorne managed to get a lead on two dozen tickets stolen by pirates and stashed on Rishi. Reuniting with the same smuggler who helped her on Taris, now known as the Voidhound, Thorne proposed a business proposition; if the Voidhound obtained the tickets to Haven, she could sell them at ten times the usual price and split the profit between them. Unfortunately, the smuggler only ended up getting tickets to deck seven, which was reserved for ammonia-breathers and non-humanoids. Nonetheless, Thorne was able to turn a profit and upheld her deal with the Voidhound.\nBeryl Thorne is a character in the 2011 Star Wars: The Old Republic video game and is voiced by Ann Christine.\nShe can be a romance option for a male Voidhound.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Beryl",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Smuggler/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Risha_Drayen",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Hutt/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3643_BBY",
  "/wiki/Taris/Legends",
  "/wiki/Droid/Legends",
  "/wiki/AR-G0",
  "/wiki/Tyrodall",
  "/wiki/Rakghoul",
  "/wiki/Captain/Legends",
  "/wiki/Nok_Drayen",
  "/wiki/Voidhound",
  "/wiki/Doctor/Legends",
  "/wiki/Vernan_(scientist)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Soganti",
  "/wiki/Republic_Customs_Office",
  "/wiki/Quesh",
  "/wiki/Ozzik",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/3637_BBY",
  "/wiki/Garblaque",
  "/wiki/Dreadnaught",
  "/wiki/Haven_(dreadnaught)",
  "/wiki/Rishi/Legends",
  "/wiki/Video_game",
  "/wiki/Ann_Christine",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}