{
 "name": "Beryl_Chiffonage",
 "display_name": "Beryl Chiffonage",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Beryl Chiffonage was a Human male commander of the Alliance to Restore the Republic during the height of the Galactic Civil War. An expert military tactician with an intimate knowledge of Imperial battle tactics, Chiffonage worked closely with Alliance High Command and Alliance Intelligence as a member of the Task Force on Alliance Security. Under the leadership of Alliance Generals Jan Dodonna and Carlist Rieekan, Chiffonage helped to devise attack and defensive maneuvers for Rebel bases, including the base on Dantooine and Echo Base on Hoth.\nChiffonage helped train tactical prodigy Risiev Credal in a variety of ground and airborne scenarios. Before Credal inexplicably disappeared from the Alliance, considered by High Command and Intelligence to be a traitor, he and Chiffonage, in cooperation with Luke Skywalker, developed a series of tactics for T-47 airspeeder squadrons to be utilized against Imperial All Terrain Armored Transports as part of Echo Base's defensive measures. Known as the Rogue Doctrine, Chiffonage's innovation resulted specifically in Attack Pattern Delta and a maneuver in which the airspeeders' harpoon and tow cables entangled and tripped the walkers' legs.\nSkywalker and Rogue Group employed Chiffonage's tactics at the Battle of Hoth against the invading line of AT-ATs with limited success, downing several walkers throughout the engagement. Chiffonage was captured trying to flee Hoth when his escape transport was stopped at an Imperial checkpoint.\nBeryl Chiffonage was a noted military tactician of the Alliance to Restore the Republic during the Galactic Civil War. His service with the Rebellion dated back to the earliest years of the Alliance's struggles against the Galactic Empire, prior to the Battle of Yavin. His duties and assignment locales were typically kept confidential in accordance with his close work with Alliance High Command.\nChiffonage's High Command duties regularly included helping to devise offensive and defensive strategic patterns for a particular Rebel base, working alongside notable Alliance leadership figures such as Generals Jan Dodonna and Carlist Rieekan. He also worked closely with Alliance Intelligence under Chief of Intelligence Airen Cracken as part of the Task Force on Alliance Security, compiling reports on individuals posing significant threats to the Alliance. As of 2 ABY, Chiffonage, a lieutenant colonel, was instrumental in the execution of several Alliance operations, including the Engagement at Jestan. At some point before the end of 2 ABY, Chiffonage had a run-in with mercenaries on Liaq.\nPrior to 0 ABY, Chiffonage was stationed at High Command's headquarters on the planet Dantooine when Risiev Credal, an up-and-coming tactical prodigy in his own right, was transferred to the base. For some time Chiffonage trained Credal, who was considered to be one of the Alliance's future leaders, in tactics for a countless variety of scenarios, including the Dsalisn Theories on low atmosphere combat and the urban tactics used on Thyrsus. Credal's work reflected the expert tutelage under which he learned.\nChiffonage and Credal, together with Luke Skywalker, leader of the elite Rogue Squadron, developed a series of innovative tactical maneuvers for T-47 airspeeder squadrons in the event of attack from Imperial walkers. Known as the \"Rogue Doctrine,\" which consisted of three individual strategic components, drawn together from the collective experience of all Rogue Squadron pilots over the years, the trio's efforts set the standard for combat airspeeder tactics.\nSpecifically, Chiffonage and Credal devised Attack Pattern Delta, a veritable game of \"chicken,\" in which a group of speeders approached a walker in single-line formation in order to give the walker a single target at which to fire. While the walker could only track a single speeder at a time, the other speeders were offered a clear shot and a clean getaway.\nBut perhaps the most difficult element of the doctrine to execute, as devised by Chiffonage and Skywalker, was inspired by a group of primitives. Chiffonage realized that walkers were too large and well-armed for most Rebel weaponry, so he dreamed of a way to turn the walkers' greatest strength—their size—into their greatest weakness. Chiffonage knew that the walkers could potentially be crushed under their own weight if the Rebels could only find a way to trip them. During an expedition to the primitive planet Verig, Chiffonage found his answer in Verig's native nomadic hunters, who used a bola-like weapon, a long rope with stones tied to each end, to trip the giant, elephantine Pryss-creatures.\nDrawing upon what he learned from Verig, as well as previous Rebel operations on the planets Corellia and Balmorra, in which Rebel pilots improvised a way to trip advancing All Terrain Armored Transports by using the tow cables of T-47 airspeeders, a last-ditch technique, Chiffonage personally designed a special high-powered harpoon attached to a flexisteel tow cable and fusion disc for use in a unique tactical maneuver of his own. Attached to the rear of the T-47, the resultant harpoon and tow cable would be used to tangle a walker's legs and trip it to the ground, effectively neutralizing the war machine.\nFor reasons neither High Command nor Intelligence could begin to understand, in 2 ABY Credal jumped into hyperspace while overseeing patrols in the Anoat system, never to be heard from again. Although Intelligence believed him to be a traitor, Chiffonage filed a report for the Task Force on Alliance Security regarding Credal, praising his contributions and expressing his expectations for Credal's eventual return.\nAs of 3 ABY, Chiffonage, since promoted to commander, served with High Command under Rieekan at the secret Echo Base on the planet Hoth, and was regularly stationed in the base's command center as a controller. He was present in the command center, working with Princess Leia Organa, when Han Solo reported to Rieekan of his need to leave the Alliance in order to settle personal issues.\nWhen an Imperial Viper probe droid discovered Echo Base shortly thereafter, Rieekan ordered an immediate evacuation of the facility. Chiffonage and Skywalker knew the Alliance would be facing Imperial walkers in the imminent engagement, and to that end they planned to utilize the tactics of Rogue Doctrine with the base's T-47 airspeeders to muster what offense they could in delaying the Imperial attack. During the Battle of Hoth, Skywalker and Rogue Group discovered that the thick armored hulls of the Imperial AT-ATs were impervious to their speeders' blaster cannons, nullifying whatever effects Attack Pattern Delta may have had. Instead, Skywalker ordered the Rogues to use their harpoons and tow cables to trip the walkers' legs in a last-ditch effort to stop their advance.\nAlthough the Rebellion suffered a major defeat at Hoth, Chiffonage's designed maneuvers resulted in the downing of several AT-ATs during the battle, the success of which the Rebels owed directly to the nomads of Verig. While a significant portion of Echo Base's command staff succeeded in evacuating the planet and slipping by the Imperial blockade in orbit, Chiffonage was captured when his escape transport attempted to pass through an Imperial checkpoint.\nAlthough Chiffonage was credited with coming up with the idea to use tow cables to trip the AT-AT walkers on Hoth, a young Imperial stormtrooper recruit, Davin Felth, hypothesized a similar maneuver years before in 0 BBY during an AT-AT training exercise. Felth suggested to then-Colonel Maximilian Veers, head of the Imperial AT-AT program, that the walkers' legs were particularly vulnerable to being tangled and tripped with a cable. While Felth's discovery greatly impressed Veers, he kept the information private and buried Felth in the Imperial Stormtrooper Corps to prevent the secret from damaging his career, which was closely linked to the success of the walkers. Ironically, Veers would face Chiffonage's identical tactic years later at Hoth, to somewhat devastating effects.\nWedge Antilles, the first pilot to down an AT-AT at Hoth using the maneuver, would reuse the tactic several months later to trip three more walkers at the Battle of Kothlis. Rogue Squadron helped to secure the plans to the second Death Star at that engagement.\nBeryl Chiffonage displayed tactical brilliance during his career developing strategy for Alliance High Command. His abilities earned him assignments to the Rebel headquarters on Dantooine and Hoth, and he contributed to the success of several Alliance operations as well as helping to train the talented Risiev Credal. Chiffonage's intimate knowledge of Imperial battle tactics was crucial in developing the Rogue Doctrine with Credal and Luke Skywalker, and he personally designed the harpoon and tow cable, with inspiration from Verig's primitive natives and former Rogue Squadron operations, that would be attached to the rear of Echo Base's T-47 airspeeders for use by Rebel gunners as a reserve defense against Imperial walkers.\nPrior to Alliance military briefings, Chiffonage would spend a great amount of time reminiscing about his early career with Airen Cracken and Credal, who would eagerly and intently listen to the stories, whether or not there were tactical lessons to be learned. Even after Credal abandoned the Alliance, although Chiffonage expressed that he would harshly reprimand his student, he also wished to tell him about his encounter with mercenaries on Liaq.\nThe character of Beryl Chiffonage was first created for the 1988 West End Games board game Assault on Hoth, in which he is established as the innovative Rebel tactician who devises the harpoon and tow cable tactic used during the Battle of Hoth. Chiffonage was later included in the 1989 first edition of the West End Games sourcebook Galaxy Guide 3: The Empire Strikes Back, which further expounds upon Chiffonage's involvement in the development of the Rebel tactics used at the Battle of Hoth, most notably Attack Pattern Delta and the harpoon and tow cable trick. Chiffonage's backstory was detailed in the 1995 Star Wars: The Roleplaying Game supplement Alliance Intelligence Reports, which established the character as a valuable tactician of both Alliance High Command and Alliance Intelligence.\nThe article Who's Who in Echo Base, written by Josh Radke for Star Wars Insider 74, identifies Chiffonage as one of the Rebel extras present in the Echo Base command center working with Princess Leia Organa at the beginning of Star Wars: Episode V The Empire Strikes Back, retconning the film as the character's first appearance.\nAlliance Intelligence Reports presents an inconsistency regarding the character's gender. Assault on Hoth originally established Chiffonage as a male character, but the subsequent creation of Alliance Intelligence Reports contradicted this by identifying the character as female, the only source to do so. Radke's Who's Who article identifies Chiffonage as male—one of the real-life actors seen in The Empire Strikes Back—as does The Complete Star Wars Encyclopedia, released in 2008. Given the majority of sources, this article assumes that Chiffonage is indeed male and treats Alliance Intelligence Reports as a canonical inconsistency.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Chiffonage",
  "/wiki/Beryl_Chiffonage",
  "/wiki/Beryl",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/General/Legends",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Carlist_Rieekan/Legends",
  "/wiki/Dantooine_base/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Risiev_Credal",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/T-47_airspeeder/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Rogue_Doctrine",
  "/wiki/Attack_Pattern_Delta/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Power_harpoon",
  "/wiki/Walker/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Imperial_Office_of_Customs/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Chief_of_Intelligence/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Lieutenant_Colonel/Legends",
  "/wiki/Engagement_at_Jestan",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Mercenary/Legends",
  "/wiki/Liaq",
  "/wiki/0_ABY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Dsalisn_Theories",
  "/wiki/Atmosphere/Legends",
  "/wiki/Thyrsus/Legends",
  "/wiki/Rogue_Leader/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Verig",
  "/wiki/Verig_native",
  "/wiki/Bola/Legends",
  "/wiki/Rope/Legends",
  "/wiki/Elephant",
  "/wiki/Pryss-creature",
  "/wiki/Battle_of_Corellia_(1_ABY)",
  "/wiki/Raid_on_Balmorra",
  "/wiki/Flexisteel",
  "/wiki/Fusion_disk",
  "/wiki/Hyperspace/Legends",
  "/wiki/Anoat_system/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Viper_probe_droid/Legends",
  "/wiki/Evac_Rearguard_Action_101",
  "/wiki/Armor/Legends",
  "/wiki/Blaster_cannon/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Davin_Felth/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Maximilian_Veers/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Kothlis",
  "/wiki/Death_Star_II_plans",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Gunner/Legends",
  "/wiki/1988",
  "/wiki/West_End_Games",
  "/wiki/Assault_on_Hoth",
  "/wiki/1989",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back",
  "/wiki/1995",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Who%27s_Who_in_Echo_Base",
  "/wiki/Josh_Radke",
  "/wiki/Star_Wars_Insider_74",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Retcon",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/Canon",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(PhotoComic)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/1980_Topps_Star_Wars:_The_Empire_Strikes_Back_Series_3",
  "/wiki/The_Rebel_Alliance_Sourcebook",
  "/wiki/The_Movie_Trilogy_Sourcebook",
  "/wiki/The_Rebel_Alliance_Sourcebook_(Second_Edition)",
  "/wiki/Star_Wars_Technical_Journal_of_the_Rebel_Forces",
  "/wiki/Shadows_of_the_Empire_Sourcebook",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Hoth_Limited",
  "/wiki/The_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Visual_Dictionary",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_12",
  "/wiki/The_Official_Star_Wars_Fact_File_28",
  "/wiki/Star_Wars_Insider",
  "/wiki/Wizards.com",
  "/wiki/Galactic_Gazetteer:_Hoth_and_the_Greater_Javin",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_10",
  "/wiki/Action_Stations",
  "/wiki/The_Official_Star_Wars_Fact_File_(2013)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_5_(2013)",
  "/wiki/Star_Wars_in_100_Scenes",
  "/wiki/When_the_Desert_Wind_Turns:_The_Stormtrooper%27s_Tale",
  "/wiki/Tales_from_the_Mos_Eisley_Cantina",
  "/wiki/Star_Wars:_Rogue_Squadron_II:_Rogue_Leader"
 ]
}