{
 "name": "Besany Wennen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Treasury Audit Division",
      "Republic Treasury Audit Division",
      "Mandalorians",
      "Clan Skirata",
      "Clan Skirata"
     ]
    }
   ]
  }
 ],
 "content": "Besany Wennen was an agent of the Republic Treasury Audit Division.\nShe posed as a Grand Army of the Republic  Logistics worker on Coruscant in 21 BBY, in order to investigate Vinna Jiss, who was suspected of misappropriating supplies. While undercover, she developed a friendship with Corr, a clone trooper who lost his hands while disarming a bomb and was transferred to a civilian post until he received higher-quality prosthetics that would allow him to return to the front. Corr's prosthetic hands caused her to feel sorry for the clone troopers; she felt that the government used the clones as a \"slave army.\" After Jiss was covertly eliminated, she helped with Kal Skirata's classified mission to uncover terrorists in Coruscant's The Works. By the end of Skirata's mission, she and the Null ARC trooper Ordo began showing interest in each other.\nIn 21 BBY Skirata asked her to acquire some information from the Republic and had Mereel supply her with a small Merr-Sonn blaster for her protection. She was able to acquire the information and began investigating further but was warned by an unknown Gurlanin that she was being watched and should not dig any deeper. When RC-8015  was injured on Gaftikar, Kal Skirata asked Wennen to keep an eye on him while he was being treated in a private hospital. When she arrived, the medical droid had diagnosed him as brain dead and was about to euthanize him. She drew her blaster and locked herself in the room with Fi. CSF officer Jaller Obrim arrived shortly after and took her and Fi to safety. Besany joined Kal Skirata's team, regularly supplying them with Treasury information, and looking after Darman Skirata's son, young Venku Skirata.\nOne day on her way home, she saw a man stalking her in the transparisteel walls of Galos Mall. Certain that he was a Republic Intel agent, the Chancellors \"Hands,\" she tried to shake him off. However, she made a mistake and instead of sticking with the crowds, she inadvertently walked into a deserted location of the city. As she was about to confront the agent, another man following him grabbed him from behind, who turned out to be Captain Ordo. Following that incident, Ordo proposed to her in her apartment in the middle of supper, offering her a multimillion-credit Sharoni sapphire pin since he didn't have a ring. She accepted the proposal. She later had a section of the sapphire put into a wedding ring, and the rest of the sapphire was sold to add to Kal Skirata's clone research funding. Also after this she left her apartment and moved into the slums, into Laseema's apartment, the secret Skirata safehouse.\nSkirata assigned two of his Null adopted sons, Mereel and Jaing Skirata, as \"fundraisers\" for his research into stopping the clone rapid aging, to give his boys a natural life. Agent Besany Wennen, now Ordo Skirata's new wife, had previously given Kal and the Nulls her national Republic Treasury access codes, so they could research where new clones were coming from to get new cloning research material and to see where the war was going. Upon Jaing's data-mining worm virus being discovered, the Republic Treasury launched a full investigation. The Republic special investigators brought in were Mereel and Jaing, their involvement in the actions that caused the investigations unknown to the GAR. Jaing and Mereel's investigations revealed no results, as they had erased their and Besany's tracks in the system as they went along, and they would have to check Army databases in addition to treasury databases to see how far this \"mystery program\" went. The Republic agreed to give the Nulls full access to all GAR records. While the Null investigation found nothing, the droid investigation revealed questionable access made by one of Besany's co-workers, Jilka Zan Zentis, investigating a government shell company on Besany's request. Besany felt awful that her friend Jilka was imprisoned because of her. Later a Gurlanin spy told Besany that Jilka was framed, and the actions made on Jilka's terminal were made obvious by the Gurlanins so the GAR wouldn't see any of Besany or Skirata's sons' actions. Besany was upset her friend was going to prison in her place, but Ordo and Skirata didn't understand why. Skirata ordered Jilka to be broken out of jail, her prison transport hijacked by Ordo and Wad'e Tay'haai.\nBesany evacuated Coruscant and moved to Mandalore with the Skirata clan. Much later, when Kal Skirata was forced to abandon Darman and Niner on Coruscant directly after Etain Tur-Mukan was killed, she was instrumental in helping Kal overcome his grief. She related to Kal often on the subject of remembering their fathers, and how Kal was her new father.\nShe wanted Jilka Zan Zentis to have a lover, specifically Fi Skirata.\nShe wondered why Ordo slept with his head under his blanket. Kal Skirata said it was because on Kamino the clones were subjected to exercises involving live explosives.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Treasury_Audit_Division",
  "/wiki/Mandalorian/Legends",
  "/wiki/Clan_Skirata",
  "/wiki/Agent/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Vinna_Jiss",
  "/wiki/RC-5108/8843",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Kal_Skirata",
  "/wiki/Mission_to_Coruscant_(Clone_Wars)",
  "/wiki/Sector_943",
  "/wiki/Null_ARC_trooper",
  "/wiki/Ordo_Skirata",
  "/wiki/Mereel_Skirata",
  "/wiki/Merr-Sonn_Munitions,_Inc./Legends",
  "/wiki/Gurlanin",
  "/wiki/Fi_Skirata",
  "/wiki/Gaftikar",
  "/wiki/CSF",
  "/wiki/Jaller_Obrim",
  "/wiki/Darman_Skirata",
  "/wiki/Venku_Skirata",
  "/wiki/Transparisteel/Legends",
  "/wiki/Galos_Mall",
  "/wiki/Besany_Wennen%27s_apartment",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Laseema%27s_apartment",
  "/wiki/Jaing_Skirata",
  "/wiki/Jilka_Zan_Zentis",
  "/wiki/Spy/Legends",
  "/wiki/Wad%27e_Tay%27haai",
  "/wiki/RC-1309",
  "/wiki/Etain_Tur-Mukan",
  "/wiki/Null-11",
  "/wiki/Kamino/Legends",
  "/wiki/Republic_Commando:_Triple_Zero",
  "/wiki/Star_Wars_Insider",
  "/wiki/Odds",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Databank_(original)"
 ]
}