{
 "name": "Bessiker",
 "display_name": "Bessiker",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Balmorra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireImperial Military",
      "Imperial Military"
     ]
    }
   ]
  }
 ],
 "content": "Bessiker was a Human male who served as a major in the Imperial Military of the reconstituted Sith Empire, and was stationed on the planet Balmorra.\nKnown to be proud, Bessiker fought with distinction at Coruscant and Begeren. Bessiker came from a distinguished Imperial lineage, and in spite of his connections among the Sith – both his brother and his son trained on Korriban – Bessiker never complained about his posting on Balmorra or the difficulty of his job.\nIn 3643 BBY, he served as a chief supply officer on the planet during the Cold War. As the Empire provided fewer and fewer resources to support the ongoing pacification of Balmorra, Bessiker almost single-handedly propped up the Imperial war effort, scavenging and repurposing old equipment as well as improvising armor and weaponry in a pinch. He eventually encountered Kallig, who was on the trail of one of Tulak Hord's artifacts on Balmorra. When he heard that Iannos Tyrek defected to the Galactic Republic and his son was held prisoner, Bessiker refused to create the mutagen that Kallig needed and tasked the Sith Inquisitor to rescue Hiran.\nWhile Kallig went on the search, Bessiker developed a plan to enter the toxic waste-filled vault where the artifact was hidden, but he discovered that Balmorran scientists genetically engineered an insectoid race called Colicoids to be more resistant and even feed on the toxic waste. He suggested that Kallig should search the nearby records vault for more information on the artifact. When his agent reported that Kallig killed Hiran in a duel for insulting him, he berated the inquisitor and demanded why he had to kill him. In a fit of rage, Bessiker attempted to kill Kallig and Khem Val. Bessiker lost, and was replaced by Ilun as Major.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Balmorra/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Major/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Begeren",
  "/wiki/Hiran_Bessiker",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Darth_Nox",
  "/wiki/Tulak_Hord",
  "/wiki/Iannos_Tyrek",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Inquisitor",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Colicoid/Legends",
  "/wiki/Ilun",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}