{
 "name": "Bettle",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ralltiir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic",
      "Smugglers' Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Bettle was a Human female smuggler and teammate of Jaxa. The two became notable in smuggling circles, and their exploits were regularly featured in Cynabar's InfoNet. Bettle assisted the resistance on Ralltiir and was present when the New Republic liberated the planet from Imperial control. Later, she and Jaxa became members of Talon Karrde's Smugglers' Alliance.\nThe Ralltiiri Human female Bettle was one of two daughters of Jerell, a resistance leader of the planet Ralltiir; the other was dead by the time of Ralltiir's liberation, a death her father blamed on Imperial governor Dennix Graeber. She later became a smuggler and the partner of Jaxa. By 0 ABY, the pair and their ship, the Mallixer, had become famous enough to be tracked by Cynabar's InfoNet, an elite smuggling NewsNet.\nWhen the Empire cracked down on Ralltiir, Bettle and Jaxa were one of many groups of smugglers who attempted to run the blockade with supplies for the cut-off world. However, that venture was fruitless, and the pair began marketing slugthrowers to various warring species located beyond the Corporate Sector. That project was more successful, and the pair brought back a full cargo of canta salt and havao tabacc, although the Mallixer was damaged in the process.\nBettle could not escape her heritage, however, and her father convinced her to assist in the Rebellion, joking that it paid her better than her smuggling did. She began by running guns to Ralltiir with Jaxa, despite the latter's displeasure with the venture's riskiness and with the near-snagging of the Mallixer by Imperial forces. The disagreement strained their relationship, but they soon worked out their disagreements and were again operating as a team to make the \"Spirva Run,\" smuggling items from Galladinium's Datalog to rioters in the Spirva sector. During their career, the pair visited at least thirty-four shadowports around the galaxy.\nEventually, Bettle became more directly involved with the Rebellion. Following the Battle of Endor, she was present with her father in an underground communications center on Ralltiir. While she was monitoring communications from a strike team led by Spike, Governor Graeber initiated communication with Jerell, taunting him with the fact that the New Republic had not yet taken a single Core World. In the midst of that communication, Spike's team destroyed the planet's power generators; meanwhile, a task force of six Mon Calamari Star Cruisers entered the star system, ensuring that Ralltiir would be the first Core World to fall to the New Republic.\nBettle returned to smuggling with her old compatriot after the victory. During the Thrawn campaign, Talon Karrde formed the Smugglers' Alliance, an organization which Bettle and Jaxa eventually joined. When the New Republic declared the Moruth Doole regime of Kessel to be illegitimate, the Smugglers' Alliance was cleared to occupy the world; Bettle and Jaxa were responsible for developing preliminary distribution plans for the glitterstim spice market.\nBettle was in many ways rough around the edges. She frequently cursed, and was not above giving a malicious grin or a wicked laugh when her enemies faced setbacks. Although a smuggler, her eyes were not always on the bottom line, especially when her homeworld was involved; her willingness to run weapons through the blockade strained her long association with her partner, and eventually her father convinced her to become more involved in active rebellion. She sported long hair.\nBettle utilized a headset comlink and wore long-sleeved clothing that was equipped with a belt.\nBettle first appeared in the premiere of the \"Galaxywide NewsNets\" feature in Star Wars Adventure Journal 3, written by Paul Sudlow and published in August 2003. She was first pictured in the 1995 supplement to Star Wars: The Roleplaying Game, Heroes \u0026 Rogues, where she was illustrated by Robert Duchlinski.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ralltiir/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Smugglers%27_Alliance",
  "/wiki/Smuggler/Legends",
  "/wiki/Jaxa",
  "/wiki/Cynabar%27s_InfoNet",
  "/wiki/Battle_of_Ralltiir_(4_ABY)",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Talon_Karrde",
  "/wiki/Ralltiiri",
  "/wiki/Parent/Legends",
  "/wiki/Jerell",
  "/wiki/Bettle%27s_sister",
  "/wiki/Death/Legends",
  "/wiki/Time/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Dennix_Graeber",
  "/wiki/0_ABY/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Mallixer",
  "/wiki/NewsNet",
  "/wiki/Blockade/Legends",
  "/wiki/Slugthrower/Legends",
  "/wiki/Species/Legends",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Canta_salt",
  "/wiki/Havao_tabacc",
  "/wiki/Spirva_Run",
  "/wiki/Galladinium%27s_Galactic_Datalog_of_Fantastic_Technology",
  "/wiki/Spirva_sector/Legends",
  "/wiki/Shadowport/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Spike_(individual)",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Power_generator/Legends",
  "/wiki/Mon_Calamari_Star_Cruiser",
  "/wiki/Ralltiir_system",
  "/wiki/Thrawn_campaign",
  "/wiki/Moruth_Doole",
  "/wiki/Kessel/Legends",
  "/wiki/Glitterstim/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Headset_comlink",
  "/wiki/Clothing/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Galaxywide_NewsNets",
  "/wiki/Star_Wars_Adventure_Journal_3",
  "/wiki/Paul_Sudlow",
  "/wiki/August",
  "/wiki/2003",
  "/wiki/1995",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Heroes_%26_Rogues",
  "/wiki/Robert_Duchlinski",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Star_Wars_Adventure_Journal_5",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/Star_Wars_Adventure_Journal_14",
  "/wiki/West_End_Games",
  "/wiki/Hasty_Exit",
  "/wiki/Shadows_of_the_Empire_Sourcebook",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/The_Essential_Atlas",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Great_ReSynchronization",
  "/wiki/Standard_month/Legends"
 ]
}