{
 "name": "Bev_Plar",
 "display_name": "Bev Plar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Blarina"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Bev Plar was a Blarina merchant, operating on the planet Burnin Konn during the reign of the Galactic Empire. Plar trafficked in specialized goods—including shipments of materials used for crafting armor and weapons—which the Blarina sold for a variety of currencies, such as credits, chromium, or accredited requisition scripts.\nFollowing the enactment of the so-called \"Iron Blockade\" of the Anoat sector by Imperial Governor Ubrik Adelhard, Plar conducted business with a number of individuals at the Konn-Nevos Spaceport, among them a local, up-and-coming young smuggler. Plar's inventory was often changing, and the vendor advised those he did business with to check his wares often for new merchandise.\nBev Plar first appeared in Star Wars canon in the multiplayer mobile game Star Wars: Uprising, created by the Kabam company and released on September 10, 2015 for iOS and Android platforms. Within the scope of the game, Plar acts as an item vendor, offering randomized goods in exchange for several in-game currencies.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Blarina",
  "/wiki/Color",
  "/wiki/Merchant",
  "/wiki/Planet",
  "/wiki/Burnin_Konn",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Armor",
  "/wiki/Blaster",
  "/wiki/Currency",
  "/wiki/Credit",
  "/wiki/Chromium",
  "/wiki/Iron_Blockade",
  "/wiki/Anoat_sector",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/Konn-Nevos_Spaceport",
  "/wiki/The_Smuggler",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Kabam",
  "/wiki/September_10",
  "/wiki/2015",
  "/wiki/IPhone",
  "/wiki/Android_(operating_system)"
 ]
}