{
 "name": "Bewil",
 "display_name": "Bewil",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Bewil was a human male who served as a captain in the Galactic Empire during its war against the Rebel Alliance. In 3 ABY, he was part of the forces serving under Sith Lord Darth Vader that occupied Cloud City over the planet Bespin in order to capture the Jedi trainee Luke Skywalker. Bewil informed Vader when Skywalker's T-65B X-wing starfighter was sighted approaching the city and was present in Cloud City's carbon-freezing chamber when Skywalker's companion Han Solo was frozen in carbonite.\nThe human male Bewil served in the Galactic Empire's Imperial Officer Corps as a captain and soldier during the Galactic Civil War against the Alliance to Restore the Republic. In 3 ABY, he was among the Imperial forces led by Sith Lord Darth Vader that occupied Cloud City over the planet Bespin. Vader aimed to capture the crew of the rebel YT-1300 light freighter Millennium Falcon and then use the rebels as bait as part of a larger trap for their comrade, the Jedi trainee Luke Skywalker.\nVader captured the Falcon's crew with aid from the bounty hunter Boba Fett and Lando Calrissian, Baron Administrator of Cloud City. The Sith Lord then viewed the city's carbon-freezing chamber, where he hoped to freeze Skywalker in carbonite for transportation to the Galactic Emperor, Sheev Palpatine. Bewil approached Vader in the chamber and informed him that Skywalker's T-65B X-wing starfighter had been spotted approaching Cloud City. Vader ordered that the captain monitor the Jedi and allow him to land. Bewil nodded and quickly walked away.\nVader decided to test the carbon-freezing process before using it on Skywalker to ensure that it would not kill the Jedi, and so ordered the Falcon's captain, Han Solo, to be frozen first. Bewil stood by in the chamber and observed Solo being lowered and frozen. Once the process was complete and Calrissian had confirmed that Solo had survived the process, Bewil approached Vader and informed him that Skywalker had landed.\nThe Sith ordered Bewil to make sure that the Jedi found his way to the freezing chamber, and the captain left to carry out the orders. Skywalker was ultimately lured into the chamber while trying to rescue his friends, but managed to escape from Vader and leave Cloud City on the Falcon with its crew and Calrissian, who had betrayed the Empire.\nBewil had brown hair, gray eyes, and light skin.\nBewil wore a standard olive-gray Imperial officer's uniform with a cap, one code cylinder, and a rank insignia plaque showing two red bars above two blue.\nBewil first appeared in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back, in which he was portrayed by Milton Johns, who was credited only as one of several \"Other Officers.\" Johns was hesitant to take such a small part, but after being booked initially for only a week of work, he ultimately was kept on for six weeks, delivering his first line on his second week and in his fourth week beginning to work on the cooling chamber set on Stage 5 at Elstree Studios. Further production issues meant his scenes were then not actually filmed until his sixth week, with the scene of Solo being frozen being shot on June 21, 1979.\nIn the new Star Wars canon, Bewil's name was first used in the 2019 Topps Star Wars Black \u0026 White: The Empire Strikes Back set of trading cards released by The Topps Company, Inc. in 2018, including cards signed by Johns himself. The name was originally introduced in the Star Wars Legends continuity's Cloud City Limited set of cards, released for the Star Wars Customizable Card Game in 1997. According to a Star Wars CCG fansite, Bewil was named as an anagram of Decipher game designer Sandy Wible.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Bewil",
  "/wiki/Bewil/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/File:BewilVader2.ogg",
  "/wiki/Captain",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/3_ABY",
  "/wiki/Imperial_Military",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Cloud_City",
  "/wiki/Planet",
  "/wiki/Bespin",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Luke_Skywalker",
  "/wiki/Red_Five_(T-65B_X-wing_starfighter)",
  "/wiki/City",
  "/wiki/Carbon-freezing_chamber",
  "/wiki/Han_Solo",
  "/wiki/Carbon-freezing",
  "/wiki/Carbonite",
  "/wiki/File:BewilVader1.ogg",
  "/wiki/File:Bewil_and_Vader.png",
  "/wiki/Soldier",
  "/wiki/Heroes_of_Yavin",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Baron_Administrator",
  "/wiki/Sith_Lord",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Imperial_officer",
  "/wiki/File:BewilVader.png",
  "/wiki/Carbon",
  "/wiki/Death",
  "/wiki/Sith",
  "/wiki/Officer",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_kepi",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/File:Kershner_and_Johns.png",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Milton_Johns",
  "/wiki/Elstree_Studios",
  "/wiki/June_21",
  "/wiki/1979",
  "/wiki/Star_Wars",
  "/wiki/2019_Topps_Star_Wars_Black_%26_White:_The_Empire_Strikes_Back",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2018",
  "/wiki/Star_Wars_Legends",
  "/wiki/Cloud_City_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/1997",
  "/wiki/Tuckerization",
  "/wiki/Decipher,_Inc.",
  "/wiki/Sandy_Wible",
  "/wiki/Category:Audio_files_of_Bewil",
  "/wiki/Category:Images_of_Bewil",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider",
  "/wiki/Assistant_of_the_Empire",
  "/wiki/Star_Wars_Insider_147",
  "/wiki/The_Making_of_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/August_31",
  "/wiki/2009"
 ]
}