{
 "name": "Bey_Gandan",
 "display_name": "Bey Gandan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "26 ABY",
      "Thyferra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Emerald"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order",
      "New Republic",
      "Yuuzhan Vong",
      "Dark Jedi"
     ]
    }
   ]
  }
 ],
 "content": "Bey Gandan was a young male Human Jedi Knight during the Yuuzhan Vong War.\nGandan trained alongside Yabeley and Klin-Fa Gi, having a crush on the latter, as did Yabeley. He was very jealous of Yabeley, which led to his fall to the dark side. The trio traveled to Wayland to investigate the Yuuzhan Vong presence on the world. They were captured by the Yuuzhan Vong, whom tortured Yabeley to death in an interrogation attempt. Gandan and Gi were enslaved aboard a Shapers' worldship, from whence they escaped with a qahsa containing information on a Shaper project to exterminate the Jedi.\nGandan was recaptured by the Yuuzhan Vong, but Gi avoided capture on Bonadan with the help of Uldir Lochett. Lochett helped Gi return to Wayland to recover the key to the qahsa and then helped her rescue Gandan. He had been corrupted by the Yuuzhan Vong, acting as the delivery agent of a Shaper-created virus that would infect the alazhi trees of Thyferra. Any bacta made from the infected plants would eventually kill those who used it. Through a Shaper's villip implanted in his skull, Gandan could receive orders from the Shapers Tsaa Qalu and Viith Yalu. Planning to eradicate the Yuuzhan Vong himself after delivering the virus, Gandan tricked Lochett and Gi into taking him to Thyferra aboard the No Luck Required. On Thyferra they figured out Gandan's treachery and after a lightsaber duel with Klin-Fa, Lochett threw Gi's lightsaber, which she had lost during the duel, cutting Gandan from shoulder to hip in the process.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/26_ABY",
  "/wiki/Thyferra/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Klin-Fa_Gi",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Uldir_Lochett",
  "/wiki/Jedi_training/Legends",
  "/wiki/Yabeley",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Wayland",
  "/wiki/Torture/Legends",
  "/wiki/Shaper_caste",
  "/wiki/Koros-Strohna",
  "/wiki/Qahsa",
  "/wiki/Jedi/Legends",
  "/wiki/Bonadan/Legends",
  "/wiki/Alazhi/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Villip",
  "/wiki/Tsaa_Qalu",
  "/wiki/Viith_Yalu",
  "/wiki/No_Luck_Required",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Emissary_of_the_Void",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}