{
 "name": "Beyla Rus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tibro"
     ]
    },
    {
     "name": "Born",
     "values": [
      "24 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.5 meters"
     ]
    }
   ]
  }
 ],
 "content": "Beyla Rus was a \"gentleman pirate\" who operated a CR90 corvette, along with approximately sixty other beings, who made up the vessel's crew. A Human male from Tibro, he and his ship were active during the Galactic Civil War.\nBeyla Rus was born on the planet Tibro in 24 BBY. A pirate, Rus and his crew terrorized the space lanes for several years. Styling himself as a \"gentleman pirate,\" his crew was never known to kill anyone and used stun weapons. Rus preferred his victims alive to spread tales of his exploits. During the Galactic Civil War, Rus was careful not to anger either the Alliance to Restore the Republic or Galactic Empire, preferring to target merchant vessels. However, with the rise of the New Republic, Rus took to raiding their cargo ships. How he obtained information on his targets was unknown, although Rus claimed to be able to small a trap a parsec away. Rus was charged with theft, piracy, and destruction of New Republic property. The New Republic posted a reward of 15,000 credits for his capture.\nBeyla Rus was a Human male who was 1.5 meters tall. Although a pirate, Rus styled himself as a \"gentleman pirate\" who never killed anyone. He was smug, overconfident, and carried himself with a roguish air. Rus' reputation was the most important thing to him, and he reasoned that it was the only thing a pirate had after the loot had been spent. He was an intimidating and persuasive individual, and a competent commander. Rus was known to be a gambler.\nBeyla Rus was skilled in the use of personal and vehicle-mounted blasters, and trained in both unarmed and melee combat. He was knowledgeable about languages and planetary systems, and had underworld contacts. Rus was capable of flying capital ships and navigating them through hyperspace, and effectively using their weaponry. He could also repair the ships and their armament. He was also adept at applying first aid.\nRus was armed with a blaster pistol and vibroblade, and carried a comlink. He commanded a CR90 corvette crewed by around sixty pirates.\nBeyla Rus was profiled in Wanted by Cracken, a sourcebook for Star Wars: The Roleplaying Game published by West End Games in 1993.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tibro",
  "/wiki/24_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Hyperlane",
  "/wiki/Standard_year/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Starship/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Parsec/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Gambler/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1993",
  "/wiki/Makin%27_It_Happen",
  "/wiki/Galaxy_Guide_10:_Bounty_Hunters",
  "/wiki/Star_Wars_Miniatures_Battles_Companion",
  "/wiki/Pirates_%26_Privateers"
 ]
}