{
 "name": "Bhasu Ruuq",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "29 ABY",
      "Yuuzhan'tar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yuuzhan Vong empire",
      "Warrior caste",
      "Warrior caste"
     ]
    },
    {
     "name": "Domain",
     "values": [
      "Domain Ruuq"
     ]
    }
   ]
  }
 ],
 "content": "Bhasu Ruuq was a male Yuuzhan Vong warrior at the time of the Yuuzhan Vong War. On the former New Republic capital world of Coruscant, renamed \"Yuuzhan'tar,\" Ruuq was assigned to watch over a shaper damutek, a laboratory where shapers—Yuuzhan Vong bioengineers—worked to improve the technology of the species. In 29 ABY, however, Ruuq was killed by one of the very shapers he was guarding, Nen Yim, when the scientist was willingly abducted by Jedi Knights, who spirited her offworld.\nOn Yuuzhan'tar, the planet once known as Coruscant, the warrior Bhasu Ruuq was tasked with guarding a shaper damutek in the shadow of the citadel of the ruler of the Yuuzhan Vong, Supreme Overlord Shimrra Jamaane. The damutek, a series of organic buildings making up a walled compound, was heavily guarded, as the shapers—Yuuzhan Vong scientists and bioengineers—who worked inside were carrying out work of the utmost secrecy, vital for the progress of the war, which was then being waged against the defenders of the galaxy that the Yuuzhan Vong had invaded three years previously. Bhasu Ruuq, by 29 ABY, had been performing his duties guarding the damutek and its occupants long enough to know, and to have developed an attraction for, Master Shaper Nen Yim, the leading scientist. That year, in the final months of the Yuuzhan Vong War, the damutek was attacked by a pair of Jedi Knights. Having infiltrated the compound with the help of rebellious Shamed Ones—members of the oppressed Yuuzhan Vong underclass—the two Jedi gained access to the laboratories.\nRuuq defended the damutek along with the other warriors stationed there, but he and seven of his fellows were soon forced back into one of the innermost chambers of the compounds by their attackers. Already present in the room, however, was Master Shaper Nen Yim. Concerned for the safety of his charge, Ruuq turned from the fight with the rapidly advancing Jedi to advise the shaper to flee. Yim did not flee, but instead apologized to Ruuq, before using a weapon concealed in her modified shaper hand to impale the warrior through the eye. Ruuq died instantly, and Yim went on to aid the two Jedi—Tahiri Veila and Corran Horn—in defeating the remaining five warriors. Unbeknownst to Ruuq, Yim had arranged for her own abduction, as she desired to escape Yuuzhan'tar in order to carry out investigations into the living planet Zonama Sekot. Ruuq's mortal wound was subsequently disguised as having been inflicted by a lightsaber blade, the end result being that the warrior appeared to have died at the hands of a Jedi, rather than a fellow Yuuzhan Vong.\nQuiet for a warrior, at least in the opinion of Nen Yim, and attracted to a member of another caste, even though liaisons between different castes were forbidden, Bhasu Ruuq was nevertheless capable, tasked with guarding one of the most significant locations in the Yuuzhan Vong empire. Before continuing his fight against the Jedi, Ruuq attempted to ensure the safety of Master Shaper Yim, but was unsuspecting of her true agenda.\nBhasu Ruuq's brief appearance in Greg Keyes' The New Jedi Order: The Final Prophecy ends with his death, an event that signifies Nen Yim's commitment to escaping her duties and essential captivity on Yuuzhan'tar, and dedicating herself to securing the future of her species. Ruuq later received an entry in The Complete Star Wars Encyclopedia in 2008.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/29_ABY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Yuuzhan_Vong_empire",
  "/wiki/Warrior_caste",
  "/wiki/Domain_Ruuq",
  "/wiki/Time/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/New_Republic/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Shaper_caste",
  "/wiki/Damutek",
  "/wiki/Bioengineering/Legends",
  "/wiki/Species/Legends",
  "/wiki/Death/Legends",
  "/wiki/Nen_Yim",
  "/wiki/Scientist/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Shimrra%27s_Citadel",
  "/wiki/Supreme_Overlord",
  "/wiki/Shimrra_Jamaane",
  "/wiki/The_galaxy/Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/Master_Shaper",
  "/wiki/Second_Mission_to_Coruscant_(Yuuzhan_Vong_War)",
  "/wiki/Jeedai_heresy",
  "/wiki/Shamed_Ones",
  "/wiki/Jedi/Legends",
  "/wiki/Finger-spear",
  "/wiki/Shaper_hand",
  "/wiki/Tahiri_Veila",
  "/wiki/Corran_Horn",
  "/wiki/Zonama_Sekot/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Greg_Keyes",
  "/wiki/The_New_Jedi_Order:_The_Final_Prophecy",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Recapture_of_Coruscant",
  "/wiki/Battle_of_Esfandia",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_III:_Reunion",
  "/wiki/The_Essential_Atlas",
  "/wiki/Battle_of_Coruscant_(Yuuzhan_Vong_War)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/28_ABY/Legends"
 ]
}