{
 "name": "Bib_Fortuna",
 "display_name": "Bib Fortuna",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fortuna family",
      "Hutt Clan",
      "Jabba Desilijic Tiure's criminal empire",
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Bib Fortuna was a male Twi'lek who lived on the desert planet Tatooine. He served as Jabba Desilijic Tiure's majordomo and chief of staff for decades, handling all of the day-to-day operations at Jabba's Palace. By 32 BBY, Fortuna had assumed the position as Jabb's majordomo, and it was he and the Hutt who oversaw that year's Boonta Eve Classic, in which a nine-year-old Anakin Skywalker won the podrace.\nBy the time of the formation of the Galactic Empire, Fortuna continued to serve Jabba as his right-hand-man. In 19 BBY, Fortuna contacted Cid and asked that she retrieve a rancor, Muchi, from Zygerrian slavers. With the help of Clone Force 99, Murchi was brought to Fortuna, who in turn brought the rancor to Jabba. Twenty-three years later, and Fortuna continued to serve Jabba. That year, Luke Skywalker and the Alliance to Restore the Republic went to Tatooine to rescue Han Solo. During a battle over the Great Pit of Carkoon, Jabba was killed by Princess Leia Organa and his sail barge, Khetanna, was destroyed.\nFollowing Jabba's death, Fortuna assumed control of his palace as a crime lord, becoming an obese in the process. In 9 ABY, Fortuna was killed bounty hunter Boba Fett, who took over his throne.\nA male Twi'lek, Bib Fortuna hailed from Ryloth, the homeworld of his species. Fortuna was born to a prominent clan that had close ties to the criminal underworld, though his more politically minded cousin Beezer resented his family's associations. Before coming into the service of Hutt crime lord Jabba Desilijic Tiure, Fortuna worked as a slave trader, one who was focused on members of his own species. He became rich from selling his fellow Twi'leks into slavery. At some point, Fortuna came into Jabba's service and competed against Bidlo Kwerve to become the Hutt's majordomo. Fortuna also gave Jabba his pet rancor Pateesa as a birthday present. Ultimately, Fortuna succeeded and claimed the job whereas Kwerve ended up as an early victim of the rancor.\nHe served as Jabba's majordomo as far back as the time of the Invasion of Naboo, in 32 BBY. That year, Fortuna attended the Boonta Eve Classic, which his master hosted to commemorate the Boonta Eve holiday. From his master's private balcony, he witnessed the victory of a local human boy named Anakin Skywalker against the reigning champion Sebulba. As the Hutt was not interested in podracing aside from the gambling aspect of the sport, Jabba fell asleep before the end of the race, forcing Fortuna to wake him up in order to announce the ending.\nAs the years of galactic history passed, Fortuna continued to serve Jabba as the Galactic Republic was reorganized into the Galactic Empire. In 19 BBY, during the early days of the Imperial Era, Fortuna came into contact with Cid, a Trandoshan who operated on the planet Ord Mantell, and hired her to retrieve the young rancor Muchi from a group of Zygerrian slavers. As time passed and Muchi was not yet rescued, however, Fortuna contacted her via hologram, informing her that Jabba was impatient and wanted to know why the rancor had not yet been returned. As she ate, Cid noted that the operation required a delay due to planning and asked him to assure Jabba that Muchi would soon be rescued. Although Fortuna attempted to threaten her, Cid remained unintimidated, claiming she had her best team working to save the rancor. Cid had actually hired Clone Force 99, a group of clone commando deserters she had only just met and who she was uncertain could actually succeed.\nWith Muchi still not returned to Jabba, Fortuna arrived personally at Cid's Parlor with two Gamorrean Warriors, entering into her office and demanding an update on behalf of Jabba. Cid again claimed Muchi would be rescued, trying to ease his concerns after he threatened consequences for failure by noting how delicate the operation was. Before Fortuna could respond to her request that Jabba be patient, Muchi was heard outside, as Clone Force 99 had succeeded in their mission. Quickly getting outside to reunite with Muchi, the majordomo was overjoyed to see his master's pet safe, greeting the young rancor before ordering a guard to give Cid her payment with a snap. With the rancor safe, Fortuna told her they would return home before leaving with his guards. Cid proceeded to give Clone Force 99 thirty percent of Fortuna's payment, as they had agreed upon.\nLater in the Imperial Era, Jabba welcomed two new smugglers into his employ, the Corellian human Han Solo and his Wookiee co-pilot Chewbacca. As the Hutt's majordomo, Fortuna often found himself dealing with the pair, handing them assignments from Jabba and delineating their pay. One such assignment between the years of 8 BBY and 2 BBY was no different, as Fortuna informed Solo that the Hutt lord was willing to pay one million credits for the delivery of a verillix urn that contained the ashes of Krestrel D'Naran, a rival of Jabba. To Solo's dismay, Fortuna also specified that the smugglers would be required to work with Greedo, a Rodian bounty hunter of Jabba's who had been the first to learn of the urn. Reluctantly, the trio agreed to the job and headed for Solo's homeworld of Corellia.\nWith some personal time to spare, Fortuna galivanted to the streets of Mos Espa to bet on nuna fights, where he promptly lost one thousand of his own credits. During his time off, Fortuna was questioned by an old acquaintance, Buck Vancto of the Benelex Marshal Service, who was pursuing a warrant put out on Solo for a recent heist on Galator III. Knowing that the Twi'lek owed him a favor, Vancto threatened to drag Fortuna back to Ryloth should he not disclose Solo's location. Although Fortuna took the marshal's warning seriously, he feared retribution from Jabba, and agreed to divulge the information so long as Vancto waited to apprehend Solo until after the smuggler had completed his mission.\nDuring the Galactic Civil War between the Empire and the Rebel Alliance, the Twi'lek remained in Jabba's service. A short time after the Battle of Yavin, which had cost the Empire its DS-1 Death Star Mobile Battle Station, the Empire elected to open negotiations with Jabba, but a Rebel strike team took advantage of the negotiations to destroy Weapons Factory Alpha. Following that loss, the Empire moved negotiations to take place at Jabba's Palace, but the Sith Lord Darth Vader arrived a day early to request bounty hunters for private business. After Vader arrived and killed two Gamorrean warriors, Fortuna ran to the Sith to speak with him, only to be met with a lightsaber and a demand to see Jabba. Rushing to his master, Fortuna awoke him and informed him of what had happened. Fortuna stood beside Jabba as he began to talk with Vader, who ordered him to remove the audience so they could talk in private. After Jabba had many of them return in a failed attempt to collect the bounty on Vader's head, the Sith Lord threatened him with a Force choke, and the Hutt crime lord acquiesced, having his two best bounty hunters—Boba Fett and Krrsantan—dispatched to fulfill Vader's missions.\nThe following day, Vader returned to oversee the Empire's official negotiations, accompanied by stormtroopers. Although Fortuna tried to greet Vader, the Sith Lord cut off his pleasantries, beginning the ultimately successful negotiations with Jabba. At some point between the Battle of Yavin and Battle of Hoth, Fortuna contacted the Tatooinian mercenary Saponza and his partner in the name of Jabba. The two men had reacted violently to the presence of Jabba's henchmen around Saponza's homestead, killing six of them. Fortuna let the two mercenaries know they had made an enemy of his Hutt master. Some time later, Jabba's henchmen razed Saponza's estate to the ground in retaliation, and the majordomo contacted Saponza once again to gloat over his misfortune and warn him that Jabba's revenge was not over.\nIn 3 ABY, Boba Fett captured Han Solo, who had since fallen out of Jabba's favor and earned a price on his head from the mighty Hutt. En route to the crime lord's Tatooinian palace with his bounty, Fett contacted Fortuna and assured the majordomo that Solo was alive, safely secured within frozen carbonite. To Fortuna's confusion, however, Fett abruptly ended their communication when the carbonite matrix containing Solo became unstable, forcing him to take a detour to Nar Shaddaa to fix the issue. There, Solo was stolen from Fett by agents of Crimson Dawn, a galactic crime syndicate that had long been considered obsolete. Fett declined to immediately inform Fortuna of his bad luck, instead simply telling the Twi'lek that his delivery would \"be a minute.\" Representing the interests of an increasingly impatient Jabba, Fortuna warned Fett not to disappoint the mighty Hutt lord.\nSoon after, Crimson Dawn sent invitations to many of the major crime lords in the galaxy, including Jabba. Revealing that they held Solo in their possession, they bid the invitees to travel to Jekara and witness the return of Crimson Dawn. Believing that Fett had cheated him and sold the smuggler to a competitor, Jabba placed a bounty on the hunter's head before departing for Jekara, leaving Fortuna to look over his palace. Unaware that the Hutt had left, Fett stormed through the castle's dusty gates, incinerating two Gamorrean guards and demanding that Fortuna give him answers. After explaining that his master was absent, Fortuna suggested that Fett leave, lest the retinue of thugs and mercenaries that made up Jabba's court turn their weapons on the hunter. Fett reminded the rabble, however, that many of their number would perish in a firefight against him, dying in the meager name of Bib Fortuna. With this in mind, no one fired a shot.\nAt the behest of Fett, Fortuna showed him Jabba's invitation, which depicted a human woman requesting that her audience \"await the Dawn.\" Accepting her as his new target, Fett ordered Fortuna to have his ship, Slave I, repaired of damage it had sustained on Nar Shaddaa before leaving for Jekara himself. Fett was eventually successful in his mission, managing to retrieve the frozen Han Solo and deliver him to Jabba intact.\nLater in the war, Fortuna greeted two droid visitors to his master's palace. The two mechanical units, called C-3PO and R2-D2, claimed that they had a gift for the Hutt. The majordomo demanded that they hand over that gift to him so he could bring it to Jabba himself, but the droids answered that their instructions were to give it only to the crime lord himself. Fortuna relented, and led the droids into the throne room, where they delivered a holographic message from their owner, the Rebel hero and fledgling Jedi Luke Skywalker. In the message, Skywalker asked to bargain for the life of his friend Han Solo, offering C-3PO and R2-D2 in exchange.\nFortuna was present when Princess Leia Organa arrived under the disguise of notorious bounty hunter Boushh. She brought along a chained Chewbacca and demanded a higher payment for the Wookiee's capture, under the threat of a thermal detonator. Later that night, Fortuna was hiding alongside Jabba as part of the Hutt's plan capture Organa when she attempted to free Solo herself. When Jabba decided to make Organa his slave, he sent Fortuna to fetch a more revealing outfit for her to wear.\nThe next morning Luke Skywalker arrived to rescue his friends. Fortuna tried to stop him from entering the audience chamber. However, he was influenced by Skywalker's mind trick, though he was not as weak-minded as some of Jabba's other guards. Skywalker only succeeded in his mind trick by finding and exploiting Fortuna's weak point, his strong loyalty to Jabba. Fortuna proceeded to wake Jabba, and presented the Jedi to his master. Angry that Fortuna had been manipulated by Skywalker, Jabba pushed him off his dais. As the negotiations became more tense, Jabba dropped Skywalker into the rancor pit.\nAfter Skywalker killed Jabba's Rancor, he was imprisoned and sentenced to death, with Jabba wanting him executed at the Great Pit of Carkoon. Fortuna accompanied Jabba and many of his palace denizens to the pit. Once there, the rebels managed to escape custody, kill Jabba, and destroy his personal sail barge. Though he was presumed to have died in the explosion, Fortuna survived the battle.\nBy around 9 ABY, Fortuna had gained control of Jabba's palace, having amassed servants and slaves of his own, and become an obese crime lord. After the second rescue of Grogu, Boba Fett and Fennec Shand arrived at the palace, killed Fortuna's guards and released a slave. Fortuna greeted Fett and said he believed the bounty hunter had died, and that he had heard many rumors regarding him. Fett immediately shot Fortuna, killing him and assuming Fortuna's throne in the palace.\nFollowing his death, Boba Fett visited the many vassals of Jabba the Hutt and Bib to continue the crime underworld on Tatooine. Unlike Bib Fortuna and Jabba, Boba intended to rule with respect, catching the eye of many. According to Fennec Shand, Fortuna was a terrible leader with no right to the throne.\nA pasty-faced male Twi'lek who served Jabba the Hutt for decades, Fortuna greeted all those who sought an audience with the Hutt, forcing those who wanted to meet with Jabba to maneuver past the majordomo. Even so, Fortuna at times understood his duties included denying visitors permission to see Jabba, whom he called his master. The majordomo held great patience thanks to his job, needing to deal with individuals ranging from haughty emissaries to drunken ruffians. Even so, the Trandoshan Cid felt that Fortuna could get too impatient and nervous when an operation was taking a long time. Additionally, his master's own volatile mood was another possible job hazard, especially because Jabba did not have the same respect Fortuna held towards him; Jabba believed Fortuna to be a fool. Indeed, the majordomo proved to be weak minded enough for Luke Skywalker to use a mind trick on him.\nWhen not leaving Jabba's side to greet visitors or travel off-planet, Fortuna often remained at the side of his master, whispering advice and information. When talking, Fortuna elected to only speak Huttese despite understanding other languages and sometimes using words from Galactic Basic Standard. Fortuna was also willing to threaten business partners in order to try to get better results. Able to represent Jabba on off-world missions, a visit from the greatest ally of the Hutt was considered an honor, although Cid mocked Fortuna during one such occasion. Nevertheless, Fortuna cared greatly about Jabba's interests, being overjoyed when the rancor Muchi was rescued. Fortuna also cared greatly for Muchi, calling the rancor his \"sweet girl.\" Following the minimal protocol rules that existed in Jabba's court and marking excessive concerns with propriety and modesty, Fortuna was mortified upon hearing Sy Snootles's saucy lyrics for the song Jedi Rocks. While he was a crime lord, Fortuna was obese and scared of Boba Fett, attempting to act friendly to the bounty hunter, only for his attempts to fail when Fett executed him.\nFortuna wore dark robes. After taking control of Jabba's palace, he sat upon a throne and wielded a staff.\nBib Fortuna was played by Michael Carter and voiced uncredited by the late Erik Bauersfeld, who also voiced Admiral Gial Ackbar, in Star Wars: Episode VI Return of the Jedi. For Star Wars: Episode I The Phantom Menace, Alan Ruscoe was initially cast to play the character in a scene in the Senate, however, this scene was cut, and he was later portrayed by Matthew Wood for his appearance on Tatooine.\nMatthew Wood later reprised his role in \"Chapter 16: The Rescue,\" the season two finale of The Mandalorian, in a post-credits scene, where he was subsequently killed. Jesse La Flair served as a stunt double in the episode. Matthew Wood later reprised his role again in \"Rampage,\" the fifth episode of the first season of Star Wars: The Bad Batch. The name 'Fortuna' means 'Fortune' in Latin, Spanish and other languages.\nIn earlier drafts of Return of the Jedi, Fortuna's title was the \"High Beeser of Hoth,\" and his original design sketches depicted him as a wizened old human man sporting a dark cloak and a tall hat. References to this title and design, however, were left out from the finished version of the film.\nThe makeup process that Michael Carter needed to perform to create the custom of Bib Fortuna took over eight hours to first transform Carter into the Twi'lek advisor. By the end of Carter's five-week shoot, make-up artist Nick Dudman had streamlined the process down to 58 minutes. Removing the make-up took another 25 minutes.The most intricate effect was Fortuna's \"air bladders\" or bubbles. These were made of foam and latex that were fitted in Carter's brows and temples and inflated by off-stage-operated hoses to make them appear to pulsate. Carter also used dayglow orange contacts and claw-like finger extentsions.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Bib_Fortuna",
  "/wiki/Bib_Fortuna/Legends",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/The_Hoojib_Menace",
  "/wiki/Star_Wars_(2020)_10",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_Jabba_the_Hutt_1",
  "/wiki/Bounty_Hunters_11",
  "/wiki/Bounty_Hunters_12",
  "/wiki/Star_Wars_(2020)_14",
  "/wiki/Bounty_Hunters_14",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Ryloth",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Fortuna_family",
  "/wiki/Hutt_Clan",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Majordomo",
  "/wiki/Standard_decade",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/32_BBY",
  "/wiki/Hutt",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Anakin_Skywalker",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/19_BBY",
  "/wiki/Cid",
  "/wiki/Rancor",
  "/wiki/Muchi",
  "/wiki/Zygerrian",
  "/wiki/Slaver",
  "/wiki/Clone_Force_99",
  "/wiki/Luke_Skywalker",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Han_Solo",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Death",
  "/wiki/Princess",
  "/wiki/Leia_Organa",
  "/wiki/Khetanna",
  "/wiki/Crime_lord",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Fett_gotra",
  "/wiki/Homeworld",
  "/wiki/Species",
  "/wiki/Beezer_Fortuna",
  "/wiki/Slavery",
  "/wiki/Bidlo_Kwerve",
  "/wiki/Pateesa",
  "/wiki/Birthday",
  "/wiki/Time",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Standard_year",
  "/wiki/Boonta_Eve",
  "/wiki/Human",
  "/wiki/Sebulba",
  "/wiki/Gambling",
  "/wiki/Timeline_of_galactic_history",
  "/wiki/Galactic_Republic",
  "/wiki/Standard_day",
  "/wiki/Imperial_Era",
  "/wiki/Trandoshan",
  "/wiki/Ord_Mantell",
  "/wiki/Rescue_of_Muchi",
  "/wiki/Hologram",
  "/wiki/Clone_commando",
  "/wiki/Cid%27s_Parlor",
  "/wiki/Gamorrean_Warrior",
  "/wiki/Smuggler",
  "/wiki/Corellian",
  "/wiki/Wookiee",
  "/wiki/Pilot",
  "/wiki/Chewbacca",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/2_BBY",
  "/wiki/Lord",
  "/wiki/Credit",
  "/wiki/Krestrel_D%27Naran",
  "/wiki/Greedo",
  "/wiki/Rodian",
  "/wiki/Heist_on_Corellia",
  "/wiki/Corellia",
  "/wiki/Mos_Espa",
  "/wiki/Nuna",
  "/wiki/Buck_Vancto",
  "/wiki/Benelex_Marshal_Service",
  "/wiki/Heist_on_Galator_III",
  "/wiki/Marshal",
  "/wiki/Galactic_Civil_War",
  "/wiki/Battle_of_Yavin",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Heroes_of_Yavin",
  "/wiki/Assault_on_Cymoon",
  "/wiki/Weapons_Factory_Alpha",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/Gamorrean",
  "/wiki/Sith",
  "/wiki/Darth_Vader%27s_lightsaber",
  "/wiki/Bounty",
  "/wiki/Force_choke",
  "/wiki/Krrsantan",
  "/wiki/Stormtrooper",
  "/wiki/Yavin",
  "/wiki/Battle_of_Hoth",
  "/wiki/Mercenary",
  "/wiki/Saponza",
  "/wiki/Saponza%27s_partner",
  "/wiki/Saponza%27s_homestead",
  "/wiki/3_ABY",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Carbon-freezing",
  "/wiki/Carbonite",
  "/wiki/Nar_Shaddaa",
  "/wiki/Crimson_Dawn",
  "/wiki/The_galaxy",
  "/wiki/Standard_minute",
  "/wiki/Jekara",
  "/wiki/Hunting",
  "/wiki/Qi%27ra",
  "/wiki/Slave_I",
  "/wiki/Droid",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/Jedi",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Boushh",
  "/wiki/Thermal_detonator",
  "/wiki/Dancing-girl_costume",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Mind_trick",
  "/wiki/Sail_barge",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Fennec_Shand",
  "/wiki/Attack_on_Jabba%27s_Palace_(Boba_Fett)",
  "/wiki/Unidentified_Twi%27lek_slave",
  "/wiki/Huttese",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Sy_Snootles",
  "/wiki/Jedi_Rocks",
  "/wiki/Clothing",
  "/wiki/Michael_Carter",
  "/wiki/Erik_Bauersfeld",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Alan_Ruscoe",
  "/wiki/Senate",
  "/wiki/Matthew_Wood",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/The_Mandalorian",
  "/wiki/Jesse_La_Flair",
  "/wiki/Rampage_(episode)",
  "/wiki/The_Bad_Batch_Season_1",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Hoth",
  "/wiki/Nick_Dudman",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Han_Solo_%26_Chewbacca_1",
  "/wiki/Han_Solo_%26_Chewbacca_2",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_4",
  "/wiki/5-Minute_Star_Wars_Villain_Stories",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_Adventures_Annual_2021",
  "/wiki/Bounty_Hunt",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Tatooine_Rhapsody",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/You_Owe_Me_a_Ride",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Added_Muscle",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/Star_Wars_(2015)_4",
  "/wiki/Star_Wars_(2015)_34",
  "/wiki/Doctor_Aphra_Annual_3",
  "/wiki/Age_of_Rebellion_-_Jabba_the_Hutt_1",
  "/wiki/Choose_Your_Destiny:_An_Escape_Mission",
  "/wiki/Star_Wars:_Commander",
  "/wiki/A_Rebel_Bounty",
  "/wiki/Star_Wars_Adventures_Annual_2020",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Boba_Fett_-_The_Bounty_Hunter",
  "/wiki/Star_Wars_(2020)_2",
  "/wiki/War_of_the_Bounty_Hunters_Alpha_1",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Tales_from_Wild_Space:_The_Blue_Brothers",
  "/wiki/Star_Wars_Adventures_(2017)_13",
  "/wiki/Star_Wars:_Tales_from_the_Rancor_Pit",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Rescue_from_Jabba%27s_Palace_(World_of_Reading)",
  "/wiki/Luke_vs._Jabba_-_Sail_Barge_Escape",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/The_Legends_of_Luke_Skywalker",
  "/wiki/The_Legends_of_Luke_Skywalker_(audiobook)",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/Tales_from_Wild_Space:_Majordomo,_Major_Problems",
  "/wiki/Star_Wars_Adventures_(2017)_23",
  "/wiki/The_Lost_Stories,_Part_3",
  "/wiki/Star_Wars_Adventures_(2017)_32",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Race_on_Tatooine",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Gambit_on_Geonosis",
  "/wiki/A_Vader_Family_Sithmas",
  "/wiki/LEGO_Star_Wars_Summer_Vacation",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_I_Am_a_Droid",
  "/wiki/Star_Wars:_I_Am_a_Jedi",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Princess_Leia:_Royal_Rebel",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Jedi_vs._Sith_(book)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Way_of_the_Force",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Star_Wars:_Outer_Rim",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Inside_Intel:_Twi%27lek_Culture",
  "/wiki/The_Fett_Family%27s_Finest",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Star_Wars",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/A_Certain_Point_of_View",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Assassination_attempt_on_Boba_Fett",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Order_66",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Stormtrooper_Corps",
  "/wiki/War-Mantle",
  "/wiki/0_BBY",
  "/wiki/Return_to_Kamino",
  "/wiki/Kamino_Lost",
  "/wiki/Disney%2B",
  "/wiki/Star_Wars:_Han_Solo_%26_Chewbacca",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/10_BBY",
  "/wiki/Databank_(original)"
 ]
}