{
 "name": "Bidvel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Xot"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pink"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray-blue",
      "with yellow markings"
     ]
    }
   ]
  }
 ],
 "content": "Bidvel was a male Xot who operated a scrap pile on a remote planetoid with the help of Davil.\nBetween 4 BBY and 2 BBY, Bidvel operated on a remote planetoid, taking in destroyed droids and scrapping them for parts. At some point, C1-10P, also known as Chopper, ended up stranded in the scrap pile after a fight just happened involving Hera Syndulla, Sabine Wren, and Garazeb Orrelios, who were on the hunt to find him. When Chopper woke up, Bidvel welcomed the droid to the last day of his life. Chopper tried to shock Bidvel, but was unable to do it as he was kicked to the ground by the Xot. Bidvel remarked at how he disassembled his shock pods before he awoke, and asked another fellow employee to take Chopper to the cataloging.\nRestrained on a table, Chopper tried to bargain Davil into getting him out of the situation by telling him how he and his friends steal Imperial ships, but Davil laughed at his sense of humor and continued cataloging. Davil, to his dismay, realized that Chopper might have been telling the truth, as he told Bidvel about how he has locations to Chopper Base as well as other useful stuff the Empire would appreciate. As Bidvel was giving Davil his gratitude, Chopper used his rocket to bash the two into the wall and escape, which Bidvel shouted at Davil to capture the droid. Davil then caught up with Chopper, and tried to grab the droid, but Chopper hit a side in the junkpile, causing it to collapse on top of Davil. Chopper then used the activation codes to awake all the other droids, but was stunned by Bidvel in revenge for hurting Davil.\nAfter Bidvel extracted all the information and recovered Davil, he asked his friend to start to incinerate Chopper in one of the scrap piles incinerators. But before Davil could incinerate the C1-series astromech droid, numerous junk droids started to awaken and tried to stop Bidvel and Davil. Bidvel was then held gunpoint by a B2-series battle droid, asking him to surrender, but Bidvel yelled at Davil to shoot every droid attacking him. Davil managed to shoot a droid, but was stunned by the B2-series battle droid. Bidvel then used the opportunity to activate the crane and send Chopper falling, but was saved when the doors shut after a Droideka closed the doors.\nBidvel was then succumbed by the droids, as Syndulla entered his scrap pile. Chopper told Syndulla how Bidvel had stolen some of the information he had stored in him, and was then taken away to have his memory wiped.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Xot",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Unidentified_planetoid_(scrap_pile)",
  "/wiki/Davil",
  "/wiki/4_BBY",
  "/wiki/2_BBY",
  "/wiki/Droids",
  "/wiki/C1-10P",
  "/wiki/Hera_Syndulla",
  "/wiki/Sabine_Wren",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Spectres",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Destroyer",
  "/wiki/Chopper_Base",
  "/wiki/C1-series_astromech_droid",
  "/wiki/Monster_droid",
  "/wiki/Unidentified_B2-series_super_battle_droid",
  "/wiki/Droideka",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/Escaping_the_Scrap_Pile",
  "/wiki/Star_Wars_Rebels_Magazine_19",
  "/wiki/Hair",
  "/wiki/The_Lost_Commanders",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Rex",
  "/wiki/Reproduction",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/32_BBY",
  "/wiki/Star_Wars_Rebels:_Steps_Into_Shadow",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Clone_Wars",
  "/wiki/19_BBY"
 ]
}