{
 "name": "Biel",
 "display_name": "Biel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Tarkin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "General Biel was a Human male Imperial officer stationed aboard the Tarkin superweapon around 3 ABY. He became involved in a conspiracy with several fellow officers to kill Darth Vader for his frequent executions of subordinates. However, the Tarkin was sabotaged and destroyed by a Rebel strike, killing the general and everyone else aboard the station.\nBiel, a Human male, held the rank of general in the Galactic Empire and was stationed aboard the Tarkin superweapon around 3 ABY. He was the highest ranking member of a group of disgruntled officers bent on killing Darth Vader due to the Sith Lord's viciousness in dealing with his subordinates. The general suggested that since Vader was focused on confronting the Rebel Luke Skywalker, the opportunity had arrived to assassinate Vader. Colonel Nord agreed and attempted to kill Vader by opening an airlock near the Dark Lord when he was pursuing Skywalker , but Darth Vader managed to survive. When Vader had engaged the Rebels in a space battle, Nord again attempted to kill him and the Rebels with the Tarkin's superlaser, but the firing mechanism had been sabotaged by the Rebel saboteurs, causing the station to self-destruct killing all aboard, including Biel.\nDisgusted by Vader's brutality towards his subordinates, the general became the member of a conspiracy to eliminate Darth Vader while he visited the Tarkin battle station. Biel appeared to be a middle-aged Human male with greying hair and wore a standard Imperial officer's uniform.\nBiel appeared in the fifty-second issue of the Marvel Star Wars comic series, To Take The Tarkin.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Tarkin_(superweapon)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/General/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Death/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Nord_(Imperial)",
  "/wiki/Superlaser/Legends",
  "/wiki/Battle_station",
  "/wiki/Imperial_officer%27s_uniform/Legends",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Star_Wars_(1977)_52"
 ]
}