{
 "name": "Biggs Darklighter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Born",
     "values": [
      "By 19 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Yavin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Prefsbelt Fleet Camp",
      "Prefsbelt Fleet Camp",
      "Alliance to Restore the Republic",
      "Red Squadron",
      "Red Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Biggs Darklighter was a human male ace pilot who fought for the Alliance to Restore the Republic during the early days of the Galactic Civil War. He grew up on the desert world of Tatooine, where he became a close boyhood friend of Luke Skywalker. The two became pilots and dreamed of leaving Tatooine. Darklighter left his homeworld for the Imperial Academy, but defected from the Galactic Empire after graduation in order to join the Rebel Alliance. He returned to Tatooine one final time to tell Skywalker of his plans.\nWith his home planet behind him, Darklighter relocated to the Rebel base on Yavin 4. He reunited with Skywalker, who had helped rescue Princess Leia Organa, a leader in the Alliance, from the Death Star with stolen plans for the planet-destroying space station. The Rebellion analyzed the plans and organized the Battle of Yavin, where Darklighter and Skywalker flew as members of Red Squadron in the assault on the station. Skywalker successfully destroyed the Death Star, but not before Darklighter was killed in combat by Darth Vader.\nBiggs Darklighter grew up on the desert world of Tatooine, raised by his mother. He eventually became close friends with Luke Skywalker. The two became pilots, and often flew through Beggar's Canyon. Darklighter's family was wealthy for Tatooine standards, owning twenty moisture farms. Growing up, he had the best of everything, including clothing and a new skyhopper with each new model released, but despite this never made Skywalker feel less for it. In the year after the Great Drought, Biggs and fellow youngsters watched Skywalker fly his T-16 skyhopper through the desert canyons after test flights in Jag Crag Gorge. Keeping in contact with his friend via comlink, Biggs warned Skywalker not to get too cocky after he made it through Mushroom Mesa, warning him of the dangerous Beggar's Canyon ahead. Although Biggs cautioned Luke to slow down through the tight canyon, Skywalker ignored his advice and ultimately crashed the skyhopper after clipping the edge of the canyon, requiring new tools and repair parts to fix the damage.\nWhen they were young, Darklighter and Skywalker both dreamed of leaving their homeworld behind and attending the Imperial Academy. Darklighter eventually left Tatooine for the Academy, but Skywalker was left behind, as his uncle, Owen Lars, would not allow him to leave out of fear that he would follow in the footsteps of his father: the Jedi Knight-turned-Sith Lord Anakin Skywalker. Darklighter would enroll in the Prefsbelt Fleet Camp, where he befriended Derek Klivian. After attending the Academy, Darklighter and Klivian received their commissions aboard the Rand Ecliptic, with Darklighter assigned as first mate of the vessel. Klivian, who was secretly undercover as an agent of the Alliance to Restore the Republic, incited a mutiny, assisting Darklighter's defection to the Rebellion.\nAfter graduating from the Imperial Academy, Darklighter returned to Tatooine to visit Skywalker and his friends in Tosche Station. When Skywalker arrived at Tosche Station, he claimed to have witnessed a battle in the skies over Tatooine. Darklighter and the others were skeptical, however, and the now-Imperial pilot believed that it was simply two ships sitting in orbit. In actuality, Skywalker had witnessed a battle between the Galactic Empire and the Rebel Alliance. Although Darklighter wasn't involved in the battle, his return did deal with the Rebel Alliance: he told Skywalker that he would be defecting from the Empire and becoming a pilot for the Rebel Alliance. As the two said their goodbyes, Darklighter told his old friend that he would keep an eye out for him, in the event Skywalker ever joined the Rebellion.\nDarklighter joined the Rebel Alliance shortly after leaving Tatooine, and was assigned to the Rebel base on Yavin 4. During his time on Yavin 4, Darklighter and Jek Tono Porkins took a vacation to the planet Irff, a planet where littering was encouraged. After staying on the planet for twelve days, a worker told them both that their resting area was reserved. The worker then kicked them out after they refused to move. The spot was reserved for a female Imperial officer. Later Darklighter and Porkins pretended to point blasters under towels at the officer to scare her away. She then told them that she was just a single parent of six children who wanted to take a break and a vacation from them. Her children were named Brit, Blip, Flip, Jeef, Gerf, Bilf, and Arnold. Porkins then apologized to her and he and Darklighter left. When outside her vacation house, she called security on them. While running from security, Darklighter and Porkins tried to escape on a green creature, but the creature tried to eat Darklighter and both of them then escaped. Later, security caught Darklighter and Porkins and told them to leave or the manager would be called.\nIn the meantime, Princess Leia Organa of Alderaan, a leader in the Rebel Alliance, successfully brought stolen plans for the Death Star to the Rebel base; this was done with the help of Skywalker, Han Solo, and the Wookiee Chewbacca, who aided in Organa's escape after she had been held prisoner by the Empire on the Death Star. Using the plans, the Rebel Alliance put together an attack plan to destroy the planet-destroying space station, which arrived near Yavin 4 with the intention of destroying it—as well as the Rebel Alliance. Darklighter was assigned to be a fighter pilot in the assault. Skywalker had also become a pilot in the Rebellion. During General Jan Dodonna's briefing, Biggs heard his friend's voice before brushing apart with fellow pilot Jek Tono Porkins, who playfully teased him.\nIn the lead-up to the battle, Darklighter encountered Skywalker in the Rebel hangar. The two reminisced about their time flying on Tatooine, and Darklighter vouched for Skywalker as the best bush pilot in the Outer Rim Territories when Garven Dreis, the leader of Red Squadron, questioned whether the rookie pilot would be able to handle an X-wing starfighter. Before climbing on their respective starfighters, Biggs promised Skywalker to exchange stories with him, leading Luke to tell him that he told him that he would make it some day. As he boarded his X-wing, Wedge Antilles asked Darklighter who the kid was, to which Darklighter responded that the kid was a friend from who said he would join the Rebellion.\nThe Battle of Yavin started afterwards. As the pilots approached the Death Star, Darklighter found himself grappling with fear. When Garven asked the pilots to report in, Biggs replied that \"Red Three\" was his callsign. Under \"Red Leader\"'s command, Biggs and his fellow pilots locked their S-foils into attack position and switched their deflectors on double front. Descending on the battle station, Biggs and his fellow pilots dodged turbolaser bolts fired by the Death Star's heavy turbolaser emplacements, which were too slow for the nimble rebel fighters. As Biggs asked Porkins to cover his starfighter from behind, Porkin was unfortunately shot down. Managing to move his X-wing out of harm's way in the nick of time thanks to Skywalker, allowing his friend to shot down one of the TIE/ln space superiority starfighters behind him, Biggs strafed the turbolaser towers that were peppering the Y-wing Gold Squadron, which were flying through the Meridian trench to take out the thermal exhaust port.\nAs the battle neared its end, Garven was shot down, with Biggs along Skywalker and Antilles remaining. As he and Antilles resolved to buy Skywalker enough time to reach the thermal exhaust port and drop his payload of proton torpedoes, Darklighter imagined like if they were racing through Beggar's Canyon shooting womp rats. With Wedge forced to pull out due his X-wing facing mechanical problems, Biggs concluded that he and Skywalker were the only ones who remained. Cornered by Darth Vader's TIE Advanced x1 and two remaining TIE fighters, Biggs resolved to sacrifice his life to ensure Luke's survival, diverting power to the X-wing's engines. Immediately, Darklighter's X-wing was hit by enemy fire from Vader, killing him in the process. As the ship exploded, Darklighter heard the call of his mother for dinner and felt Tatooine's wind sweeping across the desert as he died; overcoming his fear and making peace with life.\nShortly after Darklighter's death, Skywalker destroyed the Death Star. After the Battle of Yavin, Skywalker continued to think of his late friend and his sacrifice. Skywalker consoled himself knowing that Darklighter was a strong believer in the cause that he died for, and hoped that each new mission would destroy the Empire and honor Darklighter's sacrifice.\nIn 34 ABY, during his self-imposed exile on Ahch-To, the Jedi Master Luke Skywalker had a dream about an alternate life where he ignored Organa's message and never joined the rebellion, remaining in the moisture farming business with his uncle and marrying Camie Marstrap. In his dream, Darklighter was killed somewhere unimaginably far away, but Skywalker never got to know the details of his demise whilst his family was taken away by stormtroopers, leaving their farm to be stripped by Jawas and Tusken Raiders.\nBiggs Darklighter was a human male with hazel eyes, black hair, and light skin. As a member of the Rebel Alliance, Darklighter was a believer in its cause against the Empire. Skywalker felt that Darklighter would have thought that joining the Alliance was worth the risk and worth dying for, even if Darklighter had known he would perish in the Battle of Yavin. He also felt concern for Skywalker, whose story he would listen to with amusement and patience, and defended him when Garven Dreis questioned whether Skywalker was ready to fly with Red Squadron.\nDarklighter was a skilled pilot, and loved to fly alongside Skywalker. He gained piloting experience on Tatooine, including flying through the narrow Beggar's Canyon, and eventually used that experience to join the Imperial Academy and the Rebel Alliance.\nBiggs Darklighter was played by Garrick Hagon in the 1977 film of Star Wars: Episode IV A New Hope, then-titled simply Star Wars. The character first appeared in the various script drafts of Star Wars as King Kayos's son and the brother of the princess who became Leia Organa. He was Luke Skywalker's younger brother and the brother of Windy Marstrap in the second draft, before finally being changed to Skywalker's friend in the third draft. Although Darklighter only appears briefly in the final film, where he is listed as \"Red Three\" in the film's closing credits, the movie originally included several scenes in which he figured much more prominently in the story. These included deleted scenes set in Tosche Station on Tatooine. The scene with him in the hangar before the battle of Yavin was later added back in as part of the special editions.\nIn the early development of the Star Wars Rebels episode \"The Antilles Extraction,\" then known as \"Darklighter,\" the story was originally intended to deal with the defection of Biggs from Imperial service into the rebel ranks. However, due to timeline complications with Biggs' already established backstory seen in A New Hope, it was decided to replace Biggs with Wedge Antilles.\nBiggs's helmet design is similar to that of Derek Klivian's in Rogue One: A Star Wars Story.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Biggs_Darklighter",
  "/wiki/Biggs_Darklighter/Legends",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Tatooine",
  "/wiki/19_BBY",
  "/wiki/0_BBY",
  "/wiki/Yavin_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Prefsbelt_Fleet_Camp",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Ace",
  "/wiki/Pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Luke_Skywalker",
  "/wiki/Imperial_Academy",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Death_Star_plans",
  "/wiki/Battle_of_Yavin",
  "/wiki/Anakin_Skywalker",
  "/wiki/Biggs_Darklighter%27s_mother",
  "/wiki/Beggar%27s_Canyon",
  "/wiki/Moisture_farm",
  "/wiki/Clothing",
  "/wiki/Skyhopper",
  "/wiki/Standard_year",
  "/wiki/Great_Drought",
  "/wiki/T-16_skyhopper",
  "/wiki/Jag_Crag_Gorge",
  "/wiki/Comlink",
  "/wiki/Mushroom_Mesa",
  "/wiki/Owen_Lars",
  "/wiki/Jedi_Knight",
  "/wiki/Sith_Lord",
  "/wiki/Derek_Klivian",
  "/wiki/Rand_Ecliptic",
  "/wiki/First_Mate",
  "/wiki/Starship",
  "/wiki/Agent",
  "/wiki/Mutiny_on_the_Rand_Ecliptic",
  "/wiki/Tosche_Station",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Jek_Tono_Porkins",
  "/wiki/Irff",
  "/wiki/Unidentified_female_Imperial_officer_(Irff)",
  "/wiki/Brit",
  "/wiki/Blip",
  "/wiki/Flip_(Irff)",
  "/wiki/Jeef",
  "/wiki/Gerf",
  "/wiki/Bilf",
  "/wiki/Arnold",
  "/wiki/Alderaan",
  "/wiki/Battle_of_Scarif",
  "/wiki/Han_Solo",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Rescue_of_Princess_Leia",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Garven_Dreis",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Wedge_Antilles",
  "/wiki/Red_Three",
  "/wiki/Callsign",
  "/wiki/Red_Leader",
  "/wiki/Battle_station",
  "/wiki/Turbolaser",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Meridian_trench",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Proton_torpedo",
  "/wiki/Womp_rat",
  "/wiki/Darth",
  "/wiki/TIE_Advanced_x1",
  "/wiki/34_ABY",
  "/wiki/Exile_(punishment)",
  "/wiki/Ahch-To",
  "/wiki/Jedi_Master",
  "/wiki/Dream",
  "/wiki/Marriage",
  "/wiki/Camie_Marstrap",
  "/wiki/Stormtrooper",
  "/wiki/Jawa",
  "/wiki/Tusken_Raider",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Garrick_Hagon",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/King",
  "/wiki/Kayos",
  "/wiki/Windy_Starkiller",
  "/wiki/Star_Wars_Rebels",
  "/wiki/The_Antilles_Extraction",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Category:Images_of_Biggs_Darklighter",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Star_Wars_(2015)_15",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Darth_Vader_vs._the_Rebel_Fleet_-_Fearsome_Fighter_Pilot",
  "/wiki/Stolen_Valor",
  "/wiki/Age_of_Rebellion_Special_1",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Star_Wars_Battlefront",
  "/wiki/Duty_Roster",
  "/wiki/Desert_Son",
  "/wiki/Grounded",
  "/wiki/Heir_to_the_Jedi",
  "/wiki/Heir_to_the_Jedi_(audiobook)",
  "/wiki/Star_Wars_(2015)_5",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/The_Legends_of_Luke_Skywalker",
  "/wiki/The_Legends_of_Luke_Skywalker_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Mission_to_Mos_Eisley_(episode)",
  "/wiki/Disney_Magic_Kingdoms",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_21",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_X-Wing_Deluxe_Book_and_Model_Set",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_13",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_5",
  "/wiki/Building_the_Galaxy",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Rebel_Alliance_Conversion_Kit",
  "/wiki/T-65_X-Wing_Expansion_Pack",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_1",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_2",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Practical",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Star_Wars_Insider",
  "/wiki/200_Reasons_Why_We_Love_Star_Wars",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Databank_(website)",
  "/wiki/Reproduction",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/Star_Wars:_The_Complete_Saga",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide"
 ]
}