{
 "name": "Bilk",
 "display_name": "Bilk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "32 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gamorrean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Zippa"
     ]
    }
   ]
  }
 ],
 "content": "Bilk was a beady-eyed male Gamorrean bodyguard employed by the Toydarian merchant Zippa in the years prior to the rise of Palpatine. According to Lorn Pavan, he stank like 'a silage bin at high noon'.\nSometime during or prior to 32 BBY, Bilk was employed as a bodyguard to the Toydarian merchant, Zippa.\nBilk was present during a meeting in 32 BBY between Zippa, information broker Lorn Pavan and Pavan's business partner, protocol droid I-5YQ, in booth nine, a holobooth located in the underbelly of Coruscant, in which the Toydarian tried to sell Pavan a Sith holocron. Hidden in the shadows at first, Bilk stepped forward after he was introduced by his employer.\nAfter slowly realizing that an insult had been aimed towards him by I-5, Bilk narrowed his beady-eyes and rumbled his throat, leaning truculently towards the protocol droid, however, before he had time to do anything, Zippa had drifted in between the two and calmed his bodyguard down. Loyal to Zippa, Bilk reacted angrily and attempted to lunge at Pavan when he had grabbed the Toydarian by his fleeskin vest. However, he stopped cold as I-5 directed a laser beam at him, which scorched his scalp between his horns.\nAfter being threatened by Pavan, Zippa double-crossed him and I-5 when he eventually sold the holocron to them. Bilk had his blaster raised to both when Zippa took back the holocron and then proceeded to leave, ordering Bilk to deal with the two. Before Bilk could complete his task, however, I-5 used it's vocabulator to emit a high-pitched scream which was painful for the Gamorrean's ears, and while attempting to clap both of his hands over his ears, he dropped his blaster. Catching the blaster, I-5 stopped screaming and aimed it at Bilk. The Gamorrean either didn't notice this or was too enraged to care and whilst snarling, lunged at the droid and it's business partner. I-5 fired the blaster, which shot through Bilk's armored chest plate, through several internal organs, and exited between his shoulder blades, which resulted in him dropping to the floor, dead.\nLike most Gamorreans, Bilk wasn't particularly bright and was slow to react to many situations, such as when he was insulted by I-5YQ. He was, however, particularly loyal to Zippa, lunging towards Lorn Pavan when he attempted to threaten him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Zippa",
  "/wiki/Lorn_Pavan",
  "/wiki/Toydarian/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/I-5YQ",
  "/wiki/Booth_nine",
  "/wiki/Holobooth/Legends",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Darth_Maul:_Shadow_Hunter",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}