{
 "name": "Binna Jode",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cheapside Cantina"
     ]
    }
   ]
  }
 ],
 "content": "Binna Jode was a Human female small-time criminal, bartender and the owner of the Cheapside Cantina, a venue in the Imperial-controlled capital of Bestine on the Outer Rim world of Tatooine during the time of the Galactic Civil War. She was the wife of a cargo freighter pilot who went missing during a run in with pirates along the Corellian Run. Left to manage the cantina alone, but never giving up hope that her husband might one day return, Binna Jode took the time to help out Bestine locals and friends with a number of difficult situations. However, she eventually left Bestine after receiving news that her husband had been detected alive in Wild Space, and was on his way home to reunite with her.\nA Human female by the name of Binna Jode was a small-time criminal and bartender who lived during the time of the Galactic Civil War. She was married to a cargo freighter pilot, but her husband went missing when he was forced to make a wild jump into hyperspace after running into pirates on the Corellian Run. Years later, sometime following the Battle of Yavin in 0 BBY, Jode continued to remain as the owner of the Cheapside Cantina located in the Imperial capital of Bestine on the Outer Rim world of Tatooine. During her time at this city's local cantina, Jode held out hope that her husband might one day return.\nWhile she eagerly awaited for a miracle, Jode found herself befriending locals, and becoming involved in a number of their affairs. At one point, Jode learned of an Imperial stormtrooper attack on a nearby Rebel base. However, during the attack, the Imperial's blaster fire went astray, almost killing an innocent civilian family. Feeling for their plight, Jode sent the the traumatized family to stay with a friend of hers.\nBinna Jode did not feel there was much else she could do, but when a spacer stopped by the Cheapside Cantina to speak with her, she asked the individual to help deliver a toy for the family's children. The spacer agreed to deliver the toy, which was contained inside an empty metal fuel drum, crudely decorated with colorful drawings. However, the spacer was unable to meet with the family personally, because they had been called away to tend to a child who had been put into a bacta tank. Nevertheless, a Human woman named Deehan met with the spacer outside of Bestine, and promised to give the toy to the children. For the spacer's part in helping the family's children, Binna Jode prepared for the individual a delicious, special casserole. The casserole resembled a worrt casserole, prepared from the meat of the planet's native species of worrt, however Jode did not specify the contents of her meal.\nMeanwhile, a local veteran of the Clone Wars named Gen Horosi ended up getting injured when a crazed glitterstim spice addict took a random pot-shot at him. Friends of Herosi helped the old war veteran home, but he was still in need of medical attention. When Jode learned of the incident, she gathered what credits she could and purchased a stimpak. Fortunately for Jode, the spacer who had helped her earlier continued to patronize the cantina, and agreed to personally deliver the medical device to Herosi, who could sometimes be found wandering aimlessly outside of town. Jode was grateful for the spacer's help, but reminded the individual not to mention Emperor Palpatine, as merely saying his name was known to agitate Herosi. With this in mind, the spacer encountered the injured war veteran walking around the desert outside of Bestine. When Herosi saw the spacer approaching him, he was at first troubled, as he nearly mistook the spacer as a Confederate battle droid. However, when he realized he was actually being given a stimpak for his injuries, he settled down somewhat, and willingly took the device. Again, for the spacer's help, Jode offered the spacer a meal, this time in the form of a soup. The soup was in fact a special gift from Bren Kingal, a junior officer of the Rebel Alliance who handled security matters in Mos Taike, a small town on Tatooine. The soup was prepared from the secret recipe of Bren Kingal's sister.\nA friend of Binna Jode, named Peele Noonal, in the meantime gave birth to her first child. Following the birth, a nurse wrapped the baby in Noonal's shirt. When Jode learned of this, she was somewhat dismayed, as she knew that Noonal's shirt would be ruined by the baby. To help out her friend, Jode took off her black sidebutton shirt, and asked the spacer who had helped her earlier to deliver it to the young mother. Although the spacer was somewhat perturbed by the fact that the shirt was still warm, the maternity gift nevertheless made its way to Noonal, who was found wandering outside of Bestine before an impending sandstorm. For the spacer's part in helping out her friend, Jode offered a glass of alcohol on the house.\nBinna Jode continued to hold out hope that her long lost husband might one day return. Although Jode was not eager to stay in Bestine as the proprietor of the Cheapside Cantina, she feared that her husband might never find her if she were to leave. Her wait would soon come to an end, when Jode one day received a datadisc from a friend on Corellia which supposedly contained information on her husband. However, the data on the report, which was sent by a friend who had attempted to look for her husband, ended up getting corrupted. In order to salvage the data, Jode asked the helpful spacer to deliver the datadisc to a data slicer friend of hers known as Dinnis the Blade.\nThe spacer obliged, and carried the valuable datadisc outside of town to meet with the eccentric data slicer. After handing over the datadisc, Dinnis the Blade provided a quick analysis, and concluded that Binna Jode's husband may have actually survived. He told the spacer that he was receiving some kind of distant signal from Wild Space, and that although the husband had a bad engine and was low on fuel, he was flying on his way home. After receiving Dinnis' analysis, the spacer headed back to the Cheapside Cantina to deliver the good news.\nWhen the spacer finally returned to the confines of the Cheapside Cantina to provide news of Binna Jode's husband, Jode was was shaken, and said she needed to sit down. She briefly thanked the spacer, but asked that she be left alone to collect her thoughts. Per tradition however, Jode did provide the spacer a final gift in the form of a dustcrepe. The meal was a type of light crepe commonly served on Tatooine, comprising of a dry type of bread, wheat, and a filling of herbivore meat. Although Binna Jode asked to be left alone, she did say the spacer came in handy, and that she might have more work in the future. However, this was not to be. Sometime after receiving news of her husband, Binna Jode left the Cheapside Cantina, and could no longer be found there.\nBinna Jode had fair skin, auburn hair, and brown-colored eyes. Although she did not appear particularly aged, she on at least one occasion referred to herself as an \"old lady.\" Jode was a kind and helpful individual, who was often willing to look after her friends. Her friend, Peele Noonal, referred to Jode as the \"nicest lady in the galaxy\" for providing her with her own sidebutton shirt. Jode was also quite charitable, in that she had scrounged together her own credits to help purchase a stimpak for the Clone Wars veteran Gen Herosi. Jode especially cared for her husband, and never gave up hope that he might one day return to the Cheapside Cantina to find her, even years after he went missing. In addition to her talents as a bartender, Binna Jode was also a skilled cook, known to make delicious meals such as casseroles. She was also able to defend herself in combat, as she had at least some skill as a carbineer and pikeman.\nAlthough Binna Jode was not very outspoken about her political beliefs, she did appear to have at least some disdain for the Galactic Empire. When Imperial stormtroopers injured an innocent civilian family, she derided the fact that they could not aim. She also had ties to some individuals who had no love for the Emperor, including Rebel junior officer Bren Kingal, and the Clone Wars veteran Herosi. Jode spoke fondly of Gen Herosi, claiming he had \"been through more than any squadron of stormtroopers.\"\nDuring her time as bartender at the Cheapside Cantina in Bestine, Binna Jode usually wore a blue colored, formfitting muscle shirt with beige stripes, and a blue pleated skirt with beige trim on the bottom. She also wore white colored women's shoes. At one point, Jode did wear a black sidebutton shirt, which she took off to give as a gift to her friend, Peele Noonal, so that she could have proper clothing after giving birth. As a carbineer, Binna Jode kept a blaster carbine as her primary weapon. She also possessed pirate weapons.\nBinna Jode was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Players who performed a series of quests for Jode in Bestine had to deliver an empty fuel drum to Deehan, a stimpak to Gen Herosi, Binna's shirt to Peele Noonal, and a datadisc to Dinnis the Blade. For completing each mission, players would receive a gift from Jode in the form of some kind of food item. The first reward was a special casserole, the second reward was a special gift soup, and the final reward was a dustcrepe.\nThere is some ambiguity regarding the third quest reward. Most player guide documentations report that the reward was a Veronian berry wine, while the game files indicate that the actual reward may have been Corellian ale. At least one player also reported Corellian ale as being a reward given by Binna Jode. It is possible the game developers changed the quest reward during the course of the game's lifespan. Due to the ambiguity surrounding the third quest reward, this article refrains from noting the specific type of beverage Jode gifted to the player. Although the player could choose not to do Jode's quests, this article assumes 100% game completion. On February 11, 2004, with the release of the \"Bestine Redesign\" update included as part of Publish 6 The Imperial Crackdown, Binna Jode was removed from the game. She was later included as an entry in The Complete Star Wars Encyclopedia, published on December 9, 2008.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cheapside_Cantina",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Bartender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Cargo_freighter",
  "/wiki/Pilot/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Corellian_Run/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/City/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Death/Legends",
  "/wiki/Canon",
  "/wiki/Spacer/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Fuel/Legends",
  "/wiki/Painting/Legends",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Deehan",
  "/wiki/Foodstuff/Legends",
  "/wiki/Worrt_casserole",
  "/wiki/Species/Legends",
  "/wiki/Worrt/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Gen_Horosi",
  "/wiki/Glitterstim/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Medic/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Stimpak",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Bren_Kingal",
  "/wiki/Officer/Legends",
  "/wiki/Mos_Taike",
  "/wiki/Peele_Noonal",
  "/wiki/Birthday/Legends",
  "/wiki/Nurse/Legends",
  "/wiki/Shirt",
  "/wiki/Sandstorm/Legends",
  "/wiki/Glass/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Dinnis",
  "/wiki/Engine/Legends",
  "/wiki/Dustcrepe",
  "/wiki/Bread/Legends",
  "/wiki/Wheat/Legends",
  "/wiki/Diet/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Chef/Legends",
  "/wiki/Blaster_carbine/Legends",
  "/wiki/Pike/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Veronian_berry_wine",
  "/wiki/Corellian_ale/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Ale/Legends",
  "/wiki/February_11",
  "/wiki/2004",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/December_9",
  "/wiki/2008",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided_Quick_Reference_Guide",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/June_1",
  "/wiki/January_4",
  "/wiki/2005",
  "/wiki/January_19",
  "/wiki/January_20",
  "/wiki/March_12"
 ]
}