{
 "name": "Bipopa Bogzider",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ando"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aquala Aqualish"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "One eye",
      "one hand",
      "and one leg"
     ]
    }
   ]
  }
 ],
 "content": "Bipopa Bogzider, better known as Bippi to his crewmates, was a male Aqualish and the captain of the Nanda's Luck.\nAn Aquala from Ando, Bogzider had a painful artificial eye, a prosthetic leg, and an archaic mechanical hand. He earned all of these from his experience on his home planet Ando.\nSome time during the Galactic Civil War, Bogzider encountered Pyash Yopayomba, the Pirate queen of Ando. She easily damaged his vessel with her flagship, the Majestic. But one of Bogzider's crewmates, the former Mon Calamari slave Sissalik, showed courage and tried to save Bogzider and Nanda's Luck . Yopayomba then confronted both Bogzider and Sissalik, admitting that she admired his bravery and defiance. Yopayomba then said that she'd fix up Nanda's Luck and replace the crewmen who died in battle in return for something. Bogzider surrendered to Yopayomba, snarling with fury. But, a furious Yopayomba beheaded Bogzider with her vibroblade. After which she growled, \"None of my people surrender, no matter the situation.\" After that, she appointed Sissalik captain of Nanda's Luck under her command.\nSome time after Bogzider's death, Sissalik committed suicide by crashing Nanda's Luck into Majestic. The result of this action was the death of Nanda's Luck's crew, the death of many innocent passengers, and most importantly, Yopayomba's death. But the action also avenged Bogzider.\nAlthough he was gruff, Bogzider awarded loyalty and service among his crew.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ando/Legends",
  "/wiki/Aquala/Legends",
  "/wiki/Aqualish/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Nanda%27s_Luck",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Pyash_Yopayomba",
  "/wiki/Pirate_queen_of_Ando",
  "/wiki/Flagship/Legends",
  "/wiki/Majestic_(pirate_ship)",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Sissalik",
  "/wiki/Vibroblade/Legends",
  "/wiki/Death/Legends",
  "/wiki/Wizards.com",
  "/wiki/Ando:_Planet_of_the_Walrus_Men"
 ]
}