{
 "name": "Biron",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Biron, callsign name \"Snow Raptor\" was a Human male captain of the Sith Empire during the Galactic War.\nIn 3642 BBY he was stationed Hoth as part of an Imperial campaign to trap Republic in a quagmire and deprive them of resources. However, Biron and his men found a greater threat in the besieged by pirates of the Hailstorm Brotherhood. Lacking man force to assault them directly, Biron was forced to seek temporary alliance with the enemy, meeting with lieutenant Kieral of Outpost Senth. Putting their issues aside, the officers focused on surviving at all costs, which meant taking out the Brotherhood. They began by setting up an ambush and asking a Republic citizen to serve as bait, firing a signal flare and attacking the Brotherhood so that Imperials could round them in. Once the scout known as Hatchling confirmed that the pirates were retreating to their fortress, the men planned a strike at the heart of the Brotherhood - an assault on the Chilling Death Spire. The main target was Brotherhood's spiritual leader Sav, known to survive several extreme situations in Hoth's cold weather. The assault force consisted of three teams: Sergeant Katcho's men from Republic side, Sergeant Ennlicher's squad from Imperial side and a gifted Republic citizen leading the assault. After Sav was cornered and killed, Kieral congratulated Biron on the joint operation and gave him and his men 24 hours to safely return to their own outpost.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mal_Biron",
  "/wiki/Shistavanen/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Captain/Legends",
  "/wiki/Galactic_War",
  "/wiki/3642_BBY",
  "/wiki/Hoth/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Hailstorm_Brotherhood",
  "/wiki/Lieutenant/Legends",
  "/wiki/Kieral",
  "/wiki/Outpost_Senth",
  "/wiki/Hatchling_(scout)",
  "/wiki/Chilling_Death_Spire",
  "/wiki/Sav",
  "/wiki/Sergeant/Legends",
  "/wiki/Katcho",
  "/wiki/Ennlicher",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}