{
 "name": "Birra_Seah",
 "display_name": "Birra Seah",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "unidentified remote planet somewhere in the Outer Rim Territories"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black with white stripes"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kuat Drive Yards",
      "Galactic Empire",
      "Imperial Military",
      "Imperial Military"
     ]
    }
   ]
  }
 ],
 "content": "Birra Seah was a Human Force-sensitive female who worked as a systems designer for Kuat Drive Yards around 0 ABY. She was assigned to the construction staff of the second Death Star, the new superweapon of the Galactic Empire. Birra Seah quickly entered in the good graces of Darth Vader, the Imperial forces' commander-in-chief, who appointed her acting Moff.\nAround the year 0 ABY, Birra Seah was an elderly Human female who worked as a systems designer for the shipbuilding corporation Kuat Drive Yards. That company was one of the primary warship supplier for the Galactic Empire, the authoritarian regime that dominated most of the known galaxy at the time. Seah was sensitive to the Force, a mystic energy that flowed through all living things and bound the galaxy together.\nEarly in 0 ABY, the Empire's weapon of massive destruction known as the first Death Star had been destroyed by the Rebel Alliance, a union of freedom-fighting groups opposed to the tyranny of the government. In the wake of that debacle, the Galactic Emperor Palpatine ordered the construction of a second Death Star near the Sanctuary Moon, in the Endor system. As a Kuat Drive Yards employee, Birra Seah acted as a liaison between the Empire's high command and the staff working on the Death Star's construction site.\nOne day, the Emperor sent his armored right-hand, Supreme Commander Darth Vader himself, to visit the Death Star working site. The Imperial envoy convened a meeting with the project's supervisors, which included Seah. The woman, and the assembled officers were told that the Emperor was eager to see his superweapon completed. Lord Vader menacingly relayed his master's discontent with the lack of progress on site. When an admiral dared to question the realism of the cyborg's expectations, the Emperor's envoy stabbed him in the back with his crimson lightsaber. Seah intervened, asserting that the late officer's claims were true. When Vader asked her who she was and how she dared to back up the dead man's words, Seah introduced herself. She diplomatically pointed out that the Emperor, because of his absence, could not fully realize the numerous details that hindered the progress of the working crews. Impressed by her boldness, Vader commented on how strong the Force was with Seah, thus acknowledging her Force-sensitivity. Seah, however, reacted dismissively to that remark. Subsequently, the Dark Lord ended the meeting, asking for a private conversation with her.\nWhen the two were alone, Seah advised Vader not to turn on the officers and construction workers, suggesting that he should keep his hatred for his true enemies. The woman also asked the Supreme Commander to grant her temporary Moffship so she could supervise the project better and have the Death Star completed on schedule. Seah's request was quickly approved. However, Vader urged her to please Palpatine, adding that if she disappointed the Emperor, she would be doomed a fate from which neither the Dark Lord or even the Force itself could shield her.\nHowever, Seah's career as a Moff was short lived. When the Emperor came to visit the Death Star, he was greeted by her since his apprentice had been called away. Palpatine treated Seah with intense disdain, stating that a mere functionary like her did not deserve to be granted Moffship. Humiliated and deeply insulted, Seah was ordered to confine herself to her quarters until Palpatine decided her fate. Feeling hopeless, she attempted to commit suicide by pressing a blaster against her chest. However, Seah's self-annihilation attempt was stopped when the disembodied voice of Darth Vader called to her, ordering to retain her arm. Thanks to Seah's Force-sensitivity, she and Vader were able to communicate over a distance by telepathy. The Emperor's right-hand told his protégée that he still had use for her and would protect her from the sovereign's wrath.\nShortly after, Birra Seah was made a lieutenant and transferred to the Devastator, a Star Destroyer that had once been the flagship of Vader and was now the command vessel of the young Colonel Kell Bircher. The Emperor had taken the Devastator away from the Dark Lord as a punishment following the destruction of the Death Star, and the armored man sought to keep an eye on Bircher.\nShorlty after Seah's reassignment, the Devastator captured two couriers suspected of being Rebel collaborators. The two men, Captain Wedge Antilles and Commander Luke Skywalker were actual members of the Rebellion, and Seah informed Vader of their presence. Suspecting, and rightly so, that Skywalker might be his estranged son, the Supreme Commander charged her with bringing the young man in, assuring her that the Empire would be in her debt. However, the two captives escaped custody and kept moving around in the ship, effectively rendering Seah's mission difficult. Having failed to detain Skywalker, agent Seah ended up abandoning her post. She left the ship aboard an escape pod after leaving an encrypted message for Vader, extending her apologies for the failed mission and appealing to him for clemency. Upon discovering what she had done, the Dark Lord, however, decreed she would have to die for her defection. Some time later, word spread that Birra Seah's corpse had been found on a remote planet somewhere in the Outer Rim Territories.\nAround 0 ABY, Seah was an older woman with a slender body shape. Her wrinkled face sported blue eyes with hooded lids, with a beauty mark on the left side. She had long, black hair with broad white stripes, and she would wear it tightly back to keep her vision clear. Seah also wore high standard clothing and golden jewellery. When she was made acting Moff on the Death Star, Seah took on the regulation uniform of the Imperial military, a double-breasted tunic with a matching cap and black boots. After being stripped of her Moffship, Seah retained the same type of uniform, although with the appropriate rank plaque for a lieutenant.\nAt the beginning, Seah could be at the same time bold and cautious. She did not hesistate to speak her mind in front of Darth Vader, but she did while staying in her place so she would not attract the Dark Lord's anger. That attitude proved rewarding when the demanding Supreme Commander took her in his good graces and agreed to appoint her to Moffship. Seah was also capable of reasoning Vader, helping him understand that he should keep his anger for the Empire's enemies rather than unleash it on those who worked under his orders. However, the way the Emperor treated her before she could even prove herself broke her confidence and drove her to suicidal thoughts. As time went by, the missions Vader gave to her put Seah under heavy pressure, and she ended up falling apart completely.\nBirra Seah first appeared in the fourth issue of the comic book series titled simply Star Wars published by Dark Horse Comics. The issue was written by Brian Wood, illustrated by Carlos D'Anda and colored by Gabe Eltaeb. It was released on April 10 2013.\nIn Star Wars #5, Seah appeared as an Imperial Moff for the first time. The rank plaque she wore in that issue, however, does not correspond with the usual pattern of such insignias as established in the 2012 reference book The Essential Guide to Warfare. The Moff insignia notably worn by Merillion Tarko, Boren Tascl and Leonia Tavira had a row of six red squares on top of six blue squares. While Seah's rank plaque had the right number of squares, both colors were displayed on each row.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Kuat_Drive_Yards/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Systems_designer",
  "/wiki/0_BBY/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Commander-in-Chief/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Starship/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Time/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Endor_system/Legends",
  "/wiki/Imperial_High_Command/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Emperor",
  "/wiki/Armor/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Supervisor/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Shiak",
  "/wiki/Lightsaber/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Suicide/Legends",
  "/wiki/Telepathy/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Devastator/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Kell_Bircher",
  "/wiki/Captain/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Gold/Legends",
  "/wiki/Imperial_military_uniforms/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Rank_insignia_plaque/Legends",
  "/wiki/Star_Wars_(2013)_4",
  "/wiki/Star_Wars_(Dark_Horse_Comics_2013)",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Brian_Wood",
  "/wiki/Carlos_D%27Anda",
  "/wiki/Gabe_Eltaeb",
  "/wiki/April",
  "/wiki/April_10",
  "/wiki/2013",
  "/wiki/Star_Wars_(2013)_5",
  "/wiki/2012",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Merillion_Tarko",
  "/wiki/Boren_Tascl",
  "/wiki/Leonia_Tavira",
  "/wiki/Star_Wars_(2013)_6",
  "/wiki/Star_Wars_(2013)_7",
  "/wiki/Star_Wars_(2013)_8",
  "/wiki/Star_Wars_(2013)_11",
  "/wiki/Star_Wars_(2013)_14",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_(2013)_9",
  "/wiki/Star_Wars_(2013)_1",
  "/wiki/Star_Wars_(2013)_10",
  "/wiki/Star_Wars:_The_Force_Unleashed_II",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_The_Rebel_Opposition",
  "/wiki/Star_Wars_Handbook_1:_X-Wing_Rogue_Squadron"
 ]
}