{
 "name": "Bisad Koong",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Roon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "15 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Bisad Koong was the governor of Roon's Tawntoom province during the early years of the Galactic Empire. He was a megalomaniac, running his own illegal operations from his fortress, including theft and hijacking. He was also an expert in political intrigue. Throughout his final months of life he was constantly thwarted in his efforts to gain the favor of the Galactic Empire and Admiral Terrinald Screed by the merchant Mungo Baobab and his droids C-3PO and R2-D2.\nAt some point prior to 15 BBY Koong along with his lieutenant Gaff seized control of Roon with his personal army and made himself de facto Governor of the Tawntoom province. He then proceeded to amass a small fortune after he took control of one of the lightstations in the Cloak of the Sith, purposely crashing ships that tried to travel through the dust cloud and recovering the debris to extract valuables to be sold on the black market; such as ship parts, Nergon-14, and Mupple.\nEager to become allied with the Empire, Koong made a deal with Admiral Terrinald Screed to supply the Empire with valuable Roonstones in return to maintain his strong financial position and semi-autonomy over Roon. When Koong salvaged the Caravel, a ship belonging to Mungo Baobab, he believed the merchant was one of Screed's lieutenants and proceeded to show him the workings of his operations. Only when Screed himself arrived to observe Koong's operation, did Koong realize he had been tricked and Baobab and his droids, R2-D2 and C-3PO, were arrested. Baobab managed to escape, inflicting damage to the lightstation and causing it to crash into an asteroid.\nDesperate to prove himself to the Empire after the failure of his previous scheme, Koong determined to crush resistance in the Umboo Province. To this end, he attempted to fix the Roon Colonial Games so that his Tawntoom team beat the Umboo team and crush rebel spirits. His attempt failed due to the intervention of Mungo Baobab.\nLater, Koong used the Rooze Disease to try and poison the Umboo Province, but accidentally infected himself as well. The renowned doctor, Nilz Yomm, was captured and forced to develop a cure for the germ, but Baobab stole it and freed the doctor. Baobab made a deal to exchange the cure and the location of the Roonstone treasure for his ship and Koong's promise to leave Umboo alone. However, Screed double-crossed Koong, taking control of Roon and seizing the treasure.\nKoong made an unsuccessful attempt to kill Baobab and the Imperials but succumbed to his illness before he could use the cure and he died.\nKoong was fairly short and stocky compared to most Humans and possessed an ample paunch, which along with his five o'clock shadow and unbuttoned upper shirt gave him an unkempt appearance. His hair was cut in a buzzcut and spoke with a gruff voice.\nKoong wore a green uniform with a red belt, red boots, and gold epaulets. This uniform style was shared with the soldiers under his command.\nIn \"The Roon Games\", Koong was animated with only four fingers per hand instead of five.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Roon/Legends",
  "/wiki/15_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Tawntoom",
  "/wiki/Fortress_of_Tawntoom",
  "/wiki/Admiral/Legends",
  "/wiki/Terrinald_Screed/Legends",
  "/wiki/Mungo_Baobab",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Gaff",
  "/wiki/The_Cloak_of_the_Sith",
  "/wiki/Nergon-14/Legends",
  "/wiki/Mupple",
  "/wiki/Roonstone",
  "/wiki/Caravel",
  "/wiki/Umboo",
  "/wiki/Roon_Colonial_Games",
  "/wiki/Rooze_Disease",
  "/wiki/Nilz_Yomm",
  "/wiki/The_Roon_Games",
  "/wiki/Star_Wars:_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/Tail_of_the_Roon_Comets",
  "/wiki/Escape_from_the_Monster_Ship:_A_Droid_Adventure",
  "/wiki/Across_the_Roon_Sea",
  "/wiki/The_Frozen_Citadel",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Lando_Calrissian:_Idiot%27s_Array",
  "/wiki/StarWars.com",
  "/wiki/Unbound_Worlds",
  "/wiki/Star_Wars:_Droids_(toy_line)",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/Star_Wars:_The_Action_Figure_Archive",
  "/wiki/C-3PO:_Tales_of_the_Golden_Droid",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Toys_That_Never_Were",
  "/wiki/Star_Wars_Insider_92",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Proto_Power!",
  "/wiki/Star_Wars_Insider_128",
  "/wiki/Databank_(original)",
  "/wiki/The_Droids_Re-Animated",
  "/wiki/Sports_in_the_Star_Wars_Galaxy"
 ]
}