{
 "name": "Biv Bodhrik",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black/dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Biv Bodhrik was a guerrilla fighter allied with the Rebel Alliance during the events of the Galactic Civil War. He alongside Saska Teft were dispatched to Tatooine to both investigate a growing Imperial presence on the planet and to find the freelance member Han Solo, who had disappeared during his assignment in investigating the planet at Mos Eisley, as they were considered among the Rebel Alliance's best operatives.\nBiv Bodhrik joined the Rebel Alliance during the Galactic Civil War as a guerrilla fighter and eventually rose in the ranks, being driven by a thirst for vengeance for something that happened in his past relating to the Galactic Empire. He eventually was sent to Tatooine to find Han Solo and investigate rumors of a growing Imperial presence on the planet, working together with the engineer Saska Teft.\nBiv Bodhrik held extreme desires for vengeance. He was proficient in various weaponry, although his preferred weapon was heavy weaponry. He also could affix his weapons with a vibrobayonet, and was skilled enough in guerrilla warfare to overwhelm even the greatest servants of the Empire.\nBiv Bodhrik is one of two hero characters in the Twin Shadows expansion pack for the tactical land-based RPG game Star Wars: Imperial Assault by Fantasy Flight Games.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Saska_Teft",
  "/wiki/Tatooine/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Twin_Suns",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Vibrobayonet/Legends",
  "/wiki/Twin_Shadows",
  "/wiki/Star_Wars:_Imperial_Assault_(Fantasy_Flight_Games)",
  "/wiki/Fantasy_Flight_Games"
 ]
}