{
 "name": "Bix_Caleen",
 "display_name": "Bix Caleen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ferrix"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Caleen Salyard"
     ]
    }
   ]
  }
 ],
 "content": "Bix Caleen was a human female and mechanic who was the owner of the Caleen Salyard on the Free Trade sector planet of Ferrix. She worked alongside Timm Karlo, who was also her lover. She was close with her ex-boyfriend, Cassian Andor, who trusted her greatly. She also had offworld connections, namely Luthen Rael. When Andor informed her he was looking to sell a valuable item, Caleen contacted Rael, who was already interested in meeting Andor. When Preox-Morlana security forces arrived on Ferrix to arrest Andor, who had killed two of their officers, Caleen learned that Karlo had ratted out Andor and ran to help him. However, she was beaten and handcuffed by several officers, and when Karlo attempted to help her, he was shot and killed. Caleen was later freed by two men, Salman Paak and his son Wilmon.  Some time after the Preox-Morlana security forces incident, Bix was interrogated by ISB Supervisor Dedra Meero searching for leads to Andor.\nDuring the reign of the Galactic Empire, the human female Bix Caleen resided on the planet Ferrix, where she worked as a mechanic at the Caleen Salyard, which she inherited after the death of her parents. alongside Timm Karlo, who was also her lover. She also had connections on the black market. In 5 BBY, Cassian Andor, a close friend of Caleen's who was also her former lover, arrived at the salvage yard and asked her to reach out to one of her contacts, as he had a valuable item he wanted to sell. She replied that he would not arrive for a sole item, as she usually bundled a number of items for him to purchase all at once. As such, she stated that she planned to reach out to him at the end of the month. She added that there was a Tac Corvette that was coming in during the week looking to scrap, and was said to have Imperial targeting units onboard. She would gather those items, along with Andor's item before contacting him. Andor insisted he could not wait that long, which raised questions from Caleen. She asked him what the item he was carrying was, and Andor reluctantly told her it was an untraceable NS-9 Starpath unit.\nShe questioned how long he had been holding the unit, believing it had come from one of her bids, and that Andor was hiding it from her. Caleen suggested that Andor sell the item to her instead, which he immediately shot down, as he needed every credit that was to be made from the item, unwilling to share it with a partner. The two were interrupted by Karlo, who asked if Caleen wanted to bid on a run from the planet Wobani. Caleen brushed him off, which prompted Andor to ask if she and Karlo were more than co-workers. She fired back, stating that she never asked about his personal life, but also assured him that Karlo knew nothing of her under-the-radar dealings. Andor mentioned that Caleen had once said her contact wanted to meet him, and that he really needed to sell the item. Caleen finally agreed, promising to contact her buyer, and told Andor to fix his face before sending him off, as it was bruised due to what he claimed to be \"a fall.\" Unknown to Caleen, however, Andor had returned from the the planet Morlana One the previous night, where he had killed two Preox-Morlana Sentry Corporals—Verlo Skiff and Kravas Drezzer.\nLater that day, Caleen left the salvage yard to run \"errands,\" when in reality she was going to contact her buyer. Suspicious of his partner, Karlo followed her through the streets of Ferrix, but eventually lost track of her. Caleen arrived at Repaak Salyard, where Salman Paak and his son Wilmon worked, and asked for a \"Bendine Mesh-Tech filter.\" Hesitantly, Paak replied that they were located on a rack in the back, adding she may have to dig to find them, and wished her good luck. In truth, she had spoken a code-phrase to Paak, and found her way to a junction box where she contacted her buyer.\nThat night, the Time Grappler struck his beskar anvil with a hammer, marking the end of the work day. At Karlo's salvage yard, Caleen tidied up as she prepared to retire for the day. On a nearby screen, a notice from Pre-Mor Security Inspection team in search of a Kenari male, matching Andor's description, caught her eye. She quickly closed the screen as she was interrupted by Karlo, who invited her out for a meal. She promised to share a meal with him the following day, before exiting the salvage yard. Karlo headed over to the screen and read the notice from Pre-Mor. Shortly after, Caleen attempted to contact Andor but was unable to reach him, but the two later met at a bar. Caleen questioned Andor about the situation, and he revealed the events of the previous night, and insisted that he was provoked by the sentry guards and was not looking for trouble. Despite his earlier comments, Andor offered to sell the star path unit to her, but she replied that her buyer was already on the way, and would arrive the following morning. He touched her hand, and informed her he will not forget this deed, and she told him to leave. Unbeknownst to the pair, Karlo had been watching them from the distance. Drunk, he stumbled to a business center where he contacted Pre-Mor authorities about Andor's presence on Ferrix. Unable to sleep, Caleen soon arrived at Karlo's residence, where he invited her inside. The two embraced, and spent the night together.\nThe next morning, Caleen awoke to Karlo staring at her, and requested a mug of caf. As Karlo prepared the beverages, Caleen asked him to open the yard that morning, which he agreed to, asking what she had to do instead. She claimed to have a few errands to run, leaving Karlo unsatisfied. She made her way to a café where she waited for and eventually met her contact, Luthen Rael. She informed the man that Pre-Mor Enforcement had put out a bulletin for Andor, with Rael replying he had seen it. Rael countered that they were looking for someone from the planet Kenari, whereas Andor's Imperial prison record had him listed as from Fest. Caleen confirmed that he was indeed from Kenari, but he had not yet been identified, as not many people on Ferrix knew him. Rael remarked that they should be quick, and Caleen informed him Andor was waiting in the East lot, in building nine. Before parting ways, Rael asked Caleen if she trusted Andor, and she assured him that Andor would be there for the deal.\nCaleen soon arrived at her salvage yard, questioning Karlo why there was still stuff piled up in the alley of the yard. He replied he had forgotten about it, before leaving to take care of it, leaving Caleen suspicious of her partner. Shortly after, Paak arrived at Caleen's salvage yard, notifying her that a group of Corpos, were looking for Andor, and were currently raiding Andor's mother, Maarva Andor's house. Realizing that someone had betrayed Andor and ratted him out, Caleen set out to find her friend, but was stopped by Karlo, who claimed \"he\"—Andor— could take care of himself. As Karlo was not privy to her conversation with Paak, and therefore did not know they were talking about Andor, Caleen realized that it was Karlo who had ratted Andor out to Pre-Mor enforcement. She shoved him against the wall, questioning how he could betray her and Andor, before rushing out of the yard to search for Andor.\nRunning through an alley, Caleen spotted the North Team from the Pre-Mor Inspection team and changed course, but not before one of the Corpo's spotted her. One of them raised a blaster at her, while another ushered her against a wall. The Inspection Team's second-in-command, Sergeant Linus Mosk, contacted the North Team asking for their location, and while they were distracted, Caleen attempted to flee, but was immediately seized by a Corpo, who slammed her head against the wall. Bruised and bloodied, Caleen was handcuffed to a pipe by the Corpo. Karlo soon arrived, demanding to know what they had done to her. North-1 raised his blaster at Karlo, ordering him to stop moving. Ignoring the officer's command, Karlo charged at the officers, and was shot in the chest by North-3, killing him. North Team left the area and headed for Rix Road, leaving Caleen bound to the pipe, weeping for her fallen partner. Paak and Wilmon arrived shortly after and freed Caleen, halting her crawl to Karlo's body. The father and son dragged Caleen away from the stairs, leaving Karlo's corpse in the stairway.\nFollowing the shootout on the planet, Andor and Rael fled Ferrix and headed to the planet Aldhani. Andor assisted the Aldhani rebel infiltration team to steal eighty million credits from the Aldhani Garrison on the planet, earning a cut of two-hundred thousand for his work. Following the heist, Andor returned to Ferrix where he spoke with Caleen at her salvage yard, which he entered by hopping over the wall. Andor reminisced about a time years prior, when Caleen's father had reprimanded him for doing the same action. Caleen insisted that he should not have returned, and her salvage yard in particular was the last place he should have come to. Andor asked about Karlo—as he had previously been informed by his mother—that Karlo had been the one to rat him out. Caleen guessed that her deceased partner assumed that she and Andor had rekindled their relationship, fueling his jealousy, which caused him to alert Pre-Mor to Andor's location. Andor asked what happened to Caleen, noticing the gash above her brow, which was still healing after her arrest and abuse at the hands of the Corpos. Caleen replied that she had run into a wall, again insisting that she should not be at the yard. Andor assured her that the troopers would not catch him, but his friend said they would not have to, as he would be turned in. She reiterated that the residents of Ferrix blamed him for everything, as his actions had led to an Imperial occupation of the planet. Andor countered that if Karlo had kept quiet, they wouldnt have been in this situation.\nCaleen once again stated that he should leave and get as far away from Ferrix as possible, and Andor assured her that he will, and she won't have to worry about him anymore. Before leaving, he asks her about Rael, who had known every detail of Andor's life. Caleen replied that she did not know anything about him, and Andor accused her of lying. She stated that they were introduced by Paak—who swore he did not know anything. She added that she had a comm she contacted Rael on, and sometimes he responded, assuring Andor that he did not know about his life from her. Andor asked her to tell Rael that he held up his end of the bargain, and the man needed to forget about him, which went for everyone, her included. He pulled out a satchel containing twelve thousand credits, which covered the amount he owed to everyone on Ferrix. He scaled the wall to leave, and Caleen asked him to be careful, with Andor replying the same to her.\nSome time after Andor's return and immediate departure from Ferrix, Caleen went to visit Maarva Andor, who had grown ill and weary in the time since her son's disappearance. Caleen wondered if the older woman required a doctor, noticing that her breathing sounded weak and she was dizzy, with her droid, B2EMO, adding that she had pain in the knee. Brasso, a mutual friend of Caleen and both Andor's, entered the residence, asking what had happened to Maarva, as he had heard she had to have been carried back to her house earlier after taking a fall. Later, outside the house, Brasso asked Caleen what Maarva was doing by the hotel, which the Imperial Security Bureau had used to set up their headquarters. Caleen replied that the old woman had become obsessed with troopers, and she fell while trying to pry open the Rix flood gate, hoping to find out if the tunnel under the hotel was still open. She said that Maarva hoped the Rebellion would use the tunnel to come in and take the Imperials by surprise, voicing that the old woman was a rebel. Brasso stated that he should have come by Maarva's residence more often, and Caleen stated that she wasn't his mother, to which he replied that she wasn't her mother either.\nBrasso pondered if there was somewhere else Maarva could stay, as the cold in her home was making her condition worse. He suggested the Daughters of Ferrix, who Maarva had served as a President for in the past, might have a warm room, but Caleen affirmed that the older woman had made her intentions clear—she wished to stay in her home. They guessed that Maarva's condition had worsened because of Cassian's disappearance. Caleena asked Brasso if he knew where their friend was, and the man shook his head in the negative. Unbeknownst to Brasso and Caleen, Vel Sartha and Cinta Kaz, who were part of the Rebel infiltration team on Aldhani that Cassian had worked with, were spying on them from across the street. The two women had been ordered by Kleya Marki, who was an assistant to Caleen's contact Rael, to find Cassian and kill him, as having him out in the wild with information about Rael was a risk.\nCaleen then made her way to the Repaak Salyard, where Paak asked her if her business was as slow as his, which she confirmed, adding that losing the hotel has been bad for business. Paak mentioned that they should call a meeting, and find out if there was something they could do. Caleen asked if she could \"look for something in the back\", meaning she wanted to use his comm unit. Paak warned against it, but ultimately allowed her to use it. She turned on the unit and began tapping out a transmission to Rael, asking for Cassian's whereabouts. On the planet Coruscant, Rael's assistant Marki received the transmission, and while Rael wished to reply as he was also searching for Andor, Marki advised against it, as it could be the ISB watching her radio. Rael and Marki eventually closed off the transmission, cutting all contact with Caleen and Ferrix. Caleen, growing irate due to the lack of response for Rael, desperately tapped out on the comm unit, to no avail.\nThe next morning, Caleen heard the banging of objects by the citizens of Ferrix, and made her way to the Paak's salyard, which had a crowd surrounding it. Brasso informed Caleen that they had arrested Paak the previous night, and the two watched as Wilmon demanded to know where the Imperials had taken his father. The lead Imperial officer, Captain Vanis Tigo, ordered the streets to be cleared just as his gaze landed on Caleen. Tigo called out to her and ordered his troopers to arrest her, but not before Brasso told her to flee to Zorby's Western Shiplot, a starship lot owned by Zorby. Caleen ran away with a head start, but the Imperials eventually caught up to her, putting her in stuncuffs. They led her to a room in the hotel that contained a depleted Paak, who had been tortured for information. ISB Lieutenant Dedra Meero, who had been given command of the Morlana Sector and by extension Ferrix, ordered the troopers to remove Paak from the room and greeted Caleen, gesturing for her to be seated in Paak's now-vacated seat.\nMeero began her interrogation of Caleen by setting herself apart from her ISB colleagues, stating that whereas everyone else was lacking, she actually tried. The ISB Lieutenant asked for Caleen's cooperation, but failing that, she introduced Doctor Gorst, who has developed a new and unique interrogation system that the Empire was excited about. Meero explained that they had arrested Paak after tracing a radio in his yard, and despite having very little rebellious activity to his name, resisted the ISB, leading them to torture the man. She revealed everything she had learned from Paak to Caleen—Paak was acting a liason for Ferrix, not for political purposes but to use the planet's commercial position to acquire stolen Imperial equipment. She added that Caleen was the only person to use Paak's radio, and her contact had only met with Paak once, leading the ISB supervisor to believe there were motivations larger than money at play.\nMeero attempted to persuade Caleen to cooperate by saying she had no history of political chaos, and it did not make sense to go through the trouble of torture if her motivations were only for money. After staying silent the entire time, Caleen finally spoke up, simply stating that Meero was ISB, the worst of all the Imperials. Meero demanded to know everything about her contact, the contact's relationship with Andor, and a full detailed accounting of every piece of Imperial equipment she had dealt with. Caleen retorted that the buyer—Rael, although Meero was not aware of his identity—had no relationship with Andor. She added that she did not know the buyer, which Meero knew was a lie as Paak had told her Caleen had met with him at least six times. Caleen said that she would only go to the radio and signal her contact—sometimes he would answer, come to the planet, buy the equipment, and leave. Meero continued, expressing that Caleen had been injured trying to protect Andor, and Karlo was killed trying to win her freedom, explaining that it was in fact a nest of relationships. The ISB supervisor asked Caleen when the last time she spoke to Andor was, earning no response. Meero stressed that the worst thing Caleen could do was bore her, with Caleen firing back, saying the ISB supervisor wasn't going to believe her anyway. Meero exited the room, leaving Gorst to torture Caleen.\nThe doctor explained his new torture method, emphasizing that it was best Caleen was tied down during it. Gorst explained that a moon in the Outer Rim Territories called Dizon Fray had resisted the building of an Imperial refueling center that was being built, and all of the sentient species of the planet, the Dizonites, were eliminated entirely. He added that the Dizonites made a unique sound as they were being killed, which the Imperials modified and weaponized—zeroing in on the sound made by Dizonite children. Meero returned to the room, urging Caleen to cooperate, as repeat listenings of the Dizonite screams caused the most damage. Gorst placed a pair of headphones on Caleen's head, drilling the sounds into Caleen's ears, as she sat there, screaming. After some time, Meero palmed the face of a depleted Caleen, once again asking her when the last time she spoke with Andor was. Caleen eventually gave up all the information Meero asked of her, except the identity of her contact, who Meero had dubbed \"Axis.\" The ISB supervisor reported her findings to her colleagues at the ISB headquarters office on the planet Coruscant. Caleen had told Meero that Andor had shaved his beard the last time she saw him, which led Meero to believe he was linked to the heist on Aldhani.\nBix Caleen was a human woman with brown hair, brown eyes, and tan skin. She was a skilled mechanic and took over her parents' salvage yard after their death. A hardworking woman, Caleen was known to be handy and strong, and was smarter and stronger than most people around her believed. The mechanic was also known to take charge and control of situations, which was reflected in how the people around her behaved.\nShe had been in–and–out of relationships with Cassian Andor ever since they were children, and knew everything there was to know about each other. Despite this, the two could never form an ongoing relationship, and had burned every bridge between them. Still, they conducted business together. Selfless and loyal, Caleen maintained ties with Andor despite their troubles, and also acted as a confidante to Andor.\nPortrayed by Adria Arjona, Bix Caleen was created for the 2022 live-action television series Andor. She was first identified in SFX magazine. Bix first appeared in the first episode of the series, as a part of its three-episode premiere.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bix",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Announcement",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Ferrix",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Caleen_Salyard",
  "/wiki/Technician",
  "/wiki/Free_Trade_sector",
  "/wiki/Planet",
  "/wiki/Timm_Karlo",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Luthen_Rael",
  "/wiki/Preox-Morlana",
  "/wiki/Ambush_on_Ferrix",
  "/wiki/Death",
  "/wiki/Corpo",
  "/wiki/Stuncuffs",
  "/wiki/Officer",
  "/wiki/Salman_Paak",
  "/wiki/Wilmon_Paak",
  "/wiki/ISB_Supervisor",
  "/wiki/Dedra_Meero",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Parent",
  "/wiki/Black_market",
  "/wiki/5_BBY",
  "/wiki/Salvage_yard",
  "/wiki/Standard_month",
  "/wiki/Tac_Corvette",
  "/wiki/Standard_week",
  "/wiki/Imperial_N-S9_Starpath_Unit",
  "/wiki/Credit",
  "/wiki/Wobani",
  "/wiki/Morlana_One",
  "/wiki/Standard_day",
  "/wiki/Sentry_Corporal",
  "/wiki/Verlo_Skiff",
  "/wiki/Kravas_Drezzer",
  "/wiki/Repaak_Salyard",
  "/wiki/Time_Grappler",
  "/wiki/Beskar",
  "/wiki/Hammer_(tool)",
  "/wiki/Pre-Mor_Security_Inspection_team",
  "/wiki/Eye",
  "/wiki/Foodstuff",
  "/wiki/Cantina",
  "/wiki/Limb",
  "/wiki/Ferrix_business_center",
  "/wiki/Sleep",
  "/wiki/Caf",
  "/wiki/Pre-Mor_Enforcement",
  "/wiki/Fest",
  "/wiki/Maarva_Andor",
  "/wiki/Andor_household",
  "/wiki/North_Team",
  "/wiki/North-1",
  "/wiki/Blaster",
  "/wiki/Sergeant",
  "/wiki/Linus_Mosk",
  "/wiki/Blood",
  "/wiki/North-3",
  "/wiki/Rix_Road",
  "/wiki/Aldhani",
  "/wiki/Aldhani_rebel_infiltration_team",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani_Garrison",
  "/wiki/Bix_Caleen%27s_father",
  "/wiki/Stormtrooper",
  "/wiki/B2EMO",
  "/wiki/Brasso",
  "/wiki/Unidentified_hotel_(Ferrix)",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Daughters_of_Ferrix",
  "/wiki/President",
  "/wiki/Vel_Sartha",
  "/wiki/Cinta_Kaz",
  "/wiki/Kleya_Marki",
  "/wiki/Coruscant",
  "/wiki/Captain",
  "/wiki/Vanis_Tigo",
  "/wiki/Zorby%27s_Western_Shiplot",
  "/wiki/Zorby",
  "/wiki/Lieutenant",
  "/wiki/Doctor",
  "/wiki/Gorst",
  "/wiki/Moon",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Dizon_Fray",
  "/wiki/Sentience",
  "/wiki/Dizonite",
  "/wiki/ISB_headquarters_office",
  "/wiki/Youngling",
  "/wiki/Adria_Arjona",
  "/wiki/2022",
  "/wiki/Andor_(television_series)",
  "/wiki/Kassa_(episode)",
  "/wiki/That_Would_Be_Me",
  "/wiki/Reckoning_(episode)",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Images_of_Bix_Caleen",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Databank_(website)",
  "/wiki/August_4",
  "/wiki/Disney%2B",
  "/wiki/The_Eye",
  "/wiki/Narkina_5",
  "/wiki/September"
 ]
}