{
 "name": "Bixene",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shu-Torun"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Bixene was the daughter of Duke Rubix, who held the position of ore-duke on the planet Shu-Torun. When the Imperial Sith Lord Darth Vader visited Shu-Torun, the King of Shu-Torun arranged for a ball to be held in the Shu-Torun royal palace, which Bixene attended with her father. At the ball, she wished to dance with Vader, and so Rubix approached the Sith and demanded he dance with his daughter. After Vader refused, Rubix persisted in his demands until the Imperial used the Force to lift the duke into the air and twirl him around, before dropping him. A number of troops working for the king then ambushed Vader, causing the guests of the ball, including Bixene to flee.\nLater Bixene's father rebelled against the new Queen of Shu-Torun, Trios, along with other ore-dukes and barons. Trios had him executed and declared that Bixene would take over her father's holdings.\nBixene was the daughter of Duke Rubix and lived on the planet Shu-Torun. She accompanied her father to a ball held by the king of Shu-Torun, in honor of the Sith Lord Darth Vader visiting the world. At the ball, which was held in the subterranean abyssal rooms of the Shu-Torun royal palace, she wore a green and cream dress with a cream headpiece. She expressed the desire to dance with Vader once he arrived, and so she and Rubix approached Vader and his guide Princess Trios once they arrived. Rubix insisted on Vader accepting the invitation, and continued to press the matter even after Trios advised against it. The Sith then agreed to \"dance,\" lifting Rubix into the air with the Force and twirling him around before dropping him. A squad of troops serving the king, who had secretly turned against the Empire, then entered the hall in a burrowing craft and attacked Vader, causing Bixene and all the other guests to flee.\nSometime later the ore-dukes including Rubix rebelled against the newly appointed Queen Trios, thus starting the Shu-Torun War. The Queen, with the help of the Galactic Empire, crushed the rebellion and had Rubix executed. However she spared Bixene and told her that she would take over her father's holdings despite the fact that the line of inheritance would normally pass control to the eldest son.\nBixene first appeared in Darth Vader Annual 1, a comic book written by Kieron Gillen and illustrated by Leinil Francis Yu for publication in 2015.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Shu-Torun",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Duke",
  "/wiki/Rubix",
  "/wiki/Ore-duke",
  "/wiki/Planet",
  "/wiki/Galactic_Empire",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mission_to_Shu-Torun",
  "/wiki/Unidentified_King_of_Shu-Torun",
  "/wiki/Shu-Torun_royal_palace",
  "/wiki/Parent",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/War_on_Shu-Torun",
  "/wiki/Queen",
  "/wiki/Trios",
  "/wiki/Baron",
  "/wiki/Death",
  "/wiki/Clothing",
  "/wiki/Prince",
  "/wiki/Sith",
  "/wiki/King",
  "/wiki/Darth_Vader_Annual_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Kieron_Gillen",
  "/wiki/Leinil_Francis_Yu",
  "/wiki/2015",
  "/wiki/Darth_Vader_(2015)_19"
 ]
}