{
 "name": "Biz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Qalydon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lurmen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Grey"
     ]
    }
   ]
  }
 ],
 "content": "Biz was a male Lurmen who was the chief of a Lurmen village on the planet Qalydon during the Imperial Era. He was the husband of Elan and the father of Maynar, who aided the Freemakers in liberating their village from the Galactic Empire.\nBiz was the Chief of a Lurmen village on the planet Qalydon during the Imperial Era. His people had lived on the planet for generations worshiping the Force with kyber crystals. Biz had a wife named Elan and the two had a daughter named Maynar, who did not share her father's appreciation for the Force and kyber crystals\nWhen the Freemakers traveled to Qalydon during their quest to build the Arrowhead starship, Biz spotted their ship in the distance and remarked that it did not look Imperial. The Lurmen villages initially thought the Freemakers were hostile when they explained that they had come seeking kyber crystals. Following a brief confrontation, Kordi Freemaker managed to convince the Lurmen that they were not Imperials.\nLater that night, Chief Biz and his wife Elan hosted the Freemakers and their droid Roger, educating them about the history of their community and the kyber crystals. Biz said that his people could not give up their heirlooms but was unable to offer information on where they could find other crystals.\nShortly later, the village was raided by Imperial forces led by Imperial officers Durpin and Plumestriker. The Imperials seized their kyber crystals for the second Death Star. However, the youngest Freemaker Rowan used the Freemakers' ship StarScavenger's laser cannons to drive the Imperials way. The Imperials fled aboard their Gozanti-class cruiser which crashed into a nearby mountain.\nWhile the Freemakers embarked on a mission to recover the kyber crystals, Biz stayed behind with Roger and Elan to help rebuild the village. Roger tried to demonstrate his carpentry skills by repairing a wall, which kept falling. Elan called for their daughter Maynar but she had accompanied the Freemakers on their quest to recover the crystals from the Imperials.\nWith the help of Maynar, the Freemakers managed to recover the crystals from Durpin and Plumestriker despite being attacked by the Imperial hunter droid M-OC and the Imperials escaping a second time on their ship. Following the rescue mission, Biz thanked the Freemakers for recovering his people's crystals and offered to give them to the Freemakers. Unwilling to deprive the Lurmen of their crystals, Rowan politely declined their offer.\nBiz was a male Lurmen with grey fur, brown eyes, and white beard. He supported the Lurmen villagers' traditional way of life. He believed in the Force and revered his people's traditional kyber crystal necklaces, which were passed down from generation to generation. Biz did not have a high opinion of the battle droid Roger's carpentry skills.\nBiz gained the respect of the Freemakers after they recovered his people's crystals. He offered them the crystals but Rowan declined, not wanting to deprive the Lurmen of their heirlooms.\nBiz first appeared in the LEGO Star Wars: The Freemaker Adventures Season Two episode \"The Lost Crystals of Qalydon\", which premiered on Disney XD on August 7, 2017. He was voiced by Jeff Bennett.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Qalydon",
  "/wiki/Lurmen",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chief",
  "/wiki/Unidentified_Lurmen_village",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Marriage",
  "/wiki/Elan_(Lurmen)",
  "/wiki/Parent",
  "/wiki/Maynar",
  "/wiki/Freemakers/LEGO",
  "/wiki/Galactic_Empire",
  "/wiki/The_Force",
  "/wiki/Kyber_crystal",
  "/wiki/Quest_to_build_the_Arrowhead",
  "/wiki/Arrowhead_(Freemakers)",
  "/wiki/Kordi_Freemaker/LEGO",
  "/wiki/R0-GR/LEGO",
  "/wiki/Imperial_officer",
  "/wiki/Durpin",
  "/wiki/Plumestriker",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Rowan_Freemaker/LEGO",
  "/wiki/StarScavenger",
  "/wiki/Laser_cannon",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Mission_to_Qalydon",
  "/wiki/Hunter_droid/LEGO",
  "/wiki/M-OC/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures_Season_Two",
  "/wiki/The_Lost_Crystals_of_Qalydon",
  "/wiki/Disney_XD",
  "/wiki/August_7",
  "/wiki/2017",
  "/wiki/Jeff_Bennett"
 ]
}