{
 "name": "Blandos_Deena",
 "display_name": "Blandos Deena",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Intarsa League"
     ]
    }
   ]
  }
 ],
 "content": "Blandos Deena was a male Human member of the Intarsa League criminal faction who lived during the latter years of the Galactic Republic. Deena was the right-hand man of Dersa Welles, the leader of the League. Circa 31 BBY, Deena accompanied Welles and the League on a shuttle journey to the planet Cularin to meet with the Rodian scoundrel Roos Londabir to set up a shell company to launder the earnings from the League's operations. However, the shuttle was attacked by a rival group of criminals and it crash-landed in the grounds of the Blue Star Centre, a philosophical research facility. Under Welles' leadership, the surviving Intarsa League members quickly moved to seize control of the facility and to hold hostage its inhabitants. Deena disliked the situation because he hated having to establish a defensive position in a location that he had not been able to scout out in advance and he became very irate. However, the Heroes of Cularin, a group of freelance operative who operated in the Cularin system, attacked the Intarsa League and defeated Deena, Welles and their Intarsa League compatriots to free the hostages.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Deena_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Intarsa_League",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dersa_Welles",
  "/wiki/31_BBY/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Scoundrel",
  "/wiki/Roos_Londabir",
  "/wiki/Blue_Star_Centre",
  "/wiki/Philosopher/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Cularin_system",
  "/wiki/Skirmish_in_the_Blue_Star_Centre",
  "/wiki/Operation_Blue_Star"
 ]
}