{
 "name": "Blaschowwa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Blaschowwa was a male Wookiee pirate who lived during the Galactic Civil War. He served the Dark Jedi Thaum Rystra and, at some point, traveled to the Temple of Pain, a Sith Temple that was located within the Tascollan Nebula, where Rystra experimented on him using Sith alchemy. Circa 7 ABY, Blaschowwa attacked and was defeated by a group of New Republic agents who had come to the temple in search of Rystra.\nBlaschowwa was a male Wookiee who lived during the time of the Galactic Civil War, working as part of a pirate band that served the Dark Jedi Thaum Rystra. At some point, Blaschowwa traveled to the Temple of Pain, a Sith Temple located within the Tascollan Nebula, where Rystra carried out experiments on the Wookiee in the Room of Change, the temple's laboratory. Under the instruction of the Sith spirit Valik Kodank, Rystra used Sith alchemy to alter Blaschowwa and a number of other pirates, turning them into psychopaths. Afterward, Blaschowwa was shut inside a room in the laboratory, along with the altered pirates Kamtis Bonai, Vobin Sobos, and Desvin Tor'thal.\nCirca 7 ABY, a group of New Republic agents traveled to the Temple of Pain in search of Rystra and entered the Room of Change during their exploration of the facility. The agents opened the door to the room in which Blaschowwa was shut, and Blaschowwa, Bonai, Sobos, and Tor'thal rushed out and attacked them. However, the agents eventually subdued Blaschowwa and the other pirates, and engaged Rystra in combat a short time afterward.\nBlaschowwa was heavily altered by Rystra's experiments. As a result, his thoughts became exclusively homicidal in their nature, and he was prepared to fight to the death in order to kill others. Blaschowwa was left with very little of his original mind, rendering him unable to use advanced combat tactics, although he retained a greater level of creativity than Bonai, Sobos, and Tor'thal. Rystra also augmented Blaschowwa's claws, allowing the Wookiee to use them to grip walls. Blaschowwa spoke Shyriiwook, the language of the Wookiees, and he could also understand Galactic Basic Standard. In addition, Blaschowwa was trained to use martial arts.\nBlaschowwa was created by Lee Pickler and appeared in Light and Dark, a roleplaying supplement published by RPGA and set within Star Wars Legends continuity that formed part of the Child of Light saga. In the adventure, it is possible for the players—who roleplay as the New Republic agents that venture to the Temple of Pain—to enter the Room of Change and encounter Blaschowwa, where it is possible for them to defeat and kill him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Thaum_Rystra",
  "/wiki/Temple_of_Pain",
  "/wiki/Sith_Temple",
  "/wiki/Tascollan_Nebula",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Temple",
  "/wiki/Time/Legends",
  "/wiki/Room_of_Change",
  "/wiki/Laboratory/Legends",
  "/wiki/Force_ghost",
  "/wiki/Valik_Kodank",
  "/wiki/Kamtis_Bonai",
  "/wiki/Vobin_Sobos",
  "/wiki/Desvin_Tor%27thal",
  "/wiki/Light_and_Dark_(adventure)",
  "/wiki/Canon",
  "/wiki/Death/Legends",
  "/wiki/Shyriiwook/Legends",
  "/wiki/Language/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Lee_Pickler",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/RPGA",
  "/wiki/Child_of_Light_saga",
  "/wiki/Roleplaying_game",
  "/wiki/Child_of_Light",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/Standard_year/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Soulsaber_(adventure)",
  "/wiki/4_ABY/Legends",
  "/wiki/Galactic_Phrase_Book_%26_Travel_Guide_(real-life_book)"
 ]
}