{
 "name": "Bleys_Harand",
 "display_name": "Bleys Harand",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Bleys Harand was a famous Corellian historian, philosopher and merchant who lived during the Imperial Period. He was a noted Ximologist and his theory of the Ash Worlds being a remnant of the lost Kiirium Reaches of Xim's empire was generally accepted and proved. He wrote the text Travels Amid Strange Stars, detailing his search for a true artistic depiction of Xim the Despot.\nHarand was active during the end of the Galactic Republic and the early Imperial Period. A historian with an interest in Ximology, he made a notable contribution to the field when he drew a connection between the various similar winter holiday traditions of the Tionese, such as the Devouring ceremony of Stalimur and the Wakemeet festival of Barseg. Harand believed that these religious days were a cultural memory of the genocidal campaign waged by the Hutt Empire against the Tionese after Xim the Despot's defeat at the Third Battle of Vontor in 25,100 BBY.\nTo prove his theory, Harand sent his students, including the young Henrietya Antilles, on expeditions into the Ash Worlds, a largely barren, unsettled stretch of space trailing of the Tion Cluster. They discovered that radiation levels on many of the uninhabited planets there fit the profile of fission bomb attacks some twenty-five thousand years previously. Since the ancient Hutt Empire was known for such genocides and atrocities, historians had until then considered the Ash Worlds an abandoned Hutt domain. Harand, however, suggested that the Ash Worlds were in fact the remnants of the lost Kiirium Reaches attested to in Xim-era chronicles.\nFor millennia the true location of the Kiirium Reaches, as well as the identities of Huronom and Astigone, the Seventh and Eighth Thrones of Xim, had been debated. The Salin Corridor had been suggested as a possible location, with Columex and Trogan often being identified as Huronom and many luxury resorts on Centares carrying the name Astigone. Further afield, Jabiim, Lucazec, and even Lantillies had been proposed as the \"Lost Thrones\". While the newborn Galactic Empire's interdiction of the Ash Worlds for weapons testing made further expeditions impossible, Harand and his students searched for proof in the records of the Tion Cluster. Henrietya Antilles' discovery of the Great Duinarbulon Mausoleum and translation of the tomes within proved Harand correct: the Antilles Map found in the Mausoleum showed that the planet Wyndigal 2 was once Huronom, while OHS3842-03 had been Astigone. Subsequent discoveries in the archives of Duinarbulon and on Dellalt confirmed that the Hutts had destroyed the Kiirium Reaches around 24,000 BBY, to gain a buffer zone between Hutt Space and the young Galactic Republic pushing into the Tion Cluster. Harand's theories on the Devouring were largely accepted by 40 ABY.\nHarand additionally wrote a travelogue entitled Travels Amid Strange Stars, detailing his journey around the Tion Cluster in search of an accurate, contemporary artistic depiction of Xim the Despot. His journey took him from Dellalt to Barancar to Soruus, where he dismissed the various statues of Xim as forgeries or inaccurate while dealing with unhelpful guides. On Dravione, he was unsuccessful in locating the remainder of a ruined statue of Xim, which was destroyed above the knees. He remained unsuccessful on Duinarbulon, Nuswatta and Desevro. Finally, on Xim's homeworld of Argai, largely unchanged since the Despot's day, he concluded that the native Argaians would likewise be little changed in appearance from Xim. After his groundcar broke down outside a cemetery near Sah Gosta on Argai, Harand noticed a disinterred skull, remarking that this symbol of death, and the symbol of Xim's empire, was as good a depiction of the Despot as any he would find.\nHarand was known for having a quick tongue and was renowned for his descriptive records of various civilizations. He had a rather grandiloquent writing style that was somewhat condescending to the people of the Tion Cluster: he regarded most of his tour guides as sullen or swindlers, and considered the Argaians \"squat and unlovely\", unchanged since the days of Xim.\nRather romantic, Harand reflected on the inevitability of death in Travels Amid Strange Stars, connecting it to the death's head symbol of Xim's empire. In that moment, he felt connected to the long-dead Despot.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Historian/Legends",
  "/wiki/Philosopher/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Ximology",
  "/wiki/Ash_Worlds/Legends",
  "/wiki/Xim%27s_empire",
  "/wiki/Travels_Amid_Strange_Stars",
  "/wiki/Xim/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Tionese_(people)",
  "/wiki/The_Devouring",
  "/wiki/Stalimur",
  "/wiki/Wakemeet",
  "/wiki/Barseg",
  "/wiki/Hutt_Empire",
  "/wiki/Third_Battle_of_Vontor",
  "/wiki/25,100_BBY",
  "/wiki/Henrietya_Antilles",
  "/wiki/Tion_Cluster/Legends",
  "/wiki/Radiation/Legends",
  "/wiki/Fission_bomb",
  "/wiki/Hutt/Legends",
  "/wiki/Wyndigal_2",
  "/wiki/OHS3842-03",
  "/wiki/Salin_Corridor/Legends",
  "/wiki/Columex/Legends",
  "/wiki/Trogan/Legends",
  "/wiki/Centares/Legends",
  "/wiki/Jabiim/Legends",
  "/wiki/Lucazec/Legends",
  "/wiki/Lantillies/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Great_Duinarbulon_Mausoleum",
  "/wiki/Antilles_Map",
  "/wiki/Duinarbulon",
  "/wiki/Dellalt/Legends",
  "/wiki/24,000_BBY",
  "/wiki/Hutt_Space/Legends",
  "/wiki/40_ABY",
  "/wiki/Barancar",
  "/wiki/Soruus_(planet)",
  "/wiki/Dravione",
  "/wiki/Nuswatta",
  "/wiki/Desevro/Legends",
  "/wiki/Argai",
  "/wiki/Groundcar/Legends",
  "/wiki/Sah_Gosta",
  "/wiki/Bone/Legends",
  "/wiki/Death/Legends",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/Xim_Week:_The_History_of_Xim_and_the_Tion_Cluster",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut",
  "/wiki/Star_Wars:_Force_and_Destiny_Core_Rulebook"
 ]
}