{
 "name": "Blizz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jawa"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Eternal Alliance",
      "Galactic Republic",
      "Task Force Nova",
      "Task Force Nova"
     ]
    }
   ]
  }
 ],
 "content": "Blizz was the nickname of a male Jawa who traveled with the Grand Champion of the Great Hunt, a bounty hunter during the Cold War.\nBlizz, like all Jawas, was born on Tatooine, but eventually Blizz and his clan were recruited by the traveling salvager Slam Streever to work as \"ferrets\"—individuals he could send into dangerous areas to scout for valuable salvage. Streever gave the Jawa the nickname \"Blizz\" after he kicked up a small snowstorm out of excitement upon first seeing the \"white sands\" on the planet Hoth. While on Hoth, Blizz and the salvage gang worked for the White Maw pirate Reneget Vause, until a fellow Jawa Jreely Toomb told their foreman that Blizz was stealing salvage under his coat, which resulted in Blizz being kicked out. He was imprisoned by the Chiss Ascendancy in the Dorn Base but repeatedly escaped from his cell.\nWhile imprisoned, Blizz assisted the Grand Champion of the Great Hunt in hunting down Reneget Vause, a blacklist bounty. As Vause viewed the Champion to be unworthy to fight, Blizz advised the Champion to take down Vause's captains to prove their worthiness. Afterwards, the Hunter persuaded Warden Khel to let Blizz join his crew. With the help of Mako he was able to track down Jreely and get most of his things back from him by sneaking into the White Maw camp and proceeding to act like Jreely, as the pirates couldn't tell the difference. Blizz also beat up Jreely, getting over his fear of him.\nDuring the Eternal Empire conquest in 3636 BBY, the Champion went missing. During the following five years in their absence, Blizz became his own bounty hunter and scavenger, reuniting with Jreely and forming his own crew out of Jawas. Five years after the Champions disappearance, Blizz and his crew were given a job contract from a person who only identified as a Jedi. Though Blizz was suspicious by his non-Jedi attitude and constantly correcting himself, Blizz took the job offer to find an old holoprojector. During the search, his \"white-sand crawler\" was damaged by the White Maw pirates. While working on repairs, Blizz was approached by the Outlander, who wanted to recruit Blizz into their Alliance against the Eternal Throne. Blizz agreed to help if the Outlander help Blizz with his crawler and his mission. After the Outlander helped with repairs, they gathered a team of Jawas to steal the holoprojector from the \"Ug-men\". Blizz and the Outlander recovered the holoprojector and Blizz sent it to the \"Jedi-man\". Afterward, Blizz and his crew traveled to Odessen to join the Outlander's Alliance.\nHis primary weapon was a blaster pistol, and utilize a Deflector shield for defense and a shoulder-mounted rocket launcher for ultra-offence. Blizz loved to go on adventures, make new friends, and be the center of attention. He disliked violence and mean people.\nBlizz is a companion character for the Bounty hunter class of Star Wars: The Old Republic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bliz",
  "/wiki/Blizz_Pinnix",
  "/wiki/Tatooine/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Eternal_Alliance",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Task_Force_Nova",
  "/wiki/Mako_(slicer)",
  "/wiki/Hunter_(individual)",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Slam_Streever",
  "/wiki/Planet/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/White_Maw",
  "/wiki/Reneget_Vause",
  "/wiki/Jreely_Toomb",
  "/wiki/Chiss/Legends",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Dorn_Base",
  "/wiki/Bounty/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Khel",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/3636_BBY",
  "/wiki/Languss_Tuno",
  "/wiki/Holoprojector/Legends",
  "/wiki/Alliance_Commander",
  "/wiki/Eternal_Throne",
  "/wiki/Ugnaught/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Deflector_shield",
  "/wiki/Rocket_launcher",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/The_Holonet",
  "/wiki/The_Art_and_Making_of_Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}