{
 "name": "Blue Two  (stormtrooper)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fel Empire",
      "Galactic Federation Triumvirate"
     ]
    }
   ]
  }
 ],
 "content": "Blue Two was the call-sign for a Trandoshan stormtrooper who served the Fel Empire and the Galactic Federation Triumvirate in 139 ABY. He was loyal to Empress Marasiah Fel and wore an orange pauldron on his stormtrooper armor. Blue Two was part of a platoon sent to accompany Ania Solo, who was tasked by Empress Fel with leading a mission rescue Jao Assam, who had been kidnapped by the rogue Sith Darth Wredd. Despite Ania's orders that her troopers not make any offworld communications following their landing on the floating world of Mala, Blue Two secretly sent Mala's coordinates to Empress Fel, who dispatched a force of Imperial Knights to hunt down Darth Wredd.\nHis absence was noticed by Ania's Mon Calamari friend Sauk who subsequently accused him of leading the One Sith to them during the Battle of the Floating World. However, Blue Two vehemently denied working for the One Sith and took great pains to stress his loyalty to Empress Fel. Blue Two's story was supported by Darth Wredd, who revealed that his sloppiness with rescuing Jao Assam had led the One Sith to Mala. Blue Two's fate is unknown during the battle, which ended with the apparent destruction of the One Sith and Darth Wredd's death.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Blue_Two/Legends",
  "/wiki/Trandoshan",
  "/wiki/Fel_Empire",
  "/wiki/Galactic_Federation_Triumvirate",
  "/wiki/Trandoshan/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/139_ABY",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Marasiah_Fel",
  "/wiki/Pauldron/Legends",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Ania_Solo",
  "/wiki/Jao_Assam",
  "/wiki/Sith/Legends",
  "/wiki/Darth_Wredd",
  "/wiki/Mala_(planet)",
  "/wiki/Imperial_Knight",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Sauk",
  "/wiki/One_Sith",
  "/wiki/Battle_of_the_Floating_World",
  "/wiki/Legacy_(2013)_17"
 ]
}