{
 "name": "Blyes",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mantellian Army",
      "Thirty-first Recon",
      "Thirty-first Recon"
     ]
    }
   ]
  }
 ],
 "content": "Blyes was a Human male Mantellian Trooper who served the Galactic Republic-backed Ord Mantell Central Authority as part of the Mantellian Army, and he fought against the Mantellian Separatist Movement in the Separatist War.\nBlyes was a Human male who served in the Galactic Republic's army during the time of the Cold War, a proxy conflict between the Sith Empire and the Republic. He held the rank of sergeant while deployed on the Republic planet of Ord Mantell during the Separatist War, a civil war where Republic forces aided the corrupt local government in fighting the anti-Republic Mantellian Separatist Movement.\nAt some point, the Separatists invaded Drelliad village, a critical point between the Republic base of Fort Garnik and Separatist-controlled territory, so Blyes and his squad from the Thirty-first Recon were assigned to scout the settlement but were ultimately engaged by an organized Separatist force near the village's entrance. During the exchange of fire, the sergeant attempted to contact headquarters on Fort Garnik due to the Separatists use of signal jammers within the village.\nDue to this, Blyes was forced to ask a passing by Republic-aligned individual to disable the signal jammers in order to re-establish communications between his forward recon team and the other Republic forces in order to report the situation. Accepting this mission, the individual disabled the three signal jammers—as well as killing several Separatists—and returned to the Sergeant who awarded his rescuer with a weapon from his stock.\nDuring his assignment to Drelliad village, Blyes wore blue armor and a matching ribbed helmet along with a pair of beige pants, standard to most Republic Army's soldiers stationed on Ord Mantell. He was armed with a dark blaster rifle which he kept strapped to his back when not in use.\nBlyes is a non-player character from the massively multi-player online role playing game Star Wars: The Old Republic released by BioWare in 2011. He is voiced by Nolan North. He is one of the first NPCs encountered by players of the Trooper or Smuggler class due to his location right next to the point at which each class starts when first created. It is not possible for players of the Imperial faction to interact with Blyes as there is currently no way Imperial characters can travel to Ord Mantell.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mantellian_Army",
  "/wiki/Thirty-first_Recon",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Mantellian_Trooper",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ord_Mantell_Central_Authority",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Separatist_War",
  "/wiki/Republic_Army",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sergeant/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Drelliad_village",
  "/wiki/Fort_Garnik",
  "/wiki/Jammer",
  "/wiki/Canon",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Nolan_North",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Army/Legends"
 ]
}