{
 "name": "BN-749",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Lothal garrison",
      "Stormtrooper Corps",
      "Lothal garrison"
     ]
    }
   ]
  }
 ],
 "content": "BN-749 was the designation of a human male stormtrooper who served in the Imperial Stormtrooper Corps on the planet Lothal. He was stationed on the Sentinel-class landing craft Lagos which was used to transport droid couriers to communications ships in orbit while all long-distance communication on the planet was disabled. When a group of rebels replaced one of the couriers with their own droid C1-10P, BN-749 ignored the rebel droid's lack of an escort and allowed it onboard the Lagos. The shuttle then traveled to an Arquitens-class command cruiser in orbit, where C1-10P successfully discovered the location of the Imperial prisoner Kanan Jarrus and escaped.\nThe human male stormtrooper designated BN-749 served the Galactic Empire's Stormtrooper Corps on the planet Lothal around five years before the Battle of Yavin. After a group of rebels active on Lothal managed to hijack the planet's Imperial Communications Center and use it to broadcast anti-Imperial propaganda, Grand Moff Wilhuff Tarkin had the structure destroyed, disabling all long-distance communication on Lothal. This forced the Imperials on Lothal to start using Imperial Press Corps astromech droids as couriers. BN-749 was assigned to the Sentinel-class landing craft Lagos, which was responsible for transporting the droid couriers from Lothal's surface to communications ships in orbit.\nHoping to learn the location of their crew mate Kanan Jarrus who had been captured by the Empire, the rebels who had hijacked the tower captured one of the Empire's droid couriers and stunned its escort. They replaced the Imperial droid, who was designated 264, with their own astromech, the C1-series astromech droid C1-10P, who was painted to resemble the courier. When C1-10P arrived at the landing bay where the Lagos was parked, BN-749 and another stormtrooper were standing guard at the ship's entry ramp. As the astromech approached the other stormtrooper questioned why the astromech was not accompanied by an escort, but as the Lagos was already running late BN-749 ignored the issue and allowed the droid onboard. The Lagos then transported the two stormtroopers and C1-10P to a communications vessel in orbit, where the droid managed to download information regarding Jarrus's whereabouts before escaping through an airlock into space where he was picked up by the rebel vessel Ghost.\nBN-749 was willing to ignore C1-10P's lack of an escort due to the fact the Lagos was already running late.\nBN-749 wore standard stormtrooper armor and carried an E-11 blaster rifle.\nBN-749 first appeared in the Star Wars Rebels episode Rebel Resolve, which aired in 2015. This stormtrooper was voiced by Keith Szarabajka, who voices Cikatro Vizago.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Lothal_garrison",
  "/wiki/Stormtrooper",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Sentinel-class_landing_craft",
  "/wiki/Lagos_(Sentinel-class)",
  "/wiki/Droid",
  "/wiki/Starship",
  "/wiki/Spectres",
  "/wiki/264",
  "/wiki/C1-10P",
  "/wiki/Tellstar",
  "/wiki/Arquitens-class_command_cruiser",
  "/wiki/Kanan_Jarrus",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Raid_on_the_communications_tower",
  "/wiki/Imperial_Communications_Center",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Imperial_Press_Corps",
  "/wiki/Astromech_droid",
  "/wiki/C1-series_astromech_droid",
  "/wiki/Ghost",
  "/wiki/Stormtrooper_armor",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/Blaster_rifle",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Rebel_Resolve",
  "/wiki/2015",
  "/wiki/Keith_Szarabajka",
  "/wiki/Cikatro_Vizago",
  "/wiki/Battle_to_the_End",
  "/wiki/2016",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Call_to_Action"
 ]
}