{
 "name": "Bo Keevil",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dorin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ace Squadron",
      "Team Colossus"
     ]
    }
   ]
  }
 ],
 "content": "Bo Keevil was a Kel Dor male who served as a pilot in Ace Squadron, a squadron charged with defending the Colossus fueling station on the planet Castilon. Keevil and his fellow pilots also doubled as racers and escorted shipments. Following the First Order's occupation of the Colossus, Keevil helped Team Colossus in helping the Colossus escape into hyperspace.\nDuring the New Republic era, Bo Keevil was a member of Ace Squadron, a squadron of starfighter pilots who defended the Colossus refueling platform on the planet Castilon. Keevil's fellow pilots included squadron leader Hype Fazon, Torra Doza, Freya Fenris, and Griff Halloran. Keevil and his fellow pilots also took part in the Colossus' many races. He owned a racer called the Yellow Ace.\nKeevil and his fellow Aces resided in the luxurious Doza Tower. When the undercover Resistance spy Kazuda Xiono accidentally challenged Ace Squadron to a race, Keevil's face appeared on a hologram panel.\nLater, Keevil and his fellow Ace pilots responded to a raid by Kragan Gorr's Warbird gang. The pirates had the upper hand until Xiono managed to jam their communications. This jamming allowed the Ace pilots to gain the upper hand and drive the pirates away. Keevil also shot down a pirate starfighter piloted by an individual wearing a stormtrooper helmet.\nKeevil and his fellow Ace pilots were in the Aces' Lounge when the mechanics Xiono and Tamara Ryvora visited Doza Tower as guests of Fazon.\nWhile Keevil and his fellow Aces were escorting a shipment, Gorr, at the behest of the First Order, launched a second raid on the Colossus. Though the pirates were rebuffed, this raid convinced Captain Imanuel Doza, the owner of the Colossus, to reconsider talks with the First Order.\nKeevil and the other Aces were socializing at the Aces' Lounge when Xiono visited Doza Tower as a guest of Captain Doza's daughter, Torra. Xiono was on a secret mission to spy on a meeting between Captain Doza and Commander Pyre of the First Order.\nKeevil took part in a race with his fellow Aces. Torra initially took the lead but consumed up her booster fuel too early. This allowed Hype to take the lead and maintain his title as the top racer in the Aces.\nLater, Keevil and his fellow Aces took part in a mission to escort an incoming freighter. When the freighter had trouble landing due to a pirate attack, the Aces had to work together to slow down its descent.\nDuring the Bibo incident, Bo and his fellow Aces defended the Colossus against Bibo's mother, a rokkna sea monster. Despite their efforts and the assistance of Kaz, they were unable to repel the rokkna. One of the rokkna's tentacles collided with the steering vanes of Bo's racer Yellow Ace, causing it to crash. In the end, Kaz's friend Neeku Vozo managed to end the rokkna's rampage by returning Bibo to his mother.\nFollowing the kidnapping of their fellow Ace Torra Doza, Bo Keevil and his fellow pilots were dispatched in pursuit of her kidnappers. Torra was rescued by Major Elrik Vonreg, who convinced Captain Pyre to accept First Order protection.\nKeevil was a male Kel Dor with yellow skin. He was described as a soft-spoken, superb, and confident pilot. He preferred to let his racer, Yellow Ace, do the talking for him.\nBo Keevil flew a customized \"Changeling\" Mark 71NB, the Yellow Ace, and owned the droid SC-X2. Due to his Kel Dor anatomy, he wore an antiox mask.\nBo Keevil is a character created for the animated series Star Wars Resistance. He speaks so infrequently that the \"Meet the Aces\" featurette does not list his voice actor, unlike the other Aces. His first speaking role was in the short \"Sixty Seconds to Destruction,\" voiced by Dave Filoni.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Resistance_Season_One",
  "/wiki/Star_Wars_Resistance_Season_Two",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Dorin",
  "/wiki/Kel_Dor",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Ace_Squadron",
  "/wiki/Team_Colossus",
  "/wiki/Pilot",
  "/wiki/Squadron",
  "/wiki/Colossus",
  "/wiki/Castilon",
  "/wiki/First_Order",
  "/wiki/Occupation_of_the_Colossus",
  "/wiki/Battle_of_Castilon",
  "/wiki/Hyperspace",
  "/wiki/New_Republic_era",
  "/wiki/Hype_Fazon",
  "/wiki/Torra_Doza",
  "/wiki/Freya_Fenris",
  "/wiki/Griff_Halloran",
  "/wiki/Yellow_Ace",
  "/wiki/Doza_Tower",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Kazuda_Xiono",
  "/wiki/Race_between_Kazuda_Xiono_and_Torra_Doza",
  "/wiki/Hologram",
  "/wiki/Raid_on_the_Colossus",
  "/wiki/Kragan_Gorr",
  "/wiki/Warbird_gang",
  "/wiki/Starfighter",
  "/wiki/Stormtrooper",
  "/wiki/Aces%27_Lounge",
  "/wiki/Tamara_Ryvora",
  "/wiki/Second_raid_on_the_Colossus",
  "/wiki/Captain",
  "/wiki/Imanuel_Doza",
  "/wiki/Second_mission_to_Doza_Tower",
  "/wiki/Commander",
  "/wiki/Pyre",
  "/wiki/Bibo_incident",
  "/wiki/Bibo%27s_mother",
  "/wiki/Rokkna",
  "/wiki/Neeku_Vozo",
  "/wiki/Bibo",
  "/wiki/Kidnapping_of_Torra_Doza",
  "/wiki/Major",
  "/wiki/Elrik_Vonreg",
  "/wiki/%22Changeling%22_Mark_71NB",
  "/wiki/SC-X2",
  "/wiki/Antiox_mask",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Sixty_Seconds_to_Destruction",
  "/wiki/Dave_Filoni",
  "/wiki/The_Recruit",
  "/wiki/The_Triple_Dark",
  "/wiki/Fuel_for_the_Fire",
  "/wiki/The_High_Tower",
  "/wiki/Synara%27s_Score",
  "/wiki/Secrets_and_Holograms",
  "/wiki/The_Need_for_Speed",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/All_Aces_Battle_Royale_(comic)",
  "/wiki/Star_Wars_Adventures_(2017)_16",
  "/wiki/Bibo_(episode)",
  "/wiki/The_Doza_Dilemma",
  "/wiki/The_Disappeared",
  "/wiki/Descent_(episode)",
  "/wiki/No_Escape:_Part_2",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/Live_Fire",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/The_Engineer",
  "/wiki/Rendezvous_Point_(episode)",
  "/wiki/The_Voxx_Vortex_5000",
  "/wiki/Kaz%27s_Curse",
  "/wiki/Breakout",
  "/wiki/The_Mutiny",
  "/wiki/The_New_World",
  "/wiki/No_Place_Safe",
  "/wiki/The_Escape",
  "/wiki/Star_Wars_Resistance_Racer",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Meet_the_Resistance",
  "/wiki/Star_Wars_Insider_185",
  "/wiki/Star_Wars_Resistance:_Meet_the_Pilots",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2019_Topps_Star_Wars_Resistance_Surprise_Packs",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/The_Star_Wars_Book",
  "/wiki/StarWarsKids.com",
  "/wiki/Databank_(website)"
 ]
}