{
 "name": "Bob  (stormtrooper)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "Bob was a Human male stormtrooper who served the Galactic. Sometime between 0 ABY and 3 ABY, Bob stole the diary of the Sith Lord Darth Vader. He read it during a lunch break with fellow stormtrooper Kjazhed-Uhl, with whom he discussed the anecdotes described in it, including one where Vader's birthday was forgotten by the stormtroopers. After reading the diary, Bob suggested that Vader needed a creative outlet to deal with his emotional issues. Later, one of the two stormtroopers wished Vader a happy birthday.\nBob was a stormtrooper who served the Galactic Empire. During his service he was acquainted with another stormtrooper, Kjazhed-Uhl. Sometime between 0 ABY and 3 ABY, Bob was summoned to remove a corpse from the quarters of the Sith Lord Darth Vader, whom he served under. While there, Bob noticed Vader's diary from under a pile of magazines, and stole it. Given the messy state of the room, Bob believed its absence would go unnoticed, and hoped to read it over a weekend while Vader was away. Bob began reading during a lunch break in a mess hall, where Kjazhed-Uhl encountered him.\nAfter discussing Kjazhed-Uhl's weekend plans to visit his family, Bob revealed to his colleague that he was reading Vader's diary. Kjazhed-Uhl was shocked and called Bob foolish for taking it, but after Bob explained his reasoning for the book going unnoticed, Kjazhed-Uhl gave in and decided to read it with Bob. The stormtroopers opened to a page where Vader had written about receiving a new helmet, where Bob observed that he had misspelt the word \"nightmare\" as \"nitemare.\" Kjazhed-Uhl claimed that it was a word that could be spelled multiple ways, leading to several glances between the two stormtroopers. Bob suggested that they skip to another page, finding a section where Vader discussed his apprehension about meeting Luke Skywalker. At the end of the passage Kjazhed-Uhl wondered who \"Luke Skywalter\" was, and Bob guessed that he was Vader's son based on the writing.\nBob then noticed several drawings by Vader in the diary, and commented on his terrible art style. Kjazhed-Uhl suggested that they flip through to see if they were mentioned, so Bob skipped over sections on death and destruction until he found a section on stormtroopers. Reading through it, they discovered that Vader had recently had his birthday forgotten by the stormtroopers, which caused an emotional breakdown for him. Bob commented that he was unaware Vader even had a birthday, which Kjazhed-Uhl said was obvious as everyone had a birthday. Bob wondered what Vader's first name was, and Kjazhed-Uhl speculated that it was Corey. Bob stated that Vader needed to find an outlet to deal with his emotions, such as therapy, painting, or dancing. Kjazhed-Uhl disagreed, saying the Sith Lord needed to directly confront his issues.\nTheir conversation was interrupted when an alarm sounded and another stormtrooper informed Bob and Kjazhed-Uhl that Vader had called an emergency meeting, as an intruder was suspected to be onboard. The stormtroopers put on their helmets to attend Vader's briefing, where he told them that speed was of the essence and that the intruder was to be brought to him. After the briefing, one of the stormtroopers walked up to Vader and discreetly wished him a happy birthday, giving him pause.\nOut of curiosity, Bob was willing to steal Vader's diary from his quarters, despite Vader's reputation for executing subordinates. He was willing to share his discovery with Kjazhed-Uhl. Bob considered therapy or creative outlets as a possible solution for Vader's emotional turmoil after reading his diary. A Human male, Bob had dark skin, brown eyes, and curly black hair in an afro style.\nBob wore white stormtrooper armor, and at the time of the lunch break where he read Vader's diary he had a purple afro comb in his hair. During the break he had an apple and a Mega Go juice box sitting on the mess hall table.\nBob appeared in \"Lunch Break,\" a comic written and illustrated by Jonathan Adams and released in the sixteenth issue of Star Wars Tales, published on June 25, 2003.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bob_(disambiguation)",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Time/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Vader%27s_diary",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Kjazhed-Uhl",
  "/wiki/Birthday/Legends",
  "/wiki/Death/Legends",
  "/wiki/Helmet/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Apple",
  "/wiki/Mega_Go",
  "/wiki/Lunch_Break",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Jonathan_Adams",
  "/wiki/Star_Wars_Tales_16",
  "/wiki/Star_Wars_Tales",
  "/wiki/June_25",
  "/wiki/2003",
  "/wiki/Duel_on_Cloud_City/Legends",
  "/wiki/Vader%27s_Quest_1",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Marvel_Comics"
 ]
}