{
 "name": "Bod%C3%A9_Leobund_XI",
 "display_name": "Bodé Leobund XI",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Mecetti"
     ]
    }
   ]
  }
 ],
 "content": "Bodé Leobund XI was the High Lord of Tapani House Mecetti during the Galactic Civil War. Sir Tazur Pheron was Lord Leobund's grand-nephew.\nThe Human male Bodé Leobund XI was born a member of the powerful Noble House of Mecetti in the Tapani sector during the reign of the Galactic Republic. During Leobund's lifetime his father ruled as High Lord of the Mecetti, although he was an inept ruler, and allowed the rival House Melantha to grow more powerful than his own House. In around the year 21 BBY, the High lord was poisoned and died, allowing Leobund to ascend and take his father's place as High Lord. The new ruler was amongst those suspected of his father's murder but his guilt was never proved, despite rumors persisting. Leobund did not waste his new power, and quickly restored Mecetti's dominance over Melantha, making connections with House Reena and House Calipsa which gave his house enough votes in the Great Council to control the sector. Leobund and the three house coalition remained in power for at least twenty-four years, in which time the Galactic Empire rose to power and removed House Pelagia, another rival of the Mecettis, from power. Pelagia, along with the Republic, had previously held Leobund and Mecetti's power over the sector in check but with them gone the Empire now took their place as an obstacle in the House's path to absolute power.\nLeobund was prevented against taking aggressive action against any of House Mecetti's rivals as he knew any disturbance would be used as pretext by the Empire to take over the sector in order to \"maintain the peace\". As such he was forced to make sure that peace was kept between the houses while still keeping them divided to ensure Mecetti stayed on top. In around 7 BBY, Leobund introduced a ruling that nationalised all businesses located on Mecetti controlled worlds, giving him power over several mega-corporations and hugely increasing the assets held by his House. By around 3 ABY some within Mecetti had begun to question this nationalization, due to the fact that the house now had large problems attracting external investors. By this time period Leobund made sure Mecetti maintained a strong navy and spynet, the latter of which he placed under the control of Lady Estalle Balis. Unbeknownst to Leobund Balis was secretly a member of the Mecrosa Order, and made sure no news concerning the Order reached her employer's ears, attributing any action they took to other houses in her reports.\nBodé Leobund XI was first mentioned in 1997 in the gamemaster guide included in Lords of the Expanse, a supplement written by Paul Sudlow and Chris Doyle for Star Wars: The Roleplaying Game by West End Games.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_Mecetti",
  "/wiki/High_Lord",
  "/wiki/Tapani",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Sir",
  "/wiki/Tazur_Pheron",
  "/wiki/Tapani_Noble_Houses",
  "/wiki/Tapani_sector/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/House_Melantha",
  "/wiki/Standard_year/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Death/Legends",
  "/wiki/House_Reena/Legends",
  "/wiki/House_Calipsa",
  "/wiki/Great_Council_(Tapani_Federation)",
  "/wiki/Sector/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/House_Pelagia",
  "/wiki/7_BBY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Mecetti_House_Guard",
  "/wiki/Lord/Legends",
  "/wiki/Estalle_Balis",
  "/wiki/Mecrosa_Order",
  "/wiki/Ear/Legends",
  "/wiki/1997",
  "/wiki/Lords_of_the_Expanse",
  "/wiki/Paul_Sudlow",
  "/wiki/Chris_Doyle",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/The_Mecetti_File",
  "/wiki/Tapani_Sector_Instant_Adventures",
  "/wiki/Player%27s_Guide_to_Tapani",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Brezwalt_III",
  "/wiki/Galactic_Standard_Calendar"
 ]
}