{
 "name": "Bodhi Rook",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Jedha"
     ]
    },
    {
     "name": "Born",
     "values": [
      "25 BBY",
      "Jedha"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Scarif"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.72 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic",
      "Rogue One",
      "Rogue One"
     ]
    }
   ]
  }
 ],
 "content": "Bodhi Rook was a human male from Jedha who served as a cargo pilot for the Galactic Empire prior to the Galactic Civil War. He graduated from the Terrabe Sector Service Academy, he served as a shuttle pilot. In 0 BBY, Rook defected to the Alliance to Restore the Republic, intending to deliver the Rebellion a message from the Imperial scientist Galen Erso. However, he was captured by the Partisans, a different rebel group, who brought him to Jedha for interrogation. After being rescued by Alliance Intelligence officer Cassian Andor and Jyn Erso, he fought alongside a group of rebels during the Battle of Scarif, where he was killed.\nBodhi Rook was born and raised on Jedha. As a youth, he had two run-ins with the law. One was for unlawful wagering on sporting events and the other was unsafe operation of an airspeeder. He lived with his mother while growing up. Usually, she forbade him from using a knife in the kitchen, but in one instance, she made an exception, showing him how to cut a vegetable stalk. At some point he developed a crush on someone when he was on Bamayar, but when he revealed his feelings for the individual, he was rejected.\nHe enlisted in the Galactic Empire and had aspirations to become an Imperial starfighter pilot. He entered Terrabe Sector Service Academy in 7 BBY and pursued flight training for two years, but due to insufficient test scores, Rook did not qualify for admission into the starfighter program. Two years later, Rook was granted the rank of ensign and eventually cleared to work in cargo shuttles for the transport of Imperial documents and artifacts.\nAt some point during his career, he had to fly away from a group of rebels shooting at his shuttle, even as the shuttle itself was already in flames.\nRook defected from the Empire after being entrusted with an important message by Galen Erso, an Imperial scientist who worked on the Death Star project. Erso told him to seek out Saw Gerrera, a resistance fighter. Upon his return to Jedha, the Empire placed a 75,000-credit reward for his capture. Although he found Gerrera, the rebel was initially distrustful of Rook's motives, believing the message was meant to lure him into a trap. In an attempt to discover if Rook was being truthful or not, Gerrera subjected him to a torturous experience involving a Mairan named Bor Gullet that could sense if he was telling the truth, at the cost of a temporary loss of Rook's sanity.\nRook subsequently met the rebel operative Cassian Andor, who managed to help him regain his composure. Rook also met with Galen's daughter, Jyn Erso, who learned of the truth of Rook's defection after seeing the message her father sent to her. Together with Cassian, Jyn, the blind warrior Chirrut Îmwe, and the assassin Baze Malbus, Rook escaped Jedha as the Death Star destroyed Jedha City with its superlaser. While traveling aboard Cassian's U-wing ship, Bodhi told Cassian and Jyn that Galen was at the Imperial flight station on the stormy planet of Eadu.\nDespite the stormy conditions, Cassian and his reprogrammed Imperial security droid K-2SO managed to land their U-wing near the Imperial flight station. Bodhi, along with Chirrut, Baze, and K-2SO, stayed aboard while Cassian went to assassinate Galen. Jyn followed Cassian in an attempt to stop him and the two were caught up in the Rebel Alliance's raid on the Eadu flight station. Bodhi and his companions managed to find the Imperial cargo shuttle SW-0608 and used it to save Jyn and Cassian from being killed by stormtroopers. The rebels then fled offworld to the rebel base on Yavin 4.\nBodhi attended a meeting of the Alliance High Command to discuss the threat posed by the Death Star. Bodhi also listened to Jyn's impassioned speech urging the rebels not to give up. Later, he accompanied Cassian, Jyn, K-2SO, Chirrut, and Baze along with several members of the Marine Corps on an unsanctioned mission to steal the Death Star plans from the Imperial security complex on the planet Scarif. For that mission, the rebels used the Imperial cargo shuttle they had stolen on Eadu. Rook and K-2SO served as the team's pilots. When Alliance air traffic control requested their callsign, Rook replied, \"Rogue One,\" but was told there was no such unit. K-2S0 then responded that there was one now and took the ship into space.\nAfter arriving above Scarif, Rook and his Rogue One comrades found the planet enveloped by a deflector shield generated by a Shield Gate. Scarif was also defended by two Imperial Star Destroyers. Rook notified gate control and requested a landing pad. Since their arrival was not scheduled, Rook told the gate officer that they had been rerouted from Eadu and ordered K-2SO to transmit the clearance codes. After the Imperials accepted their clearance code, the rebels landed their shuttle at the Imperial security complex's Landing Platform Nine.\nWhen an Imperial inspection crew consisting of an officer, technician, and two stormtroopers boarded the cargo shuttle, Bodhi and K-2SO greeted them. They led them down into the cargo bay where they were taken out by the other rebels. While Cassian, Jyn, and K-2SO infiltrated the security complex in order to reach the data vault and steal the plans, Rook remained aboard the cargo ship SW-0608 to stay in contact with Rebel Alliance command on Yavin 4. Baze, Chirrut, and the Rebel Marines then staged a diversionary attack to draw the base's garrison away from the data vault. Though not an active part of the fighting, he provided support by confusing Imperial officers with false reports on rebel movements throughout the base, delaying or redirecting Imperial reinforcements.\nDuring the Battle of Scarif, Cassian tasked Bodhi with getting a message out. The pilot bravely ran out with a cable backpack to connect SW-0608 to a landing pad comms relay. Rook contacted Admiral Raddus's fleet to tell them that they needed to destroy the Shield Gate in order to transmit the Death Star plans to them. After the broadcast, a shoretrooper threw a C-25 fragmentation grenade into the shuttle. Bodhi Rook was killed in the ensuing explosion.\nThanks in part to Bodhi's efforts and sacrifice, Jyn was able to use the Imperial security complex's satellite to transmit the Death Star plans offworld. Despite Grand Moff Tarkin's efforts to destroy the Scarif base, the rebels managed to transmit the plans to the rebel flagship Profundity. Princess Leia Organa then fled with the plans aboard the rebel corvette Tantive IV, setting the stage for the events leading up to the Battle of Yavin.\nBodhi Rook was a human male with brown eyes, black hair and tan skin. He was a very experienced pilot, but had a tendency to be tense and anxious. During his time in the Empire, he was trained to fly all kinds of Imperial cargo vessels. These included Lambda and Zeta-class shuttles. Bodhi took up gambling with fellow Imperial pilots to make ends meet and distract him from the evils of the Empire. He bet on Odupiendo races which resulted in him losing credits by the thousand, but acquiring a keen observational eye for speed and tactics. He also stole Weeteef Cyu-Bee's candy.\nBodhi Rook is portrayed by Riz Ahmed in the Star Wars Anthology Series film Rogue One: A Star Wars Story. Ahmed's casting in the film was first announced on August 15, 2015. At that time, the first photo of the character was released as well. His first name \"Bodhi\" is Sanskrit and Pāli for \"enlightenment\" or \"awaking\". In Buddhism, Bodhi is the final enlightenment that ends transmigration and leads to Nirvana.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rook",
  "/wiki/Pilot",
  "/wiki/Bodhi",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One_Adaptation_1",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Special:Upload",
  "/wiki/Jedha",
  "/wiki/25_BBY",
  "/wiki/0_BBY",
  "/wiki/Scarif",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rogue_One",
  "/wiki/Galactic_Civil_War",
  "/wiki/Terrabe_Sector_Service_Academy",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Partisans",
  "/wiki/Alliance_Intelligence",
  "/wiki/Officer",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Jyn_Erso",
  "/wiki/Battle_of_Scarif",
  "/wiki/Reproduction",
  "/wiki/Youngling",
  "/wiki/Airspeeder",
  "/wiki/Bamayar",
  "/wiki/Starfighter",
  "/wiki/7_BBY",
  "/wiki/Standard_year",
  "/wiki/Military_rank",
  "/wiki/Ensign",
  "/wiki/Shuttle",
  "/wiki/Transport",
  "/wiki/Scientist",
  "/wiki/Project_Stardust",
  "/wiki/Saw_Gerrera",
  "/wiki/Credit",
  "/wiki/Torture",
  "/wiki/Mairan",
  "/wiki/Bor_Gullet",
  "/wiki/Chirrut_%C3%8Emwe",
  "/wiki/Assassin",
  "/wiki/Baze_Malbus",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Jedha_City",
  "/wiki/Superlaser",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Eadu_Flight_Station",
  "/wiki/Planet",
  "/wiki/Eadu",
  "/wiki/KX-series_security_droid",
  "/wiki/K-2SO",
  "/wiki/Mission_to_Eadu",
  "/wiki/Zeta-class_Heavy_Cargo_Shuttle",
  "/wiki/SW-0608",
  "/wiki/Death",
  "/wiki/Stormtrooper",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Alliance_High_Command",
  "/wiki/Marine_Corps",
  "/wiki/Death_Star_plans",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/Callsign",
  "/wiki/Realspace",
  "/wiki/Deflector_shield",
  "/wiki/Shield_Gate",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Unidentified_Shield_Gate_officer",
  "/wiki/Landing_Platform_Nine",
  "/wiki/Imperial_ground_crew",
  "/wiki/Imperial_officer",
  "/wiki/Technician",
  "/wiki/Scarif_vault",
  "/wiki/Scarif_Deployment",
  "/wiki/Cable_Backpack",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Coastal_defender_stormtrooper",
  "/wiki/C-25_fragmentation_grenade",
  "/wiki/Satellite",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Flagship",
  "/wiki/Profundity",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Corvette",
  "/wiki/Tantive_IV",
  "/wiki/Battle_of_Yavin",
  "/wiki/File:BodhiRook-Message.ogg",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Odupiendo",
  "/wiki/Weeteef_Cyu-Bee",
  "/wiki/Riz_Ahmed",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/August_15",
  "/wiki/2015",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Lost_Stars_(webcomic)",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_2",
  "/wiki/Rogue_One_Adaptation_3",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Rogue_One_Adaptation_5",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Images_of_Bodhi_Rook",
  "/wiki/StarWars.com",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Rogue_One",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_169",
  "/wiki/Star_Wars",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Art_of_Coloring:_Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Top_Trumps",
  "/wiki/Top_Trumps:_Star_Wars:_Rogue_One",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Rebel_Alliance_Conversion_Kit",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Star_Wars_Helmet_Collection_55",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_56",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/The_False_Economies_of_Scale",
  "/wiki/Star_Wars_Insider_192",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/June_23",
  "/wiki/2016",
  "/wiki/January_29",
  "/wiki/2019",
  "/wiki/August_9"
 ]
}