{
 "name": "Bodo_Baas",
 "display_name": "Bodo Baas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Krevaaki"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Bodo Baas's Master"
     ]
    }
   ]
  }
 ],
 "content": "Bodo Baas was a male Krevaaki Jedi Master. Living among a group of Jedi in the Adega system around 600 BBY, he inherited a holocron known as the Tedryn Holocron from his ancestor Vodo-Siosk Baas. Baas added his own experiences and knowledge to the holocron, becoming its holographic gatekeeper and a teacher of future Jedi who would use it. He served as a diplomat in this time, participating in missions to the Force sects of the Zeison Sha and Matukai, each of which he attempted to convince to ally with the Jedi Order, ultimately unsuccessfully. Baas was executed by Emperor Palpatine in 19 BBY, during the Great Jedi Purge.\nNonetheless, his teachings and personality remained preserved in the Tedryn Holocron, which Palpatine later acquired. The Emperor, in turn, had it stolen from him by Leia Organa Solo, sister to the Jedi Luke Skywalker. Baas warned Solo of those who, like her brother, had toyed with the dark side of the Force, telling her stories of fallen Jedi like Ulic Qel-Droma. He later revealed to Skywalker and his New Jedi Order information on the past Jedi and Sith. Skywalker used the holocron as a teaching device until it was destroyed by the spirit of the Dark Lord of the Sith Exar Kun.\nA Krevaaki male, Bodo Baas was descended from Jedi Master Vodo-Siosk Baas. He was trained in the ways of the Jedi by a master who had lived since approximately 1000 BBY. Around 600 BBY, Baas was one of a group of Jedi who lived and served in the Adega system, and who took it upon themselves to create records of Jedi history and teachings for future Jedi to learn from. In time he became a Jedi Master and inherited the Tedryn Holocron, a holocron that had once belonged to Vodo-Siosk and had been passed down through generations of Jedi. By the time Baas received the holocron, it was already recorded with huge amounts of data, which made it difficult to deal with, even for a skilled user. Baas solved this problem by reorganizing every single recording.\nHe also added his own stories, including the death of his ancestor Vodo-Siosk and the rise and fall of the Dark Lord of the Sith Darth Ruin, to the wealth of knowledge in the holocron. By recording his personality into the holocron, Baas became its primary gatekeeper, an interactive holographic guide to the holocron that could transmit the knowledge contained within and behaved as Baas would. As primary gatekeeper, Baas was the first individual encountered by those accessing the holocron; to speak to the personalities of other masters in the holocron and hear their teachings, a greater level of wisdom was required. At some point Baas acquired a belt, which in the following years would be passed down to various members of the Jedi Order, eventually arriving in the hands of the Jedi Ashka Boda.\nWhen the Jedi learned of the existence of a Force sect known as the Zeison Sha on the planet Yanibar, a diplomatic envoy that included Baas was dispatched in 580 BBY, following years of planning and preparations, to that world to convince them to join forces with the Jedi. As the Zeison Sha did not approve of the Jedi tradition of separating children from their families, they would not meet with the diplomatic group until the Jedi agreed not to attempt to speak to their children, and only then with reluctance. Baas and the other observed a training session in which the Zeison Sha demonstrated their proficiency with telekinesis and their special weapon, the discblade. Baas politely debated with the Zeison Sha on whether their philosophy of self-reliance could lead to the dark side of the Force, and though they acknowledged that in some cases it had, for the most part they found self-sufficiency beneficial. Ultimately they would not relinquish their independence, and Baas and the others regretfully left Yanibar without succeeding in their mission.\nShortly thereafter, the Jedi Council sought an alliance with another Force sect, the Matukai. Upon learning that a Matukai named Mendor Typhoons had defeated a pirate gang near the world of Ord Radama, Baas and the others arranged for a meeting in orbit of Ord Radama. Baas spoke to Typhoons, who believed that his own methods of training the Force were more effective than those of the Jedi, and Baas was unable to convince him to join forces any more than the Zeison Sha. Baas recommended that the Jedi allow the Matukai to exist autonomously, as long as they did not fall to the dark side.\nBaas lived for almost six hundred years afterward, becoming a famous Jedi, and his knowledge in the Tedryn Holocron continued to be of use to the Jedi over the course of his life. Baas's words were even listened to by the Jedi Council, warning them of the dangers inherent in training new Jedi. When the Great Jedi Purge began in 19 BBY, the newly risen Galactic Emperor Palpatine had Baas executed. By this time, the Tedryn Holocron had come into the possession of a Jedi named Ashka Boda, and after killing him, Palpatine seized control of it, though he was unable to reach the deepest levels, accessible only to Jedi Masters dedicated to the light.\nIn 10 ABY, New Republic member Leia Organa Solo was captured by Palpatine on his throne world of Byss while attempting to rescue her brother Luke Skywalker, who had decided to join the dark side in order to defeat the Emperor. Palpatine showed Solo the Tedryn Holocron, and Solo spoke to Baas, who began telling her of those who, like her brother, had attempted to destroy the dark side from within. Solo stole the holocron and escaped Byss on her husband's ship, the Millennium Falcon. Aboard the Falcon, Solo reactivated the holocron and listened as Baas told the tale of the fallen Jedi Ulic Qel-Droma. She later accessed the holocron to ask Baas of the future of her brother. Though Baas stated that the Force could allow one to view the future, he was unable to divine Skywalker's, finding it cloaked in shadow. He did, however, tell her a prophecy written down by his master a thousand years before, predicting Skywalker's fall to the dark side and her own situation. Baas's words drove Solo to redeem Skywalker and defeat Palpatine.\nAs Skywalker went on to found a New Jedi Order, the holocron remained a resource he relied on. When Skywalker set about the galaxy finding Jedi recruits, Solo consulted with it and learned that she needed to seek out the Jedi-in-exile Vima-Da-Boda. It also suggested to Skywalker that he find Jedi artifacts on the deserted Jedi world of Ossus, and after Skywalker returned to the New Republic base with new Jedi recruit Kam Solusar in tow, they consulted the holocron again. Solusar asked Baas for advice for the fledgling New Jedi Order, and Baas pointed them again to Ossus. In time Skywalker found further Jedi students and created an academy on the moon Yavin 4; one of his pupils, Tionne, used the Tedryn Holocron as a resource for studying Jedi history. When Skywalker encountered a Force power he did not know demonstrated by another of his students, Corran Horn, he consulted with Baas; Baas explained to Horn and Skywalker the ability, Alter Mind, as well as a primer in general Force techniques. Skywalker also referred to Baas when seeking information on Exis Station, another ancient Jedi site from where he hoped to recover artifacts.\nUnbeknownst to the Jedi, Yavin 4 was the home of the spirit of the long-dead Dark Lord of the Sith Exar Kun, and Kun soon began to prey on the students in 11 ABY, beginning with a man named Gantoris, whom he killed. Tionne spoke with Baas about her grief and horror over Gantoris' death, and Baas counseled her on the Jedi Code, confronting her on the nature of the grief she felt. When Horn later joined them, Baas told them about Keiran Halcyon, a Jedi ancestor of Horn's. Tionne, trying to understand Gantoris' death, inquired Baas about the history of Yavin 4. Baas told them of Kun and the Great Sith War that Kun had fought in. Shortly afterward, the spirit of Kun destroyed the Tedryn Holocron, and with it Baas's gatekeeper persona. However, information from the holocron, including the words of Baas, was preserved by Tionne, who in 40 ABY compiled it and other information into a compendium on the Jedi and Sith.\nBodo Baas was mindful of the way in which Jedi used their powers. He stressed that Jedi were not to seek power, lest they become dominators and oppressors, and so fall to the dark side. Certain Force abilities could carry the temptation to abuse power, he believed, including Alter Mind—the ability to shape the thoughts of others. While Baas believed this ability to be useful, he also advised that when used incorrectly, it could bring one too near to the dark side. An overemphasis on self-reliance, which he believed could be commuted into selfishness, was also something Baas considered to be a road to the dark side. Other personal aspects he advised against included inattention and carelessness.\nBaas did not believe that darkness should be used to combat darkness. When Leia Organa Solo consulted him after her brother Luke Skywalker attempted to destroy the dark side from within, Baas told her of three failed previous attempts to do just that, including the tale of Ulic-Qel Droma. The Jedi Master counseled caution in the training of Jedi students. He believed that while impatience to learn more was a good aspect in a pupil, it also carried with it a temptation to seek the easy path of the dark side. As gatekeeper, Baas kept advanced teachings from students who were not prepared. He could also provide advice to students, such as when he discussed the points of the Jedi Code and the nature of grief with Tionne and Corran Horn at Skywalker's Jedi academy.\nThough Baas could get readings on the attitudes of other beings, he was not perfect in this aspect; when meeting with Mendor Typhoons of the Matukai, Baas found himself forced to reevaluate his initial perceptions of the man after realizing that Typhoons was serious about his contempt of the Jedi. Like many Jedi, Baas could not understand an extreme level of devotion towards oneself and one's family, such as that found in sects like the Zeison Sha. Though he was willing to debate philosophy with those who did not share Jedi beliefs, Baas was of the opinion that other Force sects should be free to go their own way, unless they posed a threat by turning to the dark side.\nBodo Baas was a powerful Jedi. Knowledgeable in divination, Baas foresaw events well past his own death. Through the Force, he could see all possible futures, stretching into far distant times. Nonetheless, his skills were not perfect; when asked about the future of Luke Skywalker, the gatekeeper persona of Baas was unable to divine it. Like most other Jedi, Baas also wielded a lightsaber.\nThe first appearance of Bodo Baas was misspelled in the fifth issue of the Star Wars: Dark Empire comic book series as Boda Baas. The endnotes on the last pages of the issue corrected it to Bodo Baas.\nSince his first appearance in Tom Veitch and Cam Kennedy's Dark Empire 5, all of Bodo Baas's appearances have been in the form of a holocron gatekeeper. Jedi vs. Sith: The Essential Guide to the Force is one of the few sources to give information on Baas in the time that he was alive, with several first-person accounts from the character of events in his life.\nThe Essential Guide to Characters is the only source to state that Baas died during the time of the Empire, giving the character a lifespan of approximately six hundred years, at the least. Ultimate Alien Anthology establishes Krevaaki as \"old\" at 95 and \"venerable\" at 130 years. While Baas's unusually long lifespan remains canon, this apparent discrepancy has not been explained. A Guide to the Star Wars Universe, Second Edition, Revised and Expanded furthermore states that Baas \"lived thousands of years ago,\" but it does not provide the timeframe that this statement is in relation to.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/19_BBY/Legends",
  "/wiki/Krevaaki",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Bodo_Baas%27s_Master",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Adega_system/Legends",
  "/wiki/600_BBY/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Tedryn_Holocron",
  "/wiki/Vodo-Siosk_Baas",
  "/wiki/Hologram/Legends",
  "/wiki/Gatekeeper",
  "/wiki/The_Force/Legends",
  "/wiki/Zeison_Sha",
  "/wiki/Matukai",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Force_ghost",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/1000_BBY",
  "/wiki/Darth_Ruin",
  "/wiki/Belt_of_Bodo_Baas",
  "/wiki/Ashka_Boda",
  "/wiki/Yanibar",
  "/wiki/580_BBY",
  "/wiki/Telekinesis/Legends",
  "/wiki/Discblade",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Mendor_Typhoons",
  "/wiki/Pirate/Legends",
  "/wiki/Ord_Radama/Legends",
  "/wiki/Dark_Empire",
  "/wiki/10_ABY/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Byss/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Vima-Da-Boda",
  "/wiki/Ossus/Legends",
  "/wiki/Kam_Solusar",
  "/wiki/Yavin_4/Legends",
  "/wiki/Tionne_Solusar",
  "/wiki/Corran_Horn",
  "/wiki/Alter_Mind",
  "/wiki/Exis_Station/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Gantoris",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Keiran_Halcyon",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/40_ABY",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force",
  "/wiki/Sith/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Dark_Empire_5",
  "/wiki/Star_Wars:_Dark_Empire",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Dark_Empire_endnotes",
  "/wiki/Tom_Veitch",
  "/wiki/Cam_Kennedy",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Canon",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Category:Audio_files_of_Bodo_Baas",
  "/wiki/Category:Images_of_Bodo_Baas",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Dark_Empire_6",
  "/wiki/Dark_Empire_(audio)",
  "/wiki/Dark_Empire_II_1",
  "/wiki/Dark_Empire_II_(audio)",
  "/wiki/I,_Jedi",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Firestorm_(short_story)",
  "/wiki/Star_Wars_Adventure_Journal_15",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_III:_Reunion",
  "/wiki/Dark_Empire_Sourcebook",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Horse%27s_Mouth",
  "/wiki/Star_Wars_Insider_28",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/The_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Handbook_3:_Dark_Empire",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_46",
  "/wiki/The_Official_Star_Wars_Fact_File_74",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Agents_of_Deception",
  "/wiki/Template:SWGTCG",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Of_Light_and_Darkness:_The_Making_of_Dark_Empire_%E2%80%93_Part_II",
  "/wiki/Star_Wars_Insider_158"
 ]
}