{
 "name": "Bogey_(Kwazel_Maw)",
 "display_name": "Bogey  (Kwazel Maw)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kwazel Maw"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  }
 ],
 "content": "\"Bogey\" was the nickname of a Kwazel Maw that the Gungan Representative Jar Jar Binks encountered and befriended during a mission to Rodia in the Clone Wars. Bogey later played a key role in capturing the Trade Federation Viceroy Nute Gunray.\nDuring the Clone Wars \"Bogey\" lived on Rodia and encountered the Galactic Republic diplomat Jar Jar Binks after he escaped from battle droids by jumping into the swamp. Bogey attacked and Binks barely managed to escape the beast. Later, however, Binks found himself underwater once more, this time evading a missile that had been fired by a B2-HA super battle droid. In the process, Binks came face-to-face again with Bogey, and was swallowed whole by the creature—only for it to shrug off the missile and then release the Gungan. With the beast seemingly friendly towards him, Binks affectionately stroked its hide and nicknamed it.\nLater, as Padmé Amidala and C-3PO were set to be executed by Nute Gunray, Binks distracted the droidekas and was then assisted by Bogey, who launched out from underwater and destroyed a number of battle droids, with Binks on its back. As Gunray looked to flee amid the confusion, Bogey toppled his shuttle off the edge of the hangar, cutting off his escape route. Gunray was then arrested by Amidala and Farr, while Binks was commended for his bravery as Bogey watched on.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bogey_(Kwazel_Maw)",
  "/wiki/Bogey_(Kwazel_Maw)/Legends",
  "/wiki/Rodia",
  "/wiki/Kwazel_Maw",
  "/wiki/Color",
  "/wiki/Gungan",
  "/wiki/Junior_Representative",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Mission_to_Rodia",
  "/wiki/Clone_Wars",
  "/wiki/Trade_Federation",
  "/wiki/Viceroy",
  "/wiki/Nute_Gunray",
  "/wiki/Galactic_Republic",
  "/wiki/Battle_droid",
  "/wiki/Missile",
  "/wiki/B2-HA_super_battle_droid",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/C-3PO",
  "/wiki/Droideka",
  "/wiki/Sheathipede-class_transport_shuttle",
  "/wiki/Hangar",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Bombad_Jedi",
  "/wiki/Cloak_of_Darkness",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_One",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Databank_(website)"
 ]
}