{
 "name": "Bokar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "138 ABY",
      "Agamar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red and black Sith tattoos"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "One Sith",
      "Darth Krayt's Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Bokar was a humanoid male Sith who served Darth Krayt's Galactic Empire during the Second Imperial Civil War. In 137 ABY, Bokar and the Sith Yuln were sent to the planet Agamar to search for surviving enemies following a battle between Sith forces and an allied group of Jedi and Imperial Knights. Three days after the Sith attacked Agamar, Bokar and Yuln were killed by Jedi Master Rasi Tuum and Imperial Knight Azlyn Rae, respectively.\nBokar, a humanoid male Sith, served in the Sith Order of Dark Lord of the Sith Darth Krayt during the Second Imperial Civil War. In 137 ABY, Sith–Imperial forces attacked the planet Agamar, intending to capture or kill exiled Emperor Roan Fel. Bokar and fellow Sith Yuln were dispatched to the surface of Agamar after the battle to search for Fel and eliminate any of his surviving Imperial Knights and Jedi.\nThree days after the attack on Agamar, as they were searching for survivors of the battle, Yuln informed Bokar that all the remaining Jedi and Imperial Knights were deceased. The two Sith began arguing about the strength of the Sith, Jedi, and Imperial Knights who had fallen during the battle, but they were interrupted by Jedi Master Rasi Tuum, who slew Bokar. Yuln was killed by a surprise attack from the Imperial Knight Azlyn Rae.\nBokar's body was covered in red and black Sith tattoos, and he had an earring in his left ear. He also owned a lightsaber. He believed that every Jedi and Imperial Knight casualty on Agamar proved that the Sith were superior to both organizations and that the Sith who perished in the fighting were \"weaklings\" who deserved to be discarded from the One Sith's ranks.\nBokar was introduced by John Ostrander, author of the Star Wars: Legacy comic series, in the first issue of the Extremes story arc. He was penciled by Jan Duursema.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/138_ABY",
  "/wiki/Agamar/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_tattoo",
  "/wiki/One_Sith",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Sith/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/137_ABY",
  "/wiki/Yuln",
  "/wiki/Planet/Legends",
  "/wiki/Operation:_Thunderstroke",
  "/wiki/Jedi/Legends",
  "/wiki/Imperial_Knight",
  "/wiki/Time/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Rasi_Tuum",
  "/wiki/Azlyn_Rae",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Lightsaber/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_48",
  "/wiki/Star_Wars:_Legacy:_Extremes",
  "/wiki/Jan_Duursema"
 ]
}