{
 "name": "Bolza_Grool",
 "display_name": "Bolza Grool",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Klatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Team Colossus"
     ]
    }
   ]
  }
 ],
 "content": "Bolza Grool was a male Klatooinian gorgmonger on the Colossus—an aircraft refueling station on the planet Castilon. It was common for Grool to throw racers who had dodged their commitments off the side of the Colossus platform head first. At some point, he was involved in a bar fight at Aunt Z's Tavern with Kazuda Xiono, who had accidentally thrown a holo-dart at his back.\nBolza Grool was a gorgmonger at the market on the Colossus. When Kazuda Xiono arrived at the platform, Grool was dealing with a Gotal pilot who had dodged his commitments, throwing him off the side and into the ocean below.\nLater, he was at Aunt Z's Tavern talking to another Gotal. The Gotal told him about an individual who was allegedly the best pilot in the galaxy, but Grool dismissed it. Shortly after, the individual the Gotal had mentioned, Xiono himself, was playing holo-darts with an Aleen named Grevel and accidentally threw a dart into Grool's back. The Klatooinian confronted him, and Grevel simultaneously attempted to get his winnings from Xiono. Grool pushed Grevel aside, but he tried to intervene again, and Grool threw him into the arms of the Snivvian Nod. Grevel then threw a cup at him, and he threw Xiono aside. The cup hit a Rodian, who then began throwing cups at the Snivvians Nod and Narb, starting a full-scale bar fight. Grool came for Xiono again and pinned him on the bar until Jarek Yeager arrived to break up the fight with his blaster.\nGrool was later running his stall at the Colossus marketplace when Xiono came to him to make a deal. He offered to put the logo of his business on his racer. Grool agreed to this and gave him a gorg in return. Sometime after, Grool was carrying a box of gorgs through the marketplace. Xiono was nearby, being confronted by Grevel, Nod and Narb. His droid, BB-8, then electrically shocked Grool, and the box of gorgs flew out of his hands and onto the Grevel and the Snivvians. Xiono used this to get away and thanked Grool as he passed.\nWhile Grool was carrying a crate of gorgs, an Ugnaught vendor who was pursuing the orphaned refugees Kel and Eila crashed into Grool, causing him to fall and drop his goods. One gorg landed on his face. Kel and Eila later found sanctuary in the engineering deck with the help of the Chelidae, Xiono, and Neeku Vozo, who helped them escape from the First Order.\nLater, Grool bumped into the BB-series astromech droid BB-8 while traveling through the Colossus marketplace. Grool told the droid to watch where it was going.\nBolza Grool was a male Klatooinian with orange skin and brown eyes. He did not appreciate being mistaken for a holo-dart board and became very angered when he was. However, he was open to deals that benefited his business. If racers on Colossus dodged their commitments, Grool was sure to throw them off the platform head first.\nBolza Grool wore a cobalt blue shirt and trousers, with a black vest and an apron with his business logo on it. He also had sand and green shoulder pads and black gloves. On his legs were shin armor and grey boots.\nBolza Grool is a character created and developed for Star Wars Resistance. He is voiced by Fred Tatasciore.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Resistance_Season_One",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/Kaz%27s_Curse",
  "/wiki/No_Place_Safe",
  "/wiki/The_Escape",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Klatooine",
  "/wiki/Klatooinian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Team_Colossus",
  "/wiki/Gorgmonger",
  "/wiki/Colossus",
  "/wiki/Refueling_station",
  "/wiki/Planet",
  "/wiki/Castilon",
  "/wiki/Z%27Vk%27Thkrkza",
  "/wiki/Aunt_Z%27s_Tavern",
  "/wiki/Kazuda_Xiono",
  "/wiki/Holo-darts",
  "/wiki/Colossus_marketplace",
  "/wiki/Gotal",
  "/wiki/Pilot",
  "/wiki/The_galaxy",
  "/wiki/Aleen",
  "/wiki/Grevel",
  "/wiki/Snivvian",
  "/wiki/Nod",
  "/wiki/Rodian",
  "/wiki/Narb",
  "/wiki/Jarek_Yeager",
  "/wiki/Blaster",
  "/wiki/Racer",
  "/wiki/Gorg",
  "/wiki/BB-8",
  "/wiki/Ugnaught",
  "/wiki/Kel",
  "/wiki/Eila",
  "/wiki/Chelidae",
  "/wiki/Neeku_Vozo",
  "/wiki/First_Order",
  "/wiki/BB-series_astromech_droid",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Fred_Tatasciore",
  "/wiki/The_Recruit",
  "/wiki/The_Triple_Dark",
  "/wiki/Fuel_for_the_Fire",
  "/wiki/The_Children_from_Tehar",
  "/wiki/The_Search_for_Kaz",
  "/wiki/Synara%27s_Score",
  "/wiki/The_Platform_Classic",
  "/wiki/Secrets_and_Holograms",
  "/wiki/Dart_and_Cover",
  "/wiki/Neeku%27s_Reward",
  "/wiki/G-LN_(episode)",
  "/wiki/The_New_World",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Resistance:_Meet_the_Pilots",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2019_Topps_Star_Wars_Resistance_Surprise_Packs",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)"
 ]
}