{
 "name": "Booba Fett",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "78.2 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Booba Fett was a clone of the bounty hunter Boba Fett. He was cloned by Grand Admiral Thrawn, as one of a series of copies created to replace important citizens of the galaxy with agents loyal to him. Booba Fett, in his position standing in as Boba, was the Mandalore and thus leader of all Mandalorian clans. However, by the year 44 ABY, Luuke Skywalker—another of Thrawn's clones—was not certain that the clone portraying Boba Fett was still Booba.\nAfter 9 ABY, when Grand Admiral Thrawn replaced the Jedi Luke Skywalker with a clone named Luuke, he began creating duplicates of other characters prominent in the galactic community who would do his bidding. Booba Fett was a clone of the influential bounty hunter Boba Fett, one of Thrawn's targets. Between the time that Booba was installed and 44 ABY, Luuke was unsure of how many times Boba had been cloned. He speculated that the replacement clone might have been the second or even third one, as the individual filling the role of Fett had been shot at many times during risky escapades. This occurred so frequently that Skywalker also believed that Fett's trademark armor had been fully replaced more than once. In 44 ABY, Boba Fett held the position of leader of the Mandalorian clans and was a supporter of the galactic government known as the Galactic Federation of Free Alliances.\nAs a replacement of Boba Fett, Booba Fett was genetically identical to the Human male Jango Fett, of whom Boba himself was a clone, and an exact physical double able to convince others that he was Boba. He possessed the Mandalore's black hair, as well as his brown eyes. He stood 1.83 meters tall, and was 78.2 kilograms in mass. Booba appeared as Boba would have at about seventy-five years of age in 44 ABY.\nBooba Fett was mentioned in \"An Apology,\" a non-canonical short story by Timothy Zahn that was released on April 1, 2012 as an April Fools' Day joke. In the context of the story, any appearance of Boba Fett after the undisclosed point at which Booba was created would be Booba. The short story was an epilogue to the Fate of the Jedi series, with the story establishing that Booba was created long before the series. He was mentioned by name in the facetious announcement of a new book series that would continue releasing novels for perpetuity, entitled Son of Clone Wars or The Clone Wars 2. Booba was going to appear in this series, but doubt was cast on whether or not it was the first clone or a second, Boooba Fett.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Kilogram/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Mandalore_(title)",
  "/wiki/Standard_year/Legends",
  "/wiki/44_ABY",
  "/wiki/Luuke_Skywalker",
  "/wiki/9_ABY/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Galactic_community",
  "/wiki/Time/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/An_Apology",
  "/wiki/Timothy_Zahn",
  "/wiki/April_1",
  "/wiki/2012",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Databank_(original)",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Star_Wars:_Head-to-Head_Tag_Teams",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Last_Command",
  "/wiki/June_3",
  "/wiki/2011",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Leland_Chee",
  "/wiki/Holocron_continuity_database",
  "/wiki/32_BBY/Legends"
 ]
}