{
 "name": "Boolio",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sinta IV"
     ]
    },
    {
     "name": "Born",
     "values": [
      "1 ABY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "35 ABY",
      "aboard the Steadfast"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ovissian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.78 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Golden"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sinta Glacier Colony",
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Boolio was an Ovissian male who worked as a mine overseer at the Sinta Glacier Colony during the war between the First Order and the Resistance. He was sympathetic to the Resistance and covertly sent supplies their way. After a First Order inspection team visited the colony, Boolio discovered a datafile in his office labeled as highly valuable intelligence for the Resistance from a traitor within the First Order.\nNot wanting to transmit the data, Boolio contacted the Resistance and arranged for them to meet him face to face at the colony. The YT-1300 light freighter known as the Millennium Falcon was sent to the meeting, and upon their arrival Boolio transferred the file to the astromech droid R2-D2 on board the freighter. After the Falcon left, Boolio was killed by the First Order and his severed head presented to the Supreme Council by Supreme Leader Kylo Ren.\nBoolio was an Ovissian male who was born on Sinta IV in 1 ABY. He worked as a mine overseer at the Sinta Glacier Colony, which extracted ice cores from the Sinta Glacier in order to harvest malsarr. During the war between the First Order and the Resistance, he was sympathetic to the Resistance, becoming one of its top informants and managing to covertly divert surplus materials and minerals from the mines on to transport starships friendly to their cause. He managed to make multiple shipments to the Resistance over a period of several months, two of which were picked up by the former stormtrooper Finn.\nWhen a discrepancy in the colony's ledgers was discovered a First Order team of inspectors was sent to investigate. The inspectors left without comment, after which Boolio discovered a datafile that had been left on his office datapad. The datafile claimed to contain game-changing intelligence on the First Order for the Resistance, but Boolio was unable to decrypt the file any further. Once he had authenticated it as a message from a high-ranking First Order officer based on the ciphers used, he contacted the Resistance via intermediaries, since as a mine overseer he did not have access to a secure frequency.\nNot wanting to risk revealing the intelligence he had been given, Boolio's message to the Resistance promised them that he could provide a regulator that they need to repair the Tantive IV, the CR90 corvette of Resistance leader General Leia Organa. In order to ensure they came quickly, he offered an extremely low price for the part and claimed that it was critical and would not last long. In 35 ABY, the Resistance then dispatched a crew from the moon Ajan Kloss in the YT-1300 light freighter known as the Millennium Falcon to meet with Boolio face to face at the colony.\nThe freighter passed through the ice tunnels of the colony before parking beneath a hatch into a dim icy corridor where the Ovissian waited. Finn and the astromech droid R2-D2 greeted Boolio through a hatch in the roof of the Falcon, at which point the overseer revealed the true reason he had called them to the colony.\nAfter hurling down one end of a cable for Finn to plug into R2-D2, Boolio admitted he did not know who the traitor within the First Order was but encouraged them to deliver the data to Organa. When asked how he could be repaid, Boolio told them to \"win the war.\" Once the transfer was complete, Boolio quickly hauled the cable back up so that the Falcon could make a hasty departure, as First Order TIE/sf space superiority fighters and TIE/wi Interceptors began to chase it. The crew of the Falcon successfully delivered Boolio's intelligence to Organa and the rest of the Resistance, which informed them that Sith Lord Darth Sidious had returned and provided the First Order with the Sith Eternal's fleet, the Final Order, that would soon attack all remaining free worlds so he can establish a new Sith Empire and rule the galaxy as Galactic Emperor again.\nProviding the Resistance with this intelligence ultimately cost Boolio his life, as he was captured by the First Order and taken to the Resurgent-class Star Destroyer Steadfast. Dragged between a group of stormtroopers, Boolio was presented to Supreme Leader Kylo Ren by Admiral Frantis Griss. Ren immediately activated his lightsaber and decapitated the Ovissian. Boolio's severed head was then presented to the Supreme Council of the First Order by Ren.\nRen declared to the Council that he knew that there was a traitor within the First Order who had sent a message to the Resistance; however, he was unaware that the traitor who had used Boolio to contact the Resistance was General Armitage Hux, one of the council members who sat before him.\nHux was later executed by Allegiant General Enric Pryde aboard the Steadfast after he realized his intentions. Though he lost his life, Boolio's actions allowed the Resistance to hatch a plan to deal with Darth Sidious' return. His wish for the Resistance to win the war would be honored when they defeated the Sith Eternal forces at the Battle of Exegol.\nBoolio had greenish-yellow skin, golden eyes, and yellow horns, and stood 1.78 meters tall. He was good natured, and had a horn-to-horn grin when he greeted Finn. The Ovissian was nervous while transferring the data and was worried that if the spy within the First Order had discovered that he was aiding the Resistance, then the rest of the First Order would soon discover him. Finn incorrectly suspected that Boolio would not have risked his life only to confirm the return of Palpatine, but as the Ovissian had not been able to decrypt the datafile, he had risked it without knowing the contents of the file at all. After he was captured, he stared up defiantly at Ren without a hint of fear before being killed.\nBoolio wore an orange mining thermal worksuit that was insulated with a lining of heat-conductive filaments. He had a personal temperature-control unit mounted on his chest for the low-temperature suit with an orange and brown ice-abseiling harness. He used a wrist-mounted comlink and data-storage unit on his left arm.\nBoolio was created for the 2019 film Star Wars: Episode IX The Rise of Skywalker, the third installment of the Star Wars sequel trilogy. He was portrayed physically by creature performer Aidan Cook and voiced by Mark Hamill, whose main role in the film was that of Luke Skywalker. For the role of Boolio, Hamill is credited under the pseudonym Patrick Williams, a combination of his brothers' names.\nPrior to the film's release, Boolio was first revealed as part of a Force Friday product launch on StarWars.com due to his presence within the 75257 Millennium Falcon LEGO set. The 2020 novelization of Episode IX written by Rae Carson contains slightly different dialogue from the film in the exchange between Boolio and Finn. In the novel, their discussion specifically mentions the regulator and First Order inspection.\nAccording to creature workshop head Neal Scanlan, the fact that Boolio would be decapitated factored heavily into the character's design, as holding a severed head is difficult. It was decided that holding the head by the hair was too brutal, so curved horns were chosen. During sculpting, the horns were moved around so that it could be swung down and smack onto a table. Where the decapitation cut was be made, the angle and placement of the horns and the width of Boolio's jaw were also all thought about in terms of what would be needed for the shot of the head. Scanlan demoed the head for producer Kathleen Kennedy, director J.J. Abrams and actor Adam Driver.\nA number of pieces of concept art of Boolio were created by creature concept designer Jake Lunt Davies, including a piece titled \"Alien Pilot 01\" that depicted Boolio as a red-skinned alien with a number of head tentacles that Ren could hold rather than horns. Lunt Davies also created \"Boolio 05\" and \"Boolio Gunner 05,\" the latter of which depicted Boolio in a gunner's seat similar to those found in the Millennium Falcon. One of the unused pieces of Boolio concept art became Ochi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sinta_IV",
  "/wiki/1_ABY",
  "/wiki/35_ABY",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Ovissian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Sinta_Glacier_Colony",
  "/wiki/Resistance",
  "/wiki/Mining",
  "/wiki/Overseer_(assignment)",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Treason",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Mission_to_Sinta_Glacier_Colony",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Freighter",
  "/wiki/Death",
  "/wiki/Supreme_Council",
  "/wiki/Supreme_Leader",
  "/wiki/Ben_Solo",
  "/wiki/Reproduction",
  "/wiki/Water",
  "/wiki/Sinta_Glacier",
  "/wiki/Malsarr",
  "/wiki/Transport",
  "/wiki/Starship",
  "/wiki/Standard_month",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Finn",
  "/wiki/Datapad",
  "/wiki/First_Order_officer",
  "/wiki/Regulator",
  "/wiki/Tantive_IV",
  "/wiki/CR90_corvette",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/TIE/sf_space_superiority_fighter",
  "/wiki/TIE/wi_Interceptor",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_Eternal",
  "/wiki/Final_Order",
  "/wiki/Sith_Empire",
  "/wiki/Galactic_Emperor",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Admiral",
  "/wiki/Frantis_Griss",
  "/wiki/Kylo_Ren%27s_lightsaber",
  "/wiki/Armitage_Hux",
  "/wiki/Allegiant_General",
  "/wiki/Enric_Pryde",
  "/wiki/Sith_Eternal_military",
  "/wiki/Battle_of_Exegol",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Comlink",
  "/wiki/Limb",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/Aidan_Cook",
  "/wiki/Mark_Hamill",
  "/wiki/Luke_Skywalker",
  "/wiki/Force_Friday",
  "/wiki/StarWars.com",
  "/wiki/LEGO",
  "/wiki/2020",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Rae_Carson",
  "/wiki/Neal_Scanlan",
  "/wiki/Kathleen_Kennedy",
  "/wiki/J.J._Abrams",
  "/wiki/Adam_Driver",
  "/wiki/Jake_Lunt_Davies",
  "/wiki/Ochi",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/LEGO_Star_Wars_Episode_IX:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Saga_of_Rey",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Eyes_Have_It",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Neal_Scanlan:_A_Force_Reawakended",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Time",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY",
  "/wiki/December_23",
  "/wiki/February_20",
  "/wiki/November_13",
  "/wiki/2018"
 ]
}