{
 "name": "Boom",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Guudrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New RepublicFarStar",
      "FarStar"
     ]
    }
   ]
  }
 ],
 "content": "Boom was a Guudrian explosives expert and pyromaniac. He served on-board the New Republic CR90 corvette FarStar during the hunt for Moff Kentor Sarne.\nBoom served on the same pirate ship as the Duros, Krudar. When the ship was destroyed by Imperial forces, Boom traveled with Krudar around the Outer Rim Territories serving as hired gunners. When Krudar signed onto the FarStar following the Battle of Kal'Shebbol, he convinced the New Republic to take on Boom as well.\nBoom was a pyromaniac, and loved explosions. Unlike most other beings, Boom would run towards an explosion when he heard it, rather than away from it. Despite this, he survived to become proficient at building explosive devices. Boom was also fascinated by anything that was bright or flickered. He carried two mini-flamers with him, which were originally used to light cigarras. Boom loved to test different objects to see how they burned, which didn't endear him to the crew of the FarStar when they found their belongings scorched and burnt. Krudar was the only being on the ship that could keep Boom under control, and acted as his interpreter during the mission.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Guudrian",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/FarStar",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Kentor_Sarne",
  "/wiki/Pirate/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Krudar",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Battle_of_Kal%27Shebbol",
  "/wiki/Pyromania",
  "/wiki/Cigarra/Legends",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/Endgame_(RPG_adventure)",
  "/wiki/Endgame",
  "/wiki/The_DarkStryder_Campaign,_Deluxe",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/The_Kathol_Rift"
 ]
}