{
 "name": "Boost",
 "display_name": "Boost",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black; red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Wolfpack",
      "Grand Army of the Republic",
      "Wolfpack",
      "Wolfpack"
     ]
    }
   ]
  }
 ],
 "content": "\"Boost\" was the nickname of a clone trooper who fought in the Clone Wars as a member of the Grand Army of the Republic's Wolfpack. In 22 BBY, Boost was stationed on the Venator-class Star Destroyer, Triumphant. Along with two other Venator-class Star Destroyers, they chased General Grievous' warship, the Malevolence, to the Abregado system.\nThe Malevolence destroyed all three ships, but Boost, along with Jedi Plo Koon, Sergeant Sinker and Wolffe, managed to escape via an escape pod. They were attacked in their escape pod by rocket battle droids on a Droch-class boarding ships, however, the group was able to defeat them. Eventually, Jedi General Anakin Skywalker and his Padawan Ahsoka Tano, rescued Koon and the clone troopers. Afterward, the Malevolence began to attack Skywalker's freighter, the Twilight, however, the group escaped and jumped into hyperspace.\n\"Boost\" was the nickname of a clone trooper who was a part of the Grand Army of the Republic during the Clone Wars, a galaxy-wide conflict between the Galactic Republic and the Confederacy of Independent Systems. Boost, like all clone troopers, was one of the many clones of the Mandalorian bounty hunter Jango Fett and born on the Wild Space planet of Kamino. In the beginning of the war, Boost fought in the first battle of the war on the planet Geonosis. During the battle, Boost received scars after he fought battle droids.\nIn 22 BBY, the Jedi High Council dispatched General Plo Koon to search for the Separatist \"mystery weapon,\" which had destroyed several Republic fleets. Onboard the Venator-class Star Destroyer, Triumphant, Koon was accompanied by Boost and a group of clone troopers—a few of which were: Commander CC-3636, nicknamed \"Wolffe\", and Sergeant Sinker. Upon discovering the Malevolence in the Abregado system, the warship fired its ion cannons on Koon's Venator-class Star Destroyer, which rendered the ship without power and defenseless. The many turbolasers of the Subjugator-class cruiser began to fire, quickly destroying the three ships. Koon told Boost, Wolffe and Sinker to evacuate the Triumphant in an escape pod, before it was destroyed by the Malevolence.\nIn the pod, Wolffe told them that they had suffered a total system blackout, and only the life support was working. Boost hoped that someone would search for them, but Sinker did not share Boost's positive thinking. Afterwards, Koon advised them to conserve energy and while doing this, Sinker commented negatively about Boost's hygiene. Sinker also said that it would not be strategical to search for them, and that he would have instead searched for the superweapon, but Koon answered that their lives were more important to him. Shortly after, Boost discovered another escape pod, but those inside were all dead and the pod was crushed. Shortly after, they picked up another signal from a pod. However, before reaching it, it was destroyed by a Droch-class boarding ship and its group of rocket battle droids, who then quickly turned their attention to Koon's pod. While Wolffe remained in the pod in order to keep their signal active, Koon, Sinker and Boost exited the pod to fight the droids. During the fight, Wolffe contacted Padawan Ahsoka Tano, and Jedi Knight Anakin Skywalker, who were already searching for survivors of the battle. Meanwhile, Plo Koon used the Force to throw Sinker behind the droids and he was able to destroy them. Shortly after, Plo Koon contacted Tano using the Force, showing her their location. Eventually, they were found by the Twilight, Skywalker's personal freighter, which recovered the escape pod and, once onboard, the clones were treated by a medical droid. Shortly after, the Malevolence discovered the Twilight. Despite their attempts to shut down all the ships energy, they had forgotten the medical droid. Still, the Twilight managed to escape the system before it could be disabled by the ion cannons of the Malevolence.\nBoost, Sinker and Wolffe were members of a Republic force dispatched to the Separatist-occupied planet Khorm in order to secure the Agrocite, an ore used to increase power to starfighters. Under the command of Jedi Generals Koon and Kit Fisto, and Major Kendal Ozzel, the Republic managed to capture an Agrocite processing facility, only to lose it soon thereafter in a Separatist counterattack. Later, while Plo Koon and Kit Fisto went ahead to scout out the main Confederate base located in an Agrocite mine, Major Ozzel led his troops to recapture the processing facility. The facility, however, had been abandoned, and Ozzel—certain that the Republic had crushed the enemy—ordered to initiate an assault on the Agrocite mine.\nIn contrast to Ozzel, Boost and Sinker thought that the Confederacy had moved its troops for a reason and was preparing to make a final stand at the mine. The two expressed their opinion to Wolffe, but he replied that they had their orders and told Boost to load the Republic walkers into landing ships. Just as Boost and Sinker thought, the Republic forces faced heavy opposition from the Separatists, but eventually managed to win the battle.\nBoost also served alongside the Wolfpack when they were trying to recapture Felucia from General Grievous. Boost went with Ahsoka to jump onto the wall, but later, Ahsoka vanished and Boost reported it in to Corporal Comet, who started a search.\nIn 21 BBY, Boost, along with Sinker, was present when Plo Koon's troops traveled to Aleen to provide care to the damaged city's occupants and to convince them to join the republic. Traveling with them were C-3PO, and R2-D2. When Boost and Sinker were called in to report to Wolffe, and after setting up communications, the droids went exploring and got themselves into trouble. Soon after, Boost was present with Wolffe to rescue Jedi Master Adi Gallia, whose ship was attacked by General Grievous.\nWhen Jedi Master Obi-Wan Kenobi was taken from Zygerria to Kadavo, Plo Koon's troopers were sent on a rescue mission after Anakin had landed on the planet. As Skywalker eliminated the turrets, Plo's Bros Gunships, Clone Z-95 starfighters and a Republic Cruiser came to the rescue. As the Z-95's provided air support, Comet, Wolffe, Sinker, Boost and Wolfpack assisted in transporting the remaining en-slaved Togruta's from the Kiros system.\nBoost was a positive thinking clone trooper. When stuck in an escape pod, he never gave up hope that someone would come and rescue the group. According to his fellow trooper Sinker, he only took baths when he was on leave.\nBoost first appeared in the second episode of the The Clone Wars TV series, Rising Malevolence. There he was voiced like all clone troopers through the series by Dee Bradley Baker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/CT-4860",
  "/wiki/Boost",
  "/wiki/Canon",
  "/wiki/Boost/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Wolfpack/Legends",
  "/wiki/Clone_trooper_sergeant",
  "/wiki/Sinker/Legends",
  "/wiki/High_Jedi_General/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Triumphant/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Battle_of_Abregado/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Malevolence/Legends",
  "/wiki/Abregado_system/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/CC-3636",
  "/wiki/Escape_pod/Legends",
  "/wiki/Rocket_battle_droid",
  "/wiki/Droch-class_boarding_ship/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Twilight/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Planet/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Turbolaser/Legends",
  "/wiki/Subjugator-class_heavy_cruiser/Legends",
  "/wiki/Death/Legends",
  "/wiki/Pod_1977/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/TB-2/Legends",
  "/wiki/Battle_of_Khorm/Legends",
  "/wiki/Khorm/Legends",
  "/wiki/Agrocite/Legends",
  "/wiki/Ore/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Major/Legends",
  "/wiki/Kendal_Ozzel/Legends",
  "/wiki/Agrocite_processing_facility",
  "/wiki/Mining/Legends",
  "/wiki/Felucia/Legends",
  "/wiki/Comet_(clone_trooper)/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Aleen/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Zygerria/Legends",
  "/wiki/Kadavo/Legends",
  "/wiki/Plo%27s_Bros/Legends",
  "/wiki/Gunship/Legends",
  "/wiki/Clone_Z-95_starfighter",
  "/wiki/Togruta/Legends",
  "/wiki/Kiros/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Rising_Malevolence",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Category:Images_of_Boost",
  "/wiki/The_Clone_Wars:_Jedi_Adventures",
  "/wiki/The_Clone_Wars_9",
  "/wiki/Padawan_Lost",
  "/wiki/Mercy_Mission_(episode)",
  "/wiki/Clone_Wars_(PocketModels)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_129",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Clone_Wars_Magazine_17",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(video_game)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}