{
 "name": "Bor_Ifriem",
 "display_name": "Bor Ifriem",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Accresker Jail"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mairan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Bor Ifriem was a bor of the Mairan species used by the Galactic Empire for interrogations. Around 3 ABY, the bor was used to interrogate Chelli Aphra, an inmate of the wreckage-prison Accresker Jail. The mental torturing from Bor Ifriem led Aphra to reveal the infestation of the fungus gundravian hookspores in the prison.\nThe Empire resultantly abandoned Accresker Jail and left Bor Ifriem half frozen there. The Sith Lord Darth Vader soon began searching for Aphra's companion Magna Tolvan aboard the wreckage-prison after she had revealed her knowledge of a conspiracy regarding the Sith that Aphra had told her. Tolvan resultantly had Aphra alter her memory using Bor Ifriem to convince her she had killed her cohort, the bor being murdered afterwards.\nDuring the Galactic Civil War, Bor Ifriem was one of three bors of the semi-sentient Mairan species used by the Galactic Empire for carrying out interrogations. When not in use, the bor was frozen in ice using a coolant grille. Around 3 ABY, Bor Ifriem was defrosted at the Imperial wreckage-prison Accresker Jail for the interrogation of the inmate Chelli Aphra, known as \"Joystick Chevron\" to the Imperial personnel there. An interrogation officer at the prison and his lieutenant had found Aphra was hiding something big from them, but since the inmate was managing to resist their probes, the lead interrogation officer chose to elevate their form of torture.\nAfter Bor Ifriem was freed from the ice, Aphra was subjected to the creature, the interrogation officer remarking that the bor liked her. The creature embraced the inmate with his tentacles and began reading her mind, feeding on the inmate's resistance to him. The interrogation officer bragged about the effects to \"Joystick Chevron,\" asserting that the Mairan race had a gift of \"emotional flagellation.\" Bor Ifriem put Aphra through flashbacks of all the actions she felt guilty and shameful about, the officer telling her that confession would be the only relief she would find from it.\nAphra attempted to dissuade the interrogation officer and his lieutenant by claiming she was thinking about her mother. As such, the officer threatened the inmate to have Bor Ifriem delete her memories of her mum or alternatively rewrite them, the Mairan inducing illusions in Aphra's mind of her mother in alternate realities. The inmate began slowly breaking into a confession, more visions of her past flowing through her mind. She finally confessed that a colony of the highly infectious fungus gundravian hookspores was spreading at Accresker Jail, the lieutenant confirming that she was telling the truth.\nAfter learning of the hookspores, the Empire chose to decommission Accresker Jail and send it on a collision course with the Rebel Alliance-sympathizing planet Tiferep Major. Bor Ifriem was left behind, improperly frozen, when the Imperial personnel of Accresker Jail's prison-tug abandoned the cruiser and allowed it to crash into the wreckage-prison. When breaking into the wreckage of the prison-tug, Aphra and her companions, \"Lopset Yas,\" Magna Tolvan and Sana Starros, discovered the bor half-buried in an ice-block, Tolvan calling it sloppy work.\nAs a last resort, Tolvan persuaded the Sith Lord Darth Vader to come to Accresker Jail after revealing to him over comm that she knew of his conspiracy to replace Emperor Palpatine, which she had been informed of by Aphra. Vader temporarily stopped the wreckage-prison's collision course with the tractor beam of his flagship, the Executor, and boarded Accresker Jail in search of Tolvan. Fearing Vader's wrath, Aphra led Tolvan to Bor Ifriem, asking her companion to erase her knowledge of Vader's conspiracy using the bor.\nTolvan, though, convinced Aphra to have the former's memory altered by Bor Ifriem to believe she had killed the latter in order to purge Vader's lead on Aphra. Aphra followed through, using the bor on her companion. Once Tolvan's memory was altered, Aphra left her for Vader, while killing Bor Ifriem. When the Sith Lord found Tolvan, he heard the latter's account of false events, being tricked by it. After departing Accresker Jail, he allowed the wreckage-prison to be released from the tractor beam and crash into Tiferep Major with the dead Bor Ifriem aboard.\nBor Ifriem first appeared in the comic Doctor Aphra  21, written by Si Spurrier, illustrated by Kev Walker, and published by Marvel Comics on June 27, 2018. He was then identified in the following issue, written and illustrated by the same people and published on July 25 of that year.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Doctor_Aphra_(2020)_22",
  "/wiki/3_ABY",
  "/wiki/Accresker_Jail",
  "/wiki/Mairan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Species",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Wreckage-prison",
  "/wiki/Torture",
  "/wiki/Fungus",
  "/wiki/Gundravian_hookspore",
  "/wiki/Prison",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Magna_Tolvan",
  "/wiki/Sith",
  "/wiki/Death",
  "/wiki/Galactic_Civil_War",
  "/wiki/Sentience",
  "/wiki/Water",
  "/wiki/Coolant_grille",
  "/wiki/Unidentified_interrogation_officer",
  "/wiki/Unidentified_lieutenant_(Accresker)",
  "/wiki/Lieutenant",
  "/wiki/Lona_Aphra",
  "/wiki/Parent",
  "/wiki/Brain",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Planet",
  "/wiki/Tiferep_Major",
  "/wiki/Prison-tug",
  "/wiki/Cruiser",
  "/wiki/Cornelius_Evazan",
  "/wiki/Sana_Starros",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Tractor_beam",
  "/wiki/Flagship",
  "/wiki/Executor",
  "/wiki/Lord",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Doctor_Aphra_(2016)_21",
  "/wiki/Simon_Spurrier",
  "/wiki/Kev_Walker",
  "/wiki/Marvel_Comics",
  "/wiki/June_27",
  "/wiki/2018",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/July_25",
  "/wiki/Category:Images_of_Bor_Ifriem",
  "/wiki/Doctor_Aphra_(2016)_23",
  "/wiki/Doctor_Aphra_(2016)_24",
  "/wiki/Doctor_Aphra_(2016)_25",
  "/wiki/Doctor_Aphra_(2016)_26",
  "/wiki/Doctor_Aphra_(2016)_33",
  "/wiki/Doctor_Aphra_(2016)_39",
  "/wiki/Doctor_Aphra_(2016)_40",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Crimson_Reign_3",
  "/wiki/Jeremoch_Colton",
  "/wiki/Standard_year",
  "/wiki/The_Archivist",
  "/wiki/Prisoner",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Echo_Base",
  "/wiki/Hoth",
  "/wiki/Battle_of_Hoth",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Doctor_Aphra_(2016)_20"
 ]
}