{
 "name": "Bora_Boru",
 "display_name": "Bora Boru",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bosph"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bosph"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Bora Boru was a male Bosph smuggler who operated in the Outer Rim Territories.\nHe held the Bosph title of Farseer, which was a Bosph Force tradition. The title gave him access to the Bosph philosophical teachings and a glyph of his own. In the tradition of the Bosph wanderers called the way of the traveler, Bora Boru's body was covered with tattoos of star maps. He disliked the Galactic Empire ever since they destroyed his homeworld, at the same time pretending the bombardment never took place and trying to ignore the Empire. Such \"disremembering\" was the ultimate insult in Bosph culture.\nBeing a \"Farseer\", Bora Boru had the right to take objects into possession by placing his glyph on them. That was how he obtained his ship, the Bosphon Forever, much to the dislike of its original owner, whom Boru had to kill to defend his newly-acquired possession. Bora Boru's ship was coated with glyphs, and on the inside, tales of the Bosph, as well as his own exploits were rendered on the walls of the hull. No one was allowed unguarded into the ship unless they were truly trusted.\nBora Boru was slow and contemplative, but still a highly effective smuggler. He was able to analyze any situation from multiple levels within a few moments. He had a tendency to sympathize with colleagues and customers who disliked the Empire, and was known to do jobs that were specifically damaging to the Empire for free. Bora Boru was Force-sensitive and was able to use the Force powers practiced in the Farseer tradition. Because of his Force-sensitivity, he lived beyond the standard life span of the Bosph. He never performed any outright evil actions, though he was unacquainted with the Jedi Code and had never met a Jedi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bosph_(planet)",
  "/wiki/Bosph_(species)",
  "/wiki/Gender/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Farseer",
  "/wiki/The_Force/Legends",
  "/wiki/Glyph",
  "/wiki/Bosph_wanderer",
  "/wiki/Way_of_the_traveler",
  "/wiki/Tattoo/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Disremembering",
  "/wiki/Starship/Legends",
  "/wiki/Bosphon_Forever",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Smugglers_of_the_Outer_Rim",
  "/wiki/Star_Wars_Adventure_Journal_5",
  "/wiki/Alien_Encounters_(article_series)",
  "/wiki/Star_Wars_Adventure_Journal_13"
 ]
}