{
 "name": "Borert Harbright",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Salliche"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Harbright",
      "Salliche Agricultural Corporation",
      "New RepublicNew Republic Senate",
      "New Republic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Count Borert Harbright of House Harbright was the owner of the conglomerate Salliche Agricultural Corporation, which owned eighteen planets in different systems, including Yulant, Broest and Ruan, being Ruan one of the headquarters of the corporation with another one on the planet Salliche.\nAfter the Battle of Endor, Salliche Agricultural Corporation workers on many planets staged a rebellion destroying important assets of the company. To avoid further problems like that, Salliche Ag replaced a great amount of its staff with droids. It was then that Borert Harbright began to run Salliche Ag's daily operations. Borert named his cousin Dees Harbright senior vice president of marketing for Salliche Ag, and later elected as Salliche Ag's delegate representing Ruan in the New Republic Senate. After the Yuuzhan Vong War, Salliche Ag feared that the invaders would overcome the New Republic and then destroy their planets, and lives, because of their technological heresy. Thus, Salliche Ag decided to get rid of techno-workers and tools, hoping to get some preferential treatment from the Yuuzhan Vong. In fact, they even planned to offer the droids to the invaders as a sacrifice. Salliche Ag decided then to 'accept refugees' in exchange for their workforce. Harbright was glad to explain that this maneuver allowed them to claim \"handpicked production\".",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Salliche/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_Harbright",
  "/wiki/Salliche_Agricultural_Corporation",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/Yulant_system",
  "/wiki/Broest_system",
  "/wiki/Ruan_system",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Yuuzhan_Vong",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}