{
 "name": "Borgo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    }
   ]
  }
 ],
 "content": "Borgo was a baby Hutt initially brought into Freetown by members of the Red Key Raiders to be installed into the empty palace once owned by Jabba Desilijic Tiure in the months after the Battle of Endor. However Sheriff Cobb Vanth and Issa-Or caught wind of the plan and captured the Huttlet. Sometime after, the beastmaster Malakili was asked by Vanth if he could teach the Huttlet, to which he replied he believed he could. Later, Freetown was invaded by the Red Key forces led by Lorgan Movellan. Borgo along with Malakili and Vanth were captured but were freed when the Tusken Raiders drove the Red Key forces from the town.\nBorgo the Hutt was barely an adolescent in the aftermath of the Battle of Endor. In 5 ABY, the self-proclaimed Sheriff Cobb Vanth and his Twi'lek companion Issa-Or foiled a plot by the Red Key Raiders to sneak the Huttlet into Freetown as a puppet ruler. Finding the Huttlet difficult to manage, Vanth hired Jabba's former Beastmaster Malakili to tame the Huttlet in return for lodging. Malakili agreed but insisted on treating Borgo as a sentient being.\nMalakili became the Huttlet's mentor and christened him Borgo. Borgo came to trust Malakili. Malakili also helped Vanth to forge a pact with the local Tusken Raiders. In return for the townsfolk giving the Tusken Raiders water, the Raiders agreed to leave Freetown alone and to protect it from criminal elements like the Red Key syndicate. Shortly before the Battle of Jakku, Red Key forces led by Lorgan Movellan managed to invade and occupy the town. Borgo along with Malakili and Vanth were taken captive by the gangsters.\nMovellan's henchmen Vommb and Trayness carried the Huttlet in a red tarp. Borgo struggled to break free of the chart. In the presence of Vanth and Malakili, Movellan announced that he was going to take the Huttlet and sell it back to the Hutts. At Movellan's signal, his henchmen unrolled the tarp. Malakili went to comfort Borgo. Movellan then announced that he was going to enslave the inhabitants of Freetown. While Movellan confronted Vanth, Malakili whispered into Borgo's ear. Lorgan saw this and ordered Trayness to strike Malakili as punishment.\nWhen the Beastmaster cried out in pain, Borgo let out a shrieking wail. This turned out to be the signal for the Tusken Raiders to attack the Red Key forces. The Tuskens killed the Red Key gangsters but left the Freetown citizens alone per their covenant with Vanth and Malakili. Vanth then subdued Movellan and carved a message on his face as a warning to his Red Key masters.\nAs a child, the Hutt Borgo was impressionable enough to be manipulated as a tool by adults, particularly criminal elements like the Red Key syndicate. Unable to manage Borgo, Vanth hired Jabba's former Beastmaster Malakili to teach him. Malakili became Borgo's protector and mentor. Borgo respected Malakili and followed his instructions. As a Hutt, he resembled a slug and had small arms and a craterous mouth. Borgo also secreted slime and was capable of generating a loud, piercing shriek that could be heard at a significant distance. Barely an adolescent, Borgo was small enough to be carried inside a tarp.\nBorgo was first mentioned in Chuck Wendig's novel Aftermath: Life Debt, which was released on July 12, 2016. He first appeared as a tertiary character in the book's sequel Aftermath: Empire's End, which was released on February 21, 2017.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Borgo_Prime/Legends",
  "/wiki/Hutt",
  "/wiki/Freetown",
  "/wiki/Red_Key_Raiders",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Endor",
  "/wiki/Sheriff",
  "/wiki/Cobb_Vanth",
  "/wiki/Issa-Or",
  "/wiki/Beastmaster",
  "/wiki/Malakili",
  "/wiki/Gender",
  "/wiki/Lorgan_Movellan",
  "/wiki/Tusken_Raider",
  "/wiki/5_ABY",
  "/wiki/Twi%27lek",
  "/wiki/Sentience",
  "/wiki/Water",
  "/wiki/Battle_of_Jakku",
  "/wiki/Gangster",
  "/wiki/Vommb",
  "/wiki/Trayness",
  "/wiki/Color",
  "/wiki/Hutt_Clan",
  "/wiki/Slavery",
  "/wiki/Ear",
  "/wiki/Skirmish_in_Freetown",
  "/wiki/Death",
  "/wiki/Slug_(creature)",
  "/wiki/Mouth",
  "/wiki/Chuck_Wendig",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/July_12",
  "/wiki/2016",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/February_21",
  "/wiki/2017",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}