{
 "name": "Borra_Setas",
 "display_name": "Borra Setas",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Borra Setas was a female Rodian who lived on Tatooine during the Galactic Civil War.\nAfter the Battle of Yavin, Borra Setas resided in the town of Anchorhead on Tatooine. In 1 ABY, she discovered information concerning a plot involving Jabba the Hutt. The plot was to incite the Tusken Raiders to attack Mos Eisley in order to pressurize the mayor and eventually take control of the city.\nDuring this time, a female Twi'lek entertainer named Anetia Kah'ryn tasked a novice entertainer with gathering information from Crix Yarrow, Dorn Gestros, and Borra Setas concerning criminal and Tusken activity in Mos Eisley. When the entertainer traveled to Anchorhead and approached Borra Setas, she said it would probably be best not to talk to her. The entertainer asked why, and mentioned that Borra looked sad. Borra then lashed back that she was not sad, but rather scared due to the position she was in. When the entertainer said it could not be that bad, Borra yelled that the entertainer was not the one who upset a major crime boss, later revealed to be Jabba the Hutt. The entertainer asked Borra for more information, at which point she grew dismayed at saying too much already. Feel as though her life was already at stake, she decided to may as well divulge more information. She informed the spacer that she discovered a major crime figure was putting political pressure on someone in Mos Eisley. However, she refused to reveal anymore information. Afterwards, the entertainer returned to Anetia Kah'ryn to bring back this information, and await further instructions.\nBorra Setas was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and publisShed by LucasArts, prior to its closure on December 15, 2011. Borra Setas was added to the game with the release of the with the \"Publish 17\", on May 26, 2005. She was part of a quest given by Anetia Kah'ryn to beginner players who had chosen a career of \"entertainer\". During each server reset, her appearance was randomized, but she consistently appeared as a Rodian female. Anetia Kah'ryn's quest was removed from the game upon the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005,",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Tatooine/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/City/Legends",
  "/wiki/Anchorhead/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Mayor/Legends",
  "/wiki/Canon",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Entertainer",
  "/wiki/Anetia_Kah%27ryn",
  "/wiki/Crix_Yarrow",
  "/wiki/Dorn_Gestros",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/May_26",
  "/wiki/2005",
  "/wiki/November_15",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}