{
 "name": "Bosbit Matarcher",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Delemede"
     ]
    },
    {
     "name": "Born",
     "values": [
      "247 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Bosbit Matarcher was a Human male from the planet Delemede who, after a relativistic shield malfunction during a brief hyperspace jump aboard a Delemedian starhopper in 212 BBY, found himself nearly two hundred years in the future. The unusual journey brought Matarcher brief fame, netting him a minor HoloNet News interview. However, Matacher was actually delighted at the mishap—when he had left in 212 BBY, Delemede was dilapidated, but by the time of his return in 22 BBY, the planet was flourishing.\nBosbit Matarcher was a Human male from the planet Delemede. In 212 BBY, when he was thirty-five years old, Matarcher bought a Delemedian starhopper, believing he had gotten a great deal for the starship. However, when he engaged the hyperdrive to take a quick jump outsystem, the relativistic shield on the starhopper—which was supposed to protect Matarcher from the strange bends in time and space associated with traveling at such hypervelocity—malfunctioned. The journey to leave the Delemede system took a mere two hours for Matarcher, but when he exited hyperspace, he found that to the outside galaxy, 190 years had passed, making it 22 BBY. Matarcher was now 225 standard years old.\nThe extreme and unusual malfunction brought Matarcher brief fame, resulting in a minor HoloNet News interview that detailed Matarcher's experience. In the interview, Matarcher said he would be returning to Delemede, but this time, he would be flying transit.\nEven though Bosbit Matarcher had traveled 190 years through time, he was actually happy that the malfunction had occurred. When he had left Delemede in 212 BBY, the planet was dilapidated, but in 22 BBY, Delemede was thriving. Matarcher had brown hair, blue eyes, and fair skin.\nBosbit Matarcher appeared in the in-universe HoloNet News Vol. 531 48 article 225-year Old Man's Secret? Time Dilation. The HoloNet News volume was released on March 21, 2002. He was later given his own entry in The Complete Star Wars Encyclopedia, which was released in 2008.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Delemede",
  "/wiki/247_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Delemedian_starhopper",
  "/wiki/HoloNet_News_Vol._531_48",
  "/wiki/Planet/Legends",
  "/wiki/Relativistic_shield",
  "/wiki/Hyperspace/Legends",
  "/wiki/212_BBY",
  "/wiki/Standard_year/Legends",
  "/wiki/Time_travel/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Time/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Delemede_system",
  "/wiki/Realspace/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/In-universe",
  "/wiki/HoloNet_News_(original_website)",
  "/wiki/March_21",
  "/wiki/2002",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008"
 ]
}