{
 "name": "Boshti_Anilee",
 "display_name": "Boshti Anilee",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Boshti Anilee was a Twi'lek female who trained at the Dette Lawnic Dance Academy on the planet Alderaan with her partner, Hado Gwin. The couple then joined the competitive circuit and won trophies in three sectors. They began following the First Light—the yacht of Crimson Dawn leader Dryden Vos—from port to port, and she and Gwin were aboard the vessel in 10 BBY while it was on the planet Vandor. They danced there to a performance by singers Aurodia Ventafoli and Luleo Primoc.\nBoshti Anilee was a Twi'lek female dancer who trained for a year at the Dette Lawnic Dance Academy on the planet Alderaan with her romantic and professional partner, Hado Gwin. After completing their training, the couple joined the competitive circuit and became trophy winners in three sectors. They began following the First Light—a yacht belonging to Dryden Vos, the leader of the Crimson Dawn crime syndicate—from port to port and in 10 BBY attended a party on the vessel while it was docked at Fort Ypso on the planet Vandor.\nAt the party Anilee and Gwin spent their time among the other guests on the yacht's observation deck, where they danced to music performed by the singers Aurodia Ventafoli and Luleo Primoc. After the criminal Tobias Beckett and his gang entered the deck, the performance came to an end, and Anilee and Gwin applauded the singers along with the rest of the guests. The couple then spoke with a masked human, before moving further back toward the rear of the deck. The yacht later left Vandor, and Vos was killed not long after.\nBoshti Anilee had light skin and brown eyes.\nWhile aboard the First Light, Anilee wore a black dress with a black headband and black high heels. She hung a silver necklace around her neck and had her fingernails painted black. Anilee and Gwin both had a series of black bands on each of their fingers.\nBoshti Anilee was portrayed by Nicolett Alexandra in the 2018 Anthology film, Solo: A Star Wars Story. The character was first named in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Dette_Lawnic_Dance_Academy",
  "/wiki/Planet",
  "/wiki/Alderaan",
  "/wiki/Hado_Gwin",
  "/wiki/Sector",
  "/wiki/First_Light",
  "/wiki/Nau%27ur-class_yacht",
  "/wiki/Crimson_Dawn",
  "/wiki/Dryden_Vos",
  "/wiki/Spaceport",
  "/wiki/Starship",
  "/wiki/10_BBY",
  "/wiki/Vandor",
  "/wiki/Musician",
  "/wiki/Aurodia_Ventafoli",
  "/wiki/Luleo_Primoc",
  "/wiki/Standard_year",
  "/wiki/Fort_Ypso",
  "/wiki/Time",
  "/wiki/Yacht",
  "/wiki/Music",
  "/wiki/Tobias_Beckett",
  "/wiki/Beckett%27s_gang",
  "/wiki/Human",
  "/wiki/Showdown_on_Savareen",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Necklace",
  "/wiki/Limb",
  "/wiki/Nicolett_Alexandra",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Category:Images_of_Boshti_Anilee",
  "/wiki/Solo:_A_Star_Wars_Story_Ultimate_Guide",
  "/wiki/Star_Wars_Insider",
  "/wiki/Fighting_Talk!",
  "/wiki/Star_Wars_Insider_187",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/June_3"
 ]
}