{
 "name": "Bouncer_(clone_trooper)",
 "display_name": "Bouncer  (clone trooper)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "\"Bouncer\" was the nickname of a clone trooper who served on the planet Pastil in 22 BBY during the Clone Wars. Bouncer was a member of the clone complement of a local tracking station, which was assigned to warn the Galactic Republic of impending attacks by the Confederacy of Independent Systems. When Clone Commander CC-2224 and Clone Captain CT-7567 arrived at the Pastil station on a routine inspection, they uncovered a Confederate spy there, an MSE-series droid nicknamed \"Rodent.\" Bouncer participated in the subsequent search for the droid, which was found and eliminated.\nThe clone trooper nicknamed \"Bouncer\" was one of the many clones of the bounty hunter Jango Fett. Like the rest of his clone brethren, Bouncer was bred on the planet of Kamino to serve in the Grand Army of the Republic. He was unable to complete the required training before joining the Grand Army; however, as the galaxy-spanning Clone Wars escalated, rookie clones such as Bouncer—the so-called shinies—were rushed into service by the Galactic Republic. Bouncer was assigned to a remote tracking station on the planet Pastil, a listening post that watched over enemy fleet movements and was supposed to warn the Republic Navy in case of an attack by the Confederacy of Independent Systems.\nTo help the clones in the station's maintenance, an MSE-series droid also worked there. Nicknamed \"Rodent\" by the clone troopers, the droid diligently polished the premises; almost too diligently, as Bouncer and the other clones noticed, although they wrote it off to a glitch in the droid's programming. In 22 BBY, Clone Commander CC-2224 and Clone Captain CT-7567 visited Pastil station for a routine inspection. They noted the unusual cleanliness of the outpost, and one of the clone troopers, Stripe, informed them about Rodent's seeming obsession with keeping the station tidy.\nUpon hearing this, the two inspectors realized that the droid was, in fact, a Confederate spy; cleaning the outpost was just a cover while the droid spent its time learning Republic secrets. The senior clones issued a Code Aurek alert and ordered the clone troopers to find Rodent. During their search for the droid, Bouncer's inquiry into whether the clone officers randomly hunted cleaning droids at every inspection was met by a reprimand from Stripe. When the clone troopers finally found Rodent, the droid tried to escape, but Stripe destroyed the droid with a V-1 thermal detonator, damaging a part of the station in the process. Leaving Bouncer and the rest of the shinies to clean up the mess, CC-2224 and CT-7567 departed Pastil. With Rodent's destruction, the Pastil outpost safely continued its operation.\nWhen CC-2224 and CT-7567 ordered the hunt for Rodent, Bouncer questioned whether the clone officers performed station sweeps in search of droids during every inspection, a question that fellow trooper Stripe considered to be stupid. Like his genetic template, Jango Fett, Bouncer stood 1.83 meters tall and had black hair and brown eyes.\nBouncer appeared in Mouse Hunt, a short webcomic written by Pablo Hidalgo, illustrated by Tom Hodges, and published on StarWars.com. Mouse Hunt preceded \"Rookies,\" an episode in the first season of the Star Wars: The Clone Wars television series. The planet on which Bouncer served was not named in the comic itself, but it was identified as Pastil in the online episode guide for \"Rookies.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Bouncer_(disambiguation)",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Pastil/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Pastil_tracking_station/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-2224/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/CT-7567/Legends",
  "/wiki/Spy/Legends",
  "/wiki/MSE-series",
  "/wiki/Droid/Legends",
  "/wiki/Rodent_(droid)",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Army/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Shinie/Legends",
  "/wiki/Listening_post/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Trooper/Legends",
  "/wiki/Stripe",
  "/wiki/Time/Legends",
  "/wiki/Code_Aurek",
  "/wiki/Officer/Legends",
  "/wiki/V-1_thermal_detonator",
  "/wiki/Eye/Legends",
  "/wiki/The_Clone_Wars:_Mouse_Hunt",
  "/wiki/Star_Wars:_The_Clone_Wars_(webcomics)",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Tom_Hodges",
  "/wiki/StarWars.com",
  "/wiki/Rookies",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/The_Clone_Wars:_Secret_Missions_4:_Guardians_of_the_Chiss_Key",
  "/wiki/Count_of_Serenno/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Mission_to_Florrum",
  "/wiki/Ohnaka_Gang/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/The_Gungan_General",
  "/wiki/Galactic_Standard_Calendar"
 ]
}