{
 "name": "Bounty_239",
 "display_name": "Bounty 239",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "\"Bounty #239\" was the designation used by the bounty hunter Boba Fett for a male Bith criminal who prospered by scamming and conning others throughout the galaxy. The Bith's activities angered many individuals, including former friends, and it led to the placement of a bounty on his head, to be collected by Fett.\nThe Bith male criminal known to the bounty hunter Boba Fett simply as \"Bounty #239\" made enemies in more than twelve star systems for cheating, breaking deals, and selling defective merchandise. At one point, he let his associates take the fall for at least one fraudulent scheme he created while on the Core World planet Corellia. For these reasons, a bounty was placed on his head by his detractors, which was to be collected by Fett.\nThe Bith, however, had amassed a small army throughout the years, which was composed of around twenty ordinary mercenaries as well as two Trandoshan twin brothers—who had caused problems for Fett previously on Ryloth—and three IG-88 assassin droids shielded against ion weaponry, which effectively made the droids resistant to Clone Wars-era electromagnetic pulse grenades.\nFett, having accepted the job, planned a blitz attack on Bounty #239's compound and entourage. Fett planned to kill Bounty #239 and destroy his stronghold by carrying copious amounts of armaments—not just an EE-3 carbine rifle and a jetpack—and deploying a \"shock and awe\" strategy.\nBounty #239, black-eyed and bald, was an accomplished scammer who prospered by tricking other individuals throughout the galaxy. He was somewhat paranoid, however, and this trait motivated him to use his credits to buy himself a considerably-sized posse of mercenaries and droids as well as a compound for his own use.\nBounty #239 was created for a story in the non-canon Star Wars Mythos project as Boba Fett's bounty. The story's general style and aesthetics were inspired by the Spaghetti Western film genre, and Fett's outfit was particularly drawn from actor Clint Eastwood's \"Man with No Name\" character.\nThe authors deliberately left some aspects of the story unclear, such as when Fett planned to raid Bounty #239's compound and whether the bounty hunter actually went ahead with his plans.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Bounty_239%27s_compound",
  "/wiki/Star_system/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Army/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Trandoshan_twins",
  "/wiki/Mission_to_Ryloth_(Boba_Fett)",
  "/wiki/Ryloth/Legends",
  "/wiki/IG-88_assassin_droid/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Electromagnetic_pulse_grenade",
  "/wiki/Death/Legends",
  "/wiki/EE-3_carbine_rifle/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_Wars_Mythos",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_139",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_Essential_Atlas"
 ]
}