{
 "name": "Bow_(clone_stormtrooper)",
 "display_name": "Bow  (clone stormtrooper)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "501st Legion",
      "501st Legion"
     ]
    }
   ]
  }
 ],
 "content": "\"Bow\" was the nickname of a clone stormtrooper who served as a commander within the Galactic Empire's 501st Legion. A loyal and obedient soldier, he rose to his rank by around the time of Order 66, which Emperor Palpatine used to brand all Jedi as traitors to the Empire and initiate the galaxy-wide Jedi Purge. One month into the purge, Bow was part of a 501st stormtrooper squad that Clone Commander Appo took to Kessel. There, Bow and his fellow troopers rescued the Dark Lord of the Sith Darth Vader from a batch of Jedi Knights who had survived Order 66. Bow and his comrades gunned down Jedi Masters Jastus Farr, Tsui Choi, and Roblio Darté, executing them in mid-battle with Vader. Following the incident, Bow personally filed reports on several of the Jedi victims, and he continued to serve in the 501st after Appo's death at the Battle of Kashyyyk.\nThe clone stormtrooper nicknamed \"Bow\" was born on the planet Kamino. By 19 BBY, he had gained the rank of commander within the 501st Legion, one of the most decorated units of the Galactic Empire's newly founded Stormtrooper Corps.\nOne month after the formation of the Empire, Bow was part of a 501st squad that Emperor Palpatine sent to Kessel, a planet in the Outer Rim. Serving under Clone Commander CC-1119—nicknamed \"Appo,\" the overall commanding officer of the 501st Legion—Bow and the other clone stormtroopers in the squad received orders to retrieve Palpatine's apprentice, the Dark Lord of the Sith Darth Vader. Vader had fallen afoul of a group of Jedi Knights who had survived the issuance of Order 66, a directive that Palpatine had used to brand all Jedi as enemies to the Empire and launch the ongoing Jedi Purge.\nBy the time Bow and his comrades arrived at the abandoned spice mine on Kessel where the Jedi renegades had gathered, Vader was severely injured and at the mercy of the three surviving Jedi. From their position on a platform overlooking the mine, Bow and the other troopers drew their DC-15Ss and gunned down Jedi Masters Jastus Farr, Tsui Choi, and Roblio Darté, executing all three before they could further harm Vader. With the standoff concluded, Appo informed Vader that the Emperor had requested his presence. Vader subsequently returned to the galactic capital, Imperial Center, to report to Palpatine.\nAfter the Kessel incident, Bow filed reports on the termination of Choi and two of the other Jedi victims, Koffi Arana and Bultar Swan, who had fallen prior to the 501st's arrival. Later, when Vader killed Jedi Master Roan Shryne—who had decapitated Appo before being murdered—at the Battle of Kashyyyk, Bow also filed the report on Shryne's execution. Imperial Moff Marcellin Wessel incorporated Bow's official documentations into a compilation of incident reports on the success of Order 66 and the continuing Jedi Purge.\nA Human male clone of the bounty hunter Jango Fett, Bow stood 1.83 meters tall. A loyal soldier, he obeyed Darth Vader's orders to the letter and without question in his service to the Galactic Empire. He possessed enough capability to become an officer within the 501st Legion.\nBow sported the trademark blue-and-white armor of the 501st Legion. His set of stormtrooper armor was equipped with a macrobinoculars visor, a kama half kilt, and a pauldron. He also had holsters for his weaponry of choice: a chest sling for his DC-15A blaster rifle and a pair of waist holsters for his dual blaster pistols. During the mission to Kessel, he carried a DC-15S blaster.\nThe character of Commander Bow was created by author Daniel Wallace for his Star Wars Insider article Order 66: Destroy All Jedi, released in April 2006 in the magazine's eighty-seventh issue. Wallace introduced the character because he needed another clone officer to report on the death of Commander Appo, who had already registered several reports within the in-universe article. In 2007, Bow was featured in his own figure pack—alongside Darth Vader—of Hasbro's 30th Anniversary Collection.\nFor some time, there was ambiguity as to the identity of the clone stormtrooper commander who leads the 501st squad in the December 2005 comic Star Wars: Purge. The character goes unnamed within the comic's dialogue, hence leaving his identity ambiguous, with the possibility of the unidentified character being Appo, Bow, or another 501st commander. Further complicating the problem was the fact that, at the time, Purge did not have an established timeline in relation to the November 2005 novel Dark Lord: The Rise of Darth Vader, in which Appo is killed; both Purge and Dark Lord are stated to take place one month after the events of the film Star Wars: Episode III Revenge of the Sith. The Purge commander's identity was resolved in 2006 when Hasbro released a figure of Appo as part of its Saga Collection. The figure package identified Appo as the commander in charge of the 501st squad in the comic.\nIn December 2008, Bow received a short entry in The Complete Star Wars Encyclopedia, which established that he appears in Purge himself as one of the clone stormtroopers serving under Appo. However, the exact trooper in the comic who is Bow has yet to be specified.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Bow_(disambiguation)",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Clone_stormtrooper",
  "/wiki/Stormtrooper_commander/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Time/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-1119/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Conclave_on_Kessel",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jastus_Farr",
  "/wiki/Tsui_Choi",
  "/wiki/Roblio_Dart%C3%A9",
  "/wiki/Death/Legends",
  "/wiki/Casualty_Report:_Order_66",
  "/wiki/Battle_of_Kashyyyk_(19_BBY)",
  "/wiki/Planet/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Legion/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Unidentified_Kessel_spice_mine",
  "/wiki/Spice_Mines_of_Kessel",
  "/wiki/DC-15S",
  "/wiki/Emperor/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Koffi_Arana",
  "/wiki/Bultar_Swan/Legends",
  "/wiki/Roan_Shryne",
  "/wiki/Moff/Legends",
  "/wiki/Marcellin_Wessel",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Color/Legends",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Macrobinoculars/Legends",
  "/wiki/Kama/Legends",
  "/wiki/Pauldron/Legends",
  "/wiki/Holster/Legends",
  "/wiki/DC-15A_blaster_rifle/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Daniel_Wallace",
  "/wiki/Star_Wars_Insider",
  "/wiki/Order_66:_Destroy_All_Jedi",
  "/wiki/April",
  "/wiki/2006",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/CC-1119",
  "/wiki/In-universe",
  "/wiki/2007",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/December",
  "/wiki/2005",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Purge",
  "/wiki/November",
  "/wiki/Dark_Lord:_The_Rise_of_Darth_Vader",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_The_Saga_Collection",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Retcon",
  "/wiki/Star_Wars:_The_Ultimate_Action_Figure_Collection",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/The_Essential_Atlas",
  "/wiki/Jedi_Council_Forums",
  "/wiki/February_11",
  "/wiki/2013"
 ]
}