{
 "name": "Bowdaar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3838 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Voidhound",
      "Eternal Alliance",
      "Galactic Republic",
      "Task Force Nova",
      "Task Force Nova"
     ]
    }
   ]
  }
 ],
 "content": "Bowdaar was a male Wookiee slave forced by his masters into becoming a gladiatorial fighter in arenas spanning the galaxy. His prowess as a warrior and undefeated record earned him the names \"The Killer from Kashyyyk,\" \"Deathmountain,\" and \"Boneshatterer.\"\nCaptured as a child from his homeworld of Kashyyyk, Bowdaar was forced into a life of violence, fighting for survival in gladiator arenas from one side of the galaxy to the other. He proved himself to be a very capable fighter. Over more than a century, Bowdaar fought in single combat in more than ten thousand matches against such formidable opponents as rancors, Mandalorians, gundarks and even a Jedi. In all that time he never lost a match.\nAlmost more impressive was the fact that Bowdaar often fought without a single weapon or piece of armor. Amongst the more ignorant and gullible denizens of the criminal underworld, rumors spread that he was some form of immortal being. Those who faced Bowdaar in combat and lived to tell about it said he was simply the best fighter around.\nBy 3643 BBY, Bowdaar ended up a pet gladiator to Drooga the Hutt to pay off a gambler's debt. He kept Bowdaar in a cage between matches and used him cruelly and pettily. Drooga was annoyed that Bowdaar slew all his opponents too quickly, depriving him of the full entertainment value of the fights. He took many steps to keep Bowdaar at a disadvantage, such as depriving him of any weapons and draining half his blood to keep him weak, and even poisoning him outright.\nIt was at this time when a smuggler captain arrived on Nar Shaddaa to barter a male shanjaru for a prototype engine. Upon locating Drooga's barge in the Nikto Sector, Bowdaar was to fight a gang of Kaleesh warriors. Though the Wookiee could've taken them by himself, the smuggler chose to intervene. Bowdaar later assisted the smuggler against Zank Helrott, Rogun the Butcher's bounty hunter.\nFinally, Drooga decided to do away with the Wookiee in one last magnificent fight to the death with his pet gundark, which he had kept starving for the occasion. The smuggler captain assisted Bowdaar in his fight with the gundark, which simultaneously infuriated Drooga while also providing him with suitable entertainment for the evening. Once the gundark was dead, Drooga decided that the Wookiee was no longer worth the costs to maintain him and simply turned him loose, who then joined the smuggler's crew.\nBowdaar was a loner and having grown up as a slave owned by one master or another for decades, considered himself to have no home, family or friends. His success in the fighting pits earned his various masters untold wealth, but he never shared in the spoils of his victories. What he did own was the heart and strength of a warrior and an unparalleled will to survive.\nBowdaar was first mentioned in a The Holonet entry on the official Star Wars: The Old Republic website. His entry has several phrases written in Aurebesh which read \"Good luck redhead,\" \"Karssk's Prey\" and \"Great Feastmaster's collateral.\"\nBowdaar becomes the second companion for the Smuggler character in Star Wars: The Old Republic, following the completion of the storyline on Nar Shaddaa.\nBowdaar appears again in Star Wars: The Old Republic: Knights of the Fallen Empire as an Alliance quest when the player has to participate in the Zakuulan arena in order to recruit him as a companion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Bowdaar",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Bowdaar",
  "/wiki/Kashyyyk/Legends",
  "/wiki/3838_BBY",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Voidhound",
  "/wiki/Eternal_Alliance",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Task_Force_Nova",
  "/wiki/Slavery/Legends",
  "/wiki/Gladiator/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Gundark/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/3643_BBY",
  "/wiki/Drooga",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Shanjaru",
  "/wiki/Kaleesh/Legends",
  "/wiki/Zank_Helrott",
  "/wiki/Rogun_Matt%27rik",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Aurebesh/Legends",
  "/wiki/Karssk",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Arena_Grand",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/The_Art_and_Making_of_Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}