{
 "name": "Bowspritz",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tynnan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Bowspritz was a Tynnan Jedi Master, a noted biologist, and the beastmaster at the Coruscant Jedi Temple in the years proceeding the Ruusan Reformation. Contributing countless research to the Jedi Order during many years of service, Bowspritz was immortalized in the Order after authoring several chapters of the Temple guidebook titled The Jedi Path: A Manual for Students of the Force. Passing down information on the species of the galaxy, Master Bowspritz left a lasting impression on future generations through this ageless text.\nBowspritz joined the Jedi Order at a very young age, coming to be accepted as a Padawan sometime before the outbreak of the New Sith Wars. While apprenticed to a Jedi Master, the young Jedi spent a month studying the needler crabs of Jodaka and updating the outdated material found in the Jedi Archives with the data gathered there. Additionally, Bowspritz discovered and named the o'cerrys of Alchenaut, after finding a slumbering exogorth deep in space. Like most Jedi of the era, Master Bowspritz served the Order as a member of the Army of Light, regardless of a past in studying the ways of the Jedi Consular, in the crusades against the Brotherhood of Darkness. Once the Ruusan Reformations took effect, Master Bowspritz returned to the Temple to continue studies on biology and galactic cultures.\nAt some point in Bowspritz's career, a run-in with a group of Squibs helped avoid several bad situations. However, Bowspritz would later recollect that these dealings with the Squibs created some strain on the credit-line received from the Temple. Bowspritz earned the honorific beastmaster after extensive research into the manifestations of the Force in galactic fauna. During a mission to the Exploration Corps outpost on Ord Canfre, Master Bowspritz encountered for the first time an akk dog and discovered how the Force played a part in the bonds they formed with their trainers.\nWhen Bowspritz's contemporary Masters proposed that a guidebook to the life of the Jedi be written, the biologist agreed to work on the project, contributing three chapters. Describing in turn galactic bestiary, culture, and politics, Master Bowspritz's insights as a biologist and a Consular were meant to serve as the starting point for research into relations with different species, both sentient and non, Force-sensitive and mysterious.\nWhile it did not make it into the finished edition, Daniel Wallace, author of The Jedi Path: A Manual for Students of the Force, released a list detailing the genders and species of each of the authors of the in-universe The Jedi Path: A Manual for Students of the Force. Master Bowspritz is revealed to be a male Tynnan from the world of Tynna.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tynnan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_biologist",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Standard_year/Legends",
  "/wiki/Ruusan_Reformation",
  "/wiki/Author/Legends",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force",
  "/wiki/Species/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Jodakan_needler_crab",
  "/wiki/Jodaka",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/O%27cerry",
  "/wiki/Alchenaut",
  "/wiki/Exogorth/Legends",
  "/wiki/Army_of_Light/Legends",
  "/wiki/Jedi_Consular",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/Squib/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Exploration_Corps/Legends",
  "/wiki/Ord_Canfre/Legends",
  "/wiki/Akk_dog/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Daniel_Wallace",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/Tynna/Legends",
  "/wiki/Star_Wars:_Force_and_Destiny_Core_Rulebook",
  "/wiki/StarWars.com",
  "/wiki/Jedi_Council_Forums"
 ]
}