{
 "name": "Boyle_Marcom",
 "display_name": "Boyle Marcom",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5000 BBY",
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Boyle Marcom was a Human male navigation officer who served for decades as part of the Sith Empire's navy during the time of the Great Hyperspace War. In 5000 BBY, the then-aged and physically frail Marcom was selected as the helmsman for a Lignan crystal mining and transport mission by Yaru Korsin, the son of Eldrak Korsin, an admiral under whom Marcom had served in the past. However, a Jedi attack nudged Marcom's ship, the Omen, off course as it jumped to hyperspace. The Omen crashed on an uncharted planet, and the blame was laid squarely at Marcom's feet by some of the ship's crew. After surviving the crash, Marcom was confronted and killed by miner Devore Korsin, Yaru Korsin's brother.\nA Human male, Boyle Marcom served in the navy of the Sith Empire as a helmsman in the years before and during the Great Hyperspace War. Marcom began navigating Sith starships during the middle of Dark Lord of the Sith Marka Ragnos's reign, and continued under Ragnos's successor, Naga Sadow. In 5000 BBY, Sadow led an invasion of the galaxy at large—the Great Hyperspace War—and Boyle Marcom served as part of the Sith fleet. That year, Marcom joined the crew of the Sith dreadnaught Omen, serving as the navigation officer for a mission to mine and transport Lignan crystals from the planet Phaegon III's largest moon. The mission was commanded by Yaru Korsin, the son of Eldrak Korsin, an admiral under whom Marcom had previously served. Although Marcom had not been at his best in years, his relationship with the elder Korsin was what drove Yaru to select him as helmsman for the Lignan expedition. However, as the Omen was about to depart Phaegon III to deliver the crystals to the planet Kirrek, the Jedi attacked the Omen and its sister ship, the Harbinger. During the skirmish, one of the Jedi, apprentice Drev Hassin, suicidally crashed his starfighter into the Harbinger.\nAlthough Marcom was able to get the Omen to hyperspace, the Harbinger nudged the ship off-course. The Omen was badly damaged by a gravity well in hyperspace, which pulled the ship back into realspace near an uncharted planet. As Marcom fiddled with his controls, trying to fix the problem, he was confronted by a furious member of the mining team, Yaru Korsin's brother, Devore Korsin. Devore was stopped before he could do any harm to Marcom, and the Omen drifted into the planet's atmosphere, where the frail Marcom was thrown about the bridge by rushing winds. Injured but not dead, Marcom survived the Omen's crash in a mountain range and the treacherous journey from the ship's wreckage to the valley below. Although they had gotten through the ordeal, Devore's rage at Marcom did not diminish. Korsin gathered several of his miners and confronted Marcom, blaming him for the ship's crash while the miners held the helmsman back. Marcom tried to defend himself, but to no avail—the furious and high-on-spice Korsin ignited his lightsaber and killed him, his own lightsaber rolling harmlessly to Yaru Korsin's feet.\nBoyle Marcom was mild-mannered and timid by Sith standards, and he was physically frail by the time of the Great Hyperspace War. Marcom became frustrated when arguing with a being he saw as intractable or irrational, as was the case with Devore Korsin.\nHe owned a lightsaber, which could imply he was also a force-sensitive. Moments before his death, at the hands of Devore Korsin, he was accused of using it to attack first.\nBoyle Marcom first appeared in Lost Tribe of the Sith: Precipice, a 2009 eBook written by John Jackson Miller. So far, it is his only appearance in Star Wars canon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/5000_BBY/Legends",
  "/wiki/Kesh",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Navigation_officer",
  "/wiki/Standard_year/Legends",
  "/wiki/Navy/Legends",
  "/wiki/Time/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Helmsman/Legends",
  "/wiki/Lignan_crystal",
  "/wiki/Mining/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Yaru_Korsin",
  "/wiki/Eldrak_Korsin",
  "/wiki/Admiral/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Skirmish_over_Phaegon_III",
  "/wiki/Starship/Legends",
  "/wiki/Omen",
  "/wiki/Hyperspace/Legends",
  "/wiki/Death/Legends",
  "/wiki/Devore_Korsin",
  "/wiki/Sith/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Marka_Ragnos",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sith_invasion_fleet",
  "/wiki/Sith_dreadnaught",
  "/wiki/Officer/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Phaegon_III",
  "/wiki/Phaegon_III%27s_largest_moon",
  "/wiki/Crystal/Legends",
  "/wiki/Kirrek",
  "/wiki/Harbinger_(Sith_dreadnaught)",
  "/wiki/Padawan/Legends",
  "/wiki/Drev_Hassin",
  "/wiki/Suicide/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Gravity_well/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Takara_Mountains",
  "/wiki/Spice/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lost_Tribe_of_the_Sith:_Precipice",
  "/wiki/2009",
  "/wiki/EBook",
  "/wiki/John_Jackson_Miller",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/Crosscurrent"
 ]
}