{
 "name": "Braden",
 "display_name": "Braden",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "later bald"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Braden was a male Human bounty hunter active during the Great Galactic War and the Cold War.\nAt some point during his career, Braden worked with the Trandoshan Qyzen Fess. During the Great Galactic War, Braden was on a mission hunting down the Wookiee Dalborra on Dantooine. He was observing Dalborra with electrobinoculars when he received a message on his hand-held holoprojector from his client, Commander Gin Lesl of the Republic Special Forces Division. She informed him of the Treaty of Coruscant, telling him there was a cease-fire between the reconstituted Sith Empire and the Republic and told him to call off the hunt. He refused, saying there were more sources that had put a bounty on the mighty Dalborra. Lesl, knowing that killing Dalborra would strain relationships between the two forces, ordered her pilot to fire a concussion missile barrage at Braden's coordinates. Braden survived, but his quarry found him, holding a rifle in hands.\nDalborra then escorted Braden, putting him aboard a Sith warship that was transferring Human prisoners to Korriban. While passing through the Kuat sector of the Core Worlds, the warship they were traveling on attacked the Envoy, a Republic transport ship.\nWhile on the Sith warship, he was held in a detention cell near the cell of Jedi Master Dar'Nala and witnessed her torture at the hands of the warship's captain. The captain wanted the Jedi to admit it was the transport ship that attacked his warship instead of the other way around. Between torture sessions, Braden asked Dar'nala why she didn't simply tell the Sith captain what he wanted to hear and she replied it was because she knew the truth, a truth that she claimed the Republic needed to know about. Being too weak to escape the Sith ship, she instead used the Force to open Braden's cell on the condition he promise to take word of the Sith's treachery back to Jedi Master Zym and Jedi Knight Satele Shan on Coruscant. He agreed and stole a Mark VI Supremacy-class starfighter from the warship's hangar. What he didn't tell the Jedi was that he intended to make a quick stop on Nar Shaddaa before traveling to Coruscant to fulfill his promise.\nBraden eventually made it to Coruscant and went to the ruins of the Jedi Temple to talk to Zym, the Jedi's Grand Master. When he found Zym, he also found the Republic captain that had been responsible for his misfortune on Dantooine, and killed her. He then turned to Zym to give him Dar'Nala's message, but Zym tried to arrest him for shooting the Republic captain. After being knocked against a wall, Braden fired a wrist rocket at Zym, killing the Grand Master. He left Coruscant without telling anyone that Sith Lord Darth Baras had been behind the attack on the Envoy. Meanwhile, a bomb planted by Sith agents destroyed a huge chunk of the Galactic Senate. His departure was also monitored by his perennial foe Dalborra.\nBraden returned to Nar Shaddaa and informed a friend of his of the message he was going to deliver. Sometime later, Braden was tracked down and arrested by Jedi Master Orgus Din, who demanded that he tell him the name of his employer. Braden revealed that he had nothing to do with the bombing of the Senate tower and that he could help him track down the one who was disrupting the treaty, but they had to go to Dantooine. Din did as he requested, and Braden met Satele Shan, Dar'Nala's former apprentice. Braden remembered that Dar'Nala also wanted Satele to know the truth, and informed her of Baras' treachery.\nBraden later escaped Din's custody and finally captured Dalborra. Meanwhile, Dar'Nala was revealed to be the real villain behind the treaty's disruption and was killed.\nAt some point, the Trandoshan Qyzen Fess worked as a bounty hunter for Braden, but Fess eventually abandoned his service in order to hunt a rancor.\nRoughly a decade into the Cold War, Braden had found a new protege worthy to compete in the Great Hunt hosted for hunters across the galaxy. He brought his protege to Nal Hutta to be introduced to his new crew, Mako, a savvy female slicer Braden found on Nar Shaddaa, and Jory, a Nikto weapons-expert. Mako later told the bounty hunter that when Braden told her and Jory about the bounty hunter, he was grinning from ear to ear—he couldn't stop smiling, he was so happy. But while his protege was out to collect the bounty on a man named Vexx to curry the favor of Suudaa Nem'ro the Hutt, Braden and Jory were killed by Tarro Blood, a Mandalorian who was seeking to eliminate all the competition. Braden's protege and Mako discovered Blood's crime and vowed to avenge both Braden and Jory. Mako provided a proper burial for Braden and Jory while his protege managed to win the Great Hunt sponsorship.\nBraden was a bounty hunter at the time of the Great Galactic War. His possessions included double blaster pistols, a flamethrower, electrobinoculars, a set of heavy armor with a breathing tube incorporated in it, and a portable holoprojector.\nBraden was featured in a development diary released by BioWare. He is voiced by Norm Woodel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Braden",
  "/wiki/3643_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Gin_Lesl",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Trandoshan/Legends",
  "/wiki/Qyzen_Fess",
  "/wiki/Wookiee/Legends",
  "/wiki/Dalborra",
  "/wiki/Dantooine/Legends",
  "/wiki/Electrobinoculars/Legends",
  "/wiki/Holoprojector/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Pilot/Legends",
  "/wiki/Concussion_missile/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Harrower-class_dreadnought",
  "/wiki/Korriban",
  "/wiki/Kuat_sector/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Envoy_(Republic_transport_ship)",
  "/wiki/Republic_transport_ship",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Dar%27Nala",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Mark_VI_Supremacy-class_starfighter",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Zym",
  "/wiki/Grand_Master/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Wrist_rocket",
  "/wiki/Darth_Baras",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Orgus_Din",
  "/wiki/Rancor/Legends",
  "/wiki/Hunter_(individual)",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Mako_(slicer)",
  "/wiki/Jory",
  "/wiki/Nikto/Legends",
  "/wiki/Vexx",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Hutt/Legends",
  "/wiki/Tarro_Blood",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Flamethrower/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Breathing_tube/Legends",
  "/wiki/BioWare",
  "/wiki/Norm_Woodel",
  "/wiki/Star_Wars:_The_Old_Republic,_Threat_of_Peace",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_1:_Treaty_of_Coruscant",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_2:_New_Galactic_Order",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_3:_Uncertain_Surrender"
 ]
}