{
 "name": "Brador",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue",
      "Orange",
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree Village tribe"
     ]
    }
   ]
  }
 ],
 "content": "Brador was an Ewok male member of the Bright Tree Village tribe on the Forest Moon of Endor. In 3 ABY, when the young Ewok Teebo was made leader for a day, Brador's bordok was being uncooperative with him. Teebo tried to help, but he mistakenly made the bordok cause trouble all over the Ewok town of Bright Tree Village. In anger, Brador organized a riot that tried to capture Teebo to prevent him from causing any more trouble, though Teebo eventually solved the problem for Brador himself by escaping on a hang glider.\nBrador was an Ewok male who lived among the Bright Tree Village tribe in the settlement of Bright Tree Village on the Forest Moon of Endor. In 3 ABY, the leader of the village, Chief Chirpa, went away for a day to visit the Spirit Tree. At random, he selected the young scout Teebo to act as the head of the village in his absence. That day, Brador was attemping to get his bordok to move a wagon of squash melons to a storage hut for him, but the bordok acted stubbornly and refused to move. Teebo went up to Brador, inquiring about his trouble.\nThe young leader told him that the solution was simple—all he had to do was show the bordok who was in charge. Brador was confused by his answer, so Teebo gave a visual demonstration, whacking the bordok's rear end. However, the bordok reared back on its legs and began galloping away, causing the squash melons to fall out of the wagon while Brador explained to Teebo that whacking his bordok was the one thing that could not be done to it. He ran after the wagon, angry at Teebo and warning the villagers that a runaway bordok was on the loose. Its wagon wound up destroying someone's laundry, a brand new hut, and pottery, eventually calming down and stopping. When Brador was asked who was responsible for all of the mayhem, he told them that Teebo had started it, asking that they seize him before he made anything worse.\nA small riot began, which ran after Teebo in the hopes of capturing him. Teebo tried to escape, asking his friends, Kneesaa a Jari Kintaka and Wicket Warrick, for help, but Kintaka first asked the rioters what they had against Teebo. One of them assured the princess that they meant no harm, with Brador adding that they only intended on imprisoning him to prevent him from destroying the village.\nWarrick asked that they all calm down in order to discuss the matter at hand in a civilized manner, but Brador then noticed and pointed out that Teebo was escaping on a hang glider. Warrick shouted for him to come back, but two of the other Ewoks disagreed, glad to be rid of him and his chaos. Kintaka scolded the Ewoks for being unfair to Teebo, but Brador maintained his position, noting that they would all be safer the longer he was away from the village.\nLater that day, all of the Ewoks in the village were put under the influence of necklaces that contained the stones of obedience and were forced to load gems for the alien Zornak. However, Teebo was able to save them all by using the stones against Zornak and freeing the Ewoks of the mind control, allowing them to return to the village. The general feeling toward Teebo shifted from disgust to celebration.\nBrador became very angry at Teebo when he caused his bordok to run all over the village causing trouble, going as far as recruiting the other Ewoks to lead a revolt against their temporary leader. He felt that the longer Teebo was gone, the safer the village would be, a sentiment that was shared by other villagers. He had blue fur save for his mustache, which was orange, and eyebrows, which were black. Brador also had light skin and black eyes.\nBrador used a bordok and wagon to transport his squash melons and wore a gray hood over his head. His clothing also utilized a cross strap and belt.\nBrador appeared in the fourteenth issue of the Ewoks comic series, which was written by David Manak, illustrated by Warren Kremer, and published by Marvel Comics on March 31, 1987.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ewok",
  "/wiki/Gender",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Bright_Tree_Village_tribe",
  "/wiki/Ewok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Endor/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Teebo/Legends",
  "/wiki/Chief/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Bordok/Legends",
  "/wiki/City/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Hang_glider",
  "/wiki/Chirpa/Legends",
  "/wiki/Spirit_Tree_(Endor)",
  "/wiki/Scout/Legends",
  "/wiki/Wagon/Legends",
  "/wiki/Squash_melon",
  "/wiki/Limb/Legends",
  "/wiki/Fruit/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Necklace/Legends",
  "/wiki/Stones_of_obedience",
  "/wiki/Gemstone/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Zornak",
  "/wiki/Eye/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Ewoks_14",
  "/wiki/Ewoks_(Marvel)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/David_Manak",
  "/wiki/Warren_Kremer",
  "/wiki/Marvel_Comics",
  "/wiki/March_31",
  "/wiki/1987",
  "/wiki/Category:Images_of_Brador",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Publications_Timeline",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Marvel_Age",
  "/wiki/June"
 ]
}