{
 "name": "Braedic_Ekirk",
 "display_name": "Braedic Ekirk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Galactic Vacant Building Demolishing Movement",
      "Galactic Vacant Building Demolishing Movement"
     ]
    }
   ]
  }
 ],
 "content": "Braedic Ekirk was a Human male Imperial officer who served the Empire during the Galactic Civil War.\nBraedic Ekirk was an Imperial officer during the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire. After the Battle of Yavin, the man had achieved the rank of colonel and was stationed in the city of Dearic, on the planet Talus.\nIn 1 ABY, Colonel Ekirk was approached by Galiir Ac Yandar, the commander of the Nightstrike Soldier Hegemony , a Talusian mercenary organization affiliated with the Empire. Ac Yandar was seeking to make his unit a full military branch of the Imperial armed forces rather than a separate entity. Galiir Ac Yandar met Ekirk to negotiate the new operational status of the Nightstrike Soldier Hegemony. Although Ekirk deeply despised Galiir, he considered that the N.S.H. could be a valuable asset for the Empire. However, the negotiations were disturbed when slicers of the Aggregate Civil Liberties Organization , an anti-Imperial movement, planted information that almost ruined Yandar's reputation with the Empire. Colonel Ekirk thus dispatched a spacer to raid the A.C.L.O. office. The spacer was recommended by CorSec officer Dathnaeya Loessin, who wanted to determine what kind of people the Rebellion and the Empire had chosen to work with. Galiir Ac Yandar ordered the spacer to kill Leeta Poandeu, the slicer who had sliced his system, and then contact and assist Mark Hieks, an N.S.H. spy in the A.C.L.O. office. Ekirk also tasked the spacer with slaying A.C.L.O. terrorists who sabotaged Imperial shipments. The spacer served Ekirk dutifully, achieved all those objectives and was eventually rewarded for the assistance.\nLater the same year, Darth Vader, via an Imperial Admiral, put Colonel Ekirk in charge of demolishing abandoned buildings throughout the Empire in order to prevent the Rebellion from using them as safe houses. Ekirk contracted Galactic Vacant Building Demolitions to demolish buildings from orbit using planetary bombardment techniques. He also came up with the idea of the Galactic Vacant Building Demolishing Movement, whose job was to provide the Empire with information as to the locations of abandoned buildings. However, one year later, the project was considered a failure.\nThe Colonel Braedic Ekirk appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Braedic Ekirk was added to the game as part of the \"Crisis of Allegiance\" arc with the release of \"Chapter 2: The Talus Incident,\" on August 1, 2006. Ekirk later appeared in Move It or Lose It, a small in-universe introduction to the 2007 House Pack-Up event in Star Wars Galaxies.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Vacant_Building_Demolishing_Movement",
  "/wiki/Galiir_Ac_Yandar",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Officer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Imperial_Office",
  "/wiki/Dearic/Legends",
  "/wiki/Talus/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Nightstrike_Soldier_Hegemony",
  "/wiki/Mercenary/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Aggregate_Civil_Liberties_Organization",
  "/wiki/A.C.L.O._office",
  "/wiki/Corellian_Security_Force",
  "/wiki/Dathnaeya_Loessin",
  "/wiki/Leeta_Poandeu",
  "/wiki/Mark_Hieks",
  "/wiki/Spy/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Galactic_Vacant_Building_Demolitions",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_1",
  "/wiki/2006",
  "/wiki/Move_It_or_Lose_It",
  "/wiki/In-universe",
  "/wiki/2007",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Smoke_%27Em_Out",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}