{
 "name": "Brant_Korra",
 "display_name": "Brant Korra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Rori"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Brant Korra was an Imperial officer who lived during the Galactic Civil War.\nAfter the Battle of Yavin, Brant Korra was holding the rank of general and commanded a small Imperial Base located on Naboo's moon of Rori. In 1 ABY, Imperial and Rebel agents on Rori were involved in the hunt for Cal Handro, a smuggler who had vanished after crash-landing on Rori while transporting a new kind of spice for the Rebel Alliance. Officer M'Kae, one of General Korra's subordinate, was leading the investigation for the Empire. In the meantime, Rebel Officer Wolff Kalos had a similar mission for the Alliance.\nAt some point, Cal Handro was extracted from a Rebel Safe House by Imperial agents sent by Officer M'Kae. In order to find Handro, Wolff Kalos dispatched Rebel spacers to interrogate Officer M'Kae because he suspected him to be involved. Since the Imperial officer was not eager to reveal anything, Kalos ordered his agents to attack the Imperial Base where M'Kae was stationed in order to collect incriminating evidence. The assault was successful and the Rebel agents managed to collect M'Kae's journal. General Korra was killed during the attack.\nCal Handro was eventually killed in his starship during a space battle between Imperial and Rebel forces in the Naboo system.\nBrant Korra was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Brant Korra was added to the game with the fourth chapter of the \"Secrets of the Syren\" quest line, released with the \"Publish 21,\" on August 4, 2005. The \"Secrets of the Syren\" story arc was removed from the game with the \"Chapter 1,\" published on June 8, 2006, due to the major changes planed for Rori with the introduction of the Battle of Restuss.\nIn the fourth quest of the \"Secrets of the Syren\" arc, the player had to choose to work with either Rebel Officer Wolff Kalos or Imperial Officer M'Kae. This article assumes that the player was affiliated the Rebel Alliance. If the player instead chose the Empire, he/she would have to attack a Rebel base and kill Alliance General Garax Hadriin instead of killing General Brant Korra in the Imperial base. The part of the quest involving General Brant Korra and the Imperial base could be skipped by bribing Officer M'Kae for information.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/1_ABY/Legends",
  "/wiki/Rori/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/General/Legends",
  "/wiki/Imperial_Base_(Rori)",
  "/wiki/Naboo/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Cal_Handro",
  "/wiki/Smuggler/Legends",
  "/wiki/Syren_spice",
  "/wiki/M%27Kae/Legends",
  "/wiki/Wolff_Kalos",
  "/wiki/Canon",
  "/wiki/Rebel_Safe_House",
  "/wiki/Cal_Handro%27s_Warlord_Heavy_Cruiser",
  "/wiki/Naboo_system/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_4",
  "/wiki/2005",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Battle_of_Restuss",
  "/wiki/Rebel_Base_(Garax_Hadriin)",
  "/wiki/Garax_Hadriin",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed"
 ]
}