{
 "name": "Brazack",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Before 30 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireGhost Battalion",
      "Ghost Battalion"
     ]
    }
   ]
  }
 ],
 "content": "First Lieutenant Brazack was male who served as a commanding officer of Second Platoon, B Company, of the Imperial Army Imperial Special Operations Ghost Battalion during the Galactic Civil War. Unlike almost all officers in the Battalion, he was not a graduate of the Imperial Academy on Carida; instead, he was an enlisted man who received a field promotion following a battle that saw all of his unit's officers killed. He later was promoted to first lieutenant following an action that resulted in four posthumous Medals of Valor for others in his unit.\nIn 1 BBY, he led the assault to abduct Morgan Katarn, disguised as Rebel volunteers. Before the mission he had registered a formal complaint that the unit's poor disguise might jeopardize the mission; namely the all-Human composition of the team, and the standard-issue weapons that were dissonant with their mismatched clothes and armor.\nHis team boarded a captured Corellian light freighter, disguised as one of the Alliance commerce vessels, and launched from Jerec's Vengeance Imperial-class Star Destroyer for Sulon. His team broke into the Katarn homestead and as Brazack tried to enter the workshop, the droid WeeGee hurled against him a mechanism, which however was not enough to harm him over his armor. The droid was soon neutralized, and as they failed to find Katarn, the team put the house on fire and left.\nBrazack reported their failure to Captain Thrawn theorizing that their target had left the area on some sort of errand. Jerec in response offered them an \"opportunity\" to try again and succeed. Indeed Jerec launched a heavey assault and Brazack was once more in Vester's ship, who carried them to the Geothermal tap held by the Rebels. Although they attempted to hit the ship with a SLM, Vester managed to land successfully and Brazack's commandoes massacred the defendants.\nBrazack maintained a close relationship with his men, who called him the more intimate title \"boss.\" It was one of the reasons  that many of his fellow officers resented him.\nLike many infantry officers, he resented the defensive tilt that showed the ship's underside to enemy fire, and planned to teach Vester a lesson for doing so during the battle of the G-Tap.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/30_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Ghost_Battalion",
  "/wiki/First_Lieutenant/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Imperial_Special_Operations",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Carida/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Medal_of_Valor/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Morgan_Katarn",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Light_freighter/Legends",
  "/wiki/Jerec_(Inquisitor)",
  "/wiki/Vengeance_(Imperial-class,_Jerec)",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Sulon",
  "/wiki/Katarn_family_compound",
  "/wiki/Droid/Legends",
  "/wiki/WeeGee",
  "/wiki/Captain/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Geothermal_tap",
  "/wiki/SLM",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire"
 ]
}