{
 "name": "Bree Starlighter",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde and purple"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Star Tours"
     ]
    }
   ]
  }
 ],
 "content": "Bree Starlighter, nicknamed the \"Princess of PR,\" was a female Human who served as Chief Holo-Communications Officer and galactic travel liaison for the interstellar Star Tours travel firm. She worked for Star Tours by 1 BBY and featured in advertisements produced by the company, as well as promoting the opening of the spaceline's first hub in the Earth system. Starlighter was politically supportive of the Galactic Empire, as well as its principal leaders, Emperor Palpatine and Sith Lord Darth Vader. Unlike other skeptical life forms, she held the Wookiee species in high regard and found them to be friendly to strangers.\nBree Starlighter was a Human female who, circa 1 BBY, worked as Chief Holo-Communications Officer and galactic travel liaison for Star Tours, an interstellar space travel company affiliated with the Galactic Tourist Bureau. Around that time, Starlighter promoted the opening of Star Tours' first hub in Spaceport THX1138, located in the Earth system, with two of her co-workers beside her at the ceremony, droids C-3PO and R2-D2. She hosted the event, answered questions from the public, and offered discounts on flights.\nStarlighter sometimes traveled while accompanied by a member of the Wookiee species to promote their homeworld of Kashyyyk as a suitable tourist destination. She did so to help convince skeptics that Wookiees were not aggressive toward strangers. Starlighter also participated in some Star Tours advertisements, in which she invited galactic citizens to choose her company for interstellar travel and promoted the firm's recently acquired fleet of StarSpeeder 1000 starships.\nBy the time of the Nagai–Tof War, Star Tours employed droids for their public relations. Dan Android, for example, was a PR droid stationed at the Tomorrowland Starport.\nBeing a public face for Star Tours, Starlighter, also known as the \"Princess of PR,\" was generally upbeat and energetic while promoting the travel firm. She also had a penchant for exaggerating in this capacity, as she claimed that Star Tours offered travel to all known worlds and even all galaxies despite later revealing that Star Tours, in fact, served only fifty-four destinations. Starlighter shared a good relationship with fellow co-working droids C-3PO and R2-D2, whom she considered two of her \"favorite employees,\" praising Threepio for his meticulousness and highlighting Artoo for his brightness and importance to the company. She also believed in the concept of the Force and publicly stated so while on duty. Additionally, the officer had a positive view of Wookiees and suggested she disliked mothers-in-law.\nAround 1 BBY, Starlighter expressed support for the Galactic Empire, the galaxy's dominant governing power during that period, as well as its primary leaders, Emperor Palpatine and the Sith Lord Darth Vader, However, she hinted that Vader often visited Star Tours' home office, which she later denied, adding that he was \"great\" and a \"positive force for change.\" At the time, Vader was suspicious of noted Rebel Alliance member Captain Raymus Antilles' involvement with the company and speculated that Star Tours was linked to the Rebellion. In addition, a Rebel spy was also found in one of their flights, yet the vessel deliberately evaded Imperial pursuit and landed the spy safely. However, Starlighter minimized those concerns, stating on record that the Sith Lord was working toward making the galaxy \"perfect\" to live in, denying any darkness in his actions. Although Starlighter recognized that the Empire was significantly involved in space voyage, she also believed the Imperials were completely in favor of free travel. As a safety recommendation, Starlighter advised that travelers conceal any lightsabers within their luggage to avoid reprisals from Imperial stormtroopers.\nStarlighter had fair skin and sported blonde and purple hair with a braid. On occasion, she also wore rings, bracelets, earrings, and black-colored accessories near her lips and around her dark-brown eyes, as well as makeup on the eyelids and cheeks. Starlighter wore at least two distinct Star Tours uniforms, one blue and silver and another black and silver with gray pants and boots, both with metallic-looking company pins at chest height displaying her name in High Galactic alphabet and the Star Tours logo in Aurebesh script.\nStar Tours public relations officer Bree Starlighter was portrayed by actress Angela Napoleon during the Star Tours: The Adventures Continue promotional mall tour. The tour took place in four cities, six days before the launch of the revamped ride in 2011, presenting the character for the first time. She later appeared at the grand opening at Disney's Hollywood Studios, as well as in promotional material for Star Tours on the Disney website.\nDuring her live-action appearances, she interacted with the audience in an in-universe manner, as if promoting the launch of Star Tours' first hub on the real-world planet Earth alongside C-3PO, R2-D2, Jedi Mickey, and Leia Minnie. While in character, Napoleon made a point of deliberately twitching her eye and maintaining a facial tic when mentioning the Galactic Empire and Darth Vader positively.\nIn a radio interview, Angela Napoleon, while playing Starlighter, jokingly stated that there were no chickens in her homeworld, and that her planet's residents usually ate another creature, pronounced with click consonants. Given the humorous tone of the interview, this information is likely non-canon within the Star Wars Legends continuity.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Star_Tours/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Bree",
  "/wiki/Cloud_City/Legends",
  "/wiki/Starlight_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Communications_officer",
  "/wiki/The_galaxy/Legends",
  "/wiki/Star/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Earth_system",
  "/wiki/Politics/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Species/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Galactic_Tourist_Bureau/Legends",
  "/wiki/Time/Legends",
  "/wiki/Spaceport_THX1138",
  "/wiki/Droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/StarSpeeder_1000",
  "/wiki/Starship/Legends",
  "/wiki/Nagai%E2%80%93Tof_War",
  "/wiki/Dan_Android",
  "/wiki/PR_droid",
  "/wiki/Tomorrowland_Starport",
  "/wiki/Planet/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Imperial_Period",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Raymus_Antilles/Legends",
  "/wiki/Unidentified_Rebel_spy",
  "/wiki/Star_Tours_Flight_1401",
  "/wiki/Spy/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Ring/Legends",
  "/wiki/Bracelet/Legends",
  "/wiki/Piercing/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Boot/Legends",
  "/wiki/High_Galactic_alphabet",
  "/wiki/Aurebesh/Legends",
  "/wiki/Angela_Napoleon",
  "/wiki/Star_Tours:_The_Adventures_Continue",
  "/wiki/2011",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/In-universe",
  "/wiki/Earth",
  "/wiki/Mickey_Mouse",
  "/wiki/File:Consonantally-clicked_animal.ogg",
  "/wiki/Endorian_chicken",
  "/wiki/Canon",
  "/wiki/Category:Images_of_Bree_Starlighter",
  "/wiki/StarWars.com",
  "/wiki/May_2",
  "/wiki/June_12",
  "/wiki/2015",
  "/wiki/Convenient_Daily_Departures:_The_History_of_Star_Tours",
  "/wiki/April_16",
  "/wiki/Star_Tours_(real-world)",
  "/wiki/Battle_of_Death_Star_III",
  "/wiki/2013",
  "/wiki/Complete_Guide_to_Star_Tours",
  "/wiki/April_18",
  "/wiki/February_24",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/April_30",
  "/wiki/May_23",
  "/wiki/May_25",
  "/wiki/January_19",
  "/wiki/2016",
  "/wiki/April_29"
 ]
}