{
 "name": "Brel_Ti_Vorne",
 "display_name": "Brel Ti Vorne",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Onoam mine",
      "Onoam mine"
     ]
    }
   ]
  }
 ],
 "content": "Brel Ti Vorne was a human male miner who worked in a medicinal spice mine on Onoam, a moon of the Mid Rim planet Naboo, during the Imperial Era. As the working conditions in the mine deteriorated, Ti Vorne became disheartened and sought intervention from outside groups. In 3 BBY, he was chosen to be the representative of the workers in the mine for a meeting with the Alderaanian Princess Leia Organa and Naboo's Queen Dalné, who had come to deliver mining equipment as a relief mission.\nOrgana was optimistic that her gifts to Ti Vorne and his colleagues would improve their working conditions, and was displeased to learn from him that the corrupt Imperial major in charge of the mine would sell the supplies for personal profit not long after she left. Keeping Ti Vorne in mind, Organa and Dalné alerted the Imperial Moff Quarsh Panaka of the illegal profiteering.\nThe human Brel Ti Vorne was a male miner who resided on Onoam, a moon of the Mid Rim planet Naboo, during the Imperial Era. He worked in an Imperial-managed mine that produced the medicinal compound spice. As the working conditions in the mine deteriorated due to the corrupt Imperial major in charge, Ti Vorne and his colleagues were to forced to seek intervention from outside groups. In 3 BBY, he was chosen to be the miners' representative for their meeting with the Alderaanian Princess Leia Organa and Naboo's Queen Dalné. Ti Vorne greeted the royals, expressing his gratitude for their visit. Organa explained to him that she had brought crates of mining equipment for the mine's workers as her relief mission to Onoam.\nOrgana had been optimistic that her mission would improve the working conditions in the mine, and did not understand the group's apathetic reaction to the supplies she had brought. The princess was disheartened when Ti Vorne informed her that the corrupt major in charge of the mine would sell the equipment for personal profit after they left. Organa and Dalné, disgusted by the blatant corruption, pledged to find a way to help. Ti Vorne remained skeptical, but thanked the pair for their goodwill, informing them of the miners' unanswered pleas for outside assistance.\nLater that day, Organa and Dalné met with Quarsh Panaka, the Imperial Moff in charge of Naboo's Chommell sector, in the moff's Onoam chalet. The princess outlined the illegal profiteering Ti Vorne had mentioned, asking for action to be taken on the workers' behalf. Panaka agreed to assist the miners, which surprised both young royals. However, shortly after Organa and Dalné left the chalet, the building was bombed, leaving the moff dead. Organa suspected that the miners' solicitation of outside help, which Ti Vorne had mentioned to her, had resulted in the attack on Panaka.\nBrel Ti Vorne was a tall man who possessed a skinny appearance at the time of Leia Organa's visit to Onoam. He had black hair and a beard, fair skin, and dark eyes. Due to the harsh conditions he worked in, Ti Vorne was a deeply skeptical individual that had developed apathy toward occurrences he considered inevitable, such as his mine's corrupt Imperial major taking the miners' equipment. Ti Vorne respected his queen, Dalné, but felt more deeply touched that Organa cared about the Onoam miners' plight. By the time of Organa's visit to the mine, Ti Vorne had become frustrated enough with his working conditions to want outsiders to take action, even if the result would end in violence.\nAs a miner on Onoam, Ti Vorne suffered from a lack of adequate mining equipment. Over time, he and his colleagues gathered supplies to use for their work, though it was always taken away by the Imperial major in charge shortly after it was acquired. For her relief mission to Onoam, Leia Organa brought safety belts, atmosphere masks, and portable air-purifying force fields to the mine for Ti Vorne and his colleagues to use, though he was skeptical they would be able to use the equipment for more than a few shifts. While working as a miner on Onoam, Ti Vorne wore a tattered tan tunic, light colored pants, black belt, cream-colored scarf, and patched gloves.\nBrel Ti Vorne appeared in Leia, Princess of Alderaan, a 2017 young-adult novel written by Claudia Gray. He was first pictured in Leia Organa: Ordeal of the Princess, a Japanese webcomic adaptation of the novel, on May 8, 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Onoam_mine",
  "/wiki/File:BrelTiVorne1.ogg",
  "/wiki/Miner",
  "/wiki/Spice",
  "/wiki/Onoam",
  "/wiki/Moon",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Naboo",
  "/wiki/Imperial_Era",
  "/wiki/3_BBY",
  "/wiki/Alderaanian",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Daln%C3%A9",
  "/wiki/Mining",
  "/wiki/Unidentified_Imperial_major_(Onoam)",
  "/wiki/Currency",
  "/wiki/Moff",
  "/wiki/Quarsh_Panaka",
  "/wiki/File:BrelTiVorne2.ogg",
  "/wiki/Major",
  "/wiki/Standard_day",
  "/wiki/Chommell_sector",
  "/wiki/Quarsh_Panaka%27s_chalet",
  "/wiki/Assassination_of_Quarsh_Panaka",
  "/wiki/Death",
  "/wiki/File:BrelTiVorne3.ogg",
  "/wiki/Time",
  "/wiki/Queen",
  "/wiki/File:BrelTiVorne4.ogg",
  "/wiki/Belt",
  "/wiki/Atmosphere",
  "/wiki/Force_field",
  "/wiki/Scarf",
  "/wiki/Glove",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/2017",
  "/wiki/Claudia_Gray",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Star_Wars_comic_books",
  "/wiki/May_8",
  "/wiki/2021",
  "/wiki/Category:Audio_files_of_Brel_Ti_Vorne",
  "/wiki/Category:Images_of_Brel_Ti_Vorne",
  "/wiki/Leia,_Princess_of_Alderaan_(audiobook)",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Reproduction",
  "/wiki/19_BBY",
  "/wiki/Birthday",
  "/wiki/Sector",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Haruichi"
 ]
}