{
 "name": "Bren_Derlin",
 "display_name": "Bren Derlin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tiisheraan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.78 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Rebel Alliance Intelligence Service",
      "Endor strike team",
      "Rebel Alliance Intelligence Service",
      "Endor strike team"
     ]
    }
   ]
  }
 ],
 "content": "Bren Derlin was a human male officer of the Rebel Alliance. Bearing the rank of Major, Derlin served as the operations and security chief at Echo Base, the Alliance headquarters on the planet Hoth, under the command of General Carlist Rieekan. In that post, Derlin had to order the closing of the base door to avoid putting the whole base in risk. By doing so, however, he risked the lives of Luke Skywalker and Han Solo, two valuable Rebels. Soon after that event, Derlin served during the Battle of Hoth, and later during the Battle of Endor.\nA human male from Tiisheraan, Bren Derlin was part of the Rebel Alliance, a resistance group who opposed the dictatorial Galactic Empire. He and his team were acquainted with fellow Alliance operative Nakari Kelen, who taught them how to better handle a sniper rifle.\nFollowing the Battle of Yavin, Derlin was part of the mission to rescue Givin slicer Drusil Bephorin and her family from the Empire. He was ordered to escort her family to Omereth to await Lieutenant Luke Skywalker's arrival with Bephorin. While extracting the family after receiving word that Skywalker had rescued Bephorin, Derlin and his team were discovered by bounty hunters who had been attracted by a bounty placed by the Empire for the return of Bephorin and her family. Derlin and his team fought off the hunters and fled to Omereth in their ship, but three members of his team were killed and the hunters followed them to the watery world. The bounty hunters trapped the Rebels into a stalemate at their rendezvous point, jammed their communications, and waited for Skywalker to arrive with Bephorin. Derlin and his team were unable to break free from the siege and were forced to place their hopes in Skywalker being able to defeat the hunters when he arrived.\nDerlin's hopes were well-placed, as Skywalker was able to eliminate the bounty hunters upon his arrival. After Skywalker landed at the rendezvouses point, Derlin explained to him what had happened and was saddened to hear that Kelen, who had been working with Skywalker, had been killed during the fight against the bounty hunters. Derlin then set up a dead drop site for Bephorin to contact the Alliance at and departed Omereth with his team and Skywalker to return Kelen's body to her father on Pasher before rejoining the Alliance Fleet.\nAround three years later, the Alliance chose to have a presence on the frozen planet Hoth, where they established Echo Base. Derlin was assigned there. One day, Skywalker, now a Commander, and Captain Han Solo went on a patrol and failed to return to the base before the night. Derlin had to close the main doors of the Base, to protect the other people there from the cold night temperature—but at the same time, that meant leaving Skywalker and Solo outside for the night, with almost no chance of surviving. He waited at the main door, near Princess Leia Organa, an important dignitary of the base and close friend to both Skywalker and Solo. The young deck lieutenant of the base reported to Derlin that Skywalker and Solo had failed to return.\nDerlin had the unenviable task to report Organa about the need of closing the doors. He waited for Organa to acknowledge his words, and then ordered the Deck Lieutenant to close the doors. The following day, Skywalker and Solo were rescued by the airspeeder searchers. Shortly thereafter, the Empire discovered Echo Base and organized a ground attack against it. Imperial General Maximilian Veers commanded several highly-armored AT-ATs to raid the base. The commanders of the base assigned snowspeeders to the available pilots so that they could oppose the walkers, while the Alliance evacuated the planet in transports. Organa and Derlin briefed the pilots with their instructions, and they were quick to obey.\nSix months after the Hoth debacle, Derlin was tasked to lead a commando team in the ground portion of the Battle of Endor.\nMajor Bren Derlin first appeared in the 1980 original trilogy film, The Empire Strikes Back, where he was played by John Ratzenberger. While not named in the film dialogue, he was identified as \"Major Derlin\" in the movie's credits. His first name was revealed in Kevin Hearne's 2015 novel, Heir to the Jedi. In the 1983 film Star Wars: Episode VI Return of the Jedi, Derlin was portrayed by a different, uncredited actor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bren_Derlin",
  "/wiki/Bren_Derlin/Legends",
  "/wiki/An_Echo_of_Victory",
  "/wiki/A_Good_Kiss",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Databank_A-Z",
  "/wiki/The_Rebel_Alliance",
  "/wiki/Tiisheraan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Intelligence_Service",
  "/wiki/Endor_strike_team",
  "/wiki/Cal_Alder",
  "/wiki/File:Derlin_and_Alder.ogg",
  "/wiki/Officer",
  "/wiki/Major",
  "/wiki/Chief_of_Security",
  "/wiki/Echo_Base",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/General",
  "/wiki/Carlist_Rieekan",
  "/wiki/Luke_Skywalker",
  "/wiki/Han_Solo",
  "/wiki/Battle_of_Hoth",
  "/wiki/Battle_of_Endor",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Nakari_Kelen",
  "/wiki/Sniper_rifle",
  "/wiki/Battle_of_Yavin",
  "/wiki/Givin",
  "/wiki/Slicer",
  "/wiki/Drusil_Bephorin",
  "/wiki/Omereth",
  "/wiki/Lieutenant",
  "/wiki/Bounty_hunter",
  "/wiki/Bounty",
  "/wiki/Death",
  "/wiki/Water",
  "/wiki/Fayet_Kelen",
  "/wiki/Pasher",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Standard_year",
  "/wiki/Standard_day",
  "/wiki/Commander",
  "/wiki/Captain",
  "/wiki/Temperature",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Airspeeder",
  "/wiki/Maximilian_Veers",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/T-47_airspeeder",
  "/wiki/Rebel_pilot",
  "/wiki/Walker",
  "/wiki/Transport",
  "/wiki/Pilot",
  "/wiki/Standard_month",
  "/wiki/Commando",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/John_Ratzenberger",
  "/wiki/Kevin_Hearne",
  "/wiki/2015",
  "/wiki/Heir_to_the_Jedi",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Category:Audio_files_of_Bren_Derlin",
  "/wiki/Category:Images_of_Bren_Derlin",
  "/wiki/Heir_to_the_Jedi_(audiobook)",
  "/wiki/Empire_Ascendant_1",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_(2020)_12",
  "/wiki/The_Whills_Strike_Back",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/The_Storms_of_Taul",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Phoenix_Home_Expansion_Pack",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_32",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Databank_(website)",
  "/wiki/Databank_(original)"
 ]
}