{
 "name": "Brenn Tantor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Garos IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic",
      "Alliance of Free Planets",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Brenn Tantor was a young Human male from Garos IV who dreamed of becoming one of the Imperial stormtroopers who kept the peace on his homeworld. After his graduation from the Academy of Carida, however, he became much more when he was recruited out of the Stormtrooper Corps and made an officer in the Imperial Army as part of an elite project. Supervised by Grand General Malcor Brashin, he rose rapidly through the ranks, becoming a prominent general. Tantor reached his height as an Imperial general in 3 ABY when he directed the Battle of Hoth and shortly after that captured Rebel Alliance Commander Luke Skywalker on Abridon.\nWhen Tantor's brother Dellis, an Imperial Intelligence officer, revealed that the Empire had killed their father, Brenn had a crisis of conscience. After refusing an order to massacre civilians and being told that Dellis had been killed, Tantor defected to the Rebel Alliance. After gaining the trust of General Tyr Taskeen, Tantor took a pivotal role in the Rebellion and later the New Republic, commanding such engagements as the Battle of Endor and the Liberation of Coruscant. In the latter, Tantor discovered that Dellis was being kept in Imperial custody—custody from which he was freed, finally reuniting him with his brother.\nThe Human male Brenn Tantor was born to a middle-class family on Garos IV during a time of civil war. The Galactic Empire intervened to end the conflict, and this imposition of peace impressed Tantor's father so much that he enlisted as a military transport pilot and raised his sons to respect the stormtroopers who kept order. However, a resistance movement grew against the Empire, and the Tantor family's house was destroyed during an episode of fighting. Stormtroopers rescued Brenn and his younger brother Dellis from the rubble, leading the pair to vow that they would become stormtroopers themselves.\nBrenn Tantor immediately gained admission to the Imperial Academy of Carida and underwent stormtrooper training, where he excelled in his studies of tactics. Dellis followed him one year later. During their training they were told the tragic news that their father had been killed by the Rebel Alliance in the course of a mission to deliver medical supplies to Graal'diin. This only increased their resolve to become stormtroopers and fight the Rebellion.\nThe two were excellent cadets, but were mysteriously prevented from joining a stormtrooper squad; unknown to them, it was because they were not clones. The two began to shadow Cattena Squadron, stationed at the Academy, until the squad captain, impressed by their dedication, allowed them to join as \"honorary stormtroopers.\" However, they were never able to gain real acceptance from the rest of the unit, whom they never encountered socially.\nIn 0 BBY, Cattena Squadron was sent to Kalaan. In the course of a battle, the squad's sergeant was killed and Tantor, a corporal, took command. His excellent performance caught the attention of Captain Beri Tulon, a training officer who was scouting for prospects for a special project. Tulon gave Tantor a battlefield promotion to lieutenant and ordered him to report to the Star Destroyer Inquisitor. Dellis, who had been wounded shortly before Tulon arrived, was transferred to Inquisitor as well and placed in a bacta tank.\nTantor was to become one of the first officers to learn how to command troops using the Battlefield Holographic Control Interface, or BHCI. The pet project of Grand General Malcor Brashin, the BHCI could allow a commander to view the full picture of a battle in holographic simulation and gave him the power to relay orders to the battlefield from the impunity of an orbiting Star Destroyer.\nFrom Inquisitor, then in orbit over Tatooine, Tantor walked Zeta Squadron, with the addition of the freshly-healed Dellis, through a simple set of orders to familiarize himself with the system. However, the exercise was cut short when Brashin broke in to issue Tantor new orders. An escape pod launched from the Rebel CR90 corvette Tantive IV had been tracked to his vicinity. Lieutenant Tantor was able to quickly find the pod, despite attacks from indigenous Tusken Raider. In spite of the natives' hostility, Tulon admonished him to never engage the locals unless provoked and behave as \"a soldier, not a murderer.\"\nTantor led further missions to recover the Rebel droids that had been in the escape pod, including tracking and capturing the Jawa Sandcrawler that had carried the droids, and searching the home of local hermit Ben Kenobi.\nHowever, the Imperials were too far behind, and the droids escaped the planet with the plans to the Death Star, a recently-constructed Imperial battlestation. The droids had apparently fled to Alderaan aboard the YT-1300 light freighter Millennium Falcon, but some in the Empire believed that the ship's canny captain Han Solo had jumped to Ruul, along the same vector. Tantor, now a captain, was sent to Ruul with Tulon and Brashin. Although Solo had not jumped there, the Imperials did find that Rebels had captured an important computer facility on Ruul. Tantor, with help from his technically-minded brother on the ground, was able to recapture the facility and string a line of remote relay beacons from the station to an undamaged antenna from which he could broadcast important Rebel data found in the computer complex. For his excellent performance, Tantor was promoted to the rank of commander and placed under Grand General Brashin's personal supervision. Nevertheless, he continued to hold the greatest respect for Captain Tulon, who had been reassigned after Brashin found his more traditional values incompatible with the New Order.\nCommander Tantor's next mission was to Sarapin. The data from the Ruul facility revealed that the Rebellion had captured several of the lava planet's thermal energy collection plants. Tantor was able to retake the collection facilities, but quickly discovered that the Rebels had captured a drilling station. The drilling station, now out of control, was destabilizing the region and causing rampant seismic activity. Tantor's units fought their way to the heavily defended drilling platform, where Dellis was able to shut the drill down just in time to prevent a volcanic eruption and destructive groundquakes.\nThat good news was tempered by two sad announcements from Brashin. First, the Death Star had been destroyed by Rebel starfighters, with massive losses. The deaths of so many talented officers meant that there was a vacuum left for competent commanders to fill—commanders such as Tantor, whom Brashin promoted to major. The second announcement was that Brenn and Dellis would now be parting ways. Dellis had finally been accepted by Imperial Intelligence, to which he had applied before Kalaan, as it had seemed he would not become a stormtrooper.\nTantor next managed to catch the attention of the Imperial Sith Lord Darth Vader when he rescued one of Vader's favored officers, Colonel Maximilian Veers, from a crashed shuttle during a mission to destroy the Rebel base on the moon Yavin 4. Tantor later fought a battle on Eos sometime after this in which All Terrain Personal Transports played a key role. On Empire Day in 1 ABY, Major Tantor was present in the city of Theed on the planet Naboo. There he recruited Imperial loyalists to counteract anti-Imperial propaganda during the festivities.\nTantor, with the irresistible combination of exceptional command skills and the favor of Grand General Brashin and Darth Vader, became one of the top generals in the Empire. When Vader's task force discovered the Rebel base on Hoth in 3 ABY, the Sith Lord called in General Tantor to oversee the subsequent battle. Tantor coordinated the assault of Veers's Blizzard Force on the Rebel base, issuing the lower-ranking general orders from orbit via the BHCI. Blizzard Force's AT-AT walkers routed the Rebels, who were forced to evacuate the icy planet.\nWith the Rebels routed and his prestige in Imperial High Command at colossal levels, Tantor was suddenly dealt a crushing blow. Dellis appeared in his cabin with a classified datadisk and a devastating secret: the Empire had murdered their father. Although they had been told that he was killed in a Rebel attack, the Empire had actually had him executed as an example to other pilots after he lost a shipment of grain to pirates. Even worse, Dellis knew that his superiors were aware of his inquiries, and that he was likely marked for death. General Brashin had assigned him to quell a rebellion on Ruul, and Dellis knew that he would not survive. Dellis swiftly departed, leaving Brenn to ponder this information and question his loyalty to an Empire that had betrayed his family.\nTantor's next assignment was relatively easy, but a sign of his high position within the Empire. He was entrusted with the knowledge of the Second Death Star's location above the forest moon of Endor and ordered to find a suitable site for the groundside shield projector that would protect it. However, his light scouting force was attacked by Ewoks, forcing him to kill many of the natives and destroy several villages that stood on potential shield projector sites. The slaughter of the diminutive natives did nothing to soothe Tantor's troubled conscience.\nHe was next assigned to root out a strong Rebel force that had captured the seat of government on Abridon. His force was able to drive the Rebels out of a captured Imperial base, which Tantor then used as a rallying point to call down reinforcements and weather repeated tank assaults until he was able to drive a strong force through the Rebel lines to capture the Abridon Government Center. From there, he withstood a Rebel counteroffensive and captured five Rebel dignitaries sent to convince Abridon's government to join the Rebel Alliance. One of these dignitaries was the famous Rebel commander Luke Skywalker. The capture of the most-wanted man in the galaxy was quite a feather in Tantor's cap.\nGeneral Tantor was swiftly sent to destroy the main Rebel base on Abridon. During his briefing, he found a pleasant surprise: his old superior, now-Colonel Tulon, would be commanding an additional task force that would aid Tantor in the attack. Tantor was to use the Tracked Mobile Base, or TR-MB, a prototype mobile command center housing a BHCI and putting him directly on the ground.\nHowever, shortly into the mission, things went terribly wrong. Tulon's AT-AT suddenly went on a rampage, destroying the rest of his task force and making a beeline for the Rebel base. Tantor, terrified for the life of his mentor, presumably killed or taken hostage by a defector, drove his forces until they overtook and brought down the walker short of the Rebel stronghold. To Tantor's utter shock, Tulon was the defector. Unable to stomach the brutality of the Empire any longer, he had decided to cast his lot in with the Rebels. Tulon admonished Tantor that the Empire was corrupt and evil, and that the Rebels were the true heroes. Unable to do anything else, Tantor turned his old mentor over to Brashin for imprisonment in the Tarkin Detention Facility.\nNumb, Tantor continued on, efficiently crushing the Rebel base. However, that was not enough for Brashin. He demanded that Tantor destroy a nearby refugee camp as a show of strength. The conflicted Tantor had finally had enough. Citing Tulon's admonishment to be \"a soldier, not a murderer,\" he refused his superior's orders. Furious, Brashin locked Tantor out from communication frequencies and ordered Tantor's stormtroopers to attack, telling them the camp was full of Rebels who had disabled the TR-MB, keeping Tantor from giving them the order. Horrified, the general watched as his soldiers massacred innocent civilians.\nAt that moment, Tantor received a strange transmission. His opponent, Rebel general Tyr Taskeen, appeared on his comm line. Taskeen had been able to eavesdrop on the communications between the two Imperial generals, and offered Tantor his personal comm frequency. Though the offer was not explicit, the Rebel was inviting Tantor to defect rather than face the court-martial that doubtless awaited him.\nBack in his Star Destroyer, a communication from Brashin delivered the news Tantor had been dreading. Dellis had been killed—in a Rebel attack, according to Brashin—and Brenn Tantor himself was to report to Kalaan to face the consequences of his insubordination. He took the only option left to him. Contacting Taskeen, Tantor told the Rebel general to meet him on Kalaan.\nOn Kalaan, Tantor was tossed into an outdoor cage to spend the night before being court-martialed. Brashin assured him that the outcome would not be in doubt: Tantor would be found guilty and executed. However, Brashin assigned as guards stormtroopers from a unit that had served loyally under Tantor's command for years. Gana Lant, one of those stormtroopers, sprang Tantor from prison and arranged for the defection of the entire guard detail. However, Tantor was not content to prove his good intentions simply by bringing a squad of stormtroopers with him. He hijacked the TR-MB, parked nearby, and released Luke Skywalker, who was being held in the same facility. With these significant assets and the help of the Kalaanite resistance, Tantor outfought Imperial patrols and turrets to make his way to Taskeen's base.\nOnce evacuated to Taskeen's fleet, Tantor wasn't met with the heroic welcome he had hoped for. Taskeen, wary of such a highly placed Imperial officer, imprisoned him. Tantor would be forced to prove his loyalty under Taskeen's close supervision. Tantor offered Taskeen a plan: if Taskeen would allow him to rescue Beri Tulon from the Tarkin Detention Facility on Ruul, he would be able to combine Tulon's inside knowledge with his own tactical genius to deliver an AT-AT to the Alliance. Taskeen, who was cautiously intrigued, gave Tantor the go-ahead, but warned him that he would be under constant scrutiny.\nTantor was able to lead a swift commando raid that overpowered Tulon's escort before he reached the prison, where he freed Tulon as well as a Ruulian Rebel leader, but was forced to prolong his operations on Ruul when Tulon informed him that he would require an Imperial code to access the AT-AT manufacturing facility on Trasse. Such a code could be found at the nearby computer facility at Sounder Flats. Tantor's soldiers were able to hold off Imperial scout walkers and stormtroopers long enough for Tulon to download the codes from the computer complex.\nAfter careful preparation, including Tulon's training of a special unit of armor-hijacking Infiltrators, they set out for Trasse. The capture of the AT-AT went smoothly, but extraction was complicated by the appearance of a familiar Star Destroyer—Inquisitor, Grand General Brashin's personal ship. Tantor and Brashin exchanged words before the battle; Brashin expressed his disappointment in his one-time student, and Tantor offered the grand general a chance to defect. Brashin did not take him up on the offer. Tantor was forced to race to capture a planetary-defense ion cannon and disable the Star Destroyer before he could escape with the precious captured walker.\nThat action gave Taskeen enough confidence in Tantor that he began to entrust the former Imperial with heavier armor and more important missions. Tantor's experience with Abridon was a major reason why he was tapped to command a mission to free the planet from the Imperial garrison that he himself had once set up. Tantor was able to smash the Imperial presence in the capital and retake the Government Mound. He also liberated a nearby prison camp. There he found Hamman Flatt, the former lieutenant governor of Abridon whom he had imprisoned on his prior visit. Flatt told the Rebel general, whom he failed to recognize, that Abridon was willing to make available a delivery of Abridon-manufactured A-wings. Tantor was able to capture the shipyards in the war-torn city of Sayan, and a Hover Transport full of pilots safely flew the A-wings to Sullust, where the Rebel fleet was preparing to strike at the Second Death Star.\nAfter cleaning out the remaining Imperials in Sayan at the request of the Abridon Nationalists, Tantor participated in 4 ABY's Battle of Endor himself. Due to his experience having set up the shield generator, Tantor accompanied General Han Solo and his strike team to Endor in the Lambda-class shuttle Tydirium. He remained in the shuttle and coordinated the commando team's activities using a portable BHCI. The team was able to destroy the shield generator, which allowed the fleet to blow up the orbiting Death Star. Tantor's significant role in this crucial battle confirmed both that his Rebel superiors trusted his loyalty and that he was playing an increasingly important role in the Rebellion.\nGalactic Emperor Palpatine was killed during the battle, and the Alliance soon after transitioned into the Alliance of Free Planets, and later the New Republic. Tantor became a respected commander in the new organization. Two years after Endor, Tantor participated in the New Republic's advance into the Core Worlds and along with Admiral Willham Burke, he orchestrated the capture of the worlds Commenor, Gyndine and Reytha. Tantor subsequently reached a personal and professional pinnacle when he commanded the Liberation of Coruscant, after he was given the honor of leading the assault on Coruscant, capital of the Empire, in cooperation with General Rand Talor.\nTantor first inserted a force just small enough to avoid detection by Coruscant's advanced sensor net near the north pole. That force disabled the sensor nodes in that region and cleared the way for Tantor to land a massive assault force undetected. He next breached the defensive wall along the edge of the planet's polar ice cap and captured a series of vital Imperial facilities, including a hospital, repair bay, artillery platforms, and walker storage depots.\nTantor pushed on to the final battleground: the Imperial Palace itself. Facing off against the ferocious Imperial defense, commanded by his old nemesis Grand General Brashin, Tantor pounded through layer after layer of Imperial armor, weapons emplacements, and air support until a final infantry invasion secured the Imperial Palace.\nIt was with that capture that Tantor received stunning news. Rebel troopers, clearing a secret Imperial dungeon in the Palace, had found an unexpected prisoner: Dellis Tantor. Overjoyed that the brother whose death had haunted him for years had in fact escaped execution, Brenn met Dellis in an emotional reunion. Walking onto the steps of the Palace, they met Tyr Taskeen, who welcomed Dellis into the Rebel fold with the words, \"Welcome to the next chapter in the history of the galaxy.\"\nBrenn Tantor began his Imperial career as an eager young recruit seeking to spread order, peace, and justice by serving in the stormtrooper corps. Excelling in the Academy, he quickly picked up a strong knowledge of tactics and eagerly looked forward to becoming a stormtrooper.\nHowever, Tantor was dealt the first of many blows to his enthusiasm and idealism when he and his brother were refused entrance to the stormtrooper corps. Cattena Squadron adopted them, but even that held disappointment as none of its members held much affection for the boys. Brenn's strong drive led him to work even harder to earn Cattena's approval when even Dellis began to give up, but he never did gain it before he was promoted to lieutenant and transferred out.\nWith his appointment to officer status and selection for an elite project, Tantor's enthusiasm and determination were redoubled. However, Tulon's reassignment left Tantor without a mentor and wondering why Tulon had been determined unfit. His isolation was only increased when Dellis was assigned to Imperial Intelligence. Brenn saw him only sporadically over the next year and not at all for two years after that.\nBrashin and Tantor retained a good working relationship, but Brashin was not particularly friendly. While respected by his men, Tantor was isolated from them by command. Though he succeeded militarily, Tantor dashed from one hotspot to another with little in the way of a social life or friendships.\nBetween Dellis's revelation that the Empire had killed their father and the massacres of the Ewoks on Endor, Brenn entered a moody, brooding period in which he was forced to wrestle with his conscience. Beri Tulon's attempted defection and capture, the massacre on Abridon, and the news of Dellis's death only increased Tantor's depression, giving him nightmares.\nTyr Taskeen and, once rescued, Beri Tulon returned some companionship to his life, but Tantor remained driven to defeat the Empire and prove himself while still haunted by his past misdeeds and the presumed death of his brother. Aboard the Tydirium en route to Endor, he experienced a hallucination, seeing Dellis sitting across from him. That guilt and depression characterized Tantor throughout 3 and 4 ABY. However, discovering Dellis during the Battle of Coruscant gave Brenn a genuine second chance at happiness.\nBrenn Tantor was created for the 2000 LucasArts video game Star Wars: Force Commander, in which he was voiced by Jeff Bennett. Star Wars: Galactic Battlegrounds also features the Liberation of Coruscant, but in that game the assault on the Imperial Palace is commanded by Rand Talor. This article assumes that the two worked in cooperation with one another.\nTantor made a cameo appearance as a Non-player character  in the massively multiplayer online roleplaying game Star Wars Galaxies. During the Empire Day live events of 2009, 2010, and 2011, he could be found in Theed handing out quests to players. These quests involved putting up Imperial propaganda posters, or tearing down Rebel posters.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Tantor",
  "/wiki/Brenn_Tantor",
  "/wiki/Tantor_(disambiguation)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Garos_IV",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/New_Republic/Legends",
  "/wiki/Star_Wars:_Force_Commander",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Academy_of_Carida",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Battlefield_Holographic_Control_Interface",
  "/wiki/Grand_General/Legends",
  "/wiki/Malcor_Brashin",
  "/wiki/General/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Abridon",
  "/wiki/Dellis_Tantor",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Death/Legends",
  "/wiki/Tantor_(Senior)",
  "/wiki/Tyr_Taskeen",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Liberation_of_Coruscant_(Galactic_Civil_War)",
  "/wiki/Coruscant/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Time/Legends",
  "/wiki/Garosian_Civil_War",
  "/wiki/Transport/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Committee_of_Seven_for_Garosian_Unification",
  "/wiki/Standard_year/Legends",
  "/wiki/Graal%27diin",
  "/wiki/Cloning/Legends",
  "/wiki/Cattena_Squadron",
  "/wiki/Squad/Legends",
  "/wiki/Captain/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Kalaan/Legends",
  "/wiki/Battle_of_Kalaan",
  "/wiki/Sergeant/Legends",
  "/wiki/Corporal/Legends",
  "/wiki/Beri_Tulon",
  "/wiki/Lieutenant/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Inquisitor_(Star_Destroyer)",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Destroyer/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Zeta_Squadron",
  "/wiki/Escape_pod/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Tantive_IV/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Sandcrawler/Legends",
  "/wiki/Ben_Kenobi%27s_hut",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battlestation",
  "/wiki/Alderaan/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Ruul_(planet)",
  "/wiki/Ruul_computer_complex",
  "/wiki/Slicer/Legends",
  "/wiki/Assault_on_Ruul",
  "/wiki/Remote_relay_beacon",
  "/wiki/Ruul_uplink_tower",
  "/wiki/Computer/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Battle_of_Sarapin_(Galactic_Civil_War)",
  "/wiki/Sarapin/Legends",
  "/wiki/Magma/Legends",
  "/wiki/Energy_collector",
  "/wiki/Sarapin_drilling_platform",
  "/wiki/Volcano/Legends",
  "/wiki/Groundquake/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Major/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Maximilian_Veers/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Great_Temple/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Battle_of_Eos",
  "/wiki/Eos",
  "/wiki/All_Terrain_Personal_Transport/Legends",
  "/wiki/Empire_Day/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Propaganda/Legends",
  "/wiki/Death_Squadron/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Blizzard_Force/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Water/Legends",
  "/wiki/Imperial_High_Command/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Grain/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Mission_to_Endor_(Galactic_Civil_War)",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Endor_shield_generator_bunker",
  "/wiki/Scout/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Massacre_on_Abridon",
  "/wiki/Uprising_on_Abridon",
  "/wiki/Abridon_capital_city",
  "/wiki/Tank_(vehicle)/Legends",
  "/wiki/Abridon_Government_Center",
  "/wiki/Abridon_Government_Council",
  "/wiki/The_galaxy/Legends",
  "/wiki/Tulon%27s_task_force",
  "/wiki/Tracked_Mobile_Base",
  "/wiki/Annihilator_1",
  "/wiki/Tarkin_Detention_Facility",
  "/wiki/Abridon_refugee_camp",
  "/wiki/Court-martial/Legends",
  "/wiki/Kalaan_defectors",
  "/wiki/Gana_Lant",
  "/wiki/Prison/Legends",
  "/wiki/Kalaan_prison",
  "/wiki/Kalaanite_resistance",
  "/wiki/Escape_from_Kalaan",
  "/wiki/Autoturret/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Mission_to_Ruul_(Galactic_Civil_War)",
  "/wiki/Ruulian_Rebels",
  "/wiki/Trasse_Proving_Grounds",
  "/wiki/Trasse/Legends",
  "/wiki/Sounder_Flats_computer_complex",
  "/wiki/Sounder_Flats",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Mission_to_Trasse",
  "/wiki/Planetary_ion_cannon",
  "/wiki/Liberation_of_Abridon",
  "/wiki/Garrison/Legends",
  "/wiki/Government_Mound",
  "/wiki/Abridon_holding_camp",
  "/wiki/Hamman_Flatt",
  "/wiki/Lieutenant_governor",
  "/wiki/RZ-1_A-wing_interceptor/Legends",
  "/wiki/Abridon_Shipyard",
  "/wiki/Sayan",
  "/wiki/Hover_Transport_TC9",
  "/wiki/Sullust/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Abridon_Nationalists",
  "/wiki/4_ABY/Legends",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Endor_strike_team/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Tydirium/Legends",
  "/wiki/Commando/Legends",
  "/wiki/SLD-26_planetary_shield_generator/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Willham_Burke",
  "/wiki/Commenor/Legends",
  "/wiki/Gyndine/Legends",
  "/wiki/Reytha",
  "/wiki/Rand_Talor",
  "/wiki/Sensor/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/Infantry/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Timeline_of_galactic_history/Legends",
  "/wiki/Dream/Legends",
  "/wiki/2000",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Jeff_Bennett",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/2009",
  "/wiki/2010",
  "/wiki/2011",
  "/wiki/Force_Commander:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_New_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_34",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Leland_Chee",
  "/wiki/StarWars.com"
 ]
}