{
 "name": "Brennonn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Brennonn was a Wookiee female who resided on the planet Kashyyyk. She became friends of the Jedi Master Qui-Gon Jinn sometime between 68 BBY and 44 BBY, when he was still a Jedi Padawan. Brennonn and Jinn shared adventures together and she even saved the Jedi's life on multiple occasions. Sometime between 44 BBY and 32 BBY, Brennonn met Jinn and his own Padawan, Obi-Wan Kenobi, during a Life Day gathering, though the celebration was interrupted shortly afterward by a group of Trandoshan hunters. Brennonn fought off a hunter but Jinn and several Wookiees were captured. Brennonn and Kenobi successfully rescued Jinn and the trio returned to the Life Day festivities.\nBrennonn met Qui-Gon Jinn when he was only a Padawan learner sometime between 68 BBY and 44 BBY. The two shared adventures and Brennonn rescued the Padawan on two occasions, though Jinn insisted they saved each other on the second occasion.\nSometime between 44 BBY and 32 BBY, Jinn, now a Jedi Master, introduced Brennonn to his padawan, Obi-Wan Kenobi, at a Life Day celebration on the planet Kashyyyk. Jinn was thankful to Brennonn for permitting him and Kenobi to join her in the Life Day festivities but was concerned about Balfus's disappearance. As Jinn pondered on the circumstances surrounding Balfus's disappearance, Trandoshans descended upon the Wookiee's festivities and began capturing participants for their hunt. Brennonn defended herself from the hunters, throwing one Trandoshan away from her. When another held Brennonn at blasterpoint, Jinn destroyed the blaster with his lightsaber but was captured himself.\nBrennonn discussed how to free Jinn and the captured Wookiees with Kenobi, who asked Brennonn to explain how the situation related to the teachings of her elders. When Kenobi came to understand how the teachings related to an earlier lesson of Jinn's, he formulated a plan. Kenobi surrendered himself to the Trandoshans, using himself as a distraction so he could unlock Jinn's prison using the Force. After Jinn was freed, Brennonn and a group of Wookiees ambushed the Trandoshans, surrounding them. Brennonn offered a peacful solution to the fighting, requesting the hunters lay down their weapons.\nLater, when Jinn and Kenobi returned to the Life Day celebrations, Brennonn greeted the two Jedi again with a hug. Jinn assured Brennonn that gratitude was not needed and she would have done the same for him. As Brennonn departed from the two, Jinn assured her they would join her.\nBrennonn was a female Wookiee with brown fur and brown eyes. She wore braids in hair. Brennonn was friendly, often greeting her friends, old and new, with hugs. Brennonn spoke Shyriiwook and understood Basic. Brennonn was a brave Wookiee, saving Jinn on three occassions. She showed mercy to Korgan and his hunters because of Life Day.\nBrennonn wore a blue pauldron with a gold trim on either side that each had an accompanying brown strap that ran across her chest and formed a cross. She wielded a black bowcaster when she helped rescue Jinn from the Tardoshans.\nBrennonn first appeared in an accompanying comic story of the third issue of the Star Wars Adventures comic book, \"Life Day,\" published on February 3, 2021. The comic story was written by Michael Moreci, illustrated by Megan Levens and Charlie Kirchoff, and served as the first of a two-part story that continued with \"Life Day Part 2\" in the fourth issue on March 24 of the same year.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookiee",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Kashyyyk",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/68_BBY",
  "/wiki/44_BBY",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/32_BBY",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Life_Day",
  "/wiki/Trandoshan",
  "/wiki/Hunting",
  "/wiki/Rescue_of_Qui-Gon_Jinn",
  "/wiki/Planet",
  "/wiki/Balfus",
  "/wiki/Hunter",
  "/wiki/Blaster_rifle",
  "/wiki/Qui-Gon_Jinn%27s_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Prisoner",
  "/wiki/Prison",
  "/wiki/The_Force",
  "/wiki/Weapon",
  "/wiki/Hair",
  "/wiki/Shyriiwook",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Pauldron",
  "/wiki/Breast",
  "/wiki/Bowcaster",
  "/wiki/Star_Wars_Adventures_(2020)_3",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Life_Day_(comic)",
  "/wiki/February_3",
  "/wiki/2021",
  "/wiki/Michael_Moreci",
  "/wiki/Megan_Levens",
  "/wiki/Charlie_Kirchoff",
  "/wiki/Life_Day_Part_2",
  "/wiki/Star_Wars_Adventures_(2020)_4",
  "/wiki/March_24",
  "/wiki/Category:Images_of_Brennonn",
  "/wiki/StarWars.com",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Standard_year",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/40_BBY",
  "/wiki/Reproduction",
  "/wiki/80_BBY",
  "/wiki/Teacher",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/Death",
  "/wiki/Databank_(website)"
 ]
}