{
 "name": "Brenna",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Brenna's brigade",
      "Imperial Officer Corps",
      "Brenna's brigade",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Brenna was a human female colonel in command of a brigade in the military of the Galactic Empire. She believed that her brigade was superior to those stationed on the Death Star.\nThroughout the Galactic Civil War, Brenna and her troops engaged in multiple skirmishes with the Rebel Alliance, notably almost always against Alliance Major Shin and his forces.\nShortly after the Battle of Yavin, as the Rebels were evacuating their base on Yavin 4, Brenna and her troops landed and attacked the base, intending to capture data drives belonging to the Rebellion.\nOn Tatooine, the Imperials became privy to an elite Rebel cell operating out of Mos Eisley. Brenna lead her troops in an assault on the city, attempting to prevent an evacuating Rebel U-wing from taking off. Unlike the opposing commander, Brenna did not care about civilian causalities, letting her troops know that they were \"acceptable\".\nWhile at the Shipyards orbiting the planet Fondor, Brenna was forced to command Imperial fighters when they came under attack by Rebel ships who attempted to destroy an Imperial II-class Star Destroyer docked for repairs.\nWhen the Empire discovered the Rebellion's secret base on the remote world of Hoth, they launched a full assault against them with the intent of finishing the Rebels for good. During the battle, General Maximilian Veers successfully destroyed the base's power generator, allowing Imperial troops to land. As the Rebels scrambled to evacuate what they could, Brenna and her troops attacked the base's east and west hangars, trying to cut the fuel lines so the Rebel ships would be unable to take off.\nLater, during the Battle of Endor, Brenna was stationed at Command Center North on the under construction second Death Star. During the battle, a Rebel CR90 corvette crashed into one of the Battle station's hangars. The surviving Rebel passengers engaged Brenna's troops in a skirmish with the main objective being to sabotage the station and escape.\nAfter the Death Star II's destruction, Brenna commanded a lone Imperial II-class Star Destroyer and several Imperial fighters in an attack against an MC80 Star Cruiser. The battle took place in the debris of the destroyed Death Star.\nOn the moon of Endor, Brenna was present at Research Station 9 while they evacuated. The station and a nearby outpost came under attack by Rebel troops who tried to steal an All Terrain Armored Transport to use in their assault. Brenna and her troops mobilized and attempted to defend the base.\nBrenna is the announcer for the Galactic Empire in the multiplayer modes of Star Wars Battlefront II.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Alva_Brenne",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Brenna%27s_brigade",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Colonel",
  "/wiki/Imperial_Military",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Major",
  "/wiki/Shin",
  "/wiki/Battle_of_Yavin",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Tatooine",
  "/wiki/Mos_Eisley",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Fondor_Shipyards",
  "/wiki/Planet",
  "/wiki/Fondor",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Echo_Base",
  "/wiki/Hoth",
  "/wiki/Battle_of_Hoth",
  "/wiki/General",
  "/wiki/Maximilian_Veers",
  "/wiki/Battle_of_Endor",
  "/wiki/Command_Center_North",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/CR90_corvette",
  "/wiki/Battle_station",
  "/wiki/MC80_Star_Cruiser",
  "/wiki/Endor",
  "/wiki/Research_Station_9",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back"
 ]
}