{
 "name": "Brezzic_Marr",
 "display_name": "Brezzic Marr",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "105th Stormtrooper Platoon",
      "Stormtrooper Corps",
      "105th Stormtrooper Platoon",
      "105th Stormtrooper Platoon"
     ]
    }
   ]
  }
 ],
 "content": "Brezzic Marr was a male Human who served in the Imperial Stormtrooper Corps during the Galactic Civil War. He was assigned as the commanding officer of the 105th Stormtrooper Platoon while the unit was stationed aboard Starlyte Station. He was fanatically devoted to the Empire and his leadership kept the unit of less-than-sterling troopers from failing further. In an attempt to instill pride and creativity within his platoon, Marr broke with Stormtrooper Corps regulations by allowing the personalization of troopers' armor.\nBrezzic Marr's history was unknown prior to his assignment to the 105th Stormtrooper Platoon however there were several rumors circulating that hinted at mental instability. He was an incredibly skilled tactician, however, and his strategies were entered into the Imperial tactics manual. Fanatically loyal yet ultimately pragmatic, Marr has allowed his unit to break several rules while assigned to the space station Starlyte Station under Arissa Fawn. First he allows his unit to customize their armor, and secondly he allows his command to accept bribes from Talandro Starlyte, owner of the station and a notorious black marketeer. The 105th was well disciplined and their drills were impressive to watch which was why Marr would often have them drill in very public places, like right outside the entrance to the Falling Star Saloon\nMentally unstable yet fanatically loyal, Brezzic Marr presents a formidable obstacle to those wishing to go against the Empire in this remote part of the galaxy. Even his superior, Lieutenant Fawn was afraid of what Marr might do. He was extremely intense and slightly sadistic and he had a faraway look that was truly disturbing for others. Although Marr accepted bribes from Starlyte he made it clear that no amount of money would save the station owner if he ever went against the Emperor's will.\nHighly skilled in both combat and tactics, Marr was fearsome in combat. He was also well trained in a variety of other skills, include starship gunnery, investigation, and demolitions. Marr was tactically brilliant and a strong leader.\nMarr heavily customized his stormtrooper armor and emblazoned the unit sigil, an Imperial symbol with arcing lighting behind it, on his shoulder pad. He wielded a BlasTech T-6 \"Thunderer\" heavy blaster pistol and also carried a hold-out blaster, a couple of vibroknives and a bandoleer of stun grenades.\nBrezzic Marr was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. He was illustrated by Joe Corroney.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/105th_Stormtrooper_Platoon",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Starlyte_Station",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Arissa_Fawn",
  "/wiki/Talandro_Starlyte",
  "/wiki/Black_marketeer",
  "/wiki/Falling_Star_Saloon",
  "/wiki/The_galaxy/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Starship/Legends",
  "/wiki/BlasTech_T-6_%22Thunderer%22",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Vibroknife",
  "/wiki/Bandoleer",
  "/wiki/Stun_grenade/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Joe_Corroney",
  "/wiki/Dark_Tremors",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}