{
 "name": "Brint",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic MilitaryEighty-third Battalion",
      "Republic MilitaryEighty-third Battalion",
      "Eighty-third Battalion"
     ]
    }
   ]
  }
 ],
 "content": "Brint was a Human male colonel who served in the Galactic Republic's military on the planet Corellia during the Galactic War against the Sith Empire.\nBrint fought for the Republic during the Battle of Corellia. However, he had disagreements with Senator Jol Zackin over how to commit to the war effort. When Jedi reinforcements arrived, under the command of the Hero of Tython, Brint advocated striking at the Imperial extermination teams that have been massacring medical camps and the murderers were rewarded as a result. Zackin disagreed and advised saving Corellian citizens the Empire had enslaved. Brint reminded the senator that the citizens were taken from prison, so he designated them as criminals. Zackin insisted those people were innocent until proven guilty in court. Brint then tried offering the latest equipment from Balmorra to supply the Jedi, which an outraged Zackin viewed as bribery. To Brint's dismay, the Hero chose to follow Zackin's suggestion. Nonetheless, Brint referred the Jedi to their science adviser, revealed to be Nasan Godera.\nBut as the Hero went to stop fallen Jedi Master, Tol Braga, from committing mass murder, Godera was killed by an Imperial ambush. Brint presented General Var Suthra with data concerning Braga's location, which Godera managed to compile before his death. As soon as the general exited the room, Brint passed on Zackin's regards for saving Corellian \"citizens\". But he shrewdly reminded the Hero that by adhering to the Senator's request, the murderous Imperials the Jedi refused to strike at were laughing all the way back to Dromund Kaas. The Hero sternly stated that the Jedi had come to save lives, not take them and fulfill Brint's petty revenge. Grumbling that he'll never understand Jedi, Brint then gave the coordinates to the Republic base in the government district.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Brint_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Eighty-third_Battalion",
  "/wiki/Jol_Zackin",
  "/wiki/Colonel/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Battle_of_Corellia",
  "/wiki/Senator/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Corellian/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Balmorra/Legends",
  "/wiki/Nasan_Godera",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Tol_Braga",
  "/wiki/Var_Suthra",
  "/wiki/Dromund_Kaas",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Brint",
  "/wiki/Category:Images_of_Brint",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}