{
 "name": "Broma Lak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal Naboo Security Forces",
      "Azure Cabal"
     ]
    }
   ]
  }
 ],
 "content": "Captain Broma Lak was a male Human mercenary who lived during the Galactic Civil War. He was one of the leading members of the Azure Cabal, a mercenary organization that operated in many parts of the galaxy.\nLak had been a Captain in the Royal Naboo Security Forces, but his loyalty was easy to purchase and he left to become a mercenary in the Azure Cabal. By 1 ABY, Lak had become one of Loruna Scathe's trusted inner circle of the Cabal.\nLak was the organization's point of contact in Theed on Naboo. Most savvy intelligence operatives knew that he was associated with the Cabal's leader, Loruna Scathe, as he was less secretive than the other Cabal members. This was mainly because he maintained high respect among the Imperials, as he had friends in high places who owed him a favor or two. New members of the organization needed to obtain his endorsement in order to join the Cabal.\n1.5 ABY, a mercenary met with Lak to prove himself worthy of becoming a member of the Cabal. One of the Cabal's clients had contacted Lak to obtain information about Gungan hydrostatic technology thought to be lost during the Battle of Naboo. Lak decided to let the new mercenary have a go at this task. With Lak's guidance, the spacer attacked a Gungan camp and finally discovered a long lost Gungan record bauble. The device was encrypted however, so Lak sent the mercenary to a contact of his, a Gungan named Jak Chucka. After the adventurer had fulfilled a series of tasks for Chucka and returned to Lak with the decrypted record bauble, Lak agreed to relay his endorsement to Scathe.\nBroma Lak was a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies prior to its closure on December 15, 2011. He could be found in the city of Theed on Naboo. Lak was part of the Azure Cabal quest line, which was added to the game with Chapter 6: Dangers of the Wild in May 2007. In order to become a member of the Azure Cabal, the player had to complete a series of missions for Lak and three other Cabal members.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Azure_Cabal",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Captain/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Loruna_Scathe",
  "/wiki/Theed/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Gungan_Scout_Camp",
  "/wiki/Gungan_record_bauble",
  "/wiki/Jak_Chucka",
  "/wiki/Sony",
  "/wiki/December_15"
 ]
}