{
 "name": "Broonmark",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alzoc III"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3631 BBY",
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Talz"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Talz Commandos",
      "Talz Commandos",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Broonmark was a male Talz who served the Galactic Republic, and later the Sith Empire during the Cold War.\nBorn into a peaceful clan of Talz on the frozen world Alzoc III, Broonmark had an unquenchable taste for murder and death. While still young, Broonmark's father was killed by a wild beast; Broonmark would resent his father henceforth for failing to kill the beast. Developing a fascination with death, a clan elder denounced him for his violent ways and Broonmark in turn executed the elder. To escape his clan and seek out paths to destruction, Broonmark enlisted in the Galactic Republic military where he was trained and dispatched to the planet Hoth during the Galactic War. A violent leader of the Talz Commandos, Broonmark led campaigns of mass slaughter against the Sith Empire.\nHis violent ways earned him the disdain of many of his peers and Lieutenant Fetzellen led a mutiny against his leadership. Fleeing his attacks, Broonmark regrouped in a cave to plot the death of his squad mates. In that very cave the Jedi Padawan Sewlor took refuge from the cold as he searched for his Jedi Master Xerender. Knowing that Broonmark was hiding in the cave, Sewlor grew anxious and was unable to fight back when the Talz emerged and snapped his neck. After killing the Padawan, Broonmark confronted and dueled the apprentice of Darth Baras, the future Emperor's Wrath, ending the fight in a draw. Leaving the cave, Broonmark later confronted and executed more traitors from his squad, running into the Wrath while doing so. Eventually, the Wrath found the path to Xerender, but it was guarded by none other than Fetzellen himself. Broonmark arrived shortly afterwards and demanded to be allowed to complete his revenge by killing his old second-in-command, promising to pledge his life to the Wrath in return; the Wrath assented, and after confronting Fetzellen over his betrayal, Broonmark dueled with and finally bludgeoned his mutinous lieutenant to death. From then on, the Wrath permitted Broonmark to accompany him as his personal assassin in his never ending quest for death.\nWhile journeying with the Wrath, Broonmark explained about his past life and how he despised the other Talz. The savage alien expressed satisfaction as he and the Wrath massacred their enemies in their wake, and eventually pledged his full loyalty, promising to train the Wrath's followers in the art of killing.\nAfter the Eternal Empire invaded the galaxy, the Empire's Wrath was lost in action. Fearing the worst, Broonmark mourned for his friend, along with the rest of the crew before they all parted ways. Five years later, the smuggler Hylo Visz alerted the Outlander, commander of the clandestine Alliance against the Eternal Empire, to the location of a Wookiee Senator named Gryyzak on Alderaan in order to recruit him for the Alliance. But upon arriving for the meeting, the Outlander found that Broonmark had hunted down the Senator and slaughtered his entire entourage, as Gryyzak had brought \"Wookiee customs\" to the Talz, encouraging them to hide what Broonmark believed to be his people's \"true nature\" in order to join the Republic. Although the Outlander attempted to stop Broonmark's slaughter and even recruit him, the Talz insisted on fighting to the death. The Outlander was forced to kill Broonmark in the duel that followed.\nDespite being born from a peaceful clan of Talz, Broonmark became savage with an insatiable lust for carnage and bloodshed. Violence was also his point of pride, seeing it as a solution to everything. Despite his deep-seated dislike for his fellow Talz, Broonmark did not blame them for their peaceful, and in his opinion passive, ways; he believed that the old Talz possessed killer strength and instincts, and that the lack of these qualities his fellow Talz exhibited was the doing of the peaceful Republic. Therefore, seeing himself as the last Talz with the strength of his ancestors, Broonmark felt it was his duty to destroy the Republic for what he perceived as the pacifying and enslavement of his kind - a goal that tied in well with the Empire's intentions.\nBroonmark's respect for the Sith Warrior grew over time. He was impressed by the Wrath's capacity for violence, seeing in the Wrath the strength, violent spirit and destructive capabilities that he believed the Talz had once possessed, but lost. He sought the Sith's approval by learning from the warrior's example.\nBroonmark had a strong sense of loyalty and admired the Wrath protecting his fellow companions, whom he accepted as his new clan; his experience of mutiny at the hand of his unit left the Talz with a strong sensitivity to betrayal. As such, he was outraged at the duplicity of Darth Baras and Malavai Quinn, declaring that he must \"cleanse the clan\" of them and when offered a place at Baras' side in return for leaving the Wrath, Broonmark felt grievously insulted, refusing to do so.\nInterestingly, Broonmark always referred to himself in the plural tense, using \"we\", \"our\" and \"us\" etc. Likewise, he referred to his own kind as \"Talz clan\" and the Wrath's companions as \"Sith clan\".\nBroonmark was an adept melee combatant skilled with the vibrosword, and was very durable. He was also armed a stealth generator, and used it to assassinate unaware or afraid enemies, though he seemingly stopped using stealth when he teamed up with the Emperor's Wrath.\nBroonmark appears in Star Wars: The Old Republic: Knights of the Fallen Empire during Broonmark Alliance alert mission. The only way to recruit Broonmark is through a dark side option allowing him to kill Gryyzak, any attempts to negotiate with him are in vain as long as the Wookiee is alive. An exception is made to the Sith Warrior who can manage to ward off Broonmark from killing the Senator. The Wrath is able to recruit Broonmark as a companion, and enlist Gryyzak's aid in the fight against Arcann. If Gryyzak is killed during this encounter and Broonmark is recruited, Hylo will express her disgust regarding the overall outcome of the mission and vows to never let Broonmark near her or her smugglers on Odessen.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alzoc_III/Legends",
  "/wiki/3631_BBY",
  "/wiki/Alderaan/Legends",
  "/wiki/Talz/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Talz_Commandos",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Broonmark%27s_father",
  "/wiki/Death/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Galactic_War",
  "/wiki/Lieutenant/Legends",
  "/wiki/Fetzellen",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Sewlor",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Xerender",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Darth_Baras",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Assassin/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Hylo_Visz",
  "/wiki/Alliance_Commander",
  "/wiki/Eternal_Alliance",
  "/wiki/Wookiee",
  "/wiki/Senator/Legends",
  "/wiki/Gryyzak",
  "/wiki/Malavai_Quinn",
  "/wiki/Vibrosword/Legends",
  "/wiki/Stealth_generator",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Arcann",
  "/wiki/Odessen",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/The_Holonet",
  "/wiki/The_Art_and_Making_of_Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/3636_BBY",
  "/wiki/3630_BBY",
  "/wiki/Standard_year/Legends"
 ]
}