{
 "name": "Broof_Yurdel",
 "display_name": "Broof Yurdel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gungan Grand Army",
      "Gungan Security",
      "Cularin resistance",
      "Cularin Militia"
     ]
    }
   ]
  }
 ],
 "content": "Broof Yurdel was a male Gungan soldier, security agent and resistance fighter who lived in the years before the Clone Wars.\nBroof Yurdel was a veteran of the Battle of Naboo . Though Yurdel had never met General Jar Jar Binks in person, he had heard of Binks's reputation and held respect for him, always saying his surname when talking about him.\nYurdel moved to Cularin shortly after the Trade Federation's defeat. He worked for Gungan Security as the midnight shift supervisor and lived with his lifemate by the Estauril River in Gadrin.\nYurdel was proud of his peoples' warrior tradition, and when the Cularin resistance formed against the Metatheran Cartel, he disappeared with his entire shift of eleven other Gungans  to join them. They did it at a time they were not working for any clients, and did the logs before they left, but their departure was still a big hit on Gungan Security, which was suddenly undercrewed.\nGerta Haman became the de facto leader of the resistance, but Yurdel and Nim'Ri were her close advisors and co-leaders, with Yurdel being also an unofficial leader of his former employees. Yurdel and his Gungans seemed to be in charge of the resistance base's security.\nYurdel, along with Nim'Ri and Haman, greeted some unexpected visitors who had found their base looking for the missing people, including the Gungans. The resistance leaders tried to convince them not to reveal the secret hideout.\nOne month later, Yurdel welcomed those people to their base. Haman had sent them in an information retrieval mission, and found them in a dua-wurm pit. Yurdel took them to Haman, who analyzed their data. Noticing that the last needed data would only be in the well-protected Cartel jungle base, Haman ordered Yurdel to prepare a military raid against it to gain the last evidence they needed to consolidate their case.\nHowever, the Cartel had tracked the independent agents, and the Cartel's forces attacked the resistance base, almost killing Haman. Yurdel, distraught, led his Gungans and other resistance members on the planned raid of the Cartel's base. Due to the deaths caused by the Cartel's attack, many members of the resistance ignored the original plan of using only stun settings. Yurdel was almost amongst those, but at the last minute, he switched his weapon back to stun to honor Gerta's wishes.\nYurdel ordered his snipers to take care of the Caarite sentinels, and then his troops entered the jungle base through the main door. Yurdel saw a security symbol of the Cartel in the door to the barracks, and he decided to blow the door's controls to shut in the soldiers. Unfortunately, the one-hundred-and-twenty-five Caarite soldiers were in a different room, and Yurdel's shot had triggered the alarms. Both groups began a shoot-out in the base corridors, while the independent agents tried to reach the records room to obtain the final data. Yurdel kept his position because, while he had a escape route, the Caarites did not. Besides, only one in every five Caarites could shoot at the same time from their position.\nEventually, Wir was defeated by the independent agents, and the Caarite soldiers, finding their position unsustainable, surrendered to Yurdel. All the survivors abandoned the jungle base and, at this point, the Metatheran Cartel used turbolasers to destroy the base and any further proofs against them.\nAfter Yurdel's forces defeated the Cartel at the base, with their allies gaining the vital piece of information they were seeking, the Cartel retired from Cularin, saying that Wir's independent rogue actions were to be investigated before their return. The leaders of the resistance were decorated by governor Barnab Chistor of Gadrin, and the members of the resistance returned to their lives.\nWhen the Thaereian military seemed to be exceeding its mandate in protecting the Cularin system, Yurdel was among the resistance members who joined the nascent Cularin Militia, to build up a native defense force for the Cularin system.\n≈",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gungan_Grand_Army/Legends",
  "/wiki/Gungan_Security",
  "/wiki/Cularin_resistance",
  "/wiki/Cularin_Militia",
  "/wiki/The_Resistance_Within",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Battle_of_Grassy_Plains",
  "/wiki/32_BBY/Legends",
  "/wiki/Jar_Jar_Binks/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Estauril_River",
  "/wiki/Gadrin",
  "/wiki/Metatheran_Cartel",
  "/wiki/Gerta_Haman",
  "/wiki/Nim%27Ri",
  "/wiki/Cloud_Mountain_mines",
  "/wiki/Dua-wurm",
  "/wiki/Metatheran_Cartel_jungle_base",
  "/wiki/Stun/Legends",
  "/wiki/Barnab_Chistor",
  "/wiki/Thaereian_military",
  "/wiki/Cularin_system",
  "/wiki/A_Revelation",
  "/wiki/Shadows_in_Green",
  "/wiki/Peaces",
  "/wiki/Here_and_Thaere",
  "/wiki/Memories",
  "/wiki/Open_Aarms",
  "/wiki/Incursion",
  "/wiki/Wizards.com",
  "/wiki/Jurisdiction",
  "/wiki/Decision:_Almas",
  "/wiki/Osten_Dal%27Nay_(article)",
  "/wiki/Destruction_(Living_Force_adventure)",
  "/wiki/Cularin%27s_Militia:_Exposed!",
  "/wiki/False_Horizon",
  "/wiki/Manifesto_My_Foot",
  "/wiki/Metatheran_Promise",
  "/wiki/Tramsig%27s_Plan"
 ]
}