{
 "name": "Brrang",
 "display_name": "Brrang",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ranc Gang"
     ]
    }
   ]
  }
 ],
 "content": "Brrang was a member of the Ranc Gang. He served under Wenda and Bett until the former stormtrooper Terex took over the group in 7 ABY. Brrang commanded the Carrion Spike and the Ranc Gang's fleet of \"Uglies\" during the Battle over a desert planet.\nBrrang was a member of the Ranc Gang during the New Republic Era, which was led by Wenda and Bett, who ran a large ship and salvage operation based on the Outer Rim world of Kaddak. In 7 ABY, he and his fellow Ranc Gang associates including Wenda, Bett, Zumgi, and Wisper entered the Rothana Imperial Shipyards with the help of the former stormtrooper Terex. After Terex killed Wenda, Bett, and the former stormtrooper Corlac for trying to kill him, Brrang and the other Ranc Gang members transferred their allegiance to Terex, who became the Lord-General of the Ranc Gang.\nAfter Terex joined the First Order, Wisper took over leadership of the gang. In 34 ABY, Terex returned to Kaddak to retake control of the Ranc Gang and use them to destroy the Resistance, an independent paramilitary faction aligned the New Republic. After Zumgi killed Wisper for contesting Terex's leadership, Brrang joined the rest of the gang in reaffirming their loyalty to Terex. Brrang and Zumgi accompanied Terex aboard his flagship Carrion Spike as they embarked on their hunt for the Resistance starfighter pilot Poe Dameron, who had escaped with the BX-series droid commando N1-ZX. While N1-ZX was purportedly carrying information about the First Order, this was a ruse created by Terex in order to track down and destroy the Resistance.\nDuring the pursuit, Brrang informed Terex that Poe's T-70 X-wing starfighter was still generating a strong signal despite entering hyperspace. Terex thanked Brrang and instructed Zumgi to prepare the fleet and inform him when Poe had re-entered realspace. However, Poe figured out Terex's plan and exited hyperspace above a desert planet. Brrang then informed Terex that they were in the middle of nowhere and were receiving no readings from a base. Brrang realized that Poe had figured their plan and had deliberately led them away from the Resistance base. Terex then decided to kill Poe instead.\nWhen Terex went down to the desert planet to pursue Poe, Brrang was placed in charge of the Carrion Spike and Terex's fleet of \"Uglies\". When Poe's Black Squadron arrived to rescue Poe, a Trandoshan pilot informed Brrang that reinforcements had arrived. Brrang recognized them as General Leia Organa's secret missions squad. With the Trandoshan believing their forces held a numerical advantage, Brrang ordered the Ranc fleet to destroy them in order to please Lord-General Terex.\nThe Ranc Gang's \"Uglies\" attacked Black Squadron but proved inferior to the Resistance fighters. The Resistance technician and Terex's former spy Oddy Muva freed Terex's slaves including his wife Sowa Chuan and reprogrammed the Carrion Spike's computers to attack Terex's \"Uglies.\" Brrang reacted with shock and asked his pilots what was going. One human pilot replied that they had been locked out of the control systems while the Trandoshan reported that several escape pods had escaped. Brrang and his crew eventually managed to regain control of the Carrion Spike. The Carrion Spike and the remaining \"Uglies\" then prepared for a final stand against Black Squadron. However, the Ranc fleet was wiped out by the First Order Commander Malarus's Maxima-A class heavy cruiser and TIE/fo space superiority fighters, who had been sent to arrest Terex for insubordination. Brrang and his crew were presumably killed.\nBrrang was a human man with a wrinkled face. He wore armor and a helmet with a neck flap that covered his ears and neck. He was loyal to Terex and commanded his flagship Carrion Spike in his absence.\nBrrang first appeared in the 2016 comic Poe Dameron 9, written by Charles Soule and illustrated by Phil Noto.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Ranc_Gang",
  "/wiki/Wenda",
  "/wiki/Bett",
  "/wiki/Stormtrooper",
  "/wiki/Terex",
  "/wiki/7_ABY",
  "/wiki/Carrion_Spike",
  "/wiki/Ugly",
  "/wiki/Battle_over_a_desert_planet",
  "/wiki/New_Republic_Era",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Kaddak",
  "/wiki/Zumgi",
  "/wiki/Wisper",
  "/wiki/Rothana_Imperial_Shipyards",
  "/wiki/Corlac",
  "/wiki/Lord-General",
  "/wiki/First_Order",
  "/wiki/34_ABY",
  "/wiki/Resistance",
  "/wiki/New_Republic",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Poe_Dameron",
  "/wiki/BX-series_droid_commando",
  "/wiki/N1-ZX",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Hyperspace",
  "/wiki/Realspace",
  "/wiki/Unidentified_desert_planet",
  "/wiki/Resistance_base",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Trandoshan",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Spy",
  "/wiki/Oddy_Muva",
  "/wiki/Slavery",
  "/wiki/Sowa_Chuan",
  "/wiki/Escape_pod",
  "/wiki/Commander",
  "/wiki/Malarus",
  "/wiki/Maxima-A_class_heavy_cruiser",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/2016",
  "/wiki/Marvel_Comics",
  "/wiki/Poe_Dameron_9",
  "/wiki/Charles_Soule",
  "/wiki/Phil_Noto",
  "/wiki/Poe_Dameron_10",
  "/wiki/Poe_Dameron_11",
  "/wiki/Poe_Dameron_12",
  "/wiki/Poe_Dameron_13"
 ]
}