{
 "name": "Brrik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jawa"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Brrik was a male Jawa who worked on the Shock Drum superweapon under the supervision of the scientist Hare'en on the planet Tatooine during the Cold War.\nIn 3643 BBY, Brrik and his family agreed to help the project after Hare'en and the other scientists saved Brrik's family from the native Tusken Raiders, and he was present at the facility when the Sith Lord Praven attacked and stole the prototype and kidnapped Jedi Master Bela Kiwiiks. Strangely, Praven chose to spare Hare'en and the Jawas, who soon barricaded themselves within the facility as the Sand People invaded. Luckily, they were rescued by the Hero of Tython.\nDespite their relief, Hare'en detected that the Shock Drum had been activated and the vibrations prevented them from determining its exact location. However, Brrik ingeniously suggested they calibrate the sensors for ultrasonic vibrations. While the Hero performed this task and confronted Praven, Brrik and his family recklessly chased their droids to the Shock Drum's location in the Dune Sea; however, the cave housing the superweapon was inhabited by Sand demons. Thankfully, the Hero once again came to their rescue, killed the Sand Demons and deactivated the Shock Drum, preventing the destruction of Tatooine and Kiwiiks.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Tatooine/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Shock_Drum",
  "/wiki/Superweapon/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Hare%27en",
  "/wiki/Planet/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/3643_BBY",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Praven",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Bela_Kiwiiks",
  "/wiki/Hero_of_Tython",
  "/wiki/Dune_Sea/Legends",
  "/wiki/Sand_demon",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}