{
 "name": "Bruckman",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Endor strike team",
      "Endor strike team"
     ]
    }
   ]
  }
 ],
 "content": "Sergeant Bruckman was a Corellian male who was picked by General Han Solo to act as point man for an Alliance to Restore the Republic strike team of commandos that was deployed to the moon of Endor in 4 ABY. The team's aim was to destroy a shield generator on the moon that was protecting the Imperial Death Star II superweapon above.\nBruckman was among the team members that entered the security bunker at the rear of the generator where they and began placing charges; however,they were captured by Imperial forces that had laid a trap for them. An army of local Ewoks then attacked the Imperials, allowing Bruckman and the others to also turn on their captors. Ultimately the Alliance destroyed the generator and the Death Star.\nBruckman was a human male from the planet Corellia. During the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire, he served as a sergeant in the Alliance Military. In 4 ABY, General Han Solo, a fellow Corellian, chose Bruckman to act as point man for a strike team of commandos he was leading during the Battle of Endor, in which the Alliance aimed to destroy the Empire's Death Star II superweapon in the Endor system. The team's role would be to disable the Death Star's shield generator, which was located on the moon of Endor.\nAfter the team deployed to Endor in the stolen Imperial shuttle Tydirium, they landed in a clearing some distance from the generator and worked their way slowly through the dense undergrowth to the relative safety of the surrounding forest. Solo and some other leading members of the team became separated from the others, and the general ordered Major Bren Derlin to lead Bruckman and the others to regroup with them at the generator at 03:00 hours the next morning. By the time they regrouped, Solo and the others had formed an alliance with a local tribe of Ewoks. Together, the Alliance forces and the Ewoks proceeded to a security bunker that acted as the generator's rear entrance, and after the Ewok Paploo drew away most of the guards, Bruckman and several other members of the team accompanied Solo inside.\nThe Rebels worked their way through the bunker's labyrinth of corridors toward the control room, taking one casualty in a battle with nine stormtroopers enroute. Inside the control room they forced the Imperials present to surrender and began laying charges; however, they had fallen into a trap. The Empire had expected the rebel attack, and concealed Imperial forces emerged and forced all of the Rebels in the bunker to surrender. Bruckman was lead outside with Solo and the others, where they found a large Imperial force waiting for them. As all seemed lost, the uncaptured Rebel protocol droid C-3PO called out from the nearby forest, luring several stormtroopers in after him. The army of Ewoks then attacked the Imperials, causing chaos in which Bruckman and the other captive rebels quickly turned on their captors as well. In the ensuing battle, the rebels eventually managed to get back inside the bunker and successfully destroyed it, allowing the Alliance Fleet to destroy the Death Star above.\nBruckman had light skin and blue eyes.\nBruckman wore a camouflaged commando outfit including a jacket, pants, a helmet, and brown boots.\nBruckman was portrayed by stuntman Larry Holt in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. In the current Star Wars canon, the character was first identified in the English release of \"The Battle of Endor and the Fall of the Empire,\" an entry in De Agostini's Star Wars Encyclopedia series that was originally released in Spanish on June 29, 2021. The name Bruckman originated in the Star Wars Legends continuity, where it was first used on a card in the 1999 Endor Limited expansion set of the Star Wars Customizable Card Game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bruckman",
  "/wiki/Bruckman/Legends",
  "/wiki/Special:Upload",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Corellian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Endor_strike_team",
  "/wiki/Sergeant",
  "/wiki/General",
  "/wiki/Han_Solo",
  "/wiki/Commando",
  "/wiki/Battle_of_Endor",
  "/wiki/Moon",
  "/wiki/Endor",
  "/wiki/4_ABY",
  "/wiki/Death_Star%27s_shield_generator",
  "/wiki/Galactic_Empire",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Deflector_shield_generator",
  "/wiki/Army",
  "/wiki/Ewok",
  "/wiki/Death_Star",
  "/wiki/Planet",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_Military",
  "/wiki/Endor_system",
  "/wiki/Shuttle",
  "/wiki/Tydirium",
  "/wiki/Forest",
  "/wiki/Major",
  "/wiki/Bren_Derlin",
  "/wiki/Standard_hour",
  "/wiki/Standard_day",
  "/wiki/Time",
  "/wiki/Bright_Tree_tribe",
  "/wiki/Paploo",
  "/wiki/Death",
  "/wiki/Stormtrooper",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Helmet",
  "/wiki/Boot",
  "/wiki/Larry_Holt",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars",
  "/wiki/The_Battle_of_Endor_and_the_Fall_of_the_Empire",
  "/wiki/De_Agostini",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/June_29",
  "/wiki/2021",
  "/wiki/Star_Wars_Legends",
  "/wiki/1999",
  "/wiki/Endor_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game"
 ]
}