{
 "name": "Brusc",
 "display_name": "Brusc",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "11 ABY",
      "Manticore",
      "over Dac"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Brusc was a captain in the Imperial Starfleet and commanding officer of the Imperial I-class Star Destroyer Manticore in the Maw fleet.\nIn 0 BBY, Brusc was one of the Imperial officers assigned to protect the Maw Installation, an Imperial research center established by Grand Moff Wilhuff Tarkin in the midst of the Maw Cluster. As captain of the Imperial I-class Star Destroyer Manticore, he served in the fleet of four Imperial I-class Star Destroyers. Brusc and his ship were placed under the command of Admiral Natasi Daala.\nIn 11 ABY, Brusc and the Manticore participated in the pursuit of the experimental superweapon Sun Crusher, stolen by Han Solo, Chewbacca, Kyp Durron and Qwi Xux from the Maw Installation. However, Daala's Star Destroyers emerged in the middle of Moruth Doole's mercenary fleet and were engaged by the hostile spacecraft. In the battle, the combined fire of the Manticore and Basilisk annihilated a Strike-class medium cruiser, causing the remaining mercenary ships to flee to hyperspace. Brusc and the Manticore survived the Skirmish in the Maw, but the Sun Crusher escaped and its passengers informed the New Republic of the existence of the Maw Installation. Brusc and the Manticore accompanied with Daala in her guerrilla campaign against the New Republic. The first combat operation in which Brusc participated was the brutal massacre of the refugees and total destruction of their colony in Dantooine.\nBrusc and the Manticore were charged with the destruction of the Mon Calamari orbital shipyards during the attack on Mon Calamari. As the Gorgon and the Basilisk caused heavy damage to floating cities on the surface of the planet, the Manticore approached the shipyards. However, a responding squadron of B-wing starfighters were successful in distracting the Manticore while the MC90 Star Cruiser Startide was remotely piloted by Admiral Gial Ackbar to collide with the Star Destroyer. The collision with the Startide caused a massive explosion, destroying the Manticore and killing its crew, including Brusc. Daala was enraged by the loss of the Manticore, but she was forced to withdraw as the New Republic Defense Fleet arrived to the battle.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Manticore",
  "/wiki/Dac",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Maw_fleet",
  "/wiki/0_BBY/Legends",
  "/wiki/Maw_Installation",
  "/wiki/Imperial_research_center",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/The_Maw/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Natasi_Daala",
  "/wiki/Superweapon/Legends",
  "/wiki/Sun_Crusher",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Kyp_Durron",
  "/wiki/Qwi_Xux",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Moruth_Doole",
  "/wiki/Kessel_fleet",
  "/wiki/Basilisk_(Star_Destroyer)",
  "/wiki/Strike-class_medium_cruiser",
  "/wiki/Hyperspace/Legends",
  "/wiki/Skirmish_in_the_Maw",
  "/wiki/New_Republic/Legends",
  "/wiki/Attack_on_Dantooine",
  "/wiki/Dantooine/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Attack_on_Mon_Calamari",
  "/wiki/Gorgon",
  "/wiki/A/SF-01_B-wing_starfighter/Legends",
  "/wiki/MC90_Star_Cruiser",
  "/wiki/Startide",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/New_Republic_Defense_Fleet/Legends",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/StarWars.com",
  "/wiki/Drawing_from_the_Imagination:_Mythological_Creatures_in_Star_Wars"
 ]
}