{
 "name": "Bruu_Jun-Fan",
 "display_name": "Bruu Jun-Fan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 20 BBY",
      "Pleem's Nexus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Tatsu"
     ]
    }
   ]
  }
 ],
 "content": "Bruu Jun-Fan was a Human male Jedi Master who served the Jedi Order and the Galactic Republic during the Clone Wars. Around 20 BBY, Jun-Fan was selected to participate in a task force with the objective of tracking down the Sith Lord Darth Maul—who was believed to have been slain by Jedi Obi-Wan Kenobi during the Battle of Naboo twelve years earlier—and his brother, Sith apprentice Savage Opress. Jun-Fan and the task force traced the Zabrak brothers to the planet Yellowblade's Landing and confronted them, though Maul and Opress managed to escape. During the skirmish, both Jun-Fan's Padawan, Tatsu, and Kenobi were injured, causing Jun-Fan and the remaining Jedi to pursue the Sith. Jun-Fan, Plo Koon, and Jedi Master Ko Solok confronted Maul and Opress on the world Pleem's Nexus, with Jun-Fan combating Maul himself. He was injured by one of Maul's cybernetic legs, and succumbed to the injuries dealt to him by the Zabrak after the brothers escaped.\nBrun Jun-Fan, a Human male, was trained in the ways of the Force by the Jedi Order during the final decades of the Galactic Republic. He obtained the rank of Jedi Master at a young age, and was noted for his skills in unarmed combat—which was aided by his connection to the Force—and his abilities with psychometry, a Force technique that allowed him to pick up information and impressions from an object and discern the events that the object was directly or indirectly involved in. Jun-Fan also took the Pantoran Tatsu as his Padawan.\nDuring the Clone Wars between the Republic and the Confederacy of Independent Systems, Jun-Fan fought against forces of the Separatist Droid Army. Around 20 BBY, the Sith Lord Darth Maul—who was thought to have been slain by Jedi Obi-Wan Kenobi twelve years earlier during the Battle of Naboo—resurfaced during the war with the aid of his brother and apprentice, Savage Opress. Jun-Fan was selected by the Kel Dor Jedi Master Plo Koon to take part in a task force whose objective was to hunt down and capture Darth Maul and Opress. Jun-Fan, along with Tatsu, accompanied Masters Koon, Kenobi, Ko Solok, Grohto, and a team of clone troopers to the ice world Yellowblade's Landing, which was the last known location of the Zabrak brothers. The task force found a cantina where members of the criminal gang Scourge lay dead on the floor. Jun-Fan used his psychometric abilities to devine that the Sith were responsible for the massacre and noted that the Zabraks were in a nearby cave.\nWhen they tracked Maul and Opress to the Scourge gang's base in the caves, Jun-Fan and the clone soldiers began to combat several wampas that Maul released. The other Jedi, meanwhile, attempted to capture Maul and Opress, who ultimately managed to escape with a hostage after killing Grohto and maiming Tatsu. Jun-Fan used his psychometric abilities on a piece of jewelry that the Sith's hostage had dropped, gathering that they were headed to the planet Pleem's Nexus. Jun-Fan, Koon, and Solok left Tatsu and Kenobi behind due to their injuries and followed Maul and Opress to Pleem's Nexus. They confronted the brothers at a castle as the Sith were attempting to load some treasure—which they planned to use to establish a criminal empire—on their starship.\nDuring the ensuing duel, Jun-Fan and Solok tried to convince Maul to reveal his former Master's identity. Maul used the Force to throw his lightsaber at Jun-Fan, who dodged the attack, although the lightsaber impaled Solok and killed him. Jun-Fan proceeded to use his unarmed abilities to try and overpower Maul, and eventually began to choke the Sith Lord, determined to end what he considered Maul's evil actions. However, Maul repositioned his right cybernetic leg and kicked Jun-Fan in the abdomen, mortally wounding the Jedi Master. After Maul and Opress escaped when Kenobi and Jedi Knight Anakin Skywalker arrived in their starfighters, Jun-Fan died in Koon's arms.\nBruu Jun-Fan was light-skinned with brown hair and eyes, and kept himself in good physical condition. When practicing combat, he was bare-chested and wore brown slacks, and used a lightsaber with a green crystal. He was interested in what happened to an individual upon their demise, believing it to be a mystery. Jun-Fan was dedicated to capturing Darth Maul and Savage Opress, and during his confrontation with Maul on Pleem's Nexus, he attempted to try and convince Maul to reveal his former Sith Master's identity. However, after Maul's lightsaber killed Ko Solok, Jun-Fan abandoned that mentality and was determined to end Maul's life. After Maul mortally wounded Jun-Fan, he remarked that he felt the Force taking him while he was dying.\nJun-Fan was noted for achieving the rank of Master at a young age, and his skills in Force-combat were regarded by Grand Master Yoda as being without equal. Jun-Fan was able to defeat B1-Series battle droids, and he also defeated wampas with blows to their throats and heads. He had good reflexes, being able to dodge Maul's lightsaber when the Sith Lord threw it at him, and was able to overpower Maul in a physical grapple. In addition to his martial arts prowess, Jun-Fan was also skilled in psychometry.\nBruu Jun-Fan appeared in The Clone Wars: The Sith Hunters, written by Henry Gilroy and Steven Melching and released on August 28, 2012. He was drawn by Vicenç Villagrasa.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/20_BBY/Legends",
  "/wiki/Pleem%27s_Nexus",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Tatsu",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Unidentified_task_force_(Plo_Koon)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Savage_Opress/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Yellowblade%27s_Landing",
  "/wiki/Skirmish_on_Yellowblade%27s_Landing",
  "/wiki/Sith/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Ko_Solok",
  "/wiki/Skirmish_on_Pleem%27s_Nexus",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Psychometry/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Pantoran/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Grohto",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Water/Legends",
  "/wiki/Unidentified_cantina_(Yellowblade%27s_Landing)",
  "/wiki/The_Scourge",
  "/wiki/Massacre_on_Yellowblade%27s_Landing",
  "/wiki/Cave/Legends",
  "/wiki/Unidentified_Scourge_base",
  "/wiki/Cloning/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Wampa/Legends",
  "/wiki/Esano%27s_sister",
  "/wiki/Cho_mai/Legends",
  "/wiki/Unidentified_castle_(Pleem%27s_Nexus)",
  "/wiki/Starship/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Darth_Maul%27s_lightsaber",
  "/wiki/Lightsaber/Legends",
  "/wiki/Shiak",
  "/wiki/Lord/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Delta-7B_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Sith_Master/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/The_Clone_Wars:_The_Sith_Hunters",
  "/wiki/Henry_Gilroy",
  "/wiki/Steven_Melching",
  "/wiki/August_28",
  "/wiki/2012",
  "/wiki/Vicen%C3%A7_Villagrasa",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_23",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_24",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/The_Clone_Wars:_Season_Five",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Darth_Maul%E2%80%94Death_Sentence_1",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)"
 ]
}