{
 "name": "Bry",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hoopaloo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Bry was a male Hoopaloo criminal who worked with Jorkat and Velek. After attempting to steal from the Serennian Jenza, daughter of Count Gora, during a festival on Serenno, the Jedi initiate Dooku confronted them with an electroblade, scaring the criminals away.\nIn 90 BBY, Bry attended a celebratory festival on Serenno with his criminal associates, Jorkat and Velek. Taking advantage of the crowds, he stole the purse of Jenza, daughter of Count Gora of Serenno, and ran off with it. However, he was soon found by an angry Jenza, who tried to reclaim her purse and its contents, one of which was a precious crystal that had belonged to her grandmother. At this point, Bry was joined by Jorkat and Velek who began intimidating the girl and, when Jenza's brother Ramil tried to intervene, they grabbed hold of him, with Bry suggesting that they sell both children to Renza the Hutt. Any plans were prevented by the arrival of the Jedi initiate Dooku who had followed Jenza due to a connection in the Force he had felt with her . Dooku used the Force to push Bry over, before utilising an electroblade to deal with Jorkat. Bry tried to aid his associate, however Dooku once again sent him flying into a tent, before bringing Velek crashing down on top of him. Chastened, Bry and the others fled the scene. \nBry appeared in the audiobook Dooku: Jedi Lost, written by Cavan Scott and published in 2019.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Hoopaloo",
  "/wiki/Bry_(clone_trooper)",
  "/wiki/Gender",
  "/wiki/Jorkat",
  "/wiki/Velek",
  "/wiki/Serennian",
  "/wiki/Jenza",
  "/wiki/Count_of_Serenno",
  "/wiki/Gora",
  "/wiki/Serenno",
  "/wiki/Jedi_Initiate",
  "/wiki/Dooku",
  "/wiki/Electroblade",
  "/wiki/90_BBY",
  "/wiki/Celebration_on_Serenno",
  "/wiki/Ramil",
  "/wiki/Renza",
  "/wiki/The_Force",
  "/wiki/Force_push",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Bry",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Cavan_Scott",
  "/wiki/2019",
  "/wiki/Dooku:_Jedi_Lost_(script)"
 ]
}