{
 "name": "Buboicullaar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Frog-dog"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "35 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Buboicullaar, or Bubo for short, was a frog-dog male that was kept as a pet by the Hutt crime lord Jabba the Hutt, who used him as a guard dog. He lived in Jabba's palace on the desert planet Tatooine and foiled many assassination despite most people thinking he was not more than an unintelligent pest. The Gran Ree-Yees was assigned to take care of the frog-dog, but on one occasion lost track of him aboard Jabba's sail barge, the Khetanna. The Gran promised Jabba that he would find his charge and clean the barge, but Buboicullaar avoided his keeper while Ree-Yees searched. Once the Gran believed he had run out of time, Jabba simply summoned Buboicullaar by calling his name.\nIn 4 ABY, Buboicullaar barked at the protocol droid C-3PO as the droid entered Jabba's throne room with the astromech droid R2-D2 to deliver a message to Jabba from the Jedi Knight Luke Skywalker. Later that day, the frog-dog was present for a performance of the song \"Jedi Rocks\" by the Max Rebo Band which ended in the enslaved dancer Oola being fed to Jabba's pet rancor, Pateesa. Buboicullaar then witnessed Princess Leia Organa, disguised as the bounty hunter Boushh, threaten Jabba and his court with a thermal detonator while trying to negotiate over the bounty on the Wookiee Chewbacca.\nBuboicullaar, also known as just \"Bubo,\" was a frog-dog male that lived in the palace of the Hutt crime lord Jabba Desilijic Tiure on the desert planet Tatooine. He acted as a guard dog for the crime lord and protected him from many assassination attempts, include one incident where he foiled an attempt by eating the detonation link needed for a bomb to explode. The Gran Ree-Yees was tasked with unglamorous job of taking care of Buboicullaar but on one occasion lost track of the frog-dog on board Jabba's sail barge, the Khetanna, while it was out traveling on Tatooine.\nPleading for his life, the Gran promised to find Buboicullaar while also cleaning the entire sail barge so that his charge would not be tempted to wonder off again. Jabba then gave Ree-Yees the time it would take for the Khetanna to return to the palace to make good on his promises. Buboicullaar moved around the barge ignoring Ree-Yees as the Gran cleaned and called out for the frog-dog. When Ree-Yees laid out a plate of fecal worms, Buboicullaar's favorite food, as bait, the guard dog simply ate the worms when the Gran's back was turned and continued to avoid him.\nRee-Yees ultimately ended up cleaning the pit on the barge where Jabba kept a krayt dragon, and discovered Buboicullaar's dog tag amongst sewage under a sewage grate in the room. The Gran escaped from the pit assuming that Buboicullaar had been devored, and, upon reaching the top deck, saw that the barge had reached Jabba's Palace. To save Jabba the trouble, Ree-Yees offered to throw himself overboard, but instead of executing the Gran, Jabba simply called out to Buboicullaar. Out the sound of his name, the frog-dog shuffled out onto the deck, much to Ree-Yees' surprise. The Hutt then laughed at the Gran and told him to take better care of Buboicullaar in future.\nIn 4 ABY, Buboicullaar was sat in the entryway to Jabba's throne room when the Hutt's majordomo, Bib Fortuna, and a pair of Gamorrean guards escorted the droids R2-D2 and C-3PO into the room. When C-3PO brushed past the frog-dog, Buboicullaar began barking loudly, but stopped once the group had passed and turned to listen as they addressed Jabba. R2-D2 projected a holographic message from the droid's master, the Jedi Knight Luke Skywalker, in which Skywalker asked to bargain with Jabba for the freedom of the smuggler Han Solo and gifted the droids to Jabba as a sign of goodwill. When the message was over, the Hutt declared he had no interest in giving up the imprisoned Solo, who he displayed frozen in carbonite on the wall of the throne room, and ordered that the droids be taken away to begin work.\nBuboicullaar later sat on the floor of the throne room with a Jawa holding his chain during a performance of the song \"Jedi Rocks\" by the Max Rebo Band. He bobbed along to the music as the enslaved dancers Oola and Yarna d'al' Gargan performed in front of him, but after Jabba called for the song to be repeated, Oola resisted advances made by Jabba during the second performance. The Hutt then dropped the dancer through a trap door into the pit below the throne room, and the court, including the Jawa holding the frog-dog's chain, rushed forward to a grating in front of Buboicullaar to watch her fate. Buboicullaar continued to bob up and down as the crowd cheered while watching Jabba's pet rancor, Pateesa, devour Oola.\nOnce the excitement was over, the court's attention was drawn to the court room's entry by the sound of blaster fire. Buboicullaar turned to look for the source of the sound as courtiers began approaching to investigate, but its origin quickly became apparent when Princess Leia Organa, disguised as the bounty hunter Boushh, entered with the Wookiee Chewbacca as her prisoner. She dragged Chewbacca to the center of the room in front of the frog-dog and presented her prisoner to Jabba, who offered the twenty-five thousand credit bounty he had placed on Wookiee.\nOrgana demanded double that, revealing an active thermal detonator as incentive. While most of those present in the room ducked for cover, Buboicullaar began to bob more energetically and Jabba merely laughed, counter offering thirty-five thousand credits instead. Organa accepted and deactivated the detonator, and the band began to play once more as Chewbacca was led away. Organa and Skywalker himself were later captured by Jabba, but ultimately killed the Hutt and much of his court when they were taken to be executed at the Great Pit of Carkoon.\nIn 34 ABY, the memory banks of the astromech droid C2-B9 contained an internal data record that showed Buboicullaar in Jabba's Palace alongside the Jawa holding his chain and several other court members seated in a booth. The image was associated with a quote asking if the sail barge should be repaired. An illustration of Buboicullaar and an accompanying description and caption was included in an artist's journal, which was restored, expanded, and displayed at the Graf Archive at some point after 34 ABY.\nBuboicullaar had a wide mouth with sharp, protruding teeth, giving him an appearance that was simultaneously considered grotesque, ferocious, and ridiculous. His looks meant many in Jabba's Palace assumed that the frog-dog was just a pest, not an intelligent being, where as, in truth, Buboicullaar was considerably smarter then many of the Hutt's other employees. He growled at anyone who approached him. Buboicullaar weighed 35 kilograms but could pull up to 119 kilograms  using his tongue. He ate gorgs, but would have prefered to eat Jabba's court jester, the Kowakian monkey-lizard Salacious B. Crumb.\nBuboicullaar wore a circular golden dog tag with his name written on it in an alien script.\nBuboicullaar was portrayed by performer Franki Anderson, who was six months pregnant at the time, in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The creature's costume consisted of a suit worn on the upper half of the performer's body and operated from below the raised throne room set. The costume was based on a maquette of Buboicullaar. A list of all the creatures being made for the film dated to November 4, 1981, has the character as number fourteen with the production name \"Bubo\" which was based on the fact that the frog-dog looked like a blister. The palace throne room scenes filmed between January 25 and February 8, 1982 on Stage 8 at Elstree Studios.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Buboicullaar",
  "/wiki/Buboicullaar/Legends",
  "/wiki/Frog-dog",
  "/wiki/Gender",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Security_guard",
  "/wiki/Dog",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Assassin",
  "/wiki/Gran",
  "/wiki/Ree-Yees",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Time",
  "/wiki/4_ABY",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Droid",
  "/wiki/Throne",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Jedi_Knight",
  "/wiki/Luke_Skywalker",
  "/wiki/Standard_day",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Max_Rebo_Band",
  "/wiki/Slavery",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Bounty_hunter",
  "/wiki/Boushh",
  "/wiki/Thermal_detonator",
  "/wiki/Bounty",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Bomb",
  "/wiki/Fecal_worm",
  "/wiki/Foodstuff",
  "/wiki/Worm",
  "/wiki/Krayt_dragon",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Gamorrean",
  "/wiki/Hologram",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Jawa",
  "/wiki/Yarna_d%27al%27_Gargan",
  "/wiki/Blaster",
  "/wiki/Prisoner",
  "/wiki/Credit",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/34_ABY",
  "/wiki/C2-B9",
  "/wiki/Unidentified_artist",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Graf_Archive",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Mouth",
  "/wiki/Tooth",
  "/wiki/Pound",
  "/wiki/Tongue",
  "/wiki/Gorg",
  "/wiki/Jester",
  "/wiki/Kowakian_monkey-lizard",
  "/wiki/Salacious_B._Crumb",
  "/wiki/Alien",
  "/wiki/Franki_Anderson",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/November_4",
  "/wiki/1981",
  "/wiki/January_25",
  "/wiki/February_8",
  "/wiki/1982",
  "/wiki/Elstree_Studios",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_Done_Dirty",
  "/wiki/Star_Wars_Adventures_(2020)_11",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/File:C2B9p1-GEDatapad.png",
  "/wiki/File:C2B9p2-GEDatapad.png",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Battle_of_Batuu",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Star_Wars:_Rise_of_the_Resistance",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_BBY",
  "/wiki/In-universe",
  "/wiki/Poe_Dameron",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Amilyn_Holdo",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Gerald_Home",
  "/wiki/Rebelscum.com",
  "/wiki/October_23",
  "/wiki/2021",
  "/wiki/Star_Wars:_Chronicles",
  "/wiki/StarWars.com",
  "/wiki/The_Making_of_Return_of_the_Jedi"
 ]
}