{
 "name": "Buck",
 "display_name": "Buck",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Unidentified green-finned species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Green Forge"
     ]
    }
   ]
  }
 ],
 "content": "Buck was a Green Forge ecoterrorist. A muscular opportunist, he would have affairs with wealthy women and use them to achieve his Green Forge ends. While the affairs' cause being information gathering for sabotage against environment-unfriendly tycoons and their installations, Buck usually made off with shares from his widowed lovers. Buck's latest target is Tibanna-mining Yorn Skot mining station and its owner, Clode Rhoden.\nBecoming the illicit lover and supposed personal trainer of Madam Rhoden, Buck sneaked a core bomb aboard the Aurorient Express  with the intention of blowing up both the properties and owner himself. However, their plan was collided with numerous parties including pirate-infiltrator Podlong Foahl and foreknowing Clode. Podlong had activated his own time-triggered core bomb and Clode ordered the ship's captain to place Buck's core bomb in the pair's escape pod. Fortunately, they were informed by Saul Moegantz, who won the Madame's affection. After the ship had been evacuated, Podlong's bomb went off and destroyed both Aurorient and the pirate vessel.\nA serial bomber himself, Buck process intimate knowledge about core bomb and were able to recognize Podlong's threat by identifying his bomb switch. He also claimed to know eight forms of the martial art Tae-Jitsu and assumed proper stance, yet he was easily overcome by young Obi-wan Kenobi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Buck_(tauntaun)",
  "/wiki/Unidentified_green-finned_species",
  "/wiki/Gender/Legends",
  "/wiki/Green_Forge",
  "/wiki/Tibanna/Legends",
  "/wiki/Yorn_Skot_mining_station",
  "/wiki/Clode_Rhoden",
  "/wiki/Rhoden",
  "/wiki/Core_bomb",
  "/wiki/Aurorient_Express",
  "/wiki/Podlong_Foahl",
  "/wiki/Saul_Moegantz",
  "/wiki/Tae-Jitsu",
  "/wiki/Qui-Gon_and_Obi-Wan:_The_Aurorient_Express_1",
  "/wiki/Qui-Gon_and_Obi-Wan:_The_Aurorient_Express_2",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}