{
 "name": "Budhila Hestilic Amura",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hestilic"
     ]
    }
   ]
  }
 ],
 "content": "Budhila Hestilic Amura was a Hutt from the Hestilic clan who lived at the beginning of the Kymoodon Era. Around 15,000 BBY, Budhila Hestilic Amura served as the primary negotiator on the planet Evocar, which the Hutts settled after leaving their ruined homeworld, Varl. To prevent a repeat of the Hutt Cataclysms, Budhila developed the philosophy known as kajidic. It called for the Hutts to reject outright war and conquest through force in favor of gaining control over organizations and worlds via indirect influence. To enforce the concept and govern the Hutt society, Budhila also established the Hutt Council of Elders. Millennia later, Budhila Plaza on Nal Hutta's moon, Nar Shaddaa, had been named after the creator of kajidic.\nBudhila Hestilic Amura was a Hutt living at the beginning of the Kymoodon Era, a period of time lasting from approximately 15,000 BBY to around 12,000 BBY. He was a part of the Hestilic clan, of which another member had been Boonta Hestilic Shad'ruu, a renowned military commander who had led Hutt forces to victory over the Tionese ruler Xim around 25,100 BBY.\nBudhila lived during a time of disarray for the Hutt species. By 15,000 BBY, the Hutt Empire had collapsed at the end of a series of calamities and conflicts known as the Hutt Cataclysms, which saw Varl, the species' once-lush homeworld, become barren and lifeless. In the aftermath of those catastrophes, a few of the surviving powerful Hutt clans gathered their remaining slave species to aid them in colonizing a new homeworld. Rediscovering Evocar—a lush planet settled by the Hutts centuries earlier but left in the control of its natives, the peaceful Evocii—the Hutt clans traveled en masse to Evocar aboard the remnants of the Hutt Empire's fleet. The Hutts and their Vippit servants then traded trinkets and useless pieces of high technology equipment to the Evocii in exchange for huge expanses of land, and soon, the arrivals controlled almost the entire planet, which was remade into a new Hutt homeworld and renamed \"Nal Hutta.\" The Evocii were subsequently enslaved and largely relocated to the planet's moon, Nar Shaddaa.\nAround the time of the Hutt settlement of Nal Hutta, Budhila Hestilic Amura served as the primary negotiator on the planet. In order to prevent a repeat of the Hutt Cataclysms, Budhila drew inspiration from the Hutt acquisition of Nal Hutta from the Evocii—which the former species viewed as a lesson in entrepreneurship—in order to develop the philosophy known as kajidic. The name of the concept in Huttese literally meant \"the means by which we prosper,\" but it was also related by the Hutts to their saying, \"Someone's got to have it, why not us?\" Millennia later, Professor S. V. Skynx noted in the third edition of The Despotica Reader that it was believed Budhila was also inspired in the creation of the kajidic by the sabotage and subterfuge strategies employed by Hutt Clan-General Kossak Inijic Ar'durv, who had led the overall Hutt campaign against Xim.\nKajidic called for the Hutts to favor aggressive but non-military internal rivalries, rejecting outright war and territorial conquest. The philosophy also taught the Hutts to dedicate themselves to gaining control over organizations and worlds, such as those of the Galactic Republic, through indirect methods in order to achieve rule from within. In order to enforce kadijic, govern the Hutt society, and prevent it from repeating the mistakes that had doomed the Hutt Empire, Budhila also established the body known as the Council of Elders, which consisted of five members of the oldest Hutt Clans.\nOver time, kajidic became so ingrained in Hutt culture that the traditions of the Hutt Empire times became known as the Old Ways and relegated to myths. Eventually the term \"kajidic\" was so intertwined with the Hutt clans that the two concepts sometimes became synonymous. By 19 BBY, the name of the creator of kajidic had been immortalized in the name of Budhila Plaza, a location on Nar Shaddaa.\nBudhila Hestilic Amura was an insightful individual who did not wish for his people to return to the excesses and chaos of the fallen Hutt Empire.\nBudhila Hestilic Amura had sufficient diplomatic skills to serve as the primary negotiator on Nal Hutta around the time of the Hutt settlement of the world.\nBudhila Hestilic Amura was created for the 2009 reference book The Essential Atlas, authored by Daniel Wallace and Jason Fry. The Hutt's name was derived from two Sanskrit words related to wisdom.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Budhila",
  "/wiki/Hestilic_(disambiguation)",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Hestilic",
  "/wiki/Kymoodon_Era",
  "/wiki/15,000_BBY/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Colonist/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Varl/Legends",
  "/wiki/Hutt_Cataclysms",
  "/wiki/Philosopher/Legends",
  "/wiki/Kajidic/Legends",
  "/wiki/Hutt_Ruling_Council",
  "/wiki/Millennium/Legends",
  "/wiki/Budhila_Plaza",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Time/Legends",
  "/wiki/12,000_BBY/Legends",
  "/wiki/Boonta_Hestilic_Shad%27ruu/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Third_Battle_of_Vontor",
  "/wiki/Tionese_(people)",
  "/wiki/Xim/Legends",
  "/wiki/25,100_BBY",
  "/wiki/Species/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Hutt_Empire",
  "/wiki/Slavery/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Evocii",
  "/wiki/Fleet/Legends",
  "/wiki/Vippit",
  "/wiki/Huttese/Legends",
  "/wiki/Professor/Legends",
  "/wiki/S._V._Skynx",
  "/wiki/The_Despotica_Reader,_Third_Edition",
  "/wiki/The_Despotica_Reader",
  "/wiki/Saboteur/Legends",
  "/wiki/Clan-General",
  "/wiki/Kossak_Inijic_Ar%27durv",
  "/wiki/Xim_Wars",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clans_of_the_Ancients",
  "/wiki/Old_Ways_(Hutt)",
  "/wiki/19_BBY/Legends",
  "/wiki/2009",
  "/wiki/The_Essential_Atlas",
  "/wiki/Daniel_Wallace",
  "/wiki/Jason_Fry",
  "/wiki/Lone_Wolf:_A_Tale_of_Obi-Wan_and_Luke",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Xim_Week:_The_Despotica",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Lords_of_Nal_Hutta",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_New_Essential_Chronology"
 ]
}