{
 "name": "Bultar_Swan",
 "display_name": "Bultar Swan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.68 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi assault team",
      "Jedi assault team"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Plo Koon"
     ]
    }
   ]
  }
 ],
 "content": "Bultar Swan was a Force-sensitive human female who trained as Jedi Master Plo Koon's Padawan before becoming a Jedi Knight. Not long after she became a Knight, Swan was among a group of 212 Jedi that Master Mace Windu led to the Petranaki Arena on the planet Geonosis in order to rescue Jedi Knight Obi-Wan Kenobi from the Confederacy of Independent Systems in 22 BBY. Swan expected the Separatists to surrender, but instead they fought back and deployed their droid army.\nSwan fought the droids back-to-back with fellow Jedi Stass Allie, but the situation turned against the Jedi and soon the pair were surrounded, along with their other surviving allies. Grand Master Yoda then saved the Jedi in the arena when he arrived with Low Altitude Assault Transport/infantry gunships carrying the clone troopers of the new Grand Army of the Republic. Swan and Allie climbed aboard one of the gunships, which swiftly left the arena and landed in the nearby deserts. There, the two Jedi charged into battle with more droid forces and helped to ultimately defeat the Separatists.\nBultar Swan was a Force-sensitive human female who served in the Jedi Order as the Padawan of Jedi High Council member Master Plo Koon, who taught her well. By 22 BBY, Swan had recently ascended to the rank of Jedi Knight and was among the 212 Jedi that Master Mace Windu hastily assembled into an assault team that traveled to the planet Geonosis in order to rescue the Jedi Knight Obi-Wan Kenobi.\nKenobi had been captured after discovering a secret droid army being built by the newly formed Confederacy of Independent Systems, and had been taken to the Geonosian Petranaki Arena to be executed alongside his Padawan Anakin Skywalker and Senator Padmé Amidala, who had been captured during their own attempt to rescue Kenobi. The trio of captives fought off beasts, Geonosians, and droids while Swan and her colleagues infiltrated the arena before revealing themselves, lightsabers drawn. Swan stood with Jedi Master Coleman Trebor in the arena stands and expected the Separatists to surrender; however, the Jedi's foes instead deployed their droid army to the arena and fierce fighting broke out between the two factions.\nAllowing her lightsaber training to take over, Swan began unconsciously running through the sweeping and batting exercise of blaster deflection. For most of the battle she fought back-to-back with fellow Jedi Stass Allie, but the odds eventually turned against the Jedi, with Swan, Allie, and other survivors being forced into a circle on the arena grounds and surrounded by droids. The fighting ceased, and Count Dooku, leader of the Confederacy, offered Windu the chance for the Jedi to surrender. After the Jedi refused, Dooku ordered his forces to kill Swan and the others. Still beside Allie, Swan sliced through a B2-series super battle droid, and then looked up to see Jedi Grand Master Yoda on a Low Altitude Assault Transport/infantry gunship.\nYoda had arrived to rescue the Jedi with the clone troopers of the new Grand Army of the Republic, and Swan and Allie leapt together onto the deck of one the other gunships that had arrived in the arena. The pair hung on tightly as the ship took off and cleared the arena walls before making a fast landing on the desert plains outside the arena. Swan could see the distant shapes of Separatist battle droids and IG-227 Hailfire-class droid tanks marching toward her, while the Galactic Republic deployed various war machines that she did not recognize among the many clone troopers around her. The new Jedi Knight then shared a nod with Allie, before the pair raised their lightsabers and charged into battle. Ultimately the Republic claimed victory on Geonosis, forcing the surviving Separatists to flee. Swan survived the battle and later gave an account of her actions there. She would go on to become a veteran of the Clone Wars between the Republic and the Separatists, which began with the battle on Geonosis.\nBy the time she traveled to Geonosis, Swan had grown accustomed to opponents surrendering as soon as a Jedi ignited their lightsaber, and so expected that the Separatists would do the same when more than two hundred members of the Order confronted them. She understood that the battle might happen, but believed it would not until the Separatists fought back, at which point she realized that what she had believed to be foresight on her part had in fact been overconfidence.\nWhile her muscles moved unconsciously to deflect incoming bolts, her mind was racing as the events around her unfolded quickly, forcing her focus to narrow down to only herself and her moment-to-moment survival. When she spotted Yoda during the fighting, her first thought was only to wonder how long had he been present. The larger-scale conflict on the desert plains was bigger then anything Swan had ever imagined, and as she engaged she realized that what she was seeing was a full-scale war. The Jedi Knight fought courageously on Geonosis, which marked the beginning of her boldest adventures in the field. Swan had black hair, tan skin, and brown eyes. She stood 1.68 meters  tall.\nBultar Swan was known for her ability to defeat her enemies using non-lethal methods. Her knowledge of martial arts led to a new form of combat that combined physical attacks with using a lightsaber for defense.\nWhile on Geonosis, Bultar Swan wore a set of light and dark brown Jedi robes with the darker elements including a tunic, boots, and pants. She used a green-bladed lightsaber with a silver colored hilt.\nBultar Swan was portrayed by actress Mimi Daraphet in the prequel trilogy film Star Wars: Episode II Attack of the Clones, which was released on May 16, 2002. Daraphet was cast by extra casting director Ros Breden and concept art of the character was created by Dermot Power. Her outfit in Episode II is very similar to the leather-accented ensemble worn by Anakin Skywalker in the film. The Jedi battle in the Geonosis arena scenes were filmed on Stage 3 at Fox Studios, Sydney, between August 10 and August 15, 2000.\nThe character was revealed to the public prior to the release of the Episode II, when a publicity still of Swan debuted on StarWars.com on January 31, 2002, captioned \"Bultar Swan, heroic Jedi.\" In the current Star Wars canon, Bultar Swan's name was first used in the mobile card game Star Wars: Force Collection, which initially launched in 2013. Although the launch of Force Collection predates the Star Wars canon reset of 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon.\nA set diary for the 2005 film Star Wars: Episode III Revenge of the Sith that was made available to members of the Hyperspace fan club on StarWars.com reported that Daraphet underwent makeup and wardrobe tests for the film. However, Swan's name was not featured in the script and she did not appear in the film's final cut.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Bultar_Swan",
  "/wiki/Bultar_Swan/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_assault_team",
  "/wiki/Plo_Koon",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_training",
  "/wiki/Jedi_Master",
  "/wiki/Padawan",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi",
  "/wiki/Mace_Windu",
  "/wiki/Petranaki_Arena",
  "/wiki/Planet",
  "/wiki/Geonosis",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/22_BBY",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Droid",
  "/wiki/Stass_Allie",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Gunship",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Desert",
  "/wiki/Jedi_High_Council",
  "/wiki/Geonosian",
  "/wiki/Death",
  "/wiki/Anakin_Skywalker",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Lightsaber",
  "/wiki/Coleman_Trebor",
  "/wiki/Blaster",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Head_of_State",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Starship",
  "/wiki/Battle_droid",
  "/wiki/IG-227_Hailfire-class_droid_tank",
  "/wiki/Galactic_Republic",
  "/wiki/Cloning",
  "/wiki/Trooper",
  "/wiki/Clone_Wars",
  "/wiki/Time",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Jedi_robes",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Bultar_Swan%27s_lightsaber",
  "/wiki/Mimi_Daraphet",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/May_16",
  "/wiki/2002",
  "/wiki/Ros_Breden",
  "/wiki/Dermot_Power",
  "/wiki/Fox_Studios,_Sydney",
  "/wiki/August_10",
  "/wiki/August_15",
  "/wiki/2000",
  "/wiki/StarWars.com",
  "/wiki/January_31",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/2013",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Star_Wars_Storybook_Collection:_Star_Wars:_The_Prequel_Trilogy_Stories_and_Star_Wars:_The_Original_Trilogy_Stories",
  "/wiki/The_Brink_of_War",
  "/wiki/The_Prequel_Trilogy_Stories",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Workbook:_2nd_Grade_Reading",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_100_Defining_Moments",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_28",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Insider",
  "/wiki/Nick_Gillard_From_Circus_to_Sith",
  "/wiki/Star_Wars_Insider_187",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2020_Topps_Women_of_Star_Wars",
  "/wiki/Star_Wars:_The_Skywalker_Saga",
  "/wiki/The_Star_Wars_Archives:_Episodes_I%E2%80%93III,_1999%E2%80%932005",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Yoda_and_Other_Users_of_the_Force",
  "/wiki/Padm%C3%A9_Amidala_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Topps_Star_Wars_Living_Set",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Prelude_to_the_Clone_Wars_and_the_First_Battle_of_Geonosis",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Bultar_Swan",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/The_Art_of_Star_Wars_Episode_II:_Attack_of_the_Clones",
  "/wiki/In-universe"
 ]
}