{
 "name": "Bungo_Bung",
 "display_name": "Bungo Bung",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sullust"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "SoroSuub Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Bungo Bung was a male Sullustan from the planet Sullust. Despite growing up working on his father's boaboo fungus farm, Bung harbored a desire to pilot starships. Joining SoroSuub Corporation's Transport and Supply Division, he eventually attained the command of the Chubby Gundark, a Nyubba-class cargo barge driver. Assisted by his droid co-pilot, 42-RST—known as Rusti—Bung was the pioneer of the Great Bantha Breakfast Biscuit Run between Sullust and Gastrula in the Outer Rim Territories during the Galactic Civil War. Bung transported Biscuit Baron's Bantha Breakfast Biscuits to the native Gastrulans, despite interference on the first run from Imperial Captain Wankle. Although he made a healthy profit, Bung broke even after spending much of the money on repairs to his ship after an encounter with a Giant Amorphous Bantha Breakfast Biscuit, a strange anomalous lifeform that was the result of the interaction between the preservatives in Bantha Breakfast Biscuits and the stale air in his ship. He survived by defeating the creature with blue sauce, which, as the recommended accompaniment to a Bantha Breakfast Biscuit, proved to be the lifeform's weakness.\nThe Sullustan male Bungo Bung was born on the planet Sullust, and grew up in the underground caverns of his homeworld, working on his father's boaboo fungus farm. Bung had few duties and spent much of his time sitting around and daydreaming. The fungus was tended to by droids, who then crushed the fungus to make boaboo juice. He was only required to clean up the mess the droids made when they eventually short-circuited in the moist environment, and transport the juice to the markets in G'rinn Go city.\nHowever, Bung's desire was to pilot a starship, and when he was old enough, the young Sullustan signed up with the SoroSuub Corporation's Transport and Supply Division. Serving as a shipping pilot, Bung faithfully worked for SoroSuub for a number of years, eventually earning the captaincy of the Nyubba-class cargo barge driver Chubby Gundark. During his travels, Bung worked for the Mephout, and they gave him a gift—the RST Model Translator Droid 42-RST, otherwise known as \"Rusti.\" Although Bung believed that the gift was for the services he had rendered for them, the Mephout were simply getting rid of obsolete technology. 42-RST served as co-pilot of the Chubby Gundark and was employed as a translator.\nSometime during the Galactic Civil War, Captain Bung and 42-RST returned to Sullust after a transport run. Bung, hungry as ever, stopped at his favorite eating establishment, Biscuit Baron. During the meal, he attempted to explain his love of Bantha Breakfast Biscuits to 42-RST, although she could not comprehend. Bung made an off-hand comment about how a lot of people in the Galactic Empire had never tasted a Breakfast Biscuit, and 42-RST came up with the idea of loading the Chubby Gundark with the food item and finding a buyer for them. Initially balking at the idea since it was against SoroSuub regulations to transport non-SoroSuub goods, Bung relented and spent a month's wages on forty cases of Breakfast Biscuits and blue sauce. 42-RST commented that if they were caught, they could claim that the food was consumables. In the droid's opinion, it would have been a reasonable explanation given the amount Bung ate.\nLeaving Sullust, the Chubby Gundark was intercepted by an Imperial-class Star Destroyer commanded by Captain Wankle. The transport was taken aboard the Imperial vessel and inspected, where a stormtrooper discovered the crates of Bantha Breakfast Biscuits. Learning that there was also an ample supply of blue sauce, Wankle ordered the confiscation of all but one crate and announced that there would be a special meal for the crew that night. Wankle allowed the Gundark to go on its way, although Bung was furious at the Imperial captain's actions and upset over the loss of the cargo.\nBung piloted the Gundark to the planet Gastrula in the Outer Rim Territories, where 42-RST negotiated with the Gastrulans to buy the remaining crate of Breakfast Biscuits. The sale created a market for the food item, and the Great Bantha Breakfast Biscuit Run between Sullust and the Gastrula was established. Over the course of two weeks, Bung and 42-RST cleared several hundred thousand credits shipping the Biscuits to the native Gastrulans. Unfortunately for Bung, he did not know that Bantha Breakfast Biscuits were subject to a strange anomaly that caused them to mutate into a lifeform known as the Giant Amorphous Bantha Breakfast Biscuit. The preservatives in the Biscuit combined with the stale air in the Gundark's hold and the atmosphere on Gastrula, causing the Biscuits to mutate, unleashing the amorphous lifeform. The Giant Amorphous Bantha Breakfast Biscuits set out to consume all life on Gastrula.\nUnaware of this turn of events, Bung was returning to Sullust with two crates of the Biscuits when the contents of one crate mutated and broke free. The Giant Amorphous Bantha Breakfast Biscuit began to eat anything it could, including the barges being hauled by the Chubby Gundark. Bung was forced to jettison a barge after it developed a hull breach, bemoaning the fact that it was company property and he would have to pay for it. Determined to save the ship, Bung took his blaster and ventured into the barges to deal with the creature. The lifeform startled the Sullustan as he was searching for it, coming up behind him. After a brief chase, Bung eventually came to a dead end and was cornered by the Giant Amorphous Bantha Breakfast Biscuit. Sure that he was next on the creature's menu, he was surprised when the creature became frightened and run away. Bung searched for the answer and found that he was surrounded by boxes of blue sauce. Since the condiment was the recommended accompaniment to a Bantha Breakfast Biscuit, the captain reasoned that it was also the creature's weakness. Bung took a tube of the sauce, confronted the Giant Amorphous Bantha Breakfast Biscuit, and squeezed the contents over it. He was relieved when the creature exploded.\nReturning to the cockpit of the Gundark, Bung had to pick up 42-RST, who had ejected in an escape pod in an effort to save herself. Bung set 42-RST the task of cleaning up the mess left by the remains of the Giant Amorphous Bantha Breakfast Biscuit and noted that they would have to get the ship cleaned professionally and replace the lost cargo and barges. While they had made a lot of money from running Bantha Breakfast Biscuits, they would be lucky to break even with the extra expenses. 42-RST asked Bung about the last remaining crate of Biscuits and what they should do with it. Bung had something special planned for the crate and allowed the ship to be boarded by Captain Wankle on their return to Sullust. Without argument, Bung handed over the crate, but apologized to Wankle that he had no blue sauce to go with it.\nBungo Bung was a trusting and gentle Sullustan. He was a daydreamer and longed to travel amongst the stars as a youth. He also had a voracious appetite and was noted for his love of Bantha Breakfast Biscuits. The relationship between him and his droid co-pilot 42-RST was one of mild antagonism, as the droid usually directed sarcastic comments at him.\nA loyal employee of SoroSuub Corporation, he did not like doing anything that would contravene the company's standing regulations, including using the Chubby Gundark to haul non-approved products, or jettisoning company property even when the ship was in danger of destruction. He was unaware of the true relationship between the Empire and SoroSuub Corporation—the Sullustan company had an agreement in place with the Empire to protect its holdings and to ensure it prospered under the New Order. The arrangement had even led the Corporation to take control of the Sullust planetary government. If Bung had known of this, he would have been at the forefront of any opposition. However, this would have been mostly to calm any ulcer he may have developed from worrying about it.\nBungo Bung could use a blaster, and was knowledgeable about alien species and planetary systems. A qualified pilot, Bung could fly and repair space transports, and had experience using the weaponry aboard starships. He could also plot courses through space and hyperspace.\nBungo Bung dressed in black spacer's garb, with a multi-pocketed sleeveless vest worn over the top of it. He carried a hold-out blaster on his person along with a comlink and datapad. He operated the Chubby Gundark, a Nyubba-class cargo barge driver, on behalf of the SoroSuub Corporation for whom he worked, and was the legal registered owner of 42-RST, his droid co-pilot. 42-RST came into his possession after Bung worked for the Mephout; they presented the droid as a gift to the Sullustan. While Bung considered it to be a reward for services rendered, the Mephout were merely phasing out obsolete technology.\nBungo Bung was created by James Anderson for the story Bungo n' Rusti Get Carry-Out that appeared in the Star Wars Adventure Journal 11, published by West End Games on November 1, 1996. The story was both written and illustrated by Anderson. Originally, Anderson had planned to write a series of comic adventures starring Bungo and Rusti, but since Dark Horse Comics was the sole comic licensee the idea had to be abandoned. Dark Horse overlooked the publication of Bungo n' Rusti Get Carry-Out since they believed it to be a one-shot story. However, he has made many appearances in the unlicensed Bungo n' Rusti stories by Anderson that can be found on TheForce.net, which include Bungo n' Rusti Get the Record!, 101 Battle Neks, Bungo n' Rusti On Strike!, Castaways, Bungo n' Rusti Join the Rebellion?!! Part I, and Bungo n' Rusti Join the Rebellion?!! Part II.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Bungo_(disambiguation)",
  "/wiki/Sullust/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bungo_Bung%27s_father",
  "/wiki/Boaboo_fungus",
  "/wiki/Farm/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Starship/Legends",
  "/wiki/SoroSuub_Transport_and_Supply_Division",
  "/wiki/Commander/Legends",
  "/wiki/Chubby_Gundark",
  "/wiki/Nyubba-class_cargo_barge_driver",
  "/wiki/Droid/Legends",
  "/wiki/42-RST",
  "/wiki/Great_Bantha_Breakfast_Biscuit_Run",
  "/wiki/Gastrula",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Biscuit_Baron",
  "/wiki/Bantha_Breakfast_Biscuit",
  "/wiki/Gastrulan",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Wankle",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Giant_Amorphous_Bantha_Breakfast_Biscuit",
  "/wiki/Atmosphere/Legends",
  "/wiki/Blue_sauce",
  "/wiki/Reproduction/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Time/Legends",
  "/wiki/Fungus/Legends",
  "/wiki/Boaboo_juice",
  "/wiki/G%27rinn_Go_city",
  "/wiki/Standard_year/Legends",
  "/wiki/Mephout_(species)",
  "/wiki/RST_Model_Translator_Droid",
  "/wiki/Transport/Legends",
  "/wiki/Restaurant/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Unidentified_Imperial-class_Star_Destroyer_(Sullust)",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Cargo_barge_(Nyubba-class)",
  "/wiki/Hull/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Death/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Star/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/James_Anderson",
  "/wiki/Bungo_n%27_Rusti_Get_Carry-Out",
  "/wiki/Star_Wars_Adventure_Journal_11",
  "/wiki/West_End_Games",
  "/wiki/November_1",
  "/wiki/1996",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Bungo_n%27_Rusti",
  "/wiki/TheForce.net",
  "/wiki/101_Battle_Neks",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Collector_2",
  "/wiki/Star_Wars_Galaxy_Collector_4",
  "/wiki/StarWars.com",
  "/wiki/January_1",
  "/wiki/2016",
  "/wiki/July_25",
  "/wiki/2021",
  "/wiki/January_3"
 ]
}