{
 "name": "Buran Borsil",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nord"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Outdoor Survival School",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Buran Borsil was a Nord scout and SpecForce agent serving the Alliance to Restore the Republic during the Galactic Civil War. He attended Barosa Warren's Galactic Outdoor Survival School during the early years of the Empire, learning how to thrive in various harsh atmospheres as part of the highly successful Twilight Class. His area of expertise was arctic survival, and along with his fellow classmates he completed GOSS's graduation expedition in record time in 12 BBY.\nBorsil and many of his former classmates joined the Rebel Alliance shortly before the Battle of Yavin, despite the wishes of their master instructor at GOSS, Barosa Warren. A rift occurred between Warren and Twilight Class's de facto leader, Sisquoc; Borsil took Sisquoc's side along with most of his peers, incurring Warren's wrath. As of 2 ABY, Borsil was assigned to a SpecForce detachment deployed with Alliance High Command, though he also held an honorary position on Eclipse Team, an infamous Rebel group founded by Sisquoc and several other former members of Twilight Class. Borsil also occasionally acted as an instructor to Rebels stationed at outposts on frigid worlds.\nBuran Borsil was a male of the Nord species, dwarf-like, three-foot tall humanoids native to the planet Nordra. In approximately 18 BBY, during the early reign of the Empire, Borsil enrolled in the Galactic Outdoor Survival School—known to most as GOSS—a survivalist institution run by Morellian scout Barosa Warren on the remote Outer Rim Territories world of Thrantin. GOSS was infamous for its tough teaching methods, but offered a comprehensive education in how to survive in a variety of different terrains and atmospheres, from aquatic to volcanic, and the few students who successfully finished the course and graduated often became scouts themselves.\nBorsil was part of Twilight Class, which quickly became the most successful class to ever attend GOSS. It consisted of twelve individuals of varied skills, who complemented each other to form an extremely effective collective survival unit. After several years' training, Twilight Class broke—and in many cases, smashed—nearly all of GOSS's previous records. Borsil quickly became an expert at surviving—and thriving—in arctic conditions.\nIn 12 BBY, after roughly six years of training, Borsil and his fellow Twilight Class members were sent on their final expedition before graduation, hoping to break the record time set by Lunkar An and Summit Class seven years earlier. The days-long expedition would see them travel through various stringent conditions and terrain, fighting against the elements and local predators. Twilight Class was ferried into a remote part of the planet via shuttle, before descending down a 200-meter high cliff face, into the thick vegetation of the Turas Valley. For over four days, the team traveled around Thrantin, fending off creatures such as tripion and navigating harsh terrain, with different members leading the group in the terrains in which they specialized. Eventually, after completing the Ninth Aquatic Zone with Akul Witig in the lead, the team emerged onto the beach, exhausted, their expedition completed. Derembus Sitnalta contacted Zone Central to request that the GOSS staff send a shuttle to collect Twilight Class and return them to HQ. Zone Central initially believed that Twilight Class was in trouble and was attempting to forfeit their assignment, as their end time was almost 104 hours—more than a day better than the previous record. After Sitnalta clarified to Zone Central that they had in fact finished the entire circuit, the jubilant class was collected by shuttle and examined by a number of Carosite medics, before returning to HQ and becoming GOSS graduates.\nThe class was known as one of GOSS's best and most infamous to ever graduate. A number of years after their graduation, many of the former members of Twilight Class, Borsil among them, decided to join the revolutionary Alliance to Restore the Republic under the influence of Sisquoc, the star pupil and de facto leader of the class. Barosa Warren was not happy with any of his former students using the skills he and his staff had imparted on them in this way; he and Sisquoc also had a fierce argument over another, more personal matter. Borsil and most of his peers came to Sisquoc's aid and sided with him, to Warren's fury. The Morellian instructor began a personal vendetta against Sisquoc and the others, and they were extremely wary of him. Despite this, they went ahead and joined the Alliance regardless.\nBorsil became a member of Alliance Special Forces, dubbed \"SpecForce,\" and served with the Rebellion for a number of years. Because of his expertise in arctic survival and training at GOSS, he was occasionally assigned to Alliance bases located on frigid worlds where new recruits needed guidance on how to perform their tasks effectively despite the conditions. His particular focus was on instructing members of search and rescue teams stationed on such planets.\nMany of Borsil's former classmates, including Sisquoc, Adazian Liebke and Ma'w'shiye, went on to found Eclipse Team, an infamous Rebel SpecForce group. Borsil did not become an official member, but was given an honorary position because of his relationship with the team's upper echelons; he often accompanied them on many dangerous missions for the Rebellion throughout the galaxy. As of 2 ABY, Borsil was serving with a SpecForce attachment assigned directly to Alliance High Command. In that year, a number of intelligence reports were compiled at the behest of Chief Airen Cracken, who wanted to create a profile of many non-Imperial groups that posed threats to the Alliance. Because of Warren's personal hatred for the majority of Twilight Class and any of their Rebel comrades, GOSS was included as one such potential threat in a report written by Major Sisquoc; Borsil was given a brief biography and his name was mentioned as one who would do best to avoid Barosa Warren.\nLike any who passed the stringent exams posed by GOSS, Buran Borsil was a durable and tough individual, despite being of small stature. He was also a believer in the ideals of the Rebel Alliance, and helped in their struggle against the perceived tyranny of Palpatine's Empire. He was an expert in arctic survival, and a valued teacher. He was also well regarded by many high ranking members of the Alliance; his former GOSS classmates gave him an honorary position on Eclipse Team, and he was later assigned to directly serve the Alliance's foremost leaders. Other individuals, however, such as Barosa Warren, wanted him dead.\nThe character of Buran Borsil was created for the West End Games sourcebook Alliance Intelligence Reports, written by Craig Robert Carey and Bill Smith, and published in 1995. His species, the Nord, were first mentioned briefly in The Way of the Yrashu, appearing in the Star Wars Adventure Journal 2 several years prior. Borsil has not appeared in any Expanded Universe works since Alliance Intelligence Reports.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Nord",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Outdoor_Survival_School/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Barosa_Warren",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Twilight_Class",
  "/wiki/12_BBY/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Sisquoc",
  "/wiki/2_ABY/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Eclipse_Team",
  "/wiki/Planet/Legends",
  "/wiki/Species/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Nordra",
  "/wiki/18_BBY/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Morellian",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Thrantin",
  "/wiki/Lunkar_An",
  "/wiki/Summit_Class",
  "/wiki/19_BBY/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Turas_Valley",
  "/wiki/Tripion",
  "/wiki/Ninth_Aquatic_Zone",
  "/wiki/Akul_Witig",
  "/wiki/Derembus_Sitnalta",
  "/wiki/Zone_Central",
  "/wiki/Carosite",
  "/wiki/Adazian_Liebke",
  "/wiki/Ma%27w%27shiye",
  "/wiki/The_galaxy/Legends",
  "/wiki/Chief_of_Intelligence/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Major/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/West_End_Games",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Craig_Robert_Carey",
  "/wiki/Bill_Smith",
  "/wiki/1995",
  "/wiki/The_Way_of_the_Yrashu",
  "/wiki/Star_Wars_Adventure_Journal_2",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Greel_Wood_Haven",
  "/wiki/Star_Wars_Adventure_Journal_6",
  "/wiki/Atin_Attan",
  "/wiki/Norrion_Glidamir",
  "/wiki/Maashan",
  "/wiki/Xenon_Nnaksta",
  "/wiki/Larq_Thur",
  "/wiki/Kiras_Torla"
 ]
}