{
 "name": "Burbakker Teep",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kinyen"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Meeko Ghintee"
     ]
    }
   ]
  }
 ],
 "content": "Burbakker Teep was a male Gran who lived during the last decades of the Galactic Republic. Teep took up a career in arms dealing and by 32 BBY had destroyed a number of important facilities belonging to the Republic Security Force. For these crimes a bounty was placed on his head by Republic Security forces offering 1000 credits for his capture alive and 500 credits dead. When the bounty was placed he was known to be associated with several other arms dealers as well as a number of other criminals including smugglers and the Muttani, Meeko Ghintee. The Mandalorian Bounty hunter Jango Fett ran into Teep on Outland Station, at the stations pit fighting facilities while Jango Fett was there searching for Ghintee. Having been informed of Teep's bounty by the Toydarian owner of the station Rozatta, Jango claimed the bounty on Teep, capturing him alive for 1,000 credits.\nBurbakker Teep first appeared in the video game Star Wars: Bounty Hunter, released by LucasArts in 2002. Burbakker is the first of five possible secondary bounties that players can secure in the Pit Fight Arena section of the first chapter of the game. As the game's very first secondary bounty, he is unarmed and used as the tutorial to show players how to capture secondary bounties within the game. Players have the option of either killing him, or taking him alive with this article assuming he was captured alive as it offered a higher reward. Teep was also mentioned in the Prima Star Wars: Bounty Hunter: Prima's Official Strategy Guide which was released alongside the game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kinyen/Legends",
  "/wiki/Gran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Meeko_Ghintee",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Republic_Security_Force/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Smuggler/Legends",
  "/wiki/Muttani",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Outland_Transit_Station",
  "/wiki/Toydarian/Legends",
  "/wiki/Rozatta",
  "/wiki/Star_Wars:_Bounty_Hunter",
  "/wiki/LucasArts",
  "/wiki/2002",
  "/wiki/Prima",
  "/wiki/Star_Wars:_Bounty_Hunter:_Prima%27s_Official_Strategy_Guide"
 ]
}