{
 "name": "Burellion Tiy",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "c. 35 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "SoroSuub Corporation",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Burellion Tiy was a male Sullustan who worked selling starships for the SoroSuub Corporation and was also a member of the Alliance to Restore the Republic.\nTiy was employed by the SoroSuub Corporation and he roamed the galaxy, buying and selling used starships for them. Tiy joined the Rebel Alliance, because he believed that the people of Sullust should work against the Galactic Empire and he used his job to gather military intelligence for the Alliance. Tiy once sold a squadron of patrol ships to the Empire, which were booby-trapped to pick up phantom electromagentic signals that resembled those of X-wings, causing the Empire to divert forces to investigate a barren system.\nTiy was jocular, fun-loving and liked practical jokes. He often embarrassed customers for a laugh, but SoroSuub didn't fire him for doing so, as he was a shrewd businessman. Tiy only supplied the Alliance with information, as he believed that transporting passengers or contraband for them was too dangerous. Tiy liked to wear garish clothes and owned a large collection of sunglasses. He flew the SoroSuub light transport Burellion's Deal and carried a QuickSnap 36T blaster carbine.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/35_BBY/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Starship/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sullust/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Burellion%27s_Deal",
  "/wiki/QuickSnap_36T",
  "/wiki/Blaster_carbine/Legends",
  "/wiki/Cracken%27s_Rebel_Operatives"
 ]
}