{
 "name": "Burg",
 "display_name": "Burg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Devaron"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ranzar Malk's crew"
     ]
    }
   ]
  }
 ],
 "content": "Burg was a Devaronian male who operated as a mercenary during the era of the New Republic. Burg acted as the muscle of a team recruited by Ranzar Malk to rescue the prisoner Qin from the Bothan-5, a New Republic Correctional Transport, which also included Migs Mayfeld, Xi'an, Q9-0, and the Mandalorian bounty hunter Din Djarin, who had been recruited for the use of his gunship, the Razor Crest. After Qin was rescued, Burg and the team betrayed Djarin and trapped him inside a cell. However, the Mandalorian managed to escape and took them down, imprisoning them in a cell aboard the transport and leaving them behind to deliver Qin to Malk alone.\nA male Devaronian from Devaron, Burg was a mercenary during the New Republic era. Around 9 ABY, Burg was recruited by the criminal Ranzar Malk as part of a team led by fellow mercenary Migs Mayfeld, which also included the droid Zero, the Twi'lek Xi'an, and the Mandalorian bounty hunter Din Djarin, with the objective of rescuing Qin from aboard the Bothan-5, a New Republic Correctional Transport. While the Devaronian carried a crate, Mayfeld introduced Burg to Djarin, describing him as the muscle of the group. Burg then dropped the crate and approached the Mandalorian, sneering at him and stating that he thought Mandalorians would be bigger. As the team boarded Djarin's starship, the Razor Crest, Burg scoffed at his size.\nDuring the journey, Burg strolled around inside the ship, upsetting Xi'an, who told the Devaronian to be seated. He grunted at the Twi'lek, with Xi'an snarling back in response. Burg then tinkered with the controls, opening a weapons cabinet in the process. As he inspected the weapons with glee, Djarin intervened and closed the cabinet, angering the Devaronian. Tensions rose between the two, with Burg questioning why they needed a Mandalorian on the team. Mayfeld replied stating that they were considered to be the greatest warriors in the galaxy. Burg then asked why were they all dead, causing Mayfeld and Xi'an to laugh in response. The team then questioned why Djarin never removed his helmet, with them guffawing when Mayfeld speculated if he was a Gungan. When Mayfeld suggested that he remove his helmet, Burg attempted to do so, but the Mandalorian retaliated, causing a fight to break out between the two. During the fight, the Devaronian accidentally opened the chamber where Grogu resided, revealing his existence to the team. Zero dropped the ship out of hyperspace immediately afterwards and maneuvered around the prison ship, causing everyone to stumble.\nUpon landing, the team entered the prison ship and began their search for Qin, with Burg entering after Mayfeld and Xi'an. As they entered the hallway to the control room, they encountered a mouse droid. Burg toyed with the droid before shooting it, alerting a group of N5 sentry droids to their position. The team was cornered in the hallway, but watched as Djarin sneaked behind the droids and destroyed them. They then mocked his efforts, with Burg intentionally bumping into him.\nThe team entered the control room, discovering a human soldier named Lant Davan at the controls. As they surrounded the soldier, Davan revealed a tracking beacon. While Djarin attempted to reason with him, a tense standoff ensued, with Burg siding with Mayfeld, who wished to kill Davan. The standoff ended when Xi'an killed the soldier by throwing a dagger at his abdomen, but not before he activated the beacon. Now under a strict time limit, Burg and the team rushed their way to Qin's cell. As they encountered an R1 Security Droid, Burg ran towards the droid and picked it up, proceeding to smash it on the ground. He then tossed the droid towards another oncoming droid, destroying them both.\nUpon arriving at Qin's cell and opening it, Burg knocked Djarin into the cell as the team proceeded to betray him. While Burg and the team made their back to the ship, they were stopped in their tracks when Djarin escaped and returned to the control room, switching off the lights and locking the doors. As they continued rushing back to the ship, a door suddenly closed between them, separating the team and trapping Burg with Xi'an. The two then decided to split up and find Djarin. The Devaronian returned to the control room and searched for the Mandalorian. The latter then attempted to strangle Burg with his fibercord whip from the vents, but he pulled him down to the ground.\nBurg kept Djarin on the ground as the Mandalorian attempted to use his weapons. Countering all of his attempts, Burg thrashed Djarin around the control room. However, when in front of the doors, Djarin knocked him into the entrance and destroyed the controls, causing one of them to close in on Burg. He lifted the door with his strength, but the Mandalorian activated another door, which closed around his face, severing his horns. The Mandalorian later incapacitated Xi'an and Mayfeld and imprisoned them on the ship along with Burg, leaving them behind as Djarin delivered Qin back to Malk alone and destroyed Zero in the process.\nBurg was a Devaronian male with red skin and blue eyes, as well as multiple scars on his face. He used his size and strength to intimidate other individuals, most notably towards Djarin on several occasions during their rescue mission.\nIn addition to utilizing blasters, Burg possessed immunity to fire, as when Djarin sprayed him with a flamethrower, Burg simply shook it off. Burg also possessed immense strength, demonstrated at various points during Qin's rescue. He was able to lift an entire security droid and throw it with ease, as well as hold up a closing security door. During his fight with Djarin, Burg maintained the upper hand in combat until he was positioned in front of the door, where the Mandalorian knocked him into the entrance and incapacitated him by shutting both doors.\nBurg wore a long, brown coat with brown pants and boots. He had two DL-21 blaster pistols holstered on his legs. However, he relied on his physical strength for the majority of the mission, only utilizing the blasters to take out a mouse droid and take aim at Davan during the standoff at the control room.\nBurg appeared in the sixth episode of Jon Favreau's 2019 television series The Mandalorian, which aired on December 13, 2019. He was portrayed by Clancy Brown, with Justin Anthony Williams serving as a stunt double.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Devaronian",
  "/wiki/Mercenary",
  "/wiki/Burg_(Gamorrean)",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Devaron",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Ranzar_Malk%27s_crew",
  "/wiki/File:MayfeldBurg-TMS01CH06.ogg",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Ranzar_Malk",
  "/wiki/Rescue_of_Qin",
  "/wiki/Prisoner",
  "/wiki/Qin",
  "/wiki/Bothan-5",
  "/wiki/New_Republic_Correctional_Transport",
  "/wiki/Migs_Mayfeld",
  "/wiki/Xi%27an",
  "/wiki/Q9-0",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Gunship",
  "/wiki/Razor_Crest",
  "/wiki/File:BurgMando-TMS01CH06.ogg",
  "/wiki/New_Republic_era",
  "/wiki/9_ABY",
  "/wiki/Droid",
  "/wiki/Twi%27lek",
  "/wiki/Starship",
  "/wiki/The_galaxy",
  "/wiki/Helmet",
  "/wiki/Gungan",
  "/wiki/Grogu",
  "/wiki/Hyperspace",
  "/wiki/File:BurgBeacon-TMS01CH06.ogg",
  "/wiki/MSE-6_series_repair_droid",
  "/wiki/N5_sentry_droid",
  "/wiki/Human",
  "/wiki/Soldier",
  "/wiki/Lant_Davan",
  "/wiki/Homing_beacon",
  "/wiki/Dagger",
  "/wiki/R1_Security_Droid",
  "/wiki/File:BurgFace-TMS01CH06.ogg",
  "/wiki/Fibercord_whip",
  "/wiki/File:BurgTiny-TMS01CH06.ogg",
  "/wiki/Eye",
  "/wiki/Blaster",
  "/wiki/Jacket",
  "/wiki/Boot",
  "/wiki/DL-21_blaster_pistol",
  "/wiki/Holster",
  "/wiki/Chapter_6:_The_Prisoner",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/The_Mandalorian",
  "/wiki/December_13",
  "/wiki/Clancy_Brown",
  "/wiki/Justin_Anthony_Williams",
  "/wiki/Category:Audio_files_of_Burg",
  "/wiki/Category:Images_of_Burg",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/The_Mandalorian_6",
  "/wiki/The_Mandalorian:_This_is_the_Way",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Cast",
  "/wiki/Technology",
  "/wiki/Process",
  "/wiki/Score",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/The_Mandalorian:_Allies_%26_Enemies",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_Two",
  "/wiki/Matt_Lanter:_The_Animated_Anakin",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020"
 ]
}