{
 "name": "Burr Nolyds",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "11 ABY",
      "Ord Cantrell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Dark Empire",
      "Imperial Ruling Council",
      "Crimson Empire",
      "Dark Empire",
      "Imperial Ruling Council",
      "Imperial Ruling Council",
      "Crimson Empire"
     ]
    }
   ]
  }
 ],
 "content": "Burr Nolyds was a wealthy and arrogant Human male aristocrat who briefly ruled the Galactic Empire in 11 ABY as head of the Imperial Interim Ruling Council. He originally ascended the Empire's political ladder after supplying the organization with important resources, and his desire for power led him to support former Imperial Royal Guard Carnor Jax's plot to kill Galactic Emperor Palpatine and seize the Imperial throne. Following Palpatine's death, Nolyds sat on the Ruling Council of Jax's Crimson Empire, and when Jax was later killed by his fellow former Royal Guard Kir Kanos, Nolyds took over as acting head of the council and ruler of the Empire.\nRuling from a villa in the planet Ord Cantrell's city of De-Purteen, Nolyds held tightly to his power and opposed Councilor Feena D'Asta's suggestion that the crumbling Empire make peace with the New Republic, their opponents in the Galactic Civil War. His rule proved to be short-lived when he was assassinated by Nom Anor, an ally of the scheming Councilor Xandel Carivus; Nolyds's death came in the form of a self-destructing message disk that Anor had left in his chambers. The shaken council responded by electing the seemingly-incompetent Carivus to succeed him so they could pull Carivus's strings and investigate Nolyds's murder from behind the scenes.\nBurr Nolyds was a Human male aristocrat who lived during the reign of the Galactic Empire. He used his wealth to supply the Empire with important resources, which helped him rise in the organization's political ranks and join the Imperial Ruling Council by the year 10 ABY. The council had gained considerable power within the Empire following the death of Galactic Emperor Palpatine in 4 ABY; by 10 ABY, they had allied with Carnor Jax, an ambitious member of the Emperor's Royal Guard. When Palpatine returned in a clone body and resumed control of the Empire in that year, Jax plotted to kill him and seize power. Nolyds, unhappy with the tight control that the Emperor kept on his supporters, supported the coup.\nThe rest of the council was similarly determined to maintain their hard-won authority, and together the councilors bribed the Emperor's physician to sabotage Palpatine's various clone bodies. Palpatine was in the midst of leading the forces of his Dark Empire in their Galactic Civil War with the New Republic, and when his final body was destroyed by his enemies in 11 ABY, Jax seized the Imperial throne. Nolyds served on his Interim Ruling Council, a thirteen-member committee that ruled Jax's Crimson Empire with the former Royal Guard at its head. However, the Imperial fleet was left confused without orders from their Emperor, and their retreat from the galaxy's Core Worlds caused the Empire to quickly crumble. Many fleet commanders refused to follow the dictates of the Interim Ruling Council and broke away, forming various warlord holdings. The Crimson Empire's territory was thus limited to a narrow band of space that stretched from the Outer Rim to the Colonies—the only territory still answerable to centralized Imperial control.\nBased on the world of Ord Cantrell, Nolyds and the rest of the council governed from a villa in the city of De-Purteen. They passed many decisions down to the Empire's remaining Moffs, however. Jax had some councilors who had planned to expose his coup killed, and Councilor Sarcev Quest, one of Jax's closest allies, exercised several abuses of power and had any dissenters incarcerated. Later in 11 ABY, Jax sought out fellow former Royal Guard Kir Kanos, believing him to be a threat to the Empire. Kanos murdered Jax on the planet Yinchorr in a bout of revenge for Palpatine's death, and the council was thrown into chaos. They immediately moved against Quest, and had him tortured for a week before dumping him onto the moon Nar Shaddaa. Nolyds took over as acting head of the council and ruler of the Empire.\nWhen Nolyds came into power, the New Republic had recently been striking at the western flanks of the Empire's territory and had captured the planet Phaeda. On Ord Cantrell, Nolyds hosted a meeting of the council in a courtyard of their villa, where Councilor Feena D'Asta suggested that the only way to rebuild the Empire in the face of New Republic pressure was to sue for peace. Nolyds in turn accused her of trying to split the council and increase her own power; he then reminded her that every present councilor already had considerable power due to having followed Jax, and adjourned the meeting to retire to his chambers.\nHowever, a bomb secured inside of a message disk had been placed on Nolyds's chamber floor by Nom Anor, an ally of Councilor Xandel Carivus who was aiding Carivus's plans to become the new head of the council. Unknown to even Carivus was the fact that Anor was an advance agent of the extra-galactic Yuuzhan Vong species, and was targeting the council to hasten the Empire's collapse in advance of a massive Yuuzhan Vong invasion of the galaxy. The message disk self-destructed when Nolyds activated it, and he was killed in the ensuing explosion. Shaken by the death, Councilors Mahd Windcaller and Norym Kim nominated Carivus to succeed Nolyds, figuring him to be a spineless bureaucrat who could become the next target of their unknown assassin. Meanwwhile, they would control events and investigate Nolyds's murder from behind the scenes. When they swayed other councilors to their side, Carivus was elected by a majority vote.\nNolyds's death was investigated by the Empire's Lieutenant Ganner, who found Kir Kanos's Royal Guard crest on the message disk, evidence that had been planted by Anor. When Ganner found the same crest on the knife that Anor used to kill his next victim, Admiral Llon Banjeer, the Lieutenant suggested to the council that they were being targeted by Kanos, whom Jax had predicted would come after them. The Humanocentric General Immodet formed his own conclusion, accusing the council's non-Human members of exacting a vendetta against their Human peers. A power-hungry Carivus took advantage of the discord and used the murders as justification to establish his own private guard, whom he promptly had arrest every non-Human councilor. With the council severely depleted, Carivus disbanded it and declared himself the new Emperor.\nBurr Nolyds was an arrogant aristocrat who used his wealth to push himself into Imperial power. Although a staunch Imperial loyalist, he disliked being kept on a short leash by Palpatine and supported Carnor Jax's plot to kill the Emperor. To Nolyds, Kir Kanos's continued loyalty to Palpatine after the Emperor's death was misguided patriotism. Nevertheless, he thought Jax foolish for personally seeking out Kanos rather than dispatching stormtroopers against him. Following Jax's death, Nolyds looked after his own interests and sought to gain control over his fellow councilors.\nAs the ruler of the Empire, Nolyds desired to hold on to his power. He opposed Feena D'Asta's suggestion that peace be sought with the New Republic, asserting that it would be tantamount to giving the Empire away to their foes. By the time of his death, Nolyds had made many enemies. He publicly accused D'Asta of trying to increase her own power and dismissed the Whiphid Councilor Ch'Unkk's translator droid as a \"metal toady.\" During his brief rule over the Empire, Nolyds was a gaunt, white-haired man with light skin and green eyes. He wore a set of blue and green robes and talked to himself while alone, muttering that whoever had left the message disk in his chambers was uncivilized due to having left it on the floor rather than the table.\nBurr Nolyds was created by authors Mike Richardson and Randy Stradley, who introduced and killed off the character in the first issue of their 1998–1999 comic series Crimson Empire II: Council of Blood. He was mentioned by his fellow councilors in the next two issues of the series, and more details about his life were revealed in 1999's Star Wars Handbook 2: Crimson Empire and 2008's The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/11_ABY/Legends",
  "/wiki/Ord_Cantrell/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dark_Empire",
  "/wiki/Imperial_Ruling_Council/Legends",
  "/wiki/Crimson_Empire",
  "/wiki/Noble/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Carnor_Jax",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Battle_of_Onderon_(Galactic_Civil_War)",
  "/wiki/Duel_in_The_Squall",
  "/wiki/Kir_Kanos",
  "/wiki/Council_Tower",
  "/wiki/Planet/Legends",
  "/wiki/City/Legends",
  "/wiki/De-Purteen",
  "/wiki/Feena_D%27Asta_(clone)",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Nom_Anor",
  "/wiki/Xandel_Carivus",
  "/wiki/Self-destruct_mechanism/Legends",
  "/wiki/Message_disk",
  "/wiki/Burr_Nolyds%27s_chambers",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Standard_year/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Transfer_essence",
  "/wiki/Cloning/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Emperor%27s_physician",
  "/wiki/Operation_Shadow_Hand",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Colonies/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Sarcev_Quest",
  "/wiki/Prisoner/Legends",
  "/wiki/Yinchorr/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Battle_of_Phaeda",
  "/wiki/Phaeda/Legends",
  "/wiki/Executor_(Yuuzhan_Vong_rank)",
  "/wiki/Extra-galactic",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Species/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Galaxy/Legends",
  "/wiki/Mahd_Windcaller",
  "/wiki/Norym_Kim",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Ganner",
  "/wiki/Knife/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Llon_Banjeer",
  "/wiki/Humanocentrism",
  "/wiki/General/Legends",
  "/wiki/Immodet",
  "/wiki/Alien/Legends",
  "/wiki/Xandel_Carivus%27s_Private_Guard",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Time/Legends",
  "/wiki/Whiphid/Legends",
  "/wiki/Ch%27Unkk",
  "/wiki/Ch%27Unkk%27s_protocol_droid",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Mike_Richardson",
  "/wiki/Randy_Stradley",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_1",
  "/wiki/1998",
  "/wiki/1999",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Crimson_Empire_II:_Council_of_Blood",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_2",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_3",
  "/wiki/Star_Wars_Handbook_2:_Crimson_Empire",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Category:Images_of_Burr_Nolyds",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Emperor%27s_Pawns",
  "/wiki/Star_Wars_Gamer_5",
  "/wiki/Empire%27s_End_2",
  "/wiki/Crimson_Empire_5",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_5"
 ]
}