{
 "name": "Bursthed",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Bursthed was the Imperial Governor of Ruten during the New Republic era. He was known to be an evil and corrupt man but also an efficient bureaucrat. He considered his appointment as governor of Rutan beneath him and hoped that an effective term would lead to promotion.\nDuring the Galactic Civil War, Bursthed served as Governor of the planet Draenell's Point.\nBursthed's hobby was collecting exotic and unusual animals from all over the galaxy for his private menagerie. His collection included a bear spider, a dewback, a glittering mynock, and a quexius bird from Endor. His courtesans organized regular Pet Shows where the Governor would inevitably win first prize. In exchange for their support the judges of the shows would receive favors of land which were often taken from farmers later accused of treason against the Galactic Empire and evicted. Also at these shows the animals were made to do tricks that often involve violence to Humans, more than often those accused of being Rebel leaders. Members of the New Republic planned to stop these shows by arranging for the Governor to lose the contest. They planned to swap Bursthed's entry, a glittering mynock, for a Slug-rat. Native to the planet Ruten, when woken the Slug-rat would attack the nearest person.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Ruten",
  "/wiki/New_Republic_era",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Draenell%27s_Point",
  "/wiki/Bear_spider",
  "/wiki/Dewback/Legends",
  "/wiki/Glittering_mynock",
  "/wiki/Quexius_bird",
  "/wiki/Endor/Legends",
  "/wiki/Ruten_Pet_Show",
  "/wiki/Treason/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Slug-rat",
  "/wiki/West_End_Games",
  "/wiki/Changing_the_Balance",
  "/wiki/Star_Wars_Gamemaster_Kit",
  "/wiki/Classic_Campaigns",
  "/wiki/Operation:_Pet_Show",
  "/wiki/Twin_Stars_of_Kira_(West_End_Games)"
 ]
}