{
 "name": "Bushman_Krentz",
 "display_name": "Bushman Krentz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "137 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White; black eyebrows"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Bushman Krentz was a Human male pilot who was regarded as both a drunk and an imbecile by his peers. In 137 ABY, a drunken Krentz was passing through the city of Mos Eisley on the planet Tatooine when he encountered a beautiful female humanoid in a dark back alley. Unbeknownst to him, the female was actually the Anzat assassin Nakia Yoru. Nakia tempted Krentz closer and killed the pilot by draining Krentz's soup—his brain matter—with the proboscises on her face.\nA male Human pilot who lived during the Second Imperial Civil War, Bushman Krentz was a heavy drinker and was thus often insulted by his colleagues. In 137 ABY, a drunken Krentz walked through the spaceport city of Mos Eisley on the planet Tatooine, stumbling his way through a desolate back alley at night while he searched for his starship, fuming about being derided for his drinking. Although it was quite dangerous to be out at night alone in Mos Eisley, Krentz continued on his way and eventually encountered an attractive female humanoid who urged Krentz to come closer.\nKrentz complied, transfixed on the female's beautiful appearance. However, unbeknownst to the pilot, the female was actually an Anzat assassin, Nakia Yoru. As Krentz approached, Yoru grabbed onto the drunken pilot and, before he could react, inserted her facial proboscises into Krentz's nose, feeding on Krentz's soup—the Anzat term for a being's brain matter and mental essence. With his soup drained, Krentz fell to the ground, dead.\nNakia, unsatisfied with the amount of soup Krentz had, departed the scene of the murder to find another target, leaving Krentz's corpse lying in the alley.\nBushman Krentz was a drunk and a dim-wit, and was often ridiculed by his peers because of his habits—much to his chagrin, he was even called \"a drunken womp rat\" on one occasion. On the night of his death, an intoxicated Krentz shirked common sense and put himself in harm's way when he walked through Mos Eisley alone at night, despite the extreme danger. While drunk, he was also easily manipulated by Nakia Yoru, a female whom the pilot believed was very attractive, as she coaxed him toward her and killed him. Krentz had fair skin, a white beard, black eyebrows, and brown eyes.\nBushman Krentz made his first and only appearance to date in the comic issue Legacy  38, published by Dark Horse Comics on July 29, 2009. He served as a minor character and was killed off two pages into the issue.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/137_ABY",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/White",
  "/wiki/Black",
  "/wiki/Eye/Legends",
  "/wiki/Brown",
  "/wiki/Pilot/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/City/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Anzat_(species)",
  "/wiki/Assassin/Legends",
  "/wiki/Nakia_Yoru",
  "/wiki/Death/Legends",
  "/wiki/Soup_(Anzati)",
  "/wiki/Brain/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Spaceport/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Womp_rat/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_38",
  "/wiki/Dark_Horse_Comics",
  "/wiki/July_29",
  "/wiki/2009"
 ]
}