{
 "name": "Butch",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rancor-dragon"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order"
     ]
    },
    {
     "name": "Owner(s)",
     "values": [
      "Shae Koda",
      "Quan-Jang"
     ]
    }
   ]
  }
 ],
 "content": "Butch was a female rancor-dragon created through alchemy at Anil Kesh by Shae Koda and Quan-Jang.\nButch was created through alchemy at Anil Kesh by Master Quan-Jang and Shae Koda, a Je'daii Journeyer who was his apprentice. When Quan-Jang and Shae Koda took the rancor-dragon outside from the laboratory of Anil Kesh, Butch was restive and finally broke free, nearly dragging Shae Koda to the deadly Chasm. The behaviour of the beast was explained by the Force Storm, brewing around Tython and affecting all the living things. Finally, Quan-Jang had to intervene and to subdue the rancor using the animal bond technique.\nSome time later, Shae Koda rode Butch to the Rift trying to find a place that she had seen in her vision. She was soon joined by two other Journeyers, Sek'nos Rath and Tasha Ryo, who had shared the same vision with her. They witnessed the crash of an alien ship and then, coming to see the crash site, found an escape pod with an only survivor; that survivor was Xesh, a Force Hound of the Infinite Empire. Xesh attacked the Je'daii and during their fight threw Butch from the cliff into an acid pool, to Koda's outrage. He then escaped deeper to the Abyss, and the Journeyers began to chase him. Later Quan-Jang came to investigate the crash site, too, together with two Je'daii Rangers, Rori Fenn and Hawk Ryo. They found the escape pod and the broken blades of the Journeyers, when suddenly they were attacked by the wounded and furious Butch, who charged at them from the forest. But Quan-Jang managed to calm her down and healed her wounds and acid burns. After that he flew on her back to search for the Journeyers and the alien stranger. But the Force Storm was getting stronger, exhausting the rancor, so finally Quan-Jang had to leave Butch to rest and to continue the search on foot.\nA year later, when the Infinite Empire invaded the Tython system, Shae Koda fought in many battles riding her rancor-dragon. During the final battle\nthe leader of the Rakata, Skal'nas, descended to the depth of the Chasm together with Xesh and the captive Daegen Lok to find the Infinity Gate. Shae Koda followed them riding Butch.\nDuring the battle at the Infinity Gate Butch was chased away by Force lightnings, Daegen Lok fought Skal'nas, but was badly wounded by him, and Shae Koda fought Xesh and managed to persuade him to return to the Light.\nHe then turned against Skal'nas and killed him.\nLok tried to persuade Koda to get away with Xesh using his jetpack and to leave him there, as the power of the jetpack was not enough to carry all three of them. At that moment Butch returned to Shae Koda, so all of them could escape from the Chasm riding the rancor-dragon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tython/Legends",
  "/wiki/Rancor-dragon",
  "/wiki/Gender/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Shae_Koda",
  "/wiki/Quan-Jang",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Anil_Kesh",
  "/wiki/Je%27daii_Master",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Chasm",
  "/wiki/Force_Storm_(Tython)",
  "/wiki/Animal_bond",
  "/wiki/Rift",
  "/wiki/Sek%27nos_Rath",
  "/wiki/Tasha_Ryo",
  "/wiki/Rakata/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Tau_(individual)",
  "/wiki/Force_Hound",
  "/wiki/Infinite_Empire",
  "/wiki/Abyss_of_Ruh",
  "/wiki/Je%27daii_Ranger",
  "/wiki/Rori_Fenn",
  "/wiki/Hawk_Ryo",
  "/wiki/Tython_system/Legends",
  "/wiki/Second_battle_of_Tython",
  "/wiki/Skal%27nas",
  "/wiki/Daegen_Lok",
  "/wiki/Infinity_Gate",
  "/wiki/Force_lightning/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Category:Images_of_Butch",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_2",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_3",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_4",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_5",
  "/wiki/Dawn_of_the_Jedi:_Force_War_1",
  "/wiki/Dawn_of_the_Jedi:_Force_War_2",
  "/wiki/Dawn_of_the_Jedi:_Force_War_4",
  "/wiki/Dawn_of_the_Jedi:_Force_War_5"
 ]
}