{
 "name": "Buzzy",
 "display_name": "Buzzy",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Varonat"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gamgalon"
     ]
    }
   ]
  }
 ],
 "content": "Buzzy was a Human male who lived in Tropis-on-Varonat on the planet Varonat. He was employed by Gamgalon, a Krish crimelord who used Morodin-hunting expeditions as a front for growing and harvesting chemically altered aleudrupe berries. In 8 ABY, he and his companion, Fleck, greeted Syndic Pandis Hart of Sif-Uwana and his pilot, Captain Seoul, to Varonat. The pair—actually smugglers Talon Karrde and Quelev Tapper in disguise—claimed to need a hyperdrive mechanic to look at their starship, the Uwana Buyer. Fleck sent Buzzy to find their mechanic, a Human female named Celina Marniss, and told her that a rush job needed to be done. The next day, Buzzy accompanied the Krish Falmal on a Morodin-hunting safari of six hunters, including Karrde and Tapper.\nBuzzy, a Human male, lived in the settlement of Tropis-on-Varonat on the planet Varonat, located on the Ison Corridor in the Anoat sector of the Outer Rim Territories. In 7 ABY, a Krish named Gamgalon came to the planet and established a safari that hunted Morodins, a large herbivore that roamed the planet's jungles. Based out of Tropis-on-Varonat, the safari was a front for Gamgalon's true operation: the slime secreted by the Morodins as they moved around the jungle was a natural fertilizer that changed the chemical composition of aleudrupe berries. The pits of the fruit were then able to act as a catalyst, and when joined with rethan-K and promhassic triaxli, created ammunition for blasters as strong as spin-sealed Tibanna gas. All three substances were usually non-lethal and perfectly legal, and would withstand any customs inspection or chemical scan.\nBuzzy began working for Gamgalon, and in 8 ABY was present when the space yacht Uwana Buyer landed on Varonat. Alongside Fleck, who worked as a come-up flector for Gamgalon, Buzzy greeted Syndic Pandis Hart, chief purchasing agent of the Sif-Uwana Council, and his pilot, Captain Seoul. Hart and Seoul—who were, in reality, smugglers Talon Karrde and his lieutenant, Quelev Tapper—claimed to have hyperdrive engine troubles and were in need of a mechanic. Karrde and Tapper had heard about Gamgalon's safaris and suspected it was a front for a larger enterprise, and were investigating the possibility of acquiring a slice of the action for themselves. Fleck did most of the talking with the newcomers, and sent Buzzy off to find the settlement's mechanic, a Human woman named Celina Marniss, while he persuaded the disguised smugglers to sign up to the next safari expedition that was leaving the next day. Buzzy found Marniss—who was actually the former Emperor's Hand, Mara Jade—and informed her of the repair job that needed attending to, mentioning that he was impressed with Syndic Hart.\nThe next morning, Buzzy was a member of the safari expedition alongside the Krish Falmal, Gamgalon's chief lieutenant, and the Rodian Jombo. In addition to Karrde and Tapper, the expedition consisted of four other hunters: the Thennqora, Tamish; a Saffa named Cob-caree; and a pair of Duros called Hav and Jivis. The group broke into three groups to travel to the safari base camp by airspeeder; Buzzy accompanied Hav and Jivis in their vehicle. The group then hiked through the jungle for several hours to reach the hunting trails. While Falmal led the group, Buzzy stayed in the center while Jombo brought up the rear. After several hours, the party began setting up camp when they heard the distinctive growl of a Morodin nearby. At Falmal's order, the party broke into the same groups of three that had traveled together on the airspeeders, and Buzzy took Hav and Jivis into the jungle to hunt the Morodin. Although Falmal, accompanied by Karrde and Tapper, found the creature first, it was Tamish and Cob-caree who made the kill when Karrde hesitated in pulling the trigger.\nShortly after, Karrde and Tapper disappeared from the camp and made a discovery that Gamgalon was keeping secret: the Morodins were actually a sentient species. Gamgalon confronted the pair of smugglers in person, alongside several other Krish including Falmal. Not wanting Karrde to cut into his operation, Gamgalon planned to kill the pair. The two smugglers attempted to escape; Tapper was killed in the attempt, but Karrde was rescued by Celina Marniss, who killed Gamgalon and Falmal. The mechanic revealed her true name to Karrde, and the pair left the planet aboard the Uwana Buyer.\nBuzzy was a laconic individual, preferring to let others speak. He was a competent Morodin hunter, and had experience handling blaster weapons.\nBuzzy first appeared in Timothy Zahn's First Contact, which was published in 1994's Star Wars Adventure Journal 1 by West End Games. First Contact was subsequently reprinted in The Best of the Star Wars Adventure Journal, Issues 1-4, Tales from the Empire, and on Hyperspace.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Buzz_(disambiguation)",
  "/wiki/Varonat/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gamgalon",
  "/wiki/Tropis-on-Varonat",
  "/wiki/Planet/Legends",
  "/wiki/Krish_(species)/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Morodin/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Aleudrupe_berry/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Fleck_(Human)",
  "/wiki/Syndic/Legends",
  "/wiki/Talon_Karrde",
  "/wiki/Sif-Uwana",
  "/wiki/Pilot/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Quelev_Tapper",
  "/wiki/Smuggler/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Uwana_Buyer",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Standard_day/Legends",
  "/wiki/Falmal",
  "/wiki/Ison_Corridor",
  "/wiki/Anoat_sector/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Rethan-K",
  "/wiki/Promhassic_triaxli",
  "/wiki/Blaster/Legends",
  "/wiki/Tibanna/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Yacht/Legends",
  "/wiki/Come-up_flector",
  "/wiki/Sif-Uwana_Council",
  "/wiki/Lieutenant/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Jombo",
  "/wiki/Thennqora",
  "/wiki/Tamish",
  "/wiki/Saffa_(species)",
  "/wiki/Cob-caree",
  "/wiki/Duros/Legends",
  "/wiki/Hav",
  "/wiki/Jivis",
  "/wiki/Airspeeder/Legends",
  "/wiki/Arrow-17_airspeeder",
  "/wiki/Standard_hour/Legends",
  "/wiki/Morodin_(language)",
  "/wiki/Death/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Species/Legends",
  "/wiki/Timothy_Zahn",
  "/wiki/First_Contact",
  "/wiki/1994",
  "/wiki/Star_Wars_Adventure_Journal_1",
  "/wiki/West_End_Games",
  "/wiki/The_Best_of_the_Star_Wars_Adventure_Journal,_Issues_1-4",
  "/wiki/Tales_from_the_Empire",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Varonat_system"
 ]
}