{
 "name": "Bweena",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue-green"
     ]
    }
   ]
  }
 ],
 "content": "Bweena was a female Quarren who was present at the Frozen Kova cantina on the planet Hynestia. She played Sabacc with Lando Calrissian and Zel Gris.\nBweena was a female Quarren who lived in the early years of the Galactic Empire. During that time, she visited the Frozen Kova, the only cantina on the planet Hynestia. There, Bweena engaged in several hands of Sabacc with the smuggler Lando Calrissian and the Lynna Zel Gris, strategy instructor to the Hynestian Princess Rinetta Gan. Early in their play, Calrissian lost multiple hands in a row to Bweena and Gris. Later his luck changed and the Quarren lost a substantial amount of credits to him. As her credits dwindled, she became visibly worried and irritated, and ultimately folded to avoid further loss of money. Because she was a an excellent player, Calrissian, who always enjoyed playing Sabacc against others with skill, greatly enjoyed their game. As Bweena left, he told Bweena if she was ever in that area of the galaxy againt to stop and say hello. She responded with a blooping noise that may have been an agreement or a rude retort.\nBweena had facial tendrils blue-green skin that glistened in the light. Losing at Sabacc made her worried and irritated.\nBweena was an excellent Sabacc player, earning her the respect of Lando Calrissian.\nBweena first appeared in the 2018 middle-grade novel Lando's Luck written by Justina Ireland.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Quarren",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Frozen_Kova",
  "/wiki/Cantina",
  "/wiki/Planet",
  "/wiki/Hynestia_Prime",
  "/wiki/Sabacc",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Zel_Gris",
  "/wiki/Standard_year",
  "/wiki/Galactic_Empire",
  "/wiki/Smuggler",
  "/wiki/Lynna",
  "/wiki/Strategy_instructor",
  "/wiki/Hynestian",
  "/wiki/Prince",
  "/wiki/Rinetta_Gan",
  "/wiki/Credit",
  "/wiki/Currency",
  "/wiki/The_galaxy",
  "/wiki/Limb",
  "/wiki/2018",
  "/wiki/Lando%27s_Luck",
  "/wiki/Justina_Ireland",
  "/wiki/Lando%27s_Luck_(audiobook)"
 ]
}