{
 "name": "Byalfin Dyur",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bronze"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Boneyard Rendezvous",
      "Lumiya"
     ]
    }
   ]
  }
 ],
 "content": "Byaflin Dyur was a male Bothan pirate who was the captain of the Boneyard Rendezvous. As of 40 ABY, he and his crew were contacted by Sith Lady Lumiya.\nDyur and his crew were to be a part of an operation to test the young Ben Skywalker's morals and skills, to determine if he was worthy to be Jacen Solo's Sith apprentice, or his sacrifice. Posing as Jacen, Lumiya instructed Ben to steal the Amulet of Kalara from the offices of Tendrando Arms on the Almanian moon of Drewwa. The Boneyard parked in docking bay near to the office building, falsely disguised as the High Tide, under the pretense of running a droid business.\nHowever, Drewwa was not to be Skywalker's testing ground. Lumiya instructed Dyur to steal the amulet and give to the courier Faskus with orders to take it to a specified cave on Ziost. Faskus flew to Ziost in his ship, the Blacktooth, and while on the ground one of Dyur's TIE/LN starfighters strafed his ship, mortally wounding him as he ran back to save his young daughter Kiara. When Skywalker came to Ziost in search of Faskus, Dyur had the BTL Y-wing starfighter he flew in on also destroyed. The young Jedi now had to prove himself worthy, under the constant orbital surveillance of the pirate captain.\nWhen Dyur informed Lumiya that Skywalker had taken Kiara under his protection she ordered him to kill the boy and his charge. The Bothan sent Keldan in one of their bronze painted TIE Fighters to carry out their instructions. However Dyur was bemused to learn that Skywalker used The Force to hurl rocks at the fighter, forcing the pirate to retreat. The next day the Chev Ovvit was sent to finish the job. However Skywalker once again surprised the pirate captain, luring the fighter into the shadows of a temple and crushing it with a rockfall.\nThinking that the boy was trapped on the surface of the planet, Dyur was once again surprised when Hirrtu, his communications officer, informed him that a craft had taken off from the ruined temple. He ordered battle stations and opened fire on the craft. However the Ziost ship was too nimble, and Skywalker fired magnetically accelerated balls into the freighter's hull, punching through the superstructure and causing serious damage. Dyur rolled the freighter away and dove down to Ziost's atmosphere. Skywalker severed his comm antennae as he retreated, but then decided against attacking the freighter further.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Boneyard_Rendezvous",
  "/wiki/Lumiya",
  "/wiki/Captain/Legends",
  "/wiki/40_ABY",
  "/wiki/Sith_Lady",
  "/wiki/Ben_Skywalker",
  "/wiki/Darth_Caedus",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Amulet_of_Kalara",
  "/wiki/Tendrando_Arms",
  "/wiki/Almania/Legends",
  "/wiki/Drewwa",
  "/wiki/High_Tide",
  "/wiki/Faskus",
  "/wiki/Ziost/Legends",
  "/wiki/Blacktooth",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Kiara",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Keldan",
  "/wiki/The_Force/Legends",
  "/wiki/Chev",
  "/wiki/Ovvit",
  "/wiki/Hirrtu",
  "/wiki/Sith_Meditation_Sphere",
  "/wiki/Legacy_of_the_Force:_Exile",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}