{
 "name": "Bycha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Typha-Dor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Bycha was a Human female commanding general for the planet Typha-Dor.\nIn 25 BBY, during the attack on Typha-Dor instigated by its predatory neighbor, Vanqor, High General Bycha utilized falsified \"invasion plans\" provided by Typha-Dor native Mezdec, an undercover agent for the Vanqors, to prepare Typha-Dor's defense.\nWhen the Jedi Anakin Skywalker and Obi-Wan Kenobi arrived on Typha-Dor before the Vanqor assault and accused Mezdec of being a spy for Typha-Dor's enemy, Bycha believed their claims in spite of Mezdec's denial. The real invasion plans, brought by the Jedi, enabled Bycha's fleet to catch the Vanqors by surprise and force them to surrender without firing a shot, saving Typha-Dor from invasion and opening the way to negotiate a peace settlement.\nGeneral Bycha was determined that part of that peace would be the eradication of the substance abuse imposed by the scientist Jenna Zan Arbor on prisoners-of-war interred at The Tomo Camp in the Tomo Craters region of Vanqor.\nGeneral Bycha was described as tall and imposing, with multi-colored medals on her shoulders.\nGeneral Bycha, in The Complete Star Wars Encyclopedia, is erroneously characterized as being male.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Typha-Dor",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/General/Legends",
  "/wiki/Planet/Legends",
  "/wiki/25_BBY/Legends",
  "/wiki/Vanqor/Legends",
  "/wiki/High_General",
  "/wiki/Mezdec",
  "/wiki/Jedi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Mission_to_Typha-Dor",
  "/wiki/Zone_of_Self-Containment",
  "/wiki/Jenna_Zan_Arbor",
  "/wiki/Tomo_Camp",
  "/wiki/Tomo_Craters",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Bycha",
  "/wiki/Jedi_Quest:_The_Moment_of_Truth",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}