{
 "name": "Byxle_Pedette",
 "display_name": "Byxle Pedette",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gold"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tasty Dried Critters"
     ]
    }
   ]
  }
 ],
 "content": "Byxle Pedette was a Mon Calamari chef and businessman who lived on the planet Tatooine during the Galactic Civil War.\nAfter the Battle of Yavin, Byxle Pedette operated Mos Eisley's only Tasty Dried Critters franchise, although he wasn't much of a cook.\nIn 1 ABY, the Mon Calamari was getting so many orders that he had to ask a spacer who was walking by to deliver three extra orders for a few credits. The spacer agreed and Byxle gave him the location of the deliveries and told him he could keep any tips he got and not to forget the slogan, \"TDC is not fast food, it's food delivered fast\".\nWhen the spacer got to the first location, Drixa Dreul's house, Drixa found out that Byxle hadn't given the spacer fungus dippers she'd ordered. After the first delivery, Byxle called the spacer and told him Drixa hadn't paid for the fungus dippers or the spacers tip, but he said it wasn't his fault, Drixa always had something to complain about. The next delivery was at the Trandoshan Nogri Hessen's house. When the spacer arrived it turned out the stuffed Chuba was still alive and eating the rest of the food. The Trandoshan didn't pay for the delivery, but Byxle called and said that Nogri told him about the food and believed him and said he'd still pay him for the delivery, and also told him to be careful about the next location, the delivery was at the dangerous swoop gang leader, Jano Bix.\nThe Spacer arrived for the delivery, but he was surrounded by swoop riders. When the spacer got to Jano, everything was going all right until the four Chubas the spacer was supposed to deliver attacked Jano and the spacer. After killing the Chubas, Jano threatened the spacer, but the spacer said that Byxle just made a mistake. Jano replied. Once again Byxle calls and says Jano paid, and that he likes his Chubas fresh. When the spacer returned to the restaurant, Byxle said that Jano called back and that he had no idea the Chubas were alive. Byxle Pedette paid the spacer and the spacer left and stopped doing deliveries for him.\nByxle Pedette was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Byxle Pedette was added to the game upon the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Tasty_Dried_Critters",
  "/wiki/Chef/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Jano_Bix",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Drixa_Dreul",
  "/wiki/Fungus_dippers",
  "/wiki/Trandoshan/Legends",
  "/wiki/Nogri_Hessen",
  "/wiki/Swoop_gang/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}