{
 "name": "Bzorn",
 "display_name": "Bzorn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Ionic Ring Ship over Little Kessel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Bzorn was a Human male who served as a Captain in the Imperial Navy during the Galactic Civil War. In 0 ABY, Darth Vader personally tasked Bzorn with devastating a series of Rebel-held planets—he carried this out by commandeering the Ionic Ring Ship, a weather control device developed by Professor Renn Volz. However, his plans were foiled by Volz's daughter Mira and the Rebels Han Solo, Luke Skywalker and Chewbacca, who stormed the Ionic Ring and started a blaster fight that ended in Bzorn's death.\nA male, Bzorn reached the rank of Captain in the Imperial Navy during the Galactic Civil War. In the wake of the Battle of Yavin—with the tide having decisively turned in the war with the Rebel Alliance—the Sith Lord Darth Vader directly tasked Bzorn with hunting down and laying waste to Rebel-held planets. To this end, he tracked down professor and inventor Renn Volz, a native of Little Kessel who had built a device known as the Ionic Ring Ship that could control a planet's weather from above. Bzorn and a crew of stormtroopers forcibly boarded the Ionic Ring above the planet Zerm, and took Volz's daugher Mira captive to ensure his compliance.\nMira Volz wasn't in Bzorn's hands long, as she managed to slip out of Imperial custody during a transfer to a prison ship at a remote spaceport, coincidentally ending up with a crew of Rebels when she stowed away on Han Solo's Millennium Falcon during her escape. Although his leverage was gone, Bzorn continued to bluff and forced her father to use the Ionic Ring to devastate the Rebel base of Rion. From there they moved on to Volz's homeworld of Little Kessel, the next world on Bzorn's list. Bzorn forced Volz to attack Little Kessel with groundquakes and cyclones, but he could only push the scientist so far—unwilling to destroy his home, Volz refused to go any further, saying he would accept all consequences to him and his daughter. However, Mira Volz and the Rebels had followed the Ionic Ring to Little Kessel, and Solo and his allies Luke Skywalker and Chewbacca bluffed their way aboard and stormed the control room. In the opening shots of a frenzied, close-quarters firefight, Bzorn was struck and killed by a ricocheted blaster bolt from one of his own troopers, ending his Rebel hunt.\nA ruthless Imperial officer with a driving hatred of the Rebellion, Bzorn carried out his missions without any regard for innocent lives. Bald and intimidating, Bzorn could be absolutely merciless when pursuing a task, and had no qualms with threatening the lives of any who stood in his way.\nBzorn appeared in The Second Kessel Run, a comic strip story arc written by Russ Helm and released in 1980. In the comic, Bzorn was illustrated by Russ Manning. Bzorn later received an entry in The Complete Star Wars Encyclopedia, released in 2009.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Ionic_Ring_Ship",
  "/wiki/Little_Kessel/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Professor/Legends",
  "/wiki/Renn_Volz",
  "/wiki/Mira_Volz",
  "/wiki/Han_Solo/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Zerm",
  "/wiki/Prison/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Devastation_of_Rion",
  "/wiki/Rion/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Devastation_of_Little_Kessel",
  "/wiki/Groundquake/Legends",
  "/wiki/Laser/Legends",
  "/wiki/The_Second_Kessel_Run",
  "/wiki/Star_Wars_(comic_strip)",
  "/wiki/Russ_Helm",
  "/wiki/1980",
  "/wiki/Russ_Manning",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2009",
  "/wiki/Star_Wars:_The_Comics_Companion"
 ]
}