{
 "name": "Cabbel",
 "display_name": "Cabbel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Death Squadron",
      "Imperial Navy's officer corps",
      "Death Squadron",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Cabbel was a human male who served as a controller aboard the Imperial II-class Star Destroyer Tyrant, a part of the Death Squadron fleet. During the Galactic Civil War, the fleet was tasked with finding the secret headquarters of the Alliance to Restore the Republic and ultimately located the base on the planet Hoth in 3 ABY.\nWhile the Tyrant and the rest of Death Squadron formed a blockade over the world as Imperial ground forces assaulted the base, the rebel forces below began their evacuation. The first rebel transport launched was the Quantum Storm, which the Tyrant moved to intercept. On the Star Destroyer's bridge, Cabbel informed the Tyrant's captain, Lennox, of the approaching rebel vessel. A tractor beam was used in an attempt to capture the transport; however, a shot from the Alliance's Hoth-based ion cannon disabled the Tyrant, allowing the Quantum Storm to escape.\nCabbel was a human male member of the Galactic Empire's Imperial Officer Corps, serving in the Imperial Navy's faction. In 3 ABY, during the Galactic Civil War, Cabbel held the military rank of lieutenant and was stationed as a controller on the bridge of the Imperial II-class Star Destroyer Tyrant. The Tyrant was commanded by Captain Lennox and served as one of the five Imperial-class Star Destroyers in Death Squadron, the personal fleet of Sith Lord Darth Vader.\nArriving at the planet Hoth, the location of the secret headquarters of the Alliance to Restore the Republic, Death Squadron, including Tyrant, formed a blockade around the planet while ground forces were deployed to destroy a shield protecting the rebel base from orbital bombardment. The Alliance began evacuating all personnel from its base, with the first escape vessel launched being the GR-75 medium transport Quantum Storm, escorted by two T-65B X-wing starfighters. As the trio of starships left Hoth, the Tyrant moved to block their path, and Cabbel approached Lennox on the Star Destroyer's bridge to inform him that the rebel vessels were approaching their sector.\nIn order to capture the enemy ships with a tractor beam, the Tyrant lowered its shields, unknowingly giving an opening to a v-150 Planet Defender ion cannon that the Alliance had built in its base below. The cannon fired several shots at the Tyrant, disabling the vessel and sending it careening away into space as the rebel vessels escaped the star system. Ultimately the Empire claimed victory at Hoth, although many other rebel vessels also succeeded in escaping.\nCabbel had fair skin and brown hair.\nCabbel wore a standard olive-gray naval officer's uniform including an Imperial kepi. On his left breast, he bore a single code cylinder and a rank insignia plaque with two red bars over two blue.\nCabbel was portrayed by Oliver Maguire in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. Maguire was credited only as one of several \"Other Officers,\" with the film's script describing the character as a controller. The character first received his name in the new Star Wars canon on a card in the 2015 2015 Topps Star Wars Force Attax The Force Awakens set of trading cards released by The Topps Company, Inc. The name originated in the Star Wars Legends continuity, where it first appeared on a card for the 1998 Hoth Limited expansion set of Decipher, Inc.'s Star Wars Customizable Card Game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Cabbel",
  "/wiki/Cabbel/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Death_Squadron",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/File:Cabbel-Lennox.ogg",
  "/wiki/Lieutenant",
  "/wiki/Controller",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Tyrant",
  "/wiki/Fleet",
  "/wiki/Galactic_Civil_War",
  "/wiki/Project_Swarm",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Echo_Base",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/3_ABY",
  "/wiki/Blockade",
  "/wiki/Blizzard_Force",
  "/wiki/Battle_of_Hoth",
  "/wiki/Alliance_Military",
  "/wiki/GR-75_medium_transport",
  "/wiki/Quantum_Storm",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Bridge_(starship)",
  "/wiki/Captain",
  "/wiki/Lennox",
  "/wiki/Starship",
  "/wiki/Tractor_beam",
  "/wiki/Transport",
  "/wiki/V-150_Planet_Defender",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Imperial_Navy",
  "/wiki/Military_rank",
  "/wiki/Commanding_officer",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Squadron",
  "/wiki/Deflector_shield",
  "/wiki/Orbital_bombardment",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Star_Destroyer",
  "/wiki/Ion_cannon",
  "/wiki/Cannon",
  "/wiki/Realspace",
  "/wiki/Star_system",
  "/wiki/Hair",
  "/wiki/Navy",
  "/wiki/Imperial_officer",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_kepi",
  "/wiki/Breast",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Oliver_Maguire",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars",
  "/wiki/2015",
  "/wiki/2015_Topps_Star_Wars_Force_Attax_The_Force_Awakens",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars_Legends",
  "/wiki/1998",
  "/wiki/Hoth_Limited",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Category:Images_of_Cabbel",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/September_29",
  "/wiki/2004",
  "/wiki/Star_Wars:_Behind_the_Magic"
 ]
}