{
 "name": "Caeleb%27s_mother",
 "display_name": "Caeleb's mother",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Dalicron-4"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "The mother of the boy Caeleb was a Force-sensitive female Human who lived on the planet Dalicron-4 during the Galactic Civil War. In 3 ABY, the Whiphid Dark Jedi Tol Skaros attempted to kidnap Caeleb and during an assault by Skaros on her family home, the woman was killed by the Whiphid's nek battle dogs.\nThe mother of the boy Caeleb was a Force-sensitive female Human who lived during the time of the Galactic Civil War. The woman wed a Force-sensitive man and they conceived a child, the boy Caeleb, who she gave birth to in around 2 BBY. While carrying Caeleb in her womb she sensed that that there was something special about her baby. She was subsequently proven to be correct: Caeleb possessed seemingly unlimited power in the Force and was the subject of an ancient prophecy heralding the coming of a \"Child of Light.\" Unknown to the woman, around one thousand years prior to Caeleb's birth, the Jedi Master Duumas had predicted Caeleb's birth and merged his consciousness into a tree at an isolated spot on the planet Dalicron-4 to created a bubble devoid of the Force as a safe haven for the child. The woman's husband received a vision of the tree and, keen protect Caeleb from the Force until he was more mature, the couple settled with their boy in a homestead sited next to Duumas' tree.\nThe woman and her husband sought to give Caeleb had a happy childhood and they forbade him from crossing a stone wall that marked the boundary of the Force bubble surrounding their home. In 3 ABY, the family's quiet life was shattered when the Dark Jedi Thaum Rystra sent his apprentice, the Whiphid Tol Skaros, to apprehend Caeleb, plotting to utilize Caeleb's power to resurrect the Sith spirit Valik Kodank. Accompanied by two Viper probe droids and several nek battle dogs and with orders from Rystra to kill Caeleb's parents, Skaros raided the family's home. At the Whiphid's direction, his nek dogs swarmed over Caeleb's mother and killed her, with Caeleb observing her death from a window. Anguished at witnessing his spouse's demise, Caeleb's father was soon also slain by the Whiphid, though Skaros was ultimately prevented from apprehend the child due to the timely arrival of agents of the Rebel Alliance insurgent group. At Caeleb's request, the Rebels buried the bodies of his mother and father beneath Duumas' tree, which Caeleb believed would allow his parents to take care of each other in death.\nCaeleb's mother appeared in the Star Wars Legends roleplaying adventure Child of Light, which was written by Lee Pickler and published in 2000 by RPGA as the first adventure in the Child of Light saga roleplaying trilogy. She was also mentioned in Soulsaber and Light and Dark, the second and third adventures of the trilogy, published in 2001 and 2002 respectively. None of the three Child of Light saga adventures identify the woman's name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Dalicron-4",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Caeleb",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Whiphid/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Tol_Skaros",
  "/wiki/Death/Legends",
  "/wiki/Nek/Legends",
  "/wiki/Time/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Caeleb%27s_father",
  "/wiki/Reproduction/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Womb/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Duumas",
  "/wiki/Tree/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/Thaum_Rystra",
  "/wiki/Force_ghost",
  "/wiki/Valik_Kodank",
  "/wiki/Viper_probe_droid/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Child_of_Light",
  "/wiki/Lee_Pickler",
  "/wiki/2000",
  "/wiki/RPGA",
  "/wiki/Child_of_Light_saga",
  "/wiki/Soulsaber_(adventure)",
  "/wiki/Light_and_Dark_(adventure)",
  "/wiki/2001",
  "/wiki/2002",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/Galactic_Standard_Calendar"
 ]
}