{
 "name": "Caeleb%27s_father",
 "display_name": "Caeleb's father",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Dalicron-4"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "The father of the child Caeleb was a Force-sensitive Human male who lived on the planet Dalicron-4 during the time of the Galactic Empire. In 3 ABY, the Dark Jedi Tol Skaros ventured to Dalicron-4 to kidnap Caeleb and slew the boy's father while attempting to apprehend the child.\nThe father of the child Caeleb was a Force-sensitive Human male who lived during the reign of the Galactic Empire. Though he received no formal training, the man gained a rudimentary use of the Force and acquired a green-bladed lightsaber.\nThe man married a Force-sensitive woman and the pair conceived a son, Caeleb, born in about 2 BBY, who was the subject of an ancient prophecy heralding the coming of a \"Child of Light\" possessing unlimited Force potential. The man and his wife sought to bring up Caeleb away from strong Force influences to protect their son from his power. After the man received a vision of a large, unusually-colored tree on the sparsely-populated planet Dalicron-4 sited on a spot devoid of the Force he instantly knew it to be the perfect place to raise their child. Unknown to the man, the Force bubble had been created almost one thousand years earlier by the Jedi Master Duumas as a haven for the Child of Light. The man and his wife subsequently settled with Caeleb in a homestead sited next to the tree. The two parents raised their son in a happy environment and forbade Caeleb from passing beyond a marker wall that surrounded their home at the boundary of the Force bubble.\nIn 3 ABY, the Dark Jedi Thaum Rystra dispatched his apprentice, the Whiphid Tol Skaros, to capture Caeleb so that Rystra could exploit the boy's Force talents to resurrect the Sith spirit Valik Kodank. Rystra ordered his apprentice to kill Caeleb's guardians when kidnapping the child and Skaros led a force of nek battle dogs and and Viper probe droids in an assault on the family's homestead. Caeleb's father drew his lightsaber and sparred with Skaros while the nek dogs attacked Caeleb's mother. The man's screams woke up their son, who had been sleeping inside the homestead, and as the neks overcame and killed his wife the man was struck by anguish. In his tormented state, the man was slain by Skaros and Caeleb observed his father's death from a window. Just as the man died, a group of agents of the Rebel Alliance insurgent group arrived and prevented Skaros from taking Caeleb. At Caeleb's request, the Rebels buried the bodies of the boy's parents under the tree next to their homestead, which the child believed would allow his mother and father to take care of each other in death.\nCaeleb's father sought for his son to have exposure only to positive emotions as the boy grew up. The man cared deeply for his wife and child and was greatly distressed by Caeleb's mother's death and by the prospect of what would happen to Caeleb at Skaros' hands.\nThe father of the child Caeleb appeared in Child of Light, a roleplaying adventure written by Lee Pickler and set within Star Wars Legends continuity that was published by RPGA in 2000 as the opening instalment of the Child of Light saga roleplaying series. He was later referenced in the second and third adventures in the series, Soulsaber and Light and Dark, in 2001 and 2002 respectively. In Child of Light, the man's fight with Skaros can take place either within or beyond the Force bubble surrounding the family's home. If they engage in combat outside the bubble Caeleb's father initially gains the upper hand is ultimately beset by feelings of grief for his wife and worry for Caeleb's wellbeing, thereby allowing Skaros to gain an advantage and strike him down. The man's name is not specified in any of the adventures of the Child of Light saga.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Dalicron-4",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Caeleb",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Tol_Skaros",
  "/wiki/Death/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Caeleb%27s_mother",
  "/wiki/Reproduction/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Duumas",
  "/wiki/Thaum_Rystra",
  "/wiki/Whiphid/Legends",
  "/wiki/Force_ghost",
  "/wiki/Valik_Kodank",
  "/wiki/Nek/Legends",
  "/wiki/Viper_probe_droid/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Child_of_Light",
  "/wiki/Roleplaying_game",
  "/wiki/Lee_Pickler",
  "/wiki/RPGA",
  "/wiki/2000",
  "/wiki/Child_of_Light_saga",
  "/wiki/Soulsaber_(adventure)",
  "/wiki/Light_and_Dark_(adventure)",
  "/wiki/2001",
  "/wiki/2002",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/Galactic_Standard_Calendar"
 ]
}