{
 "name": "Caern_Adan",
 "display_name": "Caern Adan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 5 ABY",
      "a planetoid in the Cerberon system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Balosar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "with gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "IGBC Financial Review",
      "Alliance to Restore the Republic",
      "Rebel Alliance Intelligence Service",
      "Rebel Alliance Intelligence Service",
      "New Republic",
      "New Republic Intelligence",
      "New Republic Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Caern Adan was a male Balosar who served as an agent in both the intelligence branch of the Alliance to Restore the Republic, and its successor in the New Republic during the Galactic Civil War. Concerned about the remaining Imperial remnants that sprung up after the Battle of Endor, Adan recruited Imperial defector Yrica Quell and several other pilots into a ragtag squadron of pilots codenamed Alphabet Squadron, with their main mission to track down the 204th Imperial Fighter Wing.\nAt some point in his life, Caern Adan served as a financial journalist. He wrote articles about disputes within the InterGalactic Banking Clan and the Corporate Sector solvency when he was arrested by the Galactic Empire. He remained imprisoned for twenty-seven months without knowing why he was arrested and never being formally charged. Adan became a heavy drinker and developed many fears while he remained in prison, and during his imprisonment became radicalized in his opinions about the Empire. When he was freed he joined the Rebel Alliance. During his time in the prison, he met Kairos and former Imperial torture droid IT-O. They escaped, while leaving Ver Iflan, who had reprogrammed the droid, behind.\nAfter Emperor Sheev Palpatine's death at the Battle of Endor, the absence of a clear successor caused a leadership vacuum at the top of the Galactic Empire's hierarchy. Several worlds and systems joined the Rebel Alliance which transitioned into the New Republic. However, even with this extra support, the New Republic military was spread thin and struggling to transition from a military rebellion to a government that protected its citizens. Adan, along with several cadres of the newly-christened New Republic Intelligence, believed that intelligence was the only thing that could hold the New Republic together. As such, Adan began to push for a greater role of New Republic Intelligence in the war's conduct, specifically identifying threats that the Senate did not consider an immediate priority.\nPrimarily among his concerns was the threat posed by the 204th Imperial Fighter Wing, an elite unit of TIE fighter pilots commanded by Colonel Shakara Nuress which went by the name of 'Shadow Wing'. However, the military did not consider Shadow Wing a major priority, busy as it was trying to assert its control over the galaxy's major hyperlanes. To make matters worse for Adan's post-war ambitions for the intelligence service, Chancellor Mon Mothma had made no secret of her plans to demilitarize the New Republic once the war ended.\nAs such, Adan decided to form a group of intelligence officers that would track down and disable the 204th Imperial Fighter Wing. He was accompanied by a reprogrammed Imperial IT-O droid on Traitor's Remorse, where he recruited former 204th pilot, Quell to join him.\nAdan assembled a squadron to help take down the 204th. He hired former Alliance pilot Nath Tensent and recruited Kairos, Quell, former Riot Squadron pilot Wyl Lark, and former Hound Squadron pilot Chass na Chadic. He then convinced General Hera Syndulla to station his new squadron at her Barma Battle Group, specifically aboard her flagship, the Lodestar.\nThe Lodestar battlegroup later conducted the Campaign in the Cerberon system. The Troithe operation went on for weeks, and during the fighting, Quell and Adan convinced General Syndulla to lay a trap for Shadow Wing. After the capital was seized, the trap was prepared. Kairos was wounded during the fighting, and when Adan went to visit her, he was subdued and captured, and was then sold to the Empire in an auction.\nQuell and Tensent were able to rescue him, although he had been tortured. They returned to the Lodestar; however, Colonel Soran Keize unknowingly avoided the trap when he led Shadow Wing on a direct assault on the system, destroying the New Republic assault ship, but getting trapped on Troithe as well. Quell, IT-O, and Adan escaped aboard a freighter. They crashed on a planetoid in the system which was unstable and falling into the black hole. They wandered for days trying to find a way off, but Adan's wounds became infected, leading to his death.\nAdan believed that New Republic Intelligence deserved more resources allocated for them and that they were key to dissolving the remaining Imperial holdouts. He hoped to use Alphabet Squadron to help convince the New Republic Senate that the demilitarization was still a good idea and that Intelligence could prevent future threats instead of fleets going to continue to wage wars. Adan was partial to Corellian red wine. He felt guilty about leaving Iflan and the other prisoners behind, and kept IT-O around as a reminder. But he was able to manage the guilt by trying to do good.\nCaern Adan first appeared in the 2019 novel Alphabet Squadron by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/5_ABY",
  "/wiki/Unidentified_planetoid_(Cerberon_system)",
  "/wiki/Cerberon_system",
  "/wiki/Balosar_(species)",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Intelligence_Service",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Intelligence",
  "/wiki/Agent",
  "/wiki/Galactic_Civil_War",
  "/wiki/Battle_of_Endor",
  "/wiki/Yrica_Quell",
  "/wiki/Alphabet_Squadron",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Corporate_Sector",
  "/wiki/Galactic_Empire",
  "/wiki/Kairos",
  "/wiki/IT-O",
  "/wiki/Ver_Iflan",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Shakara_Nuress",
  "/wiki/Hyperspace_route",
  "/wiki/Chancellor_(New_Republic)",
  "/wiki/Mon_Mothma",
  "/wiki/Droid",
  "/wiki/Pilot",
  "/wiki/Nath_Tensent",
  "/wiki/Riot_Squadron",
  "/wiki/Wyl_Lark",
  "/wiki/Hound_Squadron",
  "/wiki/Chass_na_Chadic",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Barma_Battle_Group",
  "/wiki/Lodestar",
  "/wiki/Campaign_in_the_Cerberon_system",
  "/wiki/Troithe_operation",
  "/wiki/Soran_Keize",
  "/wiki/Unidentified_freighter_(Yrica_Quell)",
  "/wiki/Black_hole",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/Corellian_red",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alexander_Freed",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Endor",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Time"
 ]
}