{
 "name": "Caitken",
 "display_name": "Caitken",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Rebel Alliance Navy",
      "Rebel Alliance Navy"
     ]
    }
   ]
  }
 ],
 "content": "Caitken was a Mon Calamari male who, along with fellow Mon Calamari Shollan, served as an aide to Admiral Raddus in the Alliance to Restore the Republic. In 0 BBY, the trio was present at a meeting on whether or not the Alliance High Command should authorize an attack on the world of Scarif to steal the plans to the Galactic Empire's rumored superweapon, the Death Star. When the mission was carried out by a rogue group of rebels, Caitken, along with Shollan and Raddus, boarded the admiral's flagship, the Profundity, to join the group at Scarif.\nDuring the ensuing battle, Raddus turned to Caitken, directing him to call up a Hammerhead corvette in order to take down the Shield Gate protecting Scarif. Following the gate's destruction, the plans were transmitted to the Profundity just as the Death Star arrived over Scarif. As the admiral ordered the retreat of the Alliance Fleet, the Profundity was disabled and destroyed by a Star Destroyer, with most of the crew perishing.\nHailing from the colder regions of the waterworld Mon Cala, Caitken, along with fellow Mon Calamari Shollan, served as an aide to Admiral Raddus of the Alliance to Restore the Republic. At some point, he and Shollan assembled a report on the status of the Alliance Fleet's starships for Raddus, who then forwarded the report to Mon Mothma, Commander-in-Chief. In 0 BBY, Caitken stood next to Raddus during a meeting in the Alliance headquarters on the moon Yavin 4 where the Alliance High Command discussed data brought to them by the recently enlisted rebel Jyn Erso. According to Erso, the Galactic Empire was building a planet killer called the Death Star, and the only way to stop it would be to steal the plans for the battle station, located on the planet Scarif. However, as full support from the council was not received, an attack was not authorized.\nNonetheless, Erso and many other rogue rebels intended to steal the plans from the Scarif system without authorization. With Shollan and Caitken standing by his side, Raddus was informed of the proceedings and agreed with them, ordering that his flagship, the MC75 Star Cruiser Profundity, be made ready for departure. Soon after, the Alliance fleet entered hyperspace to support Erso and the other rebels at Scarif.\nCaitken and Shollan interacted with their computers aboard the Profundity as the rebel fleet emerged from hyperspace above Scarif. Caitken was sat to Raddus's left while Shollan was sat to Raddus's right as the admiral called out to each starfighter squadron with commands on how to proceed. Later amid the battle, Caitken informed the admiral that swarms of enemy TIE/ln space superiority starfighters were approaching. As the TIEs fired upon the Profundity, the aide announced that the flagship's deflector shields were sustaining heavy damage and had dropped to fifty percent. Raddus responded that they could not turn back and must press their attack.\nThe Profundity then received a call from the rebel Bodhi Rook from Scarif's surface, explaining that the only way to retrieve the Death Star plans would be by destroying the Shield Gate orbiting Scarif. Raddus turned to Caitken and told him to call up a Sphyrna-class Hammerhead corvette. The corvette Lightmaker successfully took out the Shield Gate by sending two Imperial Star Destroyers crashing into the gate, thereby destroying it and allowing the plans to be transmitted to Raddus's Star Cruiser.\nThe Death Star then emerged from hyperspace, and Shollan and Caitken stood up to look at the superweapon as it fired upon the Imperial security complex below, where the rebel forces were stranded. After a moment of silence, Raddus ordered all craft to jump to hyperspace; many ships did so successfully, but the Profundity was disabled by a Star Destroyer and destroyed, with most of the crew perishing.\nCaitken was inspired by the tenacity of Raddus, and along with Shollan, he promised to give him his all. The three were eager to pay the Empire back for what it had done to the Mon Calamari during the invasion of Mon Cala. Caitken was an albino Mon Calamari male with white skin and gray eyes. Due to his hailing from the colder regions of Mon Cala, his blood was said to be especially thick.\nCaitken was efficient in following Raddus's orders. He was highly intelligent and had diplomacy skills, as well as moderate strength, speed, and fighting abilities. He was not Force-sensitive.\nCaitken wore a dark, gray uniform with blue sleeves and a black belt.\nCaitken was created for the anthology film Rogue One: A Star Wars Story, released December 16, 2016, where he was portrayed by puppeteer Aidan Cook. He was first identified in the accompanying reference book to the film, Star Wars: Rogue One: The Ultimate Visual Guide, written by Pablo Hidalgo. An image of Caitken was first showcased in a StarWars.com article titled \"Much to Learn You Still Have: 10 Things You Might Not Know about the Mon Calamari,\" published August 31, 2016.\nCaitken's card in The Topps Company's 2017 Topps Star Wars: Rogue One Series 2 set incorrectly uses an image of Shollan. Additionally, the novelization of Rogue One by Alexander Freed mistakenly attributes Caitken's line of \"Sir! Enemy fighters coming in!\" to Shollan.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Mon_Cala",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/File:Caitken-Fighters.ogg",
  "/wiki/Shollan",
  "/wiki/Aide",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/0_BBY",
  "/wiki/Alliance_High_Command",
  "/wiki/Battle_of_Scarif",
  "/wiki/Planet",
  "/wiki/Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/Galactic_Empire",
  "/wiki/Superweapon",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Rogue_One",
  "/wiki/Flagship",
  "/wiki/Profundity",
  "/wiki/Sphyrna-class_Hammerhead_corvette",
  "/wiki/Shield_Gate",
  "/wiki/Death_Star",
  "/wiki/Devastator",
  "/wiki/Death",
  "/wiki/File:Raddus-Fight.ogg",
  "/wiki/Homeworld",
  "/wiki/Temperature",
  "/wiki/Waterworld",
  "/wiki/Starship",
  "/wiki/Mon_Mothma",
  "/wiki/Commander-in-Chief",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/Jyn_Erso",
  "/wiki/Battle_station",
  "/wiki/Scarif_system",
  "/wiki/MC75_Star_Cruiser",
  "/wiki/Fleet",
  "/wiki/Hyperspace",
  "/wiki/File:Caitken-Raddus-Deflectors.ogg",
  "/wiki/Computer",
  "/wiki/Starfighter",
  "/wiki/Squadron",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/TIE_line",
  "/wiki/Deflector_shield",
  "/wiki/Bodhi_Rook",
  "/wiki/Orbit",
  "/wiki/Corvette",
  "/wiki/Lightmaker",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Star_Cruiser",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/Invasion_of_Mon_Cala",
  "/wiki/Albinism",
  "/wiki/Eye",
  "/wiki/Blood",
  "/wiki/Force-sensitive",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/December_16",
  "/wiki/2016",
  "/wiki/Aidan_Cook",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/StarWars.com",
  "/wiki/August_31",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2017_Topps_Star_Wars:_Rogue_One_Series_2",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Alexander_Freed",
  "/wiki/Category:Audio_files_of_Caitken",
  "/wiki/Category:Images_of_Caitken",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_5",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Star_Wars",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars_Insider",
  "/wiki/Building_the_Death_Star",
  "/wiki/Star_Wars_Insider_170",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Profundity_Expansion_Pack",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Unsung_Heroes",
  "/wiki/Star_Wars_Insider_179",
  "/wiki/2018_Topps_Star_Wars_Galactic_Files",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Insider_Special_Edition_2020",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_90",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_36",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Last_Jedi:_Incredible_Cross-Sections"
 ]
}