{
 "name": "Caiza Quill",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ord Cestus"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 22 BBY",
      "Ord Cestus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "X'Ting"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cestus Cybernetics",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Caiza Quill was a male X'ting leader who was one of the Cestus Cybernetics Families, a member of the Hive Council and the cousin of the Regent of Ord Cestus, G'Mai Duris. He was descended from a 500-year-old assassin family and was married to Sabit.\nQuill was jealous of his cousin G'Mai Duris, and challenged her once. After that incident, she feared him, as he was power-hungry and lacked a conscience. Along with the Five Families, Quill allied with the Confederacy of Independent Systems to undertake the manufacture of JK-13 security droid. Later, he met the Jedi Knight Obi-Wan Kenobi and the Vippit barrister Doolb Snoil, in an attempt to negotiate the droid's production, for the Republic feared the dangerous creation would be reproduced and used by the Confederacy as battle droids. Meanwhile, Caiza's cousin G'Mai finally chose to fight against him, and managed to get him expelled from the Council; Duris convinced the Council to disobey the Cestus Cybernetics rules. Quill was furious and promised to veto all actions Duris could make.\nAlong with Lord Por'Ten and Debbikin the Young, Quill caught the magcar to go to the central palace to negotiate with a Republic ambassador. To everyone's surprise, the magcar stopped and was boarded by members of the Desert Wind and Jedi Master Kit Fisto, who pretended to be a Dark Jedi, saying he wanted to negotiate the oaths the Five Families took with the Confederacy. Obi-Wan Kenobi then appeared to fight against the false Dark Jedi and rescue Quill and the others. Believing Kenobi had saved them, the Five Families then decided to side with the Jedi.\nSuspecting something was not as it seemed, Quill investigated. He discovered a hologram which exposed the sham, causing Duris to distrust the Jedi. With this, the Five Families took up power again. Later, the Cestus Cybernetics members met with the Dark Jedi Asajj Ventress and the crimelord Trillot, who was a relative of Quill. They planned on having Ventress kill Duris and Kenobi. Quill revealed to Trillot that he would be the successor of Duris when she died.\nThen, Quill and the Five Families met with the Regent to convince her the Confederacy was the more reasonable ally, but Duris did not share their opinion. When the JK-13 droids were operative, they were activated to stop the Desert Wind. Palpatine decided to send the Republic Cruiser Nexu to enforce the order to stop producing the droids. When the ship arrived, the Five Families and Caiza Quill, took refuge in a secret bunker. ARC trooper Jangotat went on a search for the leaders and discovered the bunker. He sent a signal to the Nexu, calling for an orbital bombardment on his coordinates. In that attack, Caiza and many members of the Five Families perished. The Families' remaining representatives thereafter yielded, choosing to side with the Galactic Republic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ord_Cestus/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/X%27Ting",
  "/wiki/Gender/Legends",
  "/wiki/Cestus_Cybernetics",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/X%27ting",
  "/wiki/Hive_Council",
  "/wiki/G%27Mai_Duris",
  "/wiki/Assassin/Legends",
  "/wiki/Sabit",
  "/wiki/JK-13_security_droid",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Vippit",
  "/wiki/Doolb_Snoil",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Lord_Por%27Ten",
  "/wiki/Debbikin_the_Young",
  "/wiki/Desert_Wind",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Trillot",
  "/wiki/Palpatine/Legends",
  "/wiki/Republic_Cruiser",
  "/wiki/Nexu_(starship)",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Alpha-98",
  "/wiki/The_Cestus_Deception",
  "/wiki/The_Hive",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}