{
 "name": "Cal Handro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Naboo system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Amber"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trandoshan slavers",
      "Galactic Empire",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Cal Handro was a Human male smuggler who lived during the Galactic Civil War.\nCal Handro was a smuggler without scruples who sided with both sides during the Galactic Civil War, trying to get money where ever he could. By the time of the Battle of Yavin, he shipped slaves for Trandoshan slavers allied with the Galactic Empire. However, Handro later switched sides when he discovered, thanks to the Bothan information broker Wire, that he was wanted dead by the Blackscale Clan, a rival Trandoshan clan. The slavemaster Trussk considered that Handro was interfering in their business. The smuggler therefore went to work for the Rebel Alliance.\nIn 1 ABY, Cal Handro was transporting a new kind of spice for the Rebels in the Naboo system when his transport was shot down and cashed on Naboo's moon of Rori. Handro survived to the crash but was attacked by Black Sun henchmen, forcing him to flee. The Black Sun had learnt the content of Handro's cargo and wanted to steal the spice. The smuggler successfully escaped the Black Sun and after a long walk in the wilderness and eventually arrived at the Martano estate. Tierce Martano, an old sabacc friend living on Rori, accepted to hide the pilot in a safe house nearby.\nThe Rebel Alliance was indeed concerned by the disappearance of Cal Handro. When the pilot was reported missing, Officer Veega Madish soon assembled a team of Rebel operatives and sent them to Rori to search Handro's last known coordinates. Moreover, the crash of Handro's starship had been spoted by the Empire. Imperial Officer Jevan Monsul gathered a task force and ordered the Imperial agents to investigate the situation. Finally, one close friend of Handro by the name Tyla Jinn also realized that something went wrong after she lost contact with the pilot. She decided to recruit spacers and paid them to find Handro.\nSome of those spacers managed to find the crash site of Cal Handro's ship, in the Madyn Plains of Rori. While some Black Sun thugs were still present in the area, the spacers did not find any trace of the pilot and only collected Handro's datapad and a sample of spice. They later learnt that a woman known as Kaila Min spoted Cal Handro as he was escaping in the wilderness of Rori. The spacers rushed to the pilot's last known location, only to be attacked by Black Sun minions. From their attackers, they obtained the location of the Black Sun base on Rori but did not find Handro there. The spacers later traveled to Talus and Naboo to investigate Cal Handro's relationships with Trandoshan slavers, but it was also a dead end.\nIn the meantime, the Black Sun finally discovered that Cal Handro took shelter at the Martano estate. While the criminals began besieging the building, Tierce Martano contacted both the Empire and the Rebel Alliance to negotiate information about the pilot. But before he could get an answer, he was rescued by the spacers who eliminated all Black Sun forces. As Martano wished to get rid of Handro, he eagerly accepted to give the location of Handro to the spacers.\nTierce Martano had established contact with Officer M'Kae for the Empire and Wolff Kalos for the Rebel Alliance. Finally, the spacers decided to side with the Rebellion and contacted Kalos. The latter immediately sent agents to pick Cal Handro and transferred him to a Rebel Safe House. At this point, the man was considered as a traitor by the Rebellion for having smuggled slaves for the Empire. However, the Empire soon got the information and immediately dispatched a group of mercenary to attack the building. Although the spacers arrived rapidly to help the Rebel forces, the pilot used the diversion to escape with a group of Imperial agents. Handro accepted the help of the Empire and eventually left Rori aboard a Warlord Heavy Cruiser.\nWhile Cal Handro was about to leave the Naboo system, the Rebel spacers interrogated Officer M'Kae, Tierce Martano's Imperial contact, because they suspected him to be involved in Handro's escape. The Imperial officer eventually revealed that the wanted man was about to leave the system to Kashyyyk. The spacers rushed to the nearest spaceport and launched in space to intercept Cal Handro's ship. Piloting their own starfighters, the spacers attacked the Imperial cruiser and its escort. The warship was heavily armored and well armed but the Rebel forces eventually destroyed it, as well as its escort. Cal Handro died in the explosion of the ship.\nDuring those events, Sergeant Vekker of the Imperial Intelligence contacted the family of Cal Handro to inform them about the disappearance of the pilot.\nCal Handro appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts. The game was shut down on December 15, 2011.\nCal Handro was the main antagonist of the story arc \"Secrets of the Syren\". He was mentioned upon the release of the first chapter of the questline, with the \"Publish 14\" on March 9, 2005, but he only appeared in the game with the fourth chapter, released with the \"Publish 21\", on August 4, 2005. For the first three chapters, the story was quite similar either the player was aligned with the Empire, the Rebel Alliance or neutral. However, in the fourth chapter, the player had to choose to side with the Empire or the Rebels. The story diverged at this point since Cal Handro would always join the faction opposed to the player.\nThe fifth and final chapter of \"Secrets of the Syren\" was in development in October 2005 and was planned to be introduced in April 2006 with the \"Publish 28\". The player had to investigate whether Cal Handro had survived the destruction of his ship in the space battle. However, the final chapter of \"Secrets of the Syren\" was never released. The \"Secrets of the Syren\" story arc was finally removed from the game with the release of the \"Chapter 1\", published on June 8, 2006, due to the major changes planed for Rori with the introduction of the Battle of Restuss.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Naboo/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Naboo_system/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Wire",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Tyla_Jinn",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Blackscale_Clan/Legends",
  "/wiki/Trussk",
  "/wiki/Syren_spice",
  "/wiki/Transport/Legends",
  "/wiki/Rori/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Martano_estate",
  "/wiki/Tierce_Martano",
  "/wiki/Sabacc/Legends",
  "/wiki/Veega_Madish",
  "/wiki/Starship/Legends",
  "/wiki/Jevan_Monsul",
  "/wiki/Madyn_Plains",
  "/wiki/Datapad/Legends",
  "/wiki/Kaila_Min",
  "/wiki/Black_Sun_bunker",
  "/wiki/Talus/Legends",
  "/wiki/Canon",
  "/wiki/M%27Kae/Legends",
  "/wiki/Wolff_Kalos",
  "/wiki/Rebel_Safe_House",
  "/wiki/Warlord_Heavy_Cruiser",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Cal_Handro%27s_Warlord_Heavy_Cruiser",
  "/wiki/Starfighter/Legends",
  "/wiki/Light_cruiser/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Vekker_(sergeant)",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/March_9",
  "/wiki/2005",
  "/wiki/August_4",
  "/wiki/October",
  "/wiki/April",
  "/wiki/2006",
  "/wiki/June_8",
  "/wiki/Battle_of_Restuss",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience",
  "/wiki/Comm_unit/Legends",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/Template:SWGTCG",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance",
  "/wiki/March_31",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit"
 ]
}