{
 "name": "Cal_Alder",
 "display_name": "Cal Alder",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kal'Shebbol"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Bluish"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance High Command",
      "Alliance High Command"
     ]
    }
   ]
  }
 ],
 "content": "Cal Alder was a human male who served as a lieutenant in the High Command of the Alliance to Restore the Republic during the Galactic Civil War. After the evacuation of Yavin 4, he participated in talks to find a location for a new rebel headquarters, and was then stationed in Echo Base on the planet Hoth, where he undertook patrols to ensure the base's security.\nAfter rebels Luke Skywalker and Han Solo went missing, Alder reported to Major Bren Derlin that there was still no word from them after the final patrols had returned. Derlin spoke to Princess Leia Organa, then had Alder shut the shield doors to Echo Base for the night. Alder later coordinated the defense of Echo Base's perimeter during the Battle of Hoth, which he survived.\nCal Alder was a human male from the Outer Rim planet Kal'Shebbol, who served in the High Command of the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. His role was to find ways to adapt the native ecology of new worlds to the needs of the Alliance, due to its severely limited resources. As a ground mission specialist, he participated in talks to determine what world should be selected to house the Alliance's new headquarters after evacuating its previous base on the moon Yavin 4. These discussions eventually led to the establishment of Echo Base on the icy planet Hoth, where Alder was stationed as a Deck Lieutenant. Alder had a brilliant service record, which convinced his commanding officer, Major Bren Derlin, to give him the responsibility of undertaking various patrols around the base to ensure its security.\nIn 3 ABY, the Jedi Luke Skywalker went missing while out setting up sensors near the base. The smuggler Han Solo set out to find his friend; however, he also failed to return by nightfall. After the last rebel patrol returned to base for the day, Alder approached Derlin in one of Echo Base's hangars and reported as such. He then began to state that there was still no word from Skywalker or Solo, but the major raised a hand to caution him, gesturing to the nearby Princess Leia Organa, who was a close friend of the missing duo and also listening to Alder's report.\nGulping, then choosing his words carefully, Alder finished his report in hushed tones. He and Derlin then approached Organa and the major strongly recommended that the base's shield doors be closed, as there was nothing more that could be done to find her friends during the night. Organa agreed and Derlin ordered Alder to have the doors shut, which he did. Solo and Skywalker were discovered alive the following morning.\nAfter an Imperial Viper probe droid was discovered and destroyed near Echo Base, the Alliance began to prepare for evacuation. Before they managed to escape, an Imperial fleet arrived above Hoth and deployed ground forces to attack the base. Alder participated in the ensuing Battle of Hoth, coordinating the defense of the base's perimeter, and ultimately survived the battle, which ended with the Alliance successfully escaping despite suffering a massive defeat.\nAlder had fair skin and bluish eyes. He was an expert scout and often found himself among the first to become acquainted with the alien environs of frontier worlds. He took on the responsibility of closing the gates to Echo Base as he reasoned that the intense cold of the night, plus the possibility of wampa attacks, posed a security risk to the entire base that he was not willing to take, even for officers as highly ranked as Solo and Skywalker.\nWhile in Echo Base, Alder wore rebel snow gear including a brown sleeveless jacket over a white uniform as well as white command gauntlets and a white insulated watch cap with a com set, a brown face wrap, white cap warmers and anti-glare goggles. When reporting to Derlin, he was carrying a datapad.\nCal Alder was portrayed by Jack McKenzie in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. Alder's scene was shot on the Star Wars Stage at Elstree Studios between May 22 and May 29, 1979. Immediately prior to filming, director Irvin Kershner gave McKenzie his line and asked him to do an American accent rather than his natural English one, as \"all the English guys are the bad guys and all the Americans are the good guys.\"\nMcKenzie repeated the line several times for Kershner, who had the actor soften the emphasis on the second sentence to a conspiratorial tone in order to convey that Leia Organa was being spared the pain of hearing her friends were still missing. It took several takes to get the scene, and during one, McKenzie thought he had heard cut after making his exit and walked back into shot whistling. Kershner joked that the embarrassed McKenzie would never work again, but forgave him.\nIn the film, the character was credited only as \"Deck Lieutenant,\" and in the new Star Wars canon, the character was first identified in the mobile card game Star Wars: Force Collection, which initially launched in 2013. Although the launch of Force Collection predates the Star Wars canon reset of 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon. The 2018 reference book Star Wars: Geektionary: The Galaxy from A - Z incorrectly states that Alder ordered Derlin to close the shield doors, rather than the other way round.\nIn the Star Wars Legends continuity, Alder appeared just prior to the release of The Empire Strikes Back in the novelization of the film written by Donald F. Glut. The name Cal Alder originates on a card released in the 1996 Hoth Limited expansion set of the Star Wars Customizable Card Game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Cal_Alder",
  "/wiki/Cal_Alder/Legends",
  "/wiki/Cal_(disambiguation)",
  "/wiki/Kal%27Shebbol",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Alliance_High_Command",
  "/wiki/File:Alder-Contact.ogg",
  "/wiki/Lieutenant",
  "/wiki/Galactic_Civil_War",
  "/wiki/Evacuation_of_Yavin_4",
  "/wiki/Echo_Base",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/Luke_Skywalker",
  "/wiki/Han_Solo",
  "/wiki/Major",
  "/wiki/Bren_Derlin",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Standard_day",
  "/wiki/Battle_of_Hoth",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Galactic_Empire",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/Water",
  "/wiki/Commanding_officer",
  "/wiki/3_ABY",
  "/wiki/Jedi",
  "/wiki/Sensor",
  "/wiki/Smuggler",
  "/wiki/Hangar",
  "/wiki/Limb",
  "/wiki/File:Derlin_and_Alder.ogg",
  "/wiki/XJ9-CS14",
  "/wiki/Death_Squadron",
  "/wiki/Blizzard_Force",
  "/wiki/Eye",
  "/wiki/Scout",
  "/wiki/Alien",
  "/wiki/Temperature",
  "/wiki/Wampa",
  "/wiki/Alliance_officer",
  "/wiki/Military_rank",
  "/wiki/Clothing",
  "/wiki/Jacket",
  "/wiki/Alliance_military_uniform",
  "/wiki/Command_gauntlet",
  "/wiki/Insulated_watch_cap",
  "/wiki/Comlink",
  "/wiki/Hat",
  "/wiki/Anti-glare_goggles",
  "/wiki/Datapad",
  "/wiki/Jack_McKenzie",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Elstree_Studios",
  "/wiki/May_22",
  "/wiki/May_29",
  "/wiki/1979",
  "/wiki/Irvin_Kershner",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/2013",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/2018",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/Donald_F._Glut",
  "/wiki/1996",
  "/wiki/Hoth_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Category:Audio_files_of_Cal_Alder",
  "/wiki/Category:Images_of_Cal_Alder",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Rebel_Alliance",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/January_17",
  "/wiki/2020",
  "/wiki/The_Making_of_The_Empire_Strikes_Back",
  "/wiki/StarWars.com",
  "/wiki/File:Leland_Chee_Force_Collection.png",
  "/wiki/In-universe"
 ]
}