{
 "name": "Cala",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "14 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Koorivar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Loyalists",
      "Loyalists",
      "Berch Teller's rebel cell"
     ]
    }
   ]
  }
 ],
 "content": "Cala was a male Koorivar and an operations specialist. Five years after the formation of the Galactic Empire, Cala was part of a rebel cell led by Berch Teller. He participated in the theft of the Carrion Spike, personal starship of Imperial Governor Wilhuff Tarkin. Cala subsequently participated in a Berch Teller's insurgent campaign against the Empire. The insurgents were defeated by Tarkin at the Battle near the Gulf of Tatooine.\nCala was a Koorivar loyalist who worked as a munitions and surveillance expert during the Separatist occupation of the Gotal moon of Antar 4 during the Clone Wars. He was trained by the Republic Intelligence operative Berch Teller and joined the loyalist resistance against the Separatist occupiers. Following the transformation of the Galactic Republic into the Galactic Empire, Imperial forces under Moff Wilhuff Tarkin initiated a violent purge known as the Antar Atrocity in 18 BBY, which led to the arrests and indiscriminate killings of many Koorivar and Gotals on Antar 4 including Republic loyalists.\nCala along with the Gotal starship pilot Salikk were among the loyalists that Teller managed to rescue from the Antar Atrocity. Cala subsequently joined Berch Teller's rebel cell, which included several Gotals, Koorivar, and individuals of other species who had survived or witnessed the Antar Atrocity. Other key members of Teller's rebel cell included the former Republic journalist Anora Fair, the Zygerrian film-maker Hask Taff, the Mon Calamari starship engineer Dr. Artoz, and the information broker Knotts. The dissidents opposed the Galactic Empire and harbored a special animus for Moff Tarkin, the architect of the Antar Atrocity.\nIn the years leading up to 14 BBY, Teller's insurgents accumulated a substantial arsenal of Clone Wars–era droid starfighters, warships, and communications equipment and jammers. They were helped by the Imperial Vice Admiral and Naval Intelligence Agency Director Dodd Rancit, who used his intelligence and underworld connections to provide the insurgents with equipment and weapons. Rancit was a rival of Tarkin who wanted to improve his standing in the Imperial Ruling Council. Cala and the other insurgents were unaware of the true identity of Teller's informant.\nFollowing a failed attack on Sentinel Base, Teller and his followers embarked on a plot to steal Moff Tarkin's stealth corvette Carrion Spike. The rebels wanted to use the Carrion Spike to attack Imperial targets across the galaxy and broadcast holovids of their attacks in order to inspire rebellion. With the help of Vice Admiral Rancit, the insurgents managed to lure Tarkin and Darth Vader to the wartorn world of Murkhana to investigate a communications cache. While the Imperials were investigating the cache, Cala along with Teller, Salikk, Anora, Hask, and Artoz stormed and stole the corvette, escaping offworld.\nAfter the heist, Cala joined Teller, Salikk, and Artoz in the Carrion Spike's cockpit while Artoz listed the ship's communications equipment. Cala commented that the ship had state of the art technology that would easily exceed a Star Destroyer. When Teller talked about how Tarkin had designed ships with swivel cannons, Cala responded that they should come in handy. When Hask asked why the Emperor would sent Lord Vader to escort Tarkin, Cala explained that Vader had visited Murkhana after the end of the Clone Wars and executed a Black Sun racketeer. He added that the Emperor would not be happy about losing his two top henchmen.\nCala, who was manning the ship's sensors, then warned that a ship was approaching. It turned out that Tarkin and Lord Vader had commandeered the Sugi crime lord Faazah's ship Parsec Predator and were in hot pursuit. Salikk reported that the second ship was matching their movements, prompting Salikk to take evasive action. Cala then warned his fellow rebels that the pursuing ship was not scanning them. The rebels quickly realized that their Imperial pursuers were still tracking them despite the Carrion Spike being in stealth mode. After discussing whether the Imperials had a sort of tracking device, Cala remarked that they should have launched sooner. Following a pursuit, the rebels managed to escape the Murkhana system by jumping into hyperspace.\nThe Carrion Spike resurfaced in the Fial system. While monitoring the sensor suite, Cala sighted the Parsec Predator. The insurgents quickly realized that the Imperials had a tracking device aboard their ship. After assigning Cala and the other insurgents to man their posts, Teller ordered Salikk to do a jump to Galidraan.\nUnder the cover of the Carrion Spike's stealth mechanism, the insurgents raided Galidraan Station, causing extensive damage. The rebels also managed to down several Imperial V-wing and ARC-170 starfighters. Tarkin and Vader soon followed aboard the Parsec Predator and engaged in a dogfight with the Carrion Spike. However, the rebels used the Carrion Spike's pintle cannons to disable their Imperial pursuers' ship.\nDespite their successful raid, the Carrion Spike sustained significant damage. Under Teller's orders, Cala checked the aft maintenance bay. He found the hyperdrive generator to be working but noticed it was making strange noises. Cala was unsure when the Carrion Spike could jump again. When Teller asked, Cala estimated that it would take between ten and fifteen minutes. He remarked that the Imperials knew where to hit them. Teller responded that Tarkin knew his stolen ship's weak points.\nAfter the hyperdrive generator completed its self-test, Cala relayed the news to Teller. Before leaving the Galidraan system, the rebels jettisoned Darth Vader's meditation chamber, which the Sith Lord had been using to track them down. They also destroyed Galidraan's hyperspace buoy, preventing the Imperials from following them. Following their raid on Galidraan, the insurgents attacked the TaggeCo mining facilities on Lucazec and broadcast their attacks on HoloNet. This drew the attention of the Emperor and his Imperial Ruling Council.\nHaving been warned by Vice-Admiral Rancit that the Empire had dispatched a task force to Gromas, the insurgents decided to travel to Phindar in the Mandalore sector to refuel the Carrion Spike. For the trip, Teller disguised himself as the Imperial Commander Abel LaSal. When Cala remarked that the uniform did not fit him, Teller responded that poverty would change a being. When Teller asked Cala about his duties with the hyperdriver, he confirmed it was done but added that he had to spend extra time in decontamination.\nWhen Teller remarked that Cala looked ruddier than usual, Cala quipped that the stint could cost him two years of his life. Teller reassured hi that it would be a higher cost for the Imperials. Despite Teller's disguise, the Phindian administrator of the orbital tanker was suspicious about his new \"Imperial\" customer and alerted Moff Tarkin. Tarkin instructed the Phindians to refuel the Carrion Spike as usual to avoid arousing the insurgents' suspicion.\nWhen they had almost finished refueling the Carrion Spike, Cala reported an Imperial escort carrier exiting hyperspace. Cala identified the ship as the escort carrier Goliath, which carried a wing of starfighters and was armed with ten Taim \u0026 Bak H-eights and a Krupx missile delivery system. Tarkin and Vader were commanding the Goliath. After the Imperial ship deployed starfighters, Teller asked Cala how much time it would take for them to jump into hyperspace. Cala responded that it would take 15 minutes.\nDuring the dogfight, the Carrion Spike flew rings around the Phindian tanker to prevent the Imperials from targeting them. The insurgents also engaged Darth Vader's Yellow Squadron and the tanker's ARC-170 starfighters. This bought the insurgents enough time to jump into hyperspace. Before leaving, Cala also remotely detonated a concealed explosive inside a used fuel cell aboard the Phindian tanker in an attempt to take out Tarkin and Lord Vader. However, there was a delay in the explosion. While the explosion destroyed the tanker and several fighters, Tarkin and Lord Vader's starfighters as well as the Goliath survived the skirmish.\nAfter escaping Phindar, Cala and his fellow insurgents nursed their wounds in the Expansion Region system designated as LCC-4-4-7, which lay between the planets Aquaris and Thustra. Cala remarked that the explosion would have taken out Darth Vader's black Eta-2 Actis-class interceptor and all the V-wings had the charge not been late in detonating. Salikk responded that they were lucky to escape. Cala and his comrades listened as Teller recounted Tarkin's ruthless career in the Outland Regions Security Force. Teller believed that the Emperor and his disciples Vader and Tarkin were winnowing the galaxy into submission. Teller also explained that they had stolen Tarkin's starship Carrion Spike in order to turn an Imperial symbol into an icon of resistance.\nWhile repairing the damaged Carrion Spike, Salikk detected a discrepancy in the ship's fuel cells. At Teller's prompting, Cala donned a hazmat suit and entered the fuel bay to run tests on the Wiborg Jenssen fuel cells they had obtained from the tanker above Phindar. Cala quickly suspected that the Phindian administrator had cheated them. While checking the fuel cells, he found that the cell reading was empty. After removing the fuel cell, he discovered that it carried a concealed paralight tracker, a type of Imperial homing beacon.\nWhen Cala asked if they should disable the paralight tracker, Teller instead decided to mislead Tarkin by transmitting coordinates claiming that the rebels were planning to travel on the Carrion Spike to Obroa-skai. Teller also made arrangements with the information broker Knotts to send the crew of the Reticent as decoys to Obroa-skai. As a reward for discovering the paralight tracker, Teller gave Cala the privilege of destroying the Imperial tracking device.\nAs planned, the Imperials were tricked into believing that the Carrion Spike was heading to the Obroa-skai system. Tarkin assembled a sizable force including three interdictor vessels to intercept the stolen corvette. However, the Immobilizer 418 cruiser's gravity well projector malfunctioned, causing a massive hyperspace accident which killed 1,100 people. Despite the chaos, Vader and Tarkin managed to capture and interrogate the crew of the Reticent, who revealed that they had been hired by Knotts to travel to Obroa-skai to deliver Sephi flyers. Tarkin subsequently consulted Republic and Imperial records on the HoloNet and discovered information on Teller's rebel cell including Cala's escape from Antar.\nUnder Dodd Rancit's guidance, Teller's insurgents attacked the Imperial facility in the Nouane system. However, Rancit had redeployed Imperial forces to fortify the Nouane Imperial facility. The insurgents managed to escape but the Carrion Spike sustained considerable damage to its weapons systems, shields, and hyperdrive motivator. Following their escape, Cala reported that the ship's armament was down to two forward laser cannons and one starboard battery before listing the damage to the ship's shields, hyperdrive motivator, stealth systems, and sublight drivers.\nFollowing a discussion, the insurgents deduced that Teller's source Vice-Admiral Rancit had betrayed them. They decided to abandon the Carrion Spike but not before setting the abandoned ship on an autopilot journey to Carida. Rancit had given Teller the green light to attack the Imperial Academy on Carida. However, Teller rightfully suspected that Rancit was setting a trap for them. In an attempt to cover his collusion with Teller's rebels, Rancit attempted to destroy the Carrion Spike. However, Lord Vader, who had discovered his treachery with the help of Tarkin, stopped Rancit and had him executed.\nAfter evacuating the Carrion Spike, Cala and his fellow insurgents rejoined Knotts and the other rebels aboard Berch Teller's warship, a modified Providence-class carrier-destroyer in an uncharted system near the Gulf of Tatooine. Having diverted much of the Imperial Navy to hunt for the Carrion Spike, Teller planned to raid an Imperial convoy ferrying supplies to the mysterious Death Star project. For that attack, the insurgents had mustered a Providence-class carrier-destroyer, an EF76 Nebulon-B escort frigate, numerous droid fighters, and several starfighters.\nWhile Teller, Knotts, and Artoz were discussing their struggle against the Empire in the carrier-destroyer's hangar bay, Cala entered and informed them that the supply convoy had exited hyperspace. He added that the HoloNet and communications jammers had been enabled and that all weapon systems were ready. Before boarding his Z-95 Headhunter, Teller told Cala to tell Anora and Hask that he expected \"nothing less than a galactic-class holovid.\"\nThe insurgents' attack initially went well. Teller's droid and organic starfighters proceeded to wreck havoc among the convoy's escorts and transport ships. Though the escorts formed a protective perimeter around the transports, they were unable to call for help since their communications had been jammed. However, Moff Tarkin arrived aboard the Imperial Star Destroyer Executrix and dispatched starfighters to protect the convoy. After destroying the Nebulon-B frigate, Tarkin launched a head-on attack on Teller's warship.\nThough the insurgents managed to transmit hyperspace coordinates that allowed their leader Teller to escape, their flagship was disabled. and boarded by Imperial forces. 13 crew members were killed during the battle but about 26 insurgents including Anora, Hask, Knotts, and Dr. Artoz were taken prisoner. It is unknown whether Cala was killed during the battle or taken prisoner. Vader, Tarkin, and the Imperial Security Bureau interrogated Teller's followers and collaborators before executing them.\nCala was a male Koorivar with a spiraling cranial horn, thick thighs, and stubby fingers. He was an operations specialist who was able to operate the controls of starships as complex as the Carrion Spike. While Cala was happy to work with droids, his fellow rebel comrade Salikk disliked droids.\nDuring the Clone Wars, Cala was a Republic loyalist who joined Berch Teller's loyalist resistance and looked up to Teller as a leader. During the Imperial era, he remained loyal to Teller and joined his rebel cell. Cala put his expertise with munitions and surveillance to good use during Teller's brief campaign against Tarkin and the Galactic Empire. He discovered an Imperial paralight tracker and destroyed it.\nCala wore a pouch-pocketed pair of cargo trousers and a large tunic that reached his thighs.\nCala first appeared in James Luceno's 2014 canon novel Tarkin, an origins story of the eponymous character.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Cala_(disambiguation)",
  "/wiki/14_BBY",
  "/wiki/Koorivar",
  "/wiki/Gender",
  "/wiki/Galactic_Republic",
  "/wiki/Loyalist",
  "/wiki/Berch_Teller%27s_rebel_cell",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Berch_Teller",
  "/wiki/Mission_to_Murkhana",
  "/wiki/Carrion_Spike",
  "/wiki/Starship",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Berch_Teller_campaign",
  "/wiki/Battle_near_the_Gulf_of_Tatooine",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Gotal",
  "/wiki/Moon",
  "/wiki/Antar_4",
  "/wiki/Clone_Wars",
  "/wiki/Republic_Intelligence",
  "/wiki/Moff",
  "/wiki/Antar_Atrocity",
  "/wiki/18_BBY",
  "/wiki/Salikk",
  "/wiki/Journalist",
  "/wiki/Anora_Fair",
  "/wiki/Zygerrian",
  "/wiki/Hask_Taff",
  "/wiki/Mon_Calamari",
  "/wiki/Artoz",
  "/wiki/Knotts",
  "/wiki/Droid",
  "/wiki/Starfighter",
  "/wiki/Vice_Admiral",
  "/wiki/Naval_Intelligence_Agency",
  "/wiki/Director",
  "/wiki/Dodd_Rancit",
  "/wiki/Imperial_Ruling_Council",
  "/wiki/Attack_on_Sentinel_Base",
  "/wiki/Sentinel_Base",
  "/wiki/The_galaxy",
  "/wiki/Holovid",
  "/wiki/Anakin_Skywalker",
  "/wiki/Murkhana",
  "/wiki/Darth_Sidious",
  "/wiki/Unidentified_Black_Sun_racketeer",
  "/wiki/Sugi",
  "/wiki/Crime_lord",
  "/wiki/Faazah",
  "/wiki/Parsec_Predator",
  "/wiki/Murkhana_system",
  "/wiki/Hyperspace",
  "/wiki/Fial_system",
  "/wiki/Galidraan",
  "/wiki/Attack_on_Galidraan_Station",
  "/wiki/Galidraan_Station",
  "/wiki/Alpha-3_Nimbus-class_V-wing_starfighter",
  "/wiki/Aggressive_ReConnaissance-170_starfighter",
  "/wiki/Hyperdrive",
  "/wiki/Standard_minute",
  "/wiki/Galidraan_system",
  "/wiki/Darth_Vader%27s_meditation_chamber",
  "/wiki/Sith_Lord",
  "/wiki/Attack_on_Lucazec",
  "/wiki/Tagge_Corporation",
  "/wiki/Lucazec",
  "/wiki/HoloNet",
  "/wiki/Gromas",
  "/wiki/Phindar",
  "/wiki/Mandalore_sector",
  "/wiki/Commander",
  "/wiki/Abel_LaSal",
  "/wiki/Phindian",
  "/wiki/Phindar_tanker_facility",
  "/wiki/Imperial_escort_carrier",
  "/wiki/Goliath",
  "/wiki/Taim_%26_Bak",
  "/wiki/Krupx_Munitions/Legends",
  "/wiki/Battle_in_the_Phindar_system",
  "/wiki/Yellow_Squadron_(Galactic_Empire)",
  "/wiki/Expansion_Region",
  "/wiki/LCC-4-4-7",
  "/wiki/Aquaris",
  "/wiki/Thustra",
  "/wiki/Darth_Vader%27s_black_Eta-2_Actis-class_interceptor",
  "/wiki/Outland_Regions_Security_Force",
  "/wiki/Wiborg_Jenssen",
  "/wiki/Fuel_cell",
  "/wiki/Paralight_tracker",
  "/wiki/Homing_beacon",
  "/wiki/Obroa-skai",
  "/wiki/Reticent",
  "/wiki/Obroa-skai_system",
  "/wiki/Interdictor_vessel",
  "/wiki/Immobilizer_418_cruiser",
  "/wiki/Gravity_well_projector",
  "/wiki/Incident_in_the_Obroa-skai_system",
  "/wiki/Sephi_flyer",
  "/wiki/Attack_on_the_Nouane_system",
  "/wiki/Nouane_system",
  "/wiki/Laser_cannon",
  "/wiki/Carida",
  "/wiki/Carida_Academy",
  "/wiki/Treason",
  "/wiki/Berch_Teller%27s_warship",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Gulf_of_Tatooine",
  "/wiki/Death_Star",
  "/wiki/EF76_Nebulon-B_escort_frigate",
  "/wiki/Z-95_Headhunter",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Executrix",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/James_Luceno",
  "/wiki/2014",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}