{
 "name": "Calders",
 "display_name": "Calders",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "A hint of gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Calders was a security guard who served in the Galactic Empire's detention camps on the planet Odik II, quickly moving up the ranks and becoming the entire prison facility's warden. He was reassigned to the prison planet Despayre, overseeing the prisoner labor pool where the Empire's DS-1 Orbital Battle Station superweapon was being constructed, before being assigned to the DS-1 Orbital Battle Station itself. By then a major, Calders controlled a wing of detention blocks on the superweapon prior to the Battle of Yavin.\nThe Human male Calders served the Galactic Empire, beginning his service as a security guard stationed at Odik II, a planet which contained Imperial political prisoner detention camps. The camps were part of a highly-secret facility, with many dissidents from the Galactic Republic who refused to accept the Imperial New Order. Calders's service was so exemplary that he quickly moved up the ranks and became the entire prison facility's warden.\nDue to his work at the detention wards, Calders was considered a natural for assignment to Despayre, the prison planet where the Empire's DS-1 Orbital Battle Station superweapon was being constructed. He oversaw the prisoner labor pool and forged them into a tireless machine. Calders's work exceeded his own expectations, and he was praised by the DS-1 Orbital Battle Station's Grand Moff Wilhuff Tarkin and General Cassio Tagge.\nPrior to the Battle of Yavin, Calders, by then a major, was transferred to the completed DS-1 Orbital Battle Station itself, where he controlled a wing of detention blocks. His men were trained and understood the way he liked running things. With the prison cells empty, all Calders needed was the first prisoner contingent to fill the cells.\nCalders willingly accepted Tarkin and Tagge's praises for his above expectations work at Despayre. He trained his men and they understood the way he liked running things within the DS-1 Orbital Battle Station's detention blocks that he oversaw. With objectives to guard his prisoners and keep them in good condition until contrary orders arrived, Calders was polite to the prisoners, but could hardly hide his glee when orders for the prisoners to undergo interrogation or worse came along.\nA thick-muscled bull of a man who appeared to be bursting out of his uniform, Calders was restrained aggression in Human form. His physical strength had become his personality. He stood at a height of 1.75 meters and his moustache contained a hint of gray.\nCalders's work was so exemplary at Odik II, where he began as a security guard, that he quickly became the warden of the planet's detention facility.\nCalders was equipped with a comlink, blaster pistol, stun truncheon, and an interrogator kit worn on his uniform's belt.\nCalders was created for 1991's Death Star Technical Companion, a Star Wars: The Roleplaying Game sourcebook written by Bill Slavicsek.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Security_guard/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Odik_II",
  "/wiki/Military_rank/Legends",
  "/wiki/Warden/Legends",
  "/wiki/Despayre",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Major/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/General/Legends",
  "/wiki/Cassio_Tagge/Legends",
  "/wiki/Imperial_military_uniforms/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Stun_truncheon",
  "/wiki/Interrogator_kit",
  "/wiki/Belt/Legends",
  "/wiki/1991",
  "/wiki/Death_Star_Technical_Companion",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Bill_Slavicsek",
  "/wiki/Death_Star_Technical_Companion_(Second_Edition)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}