{
 "name": "Calder_Nettic",
 "display_name": "Calder Nettic",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dantooine"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3956 BBY",
      "Dantooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Calder Nettic was a Human male who lived on Dantooine during the Jedi Civil War. Nettic was murdered in 3956 BBY by a colonist named Handon Guld after Nettic had an affair with his wife. An investigation into his death was carried out by Jedi Master Bolook and Revan.\nCalder Nettic was a male Human colonist who lived on the Outer Rim farming planet of Dantooine with his wife during the time of the Jedi Civil War. He ran a surface-to-orbit transportation service with his business partner, another colonist by the name of Rickard Lusoff. Following a business deal in 3956 BBY, Nettic was accused by Lusoff of cheating him out of credits. On one occasion, the two were at a cantina attached to the spaceport located in Garang, the planet's capital city. After consuming drinks there, the two got into a drunken altercation, noticed by the municipal authorities. The Jedi Enclave on the planet was notified, and a Jedi named Tooka was dispatched to break up the fight. Concurrently, Nettic had been engaging in an affair with the wife of a man named Handon Guld.\nNettic and Guld repeatedly rented a speeder together, and following their time together, Guld discovered the affair Nettic had with his wife. Enraged, he plotted to murder Nettic. At the same time, Lusoff planned to kill Nettic, feeling cheated out of money. Several weeks after the destruction of the Outer Rim ecumenopolis world of Taris at the hands of the Sith Empire, Nettic was out in an Ancient Grove near the Jedi Enclave during a cloudy morning. Guld intercepted him, and shot him in the back with a blaster. However, at the same time, Lusoff was also planning to kill Nettic. Seeing Guld standing there, Lusoff took the shot with his hunting rifle, shooting Guld in the side of his abdomen. When he ran out of the brush, Lusoff injured his leg, while Guld dropped his blaster and called the authorities, beleiving he was about to be killed.\nA Jedi Master named Bolook was assigned to the scene, and filled the role of an investigator. Bolook brought with him an information droid, which was able to access the archives in the Jedi Enclave, and well as the Capital of Garang. They sent the dropped blaster and a sample of blood found on the scene to the Enclave for analysis.\nA few hours later, an amnesiac Revan was sent on his third and final initiate trial by Zhar Lestin of the council. Revan was to cleanse a dark taint, the fallen Padawan Juhani, from the Ancient Grove. When he passed through the crime scene, he was stopped by Bolook, who requested his assistance. Bolook saw the investigation as a way for Revan to further his training, wanting him to solve the crime on his own. After examining Guld and Lusoff's stories, Revan began to pick out inconsistencies. When the blood and blaster were confirmed not to have been Nettic's, Revan was able to deduce the true story, and presented his conclusion to Bolook. Bolook was surprised at the boldness of the claim, but took the two men into custody, and escorted them to the Enclave's holding facilities. Rickard Lusoff was charged with aggravated assault and attempted murder of Guld and attempted murder of Nettic, while Handon Guld was formally charged with Nettic's murder. Following the investigation, Nettic's body was removed from the grove.\nCalder Nettic appeared as a corpse in the 2003 video game Star Wars: Knights of the Old Republic, developed by BioWare. If the player passes through a certain area, the interaction with Bolook, and subsequently the investigation, is unavoidable. However, they have the option to refuse to help Bolook, insulting him in the process. They may also quit the investigation at any point, or come to an incorrect final conclusion. Upon the end of the investigation, Nettic's body disappears.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/3956_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Death/Legends",
  "/wiki/Colonist/Legends",
  "/wiki/Handon_Guld",
  "/wiki/Reproduction/Legends",
  "/wiki/Handon_Guld%27s_wife",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Bolook",
  "/wiki/Revan/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Farm/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Calder_Nettic%27s_wife",
  "/wiki/Time/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Rickard_Lusoff",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Garang_spaceport_cantina",
  "/wiki/Garang_Spaceport",
  "/wiki/Garang",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Jedi/Legends",
  "/wiki/Tooka_(Jedi)",
  "/wiki/Speeder/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Currency/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Destruction_of_Taris",
  "/wiki/Ecumenopolis/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Ancient_Grove",
  "/wiki/Blaster/Legends",
  "/wiki/Hunting_rifle",
  "/wiki/Limb/Legends",
  "/wiki/Jedi_investigator/Legends",
  "/wiki/Analysis_droid/Legends",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Standard_hour/Legends",
  "/wiki/Amnesia/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Zhar_Lestin",
  "/wiki/Dantooine_Jedi_Enclave_Council",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Juhani",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Jedi_training/Legends"
 ]
}