{
 "name": "Cale_Berkona",
 "display_name": "Cale Berkona",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Cale Berkona was a Human male Jedi Knight who took part in the Great Hunt, a Jedi campaign to eradicate Sith-created beasts from the the galaxy in the years following the Great Sith War. During the Hunt, Berkona joined a group of Jedi that traveled the galaxy battling terentateks, dangerous monstrosities that feasted on Force-sensitive blood. In 3993 BBY, Berkona took part in a hunt on the planet Tatooine that saw him barely escape a terentatek's clutches. Although badly wounded and his lightsaber destroyed, Berkona survived and returned to the Jedi Enclave on the planet Dantooine.\nA Human male, Cale Berkona was a Jedi Knight in the years following the end of the Great Sith War. In the aftermath of the Sith Empire's defeat in 3996 BBY, the Jedi Order declared the beginning of the Great Hunt, a campaign meant to eradicate Sith-created creatures from the galaxy. During the Hunt, Berkona took up with a group of Jedi that included Humans Duron Qel-Droma and Shaela Nuur, and Twi'lek Guun Han Saresh. The Jedi started going after terentateks—vicious, Sith-created beasts that fed on Force-sensitive blood. In 3993 BBY, Berkona joined the team on a mission to cleanse the planet Tatooine of terentateks. The Jedi found and eliminated a number of the beasts, tracking the last remaining terentatek to a cave. Berkona and his compatriots followed the beast in, and the terentatek was briefly able to seize the upper hand, killing one of the hunters.\nBerkona quickly found himself in the terentatek's grasp, his lightsaber destroyed—his death seemingly near, Berkona recited part of the Jedi Code as he stared into the monster's maw. However, Qel-Droma was able to confuse the beast with the Force, allowing Berkona to slip away while Saresh and Nuur slayed the terentatek. The dead terentateks were placed on a burning pyre, and an injured Berkona limped back to the group's ship with assistance from Saresh. A metal cast had to be placed on Berkona's left arm by the time the four made their way back to the Jedi Enclave on the planet Dantooine. There, Berkona learned from Saresh that Qel-Droma, Nuur, and the Twi'lek had been personally selected by the Jedi High Council to cleanse the Sith homeworld of Korriban of terentateks, a mission that was considered to be highly dangerous. Berkona was initially shocked that the Council would send the three on such a quest, and Saresh expressed to him concerns that Qel-Droma and Nuur's passion for each other might create problems on Korriban.\nDuring the Great Hunt, Berkona was willing to place himself in great danger to see the terentateks eliminated, even finding himself in one's grasp on Tatooine. Berkona acknowledged Qel-Droma, Nuur, and Saresh's status as the best hunters the Jedi Order had to offer but was still shocked to hear that the Jedi Council would send the three alone to cleanse Korriban of terentateks. Berkona had light skin with brown hair and blue eyes.\nTrained in the use of the Force, Berkona was considered one of the less skilled members of his hunting group—behind Qel-Droma, Nuur, and Saresh—and on Tatooine he was seriously wounded by a terentatek. Berkona wielded a blue-colored lightsaber, which was destroyed on Tatooine.\nCale Berkona first appeared in \"Shadows and Light\", a story in the 2005 comic Star Wars Tales 23, written by Joshua Ortega and illustrated by Dustin Weaver, though Shadows and Light did not mention Berkona's name in the story. The character was first named by Ortega in a post on the Dark Horse Comics message boards.\nWeaver later provided the artwork for the 2006 comic Knights of the Old Republic 8, and in a post on the Dark Horse message boards, he revealed that he meant for one of the Jedi on Flashpoint Station in the story to be Berkona. However, Weaver clarified the Jedi's identity as Berkona to only be \"unofficial.\" As his presence on Flashpoint Station was never alluded to in another source, this article does not include it.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Cale_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Great_Hunt_(Jedi)",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Sithspawn/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Terentatek/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Blood/Legends",
  "/wiki/3993_BBY",
  "/wiki/Cleansing_of_Tatooine",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Dantooine/Legends",
  "/wiki/Sith_Empire_(Great_Sith_War)",
  "/wiki/3996_BBY",
  "/wiki/Duron_Qel-Droma",
  "/wiki/Shaela_Nuur",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Guun_Han_Saresh",
  "/wiki/Death/Legends",
  "/wiki/Cave/Legends",
  "/wiki/Unidentified_Jedi_(Great_Hunt)",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Mouth/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Fire/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Time/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Korriban",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Shadows_and_Light",
  "/wiki/2005",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_Tales_23",
  "/wiki/Joshua_Ortega",
  "/wiki/Dustin_Weaver",
  "/wiki/Dark_Horse_Comics",
  "/wiki/2006",
  "/wiki/Knights_of_the_Old_Republic_8",
  "/wiki/Flashpoint_Stellar_Research_Station",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/June_11",
  "/wiki/October_14"
 ]
}