{
 "name": "Caleb",
 "display_name": "Caleb",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 1039 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "990 BBY",
      "Ambria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Caleb was a Human male healer who resided on the abandoned world of Ambria. He was killed by Darth Zannah in 990 BBY.\nCaleb lived during the last days of the New Sith Wars, but refused to be a party to the wars, and sought the planet Ambria as a refuge. He turned away both Jedi and Sith, seeing himself as a neutral party and a healer to the common people.\nHis rigid policy of neutrality was challenged when the exiled Sith Lord Darth Bane came to his home in 1000 BBY, seeking a cure for the synox with which his former lover Githany had poisoned him. Caleb refused to treat him at first, going so far as to thrust his hand into a cauldron of boiling liquid to demonstrate his impartiality to pain. This implied that he would be immune to any torture that the Sith Lord had planned; they would have no power over him since he accepted his fate. The impossibility of scaring the healer frustrated Bane, however, Bane sensed the nearby presence of Caleb's daughter. After Bane threatened to end her life, Caleb agreed to cure him. Sensing that Caleb could be useful in the future, Bane allowed him to live.\nIn 990 BBY, when Darth Zannah came looking for Caleb, he refused to heal Darth Bane, who had been mortally injured. Darovit made a deal with Caleb to heal Bane, as long as Zannah turned herself and Bane in to the Jedi and deactivated their ship, the Loranda. At last Zannah complied and after Caleb healed Bane and removed the orbalisks, he made sure Zannah sent out a message to the Jedi Order that there was a Sith Lord on Ambria, waiting to be arrested. Zannah, however, wished to save Bane and preserve the Order of the Sith Lords, therefore she killed Caleb and drove Darovit insane with her sorcery. Later, she hid Bane and herself in an underground hiding spot of Caleb's, cloaking their presences in the Force. The Jedi arrived and found Caleb's body chopped up outside of his shack. As they neared, Darovit attacked them and was killed almost instantly. The Jedi took all the pieces of Caleb's corpse back to Coruscant to give him a proper funeral.\nOnce returned to the Jedi Temple, the Jedi created a memorial to those Jedi who were responsible for the destruction of the Sith. All five of the Jedi's lightsaber hilts were set into a large white stone block in the gardens around the base of the Tower of First Knowledge. In honor to his sacrifice for the Republic, Caleb's name was inscribed in the block. In 980 BBY, Caleb's daughter, who had become Princess Serra of Doan, saw the name while visiting the Temple to negotiate on behalf of her planet. Upon learning of her father's death, she ordered her bodyguard, Lucia to contact the Huntress to capture Bane, who she believed had killed her father.\nCaleb's healing abilities stemmed from the Force but it was not like that of the Jedi or Sith; his power came directly from the world around him, the natural power of the mountains and forests. Using the knowledge found in the Jedi Archives by Zannah, he was successfully able to remove Bane's orbalisk armor and save his life.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Caleb_(disambiguation)",
  "/wiki/1039_BBY",
  "/wiki/990_BBY",
  "/wiki/Ambria/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Confrontation_on_Ambria",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Caleb%27s_hut",
  "/wiki/1000_BBY",
  "/wiki/Synox",
  "/wiki/Githany",
  "/wiki/Torture/Legends",
  "/wiki/Serra",
  "/wiki/Darovit",
  "/wiki/Loranda_(starship)",
  "/wiki/Orbalisk",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Death/Legends",
  "/wiki/Summon_fear",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Spell_of_concealment",
  "/wiki/The_Force/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Lightsaber_hilt/Legends",
  "/wiki/Tower_of_First_Knowledge/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/980_BBY",
  "/wiki/Prince/Legends",
  "/wiki/Doan",
  "/wiki/Bodyguard/Legends",
  "/wiki/Lucia_(soldier)",
  "/wiki/Darth_Cognus",
  "/wiki/Skirmish_in_Darth_Bane%27s_mansion",
  "/wiki/Mountain/Legends",
  "/wiki/Forest/Legends",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Orbalisk_armor",
  "/wiki/Darth_Bane:_Path_of_Destruction",
  "/wiki/Darth_Bane:_Path_of_Destruction_(audiobook)",
  "/wiki/Jedi_vs._Sith_1",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/Darth_Bane:_Dynasty_of_Evil",
  "/wiki/Darth_Bane:_Dynasty_of_Evil_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}