{
 "name": "Cale Serasai",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sulfur Lake Pirates"
     ]
    }
   ]
  }
 ],
 "content": "Cale Serasai was a Human male pirate who lived on Lok during the Galactic Civil War.\nCale Serasai was a member of the Sulfur Lake Pirates, a group of pirates active on Lok. They had a strong rivalry with the Lok Revenants and contested the position of their leader Nym as the ruler of the planet.\nIn 1 ABY, the tensions between the Lok Revenants and the Sulfur Lake Pirates turned to open war. Although the Lok Revenants were clearly most powerful among the two factions, Nym got frustrated of losing time and money and he finally decided to propose a truce to the Sulfur Lake Pirates. The pirates were not seeking for peace but they accepted to join the negotiations as they saw an opportunity to take an advantage. A meeting was then arranged in Kimogila Town, an abandoned city in the deserts of Lok. The group of Sulfur Lake \"negotiators\" was led by Cale Serasai. Yet not long before the meeting took place, the pirates captured Sheeli, the sister of the engineer Choster who previously helped the Revenants to raid the Sulfur Lake Pirate Hideout. When the meeting began, Serasai indeed did not try to negotiate the peace but instead revealed that they had captured Sheeli. He threatened to kill the woman and ordered the Lok Revenants to hand over Choster. The Revenant transmitted the request to Nym, but the latter refused to betray the engineer. Many Sulfur Lake Pirates hidden in the ruins of Kimogila Town then suddenly attacked Nym's ambassadors. However, although the spacers were outnumbered, they successfully defended themselves and killed all the pirates. The only survivor was Cale Serasai, who begged to be spared and agreed to release Sheeli in exchange for his life.\nCale Serasai was a Non-Player Character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Cale Serasai was added to the game as part of the revamped \"Nym's Theme Park,\" released with the \"Game Update 16,\" on March 23, 2010.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cale_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sulfur_Lake_Pirates",
  "/wiki/Nym/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Lok/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Kimogila_Town",
  "/wiki/Sheeli",
  "/wiki/Engineer/Legends",
  "/wiki/Choster",
  "/wiki/Sulfur_Lake_Pirate_Hideout",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/March_23",
  "/wiki/2010",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}