{
 "name": "Caleb Knolar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Caleb Knolar was a Major of the Galactic Empire who collected credit contributions from those sympathetic to the Empire.\nDuring 1 ABY, Major Caleb Knolar was stationed at a small Imperial garrison in the Tatooinian capital of Bestine. It was at this location that Caleb Knolar accepted credit donations from various sources to support the war effort. Shortly after being stationed, he received at least one generous donation of one million credits from an unknown spacer. Caleb commended this individual's generosity by acknowledging him as a \"Patron of the Empire\".\nThough Caleb wore the same uniform worn by Imperial Surface Marshals, it is not clear if he was in fact a Surface Marshal himself.\nMajor Caleb Knolar is a Non-Player Character  in the MMORPG Star Wars Galaxies. He is one of three NPCs added with Game Update 9 in April 2009 that are used as credit sinks to remove money from the game economy and combat inflation. For paying one million credits the player receives the player title \"Patron of the Empire\".",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Major/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/1_ABY/Legends",
  "/wiki/Imperial_garrison_(Bestine)",
  "/wiki/Tatooine/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Surface_Marshal",
  "/wiki/2009"
 ]
}