{
 "name": "Calleh",
 "display_name": "Calleh",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Selkath"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue and grey"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order",
      "Je'daii Council",
      "Je'daii Council"
     ]
    }
   ]
  }
 ],
 "content": "Calleh was a female Selkath healer of the Je'daii Order on the planet Tython who was the mate of a fellow Selkath, Naro. The two Je'daii jointly held the position of Temple Master of Mahara Kesh, the Temple of Healing on Tython. In 25,793 BBY, Calleh and Naro helped the other Temple Masters on the Je'daii Council quell a Force Storm that was ravaging the world, and Calleh tended to those who were wounded in the storm's aftermath.\nA Force-sensitive Selkath female, Calleh was trained in the use of the Force by the Je'daii Order on the planet Tython, and eventually became the mate of a Selkath male by the name of Naro. Both were healers, and by the year 25,793 BBY, Calleh and Naro were serving as joint Temple Masters of Mahara Kesh, the Temple of Healing. That year, the planet was embroiled in an immense Force Storm, and Calleh, Naro, and the other Temple Masters—who collectively formed the Je'daii Council were forced to join together and lend their strength to Temple Master Quan-Jang, who shifted the planet back towards the light side of the Force and into balance.\nShortly afterward, the Force-sensitive offworlder Xesh was brought to Mahara Kesh along with several other Je'daii who had been injured while capturing Xesh, including Quan-Jang. Calleh tended to the wounds of Xesh and the Je'daii Journeyer Sek'nos Rath, and she was checking up on Xesh when the young man awoke. Calleh expressed sympathy for the hard life Xesh had led, as was clearly visible by the numerous scars that covered his body, and the Selkath explained that the stranger was at Mahara Kesh. Calleh and Naro continued to tend to the injured over the next ten days, at which time the Council decided to exile Xesh—whose powerful presence in the dark side of the Force had caused the recent storm—to the moon of Bogan.\nA female Selkath, Calleh possessed a single tendril that extended from the back of her head, and she had black eyes and skin that was patterned in shades of dark and light blue on her head. The rest of Calleh's skin, however, was a pale grey-green color, and she had two black-and-silver rings looped through the lobes on the side of her head. She felt great sympathy for Xesh when she realized how violent his life had been, and Calleh was a skilled and knowledgeable healer, holding the position of Temple Master at the Temple of Healing.\nCalleh was first mentioned in the preview issue 0 of the Star Wars: Dawn of the Jedi comic book series, and she made her first appearance in the series' fifth issue.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Selkath/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Je%27daii_Council",
  "/wiki/Planet/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Naro",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Mahara_Kesh",
  "/wiki/Je%27daii_Temples",
  "/wiki/25,793_BBY",
  "/wiki/Force_Storm_(Tython)",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Quan-Jang",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Tau_(individual)",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Sek%27nos_Rath",
  "/wiki/Standard_day/Legends",
  "/wiki/Time/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Bogan",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi_0",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_5"
 ]
}