{
 "name": "Callandri",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pendal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Granse Confederacy"
     ]
    }
   ]
  }
 ],
 "content": "Callandri was a female Human assassin and the leader of the Granse Confederacy.\nBorn in Tilam City on the planet Pendal, Callandri had led a life of crime since she was a little girl. She worked for different criminal groups on Pendal and eventually left her homeworld to roam the stars. Even then, she chose to use the simple technology of her native world, particularly the slugthrower machine gun.\nShe found work as an \"advisor\" to a high executive of Kuat Drive Yards. Her exact work included assassinating her employer's enemies, including people inside and outside the corporation. However, she chose to end her relation with Kuat Drive Yards; rumor stated that she resigned during a \"hunt,\" in order to become a freelance bounty hunter with her older cousin, Zayl Braith. In the wake of her resignation, the high executive sent five renowned bounty hunters to bring her back. Callandri defeated the hunters and sent them back to him, albeit in pieces.\nShe then performed her first attempt on the life of Rebel lieutenant Alton Lochner. She found him on the Brawl and Grill establishment, in Trader's Quarter, Ord Mantell, and entered the bar shooting. Although Lochner's life was saved by his friends, including the Wookiee Tirranna and Adazian Liebke, he spent weeks in the infirmary. Tirranna respected Callandri's skills, but also intensely hated her.\nWanting to get even on Lochner and Tirranna, Callandri and Brayth attacked them again on Triewahl Docking Station, but they were again saved by their partners.\nShe then recruited six alien bounty hunters to form the Granse Confederacy under her command. She met Arcuse, who had formed a partnership with Kiran Tatch and traveled by Rodick Tag; Arcuse decided that it would be a good team to join and the others followed him. She also met Milacass, Vadon Lenitor, and Lu'daal-ud, who joined the Confederacy forfeiting their respective pasts. Soon, Callandri was good friends with Lenitor.\nCallandri managed to acquire a Jadai Q-6100 land vehicle. She also killed Karu Nelbin and stole Nelbin's ship, the Nightcast. She heavily modified the ship to adjust it to the Confederacy's needs.\nIn only months, Callandri made the Granse Confederacy a renowned force, and the Rebel Alliance became afraid of it. Vanden Willard wrote an extensive report on Callandri's activities, consulting Lochner and other survivors of her attacks.\nAt this point of her life, Callandri was a muscled young woman with dark long hair braided into aconlins—a common hairstyle in Tilam City. She usually dressed in gray or black, using her clothes to hide weapons.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Pendal",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Granse_Confederacy",
  "/wiki/Captain/Legends",
  "/wiki/Vanden_Willard/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Tilam_City",
  "/wiki/Planet/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Star/Legends",
  "/wiki/Slugthrower/Legends",
  "/wiki/Machine_gun",
  "/wiki/Advisor/Legends",
  "/wiki/Kuat_Drive_Yards/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Zayl_Braith",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Alton_Lochner",
  "/wiki/Brawl_and_Grill",
  "/wiki/Trader%27s_Quarter",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Tirranna",
  "/wiki/Adazian_Liebke",
  "/wiki/Triewahl_Docking_Station",
  "/wiki/Arcuse",
  "/wiki/Kiran_Tatch",
  "/wiki/Rodick_Tag",
  "/wiki/Milacass",
  "/wiki/Vadon_Lenitor",
  "/wiki/Lu%27daal-ud",
  "/wiki/Q-6100",
  "/wiki/Karu_Nelbin",
  "/wiki/Starship/Legends",
  "/wiki/Nightcast",
  "/wiki/Hair/Legends",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}