{
 "name": "Calphayus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireDread Masters",
      "Dread Masters"
     ]
    }
   ]
  }
 ],
 "content": "Lord Calphayus, also known as the \"Prophet of the Masters\", was a powerful Sith Lord and a member of the Dread Masters. He wielded a cyan bladed saberstaff.\nCalphayus was freed with the other Dread Masters by an Imperial who traveled to The Tomb on Belsavis. After demonstrating their powers on a Republic security force, the Dread Masters terrorized the Esh-kha before leaving the planet. After the Sith Emperor's supposed death, the Dread Masters broke away from the Empire and decided to take the galaxy for themselves.\nHe planned Asation's assault, making his presence clear via mental statements throughout the progression of the Strike teams who came to assist the Gree, though he never appeared on Asation. Calphayus dispatched the three most powerful Commanders of the Dread Host, named Ciphas, Heirad, and Kel'sara. These three Sith sought to stop the strike team, but through their intense battle, they were defeated. Calphayus stated upon Kel'sara`s death; \"The Shield is broken, but the sword is drawn.\" Calphayus ultimately unleashed the Terror From Beyond after the death of Kephess, but the Terror was defeated and the plans of using Asation as a standing ground failed.\nUpon their return to Oricon, Calphayus along with the rest of the Dread Masters began to become insane with the loss of Styrak. His visions became stronger and more detailed, but his over confidence led him to believe they were accurate and would in fact occur. Calphayus dueled with the team responsible for the death of Kephess, Styrak, Brontes, Ciphas, Heirad and Kel'sara. His mastery of time, space and knowledge allowed him to extend his power through the future and past, though his plans were foiled. He was defeated in his inner sanctum and returned to the council room to recuperate.\nWhen confronted once more, Calphayus began to emit a deadly field of power, reflecting all damage to the user as he proceeded to drop corrupted fields beneath him, giving his enemies little room to work with. Eventually Calphayus was defeated, but survived the encounter. Broken, alone and free, he escaped the palace, removing the golden crest he and his fellow Dread Masters wore to mask their faces, revealing him to be a withered old man, a testament to how long he had been a Sith and a Dread Master.\nCalphayus wandered Oricon after the death of his fellow masters, soon arriving at the Republic Strike team camp. There he sought to reason with the team, telling them of his rather human past. He was once married, felt no fear or pain towards his wife or life in general. But once he and his friends, now Dread Masters, studied the Phobis devices, they became linked mentally and physically in a weave of Terror and Madness, distorting and changing him into a living entity of Madness. Calphayus was weak, scared, alone and looking for hope. The strike team decided to show mercy, and let him be cared for and evaluated by the Jedi.\nRepublic players have the option to spare Calphayus and allow him to undergo treatment by the Jedi  or deem him unworthy of redemption for his past crimes and kill him . Imperial players do not get the option to spare or kill Calphayus.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gray",
  "/wiki/Brown",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dread_Masters",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Color/Legends",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/The_Tomb",
  "/wiki/Belsavis/Legends",
  "/wiki/Esh-kha",
  "/wiki/Tenebrae",
  "/wiki/Asation",
  "/wiki/Gree_(species)/Legends",
  "/wiki/Dread_Host",
  "/wiki/Ciphas",
  "/wiki/Heirad",
  "/wiki/Kel%27sara",
  "/wiki/Lotek%27k",
  "/wiki/Kephess",
  "/wiki/Oricon",
  "/wiki/Styrak",
  "/wiki/Brontes",
  "/wiki/Strike_Team_Oricon_camp",
  "/wiki/Phobis_devices",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Calphayus",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}