{
 "name": "Cambion_Bayrd",
 "display_name": "Cambion Bayrd",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Ginger-red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trigdale Metallurgy"
     ]
    }
   ]
  }
 ],
 "content": "Cambion Bayrd was the Director of Operations for Trigdale Metallurgy on Goroth Prime.\nCambion Bayrd was a hard-working and hard-playing corporate executive whose nickname was \"Goodtime Cambie.\" His easy-going and fun-loving nature covered a shrewd and sharp business mind that would use every trick in the book such as backstabbing and character assassination to achieve his goals. Bayrd was appointed as Director of Operations for Trigdale Metallurgy's operations on Goroth Prime.\nDirector Bayrd believed that Trigdale did not have the resources to support the rights it acquired on Goroth. With full responsibility for the company's profits and losses on the planet, Bayrd became frustrated. He knew that if he succeeded, he would be a hero. Failure would lead to him being a pariah. Bayrd received little support from his headquarters, leading him to break corporate guidelines by negotiating a strategic partnership with the Karflo Corporation in an effort to oust TaggeCo from the number one corporate spot on the planet. Bayrd had no intention of abiding by the alliance in the long-term, looking at the short term gains Trigdale would receive.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Trigdale_Metallurgy",
  "/wiki/Goroth_Prime",
  "/wiki/Karflo_Corporation/Legends",
  "/wiki/Tagge_Company",
  "/wiki/Goroth:_Slave_of_the_Empire"
 ]
}