{
 "name": "Canduri",
 "display_name": "Canduri",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Believers"
     ]
    }
   ]
  }
 ],
 "content": "Canduri was a female Human who served the Believers Sith cult during the time of the Clone Wars. Around 21 BBY, Canduri was stationed at a Believer laboratory on the planet Genarius at which the cultists were developing a virus fatal to the Caarite species. After the laboratory was raided by soldiers of the Caarite-dominated Metatheran Cartel trading concern, Canduri fled and was captured by a group of freelance agents who were investigating the Believer operation on Genarius.\nCanduri was a female Human scoundrel who lived during the last years of the Galactic Republic and by time of the Clone Wars was a young woman. A member of the Believers Sith-worshipping cult, around 21 BBY, Canduri was assigned to a hidden Believers laboratory sited on S-Ipsus, manufacturing station on the planet Genarius in the Cularin system. The S-Ipsus Believer facility hosted an operation by the cultists to develop a virus fatal to members of the Caarite species, though Canduri knew little of the Believers' plans for the contagion. After the Metatheran Cartel—a Caarite-dominated trading concern—learned of the Believer base, a contingent of Cartel soldiers raided the facility and Canduri was forced to flee.\nWhile carrying a vial containing a specimen of the anti-Caarite virus, Canduri exited the hidden base via a hatch in the installation's roof and emerged onto a thermal detonator production line. There, she immediately crossed paths with the heroes of Cularin, a group of freelance agents investigating the Believer presence on S-Ipsus, who were standing 130 meters away from Canduri as she left the Believer facility and blocking her escape route. In an attempt to get past the freelance agents, Canduri fired a blaster pistol at the triggering mechanism for the detonator production line's security system, in hope that the security defences would activate and kill the operatives. With the factory's blaster cannons raining down fire, Canduri raced away down the production line but was eventually apprehended by the heroes of Cularin.\nFollowing her capture, Canduri was reticent to reveal any information to the freelance agents. The heroes of Cularin escorted her back to the Believer laboratory to investigate the base and the Cartel soldiers offered to purchase her for the price of 300 to each of the operatives. The Cartel troops had planned to take one of the Believers present at the facility as a prisoner for further interrogation and Canduri was the only member of the laboratory's staff to survive the attack; the soldiers therefore considered it imperative that they gain custody of Canduri. The agents declined to surrender the Believer over to the Cartel and departed the laboratory with her.\nAs the freelance agents attempted to leave the S-Ipsus factory with Canduri, they were intercepted by a patrol of the Thaereian military, an armed force enfranchised to defend the Cularin system. Led by the Bothan Lieutenant Mish Paht, the Thaereians demanded that Canduri be handed over to them as evidence of the Believers' operation on Genarius. The heroes of Cularin declined to handover their prisoner to the Thaereians and shortly thereafter the agents were ambushed by battle droids reprogrammed by the assassin Melo Centris to target the agents. Amid the struggle, Canduri attempted to slip away, but was soon recaptured by the operatives. The heroes of Cularin subsequently transported the Believer off of Genarius and handed her into the custody of the Cularin Militia, a military force that operated on the planet Cularin. Over the following days, Canduri was questioned by her captors on what she know of the Believers' plans for the anti-Caarite virus.\nCanduri was of unsound mind and her condition led to her having a want to kill all Caarites, a desire to rule the galaxy and a hatred of the Jedi, a noted order of Force users. She was devoted to the Believers though was not willing to fight to the death in support of the Sith cult's cause. Though not Force sensitive, Canduri convinced herself that she had Force powers and when in combat situations would gesture her hands in a futile attempt to Force grip against her opponents. She had dark hair and was multi-lingual; in addition to Basic she was fluent in the languages Bothan, Caarite and Rodian.\nCanduri appeared in Open Aarms, a Star Wars Legends roleplaying adventure by Morrie Mullins and published in 2003 that served as the second instalment of the Metatheran Caution trilogy of RPGA's Living Force roleplaying campaign. She was subsequently referenced in Belly of the Beaast, the final module of the Metatheran Caution trilogy.\nIn Open Aarms, the players roleplay as the heroes of Cularin and various outcomes are possible based on the actions and decisions of the players. It is possible for Canduri to either be captured or killed by the freelance agents when she encounters the operatives while fleeing the S-Ipsus Believers laboratory. The adventure advises that in the event that Canduri is killed, a new Believer character should be inserted into the adventure and captured by the player characters to fulfil the role otherwise played out by Canduri.\nThere are also various possible eventualities regarding Canduri's fate subsequent to her capture. It is possible firstly for the player characters to relinquish her the Metatheran Cartel soldiers that raided the Believer laboratory, in which case the troops offer 300 to each of the freelance agents to purchase her but a higher purchase price of up to 500 can be negotiated. It is alternatively possible for the Canduri to be seized by the Thaereian patrol commanded by Lieutenant Mish Paht or for the player characters to voluntarily surrender her to the Thaereians. When the freelance of agents are attacked by battle droids reprogrammed by Melo Centris, Canduri attempts to run free and if she succeeds at escaping she is then captured by the Metatheran Cartel soldiers and taken away.\nAfter leaving S-Ipsus, if the player characters still have custody of Canduri they can choose to hand her over to various different groups. It is possible for Canduri to be surrendered to the Jedi Order, in which case the Jedi Master Lanius Qel-Bertuk takes custody of her. Qel-Bertuk then plans to have the Jedi question her and hands her into the charge of the Cularin Militia. It is also possible for the freelance agents to relinquish Canduri to the Cularin Militia directly. An alternative recourse is for the operatives to take her to a group of researchers studying the anti-Caarite virus from a research facility orbiting S-Ipsus, though the research team are reticent to take her and suggest that the freelance agents hand her to the Cularin Militia or the Office of Peace and Security law enforcement agency instead. Another possibility is that the player characters take Canduri to the crime lord Nirama; Nirama is resistant to accepting the captive Believer and if the player characters are insistent to him taking her then he accepts her and arranges for her to be transferred somewhere more appropriate. In Belly of the Beaast, it is noted that if Canduri was captured during the events of Open Aarms, she was subsequently questioned by her captors for information concerning the virus.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Believers",
  "/wiki/Sith_cult/Legends",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/S-Ipsus_Believers_laboratory",
  "/wiki/Planet/Legends",
  "/wiki/Genarius",
  "/wiki/Sith_Cultist",
  "/wiki/Anti-Caarite_virus",
  "/wiki/Death/Legends",
  "/wiki/Caarite",
  "/wiki/Species/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Metatheran_Cartel",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Scoundrel",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/S-Ipsus",
  "/wiki/Factory/Legends",
  "/wiki/Cularin_system",
  "/wiki/Open_Aarms",
  "/wiki/Canon",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Detonator/Legends",
  "/wiki/Blaster_cannon/Legends",
  "/wiki/Credit",
  "/wiki/Thaereian_military",
  "/wiki/Army/Legends",
  "/wiki/Thaereian_Navy_charter",
  "/wiki/Star_system/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Mish_Paht",
  "/wiki/Thaereian",
  "/wiki/Battle_droid/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Melo_Centris",
  "/wiki/Cularin_Militia",
  "/wiki/Cularin/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Language/Legends",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Bothese",
  "/wiki/Caarimala",
  "/wiki/Rodese",
  "/wiki/Morrie_Mullins",
  "/wiki/2003",
  "/wiki/Metatheran_Caution_trilogy",
  "/wiki/RPGA",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Belly_of_the_Beaast",
  "/wiki/Droid/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/S-Ipsus_orbital_research_facility",
  "/wiki/Scientist/Legends",
  "/wiki/Office_of_Peace_and_Security",
  "/wiki/Crime_lord/Legends",
  "/wiki/Nirama",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance"
 ]
}