{
 "name": "Car Affa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Car Affa was a male Weequay arms dealer active on the planet Coruscant during the Clone Wars. Affa sold Republic arms to the Separatists until he was arrested by Jedi Knight Anakin Skywalker and his Padawan Ahsoka Tano. Affa was then brought to the Jedi Temple by the Jedi.\nThe Weequay male Car Affa worked as an arms dealer during the Clone Wars between the Confederacy of Independent Systems and the Galactic Republic. During the war he began buying arms on the black market and selling them to the Separatists. While spending time in slum district G17 on the planet Coruscant, he was tracked down to a bar by the Jedi Knight Anakin Skywalker and his Padawan Ahsoka Tano based on Republic intelligence. Leaving Tano outside to guard for any escape attempt Affa might make, Skywalker entered the establishment alone. Several blaster shots later, Affa was apprehended and the bar's other occupants had fled. Skywalker brought Affa out to meet Tano, and the trio returned to the Jedi Temple. At the temple, Tano asked to be excused so she could go to the Jedi Archives and carry out some research. Skywalker agreed to let her go, promising to finish business with Affa himself.\nAffa was a vile and corrupt male Weequay war profiteer with brown skin.\nAffa first appeared as a minor character in \"Lightsaber Lost,\" the eleventh episode of the Star Wars: The Clone Wars television show's second season.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Car_Affa",
  "/wiki/Car_Affa/Legends",
  "/wiki/Weequay",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Arms_dealer",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Imperial_Palace",
  "/wiki/Jedi",
  "/wiki/Black_market",
  "/wiki/Slum_district_G17",
  "/wiki/Blaster",
  "/wiki/Jedi_Archives",
  "/wiki/Lightsaber_Lost",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Category:Images_of_Car_Affa"
 ]
}