{
 "name": "Cardo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "35 ABY",
      "Exegol"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Knights of Ren",
      "Crimson Dawn",
      "First Order"
     ]
    }
   ]
  }
 ],
 "content": "Cardo was a Force-sensitive humanoid male who served as a member of the Knights of Ren, under the command of an individual known as Ren. Cardo, alongside Albrekh, tended to the weapons and armor of the Knights.\nSometime prior to the last years of the Galactic Civil War, Cardo became a member of the Knights of Ren and was lead by an individual known as Ren. Cardo and the knights followed the dark side of the Force and an ideology based on the red-bladed lightsaber called Ren. During the Imperial Era, the knights remained in hiding on multiple backwater planets to avoid the Galactic Empire.\nCardo and the knights were eventually recruited by Lady Qi'ra to join Crimson Dawn and help her defeat Darth Sidious—Dark Lord of the Sith and Galactic Emperor—and his Empire. At Qi'ra request, the knights were tasked with infiltrating Fortress Vader in order to recover the Screaming Key from Darth Vader's vault. After Cardo and the knights arrived at the plains of Gahenn on Mustafar on the Night Buzzard, they arrived at an old entrance of the fortress which was covered by lava. After entering the fortress through the Sith cave, the knights were spotted by Vaneé, who called various Lava Troopers to attack them. Cardo and the knights blasted the troopers while Ren sliced through them. After reaching Vader's vault, Ren managed to recover the screaming key. Unfortunately, the knights were soon met with the arrival of Darth Vader himself, who quickly killed one of the knights while Ren told the rest of them to run while he engaged on duel with the Sith Lord. After Ren managed to flee the duel, the knights quickly escaped the fortress with the key on their possession.\nWith the key on their posesion, Qi'ra sent the knights to a dark side hellscape where they served as protectors of The Archivist, who was going there to recover an item for Crimson Dawn. After Ren activated the screaming key with the Force, Cardo and the rest were startled by the agonizing sound that the key produced, which also woke up various petrified dark side creatures that started to attack them. The knights ran through the hellscape while being chased by the creatures, Cardo and his comrades tried to blast the creatures but their blasters didn't cause any damage to them, leaving Ren to do most of the work while the knights protected The Archivist. Cardo and the knights kept fighting until the Archivist used the screaming key to unlock the item which in turn made the creatures become petrified again. Qi'ra was later informed of their success on the mission.\nWhen a group of Bounty hunters lead by T'onga infiltrated the Vermillion in order to rescue Cadeliah, Cardo and the knights arrived to kill the crew.\nRen told Cardo and Massif to disarm the intruders, leaving Cardo to carry on with the orders by shooting at the bounty hunter crew. Unfortunately, one of the bounty hunters, Zuckuss, took cover behind 4-LOM and later shot Cardo's arm cannon, leaving him without a long-range weapon. Cardo later faced the Trandoshan Bossk, while initially having the upper hand during their brawl, Cardo was grabbed by the Trandoshan and thrown into his partner Marinda while the bounty hunter crew managed to escape.\nCardo and the Knights traveled with Ren to the desert world of Pasaana, after learning that Rey and her allies were there. As Rey went to confront Ren. Cardo's fellow knights Ap'lek and Kuruk captured Chewbacca and brought him to some stormtroopers while Cardo and the others stood by as the Wookiee was loaded aboard a transport, alongside his belongings, and the dagger he was holding. The Knights took the captive back to the Steadfast.\nCardo and the other Knights also journeyed to the surface of Kijimi, hunting for any sign of Rey and her allies, yet were unsuccessful in their search of the city.\nA short time after the hunt for Rey, Cardo and the other Knights of Ren were lurking in the Sith Citadel of Darth Sidious on Exegol. During the battle of Exegol, Kylo Ren, now the redeemed Ben Solo, entered the Citadel in an attempt to kill Sidious.\nBefore Solo could reach the Throne of the Sith, Cardo and the Knights confronted their former leader. The Knights were able to swiftly overwhelm Solo in his unarmed state, forcing him to the ground and beating him. However, through the use of their Force-bond, Rey was able to give Solo his grandfather's lightsaber. With Anakin's lightsaber, Ben swiftly cut down Kuruk before slashing Cardo across the chest with his saber.\nCardo was Force-sensitive and an adept of the dark side of the Force but was untrained in the Force which resulted his powers being stunted. As a Knight of Ren, Cardo displayed great martial prowess few could match, as shown when he was able to keep up with the Trandoshan Bossk in a brawl.\nUnlike his fellow Knights, who preferred precision based attacks, Cardo's approach left large swathes of destruction. His arm cannon packed more than enough firepower for a single soldier, effectively turning him into a walking turret. Cardo was obsessed with weapon modification, which made him the best armorer among the Knights, alongside their Symeong ally Albrekh. Despite his great skill, Cardo was the second to fall, easily killed from a slash across the chest by his redeemed former leader, Ben Solo, during the Battle of Exegol.\nCardo was obsessed with weapons and weapon modifications, as such he was the most heavily armed member of the Knights of Ren. His primary weapon was a custom arm cannon, which incorporated three weapons into one: a rapid-fire repeating Laser blaster, a Plasma bolt launcher that could fire explosive charges over 200 meters, and a Flamethrower that fired naphthex gel.\nHe also carried a blaster pistol in a holster around his waist, which he primarily used as a sidearm. Finally, Cardo carried concussion grenades strapped to his chest.\nLike the rest of the Knights, Cardo wore black clothing, including a flame-resistant Riftiaworm-hide coat and tri-braced plasteel-armored greaves. Cardo's helmet had the most basic design out of any of the Knights' helms, consisting of a blast furnace plate molded into a helmet shape.\nCardo was played by stunt performer Martin Wilde in the 2019 movie Star Wars: Episode IX The Rise of Skywalker, in the 2019 film Star Wars: Episode IX The Rise of Skywalker, although the character is only listed as \"Knight of Ren\" in the movie's credits.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Knights_of_Ren",
  "/wiki/Cardo_(Sedrian)",
  "/wiki/Cardo_Minor",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/35_ABY",
  "/wiki/Exegol",
  "/wiki/Humanoid",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Crimson_Dawn",
  "/wiki/First_Order",
  "/wiki/Force-sensitive",
  "/wiki/Ren_(human)",
  "/wiki/Albrekh",
  "/wiki/Armor",
  "/wiki/Standard_year",
  "/wiki/Galactic_Civil_War",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Color",
  "/wiki/Lightsaber",
  "/wiki/Ren_(lightsaber)",
  "/wiki/Imperial_Era",
  "/wiki/Planet",
  "/wiki/Galactic_Empire",
  "/wiki/Lord",
  "/wiki/Qi%27ra",
  "/wiki/Darth_Sidious",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Galactic_Emperor",
  "/wiki/Fortress_Vader",
  "/wiki/Screaming_Key",
  "/wiki/Night_Buzzard",
  "/wiki/Sith_cave",
  "/wiki/Vane%C3%A9",
  "/wiki/Lava_Trooper",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mission_to_a_dark_side_hellscape",
  "/wiki/Dark_side_hellscape",
  "/wiki/The_Archivist",
  "/wiki/T%27onga%27s_crew",
  "/wiki/Bounty_hunter",
  "/wiki/T%27onga",
  "/wiki/Vermillion_(Crimson_Dawn)",
  "/wiki/Cadeliah",
  "/wiki/Zuckuss",
  "/wiki/4-LOM",
  "/wiki/Trandoshan",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Marinda",
  "/wiki/Pasaana",
  "/wiki/Rey_Skywalker",
  "/wiki/Ap%27lek",
  "/wiki/Kuruk",
  "/wiki/Chewbacca",
  "/wiki/Ochi%27s_blade",
  "/wiki/Kijimi",
  "/wiki/Sith_Citadel",
  "/wiki/Battle_of_Exegol",
  "/wiki/Throne_of_the_Sith",
  "/wiki/Force-bond",
  "/wiki/Skywalker_lightsaber",
  "/wiki/The_Force",
  "/wiki/Symeong",
  "/wiki/Ben_Solo",
  "/wiki/Cardo%27s_arm_cannon",
  "/wiki/Laser",
  "/wiki/Blaster",
  "/wiki/Plasma",
  "/wiki/Flamethrower",
  "/wiki/Blaster_pistol",
  "/wiki/Holster",
  "/wiki/Concussion_grenade",
  "/wiki/Clothing",
  "/wiki/Fire",
  "/wiki/Riftiaworm",
  "/wiki/Plasteel",
  "/wiki/Helmet",
  "/wiki/Martin_Wilde",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:Cardo",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Crimson_Reign_1",
  "/wiki/Crimson_Reign_4",
  "/wiki/Bounty_Hunters_24",
  "/wiki/Bounty_Hunters_25",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Crimson_Reign_5",
  "/wiki/The_Rise_of_Kylo_Ren_1",
  "/wiki/The_Rise_of_Kylo_Ren_2",
  "/wiki/The_Rise_of_Kylo_Ren_3",
  "/wiki/The_Rise_of_Kylo_Ren_4",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Kylo_Ren_vs._Resistance_Rebels",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/The_Rise_of_Skywalker_Adaptation_1",
  "/wiki/LEGO_Star_Wars_Terrifying_Tales",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Episode_IX:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Kylo_Ren_and_Other_Followers_of_the_Dark_Side",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/December_20"
 ]
}