{
 "name": "Carh'la Bastra",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rebel Alliance",
      "Alliance Intelligence",
      "Alliance Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Carh'la Bastra was a female Twi'lek who served as a Captain in Rebel Alliance Intelligence during the Galactic Civil War.\nAfter the Battle of Yavin, Captain Carh'la Bastra was stationed in Anchorhead, on the planet Tatooine, where she recruited new members to join the Rebellion's cause. Her immediate superior was Special Agent Wilson Tchorshel. During that time, she worked closely with Droma Ordo, another Rebel Alliance member in Anchorhead. She was also associated with the White Thranta Shipping Company, a front for illegal activities of Jabba the Hutt's criminal organization. The company smuggled most of its goods to the Rebellion.\nIn 1 ABY, Bastra was tasked with finding a cargo arrived recently from Tansarii Point Station. The cargo was now lost among the various denizens on Tatooine and both Rebel and Imperial Intelligence were very interested in finding it. Fortunately, a spacer agreed to help Bastra, instead of Imperial Commander Barrezz.\nCaptain Bastra first tasked the spacer with finding the inventory of the cargo content that was acquired by a group of Jawa traders. The Jawas had recently been spotted at Tosche Station, near Anchorhead. There, the spacer learned from the manager Cuan Talon that he should ask his warehouse manager Janus but the latter had already been killed by Desert Demons. From Janus' datapad, the spacer recovered the first part of the cargo data and discovered that the Jawa had also visited the Lars homestead. At the homestead, Zef Ando agreed to give the inventory of what he bought from the Jawas. The spacer finally reached the Jawa sandcrawler in the Western Dune Sea but it was under attack from Tusken Raiders. The spacer attacked the Tusken Raiders and rescued the Jawas and the droid FA-2PO. The spacer later recovered Jawa encryption keys from the Tusken Raiders and finally accessed to the sandcrawler database.\nBastra then tasked the spacer with going to the Valarian Depot near Bestine. It turned out that the Valarian crime syndicate acquired a portion of the lost cargo. Despite the number of guards patrolling the depot, the spacer did a complete inventory, by checking the manifests on the cargo pallets. Bastra immediately tasked the spacer with going to the Darklighter cache near their estate as it appeared that some of the cargo ended up in their hands. However, the Darklighter guard Draci informed the spacer that Desert Demon had overrun the cave. The spacer fought his way in the cache and managed to do a complete inventory.\nCarh'la Bastra then requested the spacer to deliver the data to her slicer, Jem Lavar. The spacer had first to rescue Lavar from a group of gunrunners. Jem Lavar analyzed the inventory data from the Jawas, the Darklighter and the Valarians and finally discovered that the R2 unit that both the Empire and the Rebellion were looking for was bought by the junk dealer Watto.\nThe spacer was tasked by Bastra to retrieve the droids and thus headed to Watto's Shop in Mos Espa. There, the spacer learnt that the droids was already sold in spare parts. Nevertheless, Watto agreed to re-assemble the droid if the spacer was able to get all the parts. The spacer obtained the droid body from Ji'Ni Sil in the Jawa Mountain Fortress, the legs from Syndil Na'Marr and a Bothan pilot, the motivator from one of An'Kwee's death podracer pilot friend, the motivator booster controller from Pah and his gang, the diagnostic controller in the Squill Cave, and finally the head from Jabba the Hutt's supervisor droid EV-9D9. When the spacer returned to the shop with all parts, Watto finally helped re-assemble the droid. From the reassembled droid, the spacer was able to recover the information both the Empire and the Rebellion were looking for. Carh'la Bastra ordered the spacer to immediately transmit the data to Special Agent Tchorshel on Naboo.\nCarh'la Bastra was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Carh'la Bastra was added to the game as part of the \"Legacy Quest\" with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Captain/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Anchorhead/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Special_Agent/Legends",
  "/wiki/Wilson_Tchorshel",
  "/wiki/Droma_Ordo",
  "/wiki/White_Thranta_Shipping_Company",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Smuggler/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Arlan_Barrezz",
  "/wiki/Sand_Crawler_345",
  "/wiki/Jawa/Legends",
  "/wiki/Tosche_Station/Legends",
  "/wiki/Cuan_Talon",
  "/wiki/Janus",
  "/wiki/Desert_Demons",
  "/wiki/Datapad/Legends",
  "/wiki/Lars_homestead",
  "/wiki/Zef_Ando",
  "/wiki/Western_Dune_Sea/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/FA-2PO",
  "/wiki/Valarian_Depot",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Valarian_Syndicate",
  "/wiki/Darklighter_family",
  "/wiki/Darklighter_cache",
  "/wiki/Darklighter_estate",
  "/wiki/Draci",
  "/wiki/Slicer/Legends",
  "/wiki/Jem_Lavar",
  "/wiki/R2-series_astromech_droid",
  "/wiki/Junk_dealer/Legends",
  "/wiki/Watto/Legends",
  "/wiki/Wald%27s_Parts",
  "/wiki/Mos_Espa/Legends",
  "/wiki/Ji%27Ni_Sil",
  "/wiki/Jawa_Mountain_Fortress",
  "/wiki/Syndil_Na%27Marr",
  "/wiki/Bothan/Legends",
  "/wiki/Motivator/Legends",
  "/wiki/An%27Kwee",
  "/wiki/Podracing/Legends",
  "/wiki/Hilbrun",
  "/wiki/Squill_Cave",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Supervisor_droid/Legends",
  "/wiki/EV-9D9/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}