{
 "name": "Carn",
 "display_name": "Carn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "Galactic Alliance Security",
      "Galactic Alliance Security"
     ]
    }
   ]
  }
 ],
 "content": "Carn was a Human male sergeant in Galactic Alliance Security under the command of Captain Savar. He was present during the arrest of Jedi Grand Master Luke Skywalker in 43.5 ABY. During the arrest, a Security trooper, Bessen, fired at Skywalker. The shot missed, and Savar rebuked the trooper. He then ordered Carn to oversee Bessen's punishment. Carn was later present during the hunt for Jedi Knight Valin Horn, who had gone on a rampage through the galactic capital of Coruscant after suffering a psychotic breakdown. After Horn was caught, Savar ordered Carn to find a civilian vehicle in order to transport Horn to a nearby medical center.\nCarn was a male Human who served in Galactic Alliance Security, a Galactic Federation of Free Alliances military force based on the galactic capital of Coruscant. In the Security forces, he served as a sergeant under the command of Captain Savar. In 43 ABY, Carn was part of Savar's Security forces sent to apprehend Jedi Grand Master Luke Skywalker for failing to prevent former Jedi Knight Jacen Solo's fall to the dark side of the Force. During the arrest, former smuggler Han Solo insulted Savar, causing the captain to stiffen. One of the bounty hunters hired to assist in the arrest, the Quarren Dhidal Nyz, assumed that Skywalker was trying to use the Force on the captain, and exclaimed that the prisoner was resisting. This caused one of the troopers, Bessen, to inadvertently fire off a shot at Skywalker. The shot missed, and the situation was quickly brought under control. Savar punished Bessen, and ordered Carn to watch the trooper do two hundred push-ups and then run back to the Galactic Alliance Security blockhouse on foot. Meanwhile, the captain took Skywalker to the blockhouse via transport.\nShortly thereafter, Jedi Knight Valin Horn, who had come down with a disease that led him to believe that everyone he knew had been replaced with an impostor, was apprehended and placed in the Jedi Temple. He escaped soon after, however, and went on a destructive rampage through Coruscant. Galactic Alliance Security forces were issued a warrant for the arrest of Horn, and Carn, again under the commanded of Savar, rushed to the scene. Horn, however, was captured by Skywalker, who had recently been released from prison. Savar and Skywalker negotiated over what to do with Horn; Skywalker thought he should go back to the Jedi Temple, whereas Savar believed that he was rightfully a prisoner of the Galactic Alliance. They eventually agreed to put him in the Mon Mothma Memorial Medical Center, which was close to equidistant between the Temple and Security headquarters. Savar ordered Carn to commandeer a civilian vehicle capable of carrying at least fifteen beings to take Horn to the Medical Center.\nCarn was loyal and often eager to please his superior officer, Captain Savar. He trusted Savar, and willingly followed the captain's orders without question.\nCarn made his only appearance as a minor character in Aaron Allston's Outcast, the first novel in the nine-part Fate of the Jedi series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Sergeant/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Savar",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/43_ABY",
  "/wiki/Trooper/Legends",
  "/wiki/Bessen",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Valin_Horn",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Force_psychosis",
  "/wiki/Mon_Mothma_Memorial_Medical_Center",
  "/wiki/Darth_Caedus",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Dhidal_Nyz",
  "/wiki/The_Force/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Galactic_Alliance_Security_blockhouse",
  "/wiki/New_Jedi_Temple",
  "/wiki/Prison/Legends",
  "/wiki/Aaron_Allston",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)"
 ]
}