{
 "name": "Carson_Teva",
 "display_name": "Carson Teva",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic",
      "New Republic Starfighter Corps",
      "New Republic Starfighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "Carson Teva was a human male captain who served in the Rebel Alliance and later within the New Republic Starfighter Corps flying a T-65B X-wing starfighter. While patrolling in the Outer Rim in 9 ABY, he and fellow New Republic pilot Trapper Wolf approached the gunship Razor Crest, questioning why the starship's transponder was not emitting. The Crest's pilot, the Mandalorian bounty hunter Din Djarin, explained that the vessel was pre-Galactic Empire and promised to fix his issue. Teva then requested a ping from Djarin, which the Mandalorian eventually transmitted reluctantly. Wolf then connected the Razor Crest to a heist on a New Republic Correctional Transport and Djarin attempted to flee.\nTeva and Wolf pursued the Razor Crest through the atmosphere of the planet Maldo Kreis but eventually lost visual of the starship. Running tabs on the gunship after, the pair learned of some selfless actions Djarin made on the correctional transport. They found the Crest after and rescued it from a swarm of knobby white ice spiders. Teva explained to Djarin what he and Wolf had learned about the Mandalorian and let the bounty hunter walk free, departing on their X-wing starfighters.\nTeva and a wingmate later went to the planet Nevarro and the captain questioned Magistrate Greef Karga about the destruction of a base and a possible detection of the Razor Crest. Karga answered Teva's inquiries, and promised to contact the captain if there was any anything to add. Teva then talked with the ex-rebel Cara Dune, offering her a chance to help the New Republic quash the Imperial presence in the Outer Rim, which she silently refused.\nWhile patrolling above the planet Tatooine, Teva and Lieutenant Reed encountered Djarin again. While Reed wanted to use further force with the Mandalorian and his fighter, the captain chose to let the bounty hunter off, attempting to bargain for answers regarding the prior incident on Nevarro.\nCarson Teva served in the Rebel Alliance against the Galactic Empire by the time of the destruction of the planet Alderaan in 0 BBY. During the reign of the New Republic, he served as a captain in the New Republic Starfighter Corps, flying a T-65B X-wing starfighter. Teva became suspicious of activity from remnants of the Empire in the Outer Rim, which the New Republic did not believe at the Core Worlds.\nIn 9 ABY, Teva was based at Adelphi station, a space station and New Republic staging outpost orbiting the planet Adelphi that acted as the surveillance and relay station for its sector. He and fellow New Republic pilot Trapper Wolf were sweeping for holdouts of the Empire in the Outer Rim Territories. The pair came across the gunship Razor Crest near the planet Maldo Kreis. As the starship's transponder was not emitting, Teva reached out to the starship over comms, him and Wolf flying either side of the vessel. The gunship's pilot, the Mandalorian Din Djarin, replied and came to explain the Razor Crest was pre-Empire and so did not need to run a beacon. Teva, though, corrected him that the New Republic had new rules requiring all craft to run beacons. Djarin acknowledged Teva's statement, promising to get on setting up a beacon, and both prepared to part ways.\nTeva, though, continued, asking for Djarin to send him and Wolf a ping to ensure the pair that he was not affiliated with the Empire. The Mandalorian stalled, claiming the required hardware on his ship was offline and then specifying that it was not working. Teva told the bounty hunter to follow the New Republic pilots to the Adelphi outpost if the pair could not confirm he was not Imperial. Djarin then transmitted his ping, but Teva heard him whispering and asked what that was, the Mandalorian giving an excuse for it. Having received the ping from the Razor Crest, Wolf asked Teva to move to channel two and the pair connected Djarin to a prisoner breakout aboard the New Republic Correctional Transport Bothan-5.\nAs the New Republic pilots unlocked the s-foils on their X-wing starfighters, Teva asked the Mandalorian if the Crest had been in proximity of Bothan-Five. That was when the Razor Crest broke away from the X-wings, flying towards Maldo Kreis. Teva and Wolf follow in pursuit, and the former asked Djarin to stand down, threatening to fire on his ship. Teva remarked to his wingmate that the Crest might break apart in the atmosphere due to its age. Following the Razor Crest into some glacier canyons, Teva asked Djarin again to stand down, but lost visual of the gunship and ordered Wolf to head north to cover more ground.\nHaving lost the Razor Crest, Teva and Wolf ran tabs on the vessel, learning that there was an arrest warrant on Djarin for abducting a prisoner on Bothan-Five. However, the pair also discovered from Bothan-Five's security records that the Mandalorian had helped capture three other priority culprits who were involved in the heist as well as attempting to save the life of Lieutenant Lant Davan. Teva and Wolf soon found the Razor Crest through a hole in the surface of Maldo Kreis, being swarmed by knobby white ice spiders. Both pilots fired on the spiders and landed, using their A280 blaster rifles to finish with the smaller creatures.\nDjarin exited his damaged ship to meet the pilots, and Teva explained what he and Wolf had found when running tabs on the Razor Crest, asking if the information was true. After the Mandalorian asked if he was under arrest, Teva implied that this was not the case. Djarin then requested the the pilots help fix the Razor Crest's hull to forego the bounties on the three criminals the Mandalorian helped apprehend. Teva, though, asked that the bounty hunter fix his transponder in case he came across a New Republic patrol again. The New Republic pilots then seated themselves into their X-wings and departed the scene.\nA short while later, Teva and a wingmate traveled to the volcanic planet Nevarro, where a base controlled by an Imperial remnant had recently been destroyed. He visited Nevarro City, run by the Magistrate Greef Karga, whose transponder logs had recorded the presence of the Razor Crest. Teva questioned Karga about the base's destruction and the Razor Crest, but the magistrate claimed to not recall remembering anything prior to the event and stated that his control droid could not tell apart anything pre-Empire like the Crest. After the captain asked if there was anything else to add, Karga assured that he would receive a gram if there was anything.\nAfter parting from Karga, Teva approached the city Marshal Cara Dune, who he had learned from her records had been a soldier in the Alliance. The captain offered Dune a place in the New Republic, but the marshal refused. Teva then explained his suspicions of Imperial activity in the Outer Rim, stressing that local support was key to solving the problem. After Dune silently denied his appeal, he then pointed out that she was from Alderaan, asking who she had lost during the planet's destruction. The marshal claimed she had lost everyone during the disaster, and the captain gave his condolences before leaving a marshal's rank plaque with her and going back to his X-wing.\nSometime later, Teva and Lieutenant Reed carried out a patrol in X-wings above the desert planet Tatooine. During their visit, they noticed a rebuilt N-1 starfighter flying very fast next to a passenger liner, which was against New Republic rules. Teva and Reed pulled the N-1 fighter over and Reed questioned its pilot, who stalled with the lieutenant's inquiries. Teva recognized the pilot's voice as Din Djarin, stopping Reed from taking manual control of the starfighter and letting the Mandalorian off with a warning.\nTeva then went on and connected questioned Djarin's association with the Imperial remnant incident on Nevarro, as Djarin's former vessel the Razor Crest had been reportedly involved. When the captain asked the Mandalorian to answer some questions for him, Djarin used the N-1's thrusters to shoot him away from the X-wings. Reed thought the starfighter had jumped into hyperspace but Teva cleared up the situation for the lieutenant, who wondered whether they should report the N-1 fighter. The captain sarcastically asked Reed whether he wanted to fill out reports at their base all day, which the lieutenant laughingly declined.\nCarson Teva was a human male who stood at 1.75 meters  with tan skin and gray and white hair. A man of honor, he believed in the New Republic and was respected by his peers. While chasing Djarin with his wingmate Trapper Wolf, he was reluctant to fire on him even as he fled from them but continued to threaten the prospect in an attempt to make the Mandalorian stand down. Having learned of the Djarin's selfless actions on Bothan-Five after, Teva chose to let the bounty hunter go, claiming that it was trying times.\nThe captain worried that the Imperial presence in the Outer Rim was becoming a threat and concluded that local assistance was a necessary deterrent to solve his issue. Upon learning Cara Dune was from Alderaan, Teva realized that she had lost people in the planet's destruction and offered his condolences when she claimed that she had lost everyone at that time. Upon encountering Djarin a second time, Teva recognized the Mandalorian's voice and was sure to be lenient on him over obstruction of rules and did not intend on reporting the bounty hunter. Wanting to connect dots with the Imperial remnant incident on Nevarro, he tried to get Djarin to answer some questions to no avail.\nTeva wore an orange flight suit with synth-leather reinforced pilot boots and a blue helmet with the New Republic insignia painted on in yellow. He flew a T-65B X-wing starfighter and utilized an A280 blaster rifle with effectiveness when combating creatures on Maldo Kreis. Teva used a notepad to take notes when interviewing Karga and had an Alliance badge, which he gave to Dune.\nCarson Teva was first pictured in an X-wing in the official trailer for season two of the live-action television series The Mandalorian, which was released on YouTube on September 15, 2020. He then appeared in \"Chapter 10: The Passenger\" of the show, which was directed by Peyton Reed and released on November 6, 2020 on Disney+. The pilot was credited as \"Captain Carson Teva\" and portrayed by Paul Sun-Hyung Lee, an award-winning Korean-Canadian actor who also had a hobby in making Star Wars and Ghostbusters cosplay.\nAccording to Lee, The Mandalorian's executive producer Dave Filoni discovered the actor after Filoni's wife Anne began watching Kim's Convenience, a show which Lee was known for. The producer became a fan of the show and chose to write a part for Lee in season two of The Mandalorian. One of The Mandalorian Season One directors Deborah Chow knew the Kim's Convenience actor from around 25 years before, and began attempting to contact Lee, eventually crossing paths with him at a the Unforgettable Gala in Los Angeles in 2018.\nLee said he was in disbelief when Chow told him about Filoni wanting to write him a part, but had the director send photos of Lee's cosplay to the producer, who joked that Lee could just show up to set in his own costume. Three weeks later, Lee was invited on set by Chow during the filming of The Mandalorian Season One, where the actor met the showrunner Jon Favreau. Lee also watched the filming of scenes from Filoni's \"Chapter 5: The Gunslinger\" and Chow's \"Chapter 7: The Reckoning\" at Manhattan Beach and Filoni gave him a tour of the season one sets after, Lee returning the favor with a tour of the Kim's Convenience sets.\nAfter some more months passed, the actor learned from Chow that she had advised the producer to write a bigger part for him, but he still held doubt that his part would come to fruition. That was until October 2019 when Lucasfilm asked Lee's agent for the actor's availability. Lee promised he would do what ever it took to be available as long as it did not clash with production for Kim's Convenience. He was given thereafter his character's codename, \"foodie pilot.\" It was planned that Filoni or Favreau would call him about his role, but Lee missed Favreau's first attempt to call the actor. When he finally was able to speak with Favreau, the show runner told him about \"Carson.\"\nAccording to Lee, he flew down to the set soon after his call with Favreau and was almost immediately taken to the wardrobe to get his costume fitted. Lee's costume was tailor made for him with a custom painted helmet, he used his costume making skills to help the wardrobe experts helping with The Mandalorian with buckling ejection harnesses and other aspects of his new costume. When the wardrobe department wanted a reference photo of Lee in his X-wing pilot costume, they lent him the pilot helmet used as that of Biggs Darklighter—a minor character from George Lucas' 1977 film Star Wars: Episode IV A New Hope—as his on set prop helmet was still being painted. After, Favreau gave Lee a tour of the sets for season two, which occurred sometime prior to the debut of season one.\nBeing given more information about \"Carson\" by his script, Lee chose to base the character off of marshals of the Old American West, modeling him as a street-smart lawman and survivor who made his own rules and did not expect a great amount of help. Lee's first shoot was for Carl Weathers' \"Chapter 12: The Siege,\" and after meeting Weathers, the actor first did the scene where \"Carson\" exchanged with Gina Carano's Cara Dune. In his second shoot, in February of 2020 in Los Angeles, California, he filmed scenes for \"Chapter 10: The Passenger\" using the repurposed X-wing set which had been used in Gareth Edwards' 2016 film Rogue One: A Star Wars Story.\nThe X-wing set used practical lights and controls, which were largely smartphone screens slotted into the dashboard to project video screens. Around the X-wing set was an LED screen which projected a simulated star field backdrop around Lee, and the spacecraft model he sat in rocked, coming across very realistic for the actor. Reed directed the actor to imitate a real life aircraft pilot. Filoni reprised his role as Trapper Wolf to be the wingmate as Chow, who was originally suggested to be the wingmate as Sash Ketter, was busy with her show Obi-Wan Kenobi.\nA lot of the footage shot from the X-wing set was ultimately not used in Chapter 10. Filoni messaged Lee after the filming about choosing his character's last name, and the actor accepted Filoni's first suggestion \"Teva.\" After the release of \"Chapter 10: The Passenger,\" Lee received flurry of responses from his fans and co-workers. The actor himself watched his debut with his family. He told CBC News that a Korean-Canadian like him making it into Star Wars provided hope that dreams come true.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Carson",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Starfighter_Corps",
  "/wiki/Captain",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Outer_Rim_Territories",
  "/wiki/9_ABY",
  "/wiki/New_Republic_pilot",
  "/wiki/Trapper_Wolf",
  "/wiki/Gunship",
  "/wiki/Razor_Crest",
  "/wiki/Starship",
  "/wiki/Transponder",
  "/wiki/Pilot",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Galactic_Empire",
  "/wiki/Rescue_of_Qin",
  "/wiki/Bothan-5",
  "/wiki/Atmosphere",
  "/wiki/Planet",
  "/wiki/Maldo_Kreis",
  "/wiki/Prison",
  "/wiki/Transport",
  "/wiki/Knobby_white_ice_spider",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/X-wing_starfighter",
  "/wiki/Nevarro",
  "/wiki/Magistrate",
  "/wiki/Greef_Karga",
  "/wiki/Second_skirmish_on_Nevarro",
  "/wiki/Nevarro_Imperial_base",
  "/wiki/Carasynthia_Dune",
  "/wiki/Tatooine",
  "/wiki/Lieutenant",
  "/wiki/Reed",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/0_BBY",
  "/wiki/New_Republic_Era",
  "/wiki/Core_Worlds",
  "/wiki/New_Republic_staging_outpost",
  "/wiki/Space_station",
  "/wiki/Orbit",
  "/wiki/Adelphi",
  "/wiki/Sector",
  "/wiki/New_Republic_Correctional_Transport",
  "/wiki/Qin",
  "/wiki/Lant_Davan",
  "/wiki/A280_blaster_rifle",
  "/wiki/Volcano",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Nevarro_City",
  "/wiki/City",
  "/wiki/Marshal",
  "/wiki/Rebel_trooper",
  "/wiki/Desert",
  "/wiki/Din_Djarin%27s_N-1_starfighter",
  "/wiki/Passenger_liner",
  "/wiki/N-1_starfighter",
  "/wiki/Hyperspace",
  "/wiki/Hair",
  "/wiki/Time",
  "/wiki/Flight_suit",
  "/wiki/Synth-leather",
  "/wiki/Boot",
  "/wiki/Helmet",
  "/wiki/Blaster_rifle",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/The_Mandalorian",
  "/wiki/September_15",
  "/wiki/2020",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/Peyton_Reed",
  "/wiki/November_6",
  "/wiki/Disney%2B",
  "/wiki/Paul_Sun-Hyung_Lee",
  "/wiki/Star_Wars",
  "/wiki/Dave_Filoni",
  "/wiki/The_Mandalorian_Season_One",
  "/wiki/Deborah_Chow",
  "/wiki/2018",
  "/wiki/Jon_Favreau",
  "/wiki/Chapter_5:_The_Gunslinger",
  "/wiki/Chapter_7:_The_Reckoning",
  "/wiki/October",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Biggs_Darklighter",
  "/wiki/George_Lucas",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Carl_Weathers",
  "/wiki/Chapter_12:_The_Siege",
  "/wiki/Gina_Carano",
  "/wiki/February",
  "/wiki/Gareth_Edwards",
  "/wiki/2016",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Sash_Ketter",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Category:Images_of_Carson_Teva",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/The_Mandalorian_Season_Three",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Carson%27s_Convenience",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/November_7",
  "/wiki/November_8"
 ]
}