{
 "name": "Cassie Cryar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Terrelia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Terrelian Jango Jumper"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.82 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "50 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Turquoise"
     ]
    }
   ]
  }
 ],
 "content": "Cassie Cryar was a female Terrelian Jango Jumper who lived on Coruscant during the Clone Wars. As a Terrelian Jango Jumper, Cryar possessed advanced skills in acrobatics and agility. Using these natural gifts, Cryar made a living as a thief in the Coruscant underworld with her accomplice, Ione Marcy. During one of her operations, Cryar assisted Marcy in the murder of her boyfriend, a Trandoshan assassin by the name of Nack Movers. The two then ransacked Movers' apartment, looting a lightsaber which Movers had recently purchased from a petty pickpocket while planning to leave Coruscant and start a life together\nWhen the Jedi Padawan Ahsoka Tano, the original owner of the lightsaber, and Jedi Master Tera Sinube arrived at the condo of Mover's girlfriend to retrieve the stolen Jedi weapon, Cryar fled the scene, prompting Tano to pursue. Cryar eluded Tano with her natural gifts of agility and speed long enough to escape the Padawan with the assistance of Marcy, fleeing to a train station in Marcy's speeder in an attempt to lose the Jedi. However, using a tracking beacon, Sinube tracked the two thieves to the station and attempted to apprehend the pair. Cryar fled onto one of the departing hovertrains with Tano still in pursuit, leading to a short stand-off when the desperate Terrelian took hostages in order to keep Tano at bay. However, when the train came to a halt, Sinube was already waiting; the elderly Jedi Master disarmed Cryar, and she was taken into custody, the stolen lightsaber having been retrieved by Tano.\nCassie Cryar was a female Terrelian Jango Jumper who hailed from the planet Terrelia. At some point prior to the Clone Wars, Cryar came to live on the galactic capital world of Coruscant, taking up residence in the planet's underworld, where, over time, she made a comfortable living for herself as a criminal.\nHer inherent speed and agility that came with being a member of the Terrelian race allowed her to avoid Galactic Republic law enforcement. During her life of crime on Coruscant, Cryar met the young Ione Marcy, and the two became close to each other.\nIn 21 BBY, Marcy's boyfriend, a Trandoshan assassin by the name of Nack Movers, obtained a stolen lightsaber from a pickpocket that had previously belonged to the Jedi Padawan Ahsoka Tano. Tano, with the help of the elder Jedi Master Tera Sinube, tracked her lightsaber to Movers' apartment. Cryar and Marcy had already killed the Trandoshan criminal, however, and when Tano searched the apartment, discovered Cryar hiding in another room with the stolen saber. Cryar punched her to the ground before attempting to attack the Jedi Padawan with her own lightsaber, but was unfamiliar with the weapon and unable to activate it; when Ahsoka exclaimed in shock at the lightsaber being hers, Cryar realized she was a Jedi and panicked. Kicking out a window, Cryar led Tano on a harrowing chase over the Coruscant rooftops. Sinube remained at the apartment with Marcy, who doubted the girl's claimed innocence in Movers' murder.\nDiscovering how to operate the Jedi's weapon amid her escape effort, Cryar used the green-bladed lightsaber to cut down exterior fixtures in an attempt to block Tano's path and halt her pursuit. However, to Cryar's surprise and frustration, the Togruta Padawan proved unshakable, following Cryar as she leaped onto a floating billboard and continued onto a second in a series of repulsorlift-equipped advertisements that stretched across the wide gap between skyscrapers; Cryar used the stolen lightsaber to damage the billboards' repulsorlift generator, temporarily stranding the Padawan before she leaped onto a passing airspeeder and continued the chase. Tano nearly sent Cryar falling to her doom when she ripped a pipe Cryar had been climbing down using the Force, leaving her dangling over a busy Coruscant skylane. Cryar, though, simply climbed on top of the long segment of pipe, and jumped from it into a speeder driven by Ione Marcy, who had fled when a unit of CSF police droids arrived at the apartment. Together, the pair escaped the Padawan's pursuit and traveled to one of Coruscant's many hovertrain stations, intending to reach the station before the Jedi or the police, blend in among the large crowds of beings, and escape on a train and later get a ship off world.\nUnfortunately for Cryar and her accomplice, Master Sinube had planted a homing beacon on Marcy while still at the apartment, and together he and Tano followed the duo to the station. Cryar discovered the device and subsequently destroyed it before spotting Tano in the crowd. She destroyed a pair of police droids who attempted to arrest her at the Jedi's order, and leaped onto the train as it departed the station, abandoning Marcy in the process. Tano again followed, and Cryar broke into the train's interior through a side window, taking a female Twi'lek and her child hostage with the lightsaber as the Padawan closed in on her. Tano requested a trade, wherein the hostages would be released for her, but knowing the Jedi's ability to use the Force, Cryar refused. When the train stopped at the next station along its route, however, Sinube was waiting and disarmed the untrained Terrelian with his own lightsaber as the hostages ran before knocking Cryar unconscious with his cane. Cryar was then taken into custody by a group of CSF police droids, and the lightsaber she had stolen was recovered by Tano.\nCassie Cryar's heritage as a Terrelian Jango Jumper afforded her impressive physical abilities that made her a tireless sprinter and exceptionally agile. She could leap vast distances comparable to a Jedi's Force-amplified jumps, despite not being Force-sensitive. In fact, Cryar believed  that with her racial abilities, coupled with her use of Ahsoka Tano's stolen lightsaber, she was just as strong as any Jedi. As a Terrelian, Cryar was blue-skinned and long-limbed, and her hands had a strong grip. She chose to hide her face behind a mask of white bone, segmented at the mouth, and tied her red hair atop her head in a topknot. Cryar was bold, unafraid of falling from the great heights of Coruscant's rooftops that others would consider dizzying, but was also prone to acting without thinking, evident when she threatened Ahsoka Tano with the Padawan's lightsaber without any training in how to operate it, or even the knowledge of how to turn the weapon on; she also had a tendency to swing the stolen lightsaber carelessly at surrounding objects and people, apparently without realizing the damage she could do to herself and others. Cryar also took a pair of hostages aboard a moving hover train when confronted by Tano, desperate and with nowhere else to run. She maintained a friendship with a fellow female resident of Coruscant's underworld named Ione Marcy, but abandoned her when faced with the threat of arrest.\nCassie Cryar appeared in the eleventh episode of The Clone Wars television series' second season, entitled \"Lightsaber Lost.\" Voiced by actress Jaime King, Cryar was a featured bounty hunter in the season's Rise of the Bounty Hunters storyline. King, who had previously voiced bounty hunter Aurra Sing for the show, was drawn to the role for the character's strength. King does not consider Cryar to be a bad person, believing that she is only doing what she needs to do to survive. Despite being referred to as a bounty hunter once by Tera Sinube, Cryar's actions during the episode itself are only those of a thief, and she does not engage in any bounty hunting during the course of the plot.\nThe design of Cassie Cryar was based on one of Iain McCaig's early Sith concepts for the 1999 film Star Wars: Episode I The Phantom Menace, the first installment of the Star Wars prequel trilogy.\nThough not a unanimous opinion, some viewers of \"Lightsaber Lost,\" including several on a Jedi Council Forums thread, noted subtext that suggested Cassie Cryar and Ione Marcy were in a romantic relationship. In 2016, Pablo Hidalgo stated on his Twitter account that they were written to be a couple.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cassilyda_Cryar",
  "/wiki/Cassie_Cryar",
  "/wiki/Terrelia/Legends",
  "/wiki/Terrelian_Jango_Jumper/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Kilogram/Legends",
  "/wiki/Color/Legends",
  "/wiki/File:TerellianJangoJumper1-LL.ogg",
  "/wiki/Coruscant/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Ione_Marcy/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Nack_Movers/Legends",
  "/wiki/Ione_Marcy%27s_apartment",
  "/wiki/Ahsoka_Tano%27s_lightsaber/Legends",
  "/wiki/Bannamu/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Tera_Sinube/Legends",
  "/wiki/Train_station/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Homing_beacon/Legends",
  "/wiki/Hovertrain/Legends",
  "/wiki/Sun_djem/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Planet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Death/Legends",
  "/wiki/Window/Legends",
  "/wiki/Togruta/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Skyscraper/Legends",
  "/wiki/Repulsorlift_generator/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Skylane/Legends",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Police_droid/Legends",
  "/wiki/6-B_hover_train",
  "/wiki/Sai_tok/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Tera_Sinube%27s_sabercane",
  "/wiki/Sabercane",
  "/wiki/Force_Jump",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Bone/Legends",
  "/wiki/Jaime_King",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Lightsaber_Lost",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Iain_McCaig",
  "/wiki/Sith/Legends",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Jedi_Council_Forums",
  "/wiki/2016",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Category:Images_of_Cassie_Cryar",
  "/wiki/The_Art_of_Star_Wars:_The_Clone_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.6",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.7",
  "/wiki/Star_Wars:_The_Clone_Wars:_New_Battlefronts:_The_Visual_Guide",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(video_game)",
  "/wiki/The_Clone_Wars:_Masters_of_the_Force",
  "/wiki/Star_Wars_Insider",
  "/wiki/100_and_Counting",
  "/wiki/Star_Wars_Insider_139",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.47",
  "/wiki/Star_Wars:_The_Clone_Wars_Magazine_19",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars_Character_Encyclopedia",
  "/wiki/Star_Wars:_The_Clone_Wars:_Head-to-Head",
  "/wiki/Star_Wars_Annual_2011",
  "/wiki/June_12",
  "/wiki/2021",
  "/wiki/File:CassieCryar_IoneMarcy_PabloHidalgo_tweet.png"
 ]
}