{
 "name": "Cassilyda Cryar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Terrelia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Terrelian Jango Jumper"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.82 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Turquoise-blue"
     ]
    }
   ]
  }
 ],
 "content": "Cassilyda \"Cassie\" Cryar was a female Terrelian Jango Jumper criminal who lived on the planet Coruscant during the Clone Wars.\nCassilyda \"Cassie\" Cryar, a female Terrelian Jango Jumper from Terrelia, operated as a thief in the underworld on the planet Coruscant during the Clone Wars. She was hired as an assistant and bodyguard by Nack Movers, a Trandoshan hitman whom the Coruscant Security Force had tried and failed to bring to justice for his string of murders using Sennari poison. He lived in an apartment with his girlfriend, a Salenga criminal named Ione Marcy. Despite Movers' paranoia, he failed to notice Marcy and Cryar grow close to each other and become partners. Ignoring Marcy's entreaties to him, the lecherous Movers propositioned Cryar. The two women subsequently plotted to kill him.\nSometime after Movers had acquired Jedi Padawan Ahsoka Tano's stolen lightsaber, his drink was poisoned by Cryar and Marcy using the same poison he used on his targets. As he convulsed and died, his claws raked across a painting of the three beings together. While Cryar and Marcy were still in Movers' apartment after ransacking it, they were discovered by Tano and Jedi Master Tera Sinube, who had questioned the thief Bannamu after he had stolen and sold Tano's lightsaber. Using her natural agility, Cryar escaped the apartment with the lightsaber, but she was pursued across the skyline by Tano. Marcy was able to escape the apartment as well when the police arrived, and take her speeder to reunite with Cryar. They fled to a train station, and Cryar took hostages as Tano pursued her across a hovertrain. After the train stopped, Cryar attempted to use Tano's lightsaber, but the weapon was easily disarmed by Sinube. The couple was captured by the Jedi and placed under arrest by the GU-series Guardian police droids.\nCassie Cryar appeared in \"Lightsaber Lost,\" an episode of Star Wars: The Clone Wars television series that was part of the second season's Rise of the Bounty Hunters storyline in 2010. She was voiced by Jaime King, who was drawn to the role for Cryar's strength. She doesn't consider Cryar to be a bad person, believing that she is only doing what she needs to do to survive.\nThe design of Cassie Cryar harkens back to one of Iain McCaig's early Sith concepts for the 1999 film Star Wars: Episode I The Phantom Menace.\nIn the years after \"Lightsaber Lost\" aired, some viewers posted in venues such as the Jedi Council Forums that there appeared to be romantic subtext between Cassie Cryar and Ione Marcy. Pablo Hidalgo mentioned via his Twitter account in 2016 that they were written to be a couple. He subsequently wrote the 2018 reference book Star Wars: Scum and Villainy: Case Files on the Galaxy's Most Notorious, which made this detail more apparent and gave Cryar the full first name \"Cassilyda.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Cassilyda_Cryar",
  "/wiki/Cassie_Cryar",
  "/wiki/Lightsaber_Lost",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Terrelia",
  "/wiki/Terrelian_Jango_Jumper",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/File:TerellianJangoJumper1-LL.ogg",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Clone_Wars",
  "/wiki/Thief",
  "/wiki/Coruscant_Underworld",
  "/wiki/Nack_Movers",
  "/wiki/Trandoshan",
  "/wiki/Assassin",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Sennari",
  "/wiki/Poison",
  "/wiki/Nack_Movers%27s_residence",
  "/wiki/Salenga",
  "/wiki/Ione_Marcy",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Lightsaber",
  "/wiki/Foodstuff",
  "/wiki/Claw",
  "/wiki/Jedi_Master",
  "/wiki/Tera_Sinube",
  "/wiki/Bannamu",
  "/wiki/Ahsoka%27s_lightsabers",
  "/wiki/Skyscraper",
  "/wiki/Speeder",
  "/wiki/Train_station",
  "/wiki/Hovertrain",
  "/wiki/GU-series_Guardian_police_droid",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/2010",
  "/wiki/Jaime_King",
  "/wiki/Iain_McCaig",
  "/wiki/Sith",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Jedi_Council_Forums",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2016",
  "/wiki/2018",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_12",
  "/wiki/Databank_A-Z",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/June_12",
  "/wiki/2021",
  "/wiki/File:CassieCryar_IoneMarcy_PabloHidalgo_tweet.png"
 ]
}