{
 "name": "Cato_Parasitti",
 "display_name": "Cato Parasitti",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zolan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Clawdite"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.79 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cad Bane's group"
     ]
    }
   ]
  }
 ],
 "content": "Cato Parasitti was a Clawdite female bounty hunter. During the Clone Wars, she was hired by Cad Bane to steal a valuable holocron from the archives of the Jedi Temple, which she managed by impersonating the deceased Jedi Knight Ord Enisence and later Jocasta Nu. Although the mission was a success, Parasitti was caught and imprisoned.\nDuring the Clone Wars, Parasitti was hired by fellow bounty hunter Cad Bane to assist in stealing a Holocron from the Jedi Temple for Sith Lord Darth Sidious. Using Todo 360's security chip for the temple, and schematics of the temple from the Sith Lord, Bane and Parasitti made their plans for the heist. Bane had Parasitti pose as Jedi Knight Ord Enisence, to infiltrate the Jedi Archives to help them from the inside.\nAs Enisence, Parasitti was able to make her way into the Jedi archives. There, she ran into Padawan Ahsoka Tano and after exchanging some words, told the young Padawan to leave her alone. She then proceeded to the library and gained access to a computer terminal, where she assisted Bane and Todo in bypassing the security systems. However, they were soon discovered and the Jedi Temple was put on high alert. When librarian Jocasta Nu informed her of the matter, Parasitti knocked her out and took her form. It was not long however, before she was discovered and confronted by Tano. Despite her best efforts to fight her off, Tano was able to subdue her. It was then that Parasitti told her that Bane was trying to get into the Holocron Vault. After Kenobi and Skywalker failed in stopping Bane from stealing the holocron, Parasitti told them about Bane's next target; Jedi Master Bolla Ropal.\nBy 20 BBY, Parasitti was out of Jedi custody, and was present in Chalmun's Spaceport Cantina on the planet Tatooine.\nSome time later, Parasitti attempted to disrupt negotiations with Arthurian delegates in Padmé Amidala's apartment. She disguised herself as Karté, one of Senator Amidala's handmaidens and hid a thermal detonator under a table. However, she made a mistake by setting the table with utensils, which the Arthurians never use, and was noticed by Ahsoka Tano, who was there for security. Parasitti attempted to kill Amidala by setting the detonator off, but that was soon foiled by Ahsoka and Amidala's teamwork and the explosive went of harmlessly in the air above the balcony of the apartment. Parasitti attempted to run away and was stopped with a piece of pottery, in the hands of the Senator, bashing her in the head and knocking her out.\nA Clawdite bounty hunter, Cato Parasitti stood at 1.79 meters tall. During her work with Cad Bane, she initially believed, like Bane, that breaking into the Jedi Temple was impossible, but eventually got the opportunity to disguise herself as a Jedi, posing as Ord Enisence and Jocasta Nu.\nCato Parasitti was voiced by Gwendoline Yeo in Star Wars: The Clone Wars and by Gina Torres in Star Wars: Forces of Destiny.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Cato_Parasitti",
  "/wiki/Cato_Parasitti/Legends",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_39",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Zolan",
  "/wiki/Clawdite",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Cad_Bane%27s_group",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_Wars",
  "/wiki/Cad_Bane",
  "/wiki/Holocron",
  "/wiki/Jedi_Archives",
  "/wiki/Imperial_Palace",
  "/wiki/Death",
  "/wiki/Jedi_Knight",
  "/wiki/Ord_Enisence",
  "/wiki/Jocasta_Nu",
  "/wiki/Raid_on_the_Jedi_Temple",
  "/wiki/Prisoner",
  "/wiki/Sith",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Sidious",
  "/wiki/Todo_360",
  "/wiki/Ahsoka_Tano",
  "/wiki/Holocron_Vault",
  "/wiki/Bolla_Ropal",
  "/wiki/20_BBY",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Arthurian_delegates",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Padm%C3%A9%27s_Apartment",
  "/wiki/Kart%C3%A9",
  "/wiki/Senator",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Thermal_detonator",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Cato_Parasitti",
  "/wiki/Lightsaber",
  "/wiki/Gwendoline_Yeo",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Gina_Torres",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Holocron_Heist",
  "/wiki/Bounty_(episode)",
  "/wiki/Revenge_(episode)",
  "/wiki/The_Imposter_Inside",
  "/wiki/Star_Wars:_Forces_of_Destiny%E2%80%94Ahsoka_%26_Padm%C3%A9",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volume_1",
  "/wiki/Category:Audio_files_of_Cato_Parasitti",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Two",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Databank_A-Z",
  "/wiki/Forces_of_Destiny:_Tales_of_Hope_%26_Courage",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/General_Equipment_(I)",
  "/wiki/Databank_(website)"
 ]
}