{
 "name": "Cavik_Toth",
 "display_name": "Cavik Toth",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "over Geonosis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sabaoth Squadron",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Cavik Toth was a Human ally of the Confederacy of Independent Systems, and pledged the support of his mercenary group, Sabaoth Squadron, to Count Dooku's cause prior to the Clone Wars.\nToth had spent many years working for various mercenary groups, where he learned his tactical and combat skills. Eventually, he founded his own mercenary force, which was known as the Sabaoth Squadron. Toth was placed in command of the trihexalon project carried out by a group of Neimoidian scientists led by Harro Ruuk. However, when Harro Ruuk was behind schedule, Toth took full command of the project, killing Harro and two of his assistants with a sample of the weapon. Once the chemical weapon was complete, Toth first tested the weapon on Point Modie, a colony located in Maramere. The test was considered a success as it had killed hundreds of individuals. Jedi Master Adi Gallia, along with Reti and Sol Sixxa, stopped the demonstration before any more damage could be done. Toth then planned to unleash it upon the Republic. However, the pirate captain Nym, leader of the Lok Revenants, arrived at Nod Kartha and destroyed the Hex factory, effectively stopping production. Toth then went to Lok when it was attacked by Nym's pirates, who were trying to reclaim their planet. Cavik Toth escaped but left Bella behind, believing she could handle the pirate attack while he went to Geonosis to help the Confederacy of Independent Systems in their losing battle against the Republic. He was wrong, and Bella was killed.\nUpon arrival at Geonosis, Toth's Hex fleet of Hex Deployers was ambushed and destroyed by a Jedi starfighter squadron led by Jedi Master Adi Gallia. Toth himself brought his Sabaoth Destroyers into battle. However, the capital ship turrets on all ships were destroyed, allowing the Mere cruisers to destroy them one by one. Soon he brought his flagship into the battle, though let pride get the better of him—his ship's defenses were soon stripped, and his flagship suffered critical hull damage. He then engaged Adi Gallia in starfighter combat.\nCavik Toth was killed above Geonosis by Adi Gallia, while flying his personal starfighter, moments before his flagship exploded.\nAn ambitious young man, Toth was a natural leader and a confident warrior. These traits allowed him to control a sizable mercenary force. He was overconfident and persistent, traits that would ultimately lead to his downfall. His prime motivation was money, so he would pledge his services to the highest bidder; in this case, Count Dooku. Toth was known to punish his subordinates' incompetence with death, such as when Harro Ruuk delivered the hex weapon behind schedule.\nCavik Toth was voiced by Adrian Zmed in Jedi Starfighter.\nAccording to concept artwork produced by artist Amy Beth Christenson and released as bonus material in the Jedi Starfighter game, Toth's appearance was partially based on that of Game Designer Tim Longo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cavic",
  "/wiki/Toth",
  "/wiki/22_BBY/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sabaoth_Squadron/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/New_Order_(Separatist)",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Nym/Legends",
  "/wiki/Trihexalon",
  "/wiki/Neimoidian/Legends",
  "/wiki/Harro_Ruuk",
  "/wiki/Point_Modie",
  "/wiki/Maramere",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Reti",
  "/wiki/Sol_Sixxa",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Nod_Kartha",
  "/wiki/Battle_of_Nod_Kartha",
  "/wiki/Lok/Legends",
  "/wiki/Second_Battle_of_Lok",
  "/wiki/Bella_(Twi%27lek)",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Hex_Deployer",
  "/wiki/Delta-7_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Sabaoth_Destroyer",
  "/wiki/Mere_cruiser",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Cavik_Toth%27s_starfighter",
  "/wiki/Jinkins",
  "/wiki/Adrian_Zmed",
  "/wiki/Amy_Beth_Christenson",
  "/wiki/Star_Wars:_Jedi_Starfighter",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/The_New_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Clone_Wars_Campaign_Guide",
  "/wiki/Galaxy_of_Intrigue"
 ]
}