{
 "name": "CC-1010",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Coruscant Guard",
      "Coruscant Guard",
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "CC-1010, nicknamed \"Fox,\" was a clone trooper officer who served as the Clone Commander of the Coruscant Guard during the Clone Wars. While the Grand Army of the Republic deployed across the galaxy under the command of Jedi Generals, Commander Fox and his clone shock troopers were stationed on Coruscant, the capital planet of the Galactic Republic. Like all clone troopers under his command, Fox was bound by duty and honor to serve and protect Supreme Chancellor Sheev Palpatine as well as members of the Galactic Senate. Over the course of the war, Fox became one of the most highly decorated soldiers in the Republic Military.\nCloned from the genetic template of the human bounty hunter Jango Fett, Fox trained on the extragalactic world of Kamino as part of an army of identical soldiers during the last years of the Republic Era. Following the First Battle of Geonosis, he was transferred to the Republic capital where he assumed command of the Coruscant Guard. As the war progressed, Fox's clone guards supplemented the Senate Guard as a peace-keeping force on Coruscant. In addition, his troops undertook off-world missions by providing security for Jedi ambassadors and senatorial dignitaries.\nFox retained command of the Coruscant Guard in the aftermath of Order 66 and the rise of the Galactic Empire. During the early days of Emperor Palpatine's reign, Fox organized a security perimeter encircling the fallen Temple of the Jedi Order while the Sith Lord Darth Vader attempted to capture Jedi Master Jocasta Nu. Ultimately, Fox was executed by Vader after the shock troopers tried to kill him, having mistaken the Sith for a Jedi.\nCC-1010, a clone who went by the nickname \"Fox,\" was bred from the genetic material of Jango Fett as part of a program to grow an army on the the planet Kamino. In 22 BBY, approximately one decade after the initial creation of the clone army, Fox and his brethren were called to service by the Galactic Republic, resulting in the formation of the Grand Army of the Republic and the start of the Clone Wars. While thousands of clone troopers served on the front lines under the leadership of the Jedi Order, Fox was stationed on Coruscant where he served as commander of the Coruscant Guard. Under Fox's command, the Guard served as peacekeepers on the Republic capital and were also responsible for the safety of the Galactic Senate as well as Supreme Chancellor Sheev Palpatine.\nDuring the mission to rescue Rotta, son of Jabba Desilijic Tiure, the Hutt crime lord Ziro made Senator Padmé Amidala his prisoner in order to prevent her from exposing his part in Rotta's abduction. She was ultimately liberated by the efforts of Commander Fox and a contingent of clone shock troopers who raided Ziro's establishment in Galactic City, having been informed of the Hutt's illegal actions by Amidala's protocol droid C-3PO. After eliminating the security droids, Fox arrested Ziro who, confessed his betrayal to Jabba before being taken to prison at the Republic Judiciary Central Detention Center.\nThe capture of Ziro consequently led to a crisis on Coruscant when a group of senators were taken hostage by several mercenaries, including the bounty hunter Cad Bane. In response, a squad of shock troopers secured the Chancellor's office in the Senate headquarters while Fox and his troops surrounded the detention center to prevent Ziro's escape. In spite of his efforts, Fox was forced to allow the bounty hunters to leave with Ziro in order to save Bane's hostages.\nBetween 21 BBY and 20 BBY, a group of modified demolition droids were sent to disrupt the Confederate–Republic peace initiative on Coruscant. At the time Fox was tasked with protecting the central power distribution grid on Level 5000. The droids deceived him with a security clearance code, which Fox deemed authentic. As a result, the droids completed their mission by destroying power grid, causing a city-wide blackout on Coruscant. Infuriated by the Confederacy's terrorist attack on the galactic capital, the Senate rejected the peace initiative.\nFollowing the terrorist attack on the Jedi Temple of Coruscant in 19 BBY, Letta Turmond was imprisoned in the Republic Center for Military Operations due to her participation in the attack. Ahsoka Tano, the Jedi Padawan who arrested the terrorist, visited the facility at Turmond's request, but was required to surrender her lightsabers to Commander Fox as a security precaution. Although the clone initially praised Tano for bringing Turmond to justice, he was compelled to arrest her after Turmond was strangled to death by way of the Force. Unbeknownst to Fox, Turmond was murdered by the fallen Jedi Barriss Offee, whose distorted views led her to commit acts of betrayal and terrorism. Offee further tainted her incarcerated comrade's reputation by killing three clone officers with her lightsaber, leading Fox to believe that Tano was the culprit. In response to Tano's escape attempt, Fox deployed the Coruscant Guard alongside Jedi General Anakin Skywalker and Clone Captain CT-7567 \"Rex\" as they pursued the Jedi escapee.\nIn the aftermath of the incident with Tano, whose innocence was proven after Skywalker disrupted her trial to reveal Offee as the real traitor, Fox was ordered to hunt another fugitive—the ARC trooper CT-5555 \"Fives\" of the 501st Legion. Fives fled from the Grand Republic Medical Facility where he had attempted to assassinate Chancellor Palpatine after learning of his involvement in a conspiracy to destroy the Jedi Order. Tracking the renegade clone to Level 1315, Fox and a contingent of clone shock troopers confronted Fives, demanding that he stand down. In his panic and desperation, the ARC trooper raised a blaster pistol at the approaching guards, but Fox opened fire, killing Fives with a shot through his heart.\nDuring the initial stage of the Great Jedi Purge, Fox and his fellow clones participated in the implementation of Order 66 on Coruscant. The Jedi Order had been accused of treason by Chancellor Palpatine; as such, they were marked for death by the clone troopers who once served them. Ultimately, Fox and his troops successfully carried out their orders to purge the capital of its Jedi inhabitants.\nThe Coruscant Guard remained under Commander Fox's leadership after Palpatine declared himself Emperor, reorganizing the Republic into the Galactic Empire. In the early days of the New Order, Fox and his troops encountered Jedi Master Jocasta Nu, Chief Librarian of the Jedi Temple, who used the Force to influence the clones in order to pass them safely. After Nu infiltrated the Temple, Fox surrounded the Jedi Order's former home with two full companies of Imperial clone shock troopers with the Coruscant Security Force providing auxiliary support. He assured the Emperor's apprentice, the Sith Lord Darth Vader, that the perimeter around the Temple was secure.\nDarth Vader's lightsaber caused Fox's soldiers to mistake the Sith for a Jedi. The clones opened fire on him during Nu's attempted escape. Fox immediately ordered them to cease their attack when he realized who they were shooting. Although he tried to explain his actions, Fox was summarily executed for failing to provide the clones with Vader's description. The Dark Lord of the Sith used telekinesis to break the clone's neck, ending the life of Commander Fox.\nCommander Fox was a human male clone who stood at 1.83 meters, a physical trait he inherited from his template Jango Fett. He was also a fearless soldier who led the elite Coruscant Guard shock troopers into combat, and was always the first to charge into battle. As with the rest of the Guard, Fox possessed a strong sense of duty and honor which compelled him to loyally serve and protect the Republic's highest governing body—the Galactic Senate and the Supreme Chancellor. His service was exemplary, leading him to become one of the most highly decorated soldiers in the Grand Army of the Republic.\nLike the rest of his clone brethren, Fox was fiercely loyal to the Galactic Republic, and had little patience for criminals such as the terrorist Letta Turmond. When Turmond died in her cell, Fox stated that he did not personally blame Ahsoka Tano, but nonetheless arrested her as a suspect for the murder of Turmond. Later, he unhesitatingly ordered his guards to kill Tano, whom he believed responsible for the deaths of several clones during her escape, but grudgingly complied with Anakin Skywalker's orders to capture the Padawan alive. When Fox and his troops confronted Fives, he demanded that the ARC trooper surrender to them. Ultimately, Fox opened fire on Fives after the clone raised a blaster at him.\nFox was loyal to the Republic's successor, the Galactic Empire, and continued to lead the Coruscant Guard in the name of the self-styled Emperor Palpatine. Like the other clones, he was complicit in the execution of Order 66, which he saw as his duty to carry out. Believing the Jedi Order responsible for instigating a rebellion on the capital, Fox viewed the Jedi as \"agitators\" and enemies of the state. Though he intended no harm to Darth Vader, he failed to warn his guards against mistaking the Sith Lord for a Jedi. This oversight on Fox's part ultimately cost the commander his life.\nAs a clone soldier who served in the early period of the Clone Wars, Commander Fox wore the standard Phase I clone trooper armor albeit with the crimson markings and original pattern design of the Coruscant Guard. In addition to his armor, Fox wore a kama and a customized helmet similar to the one worn by CC-2224 \"Cody\" of the 212th Attack Battalion.\nWith the introduction of Phase II clone trooper armor, Fox switched to the upgraded version alongside his unit. His new armor was colored mainly in red which in fact is the inverted color scheme of the standard kit of the clone shock troopers. His weapons included the standard DC-15A blaster rifle and a pair of DC-17 hand blasters.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/CC-1010",
  "/wiki/CC-1010/Legends",
  "/wiki/Fox_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kamino",
  "/wiki/19_BBY",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Galactic_Republic",
  "/wiki/Coruscant_Guard",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Clone_trooper_officer",
  "/wiki/Clone_Commander",
  "/wiki/Clone_Wars",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/The_galaxy",
  "/wiki/Jedi_General",
  "/wiki/Commander",
  "/wiki/Imperial_shock_trooper",
  "/wiki/Capital",
  "/wiki/Planet",
  "/wiki/Clone_trooper",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Senator",
  "/wiki/Galactic_Senate",
  "/wiki/Soldier",
  "/wiki/Republic_Military",
  "/wiki/DNA",
  "/wiki/Clone_template",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Extragalactic",
  "/wiki/Army",
  "/wiki/Standard_year",
  "/wiki/Republic_Era",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Senate_Guard",
  "/wiki/Law_enforcement_agency",
  "/wiki/Troop",
  "/wiki/Diplomatic_service",
  "/wiki/Jedi",
  "/wiki/Ambassador",
  "/wiki/Order_66",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Standard_day",
  "/wiki/Galactic_Emperor",
  "/wiki/Imperial_Era",
  "/wiki/Siege_of_the_Jedi_Temple",
  "/wiki/Imperial_Palace",
  "/wiki/Jedi_Order",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Jedi_Master",
  "/wiki/Jocasta_Nu",
  "/wiki/Death_penalty",
  "/wiki/Death",
  "/wiki/Sith",
  "/wiki/22_BBY",
  "/wiki/Standard_decade",
  "/wiki/Trooper",
  "/wiki/File:ShouldWeArrestTheHutt-TCWf.ogg",
  "/wiki/Battle_of_Teth",
  "/wiki/Rotta",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Prisoner",
  "/wiki/Raid_on_Ziro_the_Hutt%27s_Coruscant_pleasure_palace",
  "/wiki/Ziro%27s_Palace",
  "/wiki/Imperial_City",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Droid",
  "/wiki/Prison",
  "/wiki/Republic_Judiciary_Central_Detention_Center",
  "/wiki/Senate_hostage_crisis",
  "/wiki/Mercenary",
  "/wiki/Cad_Bane",
  "/wiki/Squad",
  "/wiki/Emperor%27s_office",
  "/wiki/Imperial_Executive_Building",
  "/wiki/Bounty",
  "/wiki/21_BBY",
  "/wiki/20_BBY",
  "/wiki/Infiltrator_demolition_droid",
  "/wiki/Confederate%E2%80%93Republic_peace_initiative",
  "/wiki/Time",
  "/wiki/Central_power_distribution_grid",
  "/wiki/Level_5000",
  "/wiki/Ecumenopolis",
  "/wiki/Terrorist",
  "/wiki/Bombing_of_Coruscant%27s_central_power_distribution_grid",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Letta_Turmond",
  "/wiki/Imperial_Inspectorate_HQ",
  "/wiki/Ahsoka_Tano",
  "/wiki/Padawan",
  "/wiki/Lightsaber",
  "/wiki/Force_choke",
  "/wiki/The_Force",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Barriss_Offee",
  "/wiki/Escape_from_the_Republic_military_base",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Capture_of_Ahsoka_Tano",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Treason",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/CT-5555",
  "/wiki/501st_Legion",
  "/wiki/Grand_Republic_Medical_Facility",
  "/wiki/Level_1315",
  "/wiki/Blaster_pistol",
  "/wiki/Heart",
  "/wiki/Great_Jedi_Purge",
  "/wiki/New_Order",
  "/wiki/Chief_Librarian",
  "/wiki/Jedi_temple",
  "/wiki/Mind_trick",
  "/wiki/Hunt_for_Jocasta_Nu",
  "/wiki/Company",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Sith_apprentice",
  "/wiki/Darth",
  "/wiki/Kirak_Infil%27a%27s_lightsaber",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Telekinesis",
  "/wiki/Lord",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Color",
  "/wiki/Armor",
  "/wiki/Kama",
  "/wiki/CC-2224",
  "/wiki/212th_Attack_Battalion",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/DC-15A_blaster_rifle",
  "/wiki/DC-17_hand_blaster",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Hostage_Crisis",
  "/wiki/Hunt_for_Ziro",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Deception",
  "/wiki/Friends_and_Enemies",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/To_Catch_a_Jedi",
  "/wiki/Orders",
  "/wiki/Darth_Vader_(2017)_7",
  "/wiki/Darth_Vader_(2017)_9",
  "/wiki/Darth_Vader_(2017)_10",
  "/wiki/Category:Images_of_CC-1010",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Four",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Helmets",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2018_Topps_Star_Wars_Galactic_Files",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/The_Clone_Wars_Begin",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Assassin_(episode)",
  "/wiki/Battle_of_Kamino",
  "/wiki/Battle_of_Sullust",
  "/wiki/Battle_of_Mandalore",
  "/wiki/The_Wrong_Jedi"
 ]
}