{
 "name": "CC-1119",
 "display_name": "CC-1119",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "501st Legion",
      "501st Legion"
     ]
    }
   ]
  }
 ],
 "content": "CC-1119, nicknamed \"Appo,\" was a clone trooper officer who served as a Clone Sergeant and later as a Clone Commander in the 501st Legion during the Clone Wars. As a soldier in military service to the Galactic Republic, Appo was a veteran of several major battles fought between the Grand Army of the Republic and the droid armies of the Confederacy of Independent Systems including Umbara at the height of the galactic conflict, and on the Republic capital world of Coruscant by the war's end. He was a loyal trooper who obeyed the orders of his commanding officer, conditioned to render unquestioned allegiance to the Republic.\nAs with all troopers in the Grand Army, Appo was cloned on the extragalactic world of Kamino, where Kaminoan scientists used the genetic template of Jango Fett, a human bounty hunter, to create a clone army for the Republic. Before Appo's promotion to the military rank of commander, he served as a sergeant in the 501st Legion, led by Jedi General Anakin Skywalker and Clone Captain CT-7567 \"Rex.\" During the Battle of Umbara, command of the 501st was temporarily transferred to another Jedi officer, General Pong Krell, as a result of Skywalker returning to Coruscant at the request of Supreme Chancellor Sheev Palpatine. Sergeant Appo witnessed firsthand Krell's willingness to sacrifice his troops but nonetheless faithfully executed the general's orders until Krell's treason.\nIn the final days of the war Chancellor Palpatine had put Order 66 into effect, declaring that all Jedi were enemies of the Republic. As a result, Appo, serving as the commander of the force of the 501st active on Coruscant, accompanied the Sith Lord Darth Vader as the 501st participated in the Siege of the Jedi Temple, invading the Jedi Order's home on Coruscant as part of a systematic purge that occurred across the galaxy. He encountered Senator Bail Organa during the attack, and used the threat of force to keep the Alderaanian politician at bay. But as Organa tried to leave, Padawan Zett Jukassa ambushed Appo's contingent, striking down the commander and several of his troops.\nCC-1119, also known as \"Appo,\" was one of many clone troopers grown from the genetic source of the bounty hunter Jango Fett. Bred on the extragalactic world of Kamino, he was created to serve in an army of clone soldiers that had been developed in secret to become the armed forces of the Galactic Republic. Within ten years of the clone army's inception, the Republic went to war with the secessionist movement known as the Confederacy of Independent Systems. As a result, Appo became a soldier in the newly-formed Grand Army of the Republic, serving in many critical battles across the galaxy during the Clone Wars.\nIn 20 BBY, Appo served as a Clone Sergeant in the 501st Legion by the time of the Republic invasion of Umbara. At first he fought the Separatist-aligned Umbarans and their military under the leadership of Jedi General Anakin Skywalker. However, Skywalker was recalled to the Republic capital of Coruscant, leaving Appo and the legion under the command of a different officer, Besalisk Jedi General Pong Krell, for the duration of the campaign.\nFollowing a failed attempt to invade the Umbaran capital city, Krell and the 501st were dispatched on a new assignment to secure a heavily fortified Umbaran airbase that was critical to the Republic's strategy. At the General's command, Clone Captain CT-7567 \"Rex\" led a vanguard assault on the base's defense perimeter while Appo and the majority of the 501st remained at Krell's side as he observed the fighting from a distance on a clifftop. Krell then ordered Appo to organize the remaining troops into platoons, consisting of clone troopers and AT-RT drivers. As Rex and his men were taking casualties while battling Umbaran mobile heavy cannons, Appo informed Krell that his task of forming the platoons was complete. The sergeant also wanted to immediately send the troops to aid Rex on the battlefield, although Krell dismissed Appo, by stating he would give out the order when needed. When Rex contacted Krell via hologram, Appo held the device in his hand. The Besalisk then talked to the captain, who had formulated a plan to infiltrate the airbase by using Advanced Recon Commando CT-5555 \"Fives\" and the trooper, \"Hardcase.\" Krell did not support the idea, Rex, nevertheless, carried out the plan.\nOn the clifftop, both Appo and Krell witnessed the return of Fives and Hardcase, aboard two commandeered Zenuas 33 Umbaran starfighters resulting in the destruction of the mobile cannons. Noticing the airbase's defensive systems were down, Krell ordered Appo to mobilize the spare platoons and attack the airbase. Appo's men took over it, which forced the remaining Umbaran troops stationed there to surrender. With the airbase captured, Krell and the rest of the 501st Legion fortified themselves in the base.\nAfter learning of the destruction of the Confederate supply ship in orbit over Umbara, Krell told Appo to bring the surviving perpetrators Fives and CT-5597 \"Jesse\" to him in the airbase's central command tower. Appo relayed the order to Fives and Jesse and the clones met with Krell in the tower. Krell informed the two clones that because they disobeyed a direct order, they would be imprisoned for their actions and be sent to the Grand Army's court-martial.\nAlthough they were originally scheduled to be court-martialed, Krell used his authority to sentence them both to execution by firing squad due to a court-martial's lengthy trial time. Rex, with Appo, were ordered to escort Fives and Jesse to the site of their execution. As Appo stood by the handcuffed Fives and Jesse, the firing squad prepared to shoot the two clones, although their concentration was cut off after Fives pleaded for them to rethink. CT-6922 \"Dogma,\" however, did not care for Fives' words and ordered the firing squad to fire on the two clones. Fives' words affected them, however, which caused them to misfire. Rex ordered Appo and another clone to take off Fives and Jesse's binders. However, on Krell's orders, the two clones were taken back to the airbase's prison, while Rex's men mobilized to attack Umbaran soldiers that had disguised themselves as clones.\nAfterward, it was discovered from a dying Clone Lieutenant \"Waxer\" that Krell had given his platoon from the 212th Attack Battalion the same order to hunt down disguised Umbaran soldiers while deliberately knowing that the \"enemy\" would be actual clones. In response to the fallen Jedi's acts, Appo joined Rex and the clone troopers that went to the airbase's central tower to arrest Krell for treason against the Republic. Despite sustaining a number of casualties, they successfully apprehended the former Jedi. Krell then explained that he was a Separatist sympathizer, wanting to become Count Dooku's apprentice. Krell was ultimately executed by Dogma, who was the former Jedi's most loyal follower until Krell admitted his betrayal. With Krell dead, Appo and the rest of the 501st troopers regrouped outside the prison. The Republic had won the battle.\nAfter the Battle of Umbara, Appo was promoted to the military rank of Clone Commander, but Rex—despite only being a captain—held more authority, retaining his position as leader of the 501st as a whole. In 19 BBY, during the last days of the Clone Wars, the Republic was confronted with a simultaneous Separatist attack on Coruscant and a crisis on Mandalore. General Skywalker made the decision to divide the 501st to respond to both threats, promoting Captain Rex to serve as the Clone Commander of a new division, the 332nd Division. Appo remained in the previous force of the 501st, returning with that part of the legion to Coruscant as its commander.\nShortly after the Republic victory on Coruscant, Darth Sidious—the Dark Lord of the Sith who orchestrated the fall of democracy in his guise as Supreme Chancellor Sheev Palpatine—activated Order 66, a secret protocol implanted through a behavioral modification biochip that forced every clone in the Grand Army to terminate the Jedi leadership. With Rex still away, carrying out the order aboard the Tribunal, Appo held authority over the 501st troopers on Coruscant on the execution of Order 66. Led by the newly-anointed Sith Lord Darth Vader—formerly the Jedi Knight Anakin Skywalker—Appo and the 501st marched on the Jedi Grand Temple. The clones proceeded to slaughter their former allies, including Padawans and younglings. Appo and his men had coordinated well against the Jedi, with the element of surprise aiding their work. Within a few hours, the Temple had been pacified and the fighting was over.\nThe attack on the Jedi headquarters created a conflagration visible in the night sky of Coruscant's Federal District, drawing the Alderaanian Senator Bail Prestor Organa to the Jedi temple. Appo, along with a contingent of clones, barred the senator from entering the facility. Repeating the idea enforced by his control chip, he claimed that the Jedi had mounted a \"rebellion\" which the 501st was suppressing. When Organa ignored the clone's attempt to block his path, Appo threatened the politician at the point of a blaster. However, their encounter with Organa distracted the clones from the approaching surviving Padawan Zett Jukassa, who managed to kill and wound several soldiers including Appo who was struck down in the lower leg by the apprentice's lightsaber. Jukassa was ultimately killed by Clone Sergeant CT-0000/1010 \"Fox,\" and Organa escaped the scene in horror with the sergeant ordering his men to let the Senator go.\nAppo was a human male clone of Jango Fett. As such, Appo possessed the same physical characteristics as his clone template, standing at 1.83 meters with black hair, brown eyes, and tan skin.\nFor most of his life, Appo had been trained for service as a soldier of the Galactic Republic. He was skilled at armed and unarmed combat, military tactics, reconnaissance, and peacekeeping. Like his clone brethren, he was also conditioned to be absolutely loyal to the chain of command, obeying every order without question. Though he witnessed firsthand Pong Krell's willingness to sacrifice clone lives for victory, Appo nonetheless remained loyal to his general until it was discovered that the Besalisk Jedi had betrayed the Republic.\nAppo's loyalty was reinforced through programming in the form of a behavioral modification biochip, which ultimately ensured Darth Sidious' control over clones such as Appo. Appo complied with the command to execute Order 66 as a result, participating in the attack on the Jedi Temple with Anakin Skywalker and the 501st Legion. Like other clones under the biochip's influence during Order 66, Appo believed that he was suppressing a \"Jedi rebellion\" against the Republic. When confronted by Bail Organa at the Jedi Temple, Appo attempted to reassure him that the 501st was in control of the situation. However, when Organa tried to gain entry to the Temple, Appo raised his weapon and ordered the senator to leave the area.\nAs a clone soldier in service to the Republic, Appo was equipped with the Phase II clone trooper armor which supplanted the original Phase I version as the standard armor of the Grand Army clone troopers. His armor had the common blue markings of the 501st Legion. During his tenure as a sergeant, Appo's helmet had a white arrow shape running down its forehead. However, the symbol was absent from Appo's armor by the time of the Jedi Temple siege. In combat, he utilized the DC-15A blaster carbine, DC-15A blaster rifle and two DC-17 hand blasters. In addition, his utility belt was equipped with a N-20 Baradium-core thermal detonator.\nWhen Appo was a Clone Commander, his armor had the addition of a black and blue left-shoulder pauldron, two black bandoliers with three white pouches—one wrapped over the right shoulder to his pauldron and the other worn around the upper right arm, a black kama and dual holsters for DC-17 hand blasters. He also made use of a BARC speeder during that period. The armor customizations were not worn during the siege on the Jedi Temple.\nCC-1119 first appeared in Star Wars: Episode III Revenge of the Sith in both the current canon and Legends continuities. The film was directed by George Lucas and released in 2005. CC-1119 was voiced by Temuera Morrison, and like every other clone trooper in the film, portrayed entirely with computer-generated imagery. The trooper was first identified as \"Appo\" in the Star Wars: The Clone Wars fourth season episode \"The General,\" directed by Walter Murch and released in 2011. Appo's designation \"CC-1119\" was first identified in his Star Wars: Force Collection character card, released in 2014 by Konami.\nVoice actor Dee Bradley Baker provided Appo's voice in the Star Wars: The Clone Wars television series, as he did for all the clone troopers in the show. The arrow on Appo's helmet is a nod to Baker voicing Appa, a character from Avatar: The Last Airbender, a show that The Clone Wars supervising director Dave Filoni had previously worked on.\nAlthough Star Wars Helmet Collection 16 establishes that CC-1119 was promoted to the rank of commander upon Rex abandoning his post and Order 66 being issued, Star Wars: The Clone Wars: Character Encyclopedia - Join the Battle! establishes that CC-1119 was promoted to commander after the Battle of Umbara, and was placed in command of the unit of the 501st that traveled to Coruscant while Rex led the 332nd Division. Since The Clone Wars: Character Encyclopedia is the newer source, this article assumes that information takes precedence.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/CC-1119",
  "/wiki/CC-1119/Legends",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/501st_Legion",
  "/wiki/Clone_trooper_officer",
  "/wiki/Clone_Sergeant",
  "/wiki/Clone_Commander",
  "/wiki/Clone_Wars",
  "/wiki/Soldier",
  "/wiki/Republic_Military",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Umbara",
  "/wiki/Galaxy",
  "/wiki/Capital",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Trooper",
  "/wiki/Commanding_officer",
  "/wiki/Army",
  "/wiki/Extragalactic",
  "/wiki/Kaminoan",
  "/wiki/Scientist",
  "/wiki/DNA",
  "/wiki/Clone_template",
  "/wiki/Jango_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Military_rank",
  "/wiki/Commander",
  "/wiki/Sergeant",
  "/wiki/Legion",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Battle_of_Umbara",
  "/wiki/Jedi",
  "/wiki/Officer",
  "/wiki/General",
  "/wiki/Pong_Krell",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Troop",
  "/wiki/Treason",
  "/wiki/Standard_day",
  "/wiki/Order_66",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/Siege_of_the_Jedi_Temple",
  "/wiki/Jedi_Order",
  "/wiki/Great_Jedi_Purge",
  "/wiki/The_galaxy",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Alderaanian",
  "/wiki/Politics",
  "/wiki/Padawan",
  "/wiki/Zett_Jukassa",
  "/wiki/Clone_trooper",
  "/wiki/Standard_year",
  "/wiki/Separatist_Crisis",
  "/wiki/20_BBY",
  "/wiki/Time",
  "/wiki/Umbaran",
  "/wiki/Umbaran_Militia",
  "/wiki/Besalisk",
  "/wiki/Umbaran_capital_city",
  "/wiki/Umbaran_airbase",
  "/wiki/Platoon",
  "/wiki/Advanced_Recon_Force_Scout_Trooper",
  "/wiki/Umbaran_mobile_heavy_cannon",
  "/wiki/Hologram",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/CT-5555",
  "/wiki/Hardcase",
  "/wiki/Zenuas_33_Umbaran_starfighter",
  "/wiki/Unidentified_DH-Omni_Support_Vessel_(Umbara)",
  "/wiki/Orbit",
  "/wiki/CT-5597",
  "/wiki/Prison",
  "/wiki/Court-martial",
  "/wiki/Squad",
  "/wiki/Stuncuffs",
  "/wiki/CT-6922",
  "/wiki/Death",
  "/wiki/Clone_Lieutenant",
  "/wiki/Waxer",
  "/wiki/Waxer%27s_platoon",
  "/wiki/212th_Attack_Battalion",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Sith_apprentice",
  "/wiki/Captain",
  "/wiki/19_BBY",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Mandalorian_civil_war_(Clone_Wars)",
  "/wiki/Mandalore",
  "/wiki/Division",
  "/wiki/332nd_Division",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Democracy",
  "/wiki/150_general_orders",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Skirmish_aboard_the_Tribunal",
  "/wiki/Tribunal",
  "/wiki/Jedi_Knight",
  "/wiki/Imperial_Palace",
  "/wiki/Jedi_Initiate",
  "/wiki/Standard_hour",
  "/wiki/Federal_District",
  "/wiki/Jedi_temple",
  "/wiki/Blaster",
  "/wiki/Limb",
  "/wiki/Lightsaber",
  "/wiki/CT-0000/1010",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Surface_warfare",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Police_officer",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Armor",
  "/wiki/Helmet",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/DC-15A_blaster_rifle",
  "/wiki/DC-17_hand_blaster",
  "/wiki/N-20_Baradium-core_thermal_detonator",
  "/wiki/Pauldron",
  "/wiki/Bandolier",
  "/wiki/Kama",
  "/wiki/Holster",
  "/wiki/BARC_speeder",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars_Legends",
  "/wiki/George_Lucas",
  "/wiki/2005",
  "/wiki/Temuera_Morrison",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/The_General_(episode)",
  "/wiki/Walter_Murch",
  "/wiki/2011",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/2014",
  "/wiki/Konami",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Dave_Filoni",
  "/wiki/Star_Wars_Helmet_Collection_16",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Category:Images_of_CC-1119",
  "/wiki/Darkness_on_Umbara",
  "/wiki/Plan_of_Dissent",
  "/wiki/Carnage_of_Krell",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Sixth_Scale_Figures",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Orders",
  "/wiki/Shattered",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Aftermath_(episode)",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Databank_(original)"
 ]
}