{
 "name": "CC-3714",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "third moon of Vassek"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "CC-3714's squad",
      "Grand Army of the Republic",
      "CC-3714's squad",
      "CC-3714's squad"
     ]
    }
   ]
  }
 ],
 "content": "CC-3714, nicknamed \"Fil,\" was a veteran clone trooper commander in the Grand Army of the Republic who was assigned to recently promoted Jedi Knight Nahdar Vebb during the Clone Wars. In 22 BBY, he led a squad of clone troopers on a mission to the third moon of Vassek, in the Outer Rim Territories. Accompanied by Vebb and Jedi Master Kit Fisto, the group searched for Trade Federation Viceroy Nute Gunray, who had been recently freed from Republic captivity. Unbeknownst to the group, Gunray, along with Confederate Head of State Count Dooku, had laid a trap for the Jedi, using a homing beacon to deceive the Jedi and make them believe that Gunray was hiding in a castle on the moon.\nAfter the group realized that they had fallen for a trap, the Confederate General Grievous arrived at the castle, which was in fact his personal retreat. The Jedi and clone troopers tried to capture Grievous, but after a short brawl with the Republic squad, the cyborg general fled to the stronghold's secret command center. After Grievous opened a molten incinerator pit trap, which was under Fil and the Jedi, the cyborg general released his pet roggwart, Gor, to attack them. Fil was caught by the beast, which used its tail to grab the commander. The Jedi tried to free him, but Fil was killed when Gor slammed the clone on the ground. Vebb was later murdered at the hands of Grievous, leaving Fisto as the only survivor of the mission.\nClone Commander 3714, nicknamed \"Fil,\" was born on the planet Kamino to be commissioned for the Grand Army of the Republic during the Clone Wars, a galaxy-wide conflict between the Galactic Republic and the Confederacy of Independent Systems. Fil was assigned to recently promoted Mon Calamari Jedi Knight Nahdar Vebb, and served under him in several battles during the Clone Wars. In 22 BBY, Fil was the leader of a clone trooper squad that participated in a mission to the third moon of the Outer Rim world of Vassek.\nDuring the mission, Fil and his squad accompanied Vebb. Vebb's former Jedi Master, Kit Fisto, joined Vebb and his men to capture Trade Federation Viceroy Nute Gunray, who had recently been saved from Republic captivity by the Dark Acolyte Asajj Ventress, laid a trap for the Jedi in a building on the Vassek moon. Jedi Master Luminara Unduli and Jedi Padawan Ahsoka Tano, who had been escorting Gunray to the galactic capital of Coruscant aboard Venator-class Star Destroyer Tranquility before the viceroy escaped, told Fisto that they had tracked Gunray to the Vassek system.\nFil ordered fellow clone troopers Bel and Niner to look after their Nu-class attack shuttle, while he went with the rest of the squad and followed the Jedi into the castle. Fisto denied Fil's use of a thermal detonator to open the lair's door, and instead pressed a secret stone that activated the entrance. After they entered the castle, the group made their way to a room called the \"sanctum overlook,\" where a faint voice was heard. A number of B1-Series battle droids were talking to Gunray, who, unbeknownst to the Jedi and clones, was in holographic form in order to lure the Jedi into the trap. Once the group dispatched the droids, however, Vebb used the Force to turn Gunray's chair around, revealing the hologram of the Viceroy. After Gunray activated a homing beacon near his chair, his hologram faded away. Dooku contacted the Jedi, telling the group that while Gunray was unavailable for capture, he offered them an unnamed alternative prize. Fisto and Vebb knew that they had been tricked into the lair, and it was some form of a trap. Fil was worried about the current situation after the group walked down a dark hallway. Upon witnessing Kaleesh statues and replacement cyborg masks, Fisto indicated that they were in the lair of the Confederate General Grievous. The group soon realized that Grievous would arrive at any moment, and that an opportunity to capture the cyborg general—which could turn the tide of the war—had presented itself.\nAfter Grievous landed in the castle's secret hangar, he was ambushed by the group. Fil and his men drew their blasters, but Grievous did not comply with Fisto's demands for surrender and ignited four lightsabers. The Jedi managed to contain the former Kaleesh warlord, severing one of his cybernetic hands. Fil ordered his men to use grappling hooks to hold Grievous, while Vebb and Fisto tried to finish Grievous off. Grievous released himself from the clones, but Fisto severed Grievous's cyborg body in half from the waist down. The cyborg general fled from the area and entered the lair's secret command center. The battle with Grievous had resulted in the loss of two clone troopers, leaving only Fil and one last trooper alongside the Jedi.\nFil and the other survivors tried to flee from the castle, but Grievous trapped them by shutting the outer doors. Fil contacted Bel and Niner, who were guarding their shuttle, and ordered them to contact their fleet, which was near the Inner Rim planet of Bestine IV, for reinforcements. However, a group of Grievous's IG-100 MagnaGuards discovered where the shuttle was, and used a missile launcher to destroy it once Bel and Niner went inside to use it's long range transmitter, killing them. In the command center, Grievous revealed a trap to the surviving Republic squad and opened a molten incinerator pit, which was under Fil and one remaining clone trooper. Fil and the remaining trooper fell into the pit; the other clone was killed, but the commander fired his grappling hook, and with the help of Vebb and Fisto, managed to save himself.\nGrievous then decided to release his pet roggwart, Gor, to attack the group. Upon seeing Gor, Fil fired his blaster pistol at the beast's head, which was deflected from Gor's head armor. The roggwart disarmed Fisto, and Vebb ordered Fil to shoot and distract Gor while he himself Force Jumped onto the creature. However, when Vebb stabbed Gor in the back with his lightsaber, Gor used his long tail to lift Fil off the ground. As Gor held onto Fil with his tail, both of the Jedi tried to save the clone commander, but it was too late. Fisto slashed at the roggwart's face with his lightsaber; Fil was slammed onto the floor by Gor and was instantly killed on impact. Eventually, Vebb was murdered at the hands of Grievous, and soon the cyborg fought Fisto, though the Jedi Master escaped and departed the moon.\nFil was a veteran clone trooper, and explosives expert, who was assigned to the newly promoted Jedi Knight Nahdar Vebb. While serving under Vebb, Fil aided him in several battles prior to the Vassek mission. During the mission to find Gunray on the third moon of Vassek, Fil was determined to find the Trade Federation viceroy. When Grievous revealed his hidden molten incinerator pit to the Republic group, Fil knew the pit would be a trap. Though he lost all of his troops during the mission, Fil set his concentration on protecting Vebb and Kit Fisto while they engaged Grievous' pet roggwart, Gor. However, Fil was unable to defend himself and was killed by the roggwart. When he, Vebb, Fisto, and his clone trooper squad spotted the front door which led into Grievous' castle, Fil was determined to destroy the door with a thermal detonator, but Fisto denied his request to use it. Fil was trained in ranged and close combat.\nFil's Phase I clone trooper armor was detailed with lines and sported the color red. The clone commander wore a kama, a skirt-like anti-blast armor that was wrapped around his waist, and a pauldron for shoulder armor. His polarized-visor helmet was equipped with dual flashlights. Fil carried and used DC-17 hand blasters, and also carried a thermal detonator, which he displayed on the third moon of Vassek. Along with his squad, Fil carried a grappling hook–equipped DC-15A blaster rifle.\nFil was first featured in \"Lair of Grievous,\" the tenth episode in the first season of the Star Wars: The Clone Wars television series, which aired on December 12, 2008. The character was voiced by Dee Bradley Baker, who provided the voice of all of the clone troopers in the series. Fil was later given the clone designation \"CC-3714\" in the Star Wars: The Clone Wars Character Encyclopedia. Fil was also featured in the March 2011 non-canonical video game LEGO Star Wars III: The Clone Wars, appearing in the adaptation of \"Lair of Grievous.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Fil",
  "/wiki/CC-3714",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Third_moon_of_Vassek",
  "/wiki/Vassek/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/CC-3714%27s_squad",
  "/wiki/File:LookAfterTheShips-LoG.ogg",
  "/wiki/Clone_trooper_commander",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Nahdar_Vebb/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Mission_to_Vassek%27s_third_moon",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Viceroy/Legends",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/Rescue_on_the_Tranquility/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Head_of_State/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Homing_beacon/Legends",
  "/wiki/Grievous%27s_castle",
  "/wiki/Moon/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Roggwart/Legends",
  "/wiki/Gor/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Death/Legends",
  "/wiki/File:It%27sATrap-LoG.ogg",
  "/wiki/Planet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Dark_Acolyte/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Luminara_Unduli/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Tranquility/Legends",
  "/wiki/Vassek_system/Legends",
  "/wiki/Bel/Legends",
  "/wiki/Niner/Legends",
  "/wiki/Nu-class_attack_shuttle",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Hologram/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Kaleesh/Legends",
  "/wiki/File:WorseThingsThanGrievous-LoG.ogg",
  "/wiki/Hangar/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Grappling_hook/Legends",
  "/wiki/Unidentified_clone_trooper_(Vassek_moon)",
  "/wiki/Shuttle/Legends",
  "/wiki/Inner_Rim",
  "/wiki/Bestine_IV/Legends",
  "/wiki/IG-100_MagnaGuard/Legends",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Force_Jump",
  "/wiki/File:TakeHimDownEasy-LoG.ogg",
  "/wiki/File:SpecializeMakingEntrances-LoG.ogg",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/Kama/Legends",
  "/wiki/Pauldron/Legends",
  "/wiki/DC-17_hand_blaster/Legends",
  "/wiki/DC-15A_blaster_rifle/Legends",
  "/wiki/Lair_of_Grievous",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/December_12",
  "/wiki/2008",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Star_Wars:_The_Clone_Wars_Character_Encyclopedia",
  "/wiki/March",
  "/wiki/2011",
  "/wiki/Canon",
  "/wiki/Video_game",
  "/wiki/LEGO_Star_Wars_III:_The_Clone_Wars",
  "/wiki/Rookies",
  "/wiki/The_Clone_Wars:_Grievous_Attacks!",
  "/wiki/Category:Audio_files_of_Fil",
  "/wiki/Category:Images_of_CC-3714",
  "/wiki/Star_Wars:_The_Clone_Wars:_The_Visual_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Clone_Wars_Season_One_Episode_Guide,_Part_One",
  "/wiki/Star_Wars_Insider_106",
  "/wiki/The_Art_of_Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars:_The_Clone_Wars:_Visual_Guide_Ultimate_Battles",
  "/wiki/Star_Wars:_The_Clone_Wars_%E2%80%93_The_Official_Episode_Guide:_Season_1",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_115",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.8",
  "/wiki/Star_Wars_Insider_118",
  "/wiki/LEGO_Star_Wars_III:_The_Clone_Wars:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.37",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(video_game)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/The_Clone_Wars:_Secret_Missions_4:_Guardians_of_the_Chiss_Key",
  "/wiki/Count_of_Serenno/Legends",
  "/wiki/Mission_to_Florrum",
  "/wiki/Ohnaka_Gang/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/The_Gungan_General",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/The_Clone_Wars:_Season_One#The_Clone_Wars:_Decoded",
  "/wiki/Databank_(original)"
 ]
}