{
 "name": "CC-3636",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown; right eye later silver from a prosthetic replacement"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic right eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Wolfpack",
      "Wolfpack"
     ]
    }
   ]
  }
 ],
 "content": "CC-3636, nicknamed \"Wolffe,\" was a veteran clone trooper commander in the Grand Army of the Republic who served with Jedi General Plo Koon during the Clone Wars. The leader of the 104th Battalion's famed Wolfpack squad, Commander Wolffe proved to be tireless in his efforts against the Confederacy of Independent Systems, displaying an affinity for strategy. In 22 BBY, on his first mission with Koon, Wolffe served on board the Jedi Master's flagship, the Triumphant, when Koon led a task force to eliminate the Separatist warship Malevolence. While confronting the Malevolence in the Abregado system, however, all of the Wolfpack was eliminated, save for Koon, Wolffe, and troopers Sinker and Boost. The four were rescued by Jedi General Anakin Skywalker and his Padawan, Ahsoka Tano, and Wolffe had his unit adopt new clone trooper armor in honor of his fallen comrades. Refusing to let the loss of the Wolfpack deter him from his service, he inspired loyalty amongst his men.\nWolffe's loyalty to the Jedi put him at odds with the ambitious Major Kendal Ozzel during the Battle of Khorm, in which they participated alongside Generals Koon, Kit Fisto, and Tauht. Though Wolffe lost his right eye in a fight with the Dark Acolyte Asajj Ventress, the Republic defeated the Separatists and liberated Khormai slaves, thus securing the planet's repositories of rare agrocite ore for the Grand Army. He subsequently utilized a cybernetic eye replacement and had a facial scar. Wolffe continued his military service to the Republic, undertaking several key rescue missions with Koon to Felucia, Vanqor, and Lola Sayu. He even joined Koon in challenging General Grievous during the Second Battle of Felucia and the following Mission to Iceberg Three. He personally oversaw a supply mission to the groundquake-devastated planet Aleen, assisted in liberating Togruta slaves from the Zygerrian Slave Empire on Kadavo, and took part in a 104th mission that recovered the lightsaber of the late Jedi Master Sifo-Dyas.\nClone Commander 3636, who earned the nickname \"Wolffe,\" was born on Kamino as a clone trooper to serve in the Grand Army of the Republic. During the Clone Wars, Wolffe was assigned to Jedi General Plo Koon, with whom he developed a close working relationship. Wolffe also led a squad in the 104th Battalion named the \"Wolfpack,\" which came to be reputed for being extremely close-knit; it was he who chose the unit's original colors.\nIn 22 BBY, on their first mission with Koon, Wolffe and the Wolfpack served aboard Koon's fleet when the Jedi Master was sent to find and destroy a Separatist superweapon that had been ambushing and ravaging Republic fleets. In actuality, the weapon was the ion cannon–equipped battlecruiser Malevolence, commanded by the Confederate General Grievous. As he was on an out-of-armor duty rotation, Commander Wolffe served as the first officer on board Koon's flagship, the Star Destroyer Triumphant. Tracking the superweapon to the Abregado system, Koon's task force of three Venator-class Star Destroyers arrived and approached the massive Separatist warship, which Wolffe reported to be holding its position. When Koon recommended that they report their position before commencing attack on the superweapon, Wolffe offered that Jedi General Anakin Skywalker's fleet was stationed in the nearby Bith system, and Koon and Wolffe made contact with Skywalker and his Padawan, Jedi Commander Ahsoka Tano.\nAs Koon requested reinforcements for the impending assault on the Separatist ship, the Malevolence's battle droid crew jammed the Republic's transmissions, severing Koon and Wolffe's HoloNet connection to Skywalker and Tano. The Malevolence converged upon Koon's fleet, and before the three Star Destroyers were able to get within firing range, the Confederate weapon fired one of its ion cannons at the task force. With their deflector shields disabled from the blast, the unprotected Triumphant and the rest of the fleet fell under turbolaser fire from the Malevolence. Koon immediately ordered his crew to flee in escape pods, and Wolffe accompanied Koon, Clone Sergeant Sinker, and trooper Boost in one of the craft. The four jettisoned shortly before the Triumphant was ripped apart by the intense laser fire. By the time the Malevolence's attack on the Republic forces was over, the entirety of the Wolfpack—save for Wolffe, Boost, and Sinker—had perished with the remainder of Koon's fleet.\nDrifting amidst the debris field that had been erected from the wreckage of the cruisers, Wolffe reported that their pod's power grid had burned out, limiting both communications and life support. While Sinker and Boost worked to restore the power, Wolffe questioned Koon if he believed that they had a chance, to which Koon replied that although he did not believe in chance, he knew that they would survive and be rescued if they worked together. Spotting another escape pod nearby, Wolffe mused that if only their own pod had power, they would have been able to contact the other survivors. When Koon used the Force to telekinetically rotate the pod, however, the Jedi and clone troopers were met with a grim surprise—the pod's viewport had been split wide open, its dead passengers floating in the vacuum of space. After Sinker and Boost were finally able to reactivate their pod's power, Wolffe picked up a signal from another life pod, Pod 1977. Wolffe soon spotted the pod, which was under attack from a Separatist Droch-class craft and several rocket battle droids. Unable to help the other pod, Koon and the troopers were forced to watch as the B1-Series battle droids split open the pod, submitting the craft's clone survivors to the airless vacuum of space. By that time, Koon, Wolffe, Sinker, and Boost were the only survivors of the battle, as the remainder had been hunted down and eliminated by the Confederacy.\nHaving been spotted by the rocket battle droids, Koon decided to personally confront the enemy, as his species was able to withstand the pressure of space for a brief amount of time. Sinker and Boost utilized their armor suits' oxygen supply and accompanied Koon, leaving the armor-lacking Wolffe inside the pod to keep its communication signal alive—as it was the only chance of being found and rescued. Just as the Separatist craft latched onto the life pod with its pincers, Koon, Sinker, and Boost appeared to the battle droids and engaged their adversaries in combat. While the droids retreated into their own craft and activated its \"squeeze\" mechanism to crush the pod, Wolffe picked up a signal from Ahsoka Tano, who had arrived in the system with her Master, Anakin Skywalker, to search for the survivors of the encounter with the Malevolence. Yet, the Separatists' damage to the pod caused Wolffe to lose the signal before he was able to return a message to Tano. Koon severed the Confederate vessel's pincers, breaking its hold on the pod, and then Force-pushed the craft away, causing it to hit some nearby debris and explode. Skywalker and Tano eventually found the escape pod floating amongst the debris field and pulled it into the rear cargo hold of Skywalker's freighter, the Twilight. After the survivors were inside the vessel's airlock, Skywalker freed Wolffe from the damaged pod by pulling off its viewport with the Force. Skywalker supported the coughing and weakened Wolffe before lowering him to sit beside Sinker and Boost against the life pod.\nLeaving the clones to recover in the Twilight's cargo hold with the ship's medical droid, TB-2, to tend to them, Koon went to debrief the failed attack on the Separatist superweapon with Skywalker and Tano on the freighter's bridge. The Malevolence itself soon approached the Twilight in search of the destroyed Droch-class craft, and the Jedi were forced to shut down all of the freighter's systems to avoid detection. With the cargo hold's lights disabled, Wolffe deduced that the power had gone out and suspected that the Separatist ship had returned. Despite his weak condition, Wolffe attempted to get up to the bridge to find out what was wrong. Yet he nearly collapsed, and TB-2 caught him and went to check on the situation for the clones. Picking up the signal from the Twilight's still-active medical droid, the Malevolence fired its ion cannon at the freighter, but the Republic ship was able to avoid the ion wave by escaping the debris field and jumping to hyperspace. The Twilight rendezvoused with the Republic fleet, and aboard Skywalker's flagship, the Resolute, Wolffe thanked both Skywalker and Tano for rescuing them, glad that Koon's admonitions that someone would find them had come true.\nAlthough the Wolfpack was replenished with new troops, the loss of the original unit hardened Wolffe and his attitude. In honor of his comrades that had fallen to the Malevolence, Wolffe had his clone trooper armor's design changed from the Wolfpack's original symbols and colors to a new design, which his troops also adopted.\nLater in the war, Wolffe was dispatched alongside Jedi Masters Plo Koon, Kit Fisto, and Tauht, as well as the ambitious and recently promoted Major Kendal Ozzel, to the planet Khorm in order to secure its deposits of agrocite, a rare ore that granted exceptional power to starfighters. However, the Separatists had already arrived on the planet and, under an alliance with native Khormai Warlord Unger Gout, had enslaved the majority of the planet's species and put them to work in an agrocite processing facility. After landing on Khorm during a storm, the Republic deployed its forces to attack the processing plant. En route to the facility with a squad of All Terrain Tactical Enforcers, Wolffe—who had donned cold assault armor as protection from Khorm's icy climate—conferred with Fisto on the subject of Koon, whose age had been of much recent debate in the clone commander's unit and whose curious manner had sparked the clone's curiosity.\nWolffe and Fisto met with Koon himself atop an AT-TE walker before rendezvousing with Adaroo and others of the Republic's Khormai allies. As the Republic forces approached the Separatist processing plant, Warlord Gout's J-1 semi-autonomous proton cannons attacked the AT-TE walkers in defense of the agrocite facility. Ozzel ordered the clone troops to disembark, and Wolffe and Adaroo followed as Generals Koon, Fisto, and Tauht led the attack. After the walkers were in position, Ozzel commenced fire on the Separatist cannons, destroying them and forcing Gout to flee from the facility on a rail jet. With the processing plant secured, the Republic forces established a command post at their newly won position. Wolffe and Ozzel met with the Jedi Generals to discuss the primary objective at hand—liberating the Khormai slaves in the mine. While the major petitioned for a direct assault on the mine, Koon maintained that such an attack would cost them too many casualties.\nReceiving word from Admiral Wieler and the Republic fleet in orbit of Khorm that a Separatist ship—Dark Acolyte Asajj Ventress's Trident—had somehow reached the surface through an opening in the ongoing storm, the Jedi realized that the Separatists possessed a sort of weather-control station. Believing that air support would be able to participate in the impending assault on the mine if the storm were to stop, Koon and Fisto departed with the Devil Dogs unit to eliminate the Confederate station, leaving Ozzel, Tauht, and Wolffe at the Republic base, with Tauht in command. The Republic's recently established base soon came under attack by Ventress and a deployment of Separatist battle droids. Ventress killed Tauht, leaving Ozzel in overall command of the Republic forces. While Ozzel ordered his troops to charge on the Separatist lines, Wolffe maintained that they should obey the Jedi's orders for holding the facility, but Ozzel refused to idly wait for the Separatists to attack again. As the Republic forces charged, however, a large amount of DSD1 dwarf spider droids appeared and surrounded them, forcing Ozzel to surrender. Wolffe, Ozzel, and several clone captives were taken to be interrogated at the agrocite processing plant. There, despite Wolffe's admonitions to keep silent, Ozzel—influenced by the fear of death, which Ventress had invoked by beheading of two of the clones—betrayed the Jedi's mission.\nWolffe, Ozzel, and their men were only saved from death at the Dark Acolyte's hand by Gout, who instead had Wolffe, Ozzel, and troopers Spitter and Comet imprisoned. While Ozzel attempted to justify his actions, the clones were able to cut through their cell's lock. Wolffe and his comrades commandeered an Armored Assault Tank to make their escape, cutting through the facility's droid forces and blasting out of the base. Returning to the Republic command post, Wolffe stated that they should contact Koon and Fisto, while Ozzel, believing them to be dead, ordered the clone commander to mobilize the transports and rendezvous with the fleet to prepare a counterattack. Before the Republic forces escaped, however, Confederate tanks led by Ventress appeared and assaulted the base once more. With their transports frozen and their heavy armor destroyed in the first offensive, the Republic forces were trapped. Wolffe protected Ozzel—who was fully prepared to surrender—and gave the order to retreat to the ships. Before Ventress and her battle droid forces could exterminate the Republic detachment, the Jedi's elimination of the weather-control station allowed Admiral Wieler and the Republic fleet to move in. The approaching LAAT/i gunships and V-19 Torrent starfighters forced the Dark Acolyte and her army to retreat. While Ozzel took credit for the victory, Wolffe was able to contact the Jedi, bringing them up to date on the situation.\nAs Koon and Fisto reconnoitered the Separatist mine in preparation for an assault on Gout's final position, Ozzel mobilized the Republic troops for an assault on the facility. Though he did not agree with Ozzel's orders—since the Jedi had intended to scout out the mine before besieging it—Wolffe began preparations for the coming battle with troopers Sinker and Boost. When the Republic's attack on the mine began, Wolffe accompanied Ozzel as he led the Republic forces from an LAAT/i gunship. However, Gout loaded several agrocite cannons and targeted the approaching task force. An Acclamator-class transport was ripped apart by the heavy fire, and a shocked Ozzel panicked before being knocked out in the subsequent retreat. In Ozzel's place, Wolffe led a ground assault on the mine with a line of AT-TE walkers. After Fisto eliminated the agrocite cannons, Wolffe and a squad of troops arrived to assist Koon in his ongoing lightsaber duel with Ventress, who was preparing to detonate explosives planted in the mine. Koon Force-pushed the Dark Acolyte's detonator away from her, allowing Wolffe to personally shoot the remote. In making her escape, Ventress slashed at Wolffe, gouging out his right eye.\nBack at the command post, Wolffe was bandaged and witnessed Ozzel's promotion to captain by Supreme Chancellor Palpatine. After Ozzel's promotion, Wolffe once again inquired after Koon's age, and Koon told Wolffe and Fisto that he was 382 Kel Dor years old, though he left the two to figure out how long that meant. Wolffe's facial injury in his fight with Ventress left him with a large scar across the side of his face, and he used a silver cybernetic eye replacement for his lost eye.\nFollowing the Battle of Khorm, Wolffe and Koon were dispatched with a three-cruiser fleet of Venator-class Star Destroyers, including the Star Destroyer Negotiator, to support an ongoing Republic battlefront: the planet Felucia, where Republic forces had been trapped by a Separatist blockade and an overwhelming force from the Separatist Droid Army. While Koon led several LAAT/i gunships and an escorting squadron of V-19 Torrent starfighters to rescue the Jedi and clones stranded on Felucia's embattled surface, Wolffe oversaw the Republic fleet's assault on the Confederate flotilla from the bridge of one of the Star Destroyers, having his cruisers exchange heavy turbolaser fire with the Confederate Munificent-class star frigates. Once the Republic Navy's Hunter Squadron had destroyed one of the enemy frigates, Koon and his rescue ships were able to secure passage through the besieged blockade, making it past the first wave of Vulture droid starfighters. Wolffe subsequently had his Star Destroyer concentrate its fire on one of the approaching Separatist frigates. Although the Republic was forced to pull out from Felucia, Koon was able to rescue Anakin Skywalker, Ahsoka Tano, Master Obi-Wan Kenobi, and their remaining beleaguered troops.\nWhile serving with Koon away from the galactic capital of Coruscant, Wolffe and his Jedi General remotely witnessed General Grievous report his capture of Jedi Master Eeth Koth over a holotransmission broadcast directly to the Jedi Temple communication center, in which Grievous also brutally tortured the captive Koth. Wolffe noticed that Koth was using discreet hand gestures to disclose his location to the Jedi, and he informed Koon of Koth's exploit once the transmission had ended. Koon relayed Wolffe's discovery to the other Jedi back at the Jedi Temple and had them play back the transmission, leading to the localization of Grievous and the hostage Koth in the Saleucami system. Thanks to Wolffe's observation, the Jedi were able to mount a rescue mission and free Koth from Grievous's clutches.\nWhen word reached the Jedi Temple that Generals Anakin Skywalker and Mace Windu had been stranded on the planet Vanqor by bounty hunters, Wolffe, Koon, and Ahsoka Tano immediately left with troops from the Wolfpack to rescue them. Wolffe and the Jedi led a force of three LAAT/i gunships to Vanqor, where they found Skywalker and Windu trapped under layers of debris in the bridge section of the crashed Star Destroyer Endurance. As the Endurance's bridge began to crumble, Koon and Tano held the section steady with the Force, and the Wolfpack troopers added their assistance by attaching their DC-15A blaster rifles' grappling hooks to the span. With their comrades holding the bridge section in place, Wolffe and trooper Comet scaled the gap between the two ships and jumped across to rescue Skywalker and Windu. Wolffe and Comet freed the two Jedi Generals from the rubble and helped them back to the gunship, returning moments before Tano was forced to cut the cables connected to the Endurance. All three of the gunships pulled out of the area just as the entire bridge section was compromised, sparking a chain of explosions that consumed the Endurance. After briefly touching down at a staging area so that the wounded Skywalker and Windu could be properly loaded aboard stretchers, the group departed Vanqor, their rescue mission a success.\nIn 21 BBY, in the course of the continuing war, Wolffe assisted Koon in the rescue of a Republic team from the Separatist-held planet Lola Sayu, which was home to the feared prison known as the Citadel. The elite Republic squad—led by Skywalker, Tano, and Obi-Wan Kenobi—had infiltrated the Citadel to free Jedi Master Even Piell and Captain Wilhuff Tarkin, who had been captured and incarcerated in the installation for their discovery of the Nexus Route, a series of strategically valuable hyperspace lanes. While rescuing Piell and Tarkin, however, the Jedi's team had lost their ship, necessitating an extraction. Koon, Wolffe, and the Wolfpack subsequently set out to rescue the stranded team before the Separatists could recapture them.\nA four-cruiser fleet of Republic Star Destroyers took Koon, Wolffe, and Jedi Masters Saesee Tiin, Adi Gallia, and Kit Fisto to Lola Sayu, where the Republic launched a full-on assault on the Separatist blockade of the world. With Tiin, Gallia, and Fisto providing starfighter cover, Koon, Wolffe and Comet were deployed to the planet's surface in a space gunship to retrieve Skywalker, Kenobi, Tano, Piell, Tarkin, and their men. Although Piell had already been killed in the fight against the pursuant Separatists, the remainder of the team was holding position at the rendezvous point—a small island in the middle of a lake of sulfurous lava. Just as LM-432 crab droids were about to overrun the squad, Koon and Wolffe arrived with their gunship, and Tarkin and the others were able to escape from Lola Sayu aboard the craft. Once Koon and Wolffe had brought the freed prisoners to the Republic fleet, the four Star Destroyers jumped to hyperspace and returned to the Jedi Temple on Coruscant, where the Republic began debriefing on the Nexus Route intelligence.\nAfter the Wolfpack underwent some more armor modifications, Wolffe and Koon joined Skywalker and Tano on Felucia, where the Republic was battling the Confederacy for control of the strategic world. As the Jedi pressed their assault into Separatist-held territory, General Grievous dispatched battle droid reinforcements aboard a C-9979 landing craft to one of his outposts on Felucia to secure his grip on the system. To attack Grievous's troops at the source, Koon, Skywalker, Tano, Wolffe, and Clone Captain CT-7567, nicknamed \"Rex,\" proceeded to the droid outpost with their troops. Just as Grievous's reinforcements were being deployed, Koon developed a three-part strike plan to divide and conquer the droids' defenses: while he and Wolffe assaulted the outpost's left flank, Skywalker and Rex would attack the front gate, and Tano would breach the base's rear entrance. Once all of the Jedi's forces had moved into position, Koon had the Republic's AT-TE walkers open fire on the droid outpost from an adjacent ridge. While Skywalker and Rex battled the droids at the front gate, Koon led the way to the top of the base via a Force Jump, and Wolffe and the Wolfpack followed with their JT-12 jetpacks.\nKoon, Wolffe, and their men cut through the battle droids on top of the base before joining Skywalker's men on the ground, where—with the aid of Comet, Sinker, Boost, and the others of Tano's Wolfpack division—they captured the outpost's command center and destroyed the remainder of the battle droids, including the base's T-series tactical droid commander, TZ-33. Unbeknownst to her comrades, however, Tano had been captured by Trandoshan hunters during the battle and had been taken to the Trandoshan moon of Wasskah, to be subjected to a ritualistic and brutal Trandoshan hunt. Although Tano was nowhere to be found at the Felucian outpost the next morning, Skywalker, Koon, Wolffe, Rex, and their men were forced to pull out from Felucia and return to Coruscant without her, though Koon relayed the matter of the missing Padawan to the Republic's intelligence assets throughout the rest of the Outer Rim Territories and within the Confederacy itself. Tano was eventually rescued and returned to the Jedi Temple alongside Skywalker and Koon.\nFollowing the victory on Felucia, Grievous led a Separatist invasion of the Calamari system, home to the Mon Calamari shipbuilders who were crucial to the Republic war effort. After Mon Calamari King Yos Kolina petitioned for Republic assistance to combat Grievous's invasion, Koon, Wolffe, a Jedi Knight, and the 104th Battalion were dispatched to reinforce the Calamari system. Upon arrival in the Calamari system, Koon's task force discovered that the situation was far worse than previously believed: a comet named Iceberg Three was the only Republic position left to defend the system against complete Separatist control. Thanks to the Jedi Knight's leadership of the Republic starfighter squadrons, Koon's fleet was able to reach Iceberg Three's Republic outpost with minimal casualties, and Wolffe and his men were deployed on the comet with cold assault gear. As the Jedi High Council had to be notified of the Republic's slipping hold on the Calamari system, Wolffe and the Jedi Knight took a single LAAT/i gunship to the last standing communications tower on the comet, cutting through waves of battle droids and droid starfighters to reach the tower. Once they had relayed the news of Grievous's invasion to the High Council, Wolffe and the Jedi Knight returned to the Republic outpost. There, Wolffe and the Jedi Knight found that Iceberg Three's civilians were being evacuated off-world to a Republic base on the nearby planet Mon Eron, under the threat of an impending Separatist assault on Iceberg Three.\nAs Koon held off the Confederate attack fleet in orbit of the comet, the task of protecting the LAAT/i evacuation transports until their departure fell to Wolffe and the Jedi Knight. The 104th Battalion quickly set up defensive turret platforms along the route to the Republic base, just as Grievous launched his assault on the outpost. While the Jedi Knight oversaw the defensive turrets, Wolffe led the Wolfpack into battle against Grievous's ground forces, defending the two paths leading to the outpost and only stopping to re-supply with ammunition. Wolffe and the Jedi Knight were able to hold off the invaders long enough for all three waves of the Republic's refugee transports to depart. Just as the 104th Battalion prepared to retreat from Iceberg Three, Grievous landed at the outpost to personally lead his forces to victory. Wolffe and his men left the task of battling Grievous to the Jedi Knight, who managed to defeat the Separatist general in a one-on-one lightsaber duel.\nWith the Separatists temporarily pushed back, Wolffe, the Jedi Knight, and the 104th Battalion evacuated from Iceberg Three to Koon's fleet in orbit. Upon meeting with Koon, Wolffe was alarmed to learn that Yos Kolina had been assassinated—with the king gone, tensions were quickly escalating between the Mon Calamari and their Quarren neighbors. In response to the loss of Kolina, the Republic dispatched Anakin Skywalker and Senator Padmé Amidala to quell the ensuing turmoil on Mon Cala, though the Separatists also sent their own envoy, Commander Riff Tamson. Despite the rising prospect of civil war on Mon Cala, Koon, Wolffe, and their Jedi Knight companion took solace in the fact that they had saved the civilian lives on Iceberg Three. In the resulting Battle of Mon Cala, the Republic was able to resolve the Mon Calamari–Quarren tensions and secure the Calamari system against the Confederacy, which was revealed to be responsible for Kolina's murder.\nWhen the Confederacy moved to annex the Qiilura system, Wolffe and the 104th Battalion were dispatched aboard an Acclamator-class transport to thwart the Separatists' plans. En route to block the annexation, Wolffe and his men were reassigned to deliver desperately needed humanitarian supplies to the Republic-allied world Aleen, where catastrophic groundquakes had inflicted mass casualties among the native Aleena species. Wolffe proceeded to Aleen with his transport and a trio of Pelta-class medical frigates. After his sensor crews located clusters of Aleena survivors numbering in the thousands, he reported his discovery of the refugees to Senator Padmé Amidala and Jedi Grand Master Yoda, who were pleased to learn that many had lived through the disaster. Moving in on Aleen with orders to unite with Koon, therefore providing the Jedi General with reinforcements, once they were finished, Wolffe took several LAAT/i gunships, LAAT carriers with AT-TE walkers, and a single Pelta-class frigate to the surface to deliver the relief supplies, while the rest of their task force remained in orbit. The 104th Battalion brought along the protocol droid C-3PO to translate the Aleena's native language and the astromech droid R2-D2 to restore Aleen's computer systems, which had sustained damages from the catastrophe.\nLanding at an Aleena refugee zone, Wolffe and his men met with King Manchucho, the leader of the Aleena. With C-3PO serving as a translator, Manchucho welcomed the 104th Battalion to Aleen and promised to provide them with food and shelter during the duration of their stay on the world. An aftershock from the groundquakes suddenly shook the area, and Wolffe quickly dispatched his trooper squads to scan for unstable ground and designate hazardous zones. While 104th troops and CLL-M2 ordnance lifters offloaded the provision crates, Wolffe had Sergeant Sinker, Boost, and other members of the Wolfpack complete their priority assignment on Aleen: repairing the world's mainframe computers with R2-D2, who had been entrusted with the Republic's manuals for new equipment that would be left with the Aleena.\nPassing over Manchucho's peculiar request for them to \"make peace in the ground,\" Wolffe and his men established a temporary hospital and communal kitchen at the Aleena's refugee camp. When Manchucho refused the kitchen and again requested their assistance for the supposed subterranean trouble, Wolffe grew impatient and left, ordering C-3PO to report back once R2-D2 finished downloading the computer mainframe. Wolffe also recalled Sinker, Boost, and their team from the mainframe station back to the staging area. The Aleena soon asked C-3PO and R2-D2 to travel into their planet's subterranean wilderness, which had been the source of the devastation, to prevent the advent of more groundquakes. C-3PO and R2-D2 were able to restore the separation between Aleen's surface and subsurface peoples, and the groundquakes were put to a stop. With their assignment completed, Wolffe and the 104th Battalion were instructed to rendezvous with Jedi Master Adi Gallia. As the Wolfpack departed with C-3PO and R2-D2 aboard several gunships, Wolffe agreed with his troops that they would offload the talkative protocol droid and his companion at the earliest opportunity.\nOnce they had transferred R2-D2 and C-3PO to Gallia's flagship, Wolffe and the Wolfpack rendezvoused with Koon's fleet. However, Gallia was soon captured by General Grievous, and Koon consequently staged a mission to rescue her from Grievous's Providence-class carrier/destroyer. After finding Grievous's destroyer, Koon's fleet assaulted the warship while a boarding party was prepared to retrieve Gallia. Bringing several squads from the Wolfpack along, Wolffe and Koon boarded Grievous's destroyer and battled through its B1 battle droid defenses. Wolffe personally took several men to rescue Gallia from the bridge, while Grievous escaped in the midst of the battle. After rejoining Koon in his fight against the battle droids in one of the ship's corridors, Wolffe reported Grievous's retreat to Koon, who issued out orders to finish off the warship's remaining droid forces. Wolffe was then stunned to find C-3PO and R2-D2, who had managed to stow aboard after a harrowing series of adventures that had started with the destruction of Gallia's flagship, during Grievous's capture of Gallia. As the group moved on to defeat Grievous's remaining embarked forces, Wolffe was resignedly subjected to another conversation with C-3PO, who at length began to describe all of his recent experiences to him.\nWolffe, Koon, and the 104th Battalion were called in for support when Anakin Skywalker and Ahsoka Tano set out to liberate a group of 50,000 Togruta colonists from the planet Kiros, who had been enslaved by the Separatist-backed Zygerrian Slave Empire. The Togrutas were being held at a slave-processing facility on Kadavo alongside Obi-Wan Kenobi and Captain Rex, who had been captured during an investigation on Zygerria. Skywalker and Tano went ahead to the Kadavo system aboard the Zygerrian slave ship Tecora, with Koon, Wolffe, and their fleet officer, Admiral Coburn, following with a Venator-class Star Destroyer and the Arquitens-class light cruiser Hand of Justice. While Koon and clone pilot Warthog led the starfighter assault on the facility's aerial defenses, Coburn and Wolffe commanded the Hand of Justice, which was to be used to rescue the Togruta slaves. Although they had intended to retrieve the colonists from the landing platform, Keeper Agruss and his fellow Zygerrian slavers locked the Togrutas in an electrified holding cell, with the floor receding inward so as to drop them into the crater below.\nWith the Togrutas unable to reach the landing pad, Tano devised a plan for Coburn to bring the Hand of Justice underneath the facility so that the slaves could escape onto the light cruiser's hull. Once Coburn had brought the cruiser underneath the holding cell, Wolffe took Sinker, Comet, and two other Wolfpack troopers top-side, hovering overhead with jetpacks and firing ascension cables onto the opening holding cell. Tano, who had joined the Togruta slaves to aid their escape, directed them to use the cables to reach the Hand of Justice. Sinker and Comet even caught two Togrutas who lost their footing and fell from the cell's receding floor. As soon as everyone was aboard, Wolffe took them back to safety in the main cabin. On Koon's orders, the LAAT/i gunships of their extraction team fired upon the supports of the building, and the slave-processing facility tumbled into the depths of the crater. Koon and Wolffe later joined Skywalker, Tano, Rex, and Kenobi aboard the Star Destroyer to debrief the successful mission. Governor Roshti, the leader of the Togrutan colony, even considered forgoing his people's neutrality in the war to join the Republic, which the Jedi believed would be a wise choice.\nWhile Wolffe was serving with a Republic task force, a crashed Munificent-class frigate led their detachment to the remote world Carlac, where they discovered an entrenched presence of the Mandalorian splinter group known as the Death Watch. After establishing an outpost, Wolffe dispatched a squad of his troops to eliminate the remaining battle droids at the frigate's crash site, though intelligence was soon uncovered that the Death Watch had set up several training camps on Carlac. Upon learning of the Republic's arrival, the Death Watch leader, Pre Vizsla, took a native village hostage, threatening to raze the entire encampment to the ground if Wolffe and his men did not withdraw from Carlac immediately. Because his troops were already spread thin, Wolffe sent a Jedi Knight to destroy the training camps and free the village from Vizsla's grip. The Jedi targeted the enemy sites, in part thwarting the Death Watch's control of Carlac.\nIn 20 BBY, Wolffe was invited to attend the Republic strategy conference on the Valor space station in orbit of Carida, alongside several other clone commanders, including CC-8826 and CC-2224, nicknamed \"Neyo\" and \"Cody,\" respectively. Anakin Skywalker, Obi-Wan Kenobi, Mace Windu, and other Republic naval officers were also in attendance. Just as the meeting was about to start, the Separatists attempted to sabotage the conference by ramming the Valor station with the Star Destroyer Renown, which had been laden with Rhydonium ore explosives, but the intervention of Colonel Meebur Gascon's D-Squad saved Wolffe and his comrades, as the astromech R2-D2 detonated the explosives before the Renown crashed into the Valor.\nIn 19.1 BBY, the final month of the war, Ahsoka Tano was framed for the murder of Letta Turmond, the orchestrator of a bombing at the Jedi Temple. Tano escaped from Republic Military custody at the Republic military base on Coruscant, venturing into the Coruscant underworld to search for a way to clear her name. Believing that Tano was responsible for Turmond's murder, the Jedi High Council subsequently assigned Koon and Skywalker to track down the fugitive Padawan, with Wolffe and Captain Rex bringing along clone contingents from the Grand Army's Coruscant Guard and 501st Legion, respectively. Deploying on separate Republic police gunships, Koon's and Skywalker's search teams descended into the ventilation shaft portal to the underworld, first heading to Level 1312 to follow a lead from the lower-level police. Upon reaching Level 1313's terminal 24, Wolffe and his comrades spotted Tano absconding with Separatist agent–turned–bounty hunter Asajj Ventress. Tano and Ventress activated the terminal gate's ray shield, thwarting direct pursuit and leading Skywalker to dispatch a group of probe droids after the two fugitives. Wolffe and his team of Coruscant Guard shock troopers then disembarked from the police gunship to monitor the probe droids' on-site findings.\nBefore long, Wolffe learned from one of the probe droids that Tano had been glimpsed further down on Level 1312, and he immediately took his troopers to apprehend them. Upon being cornered and held at blaster-point by Wolffe's men, Tano attempted to order them to back down, but Wolffe refused to let her escape. A brawl ensued, with Ventress activating her lightsabers and cutting through the clone soldiers' blasters. Tano also joined the fight, making sure that she and her criminal accomplice did not harm the troopers beyond rendering them unconscious. Wolffe grappled with Ventress, grabbing her from behind and lifting her off her feet, but she broke free of his grasp before knocking him into a pillar. Winded like the rest of his men, Wolffe was unable to prevent the pair of fugitives from escaping, though he notified Koon that Ventress had been involved with Tano's getaway.\nWolffe and his team caught up with Tano at an abandoned munitions warehouse on Level 1315, finding her in a lower storage room. Although Tano pleaded with Wolffe to let her explain, he stunned her unconscious before she could utter another word, just as Koon and Skywalker arrived on the scene. To Skywalker's alarm, Wolffe's inspection of the crates revealed that they contained nano-droid explosives, of the same model that had been used to bomb the Jedi Temple. Wolffe and Rex brought the still-stunned Tano onto one of the police gunships with Koon and Skywalker, who reported to Masters Yoda and Mace Windu during the flight back to the Jedi Temple. With the evidence stacked against her, Tano was expelled from the Jedi Order and put to trial for her alleged part in the bombing of the Temple. Though it was discovered that fellow Jedi Barriss Offee was the true culprit, having worked with Turmond and then framed Tano for her crimes, Tano chose not to rejoin the Order when the High Council offered her readmittance.\nLater in the war, the Jedi Temple received a distress signal emanating from a ship that was last recorded to be in the possession of the late Jedi Master Sifo-Dyas, who had gone missing over a decade prior. Wolffe and the 104th Battalion accompanied Koon aboard a Star Destroyer to investigate the signal's origin: the desert moon of the planet Oba Diah. After being outfitted with sand-proof gear, Wolffe and his fellow 104th troopers proceeded to the moon's surface with a number of AT-TE walkers and HAVw A6 Juggernauts. While Comet and other troopers embarked into the rising sandstorm, Wolffe and Koon remained inside one of the Juggernauts, monitoring their troops' findings. Though Comet voiced skepticism after three failed scans that their purported ship was on the moon, Wolffe asserted that their information pinpointed it was nearby. Presently, a clone trooper who was monitoring their Juggernaut's scanners verified Wolffe's claim, showing Wolffe and Koon a faint trace of a crash site just up ahead of their search party. Koon verified the discovery and moved in with Wolffe for a closer look.\nAs Comet issued the order to halt all vehicles, Wolffe and Koon entered the churning sands outside and found the crash site. They entered the wreckage of the ship: a T-6 shuttle, with Wolffe identifying its serial number as 775519. He also noted the substantial scoring along the shuttle's hull, theorizing that the ship must have crashed on the moon a long time ago. When Koon came across Sifo-Dyas's lightsaber buried in some sand in the cockpit, he ordered Wolffe and their team to excavate the entire wreckage for transport back to Coruscant. Upon receiving Koon's initial report of the discovery, the Jedi High Council reopened the investigation into the death of Sifo-Dyas, who—as the Kaminoans had revealed to Obi-Wan Kenobi, just prior to the Battle of Geonosis—was responsible for commissioning the creation of the clone troopers.\nA veteran of the Clone Wars, CC-3636 was a practical strategist and harbored a natural ability for problem-solving and strategy. A seasoned trooper and a brilliant leader, he used his extensive battlefield experience to lead his men through the challenges of combat. He was perceptive, as displayed by his observation of Eeth Koth's hidden hand signals over a holotransmission. As a man of action, he was tireless in his efforts against the Separatists and took his cue from Jedi General Plo Koon's ferocity in battle, as did the rest of the Wolfpack. Serving with Koon throughout the war, Wolffe became acquainted with the Jedi Master, whose curious manner drew the clone's interest. Wolffe's manner was such that Koon came to place a great amount of trust in his instincts and abilities. He earned his men's trust to the point that they were willing to do anything under his leadership. Wolffe witnessed and endured some of the worst experiences that the war had to offer, particularly the loss of his entire Wolfpack command during the Battle of Abregado. He was frustrated when he was unable to assist his comrades Sinker and Boost in helping Koon confront the pod hunters, as he lacked the proper space-proof equipment due to his out-of-armor rotation. Even when injured, Wolffe retained his perception; when the lights in the Twilight's cargo hold went out, he deduced that the power had been shut down and was determined to reach the freighter's bridge in spite of his condition. He was also grateful to Skywalker and Tano for rescuing him and his squad. The experienced ultimately hardened him, making him into something of a curmudgeon.\nDespite the losses at Abregado, Wolffe fought on under Koon's command, proudly brandishing his battle scars and inspiring loyalty among his men. In honor of his deceased comrades, he had his unit's original colors changed to remember the men who perished at Abregado. In several missions, Wolffe worked closely with Koon's fleet officer, Admiral Coburn, to coordinate assignments for maximum effectiveness on the battiefield. During the Battle of Khorm, Wolffe's dedication and loyalty to the Jedi often put him at odds with the ambitious Major Kendal Ozzel, who—unlike Wolffe—operated separately from the Jedi and disobeyed their orders to promote his own reputation. While under interrogation by Asajj Ventress, Wolffe told Ozzel not to reveal the Jedi's whereabouts; however, Ozzel betrayed the Jedi's mission to the enemy commander to protect his own life. Wolffe proved to be more focused than Ozzel, taking command and protecting Ozzel when the major himself panicked. Though Wolffe often scorned Ozzel and his frequent faltering, he followed the chain of command and obeyed the major's orders. He opted not to take credit for the successful defense of the Republic base when Ozzel—who had, in fact, done nothing but panic—claimed it for himself.\nWolffe favored military service over more tedious assignments, and his patience was tested during the supply mission to Aleen by C-3PO, whose overly loquacious manner irked him. Although he recognized the importance of delivering relief supplies to the needy Aleena, Wolffe was anxious to return to the front lines with Koon. He disregarded the Aleena's eccentric customs, including their frequent ceremonial chants, and was eager to end his stay on Aleen as soon as possible. Strictly adhering to his orders, he could not understand King Manchucho's odd calls for peace with Aleena's underworld people and dismissed such entreaties as nonsense. In the absence of C-3PO's translation services, Wolffe did not pay much attention to Manchucho's concerns. Following their departure from Aleen, Wolffe was determined to offload C-3PO as soon as the opportunity presented itself, a desire that his men shared.\nA Human clone, Wolffe spoke Galactic Basic Standard, and he was talented in military strategy and leadership skills. He was trained in combat—including blaster combat—and was skilled in the use of a jetpack. He stood 1.83 meters tall and had tan-colored skin, black hair, and brown eyes, the right one of which was gouged out by Ventress during the Battle of Khorm. Besides bearing a facial scar from the injury, Wolffe wore a silver cybernetic replacement for his lost eye.\nWolffe's battle-worn Phase I clone trooper armor initially sported maroon colors and the wolf design of the Wolfpack. However, after the loss of the Wolfpack at the Battle of Abregado, he had his armor changed to honor his fallen comrades. This new version displayed dark blue colors and a helmet with a redesigned wolf design and unit markings, and his own armor was specifically equipped with a scope, a silver visor, and a traditional kama half-kilt to repel shrapnel. Much of his armor was painted with dark blue stripes that matched the wolf symbol on his helmet. His right shoulder plate was also decorated with a wolf insignia, and his left plate sported a striped symbol. On Khorm, Wolffe donned a suit of blue-marked cold assault armor, complete with a thermal suit and a rebreather hood, to protect himself from the planet's cold climate.\nFollowing Wolffe's post–Battle of Abregado adjustments, the Wolfpack's armor was modified a second time prior to the Second Battle of Felucia. The unit adopted black markings instead of their dark blue ones, and Wolffe redesigned his helmet with plainer stripes in place of the wolf symbol. He developed a set of cold assault armor based on his new black-accented armor and utilized it on Iceberg Three. Prior to the relief mission to Aleen, Wolffe had the 104th Battalion's armor updated to the Phase II set of clone trooper armor. His custom suit, which maintained his intimidating look, included an upgraded helmet decorated once more with his wolf design. He donned a suit of heavy sand-proof armor for the assignment on Oba Diah's desert moon.\nIn combat, Wolffe mainly utilized DC-17 hand blasters and thermal detonators as needed, though he also used a DC-15S on Khorm. In addition, he was capable in the use of a jetpack and used one alongside his troops during the Second Battle of Felucia. Wolffe owned a missile launcher at some point.\nThe character of Wolffe was created for the Star Wars: The Clone Wars television series. First given a short entry in the 2008 Star Wars: The Clone Wars: The Visual Guide publication, Wolffe made his debut in the episode \"Rising Malevolence,\" which aired in the series' October 2, 2008 premiere. Like all clone troopers throughout the series, he was voiced by Dee Bradley Baker. In the episode's script, Wolffe was originally not named; his character's name was developed in subsequent source material. Wolffe was later given a role in the Summer 2009 In Service of the Republic story arc of the Star Wars: The Clone Wars comic series, published by Dark Horse Comics. His clone designation was revealed in the first installment of the story arc. \"Wolffe\" is a cheat code for the online game Live Fire that gives the player a 60-100% accuracy rating. The code is second most powerful in the game, bested only by \"Droidbait,\" which boosts the rating to 80-100%.\nWolffe's first appearance in the television series with his cybernetic eye was in the episode \"Holocron Heist,\" which aired in October 2009 as the premiere for the series' second season.\" He was additionally given brief roles in the Spring 2010 episodes \"Grievous Intrigue\" and \"R2 Come Home,\" and he was later given entries in the Star Wars: The Clone Wars Character Encyclopedia and the Star Wars: The Clone Wars: New Battlefronts: The Visual Guide publications. His blue-marked armor in the second season was used as the basis for his LEGO minifigure, which was released in 2011.\nIn Spring 2011, Wolffe continued his recurring role in the television series with appearances in the third season episodes \"Citadel Rescue\" and \"Padawan Lost.\" After being featured in the \"Mission on Iceberg Three\" campaign of the Star Wars: Clone Wars Adventures video game, he was debuted in Phase II clone trooper armor in the fourth season episodes \"Mercy Mission\" and \"Nomad Droids,\" which were released in October 2011. Series Supervising Director Dave Filoni personally designed Wolffe's Phase II armor for the episode, basing his new helmet visor on that of Clone Commander Neyo in the film Star Wars: Episode III Revenge of the Sith. As part of his appearance in the fourth season, Wolffe received an entry in the StarWars.com Encyclopedia. Wolffe was again featured in the fourth season episode \"Escape from Kadavo,\" which aired in January 2012. The episode was part of the television series' adaptation of the Slaves of the Republic story arc from The Clone Wars comic series, which had not originally featured Wolffe. He later appeared in the \"Skirmish on Carlac\" combat zone in Clone Wars Adventures, as well as the fifth season episodes \"Point of No Return\" and \"To Catch a Jedi\" in 2013.\nIn April 2013, following the announcement that the television series would be winding down, a clip featuring Wolffe from an unaired story arc was released through USA Today. The scene turned out to be from the episode \"The Lost One,\" which was released in March 2014 on Netflix as part of the series' sixth and final season.\nAn inconsistency arose between the third issue of In Service of the Republic and Wolffe's appearance in The Clone Wars series' second season. Although the comic book portrayed Wolffe's left eye as being the one gouged out by Asajj Ventress, the episode \"Grievous Intrigue\" made his right eye the cybernetic one, leaving some question as to whether the cybernetic replacement could be attributed to his injury during the In Service to the Republic issue because of the eye difference. The trade paperback version of In Service of the Republic, released after \"Grievous Intrigue,\" corrected this inconsistency by portraying Wolffe's right eye to be the one that Ventress injured during the Battle of Khorm, and Dave Filoni clarified the canonical correction, verifying that Wolffe's cybernetic eye came from his injury from Ventress despite the eye difference.\nWolffe's appearance in 2009's \"Holocron Heist\" was not confirmed until the publication of his Encyclopedia entry in September 2011. A \"Commander Wolffe\" card in the Clone Wars Adventures \"Card Assault\" mini-game incorrectly depicted another Wolfpack trooper instead of Wolffe.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wolffe",
  "/wiki/CC-3636",
  "/wiki/Clone_trooper_commander",
  "/wiki/104th_Battalion/Legends",
  "/wiki/Wolfpack/Legends",
  "/wiki/CT-3636",
  "/wiki/Clone_trooper/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/File:SomeoneWillFindUs-RM.ogg",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Triumphant/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Malevolence/Legends",
  "/wiki/Battle_of_Abregado/Legends",
  "/wiki/Abregado_system/Legends",
  "/wiki/Death/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Sinker/Legends",
  "/wiki/Boost",
  "/wiki/Jedi/Legends",
  "/wiki/General/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/Major/Legends",
  "/wiki/Kendal_Ozzel/Legends",
  "/wiki/Battle_of_Khorm/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Tauht",
  "/wiki/Dark_Acolyte/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Khormai/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Agrocite/Legends",
  "/wiki/Ore/Legends",
  "/wiki/Army/Legends",
  "/wiki/First_Battle_of_Felucia/Legends",
  "/wiki/Mission_to_Vanqor/Legends",
  "/wiki/Battle_of_Lola_Sayu/Legends",
  "/wiki/Felucia/Legends",
  "/wiki/Vanqor/Legends",
  "/wiki/Lola_Sayu/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Second_Battle_of_Felucia/Legends",
  "/wiki/Mission_to_Iceberg_Three",
  "/wiki/Mission_to_Aleen/Legends",
  "/wiki/Groundquake/Legends",
  "/wiki/Aleen/Legends",
  "/wiki/Battle_of_Kadavo/Legends",
  "/wiki/Togruta/Legends",
  "/wiki/Zygerrian_Slave_Empire/Legends",
  "/wiki/Kadavo/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sifo-Dyas/Legends",
  "/wiki/File:WolffeThanksSkywalker-RM.ogg",
  "/wiki/Superweapon/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Subjugator-class_heavy_cruiser/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Executive_officer/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Bith_system/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Jammer",
  "/wiki/HoloNet/Legends",
  "/wiki/Destroyer/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Turbolaser/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Clone_trooper_sergeant",
  "/wiki/Laser/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Viewport/Legends",
  "/wiki/Vacuum/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Pod_1977/Legends",
  "/wiki/Droch-class_boarding_ship/Legends",
  "/wiki/Rocket_battle_droid",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Droid/Legends",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/G9_Rigger-class_light_freighter/Legends",
  "/wiki/Twilight/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/2-1B_surgical_droid",
  "/wiki/TB-2/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Medical_droid/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Resolute/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Khorm/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Unger_Gout",
  "/wiki/Species/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Agrocite_processing_facility",
  "/wiki/All_Terrain_Tactical_Enforcer/Legends",
  "/wiki/Clone_cold_assault_trooper/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Adaroo",
  "/wiki/J-1_semi-autonomous_proton_cannon",
  "/wiki/Rail_jet/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Wieler",
  "/wiki/Orbit/Legends",
  "/wiki/Trident_(starship)/Legends",
  "/wiki/Weather-control_station",
  "/wiki/Devil_Dogs",
  "/wiki/DSD1_dwarf_spider_droid/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Spitter",
  "/wiki/Comet_(clone_trooper)/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Armored_Assault_Tank",
  "/wiki/Transport/Legends",
  "/wiki/Tank_(vehicle)/Legends",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/V-19_Torrent_starfighter/Legends",
  "/wiki/Gunship/Legends",
  "/wiki/Agrocite_cannon",
  "/wiki/Acclamator-class_assault_ship",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/File:WolffeBattleOfFelucia-HH.ogg",
  "/wiki/Negotiator/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Space_warfare",
  "/wiki/Flotilla/Legends",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Hunter_Squadron_(Galactic_Republic)",
  "/wiki/Frigate/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Battle_near_the_Arda_system",
  "/wiki/Eeth_Koth/Legends",
  "/wiki/Jedi_Temple_communication_center/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Saleucami_system/Legends",
  "/wiki/Battle_of_Saleucami/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Plo%27s_Bros/Legends",
  "/wiki/Endurance/Legends",
  "/wiki/DC-15A_blaster_rifle/Legends",
  "/wiki/Grappling_hook/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Citadel/Legends",
  "/wiki/Even_Piell/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Capture_of_Even_Piell/Legends",
  "/wiki/Nexus_Route/Legends",
  "/wiki/Hyperlane",
  "/wiki/Shuttle_81572/Legends",
  "/wiki/Saesee_Tiin/Legends",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Delta-7B_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Space_gunship/Legends",
  "/wiki/Sulfur/Legends",
  "/wiki/Magma/Legends",
  "/wiki/LM-432_crab_droid/Legends",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(video_game)",
  "/wiki/C-9979_landing_craft/Legends",
  "/wiki/Separatist_outpost_(Felucia)/Legends",
  "/wiki/Felucia_system/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/CT-7567/Legends",
  "/wiki/Force_Jump",
  "/wiki/JT-12_jetpack/Legends",
  "/wiki/T-series_tactical_droid",
  "/wiki/TZ-33/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Trandosha/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Wasskah/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Battle_on_Wasskah/Legends",
  "/wiki/Calamari_system",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/King_of_Mon_Cala/Legends",
  "/wiki/Yos_Kolina/Legends",
  "/wiki/Unidentified_Jedi_Knight_(Clone_Wars)",
  "/wiki/Comet/Legends",
  "/wiki/Iceberg_Three",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Iceberg_Three_Republic_outpost",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Iceberg_Three_communications_tower",
  "/wiki/Droid_starfighter/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Mon_Eron_Republic_base",
  "/wiki/Mon_Eron",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/King/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Dac",
  "/wiki/Diplomat/Legends",
  "/wiki/Riff_Tamson/Legends",
  "/wiki/Battle_of_Mon_Cala/Legends",
  "/wiki/File:WolffeImpatient-MM.ogg",
  "/wiki/Annexation_of_the_Qiilura_system/Legends",
  "/wiki/Qiilura_system/Legends",
  "/wiki/Aleena/Legends",
  "/wiki/Pelta-class_frigate/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Aleena_(language)/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Manchucho/Legends",
  "/wiki/CLL-M2_ordnance_lifter",
  "/wiki/Aleen_mainframe_station/Legends",
  "/wiki/Aleen_Underworld",
  "/wiki/Adi_Gallia%27s_flagship/Legends",
  "/wiki/Battle_of_Patitite_Pattuna/Legends",
  "/wiki/Rescue_of_Adi_Gallia/Legends",
  "/wiki/Grievous%27s_Providence-class_carrier/destroyer_(Patitite_Pattuna)",
  "/wiki/Providence-class_carrier/destroyer",
  "/wiki/File:WolffeKedavoRescue-EFK.ogg",
  "/wiki/Kiros/Legends",
  "/wiki/Kadavo_slave_processing_facility/Legends",
  "/wiki/Mission_to_Zygerria/Legends",
  "/wiki/Zygerria/Legends",
  "/wiki/Kadavo_system/Legends",
  "/wiki/YV-865_Aurore-class_freighter/Legends",
  "/wiki/Tecora/Legends",
  "/wiki/Republic_officer/Legends",
  "/wiki/Coburn",
  "/wiki/Arquitens-class_light_cruiser/Legends",
  "/wiki/Hand_of_Justice/Legends",
  "/wiki/Warthog/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Keeper/Legends",
  "/wiki/Agruss/Legends",
  "/wiki/Zygerrian/Legends",
  "/wiki/Light_cruiser/Legends",
  "/wiki/Hull/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Roshti",
  "/wiki/Carlac/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Death_Watch/Legends",
  "/wiki/Republic_Outpost_(Carlac)",
  "/wiki/Skirmish_on_Carlac",
  "/wiki/Pre_Vizsla/Legends",
  "/wiki/Unidentified_captive_village",
  "/wiki/File:WeAreTakingYouIn-TCaJ.ogg",
  "/wiki/20_BBY/Legends",
  "/wiki/Republic_strategy_conference/Legends",
  "/wiki/Valor_(space_station)/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Carida/Legends",
  "/wiki/CC-8826/Legends",
  "/wiki/CC-2224/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Renown/Legends",
  "/wiki/Rhydonium/Legends",
  "/wiki/Carida_Incident",
  "/wiki/Colonel/Legends",
  "/wiki/Meebur_Gascon/Legends",
  "/wiki/D-Squad/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Letta_Turmond/Legends",
  "/wiki/Bombing_of_the_Jedi_Temple_Hangar",
  "/wiki/Escape_from_the_Republic_military_base/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Republic_military_base",
  "/wiki/Coruscant_underworld",
  "/wiki/Coruscant_Guard/Legends",
  "/wiki/Republic_police_gunship",
  "/wiki/Underworld_portal/Legends",
  "/wiki/Level_1312/Legends",
  "/wiki/Coruscant_Underworld_Police",
  "/wiki/Level_1313/Legends",
  "/wiki/Terminal_24/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Ray_shield/Legends",
  "/wiki/Observation_droid_(Clone_Wars)/Legends",
  "/wiki/Clone_shock_trooper",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Capture_of_Ahsoka_Tano/Legends",
  "/wiki/Asajj_Ventress%27_lightsabers",
  "/wiki/Soldier/Legends",
  "/wiki/Unidentified_Level_1315_warehouse",
  "/wiki/Level_1315/Legends",
  "/wiki/Stun/Legends",
  "/wiki/Nano-droid/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Trial_of_Ahsoka_Tano/Legends",
  "/wiki/Barriss_Offee/Legends",
  "/wiki/File:EverythingEverything-TLO.ogg",
  "/wiki/Distress_signal/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Desert_moon_of_Oba_Diah",
  "/wiki/Oba_Diah/Legends",
  "/wiki/HAVw_A6_Juggernaut/Legends",
  "/wiki/Desert/Legends",
  "/wiki/T-6_shuttle/Legends",
  "/wiki/Jedi_T-6_shuttle_775519/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Cockpit/Legends",
  "/wiki/Kaminoan/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Wolf/Legends",
  "/wiki/Scope/Legends",
  "/wiki/Kama/Legends",
  "/wiki/Phase_II_clone_trooper_armor/Legends",
  "/wiki/DC-17_hand_blaster/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/DC-15S",
  "/wiki/Jetpack/Legends",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/2008",
  "/wiki/Star_Wars:_The_Clone_Wars:_The_Visual_Guide",
  "/wiki/Rising_Malevolence",
  "/wiki/October_2",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/2009",
  "/wiki/Star_Wars:_The_Clone_Wars:_In_Service_of_the_Republic",
  "/wiki/Star_Wars:_The_Clone_Wars_(comic_series)",
  "/wiki/Dark_Horse_Comics",
  "/wiki/The_Clone_Wars_7",
  "/wiki/Star_Wars:_The_Clone_Wars:_Live_Fire",
  "/wiki/Holocron_Heist",
  "/wiki/October",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/2010",
  "/wiki/Grievous_Intrigue",
  "/wiki/R2_Come_Home",
  "/wiki/Star_Wars:_The_Clone_Wars_Character_Encyclopedia",
  "/wiki/Star_Wars:_The_Clone_Wars:_New_Battlefronts:_The_Visual_Guide",
  "/wiki/LEGO",
  "/wiki/2011",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Citadel_Rescue",
  "/wiki/Padawan_Lost",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/Mercy_Mission_(episode)",
  "/wiki/Nomad_Droids",
  "/wiki/Dave_Filoni",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Escape_from_Kadavo",
  "/wiki/January",
  "/wiki/2012",
  "/wiki/Star_Wars:_The_Clone_Wars:_Slaves_of_the_Republic",
  "/wiki/The_Clone_Wars:_Season_Five",
  "/wiki/Point_of_No_Return",
  "/wiki/To_Catch_a_Jedi",
  "/wiki/2013",
  "/wiki/The_Lost_One",
  "/wiki/March",
  "/wiki/2014",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/The_Clone_Wars_9",
  "/wiki/Star_Wars:_The_Clone_Wars:_In_Service_of_the_Republic_(TPB)",
  "/wiki/Canon",
  "/wiki/Category:Audio_files_of_Wolffe",
  "/wiki/Category:Images_of_Wolffe",
  "/wiki/Star_Wars:_The_Clone_Wars:_Watch_out_for_Jabba_the_Hutt!",
  "/wiki/The_Clone_Wars:_Meet_Ahsoka_Tano",
  "/wiki/The_Clone_Wars:_Jedi_in_Training",
  "/wiki/The_Clone_Wars:_Jedi_Adventures",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/The_Clone_Wars:_Bounty_Hunter:_Boba_Fett",
  "/wiki/The_Clone_Wars:_Boba_Fett:_Jedi_Hunter",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_5.2",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Clone_Wars_Season_One_Episode_Guide,_Part_One",
  "/wiki/Star_Wars_Insider_106",
  "/wiki/Star_Wars:_The_Clone_Wars_Annual_2010",
  "/wiki/Star_Wars:_The_Clone_Wars_%E2%80%93_The_Official_Episode_Guide:_Season_1",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Clone_Wars_(toy_line)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2009_Topps_Star_Wars:_The_Clone_Wars_Widevision",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.6",
  "/wiki/Star_Wars:_The_Clone_Wars:_Heroes_and_Villains_Flip_Book",
  "/wiki/Cartoon_Network",
  "/wiki/Star_Wars:_The_Clone_Wars_Annual_2011",
  "/wiki/Third_Wave!",
  "/wiki/Star_Wars_Insider_120",
  "/wiki/Star_Wars:_The_Clone_Wars_Official_Episode_Guide_Series_1_%26_2",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.18",
  "/wiki/Star_Wars:_The_Clone_Wars_Magazine_4",
  "/wiki/Databank_(original)",
  "/wiki/LEGO_Star_Wars:_The_Clone_Wars",
  "/wiki/LEGO_Star_Wars_Character_Encyclopedia",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.26",
  "/wiki/Star_Wars:_The_Clone_Wars_Magazine_8",
  "/wiki/Star_Wars:_The_Clone_Wars_Annual_2012",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.27",
  "/wiki/Star_Wars:_The_Clone_Wars_Magazine_9",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_130",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.35",
  "/wiki/Chronicling_The_Clone_Wars",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Four",
  "/wiki/Star_Wars:_The_Ultimate_Action_Figure_Collection",
  "/wiki/100_and_Counting",
  "/wiki/Star_Wars_Insider_139",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.47",
  "/wiki/Star_Wars:_The_Clone_Wars:_Episode_Guide",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_142",
  "/wiki/LEGO_Star_Wars:_The_Yoda_Chronicles_(book)",
  "/wiki/Star_Wars:_The_Clone_Wars_Magazine_19",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/The_Art_of_Star_Wars:_The_Clone_Wars_(booklet)",
  "/wiki/Star_Wars:_The_Clone_Wars_Seasons_1-5_Collector%27s_Edition",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Militaries_of_Star_Wars",
  "/wiki/Star_Wars_Comic_7",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_30",
  "/wiki/Sixth_Scale_Figures",
  "/wiki/The_Clone_Wars:_Season_One#The_Clone_Wars:_Decoded",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_24",
  "/wiki/Star_Wars_Blog",
  "/wiki/The_Clone_Wars_8",
  "/wiki/Star_Wars:_The_Clone_Wars:_Incredible_Vehicles",
  "/wiki/Randy_Stradley",
  "/wiki/Leland_Chee",
  "/wiki/Allegiance_(novel)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_45",
  "/wiki/Standard_year/Legends",
  "/wiki/Wookiee_Hunt",
  "/wiki/Prisoners",
  "/wiki/Slaves_of_the_Republic",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_58",
  "/wiki/January_15",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/Encryption_module/Legends",
  "/wiki/File:Memo.jpg",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_23",
  "/wiki/Sabotage_(episode)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/The_Clone_Wars_6",
  "/wiki/April_30",
  "/wiki/December_15",
  "/wiki/2019"
 ]
}