{
 "name": "CC-4142",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Horn Company",
      "Horn Company"
     ]
    }
   ]
  }
 ],
 "content": "CC-4142, nicknamed \"Lock,\" was a clone trooper captain serving under Jedi Master Eeth Koth in Horn Company during the Clone Wars. In 21 BBY, Koth's Venator-class Star Destroyer, the Steadfast—with Lock on board—was attacked near the Arda system by Confederate forces led by General Grievous aboard his Separatist destroyer. During the ensuing engagement, Captain Lock and some of his troops assumed defensive positions at one of the Star Destroyer's airlocks shortly before B2 super battle droids used an armored docking tube to board the Star Destroyer. As Lock and his clone troopers fought the intruders, Koth contacted Lock from the bridge, asking for a status report. When Lock reported to him that they were being overrun, the Jedi Master ordered the captain and his men to board the ship's escape pods, and Lock obeyed.\nLike all clone troopers, clone trooper captain CC-4142, nicknamed \"Lock,\" was a clone of the Mandalorian bounty hunter Jango Fett born on the planet Kamino to serve in the Grand Army of the Republic during the Clone Wars. In 21 BBY, the second year of the war, Lock served under Jedi Master Eeth Koth in Horn Company on board the Steadfast, a Venator-class Star Destroyer on a mission to hunt down Separatist agents. During a patrol deep in the Outer Rim Territories, near the Arda system, Koth's Venator-class Star Destroyer came under attack by a fleet—consisting of three Munificent-class star frigates and a Separatist destroyer—under the command of General Grievous, the Supreme Commander of the Separatist Droid Army.\nAfter a short exchange of broadside fire, Grievous's destroyer forced Koth's warship into submission, and the Separatist troops prepared to board the Republic vessel. To counter the enemy attack, Lock and his troops assumed defensive positions at one of the ship's airlocks. B2 super battle droids then used an armored docking tube to board and storm the cruiser. A firefight ensued between the battle droids and Lock's men, and during the skirmish, the captain was contacted by Koth, who was on the cruiser's bridge. Koth demanded a status report, and Lock reported that they couldn't hold their position any longer. The Zabrak Jedi Master then ordered the troopers to the escape pods and stated his intention to deal with Grievous on the bridge. The captain objected to this course of action, warning Koth of the advancing commando droids before obeying.\nLock showed visible concern for Koth and objected when the Jedi Master expressed his intention to engage Grievous separately on the bridge of the Star Destroyer. Although Lock and his troops valiantly tried to stop the droids' advance, they were unable to prevent the super battle droids from boarding the ship. Like his clone imprint, Jango Fett, Lock stood 1.83 meters tall.\nIn combat, Lock used a DC-15S, wore Phase I clone trooper armor with green markings, and he had equipped his helmet with a visor.\nLock first appeared in \"Grievous Intrigue,\" an episode of the second season of The Clone Wars TV series, which aired on January 1, 2010. Although he was not named in the episode, he received a name in its corresponding episode guide. Lock was voiced by Dee Bradley Baker, who portrays all clone troopers in the series. Lock received the designation \"CC-4142\" in Star Wars: The Clone Wars: New Battlefronts: The Visual Guide.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Lock_(Clone_Captain)",
  "/wiki/CC-4142",
  "/wiki/Lock_(disambiguation)",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Horn_Company",
  "/wiki/Clone_trooper_captain",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Eeth_Koth/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Steadfast_(Venator-class)/Legends",
  "/wiki/Battle_near_the_Arda_system",
  "/wiki/Arda_system",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Grievous%27s_Recusant-class_light_destroyer/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Airlock/Legends",
  "/wiki/B2_super_battle_droid/Legends",
  "/wiki/Docking_tube/Legends",
  "/wiki/Destroyer/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/Supreme_Commander_of_the_Droid_Armies",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Lightfight",
  "/wiki/Battle_droid/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/BX-series_droid_commando/Legends",
  "/wiki/Droid/Legends",
  "/wiki/DC-15S",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/Color/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Grievous_Intrigue",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/January_1",
  "/wiki/2010",
  "/wiki/The_Clone_Wars_Episode_Guides",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Star_Wars:_The_Clone_Wars:_New_Battlefronts:_The_Visual_Guide",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_Official_Episode_Guide_Series_1_%26_2",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Clone_Wars_(toy_line)",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(video_game)",
  "/wiki/Category:Images_of_Lock",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Databank_(original)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_21",
  "/wiki/The_Clone_Wars:_Jedi_Heroes"
 ]
}