{
 "name": "CC-6454",
 "display_name": "CC-6454",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Slave I"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic91st Mobile Reconnaissance Corps",
      "Lightning Squadron",
      "Grand Army of the Republic91st Mobile Reconnaissance Corps",
      "Lightning Squadron",
      "91st Mobile Reconnaissance Corps",
      "Lightning Squadron"
     ]
    }
   ]
  }
 ],
 "content": "CC-6454, nicknamed \"Ponds,\" was a clone trooper Battalion Commander in the Grand Army of the Republic. Assigned to High Jedi General Mace Windu at the First Battle of Geonosis, Ponds earned his General's trust as the commander of Lightning Squadron, a division of the Galactic Republic's 91st Reconnaissance Corps. In 22 BBY, Emir Wat Tambor of the Techno Union invaded the planet Ryloth, and Ponds assisted Windu in invading the planet to secure its liberation. Windu and Ponds ultimately joined forces with General Cham Syndulla and his Twi'lek freedom fighters to retake Ryloth from the Confederacy, capturing the capital city of Lessu and taking Tambor as a prisoner of the Republic.\nIn addition to campaigns at Simocadia, Juma 9, and Behpour, Ponds participated in the Battle of Malastare and assisted Windu in capturing a rampant Zillo Beast that had been awoken from the detonation of an electro-proton bomb. He later joined Windu on a respite from the war aboard the Republic Star Destroyer Endurance, at the time of the young bounty hunter Boba Fett's assassination attempts on Windu. After bringing down the Endurance on Vanqor, Fett and his crew of mercenaries—Aurra Sing, Bossk, and Castas—took Ponds, Admiral Shoan Kilian, and a clone naval officer hostage to bait Windu into a confrontation. As part of their hostage demands, Sing executed Ponds and later ejected his body from their starship, Slave I.\nCC-6454, who took on the nickname \"Ponds,\" was a clone trooper commander. Born on Kamino, he was one of the many clones of bounty hunter Jango Fett, grown by the Galactic Republic to serve in the Grand Army of the Republic. In 22 BBY, Ponds was part of the 200,000 clone troopers whom Jedi Grand Master Yoda gathered from Kamino for a strike force bound for Geonosis, where the Republic was launching a campaign to rescue several captives—Jedi Knight Obi-Wan Kenobi, Jedi Padawan Anakin Skywalker, and Senator Padmé Amidala—who had been marked for execution by the newly formed Confederacy of Independent Systems. In the resulting First Battle of Geonosis, Ponds reported to Jedi Master Mace Windu and gathered five commando units for Windu's use. The battle was ultimately won for the Republic, and Ponds continued to serve under Windu as the Clone Wars erupted across the galaxy.\nAs the war went on during the first year, the Techno Union foreman and Separatist Council member, Emir Wat Tambor, invaded the planet Ryloth and enslaved its Twi'lek inhabitants. After Jedi General Anakin Skywalker and Jedi Commander Ahsoka Tano eliminated the Confederate blockade surrounding the planet, Ponds accompanied General Windu aboard an Acclamator-class assault ship. Windu's invasion force, consisting of three Acclamator transports, prepared to land in the city of Nabat, but they were attacked by Confederate proton cannons stationed below in the city. Ponds informed Mace Windu that the cannons had penetrated the transports' shields, and as he spoke, one of the transports was destroyed. Windu instructed High Jedi General Obi-Wan Kenobi to destroy the cannons and allow their transports to land in Nabat. Kenobi was able to eliminate the cannons, and the two remaining transports were able to land. The ground forces were deployed, and soon headed to Ryloth's capital of Lessu to retake it and free the planet.\nEn route to Lessu, Ponds accompanied Windu and led the GAR unit Lightning Squadron, as well as, several AT-TE walkers. Along a cliff-side path, the forces were attacked by several Confederate Armored Assault Tanks, which sought to trap the Republic forces on the cliff, and incapacitated the front walkers before targeting those at the rear. Windu and Ponds led an attack with Lightning Squadron and several AT-RT walkers on the tanks. Although the tanks were defeated, the ambush had taken the lives of thirty-two of their men, along with three AT-TE command crews. Windu and Ponds needed reinforcements to be able to succeed.\nWindu entered a holographic conference with Supreme Chancellor Palpatine; Jedi Grand Master Yoda; Ryloth's Twi'lek senator, Orn Free Taa; and Admiral Wullf Yularen. Windu discovered that there were no reinforcements available, but decided to enlist the help of Twi'lek Cham Syndulla and his freedom fighters—a resistance movement that had been fighting the Confederacy since its invasion—to help the Republic defeat the Confederacy. Windu went with Advanced Recon Force troopers Razor and Stak to meet the rebels, while Ponds continued to Lessu with the remainder of his forces.\nAfter coming across a Twi'lek village, Ponds ordered the troopers to spare some rations for the Twi'lek women and children that were still there. Suddenly, several Confederate Hyena-class bombers appeared and swooped down on the village, dropping bombs and destroying the village in a matter of seconds. A shocked Ponds reported this to Windu, and the increasing losses of lives convinced Syndulla to reopen negotiations with his political rival, Senator Taa. Syndulla resolved his issues with Taa, and decided to join Windu and his forces. The group devised a plan to enter Lessu; however, the only solution would be to activate the city's plasma bridge, as it was the only access to Lessu, and the bridge's controls were inside the city itself. To infiltrate the city, Windu decided to sneak onto one of two Confederate Multi-Troop Transports carrying stolen treasure for Emir Tambor. However, they would only have a short amount of time before being discovered, and Ponds and Syndulla needed to give Windu as much time as possible to get across.\nAccompanied by Razor and Stak, Windu sneaked onto one of the MTTs. When their presence was revealed, the Jedi and the two clones made a run for the other side of the plasma bridge while Ponds and Syndulla commenced the attack. Windu and the clones were able to get across, and Syndulla led the charge towards the bridge. Razor and Stak managed to activate the bridge, and, after the Republic forces crossed and entered the city, Windu cornered Tambor. Four Hyena bombers prepared to destroy the city under orders from Confederate Head of State and Sith Lord Count Dooku, but the timely intervention of General Skywalker and Commander Tano in their fighters thwarted the attempt. After the battle had ended, Ponds attended a parade on Ryloth with Syndulla, Taa, and Windu.\nA short while after Ryloth, the Station Juma 9 fell under attack. Along with Jedi Master Kit Fisto, Mace Windu and Commander Ponds sought to recapture the station. They found Clone Commander Cody and, while the Jedi entered the station, the clones scouted on the station's surface where they encountered some droids. Eventually they destroyed all the droids and found two lightsabers in space. They met up with the two owners of the lightsabers—Masters Obi-Wan Kenobi and Plo Koon, who had been separated from their weapons by a ray shield, thus forcing the Jedi to go around the ray shield. Eventually they made it and received their sabers. The Battle of Juma 9 was won.\nImmediately following Ryloth, a Separatist superweapon was discovered on Behpour by Naboo Senator Padmé Amidala, created by Kul Teska, the Skakoan agent who led the attack on Juma-9. Ponds was among the Republic task force dispatched to destroy the weapon before it could collapse the Naboo sun. Once Generals Kenobi and Skywalker knocked out the facility's shield, the clones entered the facility, quickly securing the entrance. Ponds later assisted Cody and Captain Rex in securing a landing platform for Skywalker's starship, the Twilight.\nPonds helped Mace Windu look for survivors in the Zillo Beast's hole. Mace Windu ordered him, Trapper and Hawkeye to look around. Soon the Zillo Beast found them and chased them. However; Mace, Ponds, and another trooper were able to escape aboard a gunship.\nOn board the Venator-class Star Destroyer Endurance, Ponds told Mace and Skywalker to go to the bridge before the two Jedi had the chance to give a group of clone cadets a tour of the ship. However, a young Boba Fett had infiltrated a contingent of the clone youth brigade who where touring the ship, with the intention of avenging his father's death at the hands of Mace Windu. Fett managed to slip away from the rest of the clone youth brigade and proceeded to destroy the ship's main reactor. Ponds and several other clones were sent to see who or what had destroyed the reactor. Later, Ponds said he would stay on the Endurance with Admiral Shoan Kilian and go down with the ship while the rest of clones would evacuate.\nAfter the crash, Ponds was kidnapped along with Admiral Kilian and another clone officer by Aurra Sing, Boba Fett, Castas, and Bossk. At first, the bounty hunters intended to ransom the three of them off to the Separatists. When their booby trap failed, Sing decided to use her hostages as bait to lure Mace Windu into the open so that Boba could kill the Jedi who murdered his father. They decided to send a message trying to convince the Jedi to come, and they ordered Boba to kill Ponds to show they meant business. When Boba hesitated to do it, Aurra got tired of waiting and killed Ponds herself when he refused. As the Jedi watched in horror, the bounty hunters then cut off the transmission. Later, the bounty hunters dumped Ponds' body out into space.\nPonds was obedient and followed orders. He was assertive and did not hesitate when giving orders himself, as shown when he immediately ordered Lightning Squadron to the front of the Republic line of walkers during the cliffside ambush. Ponds was also compassionate: when he learned that there were only Twi'lek women and children in a nearby village, he took pity on them and ordered his men to spare rations, and was shocked and angry when the Confederacy bombed the village.\nHe held friendships with fellow officers Captain Rex and Commander Cody, respectively. He comforted the latter when he expressed his concern for Generals Plo Koon and Obi-Wan Kenobi on the Juma 9 station mission. He additionally complemented Rex's shooting skills on Behpour.\nAfter being captured by Aurra Sing, Ponds refused to answer her when she asked for his name, doing it only after she forcefully demanded it. Just before Aurra killed Ponds, he calmly closed his eyes and accepted his death.\nPonds' armor featured dark-red markings upon his helmet, arms, shoulder plates, towards the back of his torso, and from his knee pads down to the mid-calf. Ponds also wore a kama that bore two DC-17 hand blasters, which he used on Malastare. On the back of Ponds' helmet, \"Some guys have all the luck\" was written in Aurebesh. He also made use of a DC-15A blaster rifle on Ryloth and a DC-15S blaster carbine on Behpour.\nPonds, like all the other clone troopers in the Star Wars: The Clone Wars television series, was voiced by Dee Bradley Baker. After being first mentioned, albeit briefly, in The Complete Star Wars Encyclopedia , he made his first appearance in the series' 2009 first season episodes \"Innocents of Ryloth\" and \"Liberty on Ryloth.\"\nIn the 2010 episode \"Lethal Trackdown,\" when Aurra Sing asks Ponds for his name, he gives the number \"CT-411,\" which contradicts the \"CC-6454\" designation given in the Star Wars: The Clone Wars: Visual Guide Ultimate Battles reference book and repeated in the Star Wars: The Clone Wars: Republic Heroes video game, both released in 2009. This was later revised in the 2010 Star Wars: The Clone Wars Character Encyclopedia, which gave him the new designation \"CC-0411\" after the conflicting number from \"Lethal Trackdown.\" However, when Ponds received an entry in the StarWars.com Encyclopedia in 2012, his designation was listed as the previously stated \"CC-6454.\" This article assumes that the latter is correct, as precedence is given to the Encyclopedia as the most recent published source.\nStar Wars: The Clone Wars: Visual Guide Ultimate Battles mentioned that Ponds was assigned to Mace Windu at the Battle of Geonosis, which was depicted in Star Wars: Episode II Attack of the Clones. Although Republic Heroes stated that he had been assigned to Windu after Geonosis, Ponds's 2012 Encyclopedia entry confirmed his role during the battle, going so far as to retcon a clone commander in the film as Ponds.\nPonds appeared in the comic The Clone Wars: The Colossus of Destiny, but wore armor that had blue stripes down his arms, and two blue eyes on his helmet, over his visor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/CT-411",
  "/wiki/CC-6454",
  "/wiki/The_Clone_Wars:_The_Colossus_of_Destiny",
  "/wiki/The_Droid_Deception",
  "/wiki/Kamino/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Slave_I/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/91st_Mobile_Reconnaissance_Corps/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Lightning_Squadron/Legends",
  "/wiki/Clone_battalion_commander",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/High_Jedi_General/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/General/Legends",
  "/wiki/Commander/Legends",
  "/wiki/91st_Reconnaissance_Corps",
  "/wiki/22_BBY/Legends",
  "/wiki/Emir_(title)/Legends",
  "/wiki/Wat_Tambor/Legends",
  "/wiki/Techno_Union/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Battle_of_Ryloth/Legends",
  "/wiki/Cham_Syndulla/Legends",
  "/wiki/Twi%27lek_freedom_fighters",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Lessu/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Simocadia",
  "/wiki/Juma_9",
  "/wiki/Behpour/Legends",
  "/wiki/Battle_of_Malastare/Legends",
  "/wiki/Unidentified_Zillo_Beast/Legends",
  "/wiki/Electro-proton_bomb/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Endurance/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Vanqor/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Bossk/Legends",
  "/wiki/Castas/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Shoan_Kilian/Legends",
  "/wiki/Unidentified_clone_naval_officer_(Endurance)",
  "/wiki/Starship/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Death/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Commando/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/File:FireBombingCampaign-LoR.ogg",
  "/wiki/Liberty_on_Ryloth",
  "/wiki/Foreman/Legends",
  "/wiki/Separatist_Council",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Acclamator-class_assault_ship",
  "/wiki/Nabat/Legends",
  "/wiki/J-1_semi-autonomous_proton_cannon",
  "/wiki/Deflector_shield/Legends",
  "/wiki/All_Terrain_Tactical_Enforcer/Legends",
  "/wiki/Armored_Assault_Tank",
  "/wiki/All_Terrain_Recon_Transport/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Orn_Free_Taa/Legends",
  "/wiki/Wullf_Yularen/Legends",
  "/wiki/Advanced_Recon_Force_trooper",
  "/wiki/Razor",
  "/wiki/Stak/Legends",
  "/wiki/Hyena-class_bomber",
  "/wiki/Bomb/Legends",
  "/wiki/Plasma_bridge/Legends",
  "/wiki/Multi-Troop_Transport/Legends",
  "/wiki/Head_of_State/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Delta-7B_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/CC-2224/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Gravitic_polarization_beam",
  "/wiki/Naboo/Legends",
  "/wiki/Kul_Teska",
  "/wiki/Skakoan/Legends",
  "/wiki/Naboo_(star)/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/CT-7567/Legends",
  "/wiki/Twilight/Legends",
  "/wiki/Trapper_(clone_trooper)/Legends",
  "/wiki/Hawkeye/Legends",
  "/wiki/Zillo_Beast/Legends",
  "/wiki/File:SpareSomeRations-LoR.ogg",
  "/wiki/Kama/Legends",
  "/wiki/DC-17_hand_blaster/Legends",
  "/wiki/Aurebesh/Legends",
  "/wiki/DC-15A_blaster_rifle/Legends",
  "/wiki/DC-15S",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/2009",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Innocents_of_Ryloth",
  "/wiki/2010",
  "/wiki/Lethal_Trackdown",
  "/wiki/Star_Wars:_The_Clone_Wars:_Visual_Guide_Ultimate_Battles",
  "/wiki/Star_Wars:_The_Clone_Wars:_Republic_Heroes",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Clone_Wars_Character_Encyclopedia",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/2012",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Retcon",
  "/wiki/Category:Audio_files_of_CT-411",
  "/wiki/Category:Images_of_CT-411",
  "/wiki/Machines_of_War",
  "/wiki/The_Clone_Wars:_The_Battle_for_Ryloth",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.4",
  "/wiki/The_Zillo_Beast",
  "/wiki/Death_Trap",
  "/wiki/The_Clone_Wars:_Bounty_Hunter:_Boba_Fett",
  "/wiki/R2_Come_Home",
  "/wiki/LEGO_Star_Wars_III:_The_Clone_Wars",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars:_Republic_Heroes:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars:_The_Clone_Wars_%E2%80%93_The_Official_Episode_Guide:_Season_1",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars_Annual_2011",
  "/wiki/LEGO_Star_Wars_III:_The_Clone_Wars:_Prima_Official_Game_Guide",
  "/wiki/Chronicling_The_Clone_Wars",
  "/wiki/The_Not-So_Magnificent_Seven",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_Saga_Legends",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_35",
  "/wiki/Storm_Over_Ryloth"
 ]
}