{
 "name": "CC-8826",
 "display_name": "CC-8826",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "91st Mobile Reconnaissance Corps",
      "91st Mobile Reconnaissance Corps",
      "Galactic Empire",
      "Imperial Army",
      "Imperial Army"
     ]
    }
   ]
  }
 ],
 "content": "CC-8826, nicknamed \"Neyo,\" was an Advanced Recon Commando who served in the Grand Army of the Republic during the Clone Wars, rising to become a Clone Commander and the leader of the 91st Mobile Reconnaissance Corps. Bred from the genetic template of the human bounty hunter Jango Fett and for the sole purpose of combat, Neyo developed a cold personality.\nAs the war with the Confederacy of Independent Systems progressed, the Republic Military formed a special team of droids known as D-Squad. Neyo's DUM-series pit droid, designated WAC-47, was transferred from the 91st to the new squad under Colonel Meebur Gascon's leadership. Later, the commander attended a Republic strategy conference at the Valor space station located in the Carida system. During the conference, a Separatist attack on the station was thwarted by the members of D-Squad, including Neyo's former droid.\nNeyo and his troops were stationed on the Outer Rim world of Saleucami, under the command of Jedi General Stass Allie, in the waning days of the Clone Wars. While patrolling the planet's surface, he received a message from Supreme Chancellor Sheev Palpatine instructing him to execute Order 66. As a clone conditioned to obey the secret protocol, Neyo fired his BARC speeder's laser cannons on the general, adding Allie to the list of Jedi who perished in the initial Great Jedi Purge that preceded the rise of the Galactic Empire.\nCC-8826 was the designation of a clone trooper who went by the nickname of \"Neyo\" during the Clone Wars. Prior to the pan-galactic conflict, Neyo was created on the extragalactic world of Kamino as part of a clone army grown in secret to serve the Galactic Republic. At the start of the Clone Wars between the Republic and the Separatist Alliance in 22 BBY, CC-8826 served as an Advanced Recon Commando within the Grand Army of the Republic. CC-8826 then joined the experimental ARC program on Kamino, which was designed to provide the Republic with a new, elite force that was capable of confronting the expanding Separatist Droid Army.\nDuring training, Neyo and the other clone cadets began to develop a personality of their own, which was a phenomenon that was fostered by the unusual methodology of the program. Its designers saw this as a positive trait, as it gave the clones greater independent thought and greater freedom of expression compared to conventional clones. Despite this, Neyo developed a cold personality, and was considered to be one of the most aloof and oddball members of the program, failing to bond with his comrades. Another clone, CC-1138, was also considered brooding and the two clones eventually collaborated on the development and field trials of tactics that used the newly produced BARC speeders. Neyo was one of the first one hundred graduates of the ARC program, and was given the military rank of Clone Commander. Shortly after his promotion, Neyo was placed as the commanding officer of the 91st Mobile Reconnaissance Corps.\nCommander Neyo's first Jedi General was Jedi Master Adi Gallia, who was long-time member of the Jedi High Council and considered an excellent commander. Although Gallia's flagship was a Venator-class Star Destroyer, she changed her transport on several occasions. In one such instance, Supreme Martial Commander of the Separatist Droid Armies General Grievous attacked her flagship in a suprise assault and forced her to abandon ship. As a result, Gallia was separated from Commander Neyo and the rest of her men long enough for Grievous to capture her. The survivors were rescued by Jedi General Plo Koon and his 104th Battalion, and immediately launched a rescue mission. Plo Koon's fleet attacked Grievous' flagship and freed Gallia.\nDuring the war, Neyo possessed a DUM-series pit droid, designated WAC-47, that reported to him while serving with the corps. By 20 BBY, Commander Neyo escorted WAC-47 to the Jedi Temple for a briefing on a new mission. WAC-47's bad hearing made them arrive late and interrupt Jedi General Mace Windu's briefing to R2-D2, M5-BZ, QT-KT, U9-C4, and their owners. After mission leader Colonel Meebur Gascon arrived, Windu, Neyo, and the others left the briefing for Gascon's D-Squad.\nNeyo later attended a strategy conference aboard the Valor space station in the Carida system alongside other clone officers such as Clone Marshal Commander CC-2224 and Clone Commander CC-3636, Republic officers including Admirals Wilhuff Tarkin, Barton Coburn, and Wullf Yularen, as well as Jedi officers consisting of Windu, High Jedi General Obi-Wan Kenobi, and Jedi General Anakin Skywalker. The members were there to analyze the open war against the Separatists. With the Republic Military's high-ranking officials gathered in a single location, the Separatists conspired to wipe them out using a commandeered Venator-class Star Destroyer, the Renown outfitted with rhydonium. However, the station—along with Neyo and its other occupants—was ultimately saved from destruction due to the intervention of D-Squad.\nIn 19 BBY, Commander Neyo has participated in many battles in the Outer Rim Sieges. Eventually he and his 91st were placed under the command of Jedi General Oppo Rancisis to retake the planet Saleucami, which was held by the Separatists. The Siege of Saleucami was a long and complicated campaign, but the world was ultimately taken by Republic forces. After the defeat of the Separatists, Commander Neyo and the rest of the 91st Mobile Reconnaissance Corps remained on Saleucami while the rest of the Republic troops departed. Neyo and his forces remained under the command of Jedi General Stass Allie, who was placed in charge of patrolling the planet for any Separatist strongholds and remove the remaining pockets of resistance.\nDuring one patrol, Commander Neyo and one of his clone lieutenants accompanied General Allie on BARC speeders on a patrol through a battlefield on Saleucami when the two clones received Order 66 directly from Dark Lord of the Sith Darth Sidious, who was publicly the Supreme Chancellor of the Republic Sheev Palpatine. The directive activated the behavioral modification biochips which compelled the clones to follow the order and kill any Jedi. As a result, Commander Neyo and his wingman fell back behind their Jedi General and fired on her speeder, destroying it and killing Stass Allie instantly. The implementation of Order 66 commenced the Great Jedi Purge, and the Republic was subsequently reorganized into the Galactic Empire with Sidious anointing himself as Galactic Emperor. Commander Neyo returned to the area of concentration of Republic troops to leave the planet, and subsequently continued to serve in the new Galactic Empire within the Imperial Army.\nCommander Neyo was a human male clone of Jango Fett, a bounty hunter and the genetic template of the Kaminoan clone army. As such, he inherited the physical traits of his progenitor, including a height of 1.83 meters, black hair, brown eyes, and tan skin. During the Clone Wars, he had a facial tattoo printed in Aurebesh writing, which read \"CC-8826.\" As with the rest of the clone army, Neyo was programmed to execute Order 66 upon its authorization by Chancellor Palpatine. Being bred solely for combat, Neyo developed a disturbingly cold personality.\nNeyo was trained in the ARC program, and as a clone officer was skilled in armed and unarmed combat, military tactics, reconnaissance, and speeder piloting. He was also skilled in leadership and obedience, with him and his forces also being experts in quietly gathering intelligence in the field on enemy deployments, defenses, and firepower. Neyo was considered one of the most experienced commanders in the Republic Army, and although he was extremely loyal, he could not disobey Order 66.\nCommander Neyo utilized Phase II clone trooper armor with a command belt indicating his status as an ARC trooper. Additionally, his armor was decorated with four emblems of the 91st, on his helmet, on the chest, and the other two on his right bicep and thigh respectively. He was in possession of a BARC speeder at the time of Order 66, and therefore used its laser cannons to fire on General Stass Allie.\nCC-8826 \"Neyo\" first appeared in the film Star Wars: Episode III Revenge of the Sith. Like all clone troopers in the prequel trilogy, Neyo was portrayed through computer-generated imagery. According to Pablo Hidalgo, the basis of Neyo's CT-number came from his parents' landline phone number.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/CC-8826",
  "/wiki/CC-8826/Legends",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/91st_Mobile_Reconnaissance_Corps",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Clone_Commander",
  "/wiki/DNA",
  "/wiki/Clone_template",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Republic_Military",
  "/wiki/Droid",
  "/wiki/D-Squad",
  "/wiki/DUM-series_pit_droid",
  "/wiki/WAC-47",
  "/wiki/Squad",
  "/wiki/Colonel",
  "/wiki/Meebur_Gascon",
  "/wiki/Republic_strategy_conference",
  "/wiki/Valor_(space_station)",
  "/wiki/Space_station",
  "/wiki/Carida_system",
  "/wiki/Carida_incident",
  "/wiki/Troop",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Saleucami",
  "/wiki/Jedi_General",
  "/wiki/Stass_Allie",
  "/wiki/Standard_day",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Order_66",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/BARC_speeder",
  "/wiki/Laser_cannon",
  "/wiki/General",
  "/wiki/Jedi",
  "/wiki/Death",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Imperial_Era",
  "/wiki/Clone_trooper",
  "/wiki/The_galaxy",
  "/wiki/Extragalactic",
  "/wiki/Army",
  "/wiki/22_BBY",
  "/wiki/ARC_program",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Clone_cadet",
  "/wiki/CC-1138",
  "/wiki/Military_rank",
  "/wiki/Commanding_officer",
  "/wiki/Commander",
  "/wiki/Jedi_Master",
  "/wiki/Adi_Gallia",
  "/wiki/Time",
  "/wiki/Jedi_High_Council",
  "/wiki/Flagship",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Supreme_Martial_Commander_of_the_Separatist_Droid_Armies",
  "/wiki/Grievous",
  "/wiki/Adi_Gallia%27s_flagship",
  "/wiki/Battle_of_Patitite_Pattuna",
  "/wiki/Plo_Koon",
  "/wiki/104th_Battalion",
  "/wiki/Plo_Koon%27s_second_fleet",
  "/wiki/Rescue_of_Adi_Gallia",
  "/wiki/Corps",
  "/wiki/20_BBY",
  "/wiki/Imperial_Palace",
  "/wiki/Mace_Windu",
  "/wiki/R2-D2",
  "/wiki/M5-BZ",
  "/wiki/QT-KT",
  "/wiki/U9-C4",
  "/wiki/Clone_Marshal_Commander",
  "/wiki/CC-2224",
  "/wiki/Wolffe",
  "/wiki/Republic_officer",
  "/wiki/Admiral",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Barton_Coburn",
  "/wiki/Wullf_Yularen",
  "/wiki/High_Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Renown",
  "/wiki/Rhydonium",
  "/wiki/File:Execute_Order_66.ogg",
  "/wiki/19_BBY",
  "/wiki/Outer_Rim_Sieges",
  "/wiki/Oppo_Rancisis",
  "/wiki/Siege_of_Saleucami",
  "/wiki/Unidentified_clone_lieutenant",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Emperor",
  "/wiki/Kaminoan",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Tattoo",
  "/wiki/Aurebesh",
  "/wiki/Writing",
  "/wiki/Pilot",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Armor",
  "/wiki/Helmet",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Prequel_trilogy",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Category:Images_of_CC-8826",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Secret_Weapons",
  "/wiki/Point_of_No_Return",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_48",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars_Helmet_Collection_69",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Grand_Army_of_the_Republic",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Conspiracy",
  "/wiki/Fugitive",
  "/wiki/File:Neyo-Number-Origin.png"
 ]
}