{
 "name": "Cecius",
 "display_name": "Cecius",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vogel 7"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Imperial Navy",
      "Imperial Army",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Cecius was a Human male lieutenant of the Imperial Navy during the Galactic Civil War. A native of the planet Vogel 7 and formerly of the Imperial Army, Cecius served as a bridge officer aboard Darth Vader's personal flagship, the Super Star Destroyer Executor. As a specialist in boarding tactics and the seizing of enemy starships, Cecius was given command of the capture of Luke Skywalker and the crew of the Rebel freighter, the Millennium Falcon, during their escape from Imperial forces on Cloud City in 3 ABY, though his duties were nullified when the Rebel ship unexpectedly escaped into hyperspace.\nCecius was an officer of the Imperial Navy during the Galactic Civil War. A native of the planet Vogel 7 and former member of the Imperial Army, Cecius, a lieutenant by 3 ABY, was assigned aboard the Super Star Destroyer Executor, personal flagship of the Dark Lord Darth Vader, as a bridge officer. Cecius served under the command of Admiral Firmus Piett.\nHis specialized duties aboard the Executor included boarding tactics and the seizure of enemy starships. When the Executor attempted to intercept Luke Skywalker and the crew of the Rebel Alliance freighter, the Millennium Falcon, during their escape from Bespin's Cloud City amidst its Imperial subjugation in 3 ABY, Cecius was stationed aboard the Super Star Destroyer's bridge. After Vader ordered Piett to ready the Executor's boarding party with weapons set to stun in preparation for the capture of the Millennium Falcon's crew, the responsibility fell to Cecius to carry out the Dark Lord's command vicariously. However, before Cecius's boarding party could take control of the fugitive Rebel ship, the freighter escaped into hyperspace.\nCecius, a Human male, specialized in boarding tactics and taking control of enemy vessels, of which his duties consisted during his time aboard Darth Vader's flagship, a testament to his days in the Imperial infantry. As of his service aboard the Executor in 3 ABY, Cecius had not had a date in years. Cecius had brown hair and light skin.\nLieutenant Cecius wore the standard-issue Imperial officer's uniform during his service aboard the Executor's bridge in 3 ABY.\nCecius first appeared in the film Star Wars: Episode V The Empire Strikes Back. His minor appearance and single spoken line therein is unique to movie and not included in the film's novelization. Note that the actor's on-screen positioning during his scene leaves him mostly cut off from view unless watching the film in widescreen format.\nThe Cecius character was first identified by name and provided a brief backstory on the \"Lieutenant Cecius\" card as part of the November 1997 Cloud City Limited expansion set of the Star Wars Customizable Card Game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Vogel_7",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Occupation_of_Bespin",
  "/wiki/Cloud_City/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Fleet_Admiral/Legends",
  "/wiki/Firmus_Piett/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Stun/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Time/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Imperial_officer%27s_uniform/Legends",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/November",
  "/wiki/1997",
  "/wiki/Cloud_City_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(PhotoComic)",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology"
 ]
}