{
 "name": "Cede",
 "display_name": "Cede",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic Navy",
      "Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "Cede  was an admiral of the Republic Navy in the years following the Jedi Civil War until at least 3951 BBY. He served in Carth Onasi's fleet during the Dark Wars, participating in the Battle of Telos IV.\nIt was implied that Cede also served in the Mandalorian Wars and the Jedi Civil War.\nWhile he is never seen officially in the canon storyline, following a light side female Surik, succeeding the light side male version of Revan in first game, he is nonetheless canon, having served in the Republic Navy and at the battle of Telos, which he does in the non-canon storyline.\nCede's character blueprint file is named \"rep_gen\", which presumably stands for \"Republic General\". This indicates that the decision to give Cede a name was a relatively late one. Despite his rank, Cede is shown wearing the uniform of a common Republic officer, instead of an admiral's. This is because the game did not actually contain a male admiral uniform appearance, thus even Carth is shown wearing red armor instead.\nCede replaces the role of Carth Onasi in the cutscenes of Star Wars: Knights of the Old Republic II: The Sith Lords if Revan is set to dark side in the backstory. According to the dark side ending of Star Wars: Knights of the Old Republic, Carth had fled the Republic in terror. In the canonical storyline of the Sith Lords, Cede doesn't appear at all.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Admiral/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/3951_BBY",
  "/wiki/Dark_Wars",
  "/wiki/Battle_of_Telos_IV",
  "/wiki/Mandalorian_Wars",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Cede",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Carth_Onasi",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Revan/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Carth_Onasi#Alternate_choices",
  "/wiki/Canon"
 ]
}