{
 "name": "Cedonia_Teraan",
 "display_name": "Cedonia Teraan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Teraan",
      "House of Organa",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Cedonia Teraan was a female Human who was a member of House Teraan and the Herald of the Gold Aurora during the Cold War.\nDuring the time of the Great Galactic War between the Galactic Republic and the Sith Empire, Cedonia and her brother Lenn Teraan became the only remaining members of the House Teraan when it was devastated during a clash with House Baliss leading to them relocating to safety with House Organa. Their ancestral estate was taken over by House Baliss during this time.\nIn 3643 BBY, Cedonia and Lenn Teraan tasked a smuggler to infiltrate their former estate in order to recover data from their homes library on how to unlock the antique droid that held the key to restoring their family. Once unlocked, the droid revealed that numerous other families owed House Teraan credits and both siblings departed to meet with the Royal Council in order to verify the data.\nThe Teraans later called the Voidhound for help once more, when House Baliss discovered the smuggler's intrusion and had sent Xin Baliss to challenge Lenn to a duel to the death. Thankfully for the Teraans, the smuggler agreed to fight Xin and managed to kill the supposedly unbeatable duelist. Though impressed by the smuggler's skill, the Teraans then chose to depart Alderaan before House Baliss attempted more attacks on their life.\nCedonia Teraan can be romanced by a male Smuggler player character.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_Teraan",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Lenn_Teraan",
  "/wiki/House_Baliss",
  "/wiki/3643_BBY",
  "/wiki/Voidhound",
  "/wiki/Droid/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Smuggler/Legends",
  "/wiki/Xin_Baliss"
 ]
}