{
 "name": "Celestra",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Corps of Engineers",
      "Republic Corps of Engineers"
     ]
    }
   ]
  }
 ],
 "content": "Celestra was a Human female who served the Galactic Republic as part of the Republic Corps of Engineers during the Cold War. She was stationed on the planet Ord Mantell during part of the war, where she fought against the Mantellian Separatist Movement in the Separatist War.\nCelestra was a Human female who served in the Galactic Republic's army during the Cold War, a conflict between the Sith Empire and the Republic. During the war she served in the Republic Corps of Engineers, a branch of the army of the army specialized in mechanical maintenance, and was deployed on the Republic held planet of Ord Mantell in the Bright Jewel system of the Mid Rim. Whilst stationed on the planet she and all Republic forces aided the corrupt local government in fighting the Mantellian Separatist Movement\nWhilst on Ord Mantell, Celestra was stationed in the Republic stronghold of Fort Garnik with her droid companion, S3-E3. The duo along with several other engineers were sent to repair one of Garnik's external power generators which had been sabotaged by Separatists. The team however was attacked by Separatists and all bar Celestra and S3-E3 were killed, with the latter fleeing in to the Avilatan Badlands and the engineer defending the generator. Attempting to fix the generator she found she could manually keep it steady as long as she was present preventing power loss in Garnik, however to permanently fix it she required tools scattered in the attack and collected by the Separatist soldiers.\nCelestra was then approached by a passing member of Havoc squad and a smuggler known as Ace who had been sent to find her by S3-E3. She at first was angry at the pair for arriving too late to save her colleges but then calmed and asked for their aid in recollecting her lost tools from the separatists. The pair then attacked separatists in the area and recovered from them the tools that Celestra had asked for, a Hydrospanner, a Turbohammer and a multitool. Using the equipment she successfully repaired the generator and thanked the heroes for their help, rewarding the smuggler with rugged smuggling bracers and the trooper with Republic trooper's vambraces as well as 75 credits each.\nWhilst on the mission to repair the generator. Celestra wore a gray shirt over a wrapping of the same color along with red pants. She wore a series of straps and belts across her torso and carried a blaster pistol which she kept holstered on her right hip.\nCelestra is a Non-player character from the massively multi-player online role playing game Star Wars: The Old Republic released by BioWare in 2011. She is involved in a single quest, 'Generator Problems', avaliable to players of the Trooper or Smuggler class on their starting planet of Ord Mantell. It is not possible for players of the Imperial faction to interact with Celestra as there is currently no way Imperial characters can travel to Ord Mantell.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Corps_of_Engineers/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Planet/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Separatist_War",
  "/wiki/Republic_Army",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Fort_Garnik",
  "/wiki/Droid/Legends",
  "/wiki/S3-E3",
  "/wiki/Engineer/Legends",
  "/wiki/Avilatan_Badlands",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Canon",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Havoc_Squad",
  "/wiki/Smuggler/Legends",
  "/wiki/Voidhound",
  "/wiki/Hydrospanner/Legends",
  "/wiki/Turbohammer",
  "/wiki/Multitool",
  "/wiki/Trooper/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons"
 ]
}