{
 "name": "Celis Bol",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 21 BBY",
      "Tilnes"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Caarite"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Metatheran Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Celis Bol was a Caarite who was employed as a technician by the Metatheran Cartel trade alliance during the waning years of the Galactic Republic. Circa 21 BBY, Bol was assigned to a secret Metatheran Cartel base on the moon Tilnes and while working there maintained a personal log recording the technician's personal thoughts. Following the dispersal of a virus fatal to Caarites within the Cartel base by the Believers Sith cult, Bol contracted the contagion and was killed.\nCelis Bol was a Caarite who worked as a technician for the Metatheran Cartel trade alliance during the last years of the Galactic Republic. Bol lived on the planet Caarimon, the homeworld of her species, and around 21 BBY the technician assumed a post at a secret Cartel base situated deep below ground in a tunnel network on the moon Tilnes in the Cularin system. There, Bol worked on a secret project to develop pseudonet encryption, which the Cartel considered to be of high importance. The technician's other duties at the base included tracking shipments of cargo, conducting inventory counts and descrambling things. Bol also maintained a personal log, saved on the Cartel base's computer network, which documented the technician's personal musings.\nFour months after arriving on Tilnes, Bol wrote an entry in the technician's personal log lamenting Bol's time at the base and commenting on how unpleasant the technician regarded being stuck in the secret facility below ground. The follow day, Bol listened to a speech by Thurm Loogg, the Metatheran Cartel's envoy to the Cularin system, which was broadcast via the Caarite holonet, during which Loogg spoke of the Cartel's strength and prosperity. Two days later, Bol was instructed to prepare some bean juice for Ko Bas, the Cartel base's overseer. Irked at being assigned such a menial task, Bol spat in the juice that the technician prepared for him. However, Bas detected the impurity in his drink via a purifier and Bol's pay was docked as a punishment. The technician was also threatened with being give the task of programming the base's bean juice boiler to detect the presence of impurities.\nFour days following the incident with the bean juice, a group of Human allies of the Cartel called upon the base and their presence left Bol feeling unsettled. Just as Bol was writing of the visit in the Caarite technician's personal log, an explosion struck the base, the result of a bomb detonated by the Believers Sith cult to disperse a virus fatal to Caarites within the Cartel installation. Bol subsequently contracted the contagion and was killed.\nTwo weeks after the explosion, the heroes of Cularin, a team of renowned freelance agents, ventured to the Cartel base to investigate a distress signal originating from the facility. While exploring the base, the agents sliced into the facility's computer system and recovered Bol's personal log.\nCelis Bol did not enjoy working on Tilnes; the technician found their job to be dull and wished to return to Bol's former home on Caarimon. Bol detested how the Cartel base on the moon operated in secret deep underground, believing this to be unnatural and that it would be better if the Cartel instead conducted business more openly in the Cularin system. Bol considered the Metatheran Cartel to be one of the most powerful corporations within the Galactic Republic and to be well placed to prosper from tumultuous Clone Wars, fought between the Republic and the separatist Confederacy of Independent Systems. The technician considered this viewpoint to be in line with how Thurm Loogg and Bol's colleagues regarded the Cartel's prospects.\nBol was pleased to be working on the importance pseudonet encryption project and was annoyed when tasked with preparing bean juice for Ko Bas, regarding such an insignificant task to not be worthy of them.  After Bol was castigated for spitting in Bas' drink, the technician was permitted to remain working on the encryption project, which the technician considered to attest to Bol's  importance. However, Bol resolved to take more care in the future to avoid getting into trouble again. Bol felt uneasy when outsiders visited the Tilnes facility because the technician judged that the people of the Cularin system disliked the Cartel and therefore contact with the other residents of the star system negatively impacted morale of the base's staff.\nCelis Bol was mentioned in Caaried Away, a roleplaying adventure by Morrie Mullins set within Star Wars Legends continuity that was released in March 2003. The adventure served as the opening instalment of the Metatheran Caution trilogy of RPGA's Living Force campaign. In the adventure, the players roleplay as the heroes of Cularin and it is possible for the player characters to discover Bol's personal log while investigating the Cartel base. Bol's gender is not specified in the roleplaying adventure.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Tilnes",
  "/wiki/Caarite",
  "/wiki/Metatheran_Cartel",
  "/wiki/Technician/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Metatheran_Cartel_Tilnes_base",
  "/wiki/Moon/Legends",
  "/wiki/Anti-Caarite_virus",
  "/wiki/Believers",
  "/wiki/Sith_cult/Legends",
  "/wiki/Death/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Caarimon",
  "/wiki/Homeworld/Legends",
  "/wiki/Species/Legends",
  "/wiki/Cularin_system",
  "/wiki/Pseudonet_encryption",
  "/wiki/Computer/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Time/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Thurm_Loogg",
  "/wiki/Envoy/Legends",
  "/wiki/Caarite_holonet",
  "/wiki/Bean_juice",
  "/wiki/Overseer_of_Cartel_Operations,_Tilnes_Special_Detachment",
  "/wiki/Water/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Bean_juice_boiler",
  "/wiki/Human/Legends",
  "/wiki/Bomb/Legends",
  "/wiki/Caaried_Away",
  "/wiki/Canon",
  "/wiki/Standard_week/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Distress_signal/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Roleplaying_game",
  "/wiki/Morrie_Mullins",
  "/wiki/March",
  "/wiki/2003",
  "/wiki/Metatheran_Caution_trilogy",
  "/wiki/RPGA",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Gender/Legends",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/Ko_Bas",
  "/wiki/G",
  "/wiki/U"
 ]
}