{
 "name": "Celly Organa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Elder Houses",
      "House of Organa",
      "House of Organa"
     ]
    }
   ]
  }
 ],
 "content": "Duchess Celly Organa was a human female member of the House of Organa of the planet Alderaan. In 9 BBY, she visited the family of her sister, Queen Breha Organa of Alderaan, along with her own family: her husband Kayo and son Niano. While visiting, Celly and family attended a meal at the Royal Palace of Alderaan and discussed politics with Breha and her husband, Senator Bail Organa.\nCelly Organa was a human female duchess of the House of Organa, the royal family of the planet Alderaan. She was the sister of Queen Breha Organa, wife of Duke Kayo Organa, and mother of Niano Organa.\nIn 9 BBY, Organa and her family visited Breha and her family: Senator Bail Organa and his and Breha's daughter, Leia. Breha and Bail needed Celly's family's support, which Breha told who she thought was Leia but was actually Leia's handmaiden Agira in disguise. Celly and her family greeted Breha, Bail, and Leia at a dock and then made their way to a meal at the Royal Palace of Alderaan, where Celly and her husband discussed galactic politics with Breha and Bail. The senator attempted to discuss slavery and the Empire's taxation of the Outer Rim but Kayo made a joke about preferring to eat Bail's food than trying to end slavery, which Celly laughed at. In order to keep the conversation civil, Breha offered Bail a drink.\nCelly Organa had brown eyes, dark hair, and fair skin.\nThe duchess wore beige clothing that had a multicolored design over her chest and shoulders. The garb also had red down the middle of her front that went around her neck as well. Upon arrival to visit her sister's family, she wore an additional red sash.\nCelly Organa first appeared in the new Star Wars canon in \"Part I,\" the first episode of the television series Obi-Wan Kenobi, which premiered on May 26, 2022. While unnamed in the episode, the credits identified her as \"Duchess Celly Organa\" and as portrayed by Roberta Sparta.\nIn the Star Wars Legends continuity, Celly Organa was first mentioned in the 1995 novel Children of the Jedi, written by Barbara Hambly. She later made her first appearance in \"The Princess Leia Diaries,\" a comic story published in Star Wars Tales' eleventh issue. The story was written by Jason Hall, illustrated by Chris Brunner, and published by Dark Horse Comics on March 20, 2002. In Legends, Celly was one of Bail Organa's sisters instead of Breha's, like in the new canon. The change was made since Star Wars creator George Lucas's 1977 notes on Alderaanian culture establish that the royal lineage comes from the queen's side.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Celly_Organa",
  "/wiki/Celly_Organa/Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Celly_Organa",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Elder_Houses",
  "/wiki/House_of_Organa",
  "/wiki/File:Breha-Sister.ogg",
  "/wiki/Duke",
  "/wiki/Planet",
  "/wiki/Alderaan",
  "/wiki/9_BBY",
  "/wiki/Queen",
  "/wiki/Breha_Organa",
  "/wiki/Marriage",
  "/wiki/Kayo_Organa",
  "/wiki/Niano_Organa",
  "/wiki/Royal_Palace_of_Alderaan",
  "/wiki/Politics",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/File:KayoCelly-PartI.png",
  "/wiki/Alderaanian_monarchy",
  "/wiki/Parent",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Handmaiden",
  "/wiki/Agira",
  "/wiki/The_galaxy",
  "/wiki/Slavery",
  "/wiki/Galactic_Empire",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Foodstuff",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/File:Celly_Organa.png",
  "/wiki/Star_Wars",
  "/wiki/Part_I",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/May_26",
  "/wiki/2022",
  "/wiki/Roberta_Sparta",
  "/wiki/Star_Wars_Legends",
  "/wiki/1995",
  "/wiki/Children_of_the_Jedi_(novel)",
  "/wiki/Barbara_Hambly",
  "/wiki/The_Princess_Leia_Diaries",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_Tales",
  "/wiki/Star_Wars_Tales_11",
  "/wiki/Jason_Hall",
  "/wiki/Chris_Brunner",
  "/wiki/Dark_Horse_Comics",
  "/wiki/March_20",
  "/wiki/2002",
  "/wiki/George_Lucas",
  "/wiki/1977",
  "/wiki/Alderaanian",
  "/wiki/StarWars.com",
  "/wiki/Princess_Leia:_Royal_Rebel",
  "/wiki/Standard_year",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Disney%2B",
  "/wiki/May_27",
  "/wiki/Marvel_Comics"
 ]
}