{
 "name": "Cellvanta_Grathan",
 "display_name": "Cellvanta Grathan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dromund Kaas"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Dromund Kaas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Unknown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "House Grathan"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Lord Grathan"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Beelzlit Grathan"
     ]
    }
   ]
  }
 ],
 "content": "Cellvanta Grathan was a Human female Sith who was the wife of the rebel Sith Lord Grathan of the Sith Empire and mother of Beelzlit Grathan.\nIn 3643 BBY, she lived in her husband's estate on Dromund Kaas where she remained with her son until the arrival of Darth Baras' apprentice, who was sent to kill her son, Beelzlit. Cellvanta attempted to protect her son from the Sith and quickly told him to run, but Beelzlit fought to protect her instead. The mother and son engaged the Sith Warrior in a fight but were easily defeated. Badly beaten, Cellvanta begged for mercy pleading to know what she or her son had done wrong. Realizing that her husband had gotten both her and her son Beelzlit into the whole Sith affair due to both his political dealings, she tried to bargain with the Apprentice. Hoping to save her son, she offered the Sith Warrior her husband, Lord Grathan's, life in exchange for Beelzlit's. The Sith Warrior refused her offer and chose to kill them both. Cellvanta quickly told her son again to run, but Beelzlit chose to remain behind and die alongside her. Cellvanta was stabbed by the Sith Warrior before she could do anything more.\nIf Cellvanta is spared for a light side option, she convinces the Sith Warrior to kill her husband and allow her son to take his place. If the Sith Warrior is male, after he kills Grathan, she offers the Sith apprentice the chance to become \"intimate\". She later sends a gift to the Sith Warrior through Ralesk, her former husband's top assassin. Possibly unknown to her, her son also tasked him with silencing them, so his secret identity would remain a secret. Ralesk fails in his attempt, being defeated by the Sith Warrior, both intents remaining unaccomplished.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Cellvanta_Grathan",
  "/wiki/Dromund_Kaas",
  "/wiki/3643_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Grathan",
  "/wiki/Beelzlit_Grathan",
  "/wiki/Sith/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Lord_Grathan%27s_estate",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Sith_Warrior",
  "/wiki/Ralesk",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}