{
 "name": "Cenevax",
 "display_name": "Cenevax",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jenet"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Cenevax was a Jenet female crime lord who ran an underground gambling ring on Coruscant. She had corrupt officials in many places, including the Coruscant Security Force. When the Jedi Arath Tarrex got into debts with Cenevax, Jedi Master Yula Braylon, secretly the mother of Tarrex, made a deal with Cenevax, agreeing to ignore her crimes. During the forty-eighth annual Dragonfire Air Rally, the Serennian Ramil agreed to purposely lose the race so Cenevax could earn money from those who bet on his victory. When Ramil failed to follow Cenevax's orders, she sabotaged his airspeeder. The corrupt Coruscant Security Force inspector Sartori attempted to cover up the sabotage, but the Jedi Dooku and Qui-Gon Jinn discovered the truth, and followed Sartori back to Cenevax's den. After capturing the crime lord, the Jedi uncovered the truth about Tarrex's parentage, and Cenevax was sent to be imprisoned in the Citadel.\nCenevax appeared in the audiobook Dooku: Jedi Lost, written by Cavan Scott and published in 2019.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jenet",
  "/wiki/Gender",
  "/wiki/Crime_lord",
  "/wiki/Gambling",
  "/wiki/Coruscant",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Jedi",
  "/wiki/Arath_Tarrex",
  "/wiki/Jedi_Master",
  "/wiki/Yula_Braylon",
  "/wiki/Parent",
  "/wiki/Forty-eighth_annual_Dragonfire_Air_Rally",
  "/wiki/Dragonfire_Air_Rally",
  "/wiki/Serennian",
  "/wiki/Ramil",
  "/wiki/Airspeeder",
  "/wiki/Inspector",
  "/wiki/Sartori",
  "/wiki/Dooku",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Prison",
  "/wiki/Citadel",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Cenevax",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Cavan_Scott",
  "/wiki/2019",
  "/wiki/Dooku:_Jedi_Lost_(script)"
 ]
}