{
 "name": "Cene_Gilvent",
 "display_name": "Cene Gilvent",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Saclas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ocsinin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Zulirian Swordmasters"
     ]
    }
   ]
  }
 ],
 "content": "Cene Gilvent was a female Ocsinin swordsbeing.\nA pupilless-eyed Near-Human from the world of Saclas, Gilvent harvested native gelatinous slimes to be exported as pets for Gamorrean youths. She eventually earned enough money to pay a ticket to the Mid Rim. There, she showed an interest in fencing.\nGilvent was hired by the Zuliria Museum of Antiquities to maintain properties, and for the following seven years she learned  dozens of fencing styles, from the Teelar two-handed method from the long-extinct Lar warriors, to the Kartranin methods of the then-recently-founded Murra Orders.\nGilvent was by this point a middle-aged blonde woman with white skin, with a strong complexion for an Ocsinin, but slender for a humanoid. Gilvent met Ther-das and attempted to join the Zulirian Swordmasters, but the Swordmasters rejected her because of her unorthodox—although efficient—fighting techniques. However, the Swordmasters came to understand her love and mastery of her abilities, and allowed her to join.\nFellow Swordsmaster Mlatar Thon Gra also built Gilvent's customized weapon, the Soknar, by combining a Somreth tri-blade of the Drevun Six, the Barnax \"Twenchok\" foil and the Coynite sat'skar. Gilvent kept a friendly rivalry with Swordmaster Kaltor Naklian, as neither of them had ever lost a duel.\nGilvent was one of the Swordmasters who participated in the skirmish of Teloc Ol-sen, where Naklian killed an agent of the Alliance to Restore the Republic, leading to a massacre of the entire Rebel cell by the Swordmasters. Since then, the Swordmasters were considered a threat to the Rebel Alliance.\nGilvent later fought a team of new Rebel recruits under the orders of Bren Derlin in Fislan. Apparently, the soldiers were battered but survived; however, Derlin was so convinced of the threat Gilvent supposed, that he wrote a report on her, suggesting the use of a sharpshooter to neutralize her.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Saclas",
  "/wiki/Ocsin",
  "/wiki/Gender/Legends",
  "/wiki/Zulirian_Swordmasters",
  "/wiki/Major/Legends",
  "/wiki/Bren_Derlin/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Near-Human",
  "/wiki/Planet/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Zuliria_Museum_of_Antiquities",
  "/wiki/Standard_year/Legends",
  "/wiki/Teelar_two-handed_method",
  "/wiki/Lar_warriors",
  "/wiki/Kartranin_method",
  "/wiki/Murra_Orders",
  "/wiki/Humanoid/Legends",
  "/wiki/Ther-das",
  "/wiki/Mlatar_Thon_Gra",
  "/wiki/Soknar",
  "/wiki/Somreth_tri-blade",
  "/wiki/Drevun_Six",
  "/wiki/Barnax",
  "/wiki/%22Twenchok%22_foil",
  "/wiki/Coynite/Legends",
  "/wiki/Sat%27skar",
  "/wiki/Kaltor_Naklian",
  "/wiki/Teloc_Ol-sen",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Fislan",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}