{
 "name": "Cere_Junda",
 "display_name": "Cere Junda",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.65 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic",
      "Stinger Mantis crew"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Eno Cordova"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Trilla Suduri",
      "Cal Kestis"
     ]
    }
   ]
  }
 ],
 "content": "Cere Junda, a Force-sensitive human female, was a former Jedi Knight and Jedi seeker, who mentored Padawan Cal Kestis in the ways of the Force during the rise of the Galactic Empire. At one time, she served as the Padawan of Jedi Master Eno Cordova before taking Trilla Suduri as her apprentice. In the aftermath of Order 66, Junda severed her connection to the Force and disappeared into hiding, while Suduri fell to the dark side and joined the Imperial Inquisitorius. She later met Greez Ditrus, soon joining the crew of the Mantis. Determined to overthrow the regime that all but annihilated her fellow Jedi, Junda dedicated herself to the secret restoration of the Jedi Order.\nDiscovered by a Jedi seeker as an infant, Cere Junda was trained in the Jedi arts at the Jedi Temple on Coruscant. Like many other younglings, Cere was taken to Ilum to construct her lightsaber. Master Yoda was present to guide the younglings during her trip there. Junda was a Padawan to Jedi Master Eno Cordova during the reign of the Galactic Republic. At one point the two travelled to the planet Nameel where they attempted to settle a feud between a gang of Trandoshans and a group of Dupei monks. Junda was easily provoked by the situation, using the Force to push the two sides away from each other during the heated confrontation. Master Cordova was intrigued by the presence of the monks and wished to interview both sides regarding the matter, starting with the monks. While he was doing that, Junda attempted to quell an argument between the Trandoshan's warlord Vurrsk and a member of his gang who challenged his authority. Her intervention was seen as unwelcome, thus temporarily uniting the whole gang in a fight against her. At the height of the battle, Cordova emerged from his interview with the monks and revealed that they had confessed having stolen credits from the Trandoshans who were trying to purchase weapons from them. Junda became apologetic to the gang and self-conscious about having jumped to conclusions too soon. She later attempted to explain her actions to the Jedi High Council, with Cordova defending her. Ultimately, Mace Windu concluded that the situation was rather complicated and proceeded to move the discussion to the topic of their next assignment. Junda and Cordova were then sent by the Council to oversee an excavation of a temple located on the planet Ontotho but in the process, they were caught up in a battle between the Fylar Freedom Fighters and the local security forces. During the course of the battle, Junda worked with the Fylar Freedom Fighters. She eventually became a Jedi Knight serving the Order as a Jedi seeker, and took Trilla Suduri as her Padawan. During the Clone Wars, after Order 66 was implemented and the Jedi were declared traitors, Junda and Suduri's clone troopers turned against them but were able to take several Jedi younglings and go into hiding.\nJunda, Suduri, and their group of Jedi younglings tried to escape from the forces of the Galactic Empire, but Junda was eventually captured in an attempt to lure the Empire away from the others. Captured and subjected to torture at the Fortress Inquisitorius on the moon Nur after leading away the Imperial forces hunting Suduri and the younglings, Junda initially held firm under the harsh questioning, even when the Dark Lord of the Sith Darth Vader became personally involved. Ultimately, though, Junda broke and gave up Suduri to the Empire, leading her to fall to the dark side of the Force under similar torture and become an Inquisitor, taking up the name of the \"Second Sister.\"\nAfter Suduri's transformation, she was brought into the room to mock and taunt Junda and her failed protection efforts. As she looked upon her fallen apprentice, Junda became overwhelmed with anger and regret, and tapped into the dark side in this rage, killing everyone in the room and that she came across during her escape, except Suduri herself. During her escape, Junda managed to steal several Imperial code clearances.\nOver the years, Junda decided to suppress her connection to the Force, having felt the power of the dark side and overcome with fear of falling completely into it, as well as becoming burdened by guilt over Suduri's fate.\nAt some point after her escape from the Empire, Junda met the pilot Greez Dritus and joined the crew on his ship, the Stinger Mantis, hiring him for his services to her. Junda chose him because he was cheap, had no qualms about breaking the law. Junda also had a hunch that he wouldn't betray her.\nAt one point the two traveled to the Slag Pit cantina on Nar Shaddaa. There, Greez was ambushed by a group of smugglers, causing them to all be kicked out. Greez ended up drinking rum from Junda's flask in the alley outside. According to Junda, that day became memorable as one of the best days of her life.\nDuring one of their missions, Junda and Greez travelled to Todola after having heard that there was a possible Jedi in hiding within the area. When the two arrived, they quickly discovered the system to be heavily-occupied by a strong Imperial presence. They also learned that the location was being used as a secret walker production site. The Imperials then contacted the Mantis, warning that they would fire upon the ship. Junda responded quickly, apologizing and coming up with an excuse of how their pilot was sick and that the ship's sensors were currently offline.\nAfter years of living in seclusion, Junda and Dritus rescued Cal Kestis on the planet Bracca, where her fallen apprentice was attempting to kill the Jedi fugitive. She took Kestis to Bogano, where an ancient vault previously visited by Cordova was located. There, Kestis discovered a droid, BD-1, who played a message from Cordova telling the viewer that he had hidden a Jedi holocron inside the vault. The holocron contained the names of Force-sensitive children across the galaxy. Junda, realizing that the holocron could be the key to rebuilding the Jedi Order, took it upon herself to mentor the former Padawan and complete his training. She and Kestis embarked on a quest to unlock the knowledge necessary to recover the holocron that took them across the galaxy. During their time together, she gave her old lightsaber to Kestis, who used it in conjunction with his first master's lightsaber  to create a weapon of his own on Ilum.\nWith Kestis, she infiltrated the Fortress Inquisitorius in an effort to recover a Jedi holocron containing a list of Force-sensitive children, which was in the possession of Suduri. Using Suduri's lightsaber  as a weapon, she and Kestis succeeded in reacquiring the holocron. The mission brought her face-to-face with her former Padawan, who she attempted to make amends with. However, her efforts were cut short when Darth Vader murdered Trilla. Junda and Kestis made a frantic escape from the Sith Lord, including a brief duel in which Junda was thrown into an abyss and injured. Kestis almost drowned trying to save Junda before they were both rescued by Merrin.\nBack on the Mantis, Junda and Kestis discussed what to do with the holocron, deciding to destroy it to prevent it falling into the Empire's hands.\nBy 9 BBY, Junda had seemingly vanished, along with crewmembers Greez Dritus and Merrin, as she was not operating at her station on the Mantis when it had landed on a planet.\nDuring her days as Cordova's Padawan, Cere was often impulsive and rash, described by Cordova to be especially more so when it comes to judgements on her character and as such, had a tendency to escalate situations when provoked. Despite her impulsive tendencies, Cere proved herself a proactive and able Jedi. As she grew older, Cere became more wise, stern, a caring mentor figure, and proved to be a unconventional Jedi. Having a fondness for art, she spent time in the Jedi Archives during her younger years looking through different art pieces and as a Jedi seeker, enjoying encountering arts and architecture from different cultures. Cere had also begun playing the hallikset during her time as a Padawan, finding music to sooth and ease her tension.\nDuring her lifetime, Cere experienced a moment of weakness while being interrogated by Darth Vader and tortured in a Interrogation chair when she revealed the location of her hidden apprentice and younglings and after she witnessed the cost of her mistake, used the dark side of the Force to escape imprisonment. Her guilt for her moment of weakness was surmountable, developing suicidal thoughts and eventually cut herself off from the Force for a time. She later admitted that the very idea of her using the Force after that was considered dangerous. After her former apprentice stole Cordova's holocron and understood the stakes in the Emperor having a list of Force-sensitive children, she was able to repair her connection to the Force upon Cal's reminder of a lesson she imparted onto him.\nAs a unconventional Jedi, she grew to have reservations about the traditions associated with the Jedi Order and thought it to be flawed and held back by dogmatic tradition; she once revealed she found it strange for the creation of lightsabers to be a bonding activity among Jedi despite their role as peacekeepers. She also recognized that despite Jedi being trained to disregard accolades, successful leaders like Taron Malicos still grew accustomed to fame and glory. Overtime she had gained a preference for a blaster and preferred to wear different clothing later in her life compared to Jedi robes. Despite this, she willingly led a quest to restore the Jedi Order with the intent of building a better future rather than restore the past and wished to end the tyranny of the Galactic Empire. She was also an opponent to High Human culture, disapproving of the notions that droids and non-humanoids were inferior to humans.\nA skilled Jedi Knight, Cere possessed skill in lightsaber combat apt enough to incapacitate multiple Trandoshan warriors and Purge Troopers. She could also redirect blaster fire with her lightsaber and combine her lightsaber prowess with her skill in a blaster to a great effect in combat, proving to be a fine marksmen.\nAs a Force user, Cere possessed tremendous power, especially in the dark side much to her own horror; she could create a Force barrier similar in appearance and potency to a ray shield, a barrier that was capable of stopping Darth Vader's lightsaber briefly, but was also rendered unconscious from the effort. With the dark side of the Force, she proved capable of inflicting mass destruction and killing a multitude of people when giving in to despair, fear and rage by involuntarily releasing a shockwave that broke her free from her interrogation chair, killing all but her fallen Padawan. Though it wasn't enough to stop him, Junda was notably capable of slowing the incredibly powerful Vader down with the power of the dark side for a few seconds, something the Sith Lord was impressed by and believed her to be a prime candidate for being an Inquisitor.\nDuring the time of the Galactic Republic, Junda possessed Jedi robes and a lightsaber with a green blade, both of which she abandoned the use of during the first years of the Empire in favor of a DL-18 blaster pistol. During this time, she also acquired from Kestis her former apprentice Trilla's double-bladed spinning lightsaber, which she made use of in conjunction with a blaster pistol during her incursion on Nur with Kestis. She possessed a seven-string hallikset that Kestis once found and used psychometry to play.\nCere Junda is a character created for the Star Wars video game Star Wars Jedi: Fallen Order, released on November 15, 2019. She is portrayed by Debra Wilson. In the initial design phase for the character, Cere had a cane and physical scars. The production team originally planned on giving her a debilitating physical wound that came as a result of the Imperial torture, but ultimately decided on following the story arc of a crisis of faith.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/The_Art_of_Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Star_Wars:_Jedi_Fallen_Order_-_Dark_Temple",
  "/wiki/StarWars.com",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Stinger_Mantis_crew",
  "/wiki/Eno_Cordova",
  "/wiki/Second_Sister",
  "/wiki/Cal_Kestis",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi_seeker",
  "/wiki/Padawan",
  "/wiki/The_Force",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Time",
  "/wiki/Jedi_Master",
  "/wiki/Order_66",
  "/wiki/Sever_Force",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Inquisitorius",
  "/wiki/Greez_Dritus",
  "/wiki/New_Order",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Jedi",
  "/wiki/Secret_mission_to_rebuild_the_Jedi_Order",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Ilum",
  "/wiki/Yoda",
  "/wiki/Republic_Era",
  "/wiki/Planet",
  "/wiki/Nameel",
  "/wiki/Trandoshan",
  "/wiki/Dupei_monks",
  "/wiki/Vurrsk",
  "/wiki/Jedi_High_Council",
  "/wiki/Mace_Windu",
  "/wiki/Temple_on_Ontotho",
  "/wiki/Ontotho",
  "/wiki/Battle_for_Ontotho",
  "/wiki/Fylar_Freedom_Fighters",
  "/wiki/Clone_Wars",
  "/wiki/Treason",
  "/wiki/Clone_trooper",
  "/wiki/Jedi_Initiate",
  "/wiki/Imperial_Military",
  "/wiki/Prisoner",
  "/wiki/Torture",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Anakin_Skywalker",
  "/wiki/Stinger_Mantis",
  "/wiki/Slag_Pit",
  "/wiki/Nar_Shaddaa",
  "/wiki/Todola",
  "/wiki/Walker",
  "/wiki/Standard_year",
  "/wiki/Escape_from_Bracca",
  "/wiki/Bracca",
  "/wiki/Death",
  "/wiki/Bogano",
  "/wiki/Bogano_Vault",
  "/wiki/BD-1",
  "/wiki/Jedi_holocron",
  "/wiki/Jedi_training",
  "/wiki/Cere_Junda%27s_lightsaber",
  "/wiki/Jaro_Tapal%27s_lightsaber",
  "/wiki/Dathomir",
  "/wiki/Lightsaber",
  "/wiki/Cal_Kestis%27_second_lightsaber",
  "/wiki/Second_Sister%27s_lightsaber",
  "/wiki/Merrin",
  "/wiki/9_BBY",
  "/wiki/Jedi_Archives",
  "/wiki/Interrogation_chair",
  "/wiki/Taron_Malicos",
  "/wiki/Jedi_robes",
  "/wiki/High_Human",
  "/wiki/Lightsaber_combat",
  "/wiki/Purge_Trooper",
  "/wiki/Force_barrier",
  "/wiki/Ray_shield",
  "/wiki/Inquisitor",
  "/wiki/DL-18_blaster_pistol",
  "/wiki/Seven-string_hallikset",
  "/wiki/Psychometry",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/November_15",
  "/wiki/2019",
  "/wiki/Debra_Wilson",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_1",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_2",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_3",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_4",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_5",
  "/wiki/Category:Images_of_Cere_Junda",
  "/wiki/Star_Wars_Insider",
  "/wiki/Inside_the_Fallen_Order",
  "/wiki/Star_Wars_Insider_193",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Star_Wars_Inside_Intel:_The_Inquisitorius",
  "/wiki/Databank_(website)",
  "/wiki/July_24",
  "/wiki/December_7",
  "/wiki/Star_Wars_Jedi:_Survivor",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/14_BBY",
  "/wiki/Electronic_Arts"
 ]
}