{
 "name": "Ceret",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kotab",
      "Sagamore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kotabi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Non-binary"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Ceret was a trans non-binary Kotabi Jedi Knight, and the bond-twin of Terec. Both twins were stationed at the Starlight Beacon space station during the High Republic Era. Their bond meant Terec and Ceret shared the same gestalt mind, and frequently finished each other's sentences even when not in the same room.\nCeret was a Kotabi trans non-binary being and the bond-twin of Terec. The twins were part of the Jedi Order during the High Republic Era.\nCeret and Terec joined Jedi Master Sskeer and Jedi Knight Keeve Trennis, who had been knighted just before the mission, in traveling to the Kazlin system after Starlight received a scrambled distress signal from the system. They docked their T-1 shuttle with the wreckage of a ship and entered, donning rebreathers upon encountering gas, which implied a Nihil attack. Ceret and Trennis soon split off from the group as Sskeer and Terec went another direction. Ceret began to sense anger and pain in Sskeer, telling Trennis that something was wrong. Soon after, the two discovered the corpse of a dead Hutt. Ceret observed blaster burns, stab wounds, and evidence of nagnol poisoning. After suggesting that the Hutt ship may have been carrying crops to sell the harvest to the highest bidder following the Great Disaster, Ceret found a damaged navidroid whose databanks stated that it was travelling from the Sedri system at the time of the attack.\nUpon confirming that an outpost was stationed on Sedri Minor, Marshal Avar Kriss dispatched Master Sskeer and Ceret to the planet in the hopes that they could trace the shipment of Vratixia renanicus back to its origin. After landing, a mysterious Rodian caught Ceret's attention and drew them deeper into the crop fields, after which they were attacked by a Drengir vine and abducted into its underground lair. When Master Sskeer attempted to find the missing Jedi, he only discovered Ceret's lightsaber lying alone on the ground.\nAfter arriving on the planet alongside Marshal Kriss, Master Sskeer and a wounded but strangely plagued Jedi Terec, Jedi Keeve Trennis found Ceret in the Drengir's lair after searching through a sinkhole with the stray Bartol. Ceret was incapacitated and strung up by thick vines, stretching into their ears, nose and mouth. After Trennis freed Ceret, they warned her of the Drengir that lay in the caves. The Drengir took control of Ceret's mind, subsequently causing their bond-twin Terec to become affected by the power of the Drengir. Ceret held back Bartol as the Drengir attempted to infest Trennis' mind, but she was saved by Marshal Kriss.\nKriss compelled Ceret to release Bartol, also freeing the Jedi from the control of the Drengir. Though Ceret had been freed from the grasp of the Drengir, Sskeer arrived, fully possessed by the vinery of the plant monsters. Sskeer and the Drengir then used vines to capture Ceret, along with Kriss, Bartol, and Trennis. Trennis attempted to get through to Sskeer despite the Drengir's influence, but Ceret told her that it was hopeless, that they had seen the reaping and that the Drengir survive no matter what happens. As the Drengir attempted to take control of the prisoners by inserting their vines into their mouths and noses, Ceret warned that not only Sskeer was lost, but all of them too. However, before they were taken over, Sskeer double crossed the Drengir and used the Force to send the monsters to the surface, allowing Ceret and the others to be free. However, the Drengir were still in possession of Bartol, and so Ceret joined the other Jedi in fighting against the Drengir to get him back.\nAfter the Jedi saved Bartol, they soon found themselves under attack by Myarga the Hutt and the Hutt Clan, who were attempting to take over Sedri Minor. Trennis was being overwhelmed by protecting civilians from Clan soldier blasterfire, so Ceret offered to get the civilians to safety. Trennis protested, as she was worried that Ceret was too weak, but while Ceret acknowledged that this was true, they insisted that the Force was strong and started to lead the civilians away.\nHowever, Ceret and the civilians didn't get to far before finding themselves faced with a Hutt rancor being controlled by a Gamorrean soldier. Ceret assured the civilians that they would hold the beast back with the Force. But when they attempted to do so, their weak state caused them to not be able to hold it up for long before they were tackled by the Rancor's foot. The rancor put them in its mouth and attempted to eat them. Kriss asked Trennis where Ceret was and after seeing the situation they were in, she quipped that they were 'keeping busy.' Ceret wished out loud to hav their lightsaber, and found that wish quickly answered when Terec arrived with both of their lightsabers, saying that the best part about their special bond is that they always had each others backs. Terec knocked the Gamorrean down and then put the rancor to sleep with the Force, before offering Ceret's lightsaber to them. Ceret expressed concern over the things that they had seen and been subjected to when the Drengir took them over, but Terec insisted that that was the past and that they would never be separated again. The twins, wielding their lightsabers, then jumped into the battle against the Hutt Clan, shouting 'for light and life.'\nThe Drengir would return, and the Jedi had to work together with the Hutts against the monsters. But Trennis managed to affect the Drengir's linked minds through Sskeer and convince them leave them alone. Myarga asked with confusion what was happening, and Ceret told her that they were retreating.\nCeret first appeared along with Terec in The High Republic 2. A post on the Star Wars Instagram for International Transgender Day of Visibility in 2021 expanded upon Ceret's in-universe pronouns to confirm that Ceret and Terec are both trans non-binary. The post included Javier Garrón's The High Republic  6 variant cover, part of the line of Pride Month variant covers for Marvel comic books released in June 2021, which features LGBTQIA+ artists paired with LGBTQIA+ characters.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/The_High_Republic_(2021)_6",
  "/wiki/The_High_Republic_(2021)_8",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/The_High_Republic_(2021)_10",
  "/wiki/The_High_Republic_(2021)_11",
  "/wiki/The_High_Republic_(2021)_12",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kotab",
  "/wiki/Sagamore",
  "/wiki/Kotabi",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Knight",
  "/wiki/Bond-twins",
  "/wiki/Terec",
  "/wiki/Twin",
  "/wiki/Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi_Master",
  "/wiki/Sskeer",
  "/wiki/Keeve_Trennis",
  "/wiki/Kazlin_system",
  "/wiki/Distress_signal",
  "/wiki/Star_system",
  "/wiki/T-1_shuttle_(Jedi_Order)",
  "/wiki/Breath_mask",
  "/wiki/Gas",
  "/wiki/Nihil",
  "/wiki/Death",
  "/wiki/Hutt",
  "/wiki/Nagnol",
  "/wiki/Poison",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Navidroid",
  "/wiki/Sedri_system",
  "/wiki/Sedri_Minor",
  "/wiki/Marshal",
  "/wiki/Avar_Kriss",
  "/wiki/Vratixia_renanicus",
  "/wiki/Rodian",
  "/wiki/Drengir",
  "/wiki/Jedi",
  "/wiki/Bartol",
  "/wiki/Plant",
  "/wiki/The_Force",
  "/wiki/Myarga",
  "/wiki/Hutt_Clan",
  "/wiki/Rancor",
  "/wiki/Gamorrean",
  "/wiki/The_High_Republic_(2021)_2",
  "/wiki/Star_Wars",
  "/wiki/2021",
  "/wiki/In-universe",
  "/wiki/Javier_Garr%C3%B3n",
  "/wiki/Marvel_Comics",
  "/wiki/June",
  "/wiki/The_High_Republic_(2021)_3",
  "/wiki/The_High_Republic_(2021)_4",
  "/wiki/The_High_Republic_(2021)_5",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_6",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic_(2021)_13",
  "/wiki/The_High_Republic:_Trail_of_Shadows_5",
  "/wiki/Category:Images_of_Ceret",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Knights_at_the_Roundtable",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars_Inside_Intel:_Jedi_of_the_High_Republic",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Accessories_and_Structures",
  "/wiki/The_Art_of_Star_Wars:_The_High_Republic_(Phase_One)",
  "/wiki/March_31"
 ]
}