{
 "name": "Cev_Malanx",
 "display_name": "Cev Malanx",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  }
 ],
 "content": "Cev Malanx was a smuggler who operated the YT-1210 light freighter Starspin alongside his partner, Regec Sloom.\nMalanx started smuggling at a young age when his father took him on smuggling runs throughout the Mid Rim. When he got older, his father gave him a battered Ghtroc tramp freighter and sent Malanx out to the Outer Rim to earn a living. Unfortunately, the ship broke down and left Malanx stranded at the Gelgelar Free Port. He eventually met Regec Sloom and formed a partnership with him to continue his career.\nMalanx and Sloom were at Betha II Starport where they were supposed to meet with a group of New Republic agents who were posing as smugglers. Before they could meet them, they were accosted by a Devaronian and a pair of Ho'Din who attempted to rob the two smugglers. After thieves were dispatched, Malanx and his partner decided to leave the planet and head to safer territory. Before leaving, Malanx assisted the agents when they were attacked by several starships loyal to the Kaarenth Dissension.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/YT-1210_light_freighter/Legends",
  "/wiki/Starspin_(YT-1210_light_freighter)",
  "/wiki/Regec_Sloom",
  "/wiki/Mid_Rim",
  "/wiki/Ghtroc_Industries/Legends",
  "/wiki/Tramp_freighter",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Gelgelar_Free_Port/Legends",
  "/wiki/Betha_II_Starport",
  "/wiki/Devaronian/Legends",
  "/wiki/Ho%27Din/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Restored_Empire",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Counterstrike_(Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_8"
 ]
}