{
 "name": "Ch%27Gang_Hool",
 "display_name": "Ch'Gang Hool",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Koros-Strohna"
     ]
    },
    {
     "name": "Died",
     "values": [
      "28 ABY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Domain Hool"
     ]
    }
   ]
  }
 ],
 "content": "Ch'Gang Hool was the Master Shaper in charge of the worldshaping of Yuuzhan'tar. He was tasked with growing the thirteen dhuryams, and supervising which one would become the World Brain.\nCh'Gang Hool was arrogant and proud, confident of the superiority of the shaper caste and his own skills. High Prefect Yoog Skell, however, felt Hool's talents were considerably less than his ego, and always suspected that Hool was responsible for the failed escalation of one of his subordinates, Fal Tivvik.\nIn charge of the Seedship and the worldshaping of Yuuzhan'tar, he lorded himself over his fellows. Initially he was reluctant to allow Jacen Solo onto a slave detail for one of the thirteen dhuryams but he was persuaded by Vergere and Nom Anor, who were conducting their own project involving the captured Jedi. His fear was justified when Solo armed himself with amphistaffs and butchered the other eleven dhuryams, along with hundreds of warriors. Solo then set free the slaves on the surface of Hool's subject planet.\nHool ordered Executor Nom Anor to track down Solo and put an end to him. Thousands of warriors were airdropped over the fleeing Jedi, although Solo escaped, much to the horror of the Shaper.\nCh'Gang Hool was later present at the Duel at the Well of the World Brain, where Jedi Knight Ganner Rhysode held off hundreds of warriors sent to stop Solo's sabotaging of the World Brain. It was too late, however, and with Rhysode's sacrifice the heretic movement picked up strength and the World Brain was corrupted due to Solo's influence.\nThe Master Shaper was quickly out of his depth with the renegade dhuryam, as it engineered faults across the captured Coruscant, albeit minor ones. This only fueled the heresy spreading through the bowels of the planet; that the Yuuzhan Vong had been abandoned by their gods. When the Supreme Overlord himself, Shimrra Jamaane, arrived on Yuuzhan'tar, Hool was present at the huge ceremony held to welcome the Dread Lord. When asked of his progress in bioforming the planet, Ch'Gang Hool watered down his report, remarking offhandedly that the only noticeable problem was an itching plague, and that any high caste Yuuzhan Vong was capable of enduring it.\nUnfortunately for Hool, Shimrra had noticed him scratching his itch throughout the ceremony, and revealed himself to be more informed of the problems than Hool had realized. The crowd was whipped into a frenzy, clamoring for the scapegoat's death. Shimrra delivered his judgment and Ch'Gang Hool was dragged away to his death.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Koros-Strohna",
  "/wiki/28_ABY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Domain_Hool",
  "/wiki/Master_Shaper",
  "/wiki/Terraforming/Legends",
  "/wiki/Dhuryam",
  "/wiki/World_Brain",
  "/wiki/Shaper_caste",
  "/wiki/High_Prefect",
  "/wiki/Yoog_Skell",
  "/wiki/Fal_Tivvik",
  "/wiki/Seedship",
  "/wiki/Darth_Caedus",
  "/wiki/Slavery/Legends",
  "/wiki/Vergere",
  "/wiki/Nom_Anor",
  "/wiki/Solo_Project",
  "/wiki/Jedi/Legends",
  "/wiki/Amphistaff",
  "/wiki/Warrior_caste",
  "/wiki/Executor_(Yuuzhan_Vong_rank)",
  "/wiki/Duel_at_the_Well_of_the_World_Brain",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Ganner_Rhysode",
  "/wiki/Jeedai_heresy",
  "/wiki/Yun%27o",
  "/wiki/Supreme_Overlord",
  "/wiki/Shimrra_Jamaane",
  "/wiki/Dread_Lord",
  "/wiki/Itching_plague",
  "/wiki/Death/Legends",
  "/wiki/The_New_Jedi_Order:_Traitor",
  "/wiki/The_New_Jedi_Order:_Destiny%27s_Way",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_120",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}