{
 "name": "Cha Raas",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Security Bureau"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Babel Torsch"
     ]
    }
   ]
  }
 ],
 "content": "Specialist Cha Raas was an agent in the Imperial Security Bureau. He was known as one the nastiest Imperials in the Minos Cluster.\nCha Raas was the subordinate and apprentice to Babel Torsch, an Imperial Customs agent who operated in the Minos Cluster. The Galactic Empire had noticed the growing underground holovid activity on the planet Adarlon and had sent Raas to investigate the nightclub Glow Dome. He became interested in acquiring Doctor Lytos Urtell's prototype personal holoprojector for himself rather than turning it over to the Empire.\nHe was antisocial, rude, arrogant and hated almost everyone be they Rebel or Imperial. He despised his boss and mentor, Torsch. Raas could adopt a charming and friendly persona as part of his undercover investigations but it was always an act. He was a master of disguise and so it was hard to know what he truly looked like. He was average height, medium build who appeared to be in his early thirties so he blended into any crowd.\nA competent undercover investigator, Raas had all the talent and training to reach his destination, infiltrate via disguise or charm, uncover evidence and then sneak his way back out. In case he was detected he was well trained in blasters.\nRaas carried a blaster pistol, a comlink, and a datapad. He would wear his ISB uniform normally but had disguises and plainclothes for his undercover operations.\nCha Raas was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. He was illustrated by Tom O'Neill.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Babel_Torsch",
  "/wiki/Specialist/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Imperial_Office_of_Customs/Legends",
  "/wiki/Holovid/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Adarlon/Legends",
  "/wiki/Glow_Dome",
  "/wiki/Doctor/Legends",
  "/wiki/Lytos_Urtell",
  "/wiki/Holoprojector/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Tom_O%27Neill"
 ]
}