{
 "name": "Chadkol Gee",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Calamari monarchy"
     ]
    }
   ]
  }
 ],
 "content": "Chadkol Gee was a Quarren advisor of General Nossor Ri during the war between the First Order and the Resistance. Gee was fiercely isolationist, and was among a contingent of government personnel who confronted Resistance General Leia Organa when she arrived on Mon Cala.\nChadkol's family were tortured and killed while under the yoke of Imperial oppression. Chadkol blamed Leia Organa for the occupation because the orders were given by Darth Vader, her father. Because of this, he contacted General Armitage Hux to inform the First Order that Leia and her co-conspirators were on Mon Cala.\nAfter an incident between the Resistance members and Quarren on the landing platform that was orchestrated by Chadkol and Nossor Ri, during a trial presided over by King Ech-Char, Chadkol suggested that the Ancient Rite of Challenge be used to determine their fate, using Arkay-Nine as his champion. After violating the rules of the Rite, Leia's contingent was ordered to leave Mon Cala.\nOne of Chadkol and Ri's attendants tried to sabotage the Resistance ship and was captured by Rey. At this time, a First Order fleet arrived, so Leia confronted Chadkol, denying his allegations that she brought the fleet to Mon Cala, and presenting the captured attendant to testify against Chadkol. Ech-Char denounced Chadkol for treason. Ech-Char allowed a fleet of Mon Cala ships to go with the Resistance and the First Order took revenge on Mon Cala, leaving Chadkol to repeat \"I warned them that they would bring war to Mon Cala again... I warned them...\"\nChadkol Gee first appeared in the comic Allegiance 1, although the Quarren's name was first revealed in the comic's Behind the Scenes section. Here, Gee is scripted to have said Nossor Ri's dialogue, though this was not the case in the actual comic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Mon_Cala",
  "/wiki/Quarren",
  "/wiki/Color",
  "/wiki/Mon_Calamari_monarchy",
  "/wiki/Advisor",
  "/wiki/General",
  "/wiki/Nossor_Ri",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Invasion_of_Mon_Cala",
  "/wiki/Anakin_Skywalker",
  "/wiki/Armitage_Hux",
  "/wiki/King",
  "/wiki/Ech-Char",
  "/wiki/Ancient_Rite_of_Challenge",
  "/wiki/Arkay-Nine",
  "/wiki/Rey_Skywalker",
  "/wiki/Treason",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Allegiance_1",
  "/wiki/Allegiance_2",
  "/wiki/Allegiance_3",
  "/wiki/Allegiance_4"
 ]
}