{
 "name": "Chak_(Wookiee)",
 "display_name": "Chak  (Wookiee)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Claatuvac Guild"
     ]
    }
   ]
  }
 ],
 "content": "Chak, born Cha'ka, was a male Wookiee smuggler, whose long life spanned from the last years of the Galactic Republic until the resurgence of the Galactic Empire after the Sith–Imperial War.\nChak was the grandson of Gumbaeki, elder of the village of Palsaang on Kashyyyk, a village targeted by Trandoshan slavers, under the cover of the Battle of Kashyyyk. At this time, the smuggler Vilmarh Grahrk, whom Chak affectionately referred to as \"Uncle Villie\", had been living in the village, smuggling goods to and from the Wookiee homeworld. During the year or so that Grahrk was with them, the young Chak served as co-pilot of Grahrk's ship, the Inferno. He was also an apprentice in the Claatuvac Guild.\nFollowing the issue of Order 66, Chak also helped Grahrk's old friend Quinlan Vos survive assault by his own troopers in the jungles of Kashyyyk. He was responsible for the deaths of Bogey 1212 and Bogey 9662, two members of Bogey Squad.\nLater, Chak was present at the Battle of Kashyyyk, after which he fled Imperial enslavement and hid in the far regions of the galaxy.\nA century and a half later, around 137 ABY, the adult Chak was the captain of the smuggling ship Grinning Liar. He had a reputation as a faithful ally to his friends, who included ex-Jedi Cade Skywalker, but it was a bad move to make an enemy of him.\nLike Cade, he and his co-pilot Kee could often be found in Rik's Cantina on Coruscant. It was here that the two found Cade. It transpired that Cade's former crew members, Jariah Syn and Deliah Blue, had rented the Grinning Liar, but had neglected to return the vessel. Kee and Chak found Cade had no idea where the ship was, though Skywalker promised to let his friends know they were being looked for. Chak was not happy with this response.\nChak later tracked down Blue and Syn. He demanded the Grinning Liar back, but Syn said that Rav had taken it long ago. But as an argument began, an Imperial agent named Morrigan Corde approached them. She revealed to them that she was Cade's mother, and needed their help to get him out of the Sith Temple. Chak accepted the offer. Later, Chak was persuaded to purchase the Mynock to help in the rescue operation . The rescue mission was a success, and Chak piloted the ship away from Coruscant after Cade was on board.\nChak, along with Cade, Syn, and Kee went after Rav to get the Grinning Liar back after the rescue mission. Rav was forced to hand the ship over after his thugs were beaten by Cade and his friends. Chak said he was going to get lost in the galaxy after recovering his ship, advising Cade to do the same.\nChak carried a hunting blaster carbine.\nChak first appeared in the final arc of the Star Wars: Republic comic series, penned by John Ostrander and Jan Duursema and published in 2006. He later reappeared in the fourth arc of Star Wars: Legacy as an associate of Cade Skywalker and his crew.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chak",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Claatuvac_Guild/Legends",
  "/wiki/Vilmarh_Grahrk",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Jariah_Syn",
  "/wiki/Gumbaeki",
  "/wiki/Palsaang",
  "/wiki/Trandoshan/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Battle_of_Kashyyyk/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Inferno_(Vilmarh_Grahrk)",
  "/wiki/Order_66/Legends",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Bogey_1212",
  "/wiki/Bogey_9662",
  "/wiki/Bogey_Squad",
  "/wiki/Battle_of_Kashyyyk_(19_BBY)",
  "/wiki/The_galaxy/Legends",
  "/wiki/137_ABY",
  "/wiki/Grinning_Liar",
  "/wiki/Jedi/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Kee_(Devaronian)",
  "/wiki/Rik%27s_Cantina/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Deliah_Blue",
  "/wiki/Rav",
  "/wiki/Morrigan_Corde",
  "/wiki/Mynock_(Helot-class)",
  "/wiki/Hunting_blaster_carbine",
  "/wiki/Star_Wars:_Republic:_Hidden_Enemy",
  "/wiki/Star_Wars:_Republic",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/2006",
  "/wiki/Star_Wars:_Legacy:_Claws_of_the_Dragon",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Republic_81",
  "/wiki/Republic_82",
  "/wiki/Republic_83",
  "/wiki/Legacy_(2006)_11",
  "/wiki/Legacy_(2006)_14",
  "/wiki/Legacy_(2006)_16",
  "/wiki/Legacy_(2006)_17",
  "/wiki/Legacy_(2006)_18",
  "/wiki/Legacy_(2006)_19",
  "/wiki/Legacy_(2006)_23",
  "/wiki/Legacy_(2006)_0",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_121"
 ]
}