{
 "name": "Chalmun",
 "display_name": "Chalmun",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Beige and gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chalmun's Spaceport Cantina"
     ]
    }
   ]
  }
 ],
 "content": "Chalmun was a male Wookiee and the owner of Chalmun's Spaceport Cantina in Mos Eisley, Tatooine. Originally a street fighter, he swindled tourists on Ord Mantell until he had enough money to buy his cantina from the Vriichon brothers. Despite his desire to enforce certain rules, his establishment was known for its occasional outbreaks of shocking violence, and even Chalmun himself had shady dealings with local gangsters.\nChalmun was a Wookiee, a species of tall, hairy humanoids hailing from the planet Kashyyyk. Originally a street thug, he spent a few years swindling unfortunate tourists in the casinos of Ord Mantell. Eventually, he found his way to the suns-scorched, desert planet Tatooine, which was dominated by the Hutt crime lord Jabba Desilijic Tiure. There, in the city of Mos Eisley, he bought the Vriichon brothers' illegal spice den, located next to the city's \"community\" junk yard and only a stone's throw from the local spaceport. Soon after the sale, the Vriichons vanished, perhaps fearing the Wookiee's reaction upon discovering the many bodies they had buried in the basement.\nChalmun turned the place into a cantina, which it had already been prior to the Vriichons' ownership, during the Clone Wars. He hired several employees, including the daytime bartender Wuher, the nightshift bartender Ackmena, a barman for his private bar named Husklf, several henchmen, a security chief, a personal pilot, and a mechanic to maintain his utility crane ship.\nDuring the pan-galactic conflict between the dictatorial Galactic Empire and the freedom fighters of the Rebel Alliance, Chalmun's establishment served as a rendezvous point and trading floor for the criminal elements of Tatooine, such as smugglers, bounty hunters, renegade spacers, and spice dealers. Despite that, Chalmun enforced anti-violence rules in his cantina, and signs on the walls listed them in several languages. The Wookiee, however, still relished the spectacle of occasional disturbances, and was directly involved in shady business himself, entertaining Hutt-affiliated cronies—and the occasional retired podracing star—in his private bar, leaving the surveillance of the main crowd to his henchmen. Chalmun also knew that Ackmena, \"rented\" the cavernous stone pipeways of the cantina's underground to two regulars, Kabe and the Muftak, but tolerated her side hustle as long as she shared the money with him. He was, however, very insistent that payment be on time, lest he lose patience and decide to throw them out by force.\nFor some time, Chalmun employed the Rodian musician Doda Bodonawieedo to play in the cantina. One day, shortly before the destruction of Alderaan by the Galactic Empire in 0 BBY, he fired the Rodian and hired Figrin D'an and the Modal Nodes to replace him. He ensured his new house band that it was safe for them to play there, and that he would protect them from the bounty hunter Greedo, whom they had discredited in the eyes of Jabba the Hutt. Despite that, he almost immediately left them in Wuher's care and went home.\nLater on the same day he hired the band, Chalmun retired to his office, where Ackmena attempted to negotiate better working hours. Meanwhile, in the main room, a scuffle occurred between a blond young human and the violent Aqualish Ponda Baba. As it turned out, the human was Luke Skywalker, who went on to become a hero of the Rebel Alliance and a mystical Jedi warrior.\nAt some point after the Battle of Yavin, Chalmun reinforced the cantina's security, adding a button the bartender could use to summon an array of automated blasters from the ceiling. At the time, the daytime bartender was a man named Shrem, who feared his employer's reaction should he ever allow a robbery to take place or break a deal with a paying customer. The man, however, ended up doing the latter, but did not suffer Chalmun's wrath, as he fell into a trap sprung by a former partner of his and was hurled in Jabba the Hutt's rancor pit.\nA large Wookiee, Chalmun was covered in a three-layered beige and gray water-shedding coat of hair, notably sporting a gray handlebar mustache. Because of his fur, he had difficulties living in Tatooine's hot climate. Consequently, he was frequently in a foul mood, and wasn't averse to using brute force on those he felt disrespected him. Although his rules for the cantina prohibited violence, he did in fact enjoy the spectacle that occasional outbursts offered. At any rate, Chalmun very much cared about the reputation of his establishement, and expected his employees to follow suit. He also used to smoke spice, using a shisha he kept in his office.\nUnlike many other Wookiees, Chalmun was fully clothed even though the Tatooinian heat made him uncomfortable. He wore a padded gray vest with pockets on either side, a belt with a leather pouch and a holster for carrying a weapon, a pair of trousers, and a dark shirt. In his office, he not only kept assorted blasters, but also bowcasters, the traditional weapon of his people. He also owned a spiked club.\nChalmun was first mentioned in Galaxy Guide 7: Mos Eisley, a 1993 Star Wars Legends sourcebook written by Martin Wixted for Star Wars: The Roleplaying Game. He became canon when he appeared in The Adventures of Luke Skywalker, Jedi Knight, a picture book written by Tony DiTerlizzi and illustrated with concept art by the late Ralph McQuarrie that was released on October 7, 2014.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chalmun",
  "/wiki/Chalmun/Legends",
  "/wiki/Wookiee",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Ickabel_G%27ont",
  "/wiki/File:This_is_Chalmun-FACPOV.ogg",
  "/wiki/Mos_Eisley",
  "/wiki/Tatooine",
  "/wiki/Ord_Mantell",
  "/wiki/Currency",
  "/wiki/Cantina",
  "/wiki/Vriichon_brothers",
  "/wiki/Gangster",
  "/wiki/Species",
  "/wiki/Hair",
  "/wiki/Humanoid",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Kashyyyk",
  "/wiki/Standard_year",
  "/wiki/Con_artist",
  "/wiki/Casino",
  "/wiki/Star",
  "/wiki/Desert",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/City",
  "/wiki/Spice",
  "/wiki/%22Community%22_junk_yard",
  "/wiki/Spaceport",
  "/wiki/Death",
  "/wiki/Burial",
  "/wiki/File:Better_than_Jabbas-FACPOV.ogg",
  "/wiki/Clone_Wars",
  "/wiki/Wuher",
  "/wiki/Ackmena",
  "/wiki/Husklf",
  "/wiki/Chalmun%27s_security_chief",
  "/wiki/Chalmun%27s_personal_pilot",
  "/wiki/Utility_crane_ship",
  "/wiki/The_galaxy",
  "/wiki/Galactic_Civil_War",
  "/wiki/Dictatorship",
  "/wiki/Galactic_Empire",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Merchant",
  "/wiki/Smuggler",
  "/wiki/Bounty_hunter",
  "/wiki/Spacer",
  "/wiki/Spice_dealer",
  "/wiki/Writing",
  "/wiki/Language",
  "/wiki/Podracing",
  "/wiki/Kabe",
  "/wiki/Muftak",
  "/wiki/Rodian",
  "/wiki/Musician",
  "/wiki/Doda_Bodonawieedo",
  "/wiki/Standard_day",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/0_BBY",
  "/wiki/Figrin_D%27an",
  "/wiki/Figrin_D%27an_and_the_Modal_Nodes",
  "/wiki/Greedo",
  "/wiki/Eye",
  "/wiki/Standard_hour",
  "/wiki/Human",
  "/wiki/Aqualish",
  "/wiki/Ponda_Baba",
  "/wiki/Luke_Skywalker",
  "/wiki/Jedi",
  "/wiki/Battle_of_Yavin",
  "/wiki/Blaster",
  "/wiki/Shrem",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Rancor",
  "/wiki/Hologram",
  "/wiki/Water",
  "/wiki/Temperature",
  "/wiki/Shisha",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Leather",
  "/wiki/Holster",
  "/wiki/Bowcaster",
  "/wiki/Club",
  "/wiki/Galaxy_Guide_7:_Mos_Eisley",
  "/wiki/1993",
  "/wiki/Star_Wars_Legends",
  "/wiki/Martin_Wixted",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/The_Adventures_of_Luke_Skywalker,_Jedi_Knight",
  "/wiki/Tony_DiTerlizzi",
  "/wiki/Ralph_McQuarrie",
  "/wiki/October_7",
  "/wiki/2014",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/The_Luckless_Rodian",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Not_for_Nothing",
  "/wiki/We_Don%27t_Serve_Their_Kind_Here",
  "/wiki/The_Kloo_Horn_Cantina_Caper",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Doctor_Aphra_Annual_3",
  "/wiki/Wait_for_It",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Sphere_of_Influence",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_ABY",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Ultimate_Star_Wars"
 ]
}