{
 "name": "Champhra Biahin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Champhra Biahin was a Bothan who was the planet Drall's ambassador to Talus, where he lived in the town of Dearic. He could often be found in the Dearic Medical Center.\nIn 1 ABY Biahin was trying to secure a specimen of the Twin-Scented Natterbloom, a native Talusian herb. The herb was considered a possible cure for an ancient Drall disease, the Balding Sickness. The local Dearic Garden Club kindly helped Biahin in his efforts and located a specimen of the herb in the Talusian wilderness. Biahin paid a spacer 25 credits to meet with the club's representative in the wilderness near Dearic and bring a sample of the Natterbloom to him. As a token of gratitude Biahin asked the spacer to deliver a recording of the anthem Flowers of Drall sung by young students at the Boiling Sea Music Academy on Drall to the Garden Club's chairperson. She paid the spacer 30 credits for his services.\nChamphra Biahin is a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies. He can be found in the Dearic Medial Center on Talus, where she offers two simple quests to players. The first mission is to travel to specified coordinates in the wilderness outside Dearic, meet with an NPC to receive the Natterbloom and report back to Biahin. The second mission is to travel into the wilderness with a datadisc of the anthem and talk to the chairperson before returning to Biahin.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Planet/Legends",
  "/wiki/Drall/Legends",
  "/wiki/Talus/Legends",
  "/wiki/Dearic/Legends",
  "/wiki/Dearic_Medical_Center",
  "/wiki/1_ABY/Legends",
  "/wiki/Twin-Scented_Natterbloom",
  "/wiki/Balding_Sickness",
  "/wiki/Dearic_Garden_Club",
  "/wiki/Spacer/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Flowers_of_Drall",
  "/wiki/Boiling_Sea_Music_Academy",
  "/wiki/Sony",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed:_Prima_Official_Game_Guide"
 ]
}