{
 "name": "Chamberlyn",
 "display_name": "Chamberlyn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal Naboo Security Forces"
     ]
    }
   ]
  }
 ],
 "content": "Chamberlyn was a male Human who served as a lieutenant in the Royal Naboo Security Forces during the Trade Federation's invasion of Naboo. Chamberlyn became a leader in the resistance against the invader, and was responsible for analyzing and discovering weaknesses in the battle droids. Chamberlyn later accompanied Queen Padmé Amidala in an assault on the Theed Royal Palace during Amidala's bid to retake Naboo, helping her capture the Federation's Viceroy Nute Gunray.\nChamberlyn was a Human male, who served in the volunteer Royal Naboo Security Forces on the planet Naboo, and by 32 BBY, had attained the rank of lieutenant. In 32 BBY, Naboo was invaded by the Trade Federation's battle droid army, and Queen Padmé Amidala was forced to escape from Naboo to the galactic capital of Coruscant. After her departure, Chamberlyn became a leader in one of the resistance cells that fought against the invaders. When Amidala returned to Naboo with the intention to retake it, the leader of the RNSF, Captain Quarsh Panaka rallied together all the resistance fighters for an assault on the capital city of Theed, in which Amidala hoped to capture the Federation's Viceroy Nute Gunray and end the Federation's occupation of the planet. Chamberlyn then joined the Queen in an attack on the Theed Royal Palace.\nAs Chamberlyn and a number of other Royal Guards, led by Amidala and Panaka, moved through the palace, they were confronted by a detachment of battle droids. In an attempt to circumvent the droids, Panaka destroyed a nearby window with his blaster; he, the Queen, Chamberlyn and several other RNSF members then climbed outside onto the windowsill and used their ascension guns to reach an upper level of the Palace. As they moved in through a corridor, however, the group was surrounded by a number of battle droids, and Amidala ordered her men to lay down their weapons. Chamberlyn and the others were taken to the Palace's throne room to, where Gunray tried to force the Queen into signing the treaty that authorized the Federation's occupation of Naboo. At that point, however, one of Amidala's handmaidens, Sabé, disguised as the Queen and leading a number of guards, appeared in a corridor leading to the throne room. Exclaiming that Gunray's occupation had ended, Sabé and her men attacked Gunray's battle droids, and the Viceroy, thinking Sabé to be the real Queen, sent most of his forces after her.\nThe distraction allowed Amidala to open a secret compartment inside her throne and take out a pair of hidden blasters from there, which she and Panaka used to deal with the rest of the droids. Chamberlyn and the other guards present at the scene then sealed the door to the throne room, rearmed themselves with the fallen battle droids' blasters, and took Gunray and his aide Rune Haako under guard. Meanwhile, the Federation's droid control ship was destroyed during a concurrent space battle by the young Force-sensitive Anakin Skywalker, deactivating all battle droids on the planet, and liberating Naboo.\nAs a resistance leader, Chamberlyn was known for discovering and analyzing battle droids' weaknesses. During the attack on the Theed Palace, he was armed with a S-5 heavy blaster pistol.\nChamberlyn first appeared as an unnamed background extra in George Lucas' 1999 film Star Wars: Episode I The Phantom Menace, portrayed by an uncredited actor. The character received his name in the 2001 Theed Palace Limited expansion of the Star Wars Customizable Card Game by Decipher, Inc. In 2008, Lieutenant Chamberlyn received an entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Naboo_Resistance",
  "/wiki/Battle_droid/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Theed_Royal_Palace/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/Planet/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Trade_Federation_Droid_Army/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Quarsh_Panaka/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/City/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Viceroy/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Ascension_gun/Legends",
  "/wiki/Handmaiden/Legends",
  "/wiki/Sab%C3%A9/Legends",
  "/wiki/Rune_Haako/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/S-5_heavy_blaster_pistol",
  "/wiki/George_Lucas",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/2001",
  "/wiki/Theed_Palace_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Decipher,_Inc.",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology"
 ]
}