{
 "name": "Cham_Teleus",
 "display_name": "Cham Teleus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tynna"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tynnan"
     ]
    }
   ]
  }
 ],
 "content": "Cham Teleus was a Tynnan industrialist who made a fortune on Tynna along with Nog Teleus. Together, the pair decided to relocate to the Cularin system. Out of gratitude for their new home, they chose to organize a number of events to mark the 125th anniversary of the signing of the Cularin Compact. These included festivals, swoop races, other competitions and an art display of native Tarasin and other local artwork, including a number from their private collection. A number of items were stolen by Gomalo, a Rodian slaver recently released from prison, including a sculpture he had created earlier. It contained the locations of a nebula in which he had stowed the body of a Jedi Knight frozen in carbonite.\nThe Tynnans sought help from the Office of Public Safety, who assigned Ezra Du'Re to recover the sculpture. The artwork was eventually recovered by Du'Re, with the aid of some heroes from Cularin. Out of gratitude, the Tynnans gave generous rewards to the heroes. The pair later sponsored the inaugural Cularin Classic swoop race.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Teleus",
  "/wiki/Tynna/Legends",
  "/wiki/Tynnan/Legends",
  "/wiki/Nog_Teleus",
  "/wiki/Cularin_system",
  "/wiki/Cularin_Compact",
  "/wiki/Swoop/Legends",
  "/wiki/Tarasin",
  "/wiki/Gomalo",
  "/wiki/Rodian/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Nebula/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Cularin_Office_of_Public_Safety",
  "/wiki/Ezra_Du%27Re",
  "/wiki/Cularin/Legends",
  "/wiki/Cularin_Classic",
  "/wiki/Portrait_of_the_Artist_as_a_Young_Rodian",
  "/wiki/Cloak_and_Vibroblade"
 ]
}