{
 "name": "Chanath Cha",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chas",
      "Galactic Empire",
      "Orphans",
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "Chanath Cha was a human female bounty hunter who operated during the Galactic Civil War.\nDuring the reign of the Galactic Empire, Chanath Cha, together with her mother Ramat and father Bhada had been paid to kill Darth Vader on Cabarria. Tricking Vader that a Jedi had been seen in a bar, the Chas sat ready to kill him when he entered. Using ion grenades, they neutralized all the weapons in the bar while Chanath tried to seize Vader's lightsaber with a tractor rifle. However, he used the Force to seize the lightsaber midair and, under the strain of the two opposing forces, the hilt shattered, leaving only the red kyber crystal. Realizing they stood no match against the Sith Lord they activated their shields and fled the bar.\nAll three got on a speeder bike and proceeded to escape. Vader followed them on his own speeder, and when they tried to blast them, he easily deflected their bolts. They proved to be capable to keep away from him for a time until he crashed a massive vehicle in their path, causing their speeder to crash. Seizing Chanath in a Force choke, he requested they tell him who had ordered his death. They told him about an anonymous bounty with an exhorbitant price posted on the Hunter Net. Ramat, a talented slicer, offered to uncover their employer for him in exchange for their daughter's life. When they demanded that he release Chanath first, Vader refused and threatened to kill them all. However, the Chas countered that even in death they would be together, so he could not threaten them with such tactics. Grudgingly impressed, the Dark Lord demanded proof that Ramat could deliver her side of the deal, which she proved by tracking the signal of the bounty back to Coruscant. Chanath was released as agreed, at which point the bounty hunters made their daughter swear that she would seek no vengeance against the Dark Lord, a deal Vader chose to honor. To complete the deal, Ramat provided Vader with the information he had requested and gave him the source of the bounty on him: the highest levels of the Republic Executive Building on Coruscant. Vader then killed Chanath's parents, which she claimed resulted in her heart dying. Despite the fact she had sworn to not seek vengeance against Vader, she saw her heart dying as her oath ending, and began to hunt Vader in revenge. She became a pet operative of Galactic Emperor Sheev Palpatine in the hopes that it would get her close to Vader, but she never saw him again.\nAt some point, she had a past romantic history with Lobot with some tension between them due to Lobot's decision to work with Lando Calrissian.\nShortly after Doctor Chelli Lona Aphra was captured by the Rebel Alliance on Vrogas Vas, Cha and several bounty hunters caught wind of a sizeable bounty that was to return Aphra to a client who had shielded their identity from the hunters. Unbeknownst to Cha, she had actually been hired by Vader, the same person she hunted in revenge for her parents death.\nSometime later, Cha was hired by an enemy of the crime boss Big String—who resided in a volcanic fortress on the Inner Rim world Amethia Prime—to destroy his fortress and apprehend String. Soon, Cha traveled to the ocean world and invaded the fortress, flying through its structure and destroying it using near-indestructible armor and rocket boots, until the entire complex went up in an explosive fireball. Then Cha focused on Big String, who was fleeing in a boat with three of his bodyguards.\nCha dove underwater and raced towards the craft, launching upward through it, destroying its engine and overturning it; quickly ending String's escape. Cha confronted String, who pleaded to know why Cha had destroyed the \"empire\" he had spent twenty cycles creating. After providing a name, Cha told the criminal that it was a contracted job. Cha then engaged the guards in hand-to-hand combat, quickly defeating them. Cha convinced String to drop his blaster, allowing Cha to hoist him up by his belt and took to the air using rocket boots to deliver the bounty.\nHowever, once at cloud-level, Cha received a holographic comlink call from Palpatine. Cha apologized to String and dropped him; not wanting to ignore the call from this most important client. Palpatine appeared from the holoprojector and informed Cha that his yacht, the Imperialis, had been stolen from an Imperial shipyard in the Castell system, and he wanted Cha to recover it, because Palpatine had little faith in the military forces he had assigned to the task, stating that he needed a needle, and that Cha was the sharpest needle he had. The Emperor gave Cha a unique starship to aid in recovering the Imperialis, and told the bounty hunter that success would mean great reward—but if the yacht could not be recovered, Cha needed to destroy it, in order for the \"personal items\" it contained to not fall into the hands of others.\nCha immediately traveled to Imperial Facility 729-D, a classified Imperial space station that housed the vessel Palpatine promised Cha use of during the mission. She examined the exterior of the ship, noting it appeared unique in design. O-66, a droid sent by Palpatine to assist Cha, appeared and explained that the ship, the Scimitar, had been in use for an extended period of time by \"special\" owners. O-66 informed Cha that the technical readouts for the Scimitar were available, Cha, however, ordered O-66 to paraphrase the instructions. Once O-66 had done so, Cha removed O-66's head for protection; O-66 could no longer hold a weapon to attack Cha if that was the droid's programming. Cha then piloted the Star Courier into space, where O-66 explained that the Scimitar was configured to track the Imperialis's hyperdrive signature through space; a feat that Cha had believed impossible. However, the Imperialis's signature was very similar to that of a neutron star—which if the Scimitar tracked instead, would kill Cha when it emerged from hyperspace. Cha was unworried and entered hyperspace.\nA short time later, the Scimitar emerged from hyperspace near the Imperialis in deep space. Cha spacewalked to the Emperor's yacht, and with O-66's help, located an airlock, sliced into it and rushed through the Imperialis to locate the hijackers. Cha needed the ship's operation system codes from O-66 in order to lock the escape codes, thereby preventing the hijackers from escaping. O-66 refused, but relented after Cha revealed that she had planted a pulse bomb in the droid's neck. Cha disabled the hijackers' only escape option, and soon stumbled across one of the thieves: the Ugnaught Korin Pers. Pers claimed she was alone in stealing the Imperialis, but Cha knew better than to believe her, and was proved correct when one of Per's partners appeared and tried to jump Cha. Cha, however, easily outmaneuvered the thief and was shocked to recognize the thief as her old friend Calrissian. Cha removed her helmet, allowing Calrissian to likewise recognize her. Calrissian was equally shocked and greeted her with a kiss to the hand.\nCha decided to activate the ship's self-destruct to complete her mission, but hesitated when Lando said that Lobot was aboard in a bacta tank, recovering from a wound sustained in a fight with Imperial Guards. However soon two clone aliens, Aleksin and Pavol, who had helped Lando steal the ship, attacked them, having been corrupted by the Emperor's Sith artifacts stored on the ship. Cha sealed a door to slow them down and activated the ship's self-destruct, telling Lando to get Lobot so they could escape with her. She contacted O-66 and told him to pick them up in the Scimitar, but O-66 refused, having deactivated the explosive planted by her. Pavol then attacked her, but she killed him. With no other way to escape, Lobot used his implants to slice the ship's systems and reactivate the escape pods. Unfortunately, due to the wounds he sustained and incomplete healing, Lobot's implants were able to take over his mind. Cha bid farewell to Lando and Lobot and took an escape pod before the ship exploded.\nBy 4 ABY, Cha joined up with the crime boss Qi'ra as part of her mission of revenge against Vader.\nChanath Cha was a female human bounty hunter with brown skin, black hair, and dark eyes. She often wore a helmet with a T-shaped visor and armor. Cha was a renowned bounty hunter who was contracted to undertake dangerous and sensitive missions by some of the most powerful figures in the galaxy including Emperor Palpatine. Cha had little patience for the droid O-66's tedious nature and once decapitated him. She disliked long-winded explanations. Cha also did not believe in win or lose situations but qualified them as success versus failure.\nCha respected Lando well enough to spare his life and cover up his involvement in stealing the Emperor's yacht Imperialis. In order to protect him and Lobot, she decided to destroy the ship, per the Emperor's orders. Cha was unwilling to risk trouble with the Empire, particularly Darth Vader, the Emperor's enforcer. Cha also once harbored romantic feelings for Lobot but parted company after he became close with Lando. While Cha was good at coercion, she once mistakenly revealed that she had planted a pulse bomb on O-66. The cunning O-66 outplayed her by removing the bomb and later taunted Chanath for not keeping it a secret.\nChanath was a skilled warrior who wore repulsor boots. She was skilled in unarmed combat and also wielded a blaster. Cha's armor and repulsor boots could also operate underwater. On one occasion, Cha defeated the lightsaber-wielding Pavol with a knife.\nChanath Cha first appeared in the 2015 Marvel Comics series Star Wars: Lando. She was created by Charles Soule, drawn by Alex Maleev, and colored by Paul Mounts.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Crimson_Reign_1",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Crimson_Reign_5",
  "/wiki/The_Marvel_Art_of_Star_Wars",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chas",
  "/wiki/Galactic_Empire",
  "/wiki/Orphans",
  "/wiki/Crimson_Dawn",
  "/wiki/Bounty_hunter",
  "/wiki/Galactic_Civil_War",
  "/wiki/Imperial_Era",
  "/wiki/Parent",
  "/wiki/Ramat_Cha",
  "/wiki/Bhada_Cha",
  "/wiki/Assassination_attempts_on_Darth_Vader",
  "/wiki/Death",
  "/wiki/Darth",
  "/wiki/Anakin_Skywalker",
  "/wiki/Cabarria",
  "/wiki/Jedi",
  "/wiki/Unidentified_bar_(Cabarria)",
  "/wiki/Ion_grenade",
  "/wiki/Cantina",
  "/wiki/Kirak_Infil%27a%27s_lightsaber",
  "/wiki/Tractor_rifle",
  "/wiki/Force_power",
  "/wiki/The_Force",
  "/wiki/Lightsaber",
  "/wiki/Kyber_crystal",
  "/wiki/Sith_Lord",
  "/wiki/Personal_energy_shield",
  "/wiki/Speeder_bike",
  "/wiki/Speeder",
  "/wiki/Time",
  "/wiki/Force_choke",
  "/wiki/Bounty",
  "/wiki/Hunter_Net",
  "/wiki/Slicer",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Coruscant",
  "/wiki/Imperial_Executive_Building",
  "/wiki/Heart",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Lobot",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Battle_of_Vrogas_Vas",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Vrogas_Vas",
  "/wiki/Crime_lord",
  "/wiki/Big_String",
  "/wiki/Volcano",
  "/wiki/Big_String%27s_fortress",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Amethia_Prime",
  "/wiki/Fortress",
  "/wiki/Ocean",
  "/wiki/Armor",
  "/wiki/Rocket_boot",
  "/wiki/Fire",
  "/wiki/Boat",
  "/wiki/Bodyguard",
  "/wiki/Water",
  "/wiki/Engine",
  "/wiki/Standard_year",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Blaster",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Hologram",
  "/wiki/Comlink",
  "/wiki/Holoprojector",
  "/wiki/Yacht",
  "/wiki/Imperialis",
  "/wiki/Theft_of_the_Imperialis",
  "/wiki/Orbital_Shipyard_CC-24",
  "/wiki/Castell_system",
  "/wiki/Imperial_Military",
  "/wiki/Starship",
  "/wiki/Imperial_Facility_729-D",
  "/wiki/Space_station",
  "/wiki/O-66",
  "/wiki/Droid",
  "/wiki/Scimitar",
  "/wiki/Pilot",
  "/wiki/Star_Courier",
  "/wiki/Realspace",
  "/wiki/Hyperdrive",
  "/wiki/Star",
  "/wiki/Hyperspace",
  "/wiki/Airlock",
  "/wiki/Escape_pod",
  "/wiki/Pulse_bomb",
  "/wiki/Thief",
  "/wiki/Ugnaught",
  "/wiki/Korin_Pers",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Bacta_tank",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Cloning",
  "/wiki/Alien",
  "/wiki/Aleksin",
  "/wiki/Pavol",
  "/wiki/Sith_artifact",
  "/wiki/4_ABY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Qi%27ra",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/The_galaxy",
  "/wiki/Repulsorlift",
  "/wiki/Knife",
  "/wiki/2015",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_Lando_(comic_series)",
  "/wiki/Charles_Soule",
  "/wiki/Alex_Maleev",
  "/wiki/Paul_Mounts",
  "/wiki/Darth_Vader_(2017)_11",
  "/wiki/Darth_Vader_(2017)_12",
  "/wiki/Darth_Vader_(2015)_16",
  "/wiki/Lando_2",
  "/wiki/Lando_3",
  "/wiki/Lando_4",
  "/wiki/Lando_5",
  "/wiki/Hidden_Empire_3",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_63",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com"
 ]
}