{
 "name": "Chanceller",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "28 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Committee of Seven for Garosian Unification"
     ]
    }
   ]
  }
 ],
 "content": "Chanceller or Chance was a Human male lieutenant who served the Galactic Empire during the height of the Galactic Civil War. His horror of the war eventually caused him to defect from his line of duty.\nChanceller was a Human male born on the planet Corellia in 28 BBY. He began serving with the Imperial Navy in 8 BBY, assigned to the Imperial-class Star Destroyer Judicator. Two years later, in 6 BBY, the Judicator was part of the Imperial force that attacked the settlement of Sreina on Janara III. Officially, the assault was to uncover rebels living in Sreina, but Chanceller soon learned that there were not rebels present, and the Imperial forces had destroyed an innocent settlement. While touring the ruins of the city, Chanceller came upon a young girl in the rubble of a destroyed house. Barely conscious, Chanceller rescued her and took her aboard the Judicator. The child survived, but refused to speak, and Chanceller remained with her, appointing himself her unofficial guardian. One of the Judicator's officers, Senior Lieutenant Brandei, suggested fostering the girl with friends of his on Garos IV, the Wingers. The captain of the Judicator agreed, and sent Brandei and Chancellor on ahead with the girl.\nOn Garos IV, Chanceller stayed with the child in the medical center in Ariana until her new foster mother, Sali Winger, arrived. She thanked Chanceller for saving the child, and during their conversation Chanceller revealed that Imperial forces had been responsible for the destruction of her home, not Rebels as officially stated. Placing the young girl's hand in Sali's, Chanceller left the room. Several days later, he deserted from the Navy, unable to serve the institution that had killed thousands of innocents.\nDuring his stay on Garos IV, Chanceller fell in with the underground resistance. He was caught in the middle of raid made by the resistance on an Imperial supply convoy. He assisted the underground fighters, and joined them. Chanceller's expertise with weapons and demolitions made him a valuable asset.\nIn 6 ABY, Chanceller was part of an underground operation to stop shipments of hibridium ore in transit from the Imperial mining center complex to the spaceport. During the mission, Winger was compromised as a member of the underground by her classmate, and son of Major General Carner, Lej Carner. Chanceller killed Carner to save Winger from exposure and hid the body.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chancellor_(disambiguation)",
  "/wiki/Chance",
  "/wiki/Corellia/Legends",
  "/wiki/28_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Committee_of_Seven_for_Garosian_Unification",
  "/wiki/Lieutenant/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Defection",
  "/wiki/Planet/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/8_BBY",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Judicator/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/6_BBY/Legends",
  "/wiki/Raid_on_Janara_III",
  "/wiki/Sreina",
  "/wiki/Janara_III",
  "/wiki/Alexandra_Winger",
  "/wiki/Senior_Lieutenant/Legends",
  "/wiki/Garos_IV",
  "/wiki/Captain/Legends",
  "/wiki/Ariana",
  "/wiki/Sali_Winger",
  "/wiki/6_ABY/Legends",
  "/wiki/Hibridium/Legends",
  "/wiki/Ore/Legends",
  "/wiki/Mining_center_complex",
  "/wiki/Spaceport/Legends",
  "/wiki/Major_General/Legends",
  "/wiki/Carner",
  "/wiki/Lej_Carner",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Turning_Point_(Charlene_Newcomb)",
  "/wiki/Star_Wars_Adventure_Journal_5",
  "/wiki/A_Glimmer_of_Hope",
  "/wiki/Star_Wars_Adventure_Journal_1",
  "/wiki/West_End_Games",
  "/wiki/The_Best_of_the_Star_Wars_Adventure_Journal,_Issues_1-4",
  "/wiki/Mission_to_Zila",
  "/wiki/Star_Wars_Adventure_Journal_3",
  "/wiki/Shadows_of_Darkness",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/8_ABY/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com"
 ]
}