{
 "name": "Charal's stallion",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Horse"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Owner(s)",
     "values": [
      "Charal"
     ]
    }
   ]
  }
 ],
 "content": "A black stallion was kept as a steed by Sister Charal, a castaway Nightsister of Dathomir who was stranded on the Sanctuary Moon of Endor. The witch used her horse to travel through Endor's thick redwood forests and wide savannas. Through the powers of the Dathomir Magic, Charal could turn her wild stallion into a beautiful white horse.\nThat male horse belonged to Charal, a Force-wielding Nightsister from the planet Dathomir who had become the self-anointed Witch-Queen of the Sanctuary Moon of Endor after being stranded there around 96 BBY. Unlike most of her sisters, Charal had chosen to ride a horse rather than a rancor. Thanks to the arcane magicks of its witch mistress, the stallion was able to change its appearance.\nSeveral months before the destruction of the second Death Star, Charal intended to capture the young Human Cindel Towani, hoping to force her release \"the Power\" contained in a starship's crystal oscillator. The sorceress thus transformed herself into a beautiful, young woman with blond hair, and gave her wild stallion the shape of a gracious white horse. Charal replicated the voice of Catarine Towani, the young girl's mother, in order to lure the child into her trap. Once Towani was in her clutches, the witch hopped on her horse's back and went galloping off into the forest.\nDespite its equine loyalty, Charal's stallion unwittingly betrayed its mistress. It was the hoofprints of the horse that led Noa Briqualon, Wicket Wystri Warrick and Teek to the Marauders' Stronghold, where Towani had been imprisoned.\nCharal's stallion was a large, dark horse with a reddish-brown coat and a black mane.\nCharal's stallion first appeared in the 1985 made-for-TV film Ewoks: The Battle for Endor. According to the movie credits, the horses that appeared in The Battle for Endor were provided by Sharon Lewis, who also acted as a stunt rider. Despite the animal's visibly brownish appearance, it is still considered a black horse. There are in fact two types of black horses: \"fading\" and \"non-fading.\" Most black horses are of the fading variety, and their coat tends to turn a reddish brown color with exposure to sweat and sun.\nIn the 2001 reference book The Wildlife of Star Wars: A Field Guide, it was stated that some Nightsisters favored horses over rancors, and that both the rider and her steed were capable of shape-changing.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Horse/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Charal",
  "/wiki/Sister_(Witches_of_Dathomir)",
  "/wiki/Nightsisters/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Witch/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Dathomir_Magic",
  "/wiki/Metamorphosis_(Force_power)",
  "/wiki/The_Force/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Witch-Queen",
  "/wiki/Endor_(planet)/Legends",
  "/wiki/96_BBY",
  "/wiki/Rancor/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cindel_Towani",
  "/wiki/Starship/Legends",
  "/wiki/Crystal_oscillator",
  "/wiki/Hair/Legends",
  "/wiki/Catarine_Towani",
  "/wiki/Parent/Legends",
  "/wiki/Noa_Briqualon",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Teek",
  "/wiki/Terak%27s_Keep",
  "/wiki/1985",
  "/wiki/Ewoks:_The_Battle_for_Endor",
  "/wiki/2001",
  "/wiki/The_Wildlife_of_Star_Wars:_A_Field_Guide",
  "/wiki/Ewoks:_The_Battle_for_Endor_(book-and-record)",
  "/wiki/The_Ring,_the_Witch,_and_the_Crystal:_An_Ewok_Adventure",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}