{
 "name": "Charky",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Charky was a male Trandoshan child who was orphaned during the Clone Wars.\nCharky was a male Trandoshan and one of ten young orphans abducted from the planet Abregado-rae during the Clone Wars. He spoke in short sentences. The Twi'lek woman Kuvuta Pindi took the younglings to supply the pirate Dool Pundar with slaves. During a stopover on Fondor, Pindi, posing as the orphan's blind minder, fooled the Jedi Nuru Kungurama and swoop biker Gizz into taking them to the rendezvous point of Foless. Onboard the Nu-class shuttle, Charky and the other younglings were restless, and Gizz stuffed Charky into an storage locker, telling the other younglings that it was an airlock. Once on Foless, the Jedi and the orphans parted ways, but Gizz realized that Pindi was faking her affliction and gave chase. Charky noticed the swoop biker was following them. Kungurama forced the airbus to crash. Pindi then grabbed Charky as a hostage, but the Trandoshan bit her arm, forcing her to drop the knife and flee. She was later killed, and Charky and his fellow orphans found homes with new families.\nCharky appears in 2011's The Clone Wars: Strange Allies, a comic tie-in to the Star Wars: The Clone Wars: Secret Missions young readers series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Abregado-rae/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Kuvuta_Pindi",
  "/wiki/Pirate/Legends",
  "/wiki/Dool_Pundar",
  "/wiki/Slavery/Legends",
  "/wiki/Fondor/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Nuru_Kungurama",
  "/wiki/Swoop/Legends",
  "/wiki/Gizman",
  "/wiki/Foless/Legends",
  "/wiki/Nu-class_attack_shuttle",
  "/wiki/Airlock/Legends",
  "/wiki/Airbus/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Death/Legends",
  "/wiki/2011",
  "/wiki/The_Clone_Wars:_Strange_Allies",
  "/wiki/Star_Wars:_The_Clone_Wars:_Secret_Missions"
 ]
}