{
 "name": "Charza_Kwinn",
 "display_name": "Charza Kwinn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pria"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Before 129 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Priapulin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "4 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Charza Kwinn was a legendary male Priapulin pilot who was in the employ of the Jedi Order for well over a century.\nA male Priapulin, Charza Kwinn was a starship pilot. By 129 BBY, he had become an ally of the Jedi Order, and was known to have transported needy Jedi to various planets and other locations in need of their services. In 30 BBY, Kwinn transported the rogue Jedi Knight Vergere aboard his YT-1150 named the Star Sea Flower to the living planet Zonama Sekot; Kwinn left the world once ordered to, having received no orders to return for Vergere. He did note six ships in orbit as he left, and assumed them to be Sekotan Personal Starships. A year later, Kwinn transported two more Jedi, Jedi Master Obi-Wan Kenobi and his Padawan, Anakin Skywalker, to Zonama Sekot. After dropping them off near the planet's north pole, he stayed in orbit and out of contact with the pair of Jedi. Soon, however, the planet was attacked by Wilhuff Tarkin, Commander of the Republic Outland Regions Security Force, who wanted the planet's abilities for the Galactic Republic. Kwinn participated in the battle, defending Zenoma Sekot and taking on a Corellian Engineering Corporation light cruiser.\nIn 19 BBY, following the establishment of High Human Culture under the Galactic Empire, Kwinn was forced to become a pirate and smuggler to support himself and his food-kin, which he ate as well as provided for. Flying the ship the Coral Fin, he limited his prey to Imperial vessels.\nHis legacy inspired his people to assist the persecuted New Jedi Order during the Yuuzhan Vong War.\nKwinn was regarded as highly intelligent by the Jedi he transported, as well as having a sense of humor not easily understood by humans. He was a pacifist by nature, but that didn't stop him from enjoying aggressive competition among other species, finding it amusing. He had a symbiotic relationship with the Crast, whom he referred to as food-kin. His kind used the species as food, and in return incubated and cared for their young. In addition to the normal Priapulin relationship with Crast, he also provided food and a place to live for his food-kin on the Star Sea Flower, in return for them being the ship's crew.\nHe was also a pilot of exceptional skill, having the ability to even outfly Sky mines, in addition to Droid Starfighters. He attributed part of his flying prowess to the Sea Star Flower, whom he called his friend.\nKwinn was introduced in the novel Rogue Planet by Greg Bear. He was subsequently mentioned in several reference books. Under the \"Coral Fin\" entry in The Complete Star Wars Encyclopedia, he is incorrectly described as a Jedi Knight.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Pria/Legends",
  "/wiki/129_BBY",
  "/wiki/Priapulin",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/30_BBY/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Vergere",
  "/wiki/YT-1150",
  "/wiki/Star_Sea_Flower",
  "/wiki/Zonama_Sekot/Legends",
  "/wiki/Sekotan_Personal_Starship",
  "/wiki/29_BBY/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Republic_Outland_Regions_Security_Force",
  "/wiki/Second_Battle_of_Zonama_Sekot",
  "/wiki/Corellian_Engineering_Corporation/Legends",
  "/wiki/Light_Cruiser",
  "/wiki/19_BBY/Legends",
  "/wiki/High_Human_Culture",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Food-kin",
  "/wiki/Coral_Fin",
  "/wiki/New_Jedi_Order",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Crast",
  "/wiki/Sky_mine",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Rogue_Planet",
  "/wiki/Greg_Bear",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Priapulin",
  "/wiki/Star_Wars_Gamer_8",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Thracia_Cho_Leem"
 ]
}