{
 "name": "Chassellon Stevis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Born",
     "values": [
      "After c. 19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Apprentice Legislature",
      "Apprentice Legislature"
     ]
    }
   ]
  }
 ],
 "content": "Chassellon Stevis was a human male from the planet Coruscant and whose mother was head of the Coruscant diplomatic legation. In 3 BBY, Stevis was a part of the Apprentice Legislature and was in the same pathfinding class as Leia Organa. During the first pathfinding class Stevis' fellow Apprentice Legislator Harp Allor hurt her ankle and Stevis decided to leave her behind so that he wouldn't get kicked out of the class.\nHowever when Stevis returned to the pathfinding chalet he saw that Harp was already there drinking mocoa with Organa and the other students who stayed behind to help her. Stevis was then reprimanded by by Chief Pangie for abandoning Harp.\nStevis continued to serve alongside Organa in the Apprentice Legislature, including a visit to the Emperor's Museum, and agreed to remain silent when he saw Organa suspiciously trying to gain passage off Coruscant on the ship Mighty Oak Apocalypse which previously Stevis had been attempting to hire to take him to a speeder auction on Arkanis. Stevis later attended the ceremony which saw Organa officially invested as crown princess of Alderaan and winked at her as she passed. Also in attendance was another Apprentice Legislator Amilyn Holdo of Gatalenta.\nHe was rather arrogant, which Organa and her father noted was a common Coruscanti trait. He also had an interest in buying and refurbishing antique speeders which caused Organa to realise that he had more patiences than she realised.\nChassellon Stevis first appeared in Leia, Princess of Alderaan, a 2017 young adult novel written by Claudia Gray that was released as part of Journey to Star Wars: The Last Jedi. While Stevis is described as dark-skinned in the novel, the colored pages of the manga adaptation show him as clearly light-skinned, while the black and white pages show him as light dark-skinned.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Coruscant",
  "/wiki/19_BBY",
  "/wiki/Human",
  "/wiki/Coruscanti",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Apprentice_Legislature",
  "/wiki/Planet",
  "/wiki/Coruscant_diplomatic_legation",
  "/wiki/3_BBY",
  "/wiki/Pathfinding",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Apprentice_Legislator",
  "/wiki/Harp_Allor",
  "/wiki/Pathfinding_class_chalet",
  "/wiki/Mocoa",
  "/wiki/Chief",
  "/wiki/Pangie",
  "/wiki/Emperor%27s_Museum",
  "/wiki/Mighty_Oak_Apocalypse",
  "/wiki/Speeder",
  "/wiki/Arkanis",
  "/wiki/Crown",
  "/wiki/Alderaan",
  "/wiki/Amilyn_Holdo",
  "/wiki/Gatalenta",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Chassellon_Stevis",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/2017",
  "/wiki/Claudia_Gray",
  "/wiki/Journey_to_Star_Wars:_The_Last_Jedi",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Leia,_Princess_of_Alderaan_(audiobook)",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Reproduction",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Birthday"
 ]
}