{
 "name": "Chatter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 22 BBY and 21 BBY",
      "Belgaroth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "182nd Legion",
      "182nd Legion"
     ]
    }
   ]
  }
 ],
 "content": "\"Chatter\" was the nickname of a clone trooper with the Grand Army of the Republic's 182nd Legion. During the early years of the Clone Wars, he participated in a reconnaissance mission to the planet Belgaroth, along with fellow troopers Recon, Knuckles, and Sergeant Marrt. The clones were dispatched to the planet in order to investigate claims that the local Republic Czerka factory was secretly trading with the Confederacy of Independent Systems. During the course of the mission, Chatter, Recon, and Knuckles were all killed by a droidbreaker—a creature indigenous to Belgaroth—leaving Marrt to complete the mission alone, which he successfully did.\n\"Chatter\" was the nickname of one of the many clones of the Mandalorian bounty hunter Jango Fett bred on the planet Kamino to serve in the Grand Army of the Republic. During the Clone Wars, Chatter served with the 182nd Legion, a unit of the Grand Army, and earned his nickname for his talkative personality and love of code-breaking. At some point during the first two years of the conflict, Chatter and three other clone troopers—Knuckles, Recon, and Sergeant Marrt—were dispatched to the planet Belgaroth on a scouting mission. The clones were to investigate claims that a local Republic weapons factory run by the Czerka corporation was clandestinely selling arms to the Republic's enemy, the Confederacy of Independent Systems.\nAfter the clones landed on the planet with a dropship and made their way to the factory, Sergeant Marrt went inside to investigate, while the rest of the squad remained in hiding. Marrt discovered that the man in charge of the facility, Tarin, was meeting with Reep Tonith, a representative of the InterGalactic Banking Clan, which was allied with the Confederacy. The two were discussing a shipment of illegal FEX-M3 nerve gas grenades to the Confederacy. Marrt took one of the grenades as evidence and tried to return to his squad undetected, but he was spotted, and Tonith's battle droids opened fire, forcing all four clone troopers to fall back to a swamp. Chatter attempted to contact Republic headquarters but was unable to do so, because the fog that stood over the swamp was interfering with the clones' equipment.\nAt that point, the clones heard a strange screech, which Knuckles mistook for the sound of approaching battle droids. Recon corrected him, saying that the sound was emitted by something big, but he was then suddenly attacked by a native droidbreaker creature. The droidbreaker hit Recon, throwing him into a tree, and the trooper died upon impact. Witnessing the creature chewing on Recon's blaster, Chatter frantically started firing his own weapon. He was unable to hit anything because of the fog, and Marrt ordered him to cease fire. Realizing that they were standing in the creature's natural habitat, the clone troopers understood that they had to leave the swamp as quickly as possible. Before they could so, however, the droidbreaker attacked again, catching Chatter off-guard and killing him. Moments later, Knuckles met his end as well, but Marrt was able to kill the creature by using the confiscated nerve grenade. After burying his fallen squadmates under the creature's severed head, Marrt proceeded to attack the Czerka factory alone. He burned the facility, retrieved valuable data, and took Tarin into custody, although Reep Tonith escaped.\nThe trooper's tendency to talk a lot and his love of code-breaking earned him the nickname \"Chatter.\" During the mission to Belgaroth, Chatter was talkative as always and was cracking jokes while on the way to the Czerka factory, much to Knuckles' amusement. After Recon's death, however, there was no trace of Chatter's joyful nature as he fell into a frenzy and opened fire at the droidbreaker. As a clone of Jango Fett, Chatter had the same height of 1.83 meters as his genetic template.\nChatter's only appearance to date was in A Trooper's Tale, a short comic strip published in Star Wars: The Clone Wars Comic UK 6.8 in May of 2010. A Trooper's Tale was written by Robin Etherington and illustrated by Andres Ponce.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Clone_trooper/Legends",
  "/wiki/182nd_Legion",
  "/wiki/Chatter_(radio_communications_clone)",
  "/wiki/Cloning/Legends",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Belgaroth",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Mission_to_Belgaroth",
  "/wiki/Planet/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Recon",
  "/wiki/Knuckles_(182nd_Legion)",
  "/wiki/Clone_trooper_sergeant",
  "/wiki/Marrt",
  "/wiki/Czerka_factory",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Death/Legends",
  "/wiki/Droidbreaker",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Dropship/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Tarin_(Human)",
  "/wiki/Reep_Tonith",
  "/wiki/InterGalactic_Banking_Clan/Legends",
  "/wiki/FEX-M3_nerve_gas_grenade",
  "/wiki/Grenade/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/A_Trooper%27s_Tale",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.8",
  "/wiki/May",
  "/wiki/2010",
  "/wiki/Robin_Etherington",
  "/wiki/Andres_Ponce",
  "/wiki/Databank_(original)",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Time/Legends",
  "/wiki/ARC_Troopers",
  "/wiki/Pursuit_of_Peace",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_62",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_7",
  "/wiki/The_New_Essential_Chronology"
 ]
}