{
 "name": "Chates",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "White Worms"
     ]
    }
   ]
  }
 ],
 "content": "Chates was a human male who became a scrumrat in the White Worms gang on the planet Corellia after his father was killed by muggers. He looked up to fellow gang member Rebolt and hoped to impress him by beating up the scrumrat Han, whom he saw escape from the gang's leader, Lady Proxima.\nAt a young age, the human male Chates traveled to Coronet City on the planet Corellia with his father, who worked as a farmer. The pair visited a bank in the city, but during the visit, muggers attacked and killed Chates's father, leaving him alone in the city. He quickly fell in with the White Worms gang, who were based out of a lair in an abandoned industrial complex in the city.\nChates became a scrumrat within the gang, and in the year 13 BBY, was present in the den when fellow scrumrat Han was brought before Lady Proxima, leader of the gang. Han, who had returned from a trade with no goods for Proxima, claimed to be holding a Thermal detonator above his head, at which point Chates got down on his knees for cover. However, Han actually only held a rock, which he used to break a shutter behind the gang leader and bathe her in light, which burned her skin. Using the distraction, Han then pushed through the other scrumrats and escaped.\nChates looked up to Rebolt, a high-ranking thug within the White Worms, and hoped to impress him by beating up Han. He had dark skin, black hair, and brown eyes.\nChates wore a gray brine-stained coat and scarf over a black shirt with a pair of gray pants and a gray headband. He carried a portable HoloNet transceiver and used a pipe as a makeshift weapon.\nChates first appeared in the 2018 film Solo: A Star Wars Story. The character was first identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/White_Worms",
  "/wiki/Scrumrat",
  "/wiki/Planet",
  "/wiki/Chates%27_father",
  "/wiki/Death",
  "/wiki/Rebolt",
  "/wiki/Han_Solo",
  "/wiki/Lord",
  "/wiki/Proxima",
  "/wiki/Coronet_City",
  "/wiki/Farmer",
  "/wiki/City",
  "/wiki/Parent",
  "/wiki/Den_of_the_White_Worms",
  "/wiki/Standard_year",
  "/wiki/13_BBY",
  "/wiki/Thermal_detonator",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Salt",
  "/wiki/Clothing",
  "/wiki/Scarf",
  "/wiki/HoloNet",
  "/wiki/2018",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}