{
 "name": "Chayloss",
 "display_name": "Chayloss",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireSith Order",
      "Sith Order"
     ]
    }
   ]
  }
 ],
 "content": "Chayloss was a Human male Sith Lord who served the resurgent Sith Empire during the Galactic War.\nDuring the Invasion of Belsavis, Chayloss was among the Imperials attempting to incite riots. They they inadvertently released a hostile race known as the Esh-kha. Chayloss was captured and bound by an Esh-Kha chieftain named Hunter Moon. Hunter Moon decided to kill Chayloss because he felt the Dark Side was tainting his Force-sensitive Savants.\nLuckily for Chayloss, a Republic-aligned individual arrived and released Chayloss. Together, the two defeated Hunter Moon. Chayloss then parted ways with the individual, as he decided to destroy the Esh-Kha.\nThe Republic individual encountered Chayloss again when he was apprehended by the Esh-Kha Patriarch, Gore Claw. Again, the two teamed up and defeated Gore Claw.\nLike most Sith, Chayloss was devoted to the Dark Side and relished killing his enemies. However, he seemed to have some honor, as he did not double-cross or attack the Republic individual in both their encounters. Though this is likely because the Esh-Kha defeated him easily, he thought he would have no chance against the individual. He also did not want the Esh-Kha to destroy the Republic, because it would mean that the Empire would have nothing to look forward to.\nAlternatively, the Republic individual can let Hunter Moon kill Chayloss for Dark Side points.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Order_(Sith_Empire)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Galactic_War",
  "/wiki/Invasion_of_Belsavis",
  "/wiki/Esh-kha",
  "/wiki/Hunter_Moon",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Savant",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Gore_Claw",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}