{
 "name": "Chee Mobok",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Chee Mobok was a male Twi'lek textiles merchant that spoke very little Basic.\nA male Twi'lek, Chee Mobok made his living as a textiles merchant despite speaking very little Basic. The Twi'lek name \"Chee\" meant, \"war, warrior,\" while the clan name, \"Mobok,\" meant, \"authoritative.\"\nIn 32 BBY, Mobok visited Naboo on a buying expedition. Having initially arranged to meet Shep Contopault in another city, Mobok arrived in Theed. Unaware that he was in the wrong city, Mobok blamed Contopault for missing all of their arranged meetings, but was ultimately caught during the Trade Federation's invasion of the planet. Mobok attempted to escape Theed by speeder, but crashed it into a pond while attempting to evade a STAP pursuit.\nAttempting to escape, panicked and hysterical, Mobok met up with Jedi Padawan Sia-Lan Wezz and her companions Rorworr, Deel Surool, Arani Korden, Galak, and Dané; all of whom were displaced passengers from the Crescent. Although initial communication was difficult, Mobok was eventually calmed. He helped the freighter group recover his speeder and together they used it to escape Theed.\nThe group was forced to abandon the damaged speeder in Lianorm Swamp. Mobok followed the group, attempting to return to the Crescent and the promise of off-world travel. Along the way, Mobok was ambushed and mauled by a Veermok, which the rest of the crew drove off. A Gungan patrol led by Mokem halted the refugees and escorted them to the edge of the swamp, refusing to allow them to travel any deeper.\nThe group eventually arrived at the rendezvous, but found no sign of the Crescent. Instead, they encountered RSF Security Guards in a shootout with Rodian and Gran pirates. Mobok hid while the crew from the Crescent intervened, eventually defeating the pirates. The lone RSF survivor, Mett Habble, was actually the recent organizer of the Naboo Resistance. Habble offered the refugees shelter, which Mobak gladly accepted.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mett_Habble/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Roleplaying_game",
  "/wiki/32_BBY/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Shep_Contopault",
  "/wiki/Theed/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Single_Trooper_Aerial_Platform/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Sia-Lan_Wezz",
  "/wiki/Rorworr_(Naboo)",
  "/wiki/Deel_Surool",
  "/wiki/Arani_Korden",
  "/wiki/Galak",
  "/wiki/Dan%C3%A9",
  "/wiki/Crescent_(freighter)",
  "/wiki/Freighter/Legends",
  "/wiki/Lianorm_Swamp/Legends",
  "/wiki/Veermok/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Mokem_(Gungan)",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Security_Guard/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gran/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Naboo_Resistance",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Peril_on_Naboo",
  "/wiki/Secrets_of_Naboo",
  "/wiki/Galactic_Campaign_Guide",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_91"
 ]
}