{
 "name": "Cheib%27Kalla",
 "display_name": "Cheib'Kalla",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  }
 ],
 "content": "Cheib'Kalla was a corpulent Twi'lek, who lived on the planet Ryloth during the waning years of the Galactic Republic. He owned and ran the Fungus Pit, a cantina.\nChieb'Kalla lived in Bashka, on Ryloth, where he owned and ran the Fungus Pit. He disliked slavers, and employed a lot of young female Twi'leks in the cantina, to keep them from the slavers. The Gotal slaver Noric Gestal often asked Chieb'Kalla if he could purchase the females, but Chieb'Kalla always refused. When the Twi'lek Jedi Master Vhiin Thorla returned to Ryloth, Chieb'Kalla became an associate of him.\nDuring the time of the Clone Wars, Gestal and about two dozen other slavers attacked the Fungus Pit, but were defeated by the Heroes of Cularin. Afterwards, Chieb'Kalla went and thanked the heroes and they told him that they were looking for Thorla. Chieb'Kalla was reluctant to help them find the Jedi Master, but Jacynith, one of his Twi'lek employees, offered to show them Thorla. Chieb'Kalla did not want her to, but eventually she persuaded him to let her take the heroes to where the Jedi Master lived.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Fungus_Pit",
  "/wiki/Cantina/Legends",
  "/wiki/Bashka",
  "/wiki/Slavery/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Noric_Gestal",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Vhiin_Thorla",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Jacynith",
  "/wiki/Twi%27light_Storm",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}