{
 "name": "Chela_Nayss",
 "display_name": "Chela Nayss",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3629 BBY",
      "Nathema"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Order of Zildrog"
     ]
    }
   ]
  }
 ],
 "content": "Chela Nayss was a female Nautolan living during the Eternal Empire conquest.\nDuring the war against Zakuul, Chela's homeworld was bombarded by Arcann's Eternal Fleet as part of the reprisal bombardments against the Alliance. Chela Nayss and her people did not have time to evacuate and millions died in the orbital bombardment, though Chela herself survived.\nAs the rebellion against Zakuul continued, the Commander of the Alliance redeemed former Eternal Emperor Arcann and brought him back to the Light side of the Force, welcoming him into the Eternal Alliance. Chela Nayss was outraged by the lack of justice against the mass murderer and joined the Order of Zildrog, a secretive group formed by Vinn Atrius and dedicated to killing the Outlander and destroying the Eternal Alliance. She traveled with the rest of the Order to Nathema, where GEMINI 16 found and planned to awaken Zildrog, an ancient Iokath superweapon. However, the GEMINI droid deceived and betrayed many of her allies, locking them inside energy transfer chambers to be used as fuel for Zildrog's awakening. Chela Nayss was among the victims drained to awaken Zildrog, but the Alliance Commander along with Lana Beniko and Theron Shan shortly arrived and destroyed the mechanical entity, after which the entire chamber that housed him and the GEMINI's victims exploded.\nChela Nayss appears during \"The Nathema Conspiracy\" flashpoint only if the player made the Light Side choice to spare Senya Tirall during Star Wars: The Old Republic: Knights of the Eternal Throne, which also leads to saving and redeeming her son Arcann later. If the player killed both Senya and Arcann in a Dark Side choice, Chela Nayss will not join the Order of Zildrog and will be replaced by Zera instead.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3629_BBY",
  "/wiki/Nathema",
  "/wiki/Nautolan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Order_of_Zildrog",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/War_against_Zakuul",
  "/wiki/Homeworld/Legends",
  "/wiki/Arcann",
  "/wiki/Eternal_Fleet",
  "/wiki/Eternal_Fleet_reprisal_bombardments",
  "/wiki/Eternal_Alliance",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Canon",
  "/wiki/Alliance_Commander",
  "/wiki/Vinn_Atrius",
  "/wiki/GEMINI_16",
  "/wiki/Zildrog",
  "/wiki/Iokath",
  "/wiki/Superweapon/Legends",
  "/wiki/GEMINI",
  "/wiki/Lana_Beniko",
  "/wiki/Theron_Shan",
  "/wiki/Senya_Tirall",
  "/wiki/Zera",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/2017",
  "/wiki/3628_BBY",
  "/wiki/Galactic_Standard_Calendar"
 ]
}