{
 "name": "Cherith Fel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nirauan"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 8 ABY–11 ABY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 22 ABY–25 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Empire of the Hand"
     ]
    }
   ]
  }
 ],
 "content": "The Human female Cherith Fel was the fourth child of General Baron Soontir Fel and Syal Antilles Fel. She was raised on Nirauan in the Unknown Regions, and when she came of age she entered military service in the Empire of the Hand. She died in battle against one of the Empire of the Hand's many foes sometime before 25 ABY.\nCherith Fel was a Human female born between 8 ABY and 11 ABY to General Baron Soontir Fel and Syal Antilles Fel, a former Imperial starfighter ace and Imperial actress, respectively, who moved to the Unknown Regions before her birth in order to serve Grand Admiral Mitth'raw'nuruodo's Empire of the Hand. There they battled the myriad threats found in the Unknown Regions, protecting both the known galaxy and the Chiss Ascendancy, Mitth'raw'nuruodo's people. Fel had three older siblings—brothers Chak, Davin, and Jagged—as well as a younger sister, Wynssa. Fel's brother Cem was kept hidden, a shadow child who could preserve the family line in the event of attack, a Chiss custom.\nLike all her elder brothers, Fel went into the Empire of the Hand's military. She was killed in battle against one of the Empire of the Hand's foes between 22 ABY and 25 ABY and after her brother Davin had already died in the conflict; she was not yet eighteen. Her death weighed heavily upon her father, who had been her military superior.\nCherith Fel was first referenced indirectly in The New Jedi Order: Dark Tide II: Ruin, by Michael A. Stackpole, when Jagged Fel stated that both his older brother and younger sister had died in combat. Elaine Cunningham's The New Jedi Order: Dark Journey then established that the younger sister's name had been Cherith. Her only further narrative mention was in Dark Nest I: The Joiner King. She has never actually appeared in any story.\nIn both The Official Star Wars Fact File 122 and The Official Star Wars Fact File 140, Fel is incorrectly stated to have died in the Battle of Ithor. That battle took place after her death, as clearly established in the source which originated her, Dark Tide II: Ruin. The Complete Star Wars Encyclopedia also states that she died during the Yuuzhan Vong invasion; this does not actually contradict the timeline of her death. The age given at her time of death does, however; it states that she was 19 when she died. This contradicts the fact that she was younger than Jagged, and died when or before Jagged was 18.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Nirauan/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/22_ABY/Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Empire_of_the_Hand",
  "/wiki/General/Legends",
  "/wiki/Baron_of_the_Empire/Legends",
  "/wiki/Soontir_Fel/Legends",
  "/wiki/Syal_Antilles_Fel",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Death/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Ace/Legends",
  "/wiki/Actor/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Chak_Fel",
  "/wiki/Davin_Fel",
  "/wiki/Jagged_Fel",
  "/wiki/Wynssa_Fel",
  "/wiki/Cem_Fel",
  "/wiki/Shadow_child",
  "/wiki/Chiss/Legends",
  "/wiki/Parent/Legends",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/Michael_A._Stackpole",
  "/wiki/Elaine_Cunningham",
  "/wiki/The_New_Jedi_Order:_Dark_Journey",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/The_Official_Star_Wars_Fact_File_122",
  "/wiki/The_Official_Star_Wars_Fact_File_140",
  "/wiki/Battle_of_Ithor",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2011_Topps_Star_Wars_Galaxy_Series_6",
  "/wiki/Vision_of_the_Future"
 ]
}