{
 "name": "Chernan Ordo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "127 ABY",
      "Botajef"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Ordo"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Chernan Ordo was a humanoid male Mandalorian who held the title of Mand'alor. During the Sith–Imperial War, Ordo was hired by the Galactic Alliance to defend the planet Botajef against an impending attack by the forces of the Fel Empire, until the Alliance's fleet arrived to repel the Imperials. However, the Alliance fleet never arrived, and Ordo perished as his forces were overrun and defeated. Fellow Mandalorian Yaga Auchs, who betrayed Ordo by sabotaging their communications, usurped the title of Mand'alor and withdrew the Mandalorians from the conflict.\nChernan Ordo, a humanoid male, was a Mandalorian who ascended to the position of Mand'alor, a title that signified his absolute authority over the Mandalorian clans, by 127 ABY. In that same year, the Fel Empire declared war against the Galactic Federation of Free Alliances. Late in the first year of the conflict, Ordo was contracted by the Alliance to defend the world of Botajef against the Imperial forces until the Galactic Alliance Defense Fleet could arrive to protect the world.\nDuring the ensuing battle on Botajef's surface, Ordo's Mandalorian forces began to be overrun by the larger number of Imperials, which included stormtroopers and AT-AR walkers. When the Alliance's fleet failed to arrive, Ordo instructed the Mandalorian Hondo Karr to check their communications tower and locate another Mandalorian, Yaga Auchs. Karr found Auchs, who killed the Mandalorian monitoring the communications and destroyed the tower on behalf of a third party who did not want the Mandalorians involved in the war. Eventually, Ordo was slain, and his forces defeated, due to Auchs' sabotage and betrayal. Auchs usurped Ordo's title of Mandalore and withdrew the Mandalorians from the Sith–Imperial War.\nChernan Ordo was capable enough of a Mandalorian to claim the title of Mand'alor, which designated his supremacy as the leader of the Mandalorian clans. Although he was willing to accept payment from the Galactic Alliance to defend Botajef, he came to view the Alliance as treacherous and cowardly, due to the Alliance's fleet never arriving to provide assistance. He also recognized that although his Mandalorians were superior fighters, the Imperials had an advantage in the quantity of their forces. Ordo wore a set of Mandalorian armor painted in green, gray, and yellow, and used a blaster pistol during combat.\nChernan Ordo was created by John Ostrander, the writer of the Star Wars: Legacy comics, for the forty-first issue of the series, entitled Rogue's End. He was drawn by Kajo Baldisimo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/127_ABY",
  "/wiki/Botajef/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Clan_Ordo",
  "/wiki/Mandalorian/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Mandalore_(title)",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Botajef",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Fel_Empire",
  "/wiki/Galactic_Alliance_Defense_Fleet",
  "/wiki/Fleet/Legends",
  "/wiki/Death/Legends",
  "/wiki/Yaga_Auchs",
  "/wiki/Saboteur/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Anaxes",
  "/wiki/Ground_warfare",
  "/wiki/Stormtrooper/Legends",
  "/wiki/All_Terrain_Advance_Raider",
  "/wiki/Hondo_Karr",
  "/wiki/Unidentified_Mandalorian_(Yaga_Auchs%27_victim)",
  "/wiki/Yaga_Auchs%27_master",
  "/wiki/Mandalorian_armor/Legends",
  "/wiki/Color/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_41",
  "/wiki/Kajo_Baldisimo",
  "/wiki/Boba_Fett/Legends",
  "/wiki/21_ABY/Legends",
  "/wiki/40_ABY",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Mandalorians:_People_and_Culture",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/Legacy_(2006)_0",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/Galaxy_at_War"
 ]
}