{
 "name": "Cheriss ke Hanadi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Adumar"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 4 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Galactic Federation of Free Alliances",
      "Jedi Coalition"
     ]
    }
   ]
  }
 ],
 "content": "Cheriss ke Hanadi was a Human female from Adumar and the Cartann Ground Champion in the sport of blastsword-dueling. She served as Red Flight's  guide during their time on Adumar.\nA native of the dominating Adumari state of Cartann, Cheriss had long-admired the skill and tenacity of fighter pilots  but Cheriss herself was unable to complete pilot training due to chronic vertigo. Instead, Cheriss took up the dying art of blastsword dueling to escape what almost amounted to indentured servitude in Cartann's underground factories. Her mother was killed by brownlung, a disease contracted in the factories. Cheriss herself worked in the factories for a season longer, until she could make her living solely through the blastsword, and then through endorsements of blastswords. She ignored most of the normal stylistic conventions of blastsword dueling, favoring the styles from the blastsword's prominence in years past. This gave her a reputation as a \"gutter fighter\" and earned the enmity of some nobles, but she nonetheless earned great popularity simply because she almost always won.\nBy the time of the New Republics' rediscovery of Adumar, Cheriss had become the planets' Ground Champion thanks to her blastsword skills. The Perator Pekaelic ke Teldan appointed Cheriss the official guide for the New Republics' pilot-ambassador group- which included Wedge Antilles. Cheriss developed somewhat of a crush on Antilles, and was herself crushed when she found he and Iella Wessiri became a couple. She then took on blastsword challenge after challenge, until she was on the brink of death. Wes Janson stepped in and prevented her opponent from killing her, while Derek Klivian summoned a medical team from the Star Destroyer Allegiance . While undergoing treatment, Cheriss mentioned her vertigo condition to the doctors- who discovered a chemical imbalance in her bloodstream that could be treated with medication. Cured at last, Cheriss soon apologized to Antilles and joined his rogue Red Flight to resist the dictatorial onslaught of Perator Pakaelic against the \"lesser nations.\" Cheriss was a member of the ground team Holdout Team that recovered the New Republic pilots' stolen T-65A3 X-wing starfighters and a secret entrance to the Perators' palace- which led Pakaelic to resign in disgrace upon capture.\nWith the Battle of Adumar concluded and her blastsword endorsement cancelled upon her defeat, Cheriss would go on to enlist in New Republic Starfighter Command and become one of that body's most renowned vibroblade combat instructors. She later served as a lieutenant in Moonlight Squadron, an A-wing group off Mon Casima.\nIn 40 ABY Cheriss was likely one of the half dozen pilots who accompanied Wedge Antilles to the abandoned Imperial outpost on the Endor moon to where Luke Skywalker had relocated the Jedi Order in opposition to Jacen Solo. She later flew as Rakehell Eight in combat near Centerpoint Station. When Rogue Squadron attacked the Rakehells, her fighter was destroyed. She survived, however, and in 43 ABY, two years after the end of the war, she was among the many pilots who went to Kessel to help save the planet from destruction.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Adumar/Legends",
  "/wiki/4_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Jedi_Coalition",
  "/wiki/Cartann_Ground_Champion",
  "/wiki/Blastsword",
  "/wiki/Red_Flight",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Wes_Janson/Legends",
  "/wiki/Derek_Klivian/Legends",
  "/wiki/Cartann",
  "/wiki/Vertigo",
  "/wiki/Cheriss_ke_Hanadi%27s_mother",
  "/wiki/Brownlung",
  "/wiki/Standard_year/Legends",
  "/wiki/Perator",
  "/wiki/Pekaelic_ke_Teldan",
  "/wiki/Iella_Wessiri_Antilles",
  "/wiki/Death/Legends",
  "/wiki/Allegiance_(Imperial_I-class)",
  "/wiki/Holdout_Team",
  "/wiki/T-65A3_X-wing_starfighter",
  "/wiki/Battle_of_Adumar",
  "/wiki/New_Republic_Starfighter_Command/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Moonlight_Squadron",
  "/wiki/RZ-1_A-wing_interceptor/Legends",
  "/wiki/Mon_Casima",
  "/wiki/40_ABY",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Darth_Caedus",
  "/wiki/Rakehell_Squadron",
  "/wiki/Battle_of_Centerpoint_Station_(Second_Galactic_Civil_War)",
  "/wiki/Centerpoint_Station",
  "/wiki/43_ABY",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Kessel/Legends",
  "/wiki/Mission_to_save_Kessel",
  "/wiki/X-Wing:_Starfighters_of_Adumar",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/Wizards.com",
  "/wiki/Adumar:_Pilots_Wanted",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/13_ABY/Legends",
  "/wiki/21_BBY/Legends"
 ]
}