{
 "name": "Chesille Sabrond",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Exegol"
     ]
    },
    {
     "name": "Born",
     "values": [
      "5 ABY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "35 ABY",
      "Derriphan",
      "Exegol"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.62 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Eternal",
      "Final Order",
      "Final Order"
     ]
    }
   ]
  }
 ],
 "content": "Chesille Sabrond was a human female who was born on the planet Exegol. She served as a captain in the Sith Eternal military, and helmed the Xyston-class Star Destroyer Derriphan. In 35 ABY, the Derriphan was the first Star Destroyer selected to leave Exegol, following orders from Allegiant General Enric Pryde of the First Order to destroy the planet Kijimi.\nChesille Sabrond was born on the Unknown Regions planet Exegol in 5 ABY and raised by the members of the Sith Eternal cult, training her entire life in preparation for the launching of the Final Order being built on her homeworld. During her ascension among the ranks, she killed three individuals, sabotaged two others, and barely slept for over twenty years. She eventually was made captain of the Xyston-class Star Destroyer Derriphan within the fleet. In 35 ABY, the leader of the Sith Eternal, the Sith Lord Darth Sidious, made contact with the First Order and granted them use of the Final Order's resources in their war against the Resistance.\nWith First Order Allegiant General Enric Pryde now in control of the fleet, the Derriphan was the first of the Sith Eternal's Xyston-class Star Destroyers launched from Exegol. Under orders from Pryde, they traveled to the planet Kijimi, which had recently harbored members of the Resistance, in order to make an example of the First Order's new might. As the Derriphan approached its target, Lieutenant Milon Lenwith informed Sabrond on the Star Destroyer's bridge that they were within range. The captain immediately gave the order to fire the starship's axial superlaser, which destroyed the entirety of Kijimi. Soon after this display of power, the Derriphan was sent back to Exegol, in where it battled against the resistance in the Battle of Exegol.\nSabrond remained on the Derriphan when the Resistance's air team and landing team arrived from Ajan Kloss. As a fleet technician informed her the Resistance' arrival, she was given orders from Pryde to fire ion cannons at the Resistance. Eventually, the Resistance managed to get the upper hand with reinforcements, the Citizens' Fleet. The Resistance then battled the Sith Star Destroyers, destroying the superlasers to bring down the warships. The Derriphan was eventually defeated and destroyed by the Resistance and the galaxy fleet, killing Sabrond.\nLike all children raised by the Sith Eternal cultists, Sabrond was raised to revere the power of the dark side of the Force despite not being able to use it. They were also taught the brutal \"truth\" of existence that might for might's sake is the ultimate end. Sabrond doesn't even value living things, as seen commanding fire towards the planet Kijimi with utter coldness. Sabrond was a human female who stood 1.62 meters  and had light skin, brown hair, and brown eyes.\nSabrond wore a black and red Final Order officer's uniform which included a black kepi hat with a Sith Eternal crest, black gloves and a black belt with a silver Imperial-style buckle containing an officer's disc.\nChesille Sabrond was portrayed by Rochenda Sandall in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Special:Upload",
  "/wiki/Exegol",
  "/wiki/5_ABY",
  "/wiki/35_ABY",
  "/wiki/Derriphan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Sith_Eternal",
  "/wiki/Final_Order",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Captain",
  "/wiki/Sith_Eternal_military",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Star_Destroyer",
  "/wiki/Allegiant_General",
  "/wiki/Enric_Pryde",
  "/wiki/First_Order",
  "/wiki/Destruction_of_Kijimi",
  "/wiki/Kijimi",
  "/wiki/Unknown_Regions",
  "/wiki/Religion",
  "/wiki/Homeworld",
  "/wiki/Military_rank",
  "/wiki/Death",
  "/wiki/Sleep",
  "/wiki/Standard_year",
  "/wiki/Fleet",
  "/wiki/Sith",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Sidious",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Resistance",
  "/wiki/Lieutenant",
  "/wiki/Milon_Lenwith",
  "/wiki/Bridge_(starship)",
  "/wiki/Starship",
  "/wiki/Axial_superlaser",
  "/wiki/Battle_of_Exegol",
  "/wiki/Exegol_air_team",
  "/wiki/Exegol_landing_team",
  "/wiki/Ajan_Kloss",
  "/wiki/Unidentified_Sith_Eternal_fleet_technician",
  "/wiki/Ion_cannon",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Youngling",
  "/wiki/Sith_cultist",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Hat",
  "/wiki/Glove",
  "/wiki/Belt",
  "/wiki/Galactic_Empire",
  "/wiki/Rochenda_Sandall",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_(Screen_Comix)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens"
 ]
}