{
 "name": "Chettkap",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jawa"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jawa tribe"
     ]
    }
   ]
  }
 ],
 "content": "Elder Chettkap was a Jawa male who served as the chief of a Jawa tribe on the planet Arvala-7. Around 9 ABY, the tribe stole parts from the Mandalorian Din Djarin's gunship, the Razor Crest. When Djarin then went to negotiate with the Jawas, Chettkap demanded a trade for his starship parts, soon agreeing to accept a Mudhorn egg as a trade. The Jawas delivered the Mandalorian near a Mudhorn cave and had just given up waiting for him when he later returned with the egg as promised. Chettkap accepted the Mudhorn egg and began feasting on its yolk with some of his tribe members.\nDuring the era of the New Republic, Elder Chettkap was the chief of an Offworld Jawa tribe on the desert planet Arvala-7, keeping order on the tribe's sandcrawler. Around 9 ABY, the Jawa elder oversaw the tribe as it dismantled and stole pieces of the Razor Crest, a gunship used by the Mandalorian bounty hunter Din Djarin. When stumbling upon the scrapping of his vessel, the Mandalorian open fired on the Jawa tribe, disintegrating a few of the Jawas, and pursued the fleeing sandcrawler until he was incapacitated by its crew.\nThe next day, Chettkap and his tribe set up camp in a valley, where they inspected their marchinary parts. Djarin then arrived with the Ugnaught vapor farmer Kuiil. After the Jawas had the Mandalorian leave his weapons aboard Kuiil's hovercart, Chettkap greeted and sat down with Kuiil, Djarin joining them both as other Jawas gathered behind the elder. When the Ugnaught discussed the Jawas returning the stolen parts from the Razor Crest, Chettkap proposed a trade for the bounty hunter's beskar armor. Djarin refused to make a trade as the parts had been belonged to him, attempting to reiterate the fact in Jawaese.\nChettkap mocked the Mandalorian's attempt as the Jawa language, jokingly comparing it to a Wookiee's dialect, and so the agrivated bounty hunter responded by firing his flamethrower in the Jawas' direction. Kuiil asked what else the Mandalorian could trade to the Jawas, to which Chettkap pointed over to an alien child on Kuiil's cart, though the Mandalorian refused to trade that either. Kuiil asking again, the chief huddled with his Jawa comrades and they agreed to make Djarin supply the the egg of a Mudhorn creature for the parts to his ship.\nDjarin agreeing to retrieve the egg, the Jawa tribe transported him near a Mudhorn cave, and they awaited his return during the day. When the bounty hunter failed to return, the Jawas chose to leave, preparing the sandcrawler for departure. That was when the Mandalorian arrived with the Mudhorn egg, and Chettkap and some of his tribe members exited the vehicle to take it. The chief received the egg from Djarin's hands and held it up before his comrades before using his knife to cut it open while another Jawa held it. Trying the yolk of the Mudhorn egg, Chettkap then allowed his tribe members to join him, and they feasted on the egg's contents. Djarin and Kuiil soon parted from the tribe with the parts for the Razor Crest.\nA Jawa male, Chettkap had glowing red eyes as opposed to the yellow eyes which were typical of Jawas from the planet Tatooine. He spoke Jawaese, and mocked Din Djarin's difficulty in speaking the language.\nLike other Jawas, Chettkap wore brown robes which concealed almost all of his body. He also wore a special necklace that the chief wore as a symbol of his leadership, which included a knife.\nThe Jawa elder first appeared in Chapter 2 of Jon Favreau's 2019 Disney+ television series The Mandalorian, directed by Rick Famuyiwa, which aired on November 15, 2019. Identified in the episode's credits as \"Jawa Elder,\" the character was played in costume by Stephen Jackson Powers Jr. and voiced by David Acord.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Insider",
  "/wiki/Going_in_for_the_Kuiil",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/Jawa",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jawa_tribe",
  "/wiki/Chief",
  "/wiki/Planet",
  "/wiki/Arvala-7",
  "/wiki/9_ABY",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Gunship",
  "/wiki/Razor_Crest",
  "/wiki/Starship",
  "/wiki/Mudhorn_egg",
  "/wiki/Mudhorn_cave",
  "/wiki/Egg",
  "/wiki/Mudhorn",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Desert",
  "/wiki/Unidentified_sandcrawler",
  "/wiki/Bounty_hunter",
  "/wiki/Standard_day",
  "/wiki/Ugnaught",
  "/wiki/Moisture_farmer",
  "/wiki/Kuiil",
  "/wiki/Hovercart",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Beskar",
  "/wiki/Mandalorian_armor",
  "/wiki/Jawaese",
  "/wiki/Language",
  "/wiki/Wookiee",
  "/wiki/Shyriiwook",
  "/wiki/Flamethrower",
  "/wiki/Alien",
  "/wiki/Grogu",
  "/wiki/Transport",
  "/wiki/Knife",
  "/wiki/Eye",
  "/wiki/Tatooine",
  "/wiki/Clothing",
  "/wiki/Robe",
  "/wiki/Chapter_2:_The_Child",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Rick_Famuyiwa",
  "/wiki/November_15",
  "/wiki/Stephen_Jackson_Powers_Jr.",
  "/wiki/David_Acord",
  "/wiki/Category:Images_of_Chettkap",
  "/wiki/The_Mandalorian:_Season_1:_Volume_1",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/The_Mandalorian_2",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Technology",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Databank_(website)",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020",
  "/wiki/File:DavidAcord-JawaVoice-January-4-2020.png"
 ]
}