{
 "name": "Chi Cho",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pantora"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Orto Plutonia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pantoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.98 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pantoran Assembly",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Chi Cho was a Pantoran male politician and military leader who served as the Supreme Chairman of the Pantoran Assembly and the Exalted Ruler of the moon Pantora during the final decades of the Galactic Republic until his death during the Clone Wars. A stalwart and hawkish leader, Cho was a fierce defender of the interests and safety of Pantora through military force rather than diplomacy. An ally of the Republic, Cho worked alongside its authorities during the Clone Wars, a pan-galactic conflict between the Republic and the Confederacy of Independent Systems.\nDuring the war, Cho lobbied the Republic to establish an outpost on the Pantoran protectorate of Orto Plutonia, leading to the discovery of the native Talz tribes and debate over the sovereignty of the planet. Cho dismissed the rights of the Talz and asserted that Pantora still had jurisdiction over the Orto Plutonia, sparking the One-Day War between his forces and the tribe of Chieftain Thi-Sen. Cho led a group of Republic soldiers into battle against Thi-Sen's warriors, but the conflict quickly turned against him, and he was fatally wounded. The chairman was reprimanded for his actions by the Pantoran Assembly, who ceded Orto Plutonia to the Talz and elected Notluwiski Papanoida as his successor.\nChi Cho was born on Pantora, a moon that orbited the planet Orto Plutonia in the Pantora system of the Sujimis sector, which was located in the galaxy's Outer Rim Territories. A talented legislator and leader, Cho was eventually elected to serve as the Supreme Chairman of the Pantoran Assembly, a democratic institution that governed Pantora. As the Supreme Chairman, Cho also served his people under the nominal title of Exalted Ruler. Motivated by the instability that led various other worlds to fall to force of arms, Cho promoted Pantora's military capabilities and colonialist structure, including the treatment of the uninhabited Orto Plutonia as a protectorate. He also maintained ties to the Galactic Republic, a galaxy-wide government in which Pantora had representation in the Galactic Senate.\nBy the outbreak of the Clone Wars between the Republic and its splinter state, the Confederacy of Independent Systems, Cho had led Pantora for far longer than its then-senator, Riyo Chuchi, had been alive. Cho and Chuchi had a difficult working relationship, with the hawkish chairman often stepping over and criticizing the idealism of the timid senator. Fearful of the fast-spreading Clone Wars and believing that the Separatist state was a threat to Pantora's security, Cho and the Pantoran Assembly lobbied the Republic military to establish an outpost, Glid Station, in a towering ice spire on Orto Plutonia. In 21 BBY, however, Republic forces lost contact with the clone troopers stationed on Orto Plutonia, garnering concern from the Pantoran Assembly, which sent Chairman Cho, Senator Chuchi, and a group of guards to join a Republic military team investigating the outpost.\nAccompanying the Pantoran dignitaries to Orto Plutonia was a Grand Army of the Republic unit led by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker and Clone Captain CT-7567, also known by the nickname \"Rex.\" The Jedi brought two droids, the astromech R2-D2 and the protocol droid C-3PO, along with them as well. The company headed for Glid Station in five LAAT/i gunships, with Cho aboard one with Senator Chuchi and his guards. Upon landing on the flats outside the ice spire, the Jedi ordered Rex's men to survey the surrounding area and set up sensor beacons. Cho departed his gunship with Chuchi and the others, but Kenobi requested they stay back until they secured the area. Cho protested, telling Kenobi that he respected the Jedi's judgment but reminding him that Orto Plutonia was sovereign Pantoran territory.\nGeneral Skywalker asked Cho whether Orto Plutonia was unaligned, given that it was uninhabited. The chairman explained that, since Pantora was the only civilization in the system, the moon had jurisdiction over Orto Plutonia. Kenobi countered that it was up to the Senate to decide control over Orto Plutonia, not Pantora, but Chuchi, at Cho's encouragement, told him that Pantora reserved the right to consider the planet its protectorate since it was uninhabited. At this, Kenobi relented and ordered Skywalker to stay with Chuchi and the droids while he, Chairman Cho, and the clones secured the base.\nWhen the company opened the bay doors to Glid Station, they saw a series of clone trooper helmets set on spikes. Cho immediately argued that the Separatists had attacked the base, but Kenobi was more uncertain. They then made their way to the station's command center, where Cho asked the general if the Separatists could be building a forward base on Orto Plutonia to target Pantora. Kenobi noticed that the computer systems were untouched, leading him to conclude that they likely weren't dealing with a Separatist attack. Captain Rex alerted them that his scouts had discovered a droid base on the other side of the ice ridge, meaning that there was a Confederate presence on the planet, as Cho believed.\nKenobi, Skywalker, Rex, and a squad of clones left for the Separatist base, while Cho stayed behind in command of the clones left at Glid Station. Cho ordered the clones to get the station's weapons system back online and the shields operational as a precaution for whatever the Separatists had planned. Despite Cho's steadfastness, Senator Chuchi doubted that the Confederates were behind the attack, pointing out that there were no battle droid remains or blaster marks at the base. Cho chided Chuchi and told her that, regardless of whether the Separatists were involved, a malevolent force was still in play, and he would not allow them to harm the people of Pantora. Chuchi tried explaining to the chairman that they didn't have to be hostile in their response, but Cho brushed aside her idealism and questioned her loyalty, asking her if she was willing to fight and die for her people as he was.\nThe Jedi's team, meanwhile, discovered that the Separatist base, two XT Beetle Transports, had been attacked similarly to Glid Station. Through security holograms, they found that a group of Talz had attacked the droids and located a settlement of the primitive species nearby. When they returned to the Republic base, Kenobi told Cho that Orto Plutonia was inhabited, but the chairman dismissed his claim and stated that Pantoran explorers had never found any inhabitants, then proceeded to label the Talz as \"trespassers.\" Kenobi told him that the group had not mastered space travel and may have been on Orto Plutonia longer than the Pantorans, leading Cho to angrily state that the planet and the system belonged to Pantora. Chuchi, however, pointed out that the Senate had to decide sovereignty if the Talz were indigenous. Cho argued that the Talz were nothing more than savages, citing the attack on the station as proof.\nGeneral Kenobi reasoned that the Talz had only attacked Glid Station because the Separatists droids had provoked them, but Chairman Cho again dismissed his claims. Believing that the Talz were dangerous and had to be subdued, Cho ordered Captain Rex to prepare his troops for battle. Kenobi and Skywalker informed the chairman that they had promised the tribe and its leader, chieftain Thi-Sen, no retaliation. Incensed, Cho asserted that the Talz were not covered by the Convention of Civilized Systems, which meant that the Jedi Council had no say in the matter. Chuchi timidly tried to argue against Cho by saying that the status of the Talz status as uncivilized would be in doubt if the Jedi had been able to communicate with them, but he accused her of standing against him. Though alone in his stance, Cho remained convinced that the Talz were a threat and agreed to meet with Thi-Sen as the Jedi wanted.\nChairman Cho joined the Jedi, Chuchi, C-3PO, and a group of clones led by Rex to the designated meeting spot, the former Separatist base, where he ordered that Rex station his soldiers on a nearby ice ridge, from where they would attack the Talz once they arrived. Kenobi demanded that Cho stand down, then informed the chairman that the Talz were already there and had been tracking the group since they left Glid Station. Inside the droid base, Cho met with Chief Thi-Sen, with C-3PO as a translator. Disregarding Thi-Sen's warm welcome and Chuchi's attempt to speak in his place, Cho had C-3PO tell the chief that the planet belonged to Pantora and that the Talz had no right to give orders to the Pantorans.\nKenobi attempted to dissuade Cho, but the chairman declared that the matter was now an internal affair for the Pantorans while C-3PO gave his message to the Talz leader. Cho's strong message angered Thi-Sen, who demanded that Cho leave Orto Plutonia or face war. Not willing to relent, Cho sternly stated that they would go to war. Outside the base, he ordered the clones to mount their speeders and follow him, and Skywalker had Rex go with him as well as protection. While the Jedi and Chuchi returned to Glid Station to find a way to stop Cho, the chairman led his forces through an ice canyon on their speeders, where they first clashed with a trio of Talz, who rode native narglatches. Thi-Sen's war party was prepared for them, however, and numerous Talz rose from the ground in an ambush.\nSurrounded by Talz throughout the canyon, the clones formed a defensive formation with their bikes, a circle with Chairman Cho in the center. A Talz warrior ran through the barricade and struck down one of Cho's guards but was killed before it could attack the chairman himself. With the Talz advancing and picking off clones with spears, Rex ordered a retreat, to Cho's anger. Before he could protest, however, Cho was pierced through the back with a spear, calling the Talz savages as he fell to the ground. Rex killed numerous Talz attempting to finish the unconscious chairman off, then placed his body onto his speeder and retreated with the surviving clones. While Cho had been in battle, Senator Chuchi had contacted the Speaker of the Pantoran Assembly and petitioned him to act on Cho. At the Speaker's request, the Assembly voted to declare Cho out of order and granted authority to Chuchi to negotiate a peaceful settlement with the Talz on behalf of Pantora.\nMeanwhile, Thi-Sen's warriors cornered the surviving clones near a ravine. Cho regained consciousness as the clones fired at the oncoming Talz, but the arrival of the LAAT/i gunships led to a brief ceasefire. As the reinforcements from Glid Station took their positions, Chuchi and the Jedi departed a gunship and approached Rex, who told them that the chairman was wounded. Chuchi knelt down by Cho's side and asked if he could hear her, and, as his final command, he told her to avenge him and destroy the Talz. Chuchi, however, denied his request and informed him that the Assembly had reprimanded him and given her authority to negotiate peace with the tribes. Bewildered, Cho exasperatedly exclaimed that peace was impossible and that he had died for his people before drawing his final breaths.\nAfter Cho's death, Senator Chuchi removed his military cap and, with C-3PO as a translator, approached Thi-Sen and his war party. Chuchi lodged a Talz spear into the ground between them, then placed Cho's cap on the weapon. Chuchi told the chieftain that it was braver to live for one's people than to die for them, directly echoing and contrasting what Cho had told her earlier. Offering peace between Pantora and the Talz, she convinced Thi-Sen to relent, and he dug his spear into the ground alongside hers. Soon after establishing peace and ending the One-Day War, Chuchi and the Republic forces left Orto Plutonia, and the Pantoran Assembly hastily voted to abandon Glid Station and officially cede sovereignty of the planet to the Talz tribes.\nWith Cho dead, the office of Supreme Chairman was opened and Assemblyman Notluwiski Papanoida, a popular figure among the Pantorans, was elected to succeed him and proved to be a far more reasonable leader than he had been. Papanoida and Senator Chuchi enjoyed a closer relationship than she had had with Cho, with the elder chairman guiding her as she, freed from under Cho's heel, grew into a passionate and outspoken leader in the Senate.\nChi Cho was a male Pantoran who stood at 1.98 meters, or 6 feet and 6 inches tall. He had gold eyes and black hair, which had begun to gray by the time of the Clone Wars, and he often kept pulled back into a bun. Like other Pantorans, Cho had golden facial tattoos to symbolize his status in Pantora's sophisticated society. Though the tattoos were nothing more than simple lines, they recalled symbology from ancient Pantoran texts.\nCho was a steadfast defender of the interests of Pantora, but through his long years of service, he became arrogant and ruthless in his beliefs and patriotism. Seeing the downfall of hundreds of worlds around him to violent force made him a staunch war hawk, and he had no interest in diplomatic work or finding peaceful solutions to conflict. Because of his fear of groups threatening Pantora, Cho was an ally of the Galactic Republic, who he petitioned to heighten its military presence in his system. Despite being allied to the government, he was focused primarily on the needs of his people. Additionally, he saw the Republic and the Jedi Order as tools of blunt force and was contemptuous of the Galactic Senate's standards. He was likewise curt and dismissive with Senator Chuchi, viewing her idealism and youth as signs of naïveté and inexperience.\nChairman Cho deemed any society lesser then Pantora's highly developed and ancient culture uncivilized and, in some cases, savage. He believed that the Talz were nothing more than violent animals despite evidence of their own rich culture and treated them as though they were trespassers on Orto Plutonia, unwilling to admit that they were likely native to the planet far longer than Pantorans had explored it. He adamantly refused to negotiate sovereignty of Orto Plutonia with them, instead declaring that Pantora's interests in the world overrode their rights as a species, going so far as to claim that the Convention of Civilized Systems did not cover them. In his blind hatred of the Talz and fear that they posed a threat to Pantora, Cho made the ill-conceived decision to go to war, misguidedly believing that he was acting for the good of his people and losing his life in the process.\nBecause of his high status on Pantora, Chairman Cho wore fine-tailored clothing and elegant jewelry. During his time on Orto Plutonia, shortly before his death, he wore a military outfit, complete with an overcoat and a cap with warm earmuffs. Aside from his refined clothes, Cho was also the owner of a white and gold blaster pistol.\nChi Cho was created for \"Trespass,\" the fifteenth episode of the first season of the animated television series Star Wars: The Clone Wars, which aired on January 30, 2009, and was directed by Brian Kalin O'Connell and written by Steven Melching. In \"Trespass,\" Cho was voiced by actor Brian George, who had previously lent his voice to King Katuunko in The Clone Wars. George first read for the part of Chi Cho in his agent's office, where he listened to a demo recording of the character's lines by a worker from Lucasfilm. According to George, Lucasfilm liked the quality of the demo recording and asked actors auditioning for the part to incorporate the mild South African accent used in the demo into their performances. Because of both Cho's role in the script and Lucasfilm's request for him to audition with the South African accent, George finalized his version of the character by drawing upon the leaders of South African apartheid as inspiration.\nIn an interview with Pete Vilmur for StarWars.com, George compared Chairman Cho's actions in \"Trespass\" to not only South African apartheid but several real-world atrocities, including the ethnic cleansing in the Bosnian War, the Rwandan Genocide, and the Darfur Genocide. To George, Cho could not be compared to any one historical figure but was instead representative of any group motivated by \"blood-lust and hatred of 'the outsider' rather than by any positive visionary message.\" George liked that Cho doesn't learn from his mistakes or develop over the episode, appreciating that the character didn't face any \"epiphany\" and instead remained blindly prejudiced, which he felt was more reflective of real life.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chi_Cho",
  "/wiki/Chi_Cho/Legends",
  "/wiki/Pantora",
  "/wiki/21_BBY",
  "/wiki/Orto_Plutonia",
  "/wiki/Pantoran",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Pantoran_Assembly",
  "/wiki/Galactic_Republic",
  "/wiki/Riyo_Chuchi",
  "/wiki/Politics",
  "/wiki/Supreme_Chairman",
  "/wiki/Exalted_Ruler",
  "/wiki/Moon",
  "/wiki/Standard_decade",
  "/wiki/Death",
  "/wiki/Clone_Wars",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Glid_Station",
  "/wiki/Talz",
  "/wiki/Talz_village",
  "/wiki/One-Day_War",
  "/wiki/Chief",
  "/wiki/Thi-Sen",
  "/wiki/Notluwiski_Papanoida",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Pantora_system",
  "/wiki/Sujimis_sector",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Galactic_Senate",
  "/wiki/Senator",
  "/wiki/Skirmish_on_Orto_Plutonia",
  "/wiki/Pantoran_guard",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Clone_trooper",
  "/wiki/Separatist_outpost_(Orto_Plutonia)",
  "/wiki/Battle_droid",
  "/wiki/XT_Beetle_Transport",
  "/wiki/Convention_of_Civilized_Systems",
  "/wiki/Jedi_High_Council",
  "/wiki/Narglatch",
  "/wiki/Spear",
  "/wiki/Speaker_of_the_Assembly",
  "/wiki/Inch",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Tattoo",
  "/wiki/Jedi_Order",
  "/wiki/Blaster_pistol",
  "/wiki/Trespass",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/January_30",
  "/wiki/2009",
  "/wiki/Brian_Kalin_O%27Connell",
  "/wiki/Steven_Melching",
  "/wiki/Brian_George",
  "/wiki/King",
  "/wiki/Katuunko",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Pete_Vilmur",
  "/wiki/StarWars.com",
  "/wiki/Sphere_of_Influence",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Chairman",
  "/wiki/22_BBY",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Blue_Shadow_Virus",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_85",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Chancellors,_Senators_and_Other_Statesmen_of_the_Republic"
 ]
}