{
 "name": "Chichak",
 "display_name": "Chichak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Yavin 13"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 0 or 4 ABY and 26 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gerb"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.1 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Chichak was a male Gerb from Yavin 13.\nA restless spirit, Chichak loved to explore the deserts of Yavin 13, wandering from his burrow for weeks at a time. The elders of the burrow believed that the youth sought enlightenment. In truth, Chichak was looking for cacti that he could either knock down or burn. Upon his return, he would regale his burrowmates with stories of his adventures, which they loved to hear. However, the stories were not entirely truthful, and his theories of the way the world worked often made his elders despair due to inaccuracies. On one such journey, Chichak encountered a scouting team from Fernandin Scouting Expedition, following it for several weeks. Chichak learned their language and told them inaccurate stories of Gerb society. After returning to his burrow with the tale of the strange biped, he was displeased to learn no one believed him. Determined to prove his story, Chichak set off in search of the Humans. He eventually found them, bringing them back to his burrow.\nIn 26 ABY, the Yuuzhan Vong wiped out all life from Yavin 13, causing the extinction of the Gerb species, meaning that Chichak was killed then, if he hadn't already died at some point prior.\nTall for a Gerb, standing 1.1 meters tall, Chichak had long hind legs, tall ears, and sharp claws. His fur was light brown. Easily bored, Chichak constantly sought out entertainment. He was below average intelligence for a Gerb, and was gullible and dimwitted, although he had a flair for telling tall tales. Chichak spoke quickly, and was hyper even for a Gerb; he loved to tell stories, explore, and play jokes.\nChichak carried around a collection of polished rocks.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Yavin_13/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/26_ABY",
  "/wiki/Gerb",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Fernandin_Scouting_Expedition",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Human/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Rock",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin_(Second_Edition)",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds"
 ]
}