{
 "name": "Chik Apla",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Chik Apla, a Human male, was an Imperial commando from the planet Coruscant and, at one point, a member of the Emperor's Royal Guard. While serving the Galactic Empire, Apla had an active career, and he eventually received a distinguished scar that ran down his right cheek. He wore and maintained his Royal Guard armor well into the dominant days of the New Republic. After the fall of the Empire and the signing of the Pellaeon–Gavrisom Treaty in 19 ABY, Apla retired to the planet Dolis 3 to spend the rest of his days.\nIn that year, Apla was recruited by Moff Derran Takkar and was instrumental in Takkar's plan to ruin the highly publicized wedding of Jedi Master Luke Skywalker and former Emperor's Hand Mara Jade, two New Republic figures whom Takkar partially blamed for the downfall of the Empire. Assigned to Coruscant, Apla spied on Jade as she prepared for the ceremony, and he eventually attacked the bride-to-be while she was trying on a dress. However, he was soundly defeated by the fully-fledged Jedi Knight and taken into New Republic custody.\nChik Apla was a Human male from the galactic capital planet of Coruscant. During his lifetime, he served the Galactic Empire as a commando and was, at some point in his career, a member of the Emperor's Royal Guard. During his years of service, Apla received a scar on his right temple. Apla's military days came to a close in 19 ABY after the signing of the Pellaeon–Gavrisom Treaty between the Empire and the New Republic. Apla took up residence on the planet Dolis 3, where he was bar buddies with several other men on the planet, but money was hard to come by, and most of the men were in debt to each other through favors and loans. Apla and his friends frequently gathered in bars to complain about the state of the Empire and to get status updates on galactic politics. Besides hanging around the bars, Apla was also marginally involved with the local Moff, Derran Takkar. Unknown to Takkar, Apla was carrying on an affair with his wife, Anlys.\nIn 19 ABY, Apla and his bar buddies received word that the Jedi Master Luke Skywalker and his fiancee, Mara Jade—a former Emperor's Hand—were planning an elaborate wedding on Coruscant, now the New Republic capital world. At news of the wedding, the men began to assess their situation, with one man declaring that the New Republic was now \"untouchable.\" However, Moff Takkar disagreed. Walking into the bar, he proclaimed to the men that they could still do much to change their situation and that of the Empire. Takkar asked the men in the bar to join him in striking a blow at the New Republic. The men, while unimpressed with Takkar's arrogance and condescending manner, agreed to join the Moff's cause.\nTakkar gave Apla and three other men—Chala Venan, Banner Sumptor, and Iry Danta—a meeting place on Coruscant: a low-quality apartment in the slums of the city-world that the group rented by pooling their resources together. After arriving on Coruscant, Apla began to act more professionally, quieting the men and telling them not to speak their real names out loud. Takkar eventually made contact with the group and gave them their assignments. Apla was assigned a surveillance job, and he immediately began spying on Mara Jade, following her movements and eavesdropping on her conversations. Finding the site of the wedding, Apla and his compatriots staked out the area, locating the best places of attack.\nAfter a long day of work, Apla went with Danta and Sumptor to the Red Rancor cantina. Ordering drinks, the trio occupied a booth near the back of the bar to talk about their upcoming work. Unknown to them, Skywalker's friends Han Solo and Lando Calrissian were throwing a bachelor party for the Jedi Master in the main area of the cantina. Surveying the situation, Apla and the group witnessed Skywalker and his companions get involved in a widespread bar fight. During the fight, a drunken Trandoshan almost crushed Skywalker with a heavy table. Sumptor stopped the Trandoshan by tripping him before he could slam the table onto the Jedi. Apla and Danta were annoyed with Sumptor for \"saving\" Skywalker, but after the young Imperial explained that having the Rebel hero die in a bar brawl didn't make a sufficient statement, Apla agreed that they had an Imperial standard to uphold. Unfortunately, Moff Takkar didn't see it the same way and reprimanded the men for not taking the initiative to eliminate Skywalker.\nAfter this incident, Apla was assigned to Takkar's wife, Anlys. Anlys was planning to eliminate the dressmaker for the wedding, which would throw the event into disarray. Throughout their work together, Anlys was very flirtatious with the former Royal Guardsman, suggesting that if he succeeded in accomplishing her goals she would love to \"celebrate\" with him. However, Apla doubted her ability to find their target and dismissed any chance that they might have of locating the mysterious dress designer. Anlys proved more capable than Apla realized, and she used her talents as a slicer to quickly uncover the identity of the important designer, Jari'kyn. Equipped with the target's identity, Apla found the address of the Twi'lek and waited for Jade to arrive for her fitting. Dressed in full Royal Guard armor, Apla watched as Mara Jade arrived. Breaking into Jari'kyn's headquarters, he attacked the former Emperor's Hand with a double-bladed vibroblade, declaring that she needed to die for betraying the Empire. Unfortunately for Apla, Jade reacted with incredible speed, parrying his attacks and destroying his weapon.\nHer counterattack knocked Apla unconscious, and he was taken into Republic custody. Apla suffered from internal injuries, including a ruptured spleen and a bruised liver. His armor had little effect in protecting his body, and he was also victim to a fractured skull and broken ribs. Luckily for Alpa, bacta healed all of his injuries. After news of Apla's fate reached the rest of the group, Anlys became inconsolable, crying for her lost love. Takkar and the group continued with the plan to ruin the wedding, but their attempt was grossly unsuccessful.\nChik Apla was a simple man and a dutiful soldier. He took orders well and tried to maintain a semblance of professionalism during his exploits. However, Apla's retirement from active service had fostered a minor sense of laziness, and he needed to be reminded of the required professional attitude during the mission for Takkar. Along with his sense of duty, Apla was also generally respectful of rank and authority and treated his fellow comrades with respect. However, during his final mission for Takkar, Apla formed a romantic attachment with Moff Takkar's wife. Apla's professional attitude and demeanor were unable to overcome the talents of a Jedi Knight, and even the element of surprise was insufficient to give Apla the advantage over Mara Jade.\nChik Apla was a talented knife thrower and weapons expert. Apla was able to pierce a beetle at some distance with a throwing knife, and he was well versed in military procedure. He was in fairly good physical condition, even after several years out of active service, able to jump from an adjacent building outside Jari'kyn's apartment to instigate a fight with Mara Jade. Apla had also retained a full suit of Royal Guard body armor complete with vibroblade, but the suit showed its age with the cape suffering several holes in the fabric.\nChik Apla was created by author Michael A. Stackpole and artist Robert Teranishi for the 1999 comic miniseries Star Wars: Union. In the series, Apla strongly resembles actor Jack Nicholson. Several other characters in Union are also similar in appearance to real-world actors. The resemblances have been noted by author Nathan Butler while interviewing Stackpole for his Chronoradio website.\nApla's body armor is reminiscent of Carnor Jax's guard armor, which, according to Star Wars Handbook 2: Crimson Empire, was supposed to be reserved for the Master Instructor of the Emperor's Royal Guard.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Commando/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Armor/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Pellaeon%E2%80%93Gavrisom_Treaty",
  "/wiki/19_ABY/Legends",
  "/wiki/Dolis_3",
  "/wiki/Standard_year/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Derran_Takkar",
  "/wiki/Wedding_of_Luke_Skywalker_and_Mara_Jade",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Spy/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Airspeeder/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Politics/Legends",
  "/wiki/Anlys_Takkar",
  "/wiki/Chala_Venan",
  "/wiki/Banner_Sumptor",
  "/wiki/Iry_Danta",
  "/wiki/Ecumenopolis/Legends",
  "/wiki/Red_Rancor",
  "/wiki/Han_Solo/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Jari%27kyn",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Vibrostaff",
  "/wiki/Death/Legends",
  "/wiki/Sun_djem/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/Spleen",
  "/wiki/Liver/Legends",
  "/wiki/Bone/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Beetle/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Michael_A._Stackpole",
  "/wiki/Robert_Teranishi",
  "/wiki/1999",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Union",
  "/wiki/Nathan_Butler",
  "/wiki/Carnor_Jax",
  "/wiki/Star_Wars_Handbook_2:_Crimson_Empire",
  "/wiki/Master_Instructor",
  "/wiki/Union_2",
  "/wiki/Union_3",
  "/wiki/Union_4",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Union_1",
  "/wiki/August_30",
  "/wiki/2012",
  "/wiki/Star_Wars:_Crimson_Empire"
 ]
}