{
 "name": "Chillo Sanpona",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Karn Granzor's pirates",
      "Drek Drednar's pirates"
     ]
    }
   ]
  }
 ],
 "content": "Chillo Sanpona was a bloodthirsty Rodian pirate, serving first on the Sable II under Karn Granzor, and subsequently on the Sable III under Drek Drednar.\nA fierce fighter, Chillo, whose primary interest in piracy was the fighting, was one of Kain Granzor's best pirates. Chillo, however, was frustrated with Granzor's greed and lack of will to share the booty with his crewmen. Chillo then decided to steal a large portion of the booty for himself. He was caught and sentenced to death by Granzor. Fortunately for Chillo, Drednar, who was a member of the crew too, managed to talk Granzor out of executing Chillo, who was instead marooned on an uncharted planetoid.\nHowever, Drednar, who was conspiring against Granzor, secretly had some contacts pick up Chillo, who went into hiding, and became involved with the mutinous plot. When the time was ripe, he was smuggled back aboard the Sable II, where he conducted a series of sabotages. Rumor held that, when Drednar attacked Sable II with the stolen Corellian corvette Anto's Star, it was Chillo who killed Granzor.\nChillo was made first mate of the Anto's Star, now renamed the Sable III, and served Drednar loyally. A typically bloodthirsty Rodian, Chillo sometimes needed be kept in line by Drednar so as not to unnecessarily slaughter and kill the crews of captured ships. In his spare time, Chillo would hunt gornalaks on Taraloon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Karn_Granzor",
  "/wiki/Pirate/Legends",
  "/wiki/Drek_Drednar",
  "/wiki/Sable_II",
  "/wiki/Sable_III",
  "/wiki/Death/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Corvette/Legends",
  "/wiki/Gornalak",
  "/wiki/Taraloon",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Stand_and_Deliver",
  "/wiki/Star_Wars_Adventure_Journal_5"
 ]
}