{
 "name": "Chirrut_%C3%8Emwe",
 "display_name": "Chirrut Îmwe",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Jedha"
     ]
    },
    {
     "name": "Born",
     "values": [
      "52 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Scarif"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.73 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pale blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Guardians of the Whills",
      "Partisans",
      "Alliance to Restore the Republic",
      "Rogue One",
      "Rogue One"
     ]
    }
   ]
  }
 ],
 "content": "Chirrut Îmwe was a blind human born on the moon Jedha in 52 BBY. He used a uneti-wood staff and handmade lightbow. One of the Guardians of the Whills, an order of spiritual warrior-monks, he was active during the days of the Galactic Empire and worked as an itinerant preacher in Jedha City. Alongside his close friend, partner, and protector, Baze Malbus, he went to Eadu with Cassian Andor, Baze Malbus, K-2SO, Jyn Erso, and other members. Îmwe became part of a volunteer group of Rebels tasked with stealing the plans of the first Death Star. Îmwe died during the Battle of Scarif in 0 BBY after assisting Jyn Erso and Cassian Andor in breaking into the Imperial archives. Chirrut's valiant sacrifice along with the rest of Rogue One ensured the success of the mission and the eventually destruction of the Death Star.\nBorn in 52 BBY, Chirrut Îmwe lived on the moon Jedha where he became a member of the Guardians of the Whills alongside his longtime friend Baze Malbus. In 0 BBY, Îmwe's voice was heard by Padawan Ezra Bridger in a place that existed between time and space.\nOne night, Îmwe responded to a disturbance in the tunnels. He confronted the individuals Dok-Ondar and Hondo Ohnaka after the latter's protege had been killed and they stole a kyber crystal statue. Îmwe dueled Ohnaka, but Dok-Ondar told him that they were there to take the statue for clues to his parents' murder. Îmwe relented and let them escape.\nShortly after Saw Gerrera arrived on Jedha, Chirrut and Baze were approached by Beezer Fortuna, one of Saw's top men. They agreed to join on the condition that the orphanage that their friends ran would get any and all supplies they needed. The partisans greatly underestimated Chirrut's abilities, leaving him out of many missions, until Chirrut proved to them he was of value. As Saw's attacks increased, the Empire began to hurt the citizens of Jedha more. This resulted in more orphans, which meant they needed more supplies, Chirrut and Baze knew that they could not let the orphans remain here, so they struck a deal with the partisans to steal an Imperial Sentinel ship. However, as they put their plan into motion, Beezer and two other partisans betrayed Chirrut and Baze, attempting the steal the ship for themselves to use it as a giant explosive against the Imperial Star Destroyer that hovered above the city. Chirrut managed to convince Beezer that their movement would gain no more traction if word got out that Saw prevented the escape of the orphans. Ceding to Chirrut's rationale, Beezer surrendered the ship to them. This ended their relationship with Saw, however, leaving them on very bad terms.\nNineteen years after Sheev Palpatine turned the Galactic Republic into the Galactic Empire, Îmwe was outside preaching of the Force when he met Jyn Erso. He asked her if she knew what kyber crystals were after sensing she had one on her necklace; she told him that they were what powered a Jedi's lightsaber. She then left with Captain Cassian Andor.\nLater on, during a skirmish that took place in Jedha City, Îmwe helped free Andor, Erso and the droid K-2SO from a group of stormtroopers. Using his highly trained hearing to determine the positions of the approaching troopers, he attacked them with his staff, knocking them all down in quick succession. Then Malbus shot and killed stormtrooper reinforcements approaching from behind Îmwe. After learning why Erso and Andor were there, a group of Saw Gerrera's insurgents came and placed sacks on all their heads, to which Îmwe remarked with annoyance because he was already blind and could not see where they were taking him anyway.\nThey were taken to Gerrera's hideout and placed into a cell. In the cell Îmwe repeated the phrase, \"I am one with the Force. The Force is with me.\" Malbus didn't believe that Îmwe's praying would work to open the cell door. Îmwe asked Andor if he had been in any other cells before to which Andor told him it was his first one. He told him there was more than one type of cell and that he sensed that Andor carried his around with him everywhere he went. Îmwe then sensed that there was someone in the cell beside them. It turned out to be the Ex-Imperial Pilot Bodhi Rook. They eventually made their escape as the Jedha City was attacked by the Empire's superweapon, the Death Star. Îmwe made his escape with the others aboard the U-wing.\nWhile on board the U-Wing, Îmwe questioned Malbus about the holy city to which he told him that it had been completely destroyed. Jyn told Andor about the weakness that her father had placed in the Death Star and the group made their way to Eadu. Once on the planet, Andor and Rook went out to scout the refinery. After asking Baze if Andor looked like a killer, Baze told him that he looked like a friend. Erso questioned this and Îmwe told her that the Force flows darkly around a creature that is about to kill. Fearing that Andor was going to kill her father she went out in search of him. Moments prior to Erso's departure, K-2SO recalled that Andor's weapon was set in its sniper configuration, supporting Erso's fear that Andor was planning to kill her father. Îmwe later followed Erso. Baze soon followed. Baze and Îmwe stopped at a ridge to get a good look at things. Once the Rebel fighters arrived, Îmwe used his lightbow to take down a TIE Fighter which crashed into a turbo laser tower. Soon after Baze and Îmwe made their way to the shuttle that K-2SO had stolen and made their way to Yavin 4.\nAfter the Alliance Council had told Jyn Erso that they could not afford to send the Rebel Fleet to Scarif, Îmwe was among those who chose to fight with her. Once they arrived on the planet, Îmwe and Malbus were put in charge of an assault team that would set charges to lure out the stormtroopers. After taking out several troopers, they made their way to the entrance to the complex. Îmwe and Malbus held the line with other Rebels until All Terrain Armored Cargo Transports arrived at their position. Îmwe and the others ran for shelter. Making their way towards the beach the rebels cut down stormtroopers and coastal defender stormtroopers and watched as a UT-60D U-wing starfighter/support craft crashed on the shore. A TIE/rp Reaper attack lander carrying six of Orson Callan Krennic's death troopers arrived on the beach, and the elite imperial soldiers proceeded to attack the remaining rebels. After learning that the master switch needed to be flipped for the Rebels to receive the Death Star plans, he made his way out onto the battle field to activate the switch, continuing to repeat the chant, \"I am one with the Force. The Force is with me.\" Managing to not be hit by any blaster bolts, Chirrut activated the switch just as a fuel container was hit by a death trooper's blaster bolt and an explosion occurred, sending him flying backwards. Malbus, seeing his friend injured ran onto the battlefield to help, firing at every trooper. Îmwe soon died in his friend's arms, but told Malbus not to grieve: if Malbus looked to the Force, he would always be able to find him. Baze died soon after killing the remaining Death Troopers.\nUltimately Chirrut and rest of Rogue One's sacrifice ensured the mission's success in capturing the Death Star plans, which ultimately resulted in the destruction of battlestation at the hands of Luke Skywalker.\nChirrut Îmwe was a blind human male, with pale blue eyes, black hair, and tan skin. Although he lacked Force abilities, Îmwe was a strong believer in it and the Jedi way, carrying a simple staff and traditional lightbow bowcaster, contrasting greatly with his partner's more pragmatic personality. His devotion to spirituality helped him overcome his blindness and become a formidable warrior. Îmwe's Zama-shiwo skills were said to have given him supernatural powers that would alter his heart and oxygen intake. Îmwe always kept the cause of his blindness a close secret.\nChirrut Îmwe is portrayed by Donnie Yen in the Star Wars stand-alone film Rogue One: A Star Wars Story. Director Gareth Edwards allowed Yen to flesh out the character as he saw fit. One of the traits that Yen created for his character was Îmwe's blindness. The character's blindness in Rogue One was additionally inspired by the Japanese fictional character Zatoichi, a blind masseur and samurai.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Expand",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/Force_Collector",
  "/wiki/Galaxy%27s_Edge_3",
  "/wiki/Talk:Chirrut_%C3%8Emwe",
  "/wiki/Jedha",
  "/wiki/52_BBY",
  "/wiki/0_BBY",
  "/wiki/Scarif",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Guardians_of_the_Whills",
  "/wiki/Partisans",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rogue_One",
  "/wiki/Reproduction",
  "/wiki/Moon",
  "/wiki/Chirrut%27s_lightbow",
  "/wiki/Lightbow",
  "/wiki/Monk",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Jedha_City",
  "/wiki/Baze_Malbus",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/K-2SO",
  "/wiki/Jyn_Erso",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Death",
  "/wiki/Battle_of_Scarif",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Padawan",
  "/wiki/Ezra_Bridger",
  "/wiki/World_Between_Worlds",
  "/wiki/Time",
  "/wiki/Realspace",
  "/wiki/Dok-Ondar",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Saw_Gerrera",
  "/wiki/Beezer_Fortuna",
  "/wiki/Sentinel-class_landing_craft",
  "/wiki/Standard_year",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Republic",
  "/wiki/The_Force",
  "/wiki/Kyber_crystal",
  "/wiki/Necklace",
  "/wiki/Jedi",
  "/wiki/Lightsaber",
  "/wiki/Battle_on_Jedha",
  "/wiki/Stormtrooper",
  "/wiki/Trooper",
  "/wiki/Catacombs_of_Cadera",
  "/wiki/Bodhi_Rook",
  "/wiki/Superweapon",
  "/wiki/All_Terrain_Armored_Cargo_Transport",
  "/wiki/Coastal_defender_stormtrooper",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/TIE/rp_Reaper_attack_lander",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Death_trooper",
  "/wiki/Luke_Skywalker",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Force_power",
  "/wiki/Chirrut%27s_staff",
  "/wiki/Bowcaster",
  "/wiki/Zama-shiwo",
  "/wiki/Donnie_Yen",
  "/wiki/Star_Wars",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Gareth_Edwards",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Lost_Stars_(webcomic)",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Star_Wars_Rebels",
  "/wiki/A_World_Between_Worlds",
  "/wiki/Guardians_of_the_Whills_(novel)",
  "/wiki/Guardians_of_the_Whills:_The_Manga",
  "/wiki/Star_Wars:_Boots_on_the_Ground",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_1",
  "/wiki/Rogue_One_Adaptation_2",
  "/wiki/Rogue_One_Adaptation_3",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Rogue_One_Adaptation_5",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/LEGO_Star_Wars_Movie_Short",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Rogue_One",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_169",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Art_of_Coloring:_Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Top_Trumps",
  "/wiki/Top_Trumps:_Star_Wars:_Rogue_One",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_56",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Star_Wars_Helmet_Collection_77",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Databank_(website)",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Entertainment_Weekly",
  "/wiki/June_22",
  "/wiki/2016",
  "/wiki/June_24",
  "/wiki/Rogue_One:_A_Star_Wars_Story_-_The_Official_Collector%27s_Edition",
  "/wiki/November_2",
  "/wiki/July_25",
  "/wiki/2020",
  "/wiki/Phil_Szostak"
 ]
}