{
 "name": "Chiraneau",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Rear Admiral Chiraneau was a human male who served in the Navy of the Galactic Empire and worked as an advisor to Admiral Firmus Piett. He piloted a VT-49 Decimator. In 4 ABY, Chiraneau was present on board the Death Star II battle station and was among the Imperial officers present when the Sith Lord Darth Vader arrived on board.\nChiraneau was a human male who served as a rear admiral in the officer corps of the Imperial Navy of the Galactic Empire. He functioned as an advisor to Admiral Firmus Piett, the commander of the Executor-class Star Dreadnought Executor and Death Squadron.\nIn 4 ABY, he was present on board the Death Star II battle station while it was under construction in the Endor system. When the Sith Lord Darth Vader arrived on the space station to inspect the progress of its construction, Chiraneau was among the group of Imperial officers who stood at attention in one of the station's hangars as Vader disembarked from his shuttle and spoke with Moff Tiaan Jerjerrod, commander of the Death Star. Not long after Vader's arrival, the Death Star II was destroyed by the Alliance to Restore the Republic during the Battle of Endor.\nChiraneau had light skin and gray hair.\nThe rear admiral wore a gray Imperial officer's uniform including a matching cap with an officer's disk and a black belt that also bore an officer's disk on its buckle. He also wore black boots and black gloves and bore an rank insignia plaque with six red pips above six blue pips. He owned at least two code cylinders. Chiraneau piloted a VT-49 Decimator.\nChiraneau was portrayed uncredited by Mike Havord in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. In the film, Chiraneau and all other officers in his scene are depicted with a rank insignia plaque showing three red squares above three blue which denotes a commander. However, on a card released in the 2015 Imperial Assault Carrier Expansion Pack made by Fantasy Flight Games for the Star Wars: X-Wing Miniatures Game, which was also the first source to identify Chireanu in canon, the character is depicted with a plaque showing six red squares over six blue. As the rank plaques shown in Return of the Jedi have been acknowledged to be a costuming error this article treats the X-Wing Miniatures Game card to be correct. Chiraneau's name originated in the Star Wars Legends continuity, where it was first used on a card in the 2000 Death Star II Limited expansion set of the Star Wars Customizable Card Game produced by Decipher, Inc.\nProduction photos reveal that Chiraneau appeared in an additional scene made for Return of the Jedi that did not make the final cut of the film. In the scene, Chiraneau and several other Imperial officers accompany Vader as they approach the Death Star's docking bay in order to greet Galactic Emperor Sheeve Palpatine upon his arrival. Footage of Vader's arrival on the second Death Star was reused for the Sith Lord's return to the Executor from Bespin in the Special Edition release of The Empire Strikes Back. As such, Mike Havord can be seen as Chiraneau in the Special Edition version alongside other extras who portrayed Imperial officers in Return of the Jedi, however, this article assumes these to be separate characters.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chiraneau",
  "/wiki/Chiraneau/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Rear_Admiral",
  "/wiki/Imperial_Navy",
  "/wiki/Advisor",
  "/wiki/Admiral",
  "/wiki/Firmus_Piett",
  "/wiki/Pilot",
  "/wiki/VT-49_Decimator",
  "/wiki/4_ABY",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/Imperial_officer",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Commander",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Executor",
  "/wiki/Death_Squadron",
  "/wiki/Endor_system",
  "/wiki/Space_station",
  "/wiki/Hangar",
  "/wiki/ST_321",
  "/wiki/Moff",
  "/wiki/Tiaan_Jerjerrod",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Endor",
  "/wiki/Hair",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_kepi",
  "/wiki/Officer%27s_disk",
  "/wiki/Belt",
  "/wiki/Officer",
  "/wiki/Boot",
  "/wiki/Glove",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Code_cylinder",
  "/wiki/Mike_Havord",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/2015",
  "/wiki/Imperial_Assault_Carrier_Expansion_Pack",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/Star_Wars_Legends",
  "/wiki/2000",
  "/wiki/Death_Star_II_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Decipher,_Inc.",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_Lord",
  "/wiki/Bespin",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Galactic_Empire_Conversion_Kit",
  "/wiki/VT-49_Decimator_Expansion_Pack_(X-Wing:_Second_Edition)",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Category:Images_of_Chiraneau",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/July_14",
  "/wiki/2011",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars_Insider",
  "/wiki/25_Years_of_Return_of_the_Jedi!",
  "/wiki/Star_Wars_Insider_105",
  "/wiki/June_3",
  "/wiki/2003",
  "/wiki/November_12",
  "/wiki/2007"
 ]
}