{
 "name": "Chirita",
 "display_name": "Chirita",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey and beige"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "An Ewok tribe"
     ]
    }
   ]
  }
 ],
 "content": "Chirita was an Ewok female who lived in the Bright Tree Village on the Forest Moon of Endor. In 3 ABY, she participated in the fight against the Imperial Doctor Raygar's droids, although she was no match for them and was defeated.\nDuring the Ewok Warrior Games, Chirita defeated the Ewok Weechee Warrick in wrestling. Afterward, the young Wicket Warrick, who had a crush on Chirita, attempted to talk with her, suggesting that the two go on a canoe ride. However, Chirita did not take his advances seriously.\nA wokling Ewok named Malani, who had a crush on Wicket, devised a plan to make him think that she was a warrior girl just like Chirita was. However, it went awry, and Malani ended up hanging onto a tree for her life, though she was saved by Chirita. Later that day, Wicket walked up to Chirita, inquiring about the canoe ride he had discussed with her. However, Chirita went with Weechee instead.\nChirita was an Ewok female member of an Ewok tribe born in 19 BBY. In 3 ABY, she attended the Bright Tree Fête carnival on the Forest Moon of Endor. She and fellow Ewok Asha stood behind the adult Ewok Paploo as he attempted to smash a circular object by launching a piece of wood into the air with a hammer. The attempt was successful.\nDuring a battle in the Bright Tree Village on Endor, Chirita was one of several Ewoks to try and defend the village from the reconnaissance droids of the Imperial Doctor Raygar. However, she was unsuccessful, and was flung through the air, landing on four bags that were grouped together on the floor.\nAs an Ewok warrior, Chirita participated in the Ewok Warrior Games. During the Games, she wrestled the Ewok Weechee Warrick on a wooden log above a pit of mud before a large crowd. She was able to gain the upper hand, and Warrick fell into the mud, muttering in Ewokese in frustration. Chirita cried out in excitement at her victory, and performed a backflip onto a patch of grass.\nShe was immediately greeted by the young Ewok Wicket, who was the brother of Weechee. He complimented her on her performance, and Chirita thanked him. He handed her a trophy while telling her that she could add it to her Belt of Honor. She then promptly walked away from Wicket, who sighed, looking at her as she left.\nWarrick's friends, Latara and Kneesaa a Jari Kintaka, accused him of having a crush on Chirita, which he readily denied. The wokling Malani then ran up to Warrick, handing him a basket of sunberries. Wicket accepted the basket and ran it over to Chirita, who smiled politely at his offering of the berries.\nMalani, who had a crush on Warrick, devised a scheme along with her brother, Teebo, to make Warrick think she was a warrior just like Chirita. Warrick and Chirita walked by a tree where the scheme was taking place. Just as Warrick inquired about Chirita's interest in canoe rides, Teebo pretended to be stuck in the tree, while Malani climbed an adjacent tree, intending to \"save\" him. However, she, too, became stuck in a tree, becoming the one requiring help.\nShe slipped from a branch and nearly fell into the mouth of a snake, but she was instead rescued by Chirita, who swung in, hanging on a vine. She then got the snake to bite all three of its heads on a staff of hers, and she flung the staff away from the Ewoks. Chirita checked to make sure that Malani was alright. Warrick ran up to praise Chirita's actions. He then attempted to tell her about occasions that he rescued others, only to be reminded that he had already told her. Malani ran off, sobbing that Warrick continued to ignore her.\nLater that day, Warrick walked up to Chirita, asking if she was ready for their canoe ride, assuming that she had accepted his offer. She apologized, explaining that she already had a date with Weechee—her boyfriend—which Wicket found appalling. Chirita teasingly assured him that he would find another wokling to go with, and bid him goodbye. Indeed, Wicket ended up going for a short ride with Malani.\nChirita was quick to defend her village when it was attacked by Doctor Raygar. She did not take seriously the advances of Wicket Warrick, shooting him down each time he attempted to wee her. She was also quick to rescue Malani from being eaten by a snake. Instead of Wicket, she chose to go on a date with his brother, Weechee. She had grey-and-beige fur.\nChirita was a skilled warrior, but was no match for Raygar's droids. She was, however, able to successfully defeat Weechee at wrestling as well as swing in on a vine to rescue Malani. She was also capable of performing a backflip.\nChirita wore an orange cape that draped over her head and back. It had a flower on its top. She also wore a Belt of Honor.\nChirita first appeared in \"Horville's Hut of Horrors,\" the sixteenth episode in the second season of the animated television series Ewoks. The episode was written by Paul Dini and premiered on November 15, 1986. She was identified in the twenty-second and final episode of the season \"Malani the Warrior,\" which was written by Stephen Langford and premiered on December 13, 1986.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bright_Tree_Village_tribe",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Endor/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Battle_of_Bright_Tree_Village_(Imperial-Ewok_War)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Raygar",
  "/wiki/Droid/Legends",
  "/wiki/Weechee_Warrick",
  "/wiki/Youngling/Legends",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Canoe",
  "/wiki/Wokling/Legends",
  "/wiki/Malani",
  "/wiki/Tree/Legends",
  "/wiki/Death/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Bright_Tree_F%C3%AAte",
  "/wiki/Circus/Legends",
  "/wiki/Asha",
  "/wiki/Paploo/Legends",
  "/wiki/Wood/Legends",
  "/wiki/Hammer/Legends",
  "/wiki/Bright_Tree_Village",
  "/wiki/City/Legends",
  "/wiki/Imperial_Reconnaissance_Droid",
  "/wiki/Ewokese/Legends",
  "/wiki/Grass/Legends",
  "/wiki/Belt_of_Honor",
  "/wiki/Latara",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Sunberry/Legends",
  "/wiki/Berry",
  "/wiki/Teebo/Legends",
  "/wiki/Snake/Legends",
  "/wiki/Vine",
  "/wiki/Mouth/Legends",
  "/wiki/Staff/Legends",
  "/wiki/Diet/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Cape/Legends",
  "/wiki/Flower/Legends",
  "/wiki/Horville%27s_Hut_of_Horrors_(episode)",
  "/wiki/Ewoks:_Season_Two",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/Paul_Dini",
  "/wiki/November_15",
  "/wiki/1986",
  "/wiki/Malani_the_Warrior",
  "/wiki/Stephen_Langford",
  "/wiki/December_13",
  "/wiki/Category:Images_of_Chirita",
  "/wiki/Battle_for_the_Sunstar",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Publications_Timeline",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Starlog_(magazine)",
  "/wiki/Saturday_Morning_%22Star_Wars%22",
  "/wiki/A_Star_Wars_CELibration",
  "/wiki/Star_Wars_Insider_27"
 ]
}