{
 "name": "Cho_Zeh%27Bra",
 "display_name": "Cho Zeh'Bra",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Mavra Zane"
     ]
    }
   ]
  }
 ],
 "content": "Cho Zeh'Bra was a male Bith Jedi Knight who served the Jedi Order and the Galactic Republic during the decade preceding the Clone Wars.\nA Force-sensitive Bith, Cho Zeh'Bra was trained in the ways of the Force by the Jedi Order. Studying at the Coruscant Jedi Temple as an Initiate, Zeh'Bra ascended to the rank of Padawan after the Trade Federation's invasion of Naboo and the reemergence of the Sith. Assigned to a Jedi Master to continue training, Zeh'Bra constructed a blue-bladed lightsaber to wield throughout his career.\nIn response to the Sith's reappearance, the Jedi High Council opened several Jedi outposts across the galaxy for supplemental group training. Assigning Padawan Zeh'Bra to Kashyyyk, the High Council placed Jedi Master Mavra Zane in command of him and a number of other students to travel to the Wookiee homeworld aboard a Consular-class cruiser. Upon the group's arrival, the students were greeted by Grand Master Yoda the Watchman of Kashyyyk, along with Masters Mace Windu and Obi-Wan Kenobi. The Padawans settled in at the new chapter house and quickly began classes, continuing on their path to knowledge.\nDuring Zeh'Bra's time on the planet, the armies of the Commerce Guild, combined with Trandoshan slavers, attacked the planet and the Wookiee village near the chapter house. Rallying behind Masters Yoda and Zane, the apprentices repelled the Trandoshans with few casualties. Following Master Yoda's departure, the students were attacked again. This time, Master Zane and several students were captured while the chapter house and most of the apprentices were killed. Zeh'Bra, among the survivors, eventually found himself above Felucia on a Commerce Guild Providence-class carrier/destroyer. After the Padawans and Zane were freed from captivity, the Jedi escaped aboard the Star Runner and made an emergency landing on the planet below. Joining with Mak Pra and the Felucian resistance movement, Zeh'Bra and his companions attempted to capture Commerce Guild Presidente Shu Mai and prevent her from attacking Coruscant with trihexalon missiles. Thwarted in their initial attempts, the Jedi rushed to Coruscant and smashed the Commerce Guild's fleet, ending the crisis and saving Coruscant. Upon Zeh'Bra's return to the Jedi Temple, Master Zane elevated him to the rank of Jedi Knight before the assembled members of the Temple's academy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Mavra_Zane",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Canon",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_outpost/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Consular-class_cruiser",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Jedi_Watchman/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Jedi_outpost_(Kashyyyk)",
  "/wiki/Commerce_Guild/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Battle_of_Kashyyyk_(Separatist_Crisis)",
  "/wiki/Felucia/Legends",
  "/wiki/Providence-class_carrier/destroyer",
  "/wiki/Star_Runner",
  "/wiki/Mak_Pra",
  "/wiki/Felucian/Legends",
  "/wiki/Presidente/Legends",
  "/wiki/Shu_Mai/Legends",
  "/wiki/Trihexalon",
  "/wiki/Jedi_academy",
  "/wiki/Kinect_Star_Wars"
 ]
}