{
 "name": "Chodo Habat",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green-yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Telosian Restoration Project",
      "Galactic Republic",
      "Chodo Habat's herd"
     ]
    }
   ]
  }
 ],
 "content": "Chodo Habat was a male Ithorian Force Adept, and leader of the herd that oversaw the Telosian Restoration Project after the Bombing of Telos IV. He was a respected spiritual leader among his people because of his ability to feel the Force. He helped Meetra Surik regain some of her own Force-sensitivity in exchange for her help in dealing with Czerka Corporation and local Exchange boss Loppak Slusk, whose combined action of sabotage had brought the Restoration project to a halt. Eventually, his efforts made the planet's atmosphere suitable for life again, after it had been turned into acidic vapor by the Sith bombardment. Twenty other worlds would benefit from his success.\nIthorians were renowned for their ability to stabilize ecospheres. Habat sought to create new life on Telos by importing wildlife from planets rich in food chains such as Ithor, Onderon, and Dxun, but as the contract disputes with Czerka continued, and Onderon experienced the political schism split between Queen Talia's supporters and General Vaklu's, the arrangement was compromised. The Republic blockade that followed the Blockade of Onderon, in which the Ebon Hawk was attacked by Onderonian starfighters under Colonel Tobin, meant long delays for both the diplomats managing the trade, and the merchants whose beast cages were filling up the streets of Iziz since passage in and out of the city was choked by the introduction of starport visas. With Talia's triumph over Vaklu, however, Onderon remained within the Republic, and the work of Chodo could continue to rely on their natural resources.\nWhen Republic relations with Onderon began to deteriorate, increasing the purchase and transport costs of biological specimens, Czerka gained a foothold in contract negotiations for the Restoration project and wrested control of a number of Restoration Zones on the planet's surface from the Ithorians. They discovered that the surface of Telos was covered with military facilities that were either destroyed or abandoned during the Sith attack, and as part of the Republic contract, Lorso was allowed to use those resources to help fund and support the project. In the long run, if the Republic decided to start restoring other war-torn worlds, the powerful corporation hoped to integrate itself into the process and gain new markets for Czerka products. Habat himself admitted that without Meetra Surik's intervention, his herd would have had no measure of success in dealing with them.\nFor the restoration of Telos, Chodo also relied on infrastructure droids to plan and manage the project. The first, one of Aratech's G0-T0 infrastructure planning systems commissioned by Supreme Chancellor Tol Cressa in 3955 BBY, was lost the very first day it arrived on Citadel Station. The TSF conducted a thorough investigation into the matter but was unable to find the reason for its disappearance, however they excluded the droid was stolen as some among Chodo's herd suspected. Czerka was also suspected to be responsible, but in truth G0-T0 had left by its own choice. A second, somewhat lesser droid was acquired by the Ithorians to take its place, and was escorted to the Ithorian Compound by Meetra Surik at Chodo's request, before it could be stolen by Exchange thugs hired by Czerka.\nWhen Citadel Station was developing the shield network that allowed the Ithorians to purify and reseed small portions of the surface, they worked with a Zabrak ex-military engineer named Bao-Dur. Bao-Dur designed and oversaw the installation of the shield system's planet-side components, and when the Ebon Hawk was seized by the Handmaiden Sisters, Chodo told Surik to seek him out on Czerka-held Restoration Zone RZ-0031, confident that his help would have been invaluable. On the planet's surface, Bao-Dur was amazed at the work of the Ithorians, and ever upset at Czerka's attempts at destroying it. He was actually there to sabotage their operations in the hopes of driving Czerka from the Restoration Zone, which had begun deteriorating within weeks since their arrival.\nWhile Surik was still being kept under house arrest by the Telos Security Force for her involvement in the destruction of the Peragus Mining Facility, Chodo sent his primary representative, Moza, to meet her and ask for her assistance.\nSurik agreed to negotiate a truce with Loppak Slusk as well as rid Chodo's herd of Czerka. She thwarted Czerka Executive Jana Lorso, who sought to steal their latest infrastructure droid, and seized her administrative assistant B-4D4-GE3 to obtain compromising information from the Czerka mainframe for Chodo to expose to the Telosian Council. Later, Surik would save Chodo and his herd from a squad of mercenaries hired by Lorso in retaliation.\nHabat presented Surik with the heirloom of a Jedi once of his herd, a lightsaber component she would eventually use to construct her own weapon. He also allowed her to use one of their orbital shuttles to descend to the planet's surface.\nDuring the Battle of Telos IV, Chodo met Surik one last time on Citadel Station and told her of his herd's progress since Czerka's ban from contract negotiations for the Restoration project. Even as the Sith attacked, Chodo would not leave the station, but insisted Moza did for the sake of the other war-torn planets that would have need for his herd.\nNearly four thousand years later, the Chodo Habat Parkway would exist on Telos IV.\nChodo Habat was a kind and gentle being who greatly respected life. He wished dearly to see Telos filled with life again, and was worried when Czerka Corporation moved onto the station and began interfering in the restoration project. As a Force Adept, he could sense the terrible wound within Surik, and offered to heal her if she aided him.\nSurik complied, and Chodo did as he promised, and also presented Surik with a component from a lightsaber belonging to a Jedi from his herd.\nIf the player sides with Jana Lorso, then Chodo and Moza will refuse to speak with them. It is possible, however, to work for Chodo yet still smuggle some of his possessions to Samhan Dobo, the Exchange smuggler on Citadel Station.\nSurik would have received the first fixture for her lightsaber from Lorso instead of Chodo, if she sided with Czerka.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Telosian_Restoration_Project",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Chodo_Habat%27s_herd",
  "/wiki/Force_Adept",
  "/wiki/Bombing_of_Telos_IV",
  "/wiki/The_Force/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Exchange",
  "/wiki/Loppak_Slusk",
  "/wiki/Planet/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Ithor/Legends",
  "/wiki/Onderon/Legends",
  "/wiki/Dxun/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Talia_(Onderon)",
  "/wiki/General/Legends",
  "/wiki/Vaklu",
  "/wiki/Blockade_of_Onderon",
  "/wiki/Ebon_Hawk",
  "/wiki/Starfighter/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Tobin_(Human)",
  "/wiki/Iziz/Legends",
  "/wiki/Starport_visa",
  "/wiki/Jana_Lorso",
  "/wiki/G0-T0",
  "/wiki/Droid/Legends",
  "/wiki/Aratech_Repulsor_Company/Legends",
  "/wiki/G0-T0_infrastructure_planning_system",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Tol_Cressa",
  "/wiki/3955_BBY",
  "/wiki/Citadel_Station",
  "/wiki/Telos_Security_Force",
  "/wiki/Citadel_Station_Ithorian_Compound",
  "/wiki/Bao-Dur",
  "/wiki/Zabrak/Legends",
  "/wiki/Handmaiden_Sisters",
  "/wiki/RZ-0031",
  "/wiki/Peragus_Mining_Facility",
  "/wiki/Moza",
  "/wiki/Skirmishes_on_Citadel_Station",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Canon",
  "/wiki/B-4D4-GE3",
  "/wiki/Telosian_Council",
  "/wiki/Skirmish_in_the_Ithorian_Compound",
  "/wiki/Jedi/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Ministry-class_orbital_shuttle",
  "/wiki/Battle_of_Telos_IV",
  "/wiki/Chodo_Habat_Parkway",
  "/wiki/Samhan_Dobo",
  "/wiki/Smuggler/Legends",
  "/wiki/Jedi%E2%80%94The_Dark_Side_2",
  "/wiki/The_New_Essential_Guide_to_Droids",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Telosian_Jedi_Academy",
  "/wiki/Atris",
  "/wiki/Iziz_Starport",
  "/wiki/Beast_Riders",
  "/wiki/Captain/Legends",
  "/wiki/Riiken",
  "/wiki/Telos_IV",
  "/wiki/Residential_Module_082"
 ]
}