{
 "name": "Chop'aa Notimo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "2 BBY",
      "Bespin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Confederacy of Independent Systems",
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Chop'aa Notimo, a Human male, was a Mandalorian mercenary who fought for the Confederacy of Independent Systems during the Clone Wars. After the end of the conflict, he briefly joined the Black Sun criminal organization before striking out on his own. Notimo took over criminal operations in the Bespin system, including the Cloud City mining colony. As an underworld kingpin, he employed a number of henchmen, including his second-in-command, the Gungan bounty hunter Kleef. In 2 BBY, Notimo kidnapped Senator Garm Bel Iblis on Cloud City, but was confronted shortly afterward by Darth Vader's Sith apprentice, Starkiller, who was searching for the Senator. Notimo engaged Starkiller in battle using his personal Basilisk war droid, but he was unable to defeat his opponent and was killed.\nChop'aa Notimo was a Human male Mandalorian who operated as a mercenary during the Clone Wars, working for the Confederacy of Independent Systems. He did so because he believed that the Galactic Republic's clone troopers—cloned from the Mandalorian bounty hunter Jango Fett—were abominable corruptions of the Mandalorian legacy. After the Clone Wars ended, Notimo joined the Black Sun criminal organization, quickly rising through its ranks. He eventually left Black Sun and began to operate on his own, proving himself a cunning underworld leader.\nNotimo took control of several criminal operations in the Bespin system, including those located in the underlevels of Cloud City, an under-construction mining colony floating over the gas giant Bespin. Around that time, Notimo also met the Gungan bounty hunter Kleef and hired him to train the rest of Notimo's forces. Kleef eventually became Notimo's most trusted lieutenant and second-in-command. At some point in his life, Notimo lost his right eye and was left with prominent scars on his face. He also acquired a Basilisk war droid, based on the design of the ancient war mount used by the Mandalorian Crusaders of the past.\nIn 2 BBY, Notimo's forces assaulted Cloud City and engaged in battle against the Bespin Wing Guard led by Cloud City's computer liaison officer, the cyborg Lobot. Senator Garm Bel Iblis, who was present on the mining colony at the time of the attack, went to the loading bays to negotiate with Notimo regarding the cessation of hostilities. Notimo, however, dispatched bounty hunters to capture Bel Iblis; Kleef succeeded in the task and brought the Senator before him. Simultaneously, the Dark Lord of the Sith Darth Vader's secret apprentice, Starkiller, arrived on Cloud City in search of Bel Iblis in order to enlist his support in the organization of the resistance against Emperor Palpatine.\nStarkiller made his way through Cloud City, killing Notimo's henchmen, including Kleef, and eventually reached the chamber where Notimo was holding Bel Iblis hostage. Already expecting his arrival, Notimo attacked Starkiller using his two-pronged electrostaff, backed by two of his Mandalorian guards equipped with jetpacks. The Sith apprentice killed the two Mandalorians, and Notimo used a remote control built into his armor to call in his Basilisk. In the midst of the battle, Starkiller managed to jump aboard Notimo's mount, and the two engaged in a duel. Finally, Starkiller used the Force to rip the Basilisk apart, throwing it into a wall. Emerging from the burning rubble of the destroyed machine, Notimo attacked his foe on foot, only to be fatally slashed across the chest by the aspiring Sith. Following Notimo's death, Bel Iblis joined Starkiller's cause, and they left Cloud City to rendezvous with other rebel leaders—Bail Organa and Mon Mothma—on the planet Corellia.\nA cunning underworld kingpin who was described succinctly as immoral \"scum\" by Starkiller's companion, Jedi Master Rahm Kota, Chop'aa Notimo took pride in his Mandalorian heritage. He was disgusted by the clone troopers used by the Republic and considered them a disgrace to the Mandalorian culture, a hatred that led him to fight for the Confederacy of Independent Systems during the Clone Wars. Notimo was a professional criminal who quickly gained prominence in the Black Sun organization. After recruiting Kleef, Notimo came to trust the Gungan completely. Later, Notimo was determined to keep Bel Iblis as his prize, and Kota believed that there was no diplomatic way to convince him to let the Senator go.\nNotimo had black facial hair, brown eyes—one of which was missing—and light skin. Despite lacking one eye, Notimo was a vicious and capable combatant, although he did not always fight fairly. He wielded his electrostaff with great efficiency and was able to slam it into the ground and create shockwaves that knocked down his opponents off of their feet. Notimo was confident in his abilities, constantly taunting Starkiller during their duel and stating that he would kill him.\nIn addition to his staff, Notimo made use of his personal Basilisk war droid, armed with three powerful repeating blasters and low-atmosphere repulsorlifts that allowed it to hover during combat. The Basilisk possessed a rudimentary droid brain and was capable of operating in almost any environment, even in the vacuum of space. Notimo's armor had a built-in remote control for the droid.\nChop'aa Notimo was created by Krome Studios for the PlayStation 2, PlayStation Portable, and Nintendo Wii versions of the 2008 video game The Force Unleashed. In the game, he was portrayed by Billy Brown. Notimo can be unlocked as a playable character skin during gameplay via the NOTIMO cheat code. When he is selected for use, however, cutscenes are disabled.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/2_BBY/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Bespin_system/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Mining/Legends",
  "/wiki/City/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Kleef",
  "/wiki/Rescue_of_Garm_Bel_Iblis",
  "/wiki/Senator/Legends",
  "/wiki/Garm_Bel_Iblis/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Galen_Marek",
  "/wiki/Basilisk_war_droid/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Time/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Mandalorian_Crusaders",
  "/wiki/Bespin_Wing_Guard/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Lobot/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Electrostaff/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Mandalorian_armor/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Corellian_Treaty",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Rahm_Kota/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Repeating_blaster/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Droid_brain/Legends",
  "/wiki/Vacuum/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Krome_Studios",
  "/wiki/PlayStation_2",
  "/wiki/PlayStation_Portable",
  "/wiki/Wii",
  "/wiki/2008",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/Billy_Brown",
  "/wiki/Category:Images_of_Chop%27aa_Notimo",
  "/wiki/Star_Wars:_The_Force_Unleashed:_Prima_Official_Game_Guide",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Databank_(original)"
 ]
}