{
 "name": "Chordak",
 "display_name": "Chordak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.63 meters"
     ]
    }
   ]
  }
 ],
 "content": "Chordak was the Rodian owner and pilot of the Oo-Ta Goo-Ta. Commonly an independent merchant, he also worked as a pirate and slaver, even if he did not enjoy violence as much as most Rodians.\nBorn in Rodia and raised in the traditional Rodian culture of his species, Chordak discovered that he was less prone to senseless violence than his environment would have liked. Leaving his homeworld, Chordak eventually ended up in the Minos Cluster in command of one of the fastest ships in the area, the modified CEC YT-1300 light freighter Oo-Ta Goo-Ta.\nOften he played pirate and ambushed his fellow tramp freighter captains. Using his superb demolition skills he rigged his target with explosives and then follow them through hyperspace until reaching a remote area. He then triggered the bomb, crippling the ship and leaving them stranded.\nAt some point, Chordak encountered Sasnak Toxis, a spy working for the Alliance to Restore the Republic. Eventually they became enemies.\nSome years before 2 ABY, Chordak traveled to Corulag on the intent of selling two dozen slaves to the Mytaranor Slaving Council. He met with Mytaranor leader Talas Piran. Unfortunately for them, the transaction was witnessed by Toxis and his allies, Rebel Alliance officers Alton Lochner and Derembus Sitnalta. Toxis even recognized one of the slaves as a person he liked, so he went berserk and attacked the slavers. The fight was only interrupted by the arrival of the prefect, with the Rebels escaping, but by then the slaves had escaped. Toxis regretted having lost a chance to get even with Chordak.\nChordak was physically average for a Rodian in most respects, except for having a snout just a bit longer and skin a shade darker than average. Mentally however, he was different than the average Rodian—while most Rodians had no problem with killing for the sake of killing, Chordak had little taste for it. Still, while more cultured than the average Rodian, Chordak had no problem in engaging in a little violence, and he was unyielding.\nHis personal gear included a blaster pistol, four grenades and the Oo-Ta Goo-Ta. By building on the Oo-Ta Goo-Ta's reputation for speed, he hoped to come to the attention of the Galactic Empire and receive more valuable Imperial assignments such as transporting diplomats and messengers or the regular prison run to Gesaril.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodia/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Pilot/Legends",
  "/wiki/Oo-Ta_Goo-Ta",
  "/wiki/Merchant/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Species/Legends",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Corellian_Engineering_Corporation/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Tramp_freighter",
  "/wiki/Captain/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Sasnak_Toxis",
  "/wiki/Spy/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Corulag/Legends",
  "/wiki/Mytaranor_Slaving_Council",
  "/wiki/Talas_Piran",
  "/wiki/Officer/Legends",
  "/wiki/Alton_Lochner",
  "/wiki/Derembus_Sitnalta",
  "/wiki/Prefect/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Gesaril",
  "/wiki/Galaxy_Guide_6:_Tramp_Freighters",
  "/wiki/Galaxy_Guide_6:_Tramp_Freighters_(Second_Edition)",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/Pirates_%26_Privateers"
 ]
}