{
 "name": "Choster",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  }
 ],
 "content": "Choster was a Twi'lek male engineer who lived during the Galactic Civil War. He had a sister, Sheeli.\nIn his youth Choster tried to make a fortune by forging famous holopaintings. He wasn't very successful, but learned basic facts about the color spectrum. Years later he got stranded on Tatooine in the Outer Rim Territories, where he was befriended by a drunk Rodian. From him, Choster learned a lot of Tatooine-themed jokes that he later transferred into the AI of a security system he created.\nChoster later traveled to the desert planet Lok, where he was hired by the Sulfur Lake Pirates. The pirates realized they had foolishly named themselves after the lake where they had situated their \"hidden lair.\" In light of this, Choster was tasked with boosting their defenses around the base, after numerous enemies had deduced their location. After Choster established the security systems, the pirates decided it would be easier or safer to merely kill him, rather than pay him. Choster barely escaped, and was forced to change his name and find an image designer to change his appearance.\nSome time later, a retired Choster came back to Nym's Stronghold, where he found solace in passing his time at the local cantina. Eventually, a spacer working for Nym, the leader of the Lok Revenants, sought out Choster, asking him for information concerning the lair's defenses. Choster gladly helped out the spacer, by providing him with essential information regarding how to bypass the security system. With this information, a group of spacers working for the Lok Revenants successfully raided the Sulfur Lake Pirate Hideout.\nEventually, Nym attempted to broker a peace between the Lok Revenants and the Sulfur Lake Pirates. The pirates agreed, only under the condition that they hand over Choster. The pirates threatened that if the spacer and Nym did not hand over Choster, they would kill his sister Sheeli instead, whom they had in captivity. After a fierce battle between a group of spacers and the Sulfur Lake Pirates, it was eventually agreed that Choster's sister could be released, and Choster himself would not need to be handed over. However, a peace between the two factions would not occur any time soon.\nChoster was a Non-Player Character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Choster was added to the game as part of the so-called \"Nym's Theme Park,\" released with the \"Publish 3\" on October 8, 2003. Choster's species used to be randomly generated, but his appearance was permanently set to be that of a male Rutian Twi'lek after Nym's Theme Park was revamped with the release of the \"Game Update 16\" on March 23, 2010.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Engineer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Sheeli",
  "/wiki/Holopainting",
  "/wiki/Tatooine/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Artificial_intelligence/Legends",
  "/wiki/Lok/Legends",
  "/wiki/Sulfur_Lake_Pirates",
  "/wiki/Pirate/Legends",
  "/wiki/Sulfur_Lake",
  "/wiki/Sulfur_Lake_Pirate_Hideout",
  "/wiki/Death/Legends",
  "/wiki/Image_Designer",
  "/wiki/Nym%27s_Stronghold",
  "/wiki/Stronghold_Cantina",
  "/wiki/Spacer/Legends",
  "/wiki/Nym/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/October_8",
  "/wiki/March_23",
  "/wiki/2010",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures"
 ]
}