{
 "name": "Christina_Starspeeder",
 "display_name": "Christina Starspeeder",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Obroa-skai"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Christina Starspeeder was a Human girl from Obroa-skai. She attended the Jedi academy based at the Jedi Temple on Coruscant and was one of its top-performing students. Christina had a younger brother named Victor Starspeeder who began attending in a later year than her. Though outwardly she seemed embarrassed by her brother, she helped and trained him in private and tried to give him advice to succeed in fitting into the academy and doing well academically. For his part, Victor acted sometimes as if he couldn't stand her, but secretly hero-worshipped her.\nChristina Starspeeder was born on Obroa-skai, a couple of years before her brother, Victor Starspeeder.\nChristina attended the Jedi academy based at the Jedi Temple on Coruscant and became one of its top-performing students. A student named Zachary O'Halleran had romantic feelings for her and asked her out, but she disapproved of his antagonistic and cunning nature and refused him.\nEventually, Victor began attending in a later year than her. Though outwardly she seemed embarrassed by her brother, she helped and trained him in private and tried to give him advice to succeed in fitting into the academy and doing well academically. For his part, Victor acted sometimes as if he couldn't stand her, but secretly hero-worshipped her. She was appalled that Zachary was using Victor to get closer to her, but when Victor realized the truth, she saved him from Zachary's wrath by shoving him against a locker.\nThe following year, Christina encountered her father Krio Vin on Coruscant. She gave evidence against him, assisting the Jedi while pretending to serve him with loyalty and faith. On one occasion, Victor saw her speaking with Vin, but she sensed him coming and Force-pushed him away. She joined Victor when he attacked the academy outright, where Mr. Zefyr revealed her duplicity to the enemy. She was awarded a medal for her bravery and intellect.\nChristina graduated and began a new training course at a new academy. A year after Vin's defeat, she attended Victor's graduation.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Obroa-skai/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Victor_Starspeeder",
  "/wiki/Standard_year",
  "/wiki/Special:EditPage/:Christina_Starspeeder",
  "/wiki/Zachary_O%27Halleran",
  "/wiki/Edward_Starspeeder",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Christina_Starspeeder",
  "/wiki/Jedi_Academy:_A_New_Class",
  "/wiki/Jedi_Academy:_The_Force_Oversleeps",
  "/wiki/Jedi_Academy:_The_Principal_Strikes_Back",
  "/wiki/Jedi_Academy:_Revenge_of_the_Sis",
  "/wiki/Jedi_Academy:_Attack_of_the_Furball",
  "/wiki/Jedi_Academy:_At_Last,_Jedi",
  "/wiki/StarWars.com"
 ]
}