{
 "name": "Christya",
 "display_name": "Christya",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Christya was a Human female who met the Galactic Republic soldier Revan in the Upper City Cantina on the planet Taris in 3956 BBY. After being impressed by Revan's pazaak skills, Christya offered to buy him drinks. Revan accepted, but as Christya made her way to the bar, she met a Tarisian noble and left the cantina with him instead.\nChristya was a Human female who lived around the time of the Jedi Civil War. She was present on the Outer Rim Territories planet Taris when the Sith invaded the planet in 3956 BBY.\nDuring her time on Taris, Christya conversed with the Galactic Republic soldiers Revan and Carth Onasi in the Upper City Cantina, telling them about her interest in pazaak. Christya was impressed when Revan defeated Niklos, a local pazaak champion, in a match, praising Revan's wealth and good looks. She suggested that they go to the bar and buy some drinks for twenty credits. Revan handed her the money eagerly, and Christya began to move to the bar, telling him not to take too long. However, on her way through the cantina, Christya met a Tarisian noble, and ignoring her deal with Revan, she began flirting with him. Although Revan attempted to interrupt, she eventually left the cantina with the noble to go to his mansion, leaving Revan twenty credits short.\nChristya felt exhilarated when watching pazaak, praising the game's players, depth, and stakes. She enjoyed the company of rich and prominent men, such as nobles, but found poorer men uninteresting. She was used to life's luxuries and expected men to provide her with nothing less. Christya also described herself as an impatient woman. She had blonde hair, brown eyes, and light skin.\nChristya appeared as a non-player character in the Star Wars: Knights of the Old Republic video game, in which the player, Revan, can interact with her. However, the nature of the interaction is such that it does not progress any plot, nor does it change the player's alignment. Therefore, it is undetermined whether Revan ever spoke with Christya, and, if so, what form the conversation took.\nIf Revan is female, there is no option to buy drinks with her. It is also possible to refuse to give her any credits, in which she will instantly become uninterested, and go into the bar anyway and meet the noble. The same dialogue will play out, only Revan will not have lost 20 credits.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_soldier",
  "/wiki/Revan/Legends",
  "/wiki/Upper_City_Cantina",
  "/wiki/Planet/Legends",
  "/wiki/Taris/Legends",
  "/wiki/3956_BBY",
  "/wiki/Pazaak/Legends",
  "/wiki/Unidentified_Tarisian_noble",
  "/wiki/Cantina/Legends",
  "/wiki/Time/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Destruction_of_Taris",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Carth_Onasi",
  "/wiki/Niklos",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Noble/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Video_game",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide"
 ]
}