{
 "name": "Chrysalla",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ventooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ventooinan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Chrysalla was Tieress of the planet Ventooine for a period during the reign of the Galactic Empire, as the favored ward and lover of the reigning Satab. Although granted a life of luxury, Chrysalla was disturbed by the Satab's cruelty, beginning an affair with offworlder Han Solo and taking the side of the Corellian when the Satab plotted against him. Chrysalla ultimately helped Solo defeat and vanquish the Satab—however, having touched the Shadeshine, a sense-enhancing mineral that doomed those who used it to death within a year, Chrysalla was forced to enter suspended animation.\nA female member of the Near-Human Ventooinan species, Chrysalla grew up a peasant on the streets of the planet Ventooine, living a hand-to-mouth existence for most of her youth. That changed when she came to the attention of the Satab, Ventooine's ruler—Satabs were replaced every year, as their use of the powerful sense-enhancing mineral known as the Shadeshine forced them to retreat to suspended animation or face agonizing death. The Satab took Chrysalla in as his Tieress, a favored ward and lover who received a pampered life at court in exchange for her company. Chrysalla enjoyed a high level of comfort and luxury as Tieress, but was the subject of the ire of much of the common folk, who resented the Satab's ill treatment of Ventooine's underclass.\nOn one occasion, Chrysalla was traveling through the streets when she was the target of an assassination attempt by Ventooinan rebels—the plot was foiled by a Human offworlder, Han Solo, a smuggler who had traveled to Ventooine looking to acquire rare sansanna spice. Immediately attracted to the dashing Corellian, Chrysalla pledged her undying gratitude to Solo, and brought him back to the Satab's palace to introduce him to Ventooinan society. The two became lovers shortly after, but Chrysalla was stunned to later hear that the offworlder had become the court's choice for the next Satab. Choosing to protect Solo from their schemes rather than side with a Satab she resented for his cruelty, Chrysalla foiled their attempts to get Solo to touch the Shadeshine, revealing that she herself had previously touched the Shadeshine and had powers of her own.\nAlthough Chrysalla's powers were insignificant against that of the Satab's, the Satab soon became overwhelmed by his own powers, and died before being able to reach suspended animation in the Hall of Satabs. Knowing the effects of the Shadeshine would eventually overtake her as well, Chrysalla promptly opted to enter the Hall of Satabs herself, promising to dream of her lover Solo as she awaited a future where her condition could be cured.\nAlthough Chrysalla, who grew up in poverty, appreciated the easy life she had courtesy of the Satab's favor, she struggled to decide whether or not the exchange was worth it—she had a considerable distaste for the man himself, thinking him cruel. Instead, Chrysalla had dalliances of her own, observed by the Satab but tolerated as he enjoyed her companionship. Chrysalla ultimately develoed a strong attraction to Han Solo, and sided with the Corellian over the Satab, feeling the need to protect the unwitting Solo from their plots to entrap him into being the next Satab.\nChrysalla appeared in Star Wars Annual  2, written by David Michelinie, illustrated by Carmine Infantino and released in 1982.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ventooine/Legends",
  "/wiki/Ventooinan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Tieress",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Satab_(individual)",
  "/wiki/Han_Solo/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Shadeshine",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Suspended_animation/Legends",
  "/wiki/Near-Human",
  "/wiki/Species/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Human/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Sansanna_spice/Legends",
  "/wiki/Hall_of_Satabs",
  "/wiki/Star_Wars_Annual_(1977)_2",
  "/wiki/David_Michelinie",
  "/wiki/Carmine_Infantino",
  "/wiki/1982"
 ]
}