{
 "name": "Chubbray",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown and white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree tribe"
     ]
    }
   ]
  }
 ],
 "content": "Chubbray was an Ewok male of the Bright Tree tribe who lived in Bright Tree Village on the moon of Endor. In 4 ABY, Chubbray was part of a scouting party led by fellow Ewok Teebo that captured a group of rebels and brought them back to the village, where they were ultimately accepted into the tribe.\nThe Ewoks agreed to help the rebels fight the Galactic Empire, and Chubbray was among the Ewoks who attacked Imperial forces outside of a nearby bunker. During the fighting, Chubbray survived being thrown to the floor by fire from an All Terrain Scout Transport and then joined a catapult crew launching stones at the walkers. The rebels and Ewoks eventually managed to destroy the bunker and claim victory over the Empire.\nChubbray was a Ewok male who was a member of the Bright Tree tribe, a tribe of Ewoks that inhabited the treetop Bright Tree Village on the forest moon Endor during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. In 4 ABY, he was part of a scouting party led by the hunter Teebo that descended into the forest and set a trap using the corpse of a verkle before hiding nearby. As they waited, the Wookiee Chewbacca, a rebel who was on the moon as part of the fight against the Galactic Empire, approached the bait to investigate, followed by his allies Han Solo, Luke Skywalker, C-3PO, and R2-D2. Despite the advice of his allies, Chewbacca tried to take the meat and caused a large net to be pulled up around them, leaving the captured rebels hanging suspended in the air. After R2-D2 cut them free, causing them to drop back to the forest floor, Chubbray and the other Ewoks slowly emerged with their weapons drawn from the ferns around the group.\nThe Ewoks disarmed Chewbacca and closed in on Solo as he drew his blaster, but were shocked when C-3PO rose from the ground. Due to the droid's golden plating, the Ewoks mistook him for a deity known as the \"Golden One,\" and so Chubbray and the others began chanting in reverence and bowing before him. When C-3PO refused to take advantage of this misconception, Solo moved to grab him, causing the Ewoks to cease their chanting and quickly raise their weapons at Solo again. Solo apologized, but he and the other rebels, bar C-3PO, were tied up and then carried back to the village. At the village, the rebels convinced the Ewoks to free them and were ultimately accepted as members of the tribe, after which the Ewoks agreed to aid them in fighting the Empire and destroying the nearby Imperial Endor shield generator bunker.\nThe Ewoks then marched with the rebels to the bunker, where the rebels successfully infiltrated the structure while Chubbray and the other Ewoks remained in the forest nearby. The rebels however, had fallen into another trap, and soon found themselves forced to surrender outside the bunker's back entrance when they were surrounded by Imperial forces. After C-3PO and R2-D2 lured some of the Imperial stormtroopers out among the trees, the Ewoks ambushed the Imperial forces from all sides and with the captive rebels also attacking things quickly devolved into chaotic fighting throughout the area. During the fighting, Chubbray and another Ewok were thrown to the ground by blaster fire from an Imperial All Terrain Scout Transport, but he survived and fled through the undergrowth from advancing stormtroopers.\nAfter fleeing from another walker, Chubbray then joined a crew manning a catapult and helped pull the rope to active the weapon and hurl a rock at one of the All Terrain Scout Transports, stumbling back into the ferns behind him as it launched. The walker opened fire on the catapults, causing many of the crews to flee. Chubbray and several other Ewoks then returned to the bunker's rear entrance, where they attacked a trio of stormtroopers from behind and beat them to the ground. As All Terrain Scout Transports continued to destroy the Ewok's catapults, Chubbray then fled away from one of the wrecked projectile launchers. The tide of the battle turned once Chewbacca and two Ewoks managed to capture a walker and turned it against the other vehicles, after which the rebels successfully destroyed the bunker. This allowed an Alliance Fleet to destroy the Empire's Death Star II battle station above Endor and defeat the Imperial forces, after which the Ewoks and rebels celerbrated their victory together into the night.\nChubbray had light skin, brown eyes, and brown fur with a white streak across his face.\nChubbray wore a brown hood and used a spear while in Teebo's scouting party. While fighting Imperials, Chubbray initially used a stone club and then a large piece of wood as a bludgeon.\nChubbray was portrayed by Kevin Thompson in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chubbray",
  "/wiki/Chubbray/Legends",
  "/wiki/Special:Upload",
  "/wiki/Ewok",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bright_Tree_tribe",
  "/wiki/Bright_Tree_Village",
  "/wiki/Moon",
  "/wiki/Endor",
  "/wiki/4_ABY",
  "/wiki/Scout",
  "/wiki/Teebo",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Endor",
  "/wiki/Galactic_Empire",
  "/wiki/Endor_shield_generator_bunker",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Catapult",
  "/wiki/Walker",
  "/wiki/Tree",
  "/wiki/Forest",
  "/wiki/Galactic_Civil_War",
  "/wiki/Verkle",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Han_Solo",
  "/wiki/Luke_Skywalker",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/Foodstuff",
  "/wiki/Fern",
  "/wiki/Han%27s_heavy_blaster_pistol",
  "/wiki/Droid",
  "/wiki/Deity",
  "/wiki/Golden_One",
  "/wiki/Stormtrooper",
  "/wiki/Blaster",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/Standard_day",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Spear",
  "/wiki/Kevin_Thompson",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}