{
 "name": "Chugg",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Reigat"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Pits"
     ]
    }
   ]
  }
 ],
 "content": "Chugg was a male Reigat who served as the personal bodyguard to Kaylo NaKuda as well as serving as the bouncer to the bar on Stend VI known as The Pits.\nChugg started his career as a speeder racer as part of Team NaKuda, a racing team sponsored by the Herglic crime lord Kaylo NaKuda. He was in a terrible crash that he barely survived. NaKuda nursed him back to health and in return Chugg pledged his loyalty to the crime lord. NaKuda employed him as his bodyguard and security for his garage, Kuda's Compound, and the bouncer for the adjoining bar The Pits.\nAs a male Reigat, Chugg looked very intimidating. He had gray mottled skin and dark blue lips, eyelids, and hair. He was very heavily muscled on par with a Gamorrean or a Wookiee. He was fanatically loyal to Nakuda and was willing to even die for the crime boss.\nBefitting a bodyguard and bouncer, Chugg was ferocious with his fists and used his strength to manhandle his opponents. He was also decent with blasters and throwing knives. His accident seemed to severely decrease his mental capacity. Despite his history he was untalented in swoop racing which may have been a side effect of his accident. He was very intimidating when he wanted to be.\nChugg carried around a small arsenal at all times. This included a heavy blaster pistol, a hold-out blaster, two vibroknives and a triple-headed vibro-ax.\nChugg was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. He was illustrated by Greg Smith.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Reigat",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/The_Pits_(cantina)",
  "/wiki/Bodyguard/Legends",
  "/wiki/Kaylo_NaKuda",
  "/wiki/Bouncer_(occupation)/Legends",
  "/wiki/Bar",
  "/wiki/Stend_VI",
  "/wiki/Speeder/Legends",
  "/wiki/Team_NaKuda",
  "/wiki/Herglic/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Kuda%27s_Compound",
  "/wiki/Gamorrean/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Vibroknife",
  "/wiki/Vibro-ax/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Greg_Smith"
 ]
}