{
 "name": "Chussido",
 "display_name": "Chussido",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Nevarro"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cloud-Riders",
      "Bounty Hunters' Guild"
     ]
    }
   ]
  }
 ],
 "content": "Chussido was a Rodian female who served as a member of Enfys Nest's Cloud-Riders gang. In 10 BBY, Chussido was amongst the Cloud-Riders who traveled to the planet Savareen with Nest in order to try and acquire coaxium fuel from a crew of criminals working for the Crimson Dawn syndicate. Nest successfully convinced all of the crew bar its leader, Tobias Beckett, to aid her and the others in stealing the coaxium from Crimson Dawn and killing the syndicate's leader, Dryden Vos.\nChussido and the other Cloud-Riders then laid a trap, while the outlaw Han Solo and his allies took the coaxium to Vos on his yacht, the First Light. Believing the coaxium Solo had brought him to be fake, Vos sent his mercenaries out to capture Nest and her allies, who he believed had the real coaxium. Chussido and the other Cloud-Riders then ambushed the mercenaries and defeated them, allowing Solo and his allies to kill Vos. Solo then returned the coaxium to Nest, Chussido and the other Cloud-Riders.\nChussido joined the Bounty Hunters' Guild sometime after serving the Cloud-Riders, where she resided in a cantina on Nevarro. She was killed while attempting to reclaim The Child from The Mandalorian.\nChussido was a Rodian female who joined up with the rebellious Cloud-Riders gang under the leadership of Enfys Nest after her homeworld was brutalised by one of the Five Crime Syndicates. In 10 BBY, Nest led a small group of the Cloud Riders in an attempt to steal a shipment of coaxium fuel from the Galactic Empire on the planet Vandor; however, their plans were thwarted by a crew of criminals led by Tobias Beckett and associated with the Crimson Dawn syndicate, who also attempted to steal the coaxium and destroyed it in the process.\nDetermined to obtain coaxium for use against the Empire, Nest then monitored the surviving members of Beckett's crew and learned that they had stolen raw coaxium from a mine on the planet Kessel and were headed to the planet Savareen to refine it. Nest, Chussido and the other Cloud-Riders then headed to Savareen to try and claim the coaxium.\nOnce the refinement process had begun at the Bis Refinery, Chussido stood with Nest and the others as they confronted the criminals in a village near the refinery. The Cloud-Riders initially kept their blasters aimed at the criminals, but after Nest removed her helmet the two groups moved inside a local bar to talk. Nest explained what Crimson Dawn and the syndicates had done to Chussido and her companions' homeworlds, as well as their crimes against the local population of the village, and tried to convince Beckett and his followers to hand over the coaxium to them rather than let it be used by the syndicates and their ally, the Empire.\nThe speech failed to convince Beckett, but did persuade the outlaw Han Solo to help them. He worked out a plan with the Cloud-Riders and the rest of Becket's crew which would allow them to kill Crimson Dawn's leader, Dryden Vos, who was headed to Savareen to collect the coaxium. The plan involved Chussido and the other Cloud-Riders giving their helmets to the residents of the village, who could then act as decoys for them. Solo then told Beckett, who he suspected would betray them, that they were going to hand fake coaxium over to Vos.\nSolo and his allies then brought the real coaxium with them to Vos's yacht, the First Light, while Chussido and the other Cloud-Riders set up an ambush in the village using their local doppelgangers and empty coaxium containers as bait. As expected, Beckett betrayed his companions and informed Vos that the coaxium was fake, causing the crime lord to send out his force of mercenaries led by Aemon Gremm to capture the Cloud-Riders, whom he assumed had the real coaxium. The mercenaries surrounded the disguised villagers, but quickly discovered that they did not possess the coaxium.\nNest then launched an ambush on the unsuspecting mercenaries, and Chussido rushed forward from hiding and kicked a mercenary to the ground. She then knocked another mercenary to the ground with stock of her blaster, and aimed it at him before he could get up. The remaining mercenaries were quickly subdued or killed, leaving Vos with no back up on the First Light. Solo and his allies then killed Vos and Beckett, before returning the real coaxium to Nest, Chussido and the other Cloud-Riders, who loaded the coaxium onto their speeder bikes. Chussido and the others then mounted their vehicles, waiting for Nest to launch first before taking off behind her and leaving for a rendezvous they had to keep with the Onderonian rebel Saw Gerrera, to whom they gave the coaxium.\nChussido eventually joined the Bounty Hunters' Guild alongside fellow Cloud-Rider Auromae Iselo. Around 9 ABY, she and Iselo spent time in a cantina on Nevarro filled with members of the guild, including its agent, Greef Karga. While at the cantina, the bounty hunter known as the Mandalorian arrived to meet with Karga and deliver four bounties he had collected. Chussido was at the bar when the Mandalorian entered, and began speaking with a human there. She then sat at one of the tables with a different human.\nChussido and all the other hunters accepted a bounty from a man known as the Client, who was associated with an Imperial remnant and wished for a Force-sensitive infant to be brought to him. Chussido was unable to capture the bounty, as the Mandalorian managed to successfully deliver the Child first, earning much resentment from her and other members of the Guild.\nWhen the Mandalorian had a change of heart and rescued the Child from the Imperials, Chussido and every other hunter's fob reactivated. Karga then led her and the other hunters in ambushing the Mandalorian as he attempted to return to his starship, the Razor Crest. Chussido was waiting on a street corner as the Mandalorian passed and followed him, slowly surrounding him with other hunters. She and the others kept their blasters trained on the Mandalorian as he initially appeared to surrender and follow Karga's command to place the Child on a nearby speeder; however, upon reaching the speeder, the Mandalorian opened fire and took cover in the speeder.\nThe gathered hunters opened fire on the Mandalorian as he began to make a getaway in the speeder while returning fire. Karga then managed to shoot the astromech droid piloting the speeder and halted the Mandalorian's progress, allowing the other hunters to begin closing in. Chussido remained in cover behind a stack of crates with a blaster pistol aimed at the speeder, but was killed when the Mandalorian shot her with his Amban phase-pulse blaster, completely disintegrating the former Cloud-Rider. The Mandalorian ultimately escaped with the Child with aid from his Tribe of Mandalorians.\nChussido had black eyes and yellow skin. Chussido was shocked along with all the other Cloud-Riders bar Nest when Solo returned with the coaxium following the death of Beckett and Vos. While attempting to reclaim the Child under the Bounty Hunters' Guild, she used a blaster pistol.\nChussido wore a brown and red jerkin, with gray pants and boots and a brown cape. The Rodian's mask was a brown-bag like headpiece. She hung a necklace of tooth-like objects around her neck and carried a blaster rifle. The Rodian also wore red and white warpaint across her face.\nChussido first appeared in the 2018 film Solo: A Star Wars Story and was later identified in the Star Wars: Card Trader app. She was portrayed in the film by Chus Lucas.\nThe idea of a Rodian Cloud-Rider was a late addition to the film, and concept artist Jake Lunt Davies drew several initial sketches of Chussido where he focused on making her visually distinct from the Rodian Greedo. Davies also took inspiration from the Rodians seen in Star Wars Battlefront when designing the character. Concept art including Chussido titled \"Enfys Gang Group Version 5A\" was also produced by costume concept designer Adam Brockbank. The final mask used in Solo had some sculptural differences from the original and also had war paint applies to further distinguish it from Greedo.\nChussido's costume was later reused in the 2019 television show The Mandalorian. The mobile game Disney Magic Kingdoms later confirmed her appearance in the show.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/9_ABY",
  "/wiki/Nevarro",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cloud-Riders",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/File:Enfys_and_Beckett.ogg",
  "/wiki/Enfys_Nest",
  "/wiki/10_BBY",
  "/wiki/Planet",
  "/wiki/Savareen",
  "/wiki/Coaxium",
  "/wiki/Fuel",
  "/wiki/Beckett%27s_gang",
  "/wiki/Crimson_Dawn",
  "/wiki/Tobias_Beckett",
  "/wiki/Death",
  "/wiki/Dryden_Vos",
  "/wiki/Han_Solo",
  "/wiki/Yacht",
  "/wiki/First_Light",
  "/wiki/Mercenary",
  "/wiki/Nevarro_school",
  "/wiki/Incident_on_Nevarro",
  "/wiki/Grogu",
  "/wiki/Din_Djarin",
  "/wiki/File:Enfys-Allies.ogg",
  "/wiki/Homeworld",
  "/wiki/Five_Crime_Syndicates",
  "/wiki/Galactic_Empire",
  "/wiki/Vandor",
  "/wiki/Kessel",
  "/wiki/File:Enfys-Drink.ogg",
  "/wiki/Bis_Refinery",
  "/wiki/Pnakotic_Coast_village",
  "/wiki/Blaster",
  "/wiki/File:Aemon-Empty.ogg",
  "/wiki/Crime_lord",
  "/wiki/Aemon_Gremm",
  "/wiki/Stock",
  "/wiki/Speeder_bike",
  "/wiki/Onderonian",
  "/wiki/Saw_Gerrera",
  "/wiki/Auromae_Iselo",
  "/wiki/Time",
  "/wiki/Cantina",
  "/wiki/Greef_Karga",
  "/wiki/Bounty_hunter",
  "/wiki/Bounty",
  "/wiki/Mandalorian",
  "/wiki/Human",
  "/wiki/Hunt_for_Grogu",
  "/wiki/The_Client",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Force-sensitive",
  "/wiki/Heart",
  "/wiki/The_Child",
  "/wiki/Tracking_fob",
  "/wiki/Starship",
  "/wiki/Razor_Crest",
  "/wiki/Speeder",
  "/wiki/Astromech_droid",
  "/wiki/Pilot",
  "/wiki/Blaster_pistol",
  "/wiki/Amban_phase-pulse_blaster",
  "/wiki/The_Tribe",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Cape",
  "/wiki/Tooth",
  "/wiki/Blaster_rifle",
  "/wiki/2018",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Jake_Lunt_Davies",
  "/wiki/Greedo",
  "/wiki/Star_Wars_Battlefront",
  "/wiki/Adam_Brockbank",
  "/wiki/2019",
  "/wiki/The_Mandalorian",
  "/wiki/Video_game",
  "/wiki/Disney_Magic_Kingdoms",
  "/wiki/Category:Images_of_Chussido",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_6",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/The_Mandalorian_1",
  "/wiki/Chapter_3:_The_Sin",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/The_Art_of_Solo:_A_Star_Wars_Story",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Cast",
  "/wiki/Practical",
  "/wiki/Process",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY"
 ]
}