{
 "name": "Chuundar",
 "display_name": "Chuundar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3956 BBY",
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rwookrrorro",
      "Czerka Corporation",
      "Wookiee collaborators"
     ]
    }
   ]
  }
 ],
 "content": "Chuundar was a Wookiee chieftain and the son of chieftain Freyyr, and the brother of Zaalbar. Chuundar was born a runt on the planet Kashyyyk. In a bid for power and wealth, he began secretly leading Czerka Corporation operatives to Wookiee Hunters in the Shadowlands to capture and sell as slaves. His brother, Zaalbar, found out about his treachery and angrily confronted him, going so far as to attack him with his claws. Their father, bound by Wookiee tradition, had Zaalbar exiled from Kashyyyk for being a madclaw. Chuundar then began spreading rumors of Freyyr's madness, and eventually seized power from his father over the Wookiee tribe.\nHaving successfully seized power, Chuundar made an open arrangement with Czerka Corporation. He offered them free reign to exploit the resources of Kashyyyk as long as they kept the enslavement of Wookiees to a minimum. He also traded Wookiee slaves in exchange for Czerka weaponry, ensuring none of the other Wookiees would risk defying him. He had his fellow Wookiees learn Galactic Basic Standard under the pretense of understanding their enemy so they could more easily resist them, though in truth, it was to ensure they could more easily obey them.\nWhen Zaalbar, accompanied by Revan and his companions, arrived on Kashyyyk, Chuundar imprisoned his brother for not honoring his exile. Chuundar asked Revan to kill an enraged Wookiee exile in the Shadowlands beneath the planet's mighty trees that was harrassing his Czerka allies. The Wookie in question turned out to be Freyyr. Revan helped Freyyr retrieve Bacca's Ceremonial Blade, a mighty and sacred sword for the Wookiees, and then led a revolt against Chuundar and Czerka. Zaalbar tried to stop the fighting, but Chuundar refused to step down and was killed in the subsequent fighting.\nChuundar was created by David Falkner, Steve Gilmour, Casey Hudson, Drew Karpyshyn, James Ohlen, Preston Watamaniuk, and Derek Watts, and first appeared in Star Wars: Knights of the Old Republic.\nThe player also has the dark side option to side with Chuundar and kill Freyyr. If the dark side option is chosen, the Wookiee village, Rwookrrorro's gate is sealed off from the player, but the village is still accessible through the game's rapid transit system.\nChuundar's bowcaster is a unique model equipped with Czerka modifications, and it is one of the spoils of the battle if the player kills Chuundar.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/3956_BBY",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Rwookrrorro/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Wookiee_collaborators",
  "/wiki/Chief/Legends",
  "/wiki/Freyyr",
  "/wiki/Zaalbar",
  "/wiki/Shadowlands/Legends",
  "/wiki/Madclaw",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Revan/Legends",
  "/wiki/Bacca%27s_Ceremonial_Blade",
  "/wiki/Rebellion_on_Kashyyyk",
  "/wiki/David_Falkner",
  "/wiki/Steve_Gilmour",
  "/wiki/Casey_Hudson",
  "/wiki/Drew_Karpyshyn",
  "/wiki/James_Ohlen",
  "/wiki/Preston_Watamaniuk",
  "/wiki/Derek_Watts",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Chuundar%27s_bowcaster",
  "/wiki/Star_Wars:_Tiny_Death_Star",
  "/wiki/Canon",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Wookiee_Chieftain"
 ]
}