{
 "name": "Cibaba",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Azumel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Tylera"
     ]
    }
   ]
  }
 ],
 "content": "Cibaba was a male Azumel Jedi Master of the Jedi Order during the High Republic Era. Stationed on Alaris Prime, Cibaba trained the Tholothian Padawan Tylera, as well as her friend Klias Teradine. Tylera left the Jedi Order after an incident with Teradine at the Yallow Shrine, but continued to remember her old master.\nCibaba was a male Azumel who served as a Jedi Master in the Jedi Order during the High Republic Era. He took the Tholothian Tylera as his Padawan. During her apprenticeship, Cibaba taught Tylera how to construct her own lightsaber. Cibaba, along with Tylera, were stationed at the Jedi temple on Alaris Prime.\nTylera was friends with the Zeltron Padawan Klias Teradine, who was known to be arrogant and prideful. Cibaba, aware of what Teradine thought of himself, attempted to remind him that Jedi were supposed to show humility. On one occasion around 241 BBY, Cibaba found Tylera and Teradine just after Tylera had won a sparring bout against her friend. In response to Teradine commenting that it looked like Tylera was picking up some of his brilliance, Cibaba pointedly asked Teradine to remember what he had been taught about Jedi humility, but Teradine responded boastfully that he was exceptionally good at it. Tylera told Cibaba that Teradine was kidding, but quietly asked him to tell the Master that. Cibaba reassured Tylera that he knew what Teradine thought of himself, and told her that she needed to find her own path instead of imitating someone else's.\nTeradine later discovered the location of the Yallow Shrine, a sanctum of the Yallow Fellowship, an extinct sect of darksiders, and attempted to persuade Tylera to come investigate it with him. Tylera was uncertain, knowing that Cibaba would not approve, but Teradine persuaded her to come along by in part suggesting that she was too scared to do so, and further suggesting that Cibaba did not need to know.\nThe incident at the shrine led to Tylera leaving the Jedi Order and becoming a mercenary and monster hunter known as Ty Yorrick. About a decade after leaving the Order, Yorrick was reminded of Cibaba after her admin unit, KL-03, made a remark to her that reminded her of Teradine. During a hunt on Safrifa, Yorrick was reminded of her old master when she thought that he would not have approved of the spikes she had added to her lightsaber hilt during her time as a mercenary. When the Nihil pirates attacked the Republic Fair on Valo, Yorrick found herself teaming up with the Jedi Master Elzar Mann. Sharing memories in order to establish trust, Mann saw Cibaba and Teradine briefly, learning their names.\nCibaba frequently lectured Klias Teradine on his lack of humility, considering it unbefitting of a Jedi. He also encouraged his apprentice, Tylera, to find her own path instead of trying to be someone she was not. Ty Yorrick later felt that Cibaba would not have approved of the spikes she added to her lightsaber hilt during her time as a mercenary. He was a male Azumel with yellow skin and green eyes.\nCibaba was trained in the art of lightsaber construction, teaching his apprentice to build her own weapon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_2",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_3",
  "/wiki/Azumel",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Ty_Yorrick",
  "/wiki/Jedi_Master",
  "/wiki/High_Republic_Era",
  "/wiki/Alaris_Prime",
  "/wiki/Tholothian",
  "/wiki/Padawan",
  "/wiki/Klias_Teradine",
  "/wiki/Yallow_Shrine",
  "/wiki/Lightsaber",
  "/wiki/Jedi_temple",
  "/wiki/Zeltron",
  "/wiki/241_BBY",
  "/wiki/Yallow_Fellowship",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Mercenary",
  "/wiki/Admin_unit",
  "/wiki/KL-03",
  "/wiki/Safrifa",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Attack_on_Valo",
  "/wiki/Republic_Fair",
  "/wiki/Valo",
  "/wiki/Elzar_Mann",
  "/wiki/Force_vision",
  "/wiki/Eye",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_1",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Battle_of_Grizal",
  "/wiki/231_BBY",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak",
  "/wiki/Standard_month"
 ]
}