{
 "name": "Cid",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Cid was a Trandoshan female residing on Ord Mantell, where she ran a cantina called Cid's Parlor. Before Order 66, she served as an informant for the Jedi, and it was in that capacity that the ARC trooper Echo learned her name and where to find her. After Clone Force 99 defected from the Galactic Empire, they visited Cid to learn the identity of Fennec Shand, a bounty hunter who had accosted them on Pantora and attempted to kidnap the child clone Omega. In order to pay for the information, Cid had the Bad Batch rescue Muchi, a young rancor stolen by Zygerrian slavers. After the successful job, Cid paid Hunter thirty percent of the profits and revealed that Shand was an up-and-coming bounty hunter, whom Cid's sources in the Bounty Hunters' Guild stated had been hired for the job on a direct commission.\nCid, a Trandoshan female, worked as an information broker in the last years of the Republic Era. She operated out of Cid's Parlor, a cantina and gambling den in Ord Mantell City which she owned. Cid developed a working relationship with the Jedi during this time, occasionally passing them information. During the Clone Wars, the ARC trooper Echo learned of Cid and where to find her from his Jedi commanding officers, although he was unaware of her species or gender.\nIn 19 BBY, the Clone Wars ended with the near-eradication of the Jedi Order, as a result losing Cid an important portion of her business. In order to protect herself amidst the rise of the new Galactic Empire, Cid concealed her past connections to the Jedi.\nShortly after the formation of the Empire, a group of clone commandos known as the Bad Batch, who had recently defected from the new government, had a run-in with a bounty hunter who was targeting Omega, a member of their group. Echo, who had joined the squad's ranks, suggested that they track down Cid, who he assumed to be male, as she was the only one of the Jedi informants he knew of that he also knew how to find. Believing Cid could identify the bounty hunter and possibly her employer, the Batch duly travelled to Ord Mantell, heading through the streets of Ord Mantell City to Cid's cantina. Cid had recently been approached by Bib Fortuna, the majordomo of Jabba Desilijic Tiure, about locating and retrieving Muchi, a young female rancor stolen from Jabba by Zygerrian slavers. The thieves, led by Raney, had holed up in the ruins of Old Ord Mantell City.\nWhen the Batch arrived at Cid's Parlor, Echo admitted that he did not actually know who Cid was as he had never met her. Cid was working on one of the slot machines in her establishment, and Hunter approached her and asked her if she knew who Cid was. She denied it, before moving to the bar and sitting down. The Batch discussed amongst themselves what to do next, while Cid watched, as the only other people present were a Weequay and Ithorian arguing over a dejarik game. Tech, remarking on the state of the bar, suggested that \"he\" might have been arrested for violating health code regulations. Omega watched Cid while poking at a holotable, before approaching her and suggesting that she was Cid. The Trandoshan wryly remarked on Omega being more observant than her friends. Omega used her comlink to get the others' attention, telling them who Cid was.\nTaking the Bad Batch to her office, Cid lamented how beneficial her relationship with the Jedi before the rise of the Empire soured her business. As she expressed her surprise at receiving a group of clone deserters, Tech explained their motivations for deserting involved fundamental differences in ideology before an uninterested Cid cut him off, insisting they cut straight to the cut. Echo then proceed to scomp into her holoprojector to display a hologram of a helmeted Human female, whom Hunter said they encountered on Pantora. Cid was quick to identify her as a bounty hunter but had no clues to her identity. She offered to find out the stranger's identity and client if they did a favor for her; she was annoyed at how confused they were with innuendo. She assigned the Bad Batch to rescue a kid named Muchi from Zygerrian slavers based on the other side of the planet, and they would split the bounty 70-30.\nAfter the clones had departed, Cid sat down for a meal when she was contacted by Bib Fortuna, who had grown impatience with Muchi's retrieval. She brushed aside his concerns and threats, assuring the Twi'lek that her best people were on the job. Some time later, Fortuna came in person with a pair of Gamorrean guards, prompting Cid to remark at being graced by the presence of Jabba's right-hand man and continued to brush him off until they heard the roar of a rancor coming from outside, prompting them to investigate. Bringing up the rear, Cid was surprised to the Bad Batch arriving with Omega riding Muchi. After reassuring Fortuna that all was well, Cid urged him to provide the promised payment. As Jabba's entourage departed with their rancor, Cid remarked that never expected the clones to pull the rescue off. Echo criticized her for failing to mention that Muchi was a rancor, to which she claimed it slipped her mind.\nTaking Hunter back into her office to speak privately, she informed him that the bounty hunter was Fennec Shand, a cunning and ruthless newcomer, but all her sources in the Bounty Hunters' Guild could tell her was that Shand was working a direct commission. She warned that if Shand was after them, they would need friends and money, mostly the latter. She then gave Hunter the promised payment and offered to continue employing the Bad Batch. As Hunter turned to leave, Cid remarked that the Bad Batch must be valuable enough for someone to hire Shand to go after them. As this earned Hunter's concern, she assured him she was good with secrets.\nLater, as the Bad Batch decide to settle on Ord Mantell, Cid interrupted Omega's training session to inform them of a new job on Corellia, to recover a tactical droid before they're all destroyed. Though Hunter reminded they hadn't decided to work for her or not, Cid insisted they would do so regardless, reasoning they would both profit and she'd watch the squad's back, especially with the heat bearing down on them. Hunter then reluctantly agreed.\nTurning her attention to Omega, she told her the flaw with her handling of her new Zygerrian energy bow was that she wasn't building up enough strength before releasing. She briefly borrowed Omega's bow to demonstrate by shooting a target dead center thrice before handing it back.\nUnfortunately, the job did not go as planned, as another party, Trace and Rafa Martez, was also after the tactical droid head, though their motives were to aid their client in fighting the Empire rather than profit like Cid. After escaping the decommissioning facility that resulted in the droid head being destroyed, Hunter chose to turn over the copied data to the Martezes.\nCid was later hired by Roland Durand to steal a creature Omega named Ruby from the Rhokai, a task she assigned the Bad Batch. Upon their successful return, Cid dodged Echo's inquiries on what her client wanted with Ruby and was impressed with Hunter correctly guessing she only cared about getting paid. As Wrecker and Omega went out to buy Mantell Mix, Cid dealt with the other clones in her office, providing a pittance for the job. When asked by the outraged clones why they were being cheated, Cid stated that the fact they were still alive was rather generous due to the debt they owed her; the amount involved their shuttle's docking fees, port charges, gear, fuel, rations, and 20 cartons of Mantell Mix. She then admitted as fond as she is of the clones, she wasn't running a charity and suggested they find a big score to square their debt before they see her \"ugly side\". Before Cid could respond to Tech's quip about her appearance, they heard blaster fire go off in the parlor. Rushing out to investigate, they found the instigator was Captain Rex, who scared off Cid's frequent patrons, Ketch and Bolo. Annoyed at the presence of another clone, Cid made it clear she wasn't taken him in and stormed off.\nThe Bad Batch soon left Ord Mantell for Bracca after Rex realizing they still possessed their inhibitor chips to have them removed. Subsequently, they contacted Cid for information on Cad Bane, who had abducted Omega on Bracca. Though aware of Bane's reputation, Cid had no clues as to his present whereabouts.\nUpon the Batch's successful rescue of Omega, Cid offered the group a job to rescue Senator Avi Singh from Imperial prison on Raxus Secundus. Hunter initially refused the mission, and when Cid reminded him of their debt to her, Hunter told her he would not bring Omega to an Imperial-occupied planet, to which Cid responded that he should leave the child in her care. Hunter said that he did not exactly trust Cid, to which Cid laughed and agreed. Nonetheless, she reasoned that if Omega's safety ensured more money in her pocket, then it'd be in her best interest to do so. In the end, the group left Omega behind with Cid while they went on the mission, and Cid set Omega to work cleaning.\nAs Omega sulked throughout the parlor, disappointed she had been left behind, Cid eventually approached to ask what was troubling her. When Omega complained, Cid scoffed and told her that life was not fair. Later, Cid played a dejarik game against Ketch and Bolo. Omega offered her advice on a move, but Cid rolled her eyes and ignored her. However, when her move got her into trouble, she asked Omega what she would do, and when she played that move, she quickly won the game. Surprised that the youngster was skilled at dejarik, she asked if she was good enough to make her any money. Offering her thirty percent, Cid was surprised to see Omega negotiate her way to sixty percent. The pair won enough games to make up the Bad Batch's debt, and although Hunter was not pleased upon returning from their mission that Omega had drawn so much attention to herself, Cid was delighted and told the clone to lighten up.\nCid was later contacted by Gobi Glie to acquire weapons for Ryloth, as the populace was forced to disband the resistance and surrender their arms while the planet was under Imperial occupation. Cid sent the Bad Batch to deliver the weapons, which indirectly led to Gobi's arrest.\nWhile the Bad Batch were sent on another delivery, Durand decided to make a name for himself in the galactic underworld. As Ord Mantell was the center of multiple hyperspace routes and ideal for smuggling, Durand took it over with his gang and forced Cid out since her parlor was right in the middle of the action. Following the Bad Batch's return and sudden discovery of Durand's hostile takeover, Cid awaited the squad aboard the Marauder and explained Roland's motives. As she volunteered them to retake her Parlor, Hunter questioned why they should involve themselves. She reminded that her losses affect them and subtly blackmailed them. Fortunately, Omega supported her argument, reminding her brothers that Cid helped them when they needed her most and now it was time to return the favor.\nAs they made their way through the streets of Ord Mantell City, Cid outlined her plan to steal a shipment of spice from Durand to agitate the Pyke Syndicate. Cid led the Bad Batch to a manhole that led to Ord Mantell's old mining tunnels. Cid warned that the caverns had an infestation problem and that they should keep quiet. While passing through the tunnel, Wrecker stirred the mysterious creatures, prompting a disapproving glance from Cid. Meanwhile, Ketch and Bolo distracted Durand by stealing Ruby. Cid and Omega loaded the spice onto the mining transports as Wrecker brought them down. Just as Durand entered the office, the crew ducked into the tunnels to make their escape. As they fled through the tunnels, Durand's goons pursued them. Their blaster fight aroused the irlings, who swarmed the carts. Cid was upset when the irlings destroyed the spice on the second cart. They made it safely on the other side of the cavern, and Wrecker sealed the door behind them.\nThe crew returned to the Parlor, where they witnessed the Pykes arresting Durand. However, the Pykes demanded that Cid return the stolen spice and held Omega captive while the Bad Batch retrieved the spice shipment. Cid promised she would do everything she could to rescue Omega. The Marauder hovered over the chasm and Wrecker and Cid rappelled beneath the surface to locate the missing spice. Cid began securing crates of spice for Hunter to tow up. With the final two crates secure, Cid and Wrecker rode them as Hunter pulled them to the surface. Ascending past the mining rail, Cid and her crate bumped a lonely cart, sending it tumbling into the depths of the hive. Once again, the irlings swarmed the cavern. Tech dropped a flash grenade down the chasm and frightened the swarm. Cid and Wrecker continued their journey safely to the ship. Cid and the Bad Batch delivered the shipment to the Pykes, who returned Omega, according to their word. Durand faced death, but was spared when Omega and Cid reasoned with the Pykes, warning them against starting a potential war with his mother crime boss Isa Durand and knew that heat was something they didn't want to have at the time since their leader Marg Krim just brought the Syndicate out from hiding. One of Durand's horns was sliced and the Pykes exited the hangar. In return for saving his life, Durand restored the Parlor to Cid's ownership. Thankful for the Bad Batch's assistance, Cid bought the crew their first round of drinks.\nCid later sent the Bad Batch on a delivery that they ended up abandoning to rescue clone trooper Gregor from an Imperial base on Daro on behalf of Rex. Unfortunately, Hunter was captured during the rescue. As the Bad Batch returned to Ord Mantell to repair their ship, Wrecker left Gregor in Cid's care, albeit reluctantly, while the squad left to rescue Hunter.\nCid was a female Trandoshan with green skin and golden eyes. Short and portly in stature, Cid was shrewd at her job. Unlike most Trandoshans , Cid often exhibited a relaxed, calm and professional air, yet could also be somewhat temperamental and abrasive. She had a wide array of contacts, ranging from Jedi Knights to powerful crime lords, and did not act intimidated by any of them. Despite this, Cid knew better than to make enemies out of powerful figures and groups, such as the Pykes. She was willing to be deceptive to get what she wanted, such as telling the Bad Batch that the juvenile rancor Muchi was a child in danger.\nCid had a no-nonsense attitude. She quickly formed nicknames for the members of the Bad Batch, referring to Tech as \"Goggles,\" Hunter as \"Bandana,\" Omega as \"Tiny,\" and Wrecker as \"Muscles.\" Cid had a soft spot for Omega. She was always opportunistic, and upon realizing she was very skilled at dejarik, partnered with her to make some money and gained a newfound respect for her.\nCid was a strong and skilled individual, displaying mastery of a Zygerrian energy bow when she fired three very accurate shots to demonstrate to Omega how to operate the weapon.\nCid first appeared in episode 5, \"Rampage,\" of Star Wars: The Bad Batch, a show released in 2021 and created by Dave Filoni and Jennifer Corbett. She was voiced by Rhea Perlman. She was first revealed in a trailer for the season, titled \"For Hire.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Ord_Mantell",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cantina",
  "/wiki/Cid%27s_Parlor",
  "/wiki/Order_66",
  "/wiki/Information_broker",
  "/wiki/Jedi",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Echo",
  "/wiki/Clone_Force_99",
  "/wiki/Escape_from_Kamino",
  "/wiki/Galactic_Empire",
  "/wiki/Fennec_Shand",
  "/wiki/Bounty_hunter",
  "/wiki/Chase_on_Pantora",
  "/wiki/Pantora",
  "/wiki/Cloning",
  "/wiki/Omega",
  "/wiki/Rescue_of_Muchi",
  "/wiki/Muchi",
  "/wiki/Rancor",
  "/wiki/Zygerrian",
  "/wiki/Slaver",
  "/wiki/Hunter",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Standard_year",
  "/wiki/Republic_Era",
  "/wiki/Gambling",
  "/wiki/Ord_Mantell_City",
  "/wiki/Time",
  "/wiki/Clone_Wars",
  "/wiki/Officer",
  "/wiki/Species",
  "/wiki/19_BBY",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Jedi_Order",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Clone_commando",
  "/wiki/City",
  "/wiki/Bib_Fortuna",
  "/wiki/Majordomo",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Raney",
  "/wiki/Old_Ord_Mantell_City",
  "/wiki/Slot_machine",
  "/wiki/Weequay",
  "/wiki/Ithorian",
  "/wiki/Dejarik",
  "/wiki/Tech",
  "/wiki/Holotable",
  "/wiki/Comlink",
  "/wiki/Desertion",
  "/wiki/Scomp_link",
  "/wiki/Human",
  "/wiki/Gamorrean",
  "/wiki/Mission_to_a_droid_decommissioning_facility",
  "/wiki/Corellia",
  "/wiki/T-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/Zygerrian_energy_bow",
  "/wiki/Trace_Martez",
  "/wiki/Rafa_Martez",
  "/wiki/Roland_Durand",
  "/wiki/Ruby_(lizard)",
  "/wiki/Rhokai_gang",
  "/wiki/Mantell_Mix",
  "/wiki/Rex",
  "/wiki/Ketch",
  "/wiki/Bolo",
  "/wiki/Bracca",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Cad_Bane",
  "/wiki/Rescue_of_Omega",
  "/wiki/Senator",
  "/wiki/Avi_Singh",
  "/wiki/Raxus_Secundus",
  "/wiki/Extraction_on_Raxus",
  "/wiki/Gobi_Glie",
  "/wiki/Ryloth",
  "/wiki/Twi%27lek_Resistance",
  "/wiki/Marauder_(Omicron-class)",
  "/wiki/Spice",
  "/wiki/Pyke_Syndicate",
  "/wiki/Irling",
  "/wiki/Isa_Durand",
  "/wiki/Marg_Krim",
  "/wiki/Gregor",
  "/wiki/Imperial_Base_on_Daro",
  "/wiki/Daro",
  "/wiki/Rescue_of_Hunter",
  "/wiki/Eye",
  "/wiki/Crime_lord",
  "/wiki/Rampage_(episode)",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/2021",
  "/wiki/Dave_Filoni",
  "/wiki/Jennifer_Corbett",
  "/wiki/Rhea_Perlman",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Decommissioned",
  "/wiki/Battle_Scars",
  "/wiki/Reunion",
  "/wiki/Bounty_Lost",
  "/wiki/Common_Ground",
  "/wiki/Devil%27s_Deal",
  "/wiki/Infested",
  "/wiki/War-Mantle",
  "/wiki/Return_to_Kamino",
  "/wiki/The_Bad_Batch_Season_2",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Cid",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Aftermath_(episode)",
  "/wiki/Cornered"
 ]
}