{
 "name": "Cikatro Vizago",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Devaron"
     ]
    },
    {
     "name": "Born",
     "values": [
      "45 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.02 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "84 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark green"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Broken Horn Syndicate",
      "Alliance to Restore the Republic",
      "Lothal resistance group",
      "Lothal resistance group"
     ]
    }
   ]
  }
 ],
 "content": "Cikatro Vizago was a male Devaronian crime lord who ran the Broken Horn Syndicate on the planet Lothal during the reign of the Galactic Empire. Vizago's operations included smuggling and extortion, with his rule backed by dangerous IG-RM bodyguard and enforcer droids. On several occasions, Vizago employed the rebel crew of the starship Ghost, who performed several smuggling runs in exchange for either credits or Imperial intelligence.\nThe Devaronian crime lord also possessed various acquaintances, such as fellow crime boss Azmorigan and the human smuggler Lando Calrissian. Despite his shady dealings, Vizago helped Ezra Bridger rescue his master Kanan Jarrus from Imperial captivity after the latter identified himself as a Jedi. Vizago and Calrissian later abandoned Lothal after a skirmish with Imperial stormtroopers in the dilapidated village of \"Tarkintown.\" Sometime later, Vizago temporarily lost control of his own ship to the pirate Hondo Ohnaka, and was forced to call in Bridger's favor in order to retake it.\nThe Specters later solicited Vizago's help in smuggling them into Lothal. As punishment, Vizago was sentenced to penal labor aboard the Mining Guild ore crawler Crawler 413-24. Vizago cross paths with the Spectres, who freed him and the other slaves. Out of gratitude, Vizago joined the Rebellion. He contributed to the Liberation of Lothal by helping Mart Mattin and Wolffe to summon a pod of purrgil to attack Grand Admiral Thrawn's Seventh Fleet.\nHe worked in Twin Horns Storage, named after his own horns, which served as a front for criminal operations led by Rask Odai. He encountered Lina Graf, Milo Graf, and CR-8R when they were being harassed by a thug and after he overheard that they need to find a transmission he took them to Odai. Odai took CR-8R's head for his collection as a price for the transmission. The Graf siblings constructed a plan with their new friend Shalla Mondatha to steal CR-8R's head back. Mondatha smuggled them past Vizago and another henchman Rom in the storage building by hiding them in a crate full of beetles to hide their life signs. The Graf twins stole CR-8R's head back but Mondatha broke into the storage building anyway. Mondatha was revealed to be 'The Shade', a bounty hunter that was hunting the Graf siblings, who shot Rom and Odai's bodyguard IG-70 and shot one of Vizago's horns off asking where the Graf children were. After the loss of his horn, Vizago renamed and reorganized the Twin Horn Storage to the Broken Horn Syndicate.\nVizago found the Smuggler's Guide after buying a shipment of arms from Ephant Mon. Desiring to increase his wealth, he decided to go after one of Maz Kanata's treasure troves on Seylott. He partnered up with Azmorigan and Lando Calrissian. When they arrived on the planet, Vizago discovered it was under Black Sun lockdown. He passed his group off as wandering nomadic surveyors while attempting to find the treasure trove, but was confronted by Black Sun thugs.\nFollowing the Spectres's theft of Imperial blasters, Vizago informed the crew of the Ghost about the location of Wookiees held prisoner by the Empire. Vizago later offered payment to the rebels again, on the grounds that they could steal a shipment of T-7 ion disruptor rifles for him. However, the Empire interrupted their dealings, and the crime lord and his droids fled with half of the shipment without paying.\nFollowing the Empire's capture of Kanan Jarrus, Ezra Bridger, Sabine Wren, and Garazeb Orrelios later approached Vizago for information on where the Imperials were holding Kanan. Vizago admitted that he knew not where Kanan was and was skeptical of providing information that could help with the Empire tightening security on Lothal, which deeply impacted his operation. Ezra then asked him if he knew why the Empire was so determined to pursue the Ghost's crew or why an Inquisitor came to Lothal, revealing that he and Kanan were both Jedi. Disbelieving his claim, Vizago began laughing this off, until he witnessed Ezra using the Force.\nRealizing that Ezra meant business, Vizago made Ezra promise to return him a favor at a later date and brought him aboard his ship, the Broken Horn, where they solidified their deal by bowing to each other. The Devaronian then explained that because the Empire had destroyed Lothal's Imperial Communications Center, the Empire was forced to resort to passing messages via courier droids and by intercepting the communication logs they carried the rebels might discover where Kanan was located. Vizago then sent Ezra off, telling him that he would collect on his favor at a later date.\nLater, Vizago undertook a mission to deliver five power generators to the Jablogian crime lord Azmorigan on the frigid planet of Nixus. On the way, Vizago encountered the Weequay pirate Hondo Ohnaka, who stunned him and then imprisoned him on his own ship. Ohnaka also managed to seize Vizago's ship the Broken Horn and disable his droids. Before being knocked out, Vizago managed to send a distress signal that was picked up by the rebels Ezra and Chopper. When the two rebels confronted Ohnaka, the Weequay pirate claimed that Vizago had lost the Broken Horn in a sabacc game.\nOhnaka then convinced Ezra and Chopper to assist him in a mission to sell power generators to Azmorigan. After escaping Azmorigan, Ezra and Chopper discovered Vizago in a holding cell in the Broken Horn's brig. Vizago revealed the truth and enlisted Ezra and Chopper's help in reclaiming his ship. Reclaiming his master controller from Ezra, Vizago used his droids to attack Ohnaka, Ezra, and Chopper. Ohnaka managed to escape on the rebels' shuttle, the Phantom. Furious at losing both his proceeds and merchandise, Vizago dispatched Ezra and Chopper back to the planet Garel in an escape pod. Unknown to Vizago, the Phantom had been programmed to fly back to its mother ship, the Ghost. The rebels allowed Ohnaka to keep his ill-gotten proceeds but seized the power generators.\nNeeding to get back to Lothal, the Spectres hired Vizago to smuggle them through the Imperial blockade aboard his ship, the Broken Horn, in return for a supply of puffer pigs. Though Vizago was though initially confident that his permits and credentials would get him through the blockade, the Imperial Navy still detected unauthorized lifeforms aboard Vizago's ship. Upon landing at Capital City spaceport, Vizago's ship was anchored with gravity locks and searched by a squad of stormtroopers. However, the Spectres escaped by setting loose Vizago's puffer pigs. Not wanting to lose his livestock, Vizago tried to grab one of his pigs but ended up startling it, trapping himself aboard.\nAs punishment for smuggling rebels aboard his ship, Vizago was sentenced to indentured servitude aboard the Mining Guild ore crawler Crawler 413-24. Vizago and other prisoners were forced to work under the lash of the Trandoshan foreman Proach and captain Seevor. Despite his predicament, Vizago was confident that the rebels would rescue them. Vizago's hopes were fulfilled when the Spectres and local rebel leader Ryder Azadi boarded the ore crawler. Following a prolonged struggle, the Spectres managed to kill Proach and Seevor while narrowly escaping an Imperial patrol. Vizago bragged to the other prisoners that he knew his rebel friends would come to rescue him, and even though Jarrus initially went along with it despite having no idea that Vizago was aboard, the Devaronian eventually learned that they hadn't come to save him after all. He was initially displeased by this revelation, but in the end was thankful that they rescued him at all. After their liberation, Vizago claimed the captured mining crawler as his own while the other former prisoners joined the Rebel Alliance.\nFollowing his liberation, Vizago joined the Spectres and their Lothal resistance group allies, who had set up a base in a cliff dwelling. Prior to the Liberation of Lothal, Vizago informed Ezra that General Hera Syndulla wanted to speak with him. Vizago was privy to Ezra and Ryder's discussions on how to liberate Lothal from Imperial rule. Ryder's plan involved pretending to betray the rebels and luring Governor Arihnda Pryce and her forces into a trap at the rebel cliff dwelling.\nPryce subsequently attacked the Lothal rebel base with a fleet of patrol transports, stormtroopers, and jumptroopers. During the battle, Vizago expressed regret that he had met Ezra as the Imperials encircled the rebel forces on top of the ore crawler. Vizago survived the destruction of the ore crawler but he and the other rebels were taken prisoner by Pryce's forces. However, Pryce's forces were defeated by Hera's reinforcements and a pack of loth-wolves. Following Pryce's capture, the rebels proceeded with the next stage of their plan.\nWhile the main rebel force departed to attack the Dome, Vizago stayed behind with the former Clone Commander Wolffe and Mart Mattin, who were tasked by Hera with evacuating the team after they had completed their mission to lure the Imperial garrison aboard and launch the Dome. However, the three were attacked by Grand Admiral Thrawn's Noghri assassin Rukh, who knocked Vizago to the ground before knocking Wolffe and Mart unconscious. Despite being driven off by the White Loth-wolf, Rukh managed to steal their patrol transport and attempted to sabotage the rebels' plan.\nAfter the three awoke, Mart informed Vizago and Wolffe about Ezra's secret contingency plan in the event that Thrawn had discovered their plan to lunch the Dome. The three departed aboard the Spectres' ship Ghost to fulfill that mission, which involved transmitting a coded transmission to a pod of purrgil. The purrgil wiped out Thrawn's Seventh Fleet and then followed the Ghost to Capital City. After the purrgil pod carried Ezra, Thrawn, and the Chimaera into unknown space, Vizago and his comrades aboard the Ghost evacuated their rebel comrades from the Dome. Sabine then detonated the Dome, wiping out the Imperial garrison and ending Imperial rule on Lothal.\nVizago was only truly interested in money and, according to Hera Syndulla, would \"sell his mother to Jawas for a couple of credits.\" A strong believer in business, he possessed a few, if somewhat twisted, professional scruples that seemed to benefit only him. When paying the Ghost's crew a bounty he withheld half in exchange for a small piece of information disclosing the location of a group of Wookiee captives. Vizago once fled an attacking Imperial force after receiving half a shipment of disruptors, stiffing the Ghost Crew and stating he never paid for half a shipment. He furthermore expressed his hope that they would survive to continue bargaining with him, while cynically expressing they would nonetheless be no great loss. His sense of humor was good, if somewhat dark.\nAs an information broker he valued information and knew how to bargain to put himself one step ahead of his clients. Of all the Ghost's crew he appeared to respect Ezra the most, for his cunning. Despite his firm underworld ties and inherent self-interest, he showed some small degree of compassion, expressing genuine remorse for being unable to help Ezra find Kanan. He carried a powerful Vilmarh's Revenge blaster pistol and piloted a ship named the Broken Horn after his syndicate.\nViewing himself as a businessman, Vizago was willing to smuggle the Spectres in Lothal in return for a payment of puffer pigs. Despite being imprisoned and forced to work aboard a Mining Guild ore crawler, Vizago remained optimistic that his rebel friends would rescue him. Vizago's hopes were fulfilled when the Spectres boarded the ore crawler, killed the Trandoshan overseers, and liberated the prisoners.\nThough Vizago expressed regret joining the rebels when Governor Pryce's forces overwhelmed the rebel base, he remained loyal and contributed to Ezra's plan to ending Imperial rule on Lothal. Vizago quipped that Ezra's contingency plan to use purrgil to defeat Thrawn's fleet would work because \"it had Ezra written all over it.\"\nCikatro Vizago appears in the Star Wars Rebels series, where he is voiced by Keith Szarabajka. Cikatro's body and vestiaries are based on Ralph McQuarrie's Episode IV concept art for Chewbacca.\nIn Angry Birds Star Wars II, he betrayed the team of rebels he was working with to the Empire. He then fought against the Empire.\nIn the LEGO Star Wars: Droid Tales episode \"Mission to Mos Eisley,\" he was seen buying the T-7 ion disruptor rifles from the Spectres. He then fled as Agent Kallus arrived in an AT-DP walker.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/The_Rebellion_Begins",
  "/wiki/Rebel_Bluff",
  "/wiki/Adventures_in_Wild_Space:_The_Steal",
  "/wiki/The_Beast_Within",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Databank_A-Z",
  "/wiki/Special:Upload",
  "/wiki/Devaron",
  "/wiki/45_BBY",
  "/wiki/Devaronian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Broken_Horn_Syndicate",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Lothal_resistance_group",
  "/wiki/Crime_lord",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Smuggler",
  "/wiki/IG-RM_bodyguard_and_enforcer_droid",
  "/wiki/Spectres",
  "/wiki/Starship",
  "/wiki/Ghost",
  "/wiki/Credit",
  "/wiki/Azmorigan",
  "/wiki/Human",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Ezra_Bridger",
  "/wiki/Kanan_Jarrus",
  "/wiki/Jedi",
  "/wiki/Stormtrooper",
  "/wiki/Lothal_re-settlement_camp_43",
  "/wiki/Pirate",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Mining_Guild",
  "/wiki/Ore_crawler",
  "/wiki/Crawler_413-24",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Mart_Mattin",
  "/wiki/Wolffe",
  "/wiki/Purrgil",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/7th_Fleet",
  "/wiki/Twin_Horns_Storage",
  "/wiki/Rask_Odai",
  "/wiki/Lina_Graf",
  "/wiki/Milo_Graf",
  "/wiki/CR-8R",
  "/wiki/Shalla_Mondatha",
  "/wiki/Rom",
  "/wiki/IG-70",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Ephant_Mon",
  "/wiki/Maz_Kanata",
  "/wiki/Seylott",
  "/wiki/Black_Sun",
  "/wiki/Heist_in_Capital_City",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/Wookiee",
  "/wiki/Mission_to_steal_Imperial_weapons",
  "/wiki/T-7_ion_disruptor_rifle",
  "/wiki/Raid_on_the_communications_tower",
  "/wiki/Sabine_Wren",
  "/wiki/Garazeb_Orrelios",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/The_Force",
  "/wiki/Broken_Horn",
  "/wiki/Imperial_Communications_Center",
  "/wiki/R4_courier_droid",
  "/wiki/Jablogian",
  "/wiki/Nixus",
  "/wiki/Weequay",
  "/wiki/Stun",
  "/wiki/C1-10P",
  "/wiki/Sabacc",
  "/wiki/Phantom",
  "/wiki/Escape_pod",
  "/wiki/Puffer_pig",
  "/wiki/Imperial_Navy",
  "/wiki/Capital_City_spaceport",
  "/wiki/Gravity_lock",
  "/wiki/Trandoshan",
  "/wiki/Proach",
  "/wiki/Captain",
  "/wiki/Seevor",
  "/wiki/Ryder_Azadi",
  "/wiki/Lothal_cliff_dwelling",
  "/wiki/Governor",
  "/wiki/Arihnda_Pryce",
  "/wiki/LAAT/le_patrol_gunship",
  "/wiki/Jumptrooper",
  "/wiki/Clone_Commander",
  "/wiki/Noghri",
  "/wiki/Assassin",
  "/wiki/Rukh",
  "/wiki/White_Loth-wolf",
  "/wiki/Hera_Syndulla",
  "/wiki/Parent",
  "/wiki/Jawa",
  "/wiki/Vilmarh%27s_Revenge",
  "/wiki/Blaster_pistol",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Keith_Szarabajka",
  "/wiki/Ralph_McQuarrie",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Chewbacca",
  "/wiki/Angry_Birds_Star_Wars_II",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Mission_to_Mos_Eisley_(episode)",
  "/wiki/All_Terrain_Defense_Pod",
  "/wiki/HoloNet_News_(Tumblr)",
  "/wiki/HoloNet_News_Report:_Imperial_Registration_Program",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion",
  "/wiki/Ezra%27s_Wookiee_Rescue",
  "/wiki/Who_Are_the_Rebels%3F",
  "/wiki/Droids_in_Distress_(book)",
  "/wiki/The_Secret_Jedi:_The_Adventures_of_Kanan_Jarrus:_Rebel_Leader",
  "/wiki/Droids_in_Distress",
  "/wiki/Servants_of_the_Empire:_Rebel_in_the_Ranks",
  "/wiki/Out_of_Darkness",
  "/wiki/Idiot%27s_Array_(episode)",
  "/wiki/Battle_to_the_End",
  "/wiki/Rebel_Resolve",
  "/wiki/Star_Wars_Rebels:_Recon_Missions",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_158",
  "/wiki/Brothers_of_the_Broken_Horn",
  "/wiki/Star_Wars_Rebels_Animation",
  "/wiki/Star_Wars_Rebels_Animation_3",
  "/wiki/The_Occupation",
  "/wiki/Crawler_Commandeers",
  "/wiki/A_Fool%27s_Hope",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Ultimate_Sticker_Collection:_Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels:_Head_to_Head",
  "/wiki/StarWars.com",
  "/wiki/Sabine_My_Rebel_Sketchbook",
  "/wiki/Star_Wars_Rebels_Recounted",
  "/wiki/Star_Wars_Insider_156",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_69",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Scum_and_Villainy_Conversion_Kit",
  "/wiki/Hound%27s_Tooth_Expansion_Pack_(X-Wing:_Second_Edition)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Protocol_and_Service_Droids",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/5_BBY",
  "/wiki/Reproduction"
 ]
}