{
 "name": "Cilghal",
 "display_name": "Cilghal",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ackbar family",
      "New Jedi Order",
      "New Republic",
      "Galactic Federation of Free Alliances",
      "Jedi Coalition",
      "Darkmeld"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Luke Skywalker"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Tekli"
     ]
    }
   ]
  }
 ],
 "content": "Cilghal was a female Mon Calamari Jedi Master who served the New Jedi Order and also a former senator of the New Republic Senate. She was one of the first students at Luke Skywalker's Jedi Praxeum and a skilled healer. Tekli, a young female Chadra-Fan, was Cilghal's Jedi apprentice. Cilghal was later a member of the Jedi High Council and the most skilled member of the Order in the healing arts.\nA niece of Admiral Gial Ackbar, Cilghal was an ambassador to the New Republic. She helped Leia Organa Solo locate Ackbar when the admiral retreated to his homeworld after the disaster on Vortex in 11 ABY. She also showed Leia the Startide while it was under construction. Under the ocean, she showed Leia the Knowledge Bank. After the two women located Ackbar in his personal seapod, Imperial Admiral Daala attacked Dac.\nAs Ackbar led the defense, Cilghal was able to predict who would die in the battle, and during the ensuing triage, which patients were injured beyond saving. Leia identified Cilghal as a Force-sensitive and sent her to Luke Skywalker's Jedi Praxeum on Yavin 4, where Cilghal trained as a Jedi healer. Although not one of the original twelve students, Cilghal was one of the first graduating class of Jedi Knights. While there, she constructed her lightsaber with an Ultima-Pearl from her homeworld. When a poisonous drink almost killed Chief of State Mon Mothma, Cilghal healed her through the Force.\nCilghal went on to become Mon Calamari's senator. In 19 ABY, she attended the wedding of Luke Skywalker and Mara Jade and supported their appeal to the Senate concerning the Diversity Alliance. Later she helped the young Jedi Knights Jacen and Jaina Solo and their friends destroy a large stash of illegal spice.\nCilghal later left her position as a senator and became a Jedi Master, taking the Chadra-Fan Tekli as her Padawan. She helped Mara Jade Skywalker survive the coomb spore disease with which she was infected by Nom Anor, but was unable to cure it. During the Yuuzhan Vong War, Cilghal helped Danni Quee unravel the mysteries of the voxyn and other Yuuzhan Vong creations and helped her apprentice Tekli become a notable Jedi healer. In time, Tekli graduated to the level of Jedi Knight and became a Magister-in-training on Zonama Sekot following the end of the war. Cilghal herself became one of the six Jedi to sit on the High Council of the Galactic Federation of Free Alliances. She also learned Vergere's Force ability Art of the Small.\nWith the establishment of the Ossus Academy, she established a lab where she could heal and study individuals and the affect the Force has on life. During the Dark Nest Crisis, Cilghal became a member of the Masters' Council and helped uncover the existence of the Gorog, which was manipulating the conflict between the Killiks and the Chiss without the knowledge of UnuThul and the rest of the Colony. As a Jedi Master-healer, she used medical experiments to reveal the true nature of the Dark Nest, analogous to the unconscious mind of the Colony.\nShe, with the permission of Luke Skywalker, helped in an unorthodox interrogation of the young Jedi from the Mission to Myrkr, where a captive Killik was given a short round of non-harmful, but painful, electrical shocks, to see how closely its mind was linked to the Joiners. She and Luke were very uncomfortable with using the Force for such dark purposes, and after the interrogation, she informed Master Skywalker that she would not willingly involve herself in such activities again. This incident, while very helpful and informative for the Jedi, helped spur Luke to reconsider the Potentium view of the Force, and begin leaning back towards the traditional light and dark side views. Cilghal also developed a weapon called the Dazer designed to temporarily disrupt the hive mind of Killiks. This weapon proved life-saving when Skywalker fought Lomi Plo.\nAfter the Swarm War, Cilghal instituted a reconditioning progress to help Joiners adjust in other environments outside of their nest. Jaina Solo and Zekk, joined to one another, were the first to go through the process.\nDuring the Second Galactic Civil War, Cilghal continued to sit upon the Jedi High Council and did not approve of Jacen Solo and Ben Skywalker's actions against civilians. Later she believed that plastic surgery would help Raynar Thul in his recovery and would be a big step for him as he had already accepted a prosthetic arm.\nShe was called upon once again to help Master Luke Skywalker analyze a device given to him by Jagged Fel which transferred memories from short-term to long-term memory. This meant that Alema Rar's power of making anyone that sees her forget about her after she leaves defunct to the user of the device. Cilghal, by request of Luke Skywalker, developed a Force power that was able to duplicate the abilities of the device.\nDuring a Council meeting she voiced her concerns about more Jedi Knights being injured or killed in the war and she believed that there weren't enough Masters, something Luke took to heart and asked all the members of the Council to make a list of senior Jedi Knights they believed were ready to be elevated to the rank of Jedi Master.\nWhen the Jedi learned of Gejjen's assassination on Vulpter and that Omas was off on \"personal business\" at the time of the killing, Kyp thought it wise to begin opening up cordial relations with Cha Niathal as Omas' potential successor. Cilghal claimed that just because they were both Mon Calamari hardly meant they came from the same schools of thought. Nevertheless, she agreed to the role. She was also a proponent of the Jedi having no attachments.\nWhen Mara Jade Skywalker was killed on Kavan and brought back to Coruscant, Cilghal performed the autopsy. Later, she attended the Funeral of Mara Jade Skywalker. When the Jedi where preparing to fight in the Battle of Kuat, Cilghal notified the other Jedi there of Cal Omas' death and that Ben had been reported to have been the one to kill him, forcing the Jedi to leave Kuat and stop supporting Jacen.\nShe later healed Kyle Katarn after he was wounded on his mission to Coruscant. Cilghal, along with the rest of the Jedi Council, lead a force of fifty Jedi Knights in a bid to secure the Anakin Solo following the death of Darth Caedus and used her talents to heal Jaina Solo after her final duel with the Sith Lord.\nWith the death of Caedus, came the rise of Natasi Daala as the new Galactic Alliance Chief of State. Daala fostered a wide spread anti-Jedi sentiment which culminated in the arrest of Grand Master Luke Skywalker in 43 ABY. Chief Daala blamed Skywalker for not stopping Jacen Solo's transformation into Darth Caedus, and after negotiations with the Chief, only regained his freedom by exiling himself from the Jedi Order.\nMaster Cilghal was involved in testing the mentally addled Valin Horn, and continued his examination following his escape and subsequent recapture. Cilghal noted that Horn displayed an ability only Jacen Solo had previously shown, which prompted Master Skywalker, while exiled from the Order, to retrace Jacen's steps before his fall. When the time came for Master Skywalker to hand over the duties of Grand Master of the Order to Kenth Hamner, Cilghal was particularly emotional and embraced her old friend at the conclusion of the Jedi High Council meeting. Cilghal was one of many friends of the Grand Master to see him off from Coruscant, and privately offered to advise him secretly on his journey to discover what had caused the fall of Jacen Solo.\nLater, Galactic Alliance Security forces arrived at the steps of the Jedi Temple. Master Cilghal, along with Master Kyp Durron, confronted the squad, led by Captain Oric Harfard, who demanded that they hand Valin Horn over to the Alliance. The pair was ultimately forced to allow him to be taken into custody. Cilghal later found Seff Hellin, who suffered from the same disease as Horn, in a secret medical bay in the Jedi Temple. Hellin had been captured by Jaina Solo's secret organization, Darkmeld, which sought to counter Daala's attempts to undermine the Order. In this capacity, she eventually began studying Seff Hellin, in the hopes of finding a cure for the Force-based disease.\nWhile in the First Wing of the Jedi Archives researching cases that may help Jedi Horn, Cilghal was approached by Jysella Horn, who offered her assistance. Jysella suddenly came down with the same psychosis as her brother, and when Jysella suddenly froze, Cilghal looked up in time to see the girl's hand fly up, thrusting the healer into the stacks with the Force. As Jysella Horn ran for the turbolift, Cilghal contacted Temple Security and ordered them to detain the Jedi and to contact Master Hamner. Aided by Jedi Knights Natua Wan and Radd Minker, Cilghal pursued Jysella as she made for the main entrance and escaped.\nAfter Jedi Wan succumbed to the disease, Cilghal and Tekli took both Hellin and Wan to the Asylum Block where they were locked in solitary, ysalamiri Force-deprived rooms. While Organa Solo and her husband came to assist the Healers, they were able to persuade Raynar Thul to leave after having spending many weeks in the Asylum with an open door. Having brought C-3PO along with them, the golden droid was able to translate Wan's insistent hissing as a sacred oath to remove Han Solo's internal organs. Startled by the threat, the Solos moved to Hellin's room where the healers hoped to distract him long enough to be able to perform a test on him. Hellin was at first quite docile and kind to the Solos, however, things quickly deteriorated and Cilghal was forced to tranquilize him.\nWhen Leia Solo called Master Cilghal to the southern subsurface speeder garage to help carry away the psychotic Bazel Warv and Yaqeel Saav'etu. Before she could exit the hangar with her patients, Grand Master Hamner stopped her and reprimanded Jedi Solo for evading a Galactic Alliance warrant. When Hamner demanded that they honor the warrant and turn over the two psychotic Jedi, Cilghal refused and demanded that they take the matter before the Council. Accepting this, Hamner allowed the healer to take the two infected Jedi to the Asylum Block for study. After hours of debating in the High Council Chamber, the Jedi Masters, including Cilghal, agreed that the warrant would not be honored, and that Jedi Organa Solo would be responsible for smuggling all four patients to the Jedi Academy on Shedu Maad.\nCilghal's main focus in her training was on developing her powers rather than her combat abilities though she was proficient with a lightsaber nonetheless. As the most adept healer in the entire New Jedi Order, Cilghal naturally possessed an immense knowledge of biology, medicine and Force healing techniques which only grew further with the discovery of Vergere's Art of the Small technique. In addition to her healing affinity, Cilghal was adept in countering unique Force abilities such as Alema Rar's power of forgetfulness. She also possessed an advanced mastery in Mind Manipulation as well as battle meditation.\nDespite her preference for healing and focusing on her Force powers, Master Cilghal was a talented swordswoman. Though Luke Skywalker felt her style of combat was diffident when compared to the style of Masters such as Kyp Durron and Kyle Katarn, Sothais Saar noted that \"she fought like a Jedi Master, lightning-fast, anticipating every attack, not being fooled by feints\". Chief Daala later commented that Saar \"was flattened like a bug\" in his duel with the Mon Cal healer.\nSeveral sources misspell her name as Clighal.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fate_of_the_Jedi:_Backlash",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Cilghal",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Ackbar_family/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Jedi_Coalition",
  "/wiki/Darkmeld",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Tekli",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Senator/Legends",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Jedi_healer/Legends",
  "/wiki/Chadra-Fan/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/Admiral_of_the_Fleet/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Vortex/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Startide",
  "/wiki/Knowledge_Bank",
  "/wiki/Ackbar%27s_seapod",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Natasi_Daala",
  "/wiki/Dac",
  "/wiki/Attack_on_Mon_Calamari",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Ultima-Pearl",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Wedding_of_Luke_Skywalker_and_Mara_Jade",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Diversity_Alliance",
  "/wiki/Darth_Caedus",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Spice/Legends",
  "/wiki/Coomb_spore",
  "/wiki/Nom_Anor",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Danni_Quee",
  "/wiki/Voxyn",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Magister",
  "/wiki/Zonama_Sekot/Legends",
  "/wiki/High_Council_(Galactic_Alliance)",
  "/wiki/Vergere",
  "/wiki/Art_of_the_Small",
  "/wiki/Jedi_Academy_(Ossus)",
  "/wiki/Ossus_Scientific_and_Medical_laboratory",
  "/wiki/Dark_Nest_Crisis",
  "/wiki/Gorog",
  "/wiki/Killik/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Raynar_Thul",
  "/wiki/The_Colony",
  "/wiki/Torture/Legends",
  "/wiki/Mission_to_Myrkr",
  "/wiki/Joiner",
  "/wiki/Potentium",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dazer",
  "/wiki/Lomi_Plo",
  "/wiki/Zekk",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Ben_Skywalker",
  "/wiki/Jagged_Fel",
  "/wiki/Alema_Rar",
  "/wiki/Dur_Gejjen",
  "/wiki/Vulpter/Legends",
  "/wiki/Cha_Niathal",
  "/wiki/Funeral_of_Mara_Jade_Skywalker",
  "/wiki/Battle_of_Kuat_(Second_Galactic_Civil_War)",
  "/wiki/Kyle_Katarn",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Anti-Jedi_sentiment/Legends",
  "/wiki/43_ABY",
  "/wiki/Force_psychosis",
  "/wiki/Valin_Horn",
  "/wiki/Kenth_Hamner",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Jedi_Temple",
  "/wiki/Kyp_Durron",
  "/wiki/Captain/Legends",
  "/wiki/Oric_Harfard",
  "/wiki/Seff_Hellin",
  "/wiki/Raid_on_the_Armand_Isard_Correctional_Facility",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Jysella_Horn",
  "/wiki/Turbolift/Legends",
  "/wiki/Temple_Security_Force",
  "/wiki/Natua_Wan",
  "/wiki/Radd_Minker",
  "/wiki/Jedi_Temple_Detention_Center#Asylum_Block",
  "/wiki/Ysalamir",
  "/wiki/C-3PO/Legends",
  "/wiki/Jedi_Temple_Docking_Complex",
  "/wiki/Bazel_Warv",
  "/wiki/Yaqeel_Saav%27etu",
  "/wiki/High_Council_Chamber",
  "/wiki/Shedu_Maad",
  "/wiki/Jedi_Consular",
  "/wiki/Force_power/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Battle_meditation",
  "/wiki/Sothais_Saar",
  "/wiki/Star_Wars:_Purge:_Seconds_to_Die",
  "/wiki/Sha_Koon",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Champions_of_the_Force",
  "/wiki/I,_Jedi",
  "/wiki/Children_of_the_Jedi_(novel)",
  "/wiki/Darksaber_(novel)",
  "/wiki/Star_Wars:_Union",
  "/wiki/Young_Jedi_Knights:_Lightsabers",
  "/wiki/Young_Jedi_Knights:_The_Emperor%27s_Plague",
  "/wiki/Young_Jedi_Knights:_Crisis_at_Crystal_Reef",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/The_New_Jedi_Order:_Balance_Point",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_I:_Conquest",
  "/wiki/The_New_Jedi_Order:_Recovery",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_Dark_Journey",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_II:_Rebel_Stand",
  "/wiki/The_New_Jedi_Order:_Destiny%27s_Way",
  "/wiki/The_New_Jedi_Order:_Ylesia",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_I:_Remnant",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_II:_Refugee",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_III:_Reunion",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/Dark_Nest_II:_The_Unseen_Queen",
  "/wiki/Dark_Nest_III:_The_Swarm_War",
  "/wiki/Legacy_of_the_Force:_Bloodlines",
  "/wiki/Legacy_of_the_Force:_Tempest",
  "/wiki/Legacy_of_the_Force:_Exile",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/Legacy_of_the_Force:_Inferno",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/Legacy_of_the_Force:_Invincible",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/Fate_of_the_Jedi:_Omen_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Backlash_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/Crucible_(novel)",
  "/wiki/Crucible_(audiobook)",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/Star_Wars_Kids_(1997)",
  "/wiki/Who_Is_That_Alien%3F",
  "/wiki/Star_Wars_Kids_5_(1997)",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/So_You_Want_To_Be_A_Jedi...",
  "/wiki/Star_Wars_Galaxy_Magazine_13",
  "/wiki/The_Jedi",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_138",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Fate_of_the_Jedi:_Dramatis_Personae",
  "/wiki/Jedi_Academy_Training_Manual",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2011_Topps_Star_Wars_Galaxy_Series_6",
  "/wiki/28_ABY/Legends",
  "/wiki/30_ABY/Legends",
  "/wiki/Releqy_A%27Kla",
  "/wiki/Tresina_Lobi",
  "/wiki/Cal_Omas",
  "/wiki/Ta%27laam_Ranth",
  "/wiki/Dif_Scaur",
  "/wiki/Saba_Sebatyne",
  "/wiki/Sien_Sovv",
  "/wiki/Triebakk",
  "/wiki/35_ABY/Legends",
  "/wiki/36_ABY",
  "/wiki/Corran_Horn",
  "/wiki/Octa_Ramis",
  "/wiki/40_ABY",
  "/wiki/44_ABY",
  "/wiki/Barratk%27l",
  "/wiki/Kam_Solusar",
  "/wiki/Tionne_Solusar",
  "/wiki/Calamari_sector/Legends",
  "/wiki/Q-Varx",
  "/wiki/23_ABY/Legends",
  "/wiki/Pwoe",
  "/wiki/Gron_Marrab"
 ]
}