{
 "name": "Cin Tykan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaleesh"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Aris Vauranelle"
     ]
    }
   ]
  }
 ],
 "content": "Cin Tykan was a male Kaleesh Jedi Master and the best survival expert of the Jedi Order; his skills allowed him to thrive in the deadliest and most dangerous environments. Master Tykan had put his unique talents to use throughout the galaxy, exploring and studying dozens of ravaged worlds and finding ways to reverse the catastrophic damage to their ecosystems.\nA Kaleesh Jedi Master trained in the ways of the Force, Cin Tykan traveled the galaxy putting his survival skills to the test. Like many of his species, Tykan hid his face with a mask made from a mumuu skull. Devoted to his work, Master Tykan waited many years before taking on a Padawan; unwilling to pass on his knowledge to one who didn't share his deep-felt compassion for nature and life in all its forms. He finally found a worthy student in the eager and earnest Aris Vauranelle during the Cold War. Together, they began tackling one of the galaxy's greatest environmental challenges: the restoration of Taris. During his training of Vauranelle on Taris, Tykan became infected by a terrible illness caused by Lord Vivicar's plague. The illness drove him insane as his mind came under the sway of the dark side, leading Tykan to commit acts of sabotage against Republic restoration efforts. While Captain Nelex and Padawan Vauranelle refused to believe that Tykan was sick, a young Jedi Consular arrived from Coruscant to hunt down Tykan and cure him if possible. Tracking him and a team of researchers to the ruins of the ancient Jedi academy once used by the First WatchCircle during the Mandalorian Wars, the Jedi Consular found Tykan's research team in peril. After discovering precious Jedi medical holocrons, Tykan's psychosis set in and he had lured his colleagues into the ruins and set a fire in a pocket of gas leechate. When the Consular arrived, Tykan had fled, but the holocrons and workers were safely retrieved and revealed Tykan's next target: the Junction.\nTraveling to the Junction, a gas purification facility nearby, the Jedi Consular found Tykan but was unable to prevent him from severing the facility's main gas line. Forcing an evacuation, the Consular defended the work crews from rakghouls allowed in by Tykan while they resealed the damaged equipment. Having distracted his pursuer, Tykan circled round back to the base of the Republic Expeditionary Forces using rakghoul tunnels and launched a surprise attack on Captain Nelex's forces. Abducting his Padawan, Tykan forced his way through the base and holed himself up with one of the city's last working super-reactor. Planning to destroy the reactor and release its toxic sludge into the fragile ecosystem, Tykan was able to convince his Padawan of the Republic's involvement in corrupting the planet. When the Jedi Consular tracked him down, Vauranelle stood to defend him until the Consular convinced her of Master Tykan's illness. Furious at the perceived betrayal, Tykan lashed out at his Padawan but was quickly subdued by the Jedi Consular. After the Consular conducted a shielding ritual to release him from Vivivar's thrall, Tykan vowed to reveal his shame to the Republic and seek guidance from the Jedi High Council back on Tython. Departing Taris with Vauranelle, the pair made for the Deep Core homeworld of their Order for reflection and rehabilitation.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kaleesh/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Aris_Vauranelle",
  "/wiki/Jedi_Master/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mumuu/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Taris_Resettlement_Initiative",
  "/wiki/Taris/Legends",
  "/wiki/Parkanas_Tark",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Nelex",
  "/wiki/The_Barsen%27thor",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Tower",
  "/wiki/First_WatchCircle",
  "/wiki/Mandalorian_Wars",
  "/wiki/Jedi_Consular",
  "/wiki/Holocron/Legends",
  "/wiki/Junction_(purification_facility)",
  "/wiki/Republic_Expeditionary_Forces",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Deep_Core/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}