{
 "name": "Cin Drallig",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lavisar"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.74 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Yoda"
     ]
    }
   ]
  }
 ],
 "content": "Cin Drallig was a Force-sensitive human male Jedi Master who served the Jedi Order as Battlemaster and Chief of Security of the Jedi Temple during the Clone Wars. He was the head of the Jedi Temple Guard and a lightsaber instructor who was disrespectfully nicknamed \"the Troll\" by members of the Jedi. Drallig was killed by Darth Vader during his attack on the Jedi Temple.\nHailing from Lavisar, Cin Drallig, a gifted Force-sensitive human male, was apprenticed to the Jedi High Council's Grand Master Yoda. Faithfully honing his skills and attunement to the Force, Drallig garnered many years of knowledge and experience, and eventually became the Jedi Order's Battlemaster. Drallig also achieved the rank of Jedi Master, and led the Jedi Temple Guard during the Clone Wars. As a Master, he was a teacher of lightsaber combat who passed his skills on to new generations of Jedi, such as Obi-Wan Kenobi and Anakin Skywalker. Although he was regarded as perhaps the finest duelist in the Order, he earned the unflattering nickname \"the Troll\" from other members of the Jedi Order.\nIn 21 BBY, Cad Bane slipped past Drallig and the Temple's security forces using specialized technology and his intelligence and managed to slip into the Holocron Vault. A Jedi holocron was stolen.\nDuring the Clone Wars, the Jedi Temple was bombed by Padawan Barriss Offee. Before the perpetrator had been caught, the Jedi led an investigation to determine who was behind the attack. Skywalker approached Drallig, who was standing guard with the Temple Guard at the gates of the Jedi Temple, where protesters were demonstrating against the war and the Jedi Order's involvement in it. Skywalker showed Drallig a holographic image of their then-suspect, Jackar Bowmani, and asked the Jedi Master to be on alert for him. This led to the suspect's wife, Letta Turmond, being taken into custody after spotting the holographic image, and the Jedi ultimately learned that Turmond was part of the plot to attack the Jedi Temple.\nThe Temple was later attacked by Captain Rackham Sear of the Confederacy of Independent Systems. During the attack, Drallig led two Temple Guards in securing the quarters of the Jedi younglings. He arrived just in time to cut a small explosive drone in half before it detonated in a room with several younglings. He ordered the guards to stay with the younglings and destroy any more explosives that entered the area. Drallig then joined Masters Mace Windu and Kenobi, reporting to them that the younglings were safe, but that there were explosions throughout the Temple and that the source was unknown. Master Depa Billaba and Initiate Caleb Dume ended the attack by confronting Sear on the roof of the Temple, where he committed suicide by leaping off the building.\nAt the end of the war, Skywalker turned to the dark side of the Force and became Darth Vader, apprentice to Darth Sidious, the Dark Lord of the Sith. Vader attacked the Jedi Temple with the 501st Legion of clone troopers, while Sidious issued Order 66 to force the clones to turn against the Jedi Order. Drallig fought to defend the Jedi Temple alongside Padawans Whie Malreaux and Bene, both of whom perished in lightsaber combat with an enraged Darth Vader. Drallig confronted Vader himself, but proved unable to put an end to the Sith Lord's rampage.\nShortly after Drallig's death, Masters Yoda and Kenobi returned to the Temple, where they witnessed a security hologram recording depicting Drallig's final moments dueling Darth Vader alongside Padawans Bene and Whie.\nSometime after his death, the holocron of Cin Drallig was sold in an auction on Denon to the noble Rin Praji, who kept the holocron safe at his estate on Kaikielius.\nCin Drallig was a stoic and resolved Jedi Master, a noted leader who presided over the Temple Guard at the Jedi Temple on Coruscant. He stood at 1.74 meters tall, or 5 feet 9 inches. He had dark blond hair, blue eyes, and light skin.\nPersonally trained by Grand Master Yoda, the talented Cin Drallig went on to become an esteemed Jedi Master, a venerated title signifying Drallig's unparalleled connection to the Force. A veteran of the Order, Master Drallig assumed the role of combat instructor at the Jedi Temple on Coruscant, and played a major hand in the training of many Jedi, including Obi-Wan Kenobi and Anakin Skywalker. In the position of teacher, Drallig specialized in lightsaber training, though his long list of skills included unarmed fighting.\nA swordsman of great skill, often called the finest duelist in the Jedi Order, Drallig held the title of Jedi Battlemaster, and was head of security at the Coruscant Jedi Temple, commanding its dedicated Temple Guard. Drallig was the best swordmaster present during the violent attack on the Jedi Temple at the dawn of the Galactic Empire, and in the chaotic melee, Drallig encountered the newly christened Darth Vader, formerly Anakin Skywalker. Like his fellow Jedi, Drallig put up a formidable defense, but even his renowned skills could not defeat the raging Sith Lord.\nDrallig wore classic Jedi robes and boots and kept his hair long. From time to time he had protective gauntlets on his arms and hands. Drallig wielded a single green lightsaber, favouring a utilitarian hilt design similar to that of several members of the Jedi High Council, such as Kit Fisto and Eeth Koth.\nFor his brief appearance in Star Wars: Episode III Revenge of the Sith, Cin Drallig was portrayed by prequel trilogy stunt coordinator Nick Gillard, whose name was the basis for the character's name . Drallig was later voiced by Robin Atkin Downes in \"Sabotage,\" the seventeenth episode of the fifth season of the animated television series Star Wars: The Clone Wars.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Cin_Drallig",
  "/wiki/Cin_Drallig/Legends",
  "/wiki/Troll_Magazine_2",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Lavisar",
  "/wiki/19_BBY",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Yoda",
  "/wiki/Sammo_Quid",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Master",
  "/wiki/Battlemaster",
  "/wiki/Chief_of_Security",
  "/wiki/Imperial_Palace",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_Temple_Guard",
  "/wiki/Lightsaber",
  "/wiki/Jedi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Siege_of_the_Jedi_Temple",
  "/wiki/Homeworld",
  "/wiki/Padawan",
  "/wiki/Jedi_High_Council",
  "/wiki/Grand_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/21_BBY",
  "/wiki/Cad_Bane",
  "/wiki/Holocron_Vault",
  "/wiki/Holocron",
  "/wiki/Cloning",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Barriss_Offee",
  "/wiki/Hologram",
  "/wiki/Jackar_Bowmani",
  "/wiki/Letta_Turmond",
  "/wiki/Bombing_at_the_Jedi_Temple",
  "/wiki/Captain",
  "/wiki/Rackham_Sear",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Youngling",
  "/wiki/Mace_Windu",
  "/wiki/Depa_Billaba",
  "/wiki/Jedi_Initiate",
  "/wiki/Kanan_Jarrus",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Darth_Sidious",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/501st_Legion",
  "/wiki/Clone_trooper",
  "/wiki/Order_66",
  "/wiki/Whie_Malreaux",
  "/wiki/Bene",
  "/wiki/Lightsaber_duel",
  "/wiki/Holocron_of_Cin_Drallig",
  "/wiki/Denon",
  "/wiki/Noble",
  "/wiki/Rin_Praji",
  "/wiki/Rin_Praji%27s_estate",
  "/wiki/Kaikielius",
  "/wiki/Jedi_Temple",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Galactic_Empire",
  "/wiki/Kit_Fisto%27s_lightsaber",
  "/wiki/Eeth_Koth%27s_lightsaber",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Prequel_trilogy",
  "/wiki/Nick_Gillard",
  "/wiki/Tuckerization",
  "/wiki/Robin_Atkin_Downes",
  "/wiki/Sabotage_(episode)",
  "/wiki/The_Clone_Wars:_Season_Five",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Kanan_8",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/Nick_Gillard_From_Circus_to_Sith",
  "/wiki/Star_Wars_Insider_187",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Liberty_on_Ryloth",
  "/wiki/Children_of_the_Force",
  "/wiki/Holocron_Heist",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/Knights_of_Fate"
 ]
}