{
 "name": "Cindy O'Shaunessy",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Circa 27 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Cindy O'Shaunessy was a female Human who served in the Rebel Alliance during the Galactic Civil War.\nFrom an early age, O'Shaunessy had an interest in medicine and she joined the Alliance at the behest of a professor of medicine that she had trained under. At some point after the destruction of the planet Alderaan, O'Shaunessy and a team of Rebel agents were dispatched by the Alliance to the planet Tazan, to destroy an Imperial Data Processing Facility that was located on the world.\nAfter arriving on Tazan, O'Shaunessy and the rest of the team rendezvoused with the Alliance sympathizer Willer Clines in Clines' house, in the Desander Section of Tazan City. However, their conversation with Clines was secretly monitored by a group of Imperial stormtroopers and once the stormtroopers believed that Rebels had revealed all that they would about their mission, the stormtroopers entered Clines' lounge and attacked O'Shaunessy and the rest of the Rebels. The agents escaped and eventually infiltrated the Data Processing Facility, where they extracted some Imperial TIE Fighter communications protocols and then blew up the structure.\nWhen O'Shaunessy first joined the Rebel Alliance, she had little interest in politics and she poured all of her energies into saving lives. However, during her time with the Rebels, she witnessed first hand the callousness of the Galactic Empire and as a result, she became dedicated to helping the Alliance to overthrown the regime.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/27_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Professor/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Planet/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Mission_to_Tazan",
  "/wiki/Tazan",
  "/wiki/Imperial_Data_Processing_Facility",
  "/wiki/Willer_Clines",
  "/wiki/Willer_Clines%27_House",
  "/wiki/Desander_Section",
  "/wiki/Tazan_City",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Ultimate_Core_Dump",
  "/wiki/0_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/28_BBY/Legends"
 ]
}