{
 "name": "Cinta_Kaz",
 "display_name": "Cinta Kaz",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cinta Kaz's family",
      "Aldhani rebel infiltration team"
     ]
    }
   ]
  }
 ],
 "content": "Cinta Kaz was a human female member of Vel Sartha's team on a mission to break into the armory of the Aldhani Garrison on the Aldhani and steal the Imperial payroll.\nCinta Kaz was a human female whose entire family had been killed by stormtroopers. In 5 BBY, she was part of a rebel team led by her girlfriend, Vel Sartha. The team's mission was stealing the quarterly payroll of an Imperial sector by breaking into the armory of the Aldhani Garrison on the planet Aldhani. Kaz would eventually learn that her companion Taramyn Barcona was a former stormtrooper, but she was able to cooperate with him nonetheless.\nA complication arose three days before the heist when Luthen Rael delivered Cassian Andor to Sartha and demanded that she add him to the group for redundancy. Kaz and her companions were skeptical when Sartha brought Andor to their camp, but they began bringing him up to speed with their plans. Using her medical skills, Kaz treated a blaster burn on Andor's arm. Since the group was saving their pain medications, she warned him that it would hurt.\nThe next morning, Arvel Skeen shared his impressions of Kaz with Andor, and he advised that Kaz was already sharing a blanket as she and Sartha exited a hut together. When Taramyn Barcona drilled Andor, Skeen, and Karis Nemik on marching in formation, Kaz spotted an approaching TIE fighter and raised the warning, giving the team enough time to hide their weapons before the starfighter flew over them. Afterward, as the group packed up their camp, Kaz quizzed Andor on the Aldhani phrases he had learned thus far from the datapad supplied by Barcona.\nWhen Kaz learned that Sartha already knew and had not told her that Andor was a mercenary, Kaz was displeased. Around the campfire that evening, the group passed around a canteen. When Andor held it out to Kaz, Sartha stepped between them, intercepted it, and drank a toast to the rebellion. The team then split in two for their separate objectives; Sartha and Kaz left together.\nAndor, Barcona, Nemik, and Skeen entered the garrison disguised in Imperial military uniforms, but Kaz and Sartha used stealth to approach from behind the Aldhani dam. They first hid within a stone overhang along the reservoir's edge as they confirmed radio contact with the other team. Kaz quickly silenced Sartha when she realized several patrolling soldiers were approaching their hideout; Sartha stopped Kaz from drawing her blaster pistol on them. Under the cover of the Eye of Aldhani event, they dove into the water and then climbed a ladder on the dam's wall. Sartha placed equipment that they would use to disrupt Imperial communications. When the time came to confirm to Barcona via radio that the mission would proceed, Sartha initially froze while Kaz urged her to stop stalling and respond in the affirmative. They descended on cables from the top of the dam.\nIn the tower base room, the infiltration group captured a guard, Commandant Jayhold Beehaz, his wife, and his young son, along with the visiting Colonel Petigar, who threatened to shoot Nemik if the team did not release the child. Kaz ended the standoff upon her arrival by shooting and killing Petigar. She then held her blaster rifle to the child's head as Beehaz was forced to cooperate. The hostages, bound and gagged, were brought up to the observation tower. Nemik reviewed various functions on the control panels with Kaz before she took charge of the hostages while the rest of the team carried out the theft. Before they parted, Sartha held Kaz's hand and asked for assurance that Kaz would be all right; Kaz answered that she would.\nDuring the next minutes, Kaz dressed herself in an Imperial officer's uniform and turned off the facility's lights at the predetermined time. She left the hostages behind when she exited to the Old Temple where the Dhani pilgrims and their Imperial escorts were viewing the Eye.\nIn response to the heist, the Imperial Security Bureau launched an investigation and arrested many of the Dhani residents. Kaz was preparing to ride a speeder bike when an Imperial Star Destroyer flew over the sacred valley. Sartha initially journeyed to Coruscant, but the couple reunited on Andor's adopted homeworld, Ferrix.\nCinta Kaz had long black hair, brown skin, and brown eyes. At the time of the Aldhani mission, she was around mid-twenties in age. Skeen described her as stone cold, fearless, and probably the toughest member of the team.\nKaz and Vel Sartha were a couple.\nKaz had medical skills that included cleaning and dressing wounds, some knowledge of the Aldhani language, and proficiency with blasters.\nCinta Kaz was portrayed by Varada Sethu, and made her debut in the fourth episode of Andor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kaz",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Aldhani_rebel_infiltration_team",
  "/wiki/Vel_Sartha",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani_Garrison",
  "/wiki/Aldhani",
  "/wiki/Galactic_Empire",
  "/wiki/Death",
  "/wiki/Stormtrooper",
  "/wiki/5_BBY",
  "/wiki/Sector",
  "/wiki/Planet",
  "/wiki/Taramyn_Barcona",
  "/wiki/Standard_day",
  "/wiki/Luthen_Rael",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Aldhani_rebel_infiltration_team%27s_camp",
  "/wiki/Medic",
  "/wiki/Blaster",
  "/wiki/Arvel_Skeen",
  "/wiki/Karis_Nemik",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Starfighter",
  "/wiki/Aldhani_(language)",
  "/wiki/Datapad",
  "/wiki/Mercenary",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Aldhani_dam",
  "/wiki/Eye_of_Aldhani",
  "/wiki/Commandant",
  "/wiki/Jayhold_Beehaz",
  "/wiki/Roboda_Beehaz",
  "/wiki/Leonart_Beehaz",
  "/wiki/Colonel",
  "/wiki/Petigar",
  "/wiki/Standard_minute",
  "/wiki/Imperial_officer",
  "/wiki/Dhani",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Speeder_bike",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Coruscant",
  "/wiki/Ferrix",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Time",
  "/wiki/Varada_Sethu",
  "/wiki/Aldhani_(episode)",
  "/wiki/Category:Images_of_Cinta_Kaz",
  "/wiki/The_Axe_Forgets",
  "/wiki/The_Eye",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/One_Way_Out",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/Databank_(website)",
  "/wiki/Kassa_(episode)"
 ]
}