{
 "name": "Clariah",
 "display_name": "Clariah",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Clariah was a female Nautolan and old acquaintance of Lando Calrissian. She had a son, named Jiandy.\nWhile Lando Calrissian was the leader of Cloud City, Clariah came to visit him, bringing her son Jiandy with her. She sat down to talk with Lando, and explained to him that Jiandy's recent behavior was concerning her- he had been skipping school, spending time with suspicious people, and had expressed a desire to someday lead a criminal empire like Jabba the Hutt. Clariah revealed that she had one of Lando's favorite capes, which he thought he had lost, and promised she would give it back to him if he helped Jiandy see the error of his ways. At first, Lando refused, but when he saw Jiandy cheat at a game of cards and then trick his opponents into fighting each other, he changed his mind and agreed to do it.\nAfter Lando successfully convinced Jiandy to give up his dreams of being a gangster, Clariah came to talk to him again. As promised, she gave Lando his cape back, but expressed her concern that kids like Jiandy would continue to be tempted to a life of crime.\nClariah was a female Nautolan, with blue skin and large black eyes. She had circles of darker blue around her eyes, and bands of lighter blue on the tendrils on her head.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Nautolan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Jiandy",
  "/wiki/Cloud_City",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Cape",
  "/wiki/Gambling",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Tales_from_Wild_Space:_Family_Affair,_Part_1",
  "/wiki/Star_Wars_Adventures_(2017)_10",
  "/wiki/Tales_from_Wild_Space:_Family_Affair,_Part_2",
  "/wiki/Star_Wars_Adventures_(2017)_11"
 ]
}