{
 "name": "Clarr'os'culry",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Chiss Expansionary Defense Fleet",
      "Clarr family",
      "Chiss Expansionary Defense Fleet",
      "Clarr family"
     ]
    }
   ]
  }
 ],
 "content": "Captain Clarr'os'culry, known by the core name Roscu and later by the appellation The One They Could Not Kill, was a Chiss female and member of the Clarr family. She served aboard the Parala in her time in the Chiss Expansionary Defense Fleet along with Senior Commander Mitth'raw'nuruodo  and Captain Irizi'ar'alani. Soon after the pirate attack at the Garwian world of Stivic, she resigned her post in the Expansionary Defense Fleet and joined her family's fleet as the captain of the Orisson. During her time in the family fleet, she met Generalirius Nakirre and Jixtus, and also helped Thrawn in his efforts against the Grysk fleet, eventually receiving the offer to become the Venturous and Admiral Dy'lothe's Second Officer.\nBetween around 39 BBY and 19 BBY, Mid Captain Clarr'os'culry  served alongside Senior Commander Mitth'raw'nuruodo  and Captain Irizi'ar'alani aboard the Parala. At some point during Roscu's post aboard the warship, they picked up an urgent distress call from Second Defense Overlord Frangelic of the Garwian Unity. Although Roscu attempted to make the Chiss officers remain neutral and not go to the Garwian world of Stivic, however, Ziara and Thrawn dismissed her statements. After they arrived, Frangelic requested assistance, receiving none as the Chiss had a policy that did not allow them to help anyone, such as the Garwians, which were being attacked by the Lioaoin pirates. However, Thrawn stated that he could beat all four pirate warships with no serious damage to the Parala, however, Ziara sent Thrawn to check if the battle systems were ready.\nAfter Thrawn left the bridge, Roscu asked the Irizi if she was getting Thrawn off the bridge, receiving a no as answer. Roscu then insulted Thrawn's understandings of the Chiss protocols. And then, the communications officer told Captain Ziara that the laser cannons were being used, receiving a confirmation from the captain as Thrawn was calibrating them. Then, he stated that they were being modulated, and Ziara shared the same answer again. However, they noticed all pirate ships had began to move, and as they moved, they left their weapons clusters unprotected, allowing the Garwian ships to destroy their attackers, making all of them explode. After the confrontation had ended, Ziara asked Roscu if she was relieved, as the cafés that Roscu feared that could be destroyed were still in business.\nAfter the pirate attack on the Garwians, Roscu resigned her position on the Expansionary Defense Fleet, becoming a captain in the Clarr family fleet, defending her family. During the Chiss Ascendancy crisis, in 18 BBY, the Kilji war cruiser Whetstone arrived at Rhigar, as its earlier attempts to meet a Patriarch had been unsuccesful, and attempted to speak with Patriarch Clarr'ivl'exow , however, Roscu told the aliens, the leader of the Kilji Illumine, Generalirius Nakirre, and the Grysk agent Jixtus, that they would speak with her instead. Which they accepted. While Roscu prepared her new ship, the Orisson and a shuttle to join the aliens aboard the Kilji warship, she was informed that Admiral Dy'lothe and the Venturous were going to travel to Rhigar to assess the Kilji threat, and therefore, Roscu wanted the aliens gone before the Admiral arrived. Then, the captain boarded the Whetstone, and was welcomed by the taller alien, Nakirre, and the significantly smaller one, Jixtus. The Grysk offered her a refreshment, however, Roscu rejected his offer, making Jixtus complement her \"being direct\". The aliens later showed a recording of the Xodlak Dasklo families practicing a military operation—which in reality was the Hoxim incident—upon witnessing the families preparing for \"war,\" Roscu told Jixtus that she would buy the information, but first, she would consult it with her Patriarch, Rivlex.\nBefore she left, however, Jixtus told her that Generalirius Nakirre could provide defense forces to the Clarr if they wanted, and the Kilji added that they had \"many mighty ships of war,\" which Roscu rejected, stating that she would keep it in mind, and keeping to herself that the Kiljis could do something against the Forty, but would be crushed against the Nine Ruling Families. Just as she started to leave, Jixtus informed her that he would not provide the system in which the practice happened, as it assured him that she would come back with payment. Then, Roscu told the Grysk that she would bring enough to buy everything the alien had.\nAfter Jixtus and Nakirre met Roscu, Jixtus told the Generalirius that they were going to travel to the Chiss world of Ornfra. The Grysk then informed Nakirre that he was impressed with Nakirre's desire to be an equal of the Grysks, and added that that would be revisited after the Chiss were lying at their feet. Nakirre then stated that he did not like to tie the Grysk-Kilji schedule to Roscu's travels. Jixtus then asked the Generalirius when did he think Roscu's travels would end, to which Nakirre replied that it was now. Jixtus then confirmed it.\nShortly after the Grayshrike's arrival at Ornfra, the stronghold of the Dasklo family, which were the rivals of Roscu's, the Orisson arrived, and was confronted by two Dasklo destroyers, however, Roscu, that had been informed of a \"Mitth spy platform\" by Jixtus, jumped just in front of the \"spy platform,\" in reality, an asteroid missile platform, allowing a Grysk freighter stationed near the platform, which Ziinda was informed of by System Patrol. After Ziinda attempted to warn Roscu, Roscu cut the comm, spotting the freighter close to it, as the Clarr captain was still ignoring Ziinda, the Senior Captain ordered her crew to fire across the Orisson's bow, which got the Clarr's attention.\nAfter Roscu asked Ziinda what she was doing, the captain received information on the earlier encounters with missile platforms, as well as the \"spy platform\"'s true identity. Thanks to that, Ziinda was able to convince Roscu, however, when the asteroid rotated and the missile launcher was perfectly alligned to fire at the Clarr warship, it did not. However, Ziinda knew that if the Grysks had not fired, it was because they did not want to, instead of a malfunction. Then, as two Dasklo destroyers attempted to engage the Orisson, the Grayshrike sent plasma spheres at one of the destroyers, fooling the Grysks and making it seem that the Senior Captain wanted to kill the Dasklo, instead, disabling the freighter, which shortly after self-destructed, making the missile platform explode.\nAfter leaving Ornfra without any harm, Roscu returned to Rhigar, where she met Patriarch Rivlex. There, the Patriarch informed Roscu that she had failed in her two taks at Ornfra, catching the Mitth spy platform, and catching the Dasklo destroyers. However, although Roscu attempted to dismiss it by sharing the records done by the Grayshrike, as the Patriarch did not believe it was an \"asteroid missile platform,\" which failed, and then continued by sharing fleet protocols, which were also dismissed by the Patriarch. However, Rivlex then stated that unless someone wanted to cover up the incident, which with the Mitth was Supreme General Ba'kif, with the Clarr, it was no one. He then shared to Roscu that he had made a deal, and that now, they had the most powerful fleet in the Ascendancy, formed by Grysk Shatter-class and StoneCrusher-class WarMasters provided by Jixtus, which in fact, were part of the Grysk's own fleet. Roscu then asked the Patriarch that all followed the Ascendancy's rules, to which the Clarr patriarch replied that the Clarr could make their own rules, like the Defense Hierarchy Council.\nThen, Roscu left and met with Raamas, which informed the captain of the location of the Patriarch's new fleet, they arrived at their location, the \"Junkyard,\" where they found 6 Grysk battleships. Raamas and Roscu searched through the Grayshrike's reports on the ships they had fought over Sunrise and other locations, and noticed that the ships were in fact the same warships Ziinda had faced previously. Raamas and Roscu engaged in a conversation regarding the ship's procedence, with Roscu proposing that they were Jixtus' ships, or, at least, the same faction as Jixtus' or that they came from the same shipyards. After knowing what the Patriarch had obtained, the Orisson jumped to hyperspace.\nAfter the Orisson came back from hyperspace, Roscu confronted Rivlex, there, Roscu informed her Patriarch of her failures, and also promoted Raamas to captain, and removing every rank and title from Roscu, ordering the new captain of the Orisson to take Roscu in a shuttle to the homestead. As well as sending the Clarr warship to Ornfra again, to obtain proof that Rivlex needed to bring down the Dasklo. Adrer Raamas confirmed the orders, he asked his Patriarch if he wanted the Orisson to report to the Clarr's new fleet, or to the Patriarch directly, to which Rivlex replied that they must report to him directly. Although Raamas attempted to get the Orisson's crew a break from space, the Patriarch insisted on obtaining the proof at that time, with no delays. Shortly after the confrontation, Raamas ordered his pilot to make the Orisson go into hyperspace, receiving yet another question, regarding Roscu's passage to the homestead, then, Raamas acted as not knowing anything about that. Then, Roscu asked the captain what he was doing, and that he should follow the Patriarch's orders. Then, Raamas told Roscu that he would not follow orders from a Patriarch that had bought an alien fleet that had previously attacked Chiss, removed a member of the Clarr fleet because they did not fight the Dasklo all to have his private revenge on the Dasklo. Although Roscu attempted to make Raamas do what the Patriarch ordered, he failed, and Raamas made her the captain of the Orisson again.\nThen, Raamas ordered the Orisson's crew to travel to Schesa as fast as possible. And then informed the crew of why they were traveling there: rendezvous with Thrawn's fleet to defeat Jixtus and the incoming Grysk Hegemony forces that planned to destroy the Chiss, as well as to destroy Nakirre.\nThe Chiss fleet, consisting of Chiss Expansionary Defense Fleet and Chiss Expansionary Defense Fleet officers and warships, commanded by Senior Captain Thrawn and the Springhawk, amassed at Schesa, where they planned their future battle at Sunrise against Jixtus and the Grysks. The fleet would sparce scrap over the Sunrise system, and power down most of the ships' systems, so it would seem they were defeated, and the Grysks would come to them.\nLater, Generalirius Nakirre, Jixtus and Qilori—who piloted the Whetstone—traveled to the Sunrise system. Where they witnessed a destroyed Chiss fleet. The Sprignhawk then opened comm with the Whetstone, asking Nakirre if he was still there, to which Nakirre replied that he was, and asked if Thrawn was there, receiving yet another confirmation. Thrawn then informed Nakirre that the Kiljis had arrived too late to bring their enlightenment. He then asked if Jixtus was still traveling with Nakirre, receiving a confirmation from the Grysk, he then asked Thrawn various questions. Thrawn confirmed that the Magys and Magysines had been found and that they were aboard his ship. Jixtus continued by telling Thrawn that he had nothing to fight with, and that he had lost, however, he also stated that he was aware that there were many survivors aboard the Vigilant. Thrawn told him to leave the dead and dying alone, to fight him, and just him. Jixtus asked him if it wouldn't be beneficial to ease their suffering. However, he contradicted himself and stated that Thrawn was the one he intended to kill.\nTheir conversation continued, with Thrawn stating that he would not give the Magys and Magysines to the Grysk, as he had no patience to train them to their full potential. However, Jixtus unvelied that he had in fact trained General Yiv the Benevolent, and that the Benevolent's training had taken a lot of time and patience. Thrawn then denied that, as he believed the Nikardun simply lashed out at everyone on his path. Jixtus once again attempted to emerge victorious on the topic of patience, once again failing. Then, Thrawn told Jixtus that sending Yiv against the Paataatus had been an enormous mistake. He continued by telling Nakirre that he had sent the Kilhorde against several impoverished nations on the south and southeast of the Chiss Ascendancy, however, that had put them north and northwest of the Paataatus Hiveborn. Nakirre then asked Thrawn what he was saying, receiving confirmation of his fears, that the Hammer had been captured by Thrawn, and that data had allowed him to provide the Paataatus with a lot of information on the Kilhorde, which allowed them to attack the Kilhorde and destroy it. Nakirre denied that, stating that the Kilhorde was mighty and unshakable. However, Thrawn convinced Nakirre of the Kilhorde's defeat. Nakirre then screamed at Jixtus, telling him that thanks to him not viewing the Kilji Illumine as allies, the Kilhorde had been defeated, then, Jixtus shot Nakirre in the chest, killing him. Which made all vassals aboard to hunch aboard their stations. As they had lost their master.\nAfterward, Thrawn asked Jixtus if he wanted to surrender as he had already lost, and Jixtus then escaped the Whetstone and attempted to get to his flagship, the FateSpinner to command the Grysk fleet. As Roscu witnessed the escape pod flying toward the lead Grysk warship, Roscu ordered the Orisson's crew to continue laserfire and prepare three breachers, which she later shot at the SkySweep as the battleship had been damaged by a Chiss light cruiser, destroying an entire section of the battleship. Ar'alani informed Roscu that she had to play \"hunter\" while the Vigilant played \"prey.\" As the Grysk StoneCrusher-class WarMaster Armageddon pursued the Springhawk, the Orisson accelerated towards the Chiss heavy cruiser. Ziinda's Grayshrike was directly in front of the Armageddon, ready to destroy it. The Grayshrike shot two breachers, which crashed straight into the Orisson's, shattering the metals and creating a thick cloud of acid, which the Armageddon crashed into. Although Ziinda stated that she was going to assist the Orisson, Thrawn dismissed that and told Ziinda to help Csap'ro'strob , as Jixtus had figured out why his warships could not jump to hyperspace, which happened thanks to Apros' gunboat carrying a gravity well projector. As the Grysk battleships pursued Apros, twelve new warships appeared.\nMembers of the Garwian Unity, Vak Combine and Paccosh warships appeared right next to the gunboat, letting it escape and opening fire on the Grysk warships. After the alien warships left the Grysks for scrap, the FateSpinner rushed toward the Vigilant, Ar'alani requested assistance to the Springhawk, however, its thrusters had been damaged, and the Orisson was too busy with the BattleChiefs. Then, Apros and Ziinda joined forces and ran in parallel next to the FateSpinner, with that, Apros was being shielded by the Grayshrike, and making Jixtus unable to destroy the gravity well projector, making him unable to escape. However, Jixtus quickly disintegrated what was left of the Grayshrike, and in short time, almost destroying it. However, Qilori, who had figured out what would happen to the Navigators' Guild and to him if Jixtus survided, became the leader of the Kilji vassals aboard the Whetstone, and made them disintegrate the starboard aft flank of the FateSpinner, forcing Jixtus to destroy his forces, and himself, just before he stated that \"the Grysks would come back\".\nAfter the battle, Roscu engaged in a conversation with Rivlex, informing the Patriarch of her possible entry to the Defense Force as the second officer of Admiral Dy'lothe's Venturous, which was aboard Rhigar, and also attempted to make the Patriarch resign his position. After the call, Patriel Clarr'etu'vilimt  informed her of her new title, \"The One They Could Not Kill\", making reference to the Grysks' failed attempts on killing her, and Roscu informed Retuvili of Rivlex's position on resigning.\nLater, Roscu, along with all of Thrawn's Chiss allies and enemies, attended Thrawn's exile ceremony, in which he was exiled.\nCaptain Clarr'os'culry was a Chiss female. She had average height for a Chiss, higher than a Grysk, but much smaller than a Kilji, such as Nakirre. She was distrustful, specially toward aliens, such as Jixtus and Nakirre, but also toward Chiss that were not Clarr. She was a family-oriented woman, putting family and family prestige over anything else.\nRoscu used a Hold-out blaster, and commanded the Orisson.\nRoscu first appeared in the 2020 novel Thrawn Ascendancy: Chaos Rising, the first volume in Timothy Zahn's Star Wars: Thrawn Ascendancy Trilogy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Clarr_family",
  "/wiki/Captain",
  "/wiki/Core_name",
  "/wiki/Parala",
  "/wiki/Senior_Commander",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Ar%27alani",
  "/wiki/Pirate_attack_at_Stivic",
  "/wiki/Garwian",
  "/wiki/Planet",
  "/wiki/Stivic",
  "/wiki/Clarr_family_fleet",
  "/wiki/Orisson",
  "/wiki/Generalirius",
  "/wiki/Nakirre",
  "/wiki/Jixtus",
  "/wiki/Jixtus%27s_fleet",
  "/wiki/Venturous",
  "/wiki/Admiral",
  "/wiki/Dy%27lothe",
  "/wiki/Second_Officer",
  "/wiki/39_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Mid_Captain",
  "/wiki/Warship",
  "/wiki/Distress_signal",
  "/wiki/Second_Defense_Overlord",
  "/wiki/Frangelic",
  "/wiki/Garwian_Unity",
  "/wiki/Officer",
  "/wiki/Non-intervention_policy",
  "/wiki/Lioaoin_Regime",
  "/wiki/Privateer",
  "/wiki/Pirate",
  "/wiki/Bridge_(starship)",
  "/wiki/Irizi_family",
  "/wiki/Chiss_Ascendancy_crisis",
  "/wiki/18_BBY",
  "/wiki/Kilji_war_cruiser",
  "/wiki/Whetstone",
  "/wiki/Rhigar",
  "/wiki/Patriarch",
  "/wiki/Clarr%27ivl%27exow",
  "/wiki/Alien",
  "/wiki/Kilji_Illumine",
  "/wiki/Grysk",
  "/wiki/Shuttle",
  "/wiki/Kilji",
  "/wiki/Xodlak_family",
  "/wiki/Dasklo_family",
  "/wiki/Great_Families",
  "/wiki/Hoxim_incident",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Hoxim_system",
  "/wiki/Currency",
  "/wiki/Ornfra",
  "/wiki/Grysk_Hegemony",
  "/wiki/Grayshrike",
  "/wiki/Dasklo_destroyer",
  "/wiki/Mitth_family",
  "/wiki/Microjump",
  "/wiki/Asteroid_missile_platform",
  "/wiki/Ornfra_System_Patrol",
  "/wiki/Plasma_sphere",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Shatter-class_WarMaster",
  "/wiki/StoneCrusher-class_WarMaster",
  "/wiki/WarMaster",
  "/wiki/Defense_Hierarchy_Council",
  "/wiki/Raamas",
  "/wiki/Junkyard",
  "/wiki/Sunrise",
  "/wiki/Listening_post_KR21",
  "/wiki/Listening_post_KR20",
  "/wiki/Hyperspace",
  "/wiki/Realspace",
  "/wiki/Schesa",
  "/wiki/Thrawn%27s_fleet",
  "/wiki/Senior_Captain_Thrawn%27s_last_stand",
  "/wiki/Springhawk",
  "/wiki/Sunrise_system",
  "/wiki/Qilori",
  "/wiki/Yiv",
  "/wiki/Nikardun",
  "/wiki/Paataatus_Hiveborn",
  "/wiki/Paataatus",
  "/wiki/Paataatus%E2%80%93Kilji_conflict",
  "/wiki/Escape_pod",
  "/wiki/Flagship",
  "/wiki/FateSpinner",
  "/wiki/Breacher",
  "/wiki/SkySweep",
  "/wiki/Vigilant",
  "/wiki/Armageddon",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Acid",
  "/wiki/Csap%27ro%27strob",
  "/wiki/Gunboat",
  "/wiki/Gravity_well_projector",
  "/wiki/Vak_Combine",
  "/wiki/Navigators%27_Guild",
  "/wiki/Patriel",
  "/wiki/Clarr%27etu%27vilimt",
  "/wiki/Exile_(punishment)",
  "/wiki/Hold-out_blaster",
  "/wiki/2020",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Timothy_Zahn",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Rematching",
  "/wiki/Taharim_Academy",
  "/wiki/Mitth%27ali%27astov",
  "/wiki/Mitth%27ras%27safis",
  "/wiki/19_BBY",
  "/wiki/Template:ChaosRisingDate",
  "/wiki/Standard_decade",
  "/wiki/Sky-walker",
  "/wiki/Navigator",
  "/wiki/Merit_adoptive",
  "/wiki/Standard_year",
  "/wiki/Tomra",
  "/wiki/Naporar",
  "/wiki/General",
  "/wiki/Ba%27kif",
  "/wiki/Rematching_dinner",
  "/wiki/Avidich",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Clone_Wars",
  "/wiki/Ahsoka_Tano",
  "/wiki/Jedi_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Attack_on_Csilla",
  "/wiki/November_9",
  "/wiki/2021"
 ]
}