{
 "name": "Clausito",
 "display_name": "Clausito",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Kachirho Wookiee Militia",
      "Kachirho Wookiee Militia"
     ]
    }
   ]
  }
 ],
 "content": "Clausito was a Wookiee warrior aligned with the Galactic Republic during the Clone Wars. On the Wookiee homeworld of Kashyyyk, for several months prior to the battle there in 19 BBY, the capital city of Kachirho's militia—of which Clausito was a leader—consulted with Jedi Master Luminara Unduli. The Jedi took note of the species' proud warrior culture and prepared new defenses for the capital as well as repaired prior damage dealt by the Separatist Alliance.\nNamed by Star Wars creator George Lucas, Clausito was developed for an unfinished arc of the Star Wars: The Clone Wars animated series, set on Kashyyyk and written by Matt Michnovetz. A clip from the arc's unfinished story reels was shown at Celebration Anaheim in 2015, featuring Clausito, who was identified by series supervising director Dave Filoni following the clip's conclusion. The character was subsequently mentioned in the 2021 reference book Star Wars: Battles that Changed the Galaxy, which marked the first canonical mention of the character and also gave the proper spelling of Clausito's name.\nIn the unfinished The Clone Wars arc, Clausito was a Wookiee male major with gray eyes and black fur, which he wore in four braids at his beard. He also had claw-like weapons attached to his forearms. The clip played at Celebration Anaheim showed Clausito and several other Wookiee warriors, accompanied by the Republic's Clone Force 99, traversing Kashyyyk's forests when the group was attacked by the poisonous and web-spinning kinrath. Despite the unexpected encounter, the Wookiees and clones managed to eliminate the creatures. While encountering the kinrath, Clausito wore armor, a belt, and wielded a bowcaster.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Wookiee",
  "/wiki/Galactic_Republic",
  "/wiki/Kachirho_Wookiee_Militia",
  "/wiki/Wookiee_warrior",
  "/wiki/Clone_Wars",
  "/wiki/Homeworld",
  "/wiki/Kashyyyk",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Kashyyyk",
  "/wiki/19_BBY",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Kachirho",
  "/wiki/Jedi_Master",
  "/wiki/Luminara_Unduli",
  "/wiki/Jedi",
  "/wiki/Species",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Star_Wars",
  "/wiki/George_Lucas",
  "/wiki/The_Clone_Wars_Legacy",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Matt_Michnovetz",
  "/wiki/Celebration_Anaheim_(2015)",
  "/wiki/2015",
  "/wiki/Dave_Filoni",
  "/wiki/2021",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Gender",
  "/wiki/Major",
  "/wiki/Eye",
  "/wiki/Color",
  "/wiki/Braid",
  "/wiki/Claw",
  "/wiki/Clone_Force_99",
  "/wiki/Forest",
  "/wiki/Poison",
  "/wiki/Kinrath",
  "/wiki/Clone_trooper",
  "/wiki/Armor",
  "/wiki/Belt",
  "/wiki/Bowcaster",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Brent_Friedman",
  "/wiki/Collapse_of_the_Republic"
 ]
}