{
 "name": "Cleat",
 "display_name": "Cleat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Lothal system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Phoenix Squadron",
      "Phoenix Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Cleat was a human female who served as a pilot in the Alliance to Restore the Republic and flew under the callsign Phoenix Four during the Attack on Lothal. She was killed when Imperial pilot Commander Vult Skerris shot her down with his TIE/D Defender Elite as she was attempting to break through the blockade of the planet.\nCleat was a Rebel Alliance starfighter pilot who answered to the callsign Phoenix Four in 1 BBY. That year, she flew as part of a strike team of T-65B X-wing starfighters led by General Hera Syndulla that tried to attack the Imperial Armory Complex and nearby fuel depot on Lothal. After the rebel strike team exited hyperspace, Cleat remarked that while the Imperials had numbers the rebels had talent. Cleat's sentiments were echoed by fellow rebel pilot Mart Mattin and Hera's C1-series astromech droid Chopper. She and her fellow pilots complied with Hera's orders to stay with their wingmates.\nThe rebels were met by Grand Admiral Thrawn's Seventh Fleet, which deployed TIE fighters to intercept them. Under Hera's orders, Cleat and Phoenix Five pilot Duke, went to thin out the TIE fighters. Cleat and her wingmate complied with Hera's orders and shot down a TIE fighter each. Cleat told Duke to keep up. Amidst the dogfight, the Imperial ace pilot Vult Skerris appeared in a TIE/D Defender Elite with two TIE fighters behind Duke.\nCleat tried to warn Duke but he was swiftly shot down by Skerris. Skerris then turned his attention to Cleat and fired on her X-wing, taking out one of her engines. Over the comlink, Cleat reported that she was losing control. Hera told Cleat to scissor right so that she could cut them off. Before Cleat could do so, Skerris fired a second laser shot at the X-wing's engines. This caused Cleat's starfighter to explode, killing her in the process. Ultimately, Hera's strike team was wiped out by Thrawn's forces and Hera herself was captured after she crash-landed in Capital City. Cleat's sacrifice however was not in vain since Hera and her fellow Spectres managed to destroy the Lothal City fuel depot, which also damaged the Imperial factory and knocked out TIE/D Defender production on Lothal.\nCleat was a female human with light skin. She was a skilled T-65B X-wing starfighter pilot who believed that the Rebel Alliance's starfighter pilots were superior to the Empire's TIE fighter pilots despite the asymmetry in numbers. Cleat's confidence was misplaced when she was ambushed by the Imperial ace pilot Vult Skerris' TIE/D Defender Elite.\nCleat first appeared in \"Rebel Assault,\" the ninth episode of the fourth season of Star Wars Rebels. She was voiced by Anna Graves, who voiced Satine Kryze and Sugi in Star Wars: The Clone Wars.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/0_BBY",
  "/wiki/Lothal_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Phoenix_Squadron",
  "/wiki/Duke_(pilot)",
  "/wiki/Rebel_pilot",
  "/wiki/Callsign",
  "/wiki/Phoenix_Four",
  "/wiki/Attack_on_Lothal",
  "/wiki/Lothal",
  "/wiki/Death",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Commander",
  "/wiki/Vult_Skerris",
  "/wiki/TIE/D_Defender_Elite",
  "/wiki/Blockade",
  "/wiki/Planet",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/1_BBY",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Imperial_Armory_Complex",
  "/wiki/Lothal_City_fuel_depot",
  "/wiki/Hyperspace",
  "/wiki/Mart_Mattin",
  "/wiki/C1-series_astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/7th_Fleet",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Phoenix_Five",
  "/wiki/Engine",
  "/wiki/Comlink",
  "/wiki/Capital_City",
  "/wiki/Spectres",
  "/wiki/Rebel_Assault",
  "/wiki/Star_Wars_Rebels_Season_Four",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Anna_Graves",
  "/wiki/Satine_Kryze",
  "/wiki/Sugi_(bounty_hunter)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Battle_of_Jakku",
  "/wiki/Galactic_Civil_War",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/5_ABY",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Battle_of_Yavin",
  "/wiki/Wolves_and_a_Door",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Standard_year",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Yavin_Prime",
  "/wiki/DUME"
 ]
}