{
 "name": "Cleben",
 "display_name": "Cleben",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Cleben was a male Human corporate functionary who served as the stationmaster of Kantaros Station, a space station located in the Fervse'dra asteroid belt in the Both system, during the early years of the Galactic Empire.\nIn 18 BBY, Cleben greeted the Human Sacha Swiftbird, the Sullustan Den Dhur and the droid I-5YQ after they arrived on Kantaros station in disguise as Black Sun-affiliated traders while on a rescue mission to free Thi Xon Yimmon, a Cerean resistance leader who was being held prisoner aboard the station. Cleben warned Swiftbird and her compatriots not to stray into the Red Zone, an Imperial-controlled region of the station, and he agreed to purchase some cargo from them. However, as the goods were being off-loaded, I-5YQ deliberately dropped a crate onto Cleben's foot in order to create a distraction, to allow them to observe the security controls that governed access point to the Red Zone. Cleben howled out in pain and he was subsequently carried to the infirmary by some of his men.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kantaros_Station",
  "/wiki/Space_station/Legends",
  "/wiki/Fervse%27dra",
  "/wiki/Asteroid_belt",
  "/wiki/Both_system",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/Sacha_Swiftbird",
  "/wiki/Sullustan/Legends",
  "/wiki/Den_Dhur",
  "/wiki/Droid/Legends",
  "/wiki/I-5YQ",
  "/wiki/Black_Sun/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Thi_Xon_Yimmon",
  "/wiki/Cerean/Legends",
  "/wiki/Red_Zone",
  "/wiki/Limb/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Cleben",
  "/wiki/The_Last_Jedi_(novel)"
 ]
}