{
 "name": "Clem Andor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ferrix"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 18 BBY",
      "Ferrix"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Andor family"
     ]
    }
   ]
  }
 ],
 "content": "Clem Andor was a male human who accompanied his wife Maarva on the planet Kenari prior to 18 BBY. He was a skilled mechanic and salvager, and the adoptive father of Cassian Jeron Andor.\nAround the time of the Republic Era, Clem wielded an MW-20 Bryar pistol, which was wielded by his adopted son years later.\nAround 24 BBY, Clem and his wife Maarva embarked on a mission to salvage wrecked Separatist technology and equipment from a crashed starship on the planet of Kenari. Amongst the wreckage, Clem and Maarva found Cassian, a young Kenari boy, that had been exploring the wreckage. Though Clem admired the boy's spirit, he was anxious to leave as a Republic starship had begun approaching. In order to save him, Maarva stunned Cassian and removed him from the wreckage.\nIn 18 BBY, a year after the proclamation of the Galactic Empire, Clem, Maarva, and Cassian were living in a small town on the planet of Ferrix. Clem and Cassian were present in the town's square when a large contingent of clone stormtroopers and their officer were marching through. The town's people, upset with the newly-fledged Empire's presence, begun pelting stones at the passing troopers and demanded for the return of the former Republic and for Ferrix's liberation. Clem unsuccessfully attempted to calm the protestors, citing that they were making the situation worse. In response, the Imperial officer ordered his troopers to raise their weapons against the town's populace. Accused of having taken part in the protest, Clem was subsequently hanged in the town's square at Rix Road.\nLater, with his father's corpse still hanging, Cassian entered the town's square with a baton and charged a group of clone stormtroopers intending to kill them, but was apprehended and arrested.\nAfter the Ambush on Ferrix, Cassian chose his adoptive father's name as a false identity when undergoing a mission for Luthen Rael.\nClem Andor first appeared in \"Reckoning,\" the third episode of the television series Andor, portrayed by Gary Beadle.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Cassian_Jeron_Andor%27s_father",
  "/wiki/Ferrix",
  "/wiki/18_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Andor_family",
  "/wiki/Luthen_Rael",
  "/wiki/Maarva_Andor",
  "/wiki/Kenari",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Republic_Era",
  "/wiki/MW-20_Bryar_pistol",
  "/wiki/24_BBY",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Starship",
  "/wiki/Planet",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Clone_trooper",
  "/wiki/Officer",
  "/wiki/Hanging",
  "/wiki/Rix_Road",
  "/wiki/Baton",
  "/wiki/Ambush_on_Ferrix",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Clem_Andor",
  "/wiki/Reckoning_(episode)",
  "/wiki/Andor_(television_series)",
  "/wiki/Gary_Beadle",
  "/wiki/Aldhani_(episode)",
  "/wiki/Announcement",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Kassa_(episode)",
  "/wiki/5_BBY",
  "/wiki/Death"
 ]
}