{
 "name": "Clenna",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Yalln"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Imperial Army",
      "Galactic Outdoor Survival School"
     ]
    }
   ]
  }
 ],
 "content": "Clenna was a former Imperial sergeant and later a drill sergeant for the Galactic Outdoor Survival School.\nRaised on industrial world of Yalln, the young Clenna scouted unsettled terrains with his pet tal.\nHe lated joined the Imperial Army, wanting to become a drill instructor. He never managed to get the coveted job, but he nevertheless learned much, specially theory. Although the Imperial propaganda never brainwashed him, he nevertheless despised the Rebel Alliance.\nDuring Clenna's service at Ruac Outpost, he met and served with Derembus Sitnalta.\nSuddenly too old for the Empire, he returned to Yalln, but soon he grew restless.\nTrying to change his life, he joined the Galactic Outdoor Survival School as a means to \"bark orders to impressionable recruits\". He was instructed there by GOSS dean Barosa Warren, which increased Clenna's skill.\nDue to his loyalty to Warren, and due to Warren being enemy of certain Rebel officers, the Rebel Alliance considered Clenna a threat. His former acquaintance Sitnalta, who was a Rebel soldier as of 2 ABY, wrote a report on Clenna explaining that age had taken its toll on Clenna, but he was still dangerous because of his resources at GOSS.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Yalln",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Galactic_Outdoor_Survival_School/Legends",
  "/wiki/Derembus_Sitnalta",
  "/wiki/Sergeant/Legends",
  "/wiki/Tal_(creature)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Ruac_Outpost",
  "/wiki/Barosa_Warren",
  "/wiki/2_ABY/Legends",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}