{
 "name": "Cliegg Lars",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Died",
     "values": [
      "During or after 22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lars family",
      "White Suns"
     ]
    }
   ]
  }
 ],
 "content": "Cliegg Lars was a human male moisture farmer from the desert planet Tatooine. He lived and worked on a family farm he inherited from his parents with his son from his first marriage, Owen Lars, and Owen's girlfriend Beru Whitesun. Though the Lars family was content with their simple lives, they became involved with the White Suns liberation movement, which helped free Tatooine's slaves. Because of his work with the movement, Cliegg met his future wife, Shmi Skywalker Lars. Through his marriage to her, Cliegg would be the step-father of Anakin Skywalker and the step-grandfather of Luke Skywalker and Leia Organa.\nCliegg won Shmi's freedom in a bet with her enslaver, Watto, and the two moved to the Lars homestead, where they married and lived happily as moisture farmers. Using a deprogramming device the family had designed to remove Shmi's transmitter chip, the Larses secretly helped emancipate escaped slaves. One day, however, Shmi was captured by a band of Tusken Raiders. Cliegg organized a posse to rescue her, but the attempt failed. As he mourned her, Cliegg was visited by her son, Anakin Skywalker, who led his own rescue mission, but the boy returned only with her corpse. Cliegg never recovered from the incident and died of a broken heart shortly after. He was buried alongside Shmi on the farm, which was bequeathed to Owen and Beru.\nCliegg Lars was born to Lef and Gredda Lars on the Outer Rim Territories desert planet of Tatooine. Cliegg also had a brother, Edern. Despite the arid conditions of Tatooine and the danger posed by the native Tusken Raider tribes, the family became pioneers of the Great Chott salt flat and operated a moisture farm on the outskirts of a settlement known as Anchorhead. Cliegg helped found and build the underground homestead, and the family made their living harvesting water. Because the water harvests rarely supplied quantities sufficient to sell for profit, the family kept the water for themselves to sustain their hydroponic gardens instead.\nWhile still young, Cliegg wanted to experience life on a bustling Core World, leaving his father in charge of the Tatooine homestead. While away, Cliegg met a woman named Aika, and the two fell in love, married, and parented a son, Owen. They raised the boy together, but tragedy struck when Aika died, after which Cliegg decided to return to Tatooine with Owen. Cliegg was left the owner of the homestead after the rest of his immediate family, minus Owen, died as well. Edern was killed at the age of fourteen when he lost control of the family's V-35 Courier landspeeder, and Gredda and Lef passed away as well. All three were buried on the property. Without the rest of their family, Cliegg and Owen ran the farm together, and they were eventually joined by Owen's girlfriend, Beru Whitesun.\nIn secret, Cliegg, Owen, and Beru began helping White Suns, a liberation movement aimed at emancipating enslaved peoples on Tatooine. It was by chance that the Larses would be introduced to Shmi Skywalker, who would become an integral part of their family. While on a supply run in Mos Espa, Beru's portable navigator unit malfunctioned, and at a recommendation from the merchant she had been bartering with, she went to Skywalker's residence in the Slave Quarters Row to get it fixed for cheap. When Beru returned to Cliegg's home, she told him and Owen of Shmi's talent for tinkering, which interested the White Suns. Cliegg went to meet with her on behalf of the network, and he too became interested in her following their first conversation. In the following weeks, Shmi told Cliegg, Owen, and Beru of her enslaver, the Toydarian junk dealer Watto, namely what his weaknesses were and how he cheated to get around the White Suns.\nShmi spent most of her time with Cliegg, who hired her out from Watto, ostensibly to tune his moisture vaporators. They developed a liking for one another and, in their time spent together, they grew close. Shmi and Beru worked on building tracking devices, which they could use to locate the transmitter chips planted in those enslaved on Tatooine. Finally, the day came when Cliegg made his move to free Shmi from Watto's ownership. Knowing of Watto's gambling tendencies from Shmi's information, Cliegg lured Watto into a game where she was the promised prize. Lars won the game, and he quickly brought Shmi back to the boundaries of his homestead, finally setting her free even though the chip still remained.\nOver the next three months of trial and error, the Larses and Skywalker worked tirelessly to complete a working deprogramming device to remove Shmi's chip. The work was tedious, and it was only because of Cliegg's technical ownership of her that Shmi was able to have the device tested on her; had she still been under the control of an enslaver, she would have been killed the moment the chip was tampered with. Cliegg kept the monitoring device that controlled her chip in his office. Though Cliegg, Beru, and Owen continued to fret over the situation, Shmi remained positive, in part because her son, Anakin, who had once been Watto's slave but won his freedom and joined the Jedi Order, had always wanted to build a deprogrammer. At the end of the three months, Shmi and Beru finished the device and had only to test it once more.\nCliegg couldn't bear to watch the procedure again, and Owen took him to the other side of the homestead to keep him distracted. While Cliegg and Owen waited, Beru successfully located Shmi's chip, which was fused to her lower spine. Knowing that they would have only a short window before the monitoring device discovered that the chip was being disturbed, Beru quickly made cuts into Shmi's skin and removed the chip, deactivating it. Though Shmi would have lived even if the monitor found the chip was tampered with, the next person they tried the procedure on would not. Having made a successful scanner, Cliegg and his family continued to help escaped slaves and removed their chips when they could. Some of those they helped died during the chip's removal, but the Lars family remained devoted to their cause and Shmi worked endlessly to improve the device.\nHaving grown close in the time they knew each other, Cliegg and Shmi married, and Shmi adopted his surname. Cliegg, Shmi, Owen and Beru lived a quiet life at their homestead, where they survived against the harsh desert together. Shmi brought happiness into the Lars family, and she became a bright center and integral part of their unit. Though she was greatly content with her marriage to Cliegg and her life on the farm, Shmi spent many nights worrying about Anakin and his well-being. When she moved into the farm, she brought a protocol droid Anakin had built as a child, C-3P0, to work on the land.\nAlthough the homestead was an island of familial warmth amidst the vast desert wastes, tragedy soon struck. In 22 BBY, Shmi was picking mushrooms off the moisture vaporators just before dawn when a Tusken hunting party arrived and took her captive. Cliegg immediately investigated and concluded that she had been halfway home when the Tuskens took her. Cliegg assembled a quadrille of thirty moisture farmers, including himself, to save Shmi. The farmers tried bravely to rescue her, but twenty-six of them were killed in a violent skirmish with the Tuskens. Cliegg survived, but was seriously wounded in the attack, losing his right leg and damaging his left.\nOver the next month, Cliegg, confined to a repulsorlift chair, lost hope that Shmi still lived. One day, however, the farm was visited by Anakin Skywalker, who had been haunted by dreams of his mother in agony. Skywalker arrived with the Galactic Republic Senator Padmé Amidala, who was under his protection. They were led into the underground living area of the homestead by C-3P0, where they met Owen and Beru. Cliegg entered the room and introduced himself as Shmi's husband, then invited Skywalker and Amidala inside so they could discuss what had happened.\nIn the dining room, Cliegg informed Skywalker of Shmi's disappearance and the failed rescue attempt. Despite Cliegg's insistence that Shmi was dead, an emotional Skywalker vowed to find his mother. Cliegg implored him to accept that Shmi was gone, but Skywalker was adamant in his belief and left the farm that evening to track her down while Amidala stayed with the Larses. In the middle of the night, Anakin located the Tusken Raiders' camp and found his emaciated mother, who died in his arms as he attempted to leave with her. In a fit of rage, Skywalker proceeded to massacre the entire Tusken tribe.\nThe next morning, Anakin returned to the Lars homestead with Shmi's corpse. The Larses placed her body in a coffin, and she was buried next to Cliegg's parents and brother. A small funeral service was held later that day, and Cliegg briefly spoke his last respects. Anakin too spoke, but instead of memorializing Shmi, he swore never to allow himself to fail anyone else as he had failed her. The funeral was interrupted by Anakin and Padmé's droid, R2-D2, who informed them that he had received a message for them. The visitors remained at the farm for just a short while longer, and just as soon as they had arrived, Skywalker and Amidala left the Lars family alone once more.\nCliegg was bereft at the loss of Shmi, while Owen barely contained his anger as well. Beru remained steadfast and continued the family's work with the White Suns even as Cliegg and Owen dealt with the loss. After some time, Cliegg was determined to continue the life he had worked hard to create on Tatooine and began working to make the Lars homestead an oasis of security in the desert, but he quickly began to fade as the tragedy continued to weigh him down heavily. The once-strong man became weak even as time passed since Shmi's death, and he died from the wounds he received from the Tuskens and of a broken heart not long after her death. Cliegg's body was, like Shmi's, placed in a coffin and buried next to hers. The Lars homestead was bequeathed to Owen and Beru, who married and sought to continue the family's traditions.\nOwen and Beru worked hard to maintain the farm that Cliegg had founded. At the end of the Clone Wars, Owen and Beru were made the guardians of Luke Skywalker, Anakin's son. Owen and Beru were entrusted by Jedi Master Obi-Wan Kenobi, Anakin's former teacher, to keep Luke safe and hidden from his father, who had turned to the dark side of the Force and become Darth Vader amid the rise of the Galactic Empire. As a measure of keeping Luke safe, the headstones above Cliegg and Shmi's graves were sandblasted. Early in his stay on Tatooine to watch over Luke, Kenobi, ventured to Shmi's grave to apologize for Anakin's downfall. Though he had never known her, he felt guilt that he and the Jedi never released her from slavery as they did for Anakin, and reflected to himself that it was only Cliegg's love for her that saved her from bondage.\nObi-Wan often visited the the burial site and sometimes left toys there for the young boy. At some point, Owen and Beru went one step further and removed all the headstones from the Lars property, leaving Cliegg's grave, as well as that of his parents, brother, and second wife, unmarked. The Lars homestead was destroyed in 0 BBY when, after unknowingly taking in two fugitive droids, C-3P0 and R2-D2, Owen and Beru were executed by Imperial stormtroopers, and the farm was burned. Luke, who had been away from the farm at the time, joined Obi-Wan Kenobi on a mission away from Tatooine after their murders and became a hero in the Alliance to Restore the Republic. The farm was left abandoned after Luke left, and it became a target for Tusken Raiders, who damaged what was left of the former homestead despite the absence of any inhabitants.\nYears later, Darth Vader, after learning of Luke's existence and confronting him, returned to the homestead to learn more about his son. Vader was accompanied by a forensics droid, ZED-6-7, who listed off the former residents of the abandoned farm, including Cliegg and Shmi. Vader was haunted by his memories of his mother's death and his visit to the farm. ZED later located the coffins belonging to Cliegg and Shmi, which he detected were two meters below the surface. ZED speculated that Owen and Beru had removed the headstones, and his further scans found no evidence of Cliegg's son or daughter-in-law's remains. Vader and ZED left shortly after. The farm built by Cliegg Lars was left in its ruined state and, by 35 ABY, had begun to disappear under the sands of Tatooine.\nCliegg Lars was a human male who stood at 1.83 meters, or 6 feet. He had blue eyes, light skin, and blond hair, which by the time of Shmi's kidnapping was graying on the sides. Though a modest man content with his quiet and peaceful life as a moisture farmer on Tatooine, Cliegg had a yearning to experience a more bustling place to live in his youth. His life, however, was one marked by tragic losses. The death of his first wife, Aika, dashed Cliegg's dreams of a life away from Tatooine, and he also lived through the deaths of his brother and parents. Cliegg was a tough and strong-willed individual, but he was also a good-hearted and humorous person, and he used his sense of humor to make his second wife, Shmi Skywalker, laugh even in dire situations.\nWhen Cliegg and Shmi married, they happily formed a family unit with Owen and Beru and lived in peace on the Lars homestead. Cliegg was happy to be able to share his life with as good a person as Shmi was. Altogether, the Larses dared to aid in the emancipation of enslaved persons in secret and used their land as a place for escaped slaves to seek help. Though Cliegg was able to see his family create a warm and loving environment, their happiness was shattered by Shmi's kidnapping and death. The kind Cliegg became angry and spiteful towards the Tusken Raiders for what they did to her, and he saw them as nothing more than vicious animals. Cliegg never recovered from the loss, and though he attempted to accept her death, move on, and continue his life's work, he grew weaker without her and succumbed to his sadness, becoming a shell of the man he once was and eventually dying as such.\nCliegg Lars wore weather-worn work clothes, which included a light brown tunic and undershirt, gray pants, and a sleeveless gray duster coat. He also wore a gear harness that was wrapped around his midriff and slung over his left shoulder. After losing his right leg and injuring the other in his failed mission to rescue Shmi, Cliegg was forced to use a repulsorlift-powered chair to mobilize.\nCliegg Lars first appeared in the second film in the Star Wars prequel trilogy, Star Wars: Episode II Attack of the Clones, which was released on May 16, 2002. The name Cliegg, or variations of it, had existed since the earliest screenplay drafts of the original Star Wars. One rough draft from 1974 featured a young blonde Alderaanian character named Cliegg Whitesun.\nIn Attack of the Clones, Lars was portrayed by Jack Thompson. During shooting, Thompson wore a blue sock to facilitate the digital removal of his leg by Industrial Light and Magic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Cliegg_Lars",
  "/wiki/Cliegg_Lars/Legends",
  "/wiki/Lars_(disambiguation)",
  "/wiki/Tatooine",
  "/wiki/22_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Lars_family",
  "/wiki/White_Suns",
  "/wiki/Moisture_farmer",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Lars_Homestead",
  "/wiki/Aika_Lars",
  "/wiki/Owen_Lars",
  "/wiki/Beru_Whitesun_Lars",
  "/wiki/Slavery",
  "/wiki/Shmi_Skywalker_Lars",
  "/wiki/Marriage",
  "/wiki/Anakin_Skywalker",
  "/wiki/Luke_Skywalker",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Gambling",
  "/wiki/Watto",
  "/wiki/Transmitter_chip",
  "/wiki/Tusken_Raider",
  "/wiki/Cliegg_Lars%27_quadrille",
  "/wiki/Mission_to_rescue_Shmi_Skywalker_Lars",
  "/wiki/Death",
  "/wiki/Burial",
  "/wiki/Reproduction",
  "/wiki/Lef_Lars",
  "/wiki/Gredda_Lars",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Edern_Lars",
  "/wiki/Great_Chott_salt_flat",
  "/wiki/Anchorhead",
  "/wiki/Water",
  "/wiki/Hydroponics",
  "/wiki/Garden",
  "/wiki/Core_World",
  "/wiki/V-35_Courier",
  "/wiki/Landspeeder",
  "/wiki/Mos_Espa",
  "/wiki/Slave_Quarters_Row",
  "/wiki/Standard_week",
  "/wiki/Toydarian",
  "/wiki/Moisture_vaporator",
  "/wiki/Standard_month",
  "/wiki/Jedi_Order",
  "/wiki/Protocol_droid",
  "/wiki/C-3P0",
  "/wiki/Repulsorlift_chair",
  "/wiki/Galactic_Republic",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Tusken_Raider_camp_(Anakin_Skywalker)",
  "/wiki/Funeral_of_Shmi_Skywalker_Lars",
  "/wiki/R2-D2",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Galactic_Empire",
  "/wiki/0_BBY",
  "/wiki/Stormtrooper",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Duel_on_Cloud_City",
  "/wiki/Forensics_droid",
  "/wiki/ZED-6-7",
  "/wiki/35_ABY",
  "/wiki/Foot",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Jacket",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/May_16",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/1974",
  "/wiki/Alderaanian",
  "/wiki/Jack_Thompson",
  "/wiki/Industrial_Light_and_Magic",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Attack_of_the_Clones_Read-Along_Storybook_and_CD",
  "/wiki/The_Prequel_Trilogy_Read-Along_Storybook_and_CD_Collection",
  "/wiki/Star_Wars:_Attack_of_the_Clones_Graphic_Novel_Adaptation",
  "/wiki/Queen%27s_Hope",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Ahsoka_(audiobook)",
  "/wiki/Darth_Vader_(2020)_1",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_11",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_4",
  "/wiki/Droid_Directory",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Beru_Whitesun_Lars_(short_story)",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Time_of_Death",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Databank_(original)"
 ]
}