{
 "name": "Climber_(clone)",
 "display_name": "Climber  (clone)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicGrand Army of the Republic22nd Air Combat WingIon Team",
      "Grand Army of the Republic22nd Air Combat WingIon Team",
      "22nd Air Combat WingIon Team",
      "Ion Team"
     ]
    }
   ]
  }
 ],
 "content": "Climber was the clone commando captain of Ion Team in the 22nd Air Combat Wing during the Clone Wars.\n\"Climber\" was the nickname of one of the clones of the Mandalorian bounty hunter Jango Fett, born and trained on Kamino to fight for the Grand Army of the Republic in the Clone Wars. In command of his comrades Trace, Ras, and another commando, Climber fought alongside Jedi Master Roan Shryne at the Battle of Deko Neimoidia. The team later fought at Boz Pity and the Battle of Murkhana, where his life was saved when he impaled an attacking mercenary through the chest with a blue lightsaber borrowed from Shryne.\nWhen Commander Salvo attempted to ambush and kill Shryne, Bol Chatak, and her Padawan Olee Starstone according to Order 66, Climber prevented the ambush by detonating ECDs, disorienting Salvo and his troops. The commandos then relieved them of their weapons, thus allowing the Jedi to escape, much to Salvo's displeasure. Darth Vader himself came to Murkhana to provide discipline. Vader reproached the team, accusing them of treason. However, Climber took responsibility for his team, and felt justified in his actions. Lord Vader did not agree with Climber's assessment and drew his lightsaber. Ion Team fell back, drawing their weapons. When Vader moved on the commandos, they opened fire. Ras and another commando were killed when their blaster fire was deflected back into their helmets, and were then cleaved from the shoulder to the hip by Vader's lightsaber. Climber and Trace escaped into a nearby tree line. Climber was struck in the leg by one of his own deflected laser bolts. Vader sent his men to pursue them, with orders to bring them back alive. Climber was later captured by Commander Appo's men.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/22nd_Air_Combat_Wing",
  "/wiki/Ion_Team",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Clone_commando/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Trace_(clone)",
  "/wiki/Ras",
  "/wiki/Ion_Team%27s_munitions_expert",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Roan_Shryne",
  "/wiki/Battle_of_Deko_Neimoidia",
  "/wiki/Boz_Pity/Legends",
  "/wiki/Battle_of_Murkhana_(Clone_Wars)",
  "/wiki/Mercenary/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/Salvo",
  "/wiki/Bol_Chatak",
  "/wiki/Padawan/Legends",
  "/wiki/Olee_Starstone",
  "/wiki/Order_66/Legends",
  "/wiki/Electromagnetic_pulse_grenade",
  "/wiki/Murkhana/Legends",
  "/wiki/Treason/Legends",
  "/wiki/CC-1119/Legends",
  "/wiki/Dark_Lord:_The_Rise_of_Darth_Vader"
 ]
}