{
 "name": "Clone_99",
 "display_name": "Clone 99",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.68 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Military",
      "Republic Military"
     ]
    }
   ]
  }
 ],
 "content": "Clone 99 was a human male clone of Jango Fett bred to be a clone trooper for the Grand Army of the Republic. He was malformed in the cloning process, however, and suffered numerous genetic and physical defects. As a result, he was deemed unfit for service in the army and assigned to be a maintenance duty clone, providing janitorial and maintenance work on his home planet of Kamino. During his time on Kamino, he grew attached to clone cadets as they trained to become troopers, viewing them all as brothers and individuals, rather than clone numbers. He befriended Domino Squad during their time training, and stopped Hevy, a member of Domino Squad, from abandoning them. He inspired Hevy and urged him to see himself as a team with his squad instead of as alone. This led to the squad passing, and Hevy gave 99 his medal in both thanks and as a reason to come back to visit him on Kamino.\nLater in the war when CT-5555 \"Fives\" and CT-1409 \"Echo,\" former members of Domino Squad, returned to Kamino he helped them and other clones fight against the Separatist invasion of Kamino, a battle in which 99 lost his life while trying to get more ammunition for the clones. Shortly thereafter, he was mourned in death by the clones he considered brothers, and it was stated he had been a true soldier and one of them. Clone Force 99, a clone commando squad composed of genetically mutated clones, was named in his honor.\nClone 99 suffered from genetic and physical defects due to errors when he was being cloned. As a result, he aged faster than his fellow clones. When other clones trained on Kamino and left to serve the Galactic Republic in the Clone Wars, 99 stayed on his home planet and served as a maintenance duty clone.\nDuring 99's service, he saw many clone cadets graduate and become clone troopers. In 22 BBY, he witnessed bounty hunter Bric, who had been hired to assist in clone cadet training, belittle a Domino Squad, a group of struggling clone cadets. 99 took it upon himself to help Domino Squad out, offering advice specifically to the brash CT-782. One night after the squad failed the Citadel Challenge, 99 met CT-782 in the barracks, seeing him pack up his gear. When 99 asked what he was doing, CT-782 replied that he was leaving because he and his squad were failures. 99 encouraged him not to give up on himself or his brothers, but CT-782 adamantly responded that he had no choice. 99 delivered an impassioned speech, telling him not to throw away his chance, which was a chance that he never had. He told CT-782 not to give up as long as his brothers were at his side, calling him \"Hevy,\" and when CT-782 lashed out at the older clone, saying that he did not have a name and was just a number, 99 replied that to him, he had always had a name. Reconsidering his actions, \"Hevy\" embraced his nickname and became the leader that his squad needed him to be, coming together and passing the challenge the next day.\nUpon their graduation, Hevy gave 99 his graduation medal as a gift for his help and friendship. 99 told him that he could not accept the gift, but Hevy just smiled and said goodbye to his friend, telling him he would get it back from him later.\nWhen many clones were called back to their homeworld to defend Kamino from Separatist invasion, 99's role changed from maintenance to assisting in defense preparations. He helped distribute weapons to the clones that dug in around Tipoca City. 99 noticed Domino Squad members CT-5555 \"Fives\" and CT-1409 \"Echo\" in the hallways, and after greeting them, asked them where Hevy was. The two mournfully revealed that Hevy had been killed, to which 99 was saddened. He showed the two clones that Hevy had given him his graduation medal, which both clones were shocked to learn.\nWhen the Separatist forces led by General Grievous arrived, 99 witnessed the death of ARC Trooper \"Havoc.\" Later, he would run in to Fives and Echo again, helping a group of lost clone cadets. 99 led the group to the armory and set up an ambush in the sleeping quarters. Together, with Clone Captain CT-7567 \"Rex\" and Clone Commander CC-2224 \"Cody\" now among their ranks, they lured the droids into the barracks and allowed the cadets, who had hidden in the bunks, launch a surprise attack at them from above. As Fives and Echo used the last of their EMP grenades, 99 ran to get more but was brought down by enemy fire. 99 died in his comrades Echo's arms, reassuring them that he was willing to die as a soldier, as it was what he was bred for.\nClone Force 99, a clone commando squad composed of clones who also had genetic mutations, was named in his honor. Task Force 99, a special forces Imperial stormtrooper squad, was in turn named after the Clone Force.\n99 was a kind and knowledgeable individual, helping him to take the cadets of Domino Squad under his wing. He took pride in his clone heritage and was always helpful and supportive to his brothers, particularly cadets.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Clone_99",
  "/wiki/99",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kamino",
  "/wiki/21_BBY",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_Military",
  "/wiki/File:ThisIsWhatIWasBredFor-ARCT.ogg",
  "/wiki/Jango_Fett",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Genetically_defective_clone",
  "/wiki/Army",
  "/wiki/Maintenance_duty_clone",
  "/wiki/Planet",
  "/wiki/Time",
  "/wiki/Clone_cadet",
  "/wiki/Trooper",
  "/wiki/Domino_Squad",
  "/wiki/CT-782",
  "/wiki/Squad",
  "/wiki/Medal",
  "/wiki/CT-5555",
  "/wiki/Echo",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Battle_of_Kamino",
  "/wiki/Death",
  "/wiki/Soldier",
  "/wiki/Clone_Force_99",
  "/wiki/Clone_commando",
  "/wiki/File:ComeCleanUp-CC.ogg",
  "/wiki/Clone_Wars",
  "/wiki/22_BBY",
  "/wiki/Bric",
  "/wiki/Citadel_Challenge",
  "/wiki/File:OneOfUs-ARCT.ogg",
  "/wiki/Tipoca_City",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Havoc_(ARC_trooper)",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Electro_Magnetic_Pulse_grenade",
  "/wiki/Task_Force_99",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Clone_Cadets",
  "/wiki/ARC_Troopers",
  "/wiki/The_Bad_Batch_(episode)",
  "/wiki/Category:Audio_files_of_99",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/Clone_Tales",
  "/wiki/Star_Wars_Insider_187",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Convergence_(Star_Wars:_Destiny)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_The_Final_Countdown",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/StarWarsKids.com",
  "/wiki/Databank_(website)"
 ]
}