{
 "name": "Clyngunn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "ZeHethbra"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Smugglers' Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Clyngunn was a male ZeHethbra with mostly black fur covering him from head to toe, with the exception of a wide white stripe running from his nose, up over his head and down his back. He frequently wore tunics or cloaks of blue and black, doffing them quickly if he got into a fight.\nHe was an ex-champion of the Stratis Games on his home planet, having set the record for downing the most sentient opponents in a single round in the Unarmed Combat category. With the credits won from that, Clyngunn bought himself a star yacht and toured a variety of resort planets, but he soon found the life of a sports-star, with its never-ending parade of fans, to be boring, and he turned his back on that life.\nTraveling to the Outer Rim, Clyngunn met the aging smuggler Billey, himself something of a legend amongst his fellows. It was through Billey that Clyngunn finally found something that offered the thrills and excitement the ZeHethbra was looking for: the life of a smuggler. Trading his yacht for a freighter, Clyngunn set about customizing it for speed, cargo concealment, and most importantly, combat readiness. He smuggled spice and guns. At one point, he was stopped by Imperial Customs forces, but was released due to his sports fame.\nPrimarily due to the fact that he preferred to work alone, Clyngunn did well for himself. Clyngunn didn't really like most other smugglers, as shown in his interview with the Imperial Security Bureau regarding BoShek. However, events in the galaxy were happening that would make it difficult for a lone smuggler to earn his keep.\nWith the collapse of the Empire and the subsequent chaos surrounding the ex-Imperial generals and warlords fighting over the remnants, as well as penalties for smuggling growing stiffer, it became difficult for a smuggler to make a living. Clyngunn joined Talon Karrde's Smugglers' Alliance to fight against Grand Admiral Thrawn. He did ensure to get Karrde's personal guarantee that he wouldn't be expected to change his attitude towards working on his own.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/ZeHethbra",
  "/wiki/Gender/Legends",
  "/wiki/Smugglers%27_Alliance",
  "/wiki/Cloak/Legends",
  "/wiki/Stratis_Games",
  "/wiki/Homeworld/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Yacht/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Billey",
  "/wiki/Freighter/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Imperial_Office_of_Customs/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/BoShek/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Talon_Karrde",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/General/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/The_Last_Command",
  "/wiki/The_Last_Command_(comics)",
  "/wiki/Specter_of_the_Past",
  "/wiki/Specter_of_the_Past_(unabridged_audiobook)",
  "/wiki/The_Last_Command_Sourcebook",
  "/wiki/The_Thrawn_Trilogy_Sourcebook",
  "/wiki/Underworld:_A_Galaxy_of_Scum_and_Villainy",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Smuggler%27s_Alliance",
  "/wiki/Star_Wars_Gamer_3",
  "/wiki/Ships_of_the_Smuggler%27s_Alliance",
  "/wiki/Star_Wars_Gamer_4",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}