{
 "name": "Cobb_Vanth",
 "display_name": "Cobb Vanth",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Freetown"
     ]
    }
   ]
  }
 ],
 "content": "Cobb Vanth, also known as \"the Marshal,\" was a human male who lived during the Galactic Civil War and subsequent New Republic Era. Once a slave, he rose to become marshal of Mos Pelgo on the planet Tatooine. He despised the Red Key Raiders, a syndicate attempting to establish itself on the planet. Immediately following the Battle of Endor, Vanth fled into the desert following Mos Pelgo's takeover by the Mining Collective. He then encountered some Jawas and traded a camtono of silicax oxalate crystals for a set of Mandalorian armor.\nJust then, Red Key employee Adwin Charu approached the sandcrawler. Vanth conversed with Charu and helped the man find valuable equipment on the vehicle. When Charu found the armor and wished to take it for himself, Vanth injured Charu, leaving him alive to send a message to his boss Lorgan Movellan. Vanth returned to town and single-handedly drove away the Collective, assuming the role of mayor and protector of Mos Pelgo.\nAs sheriff and mayor of Mos Pelgo, which was eventually renamed Freetown, Vanth led the residents in defying the Red Key Raiders. In 5 ABY, he rescued the beastmaster Malakili from a pair of raiders. Vanth recruited the beastmaster to tend to some rontos in Freetown and an infant Hutt which had been acquired from the Red Key Raiders.\nSometime later, the Red Key attacked and captured Freetown, overpowering the residents. Movellan confronted Vanth, both questioning each other's motives on Tatooine. The Hutt was then brought out with Malakili, and it gave a shriek, signaling Tusken Raider reinforcements against the Red Key Raiders. Vanth then carved a message onto Movellan for the crime boss's superiors.\nBy 9 ABY, Vanth still led and defended the town, including battling Tusken Raiders who raided their village multiple times. At one point, the Mandalorian bounty hunter Din Djarin came to town searching for a fellow Mandalorian. Vanth agreed to give Djarin his armor in exchange for helping him kill a krayt dragon that lived nearby. Vanth and Djarin allied themselves with a local group of Tusken Raiders as well as the people of Mos Pelgo and succeeded in defeating the beast, after which Vanth gave Djarin the armor and parted ways with him.\nLater, when the Pyke Syndicate was attempting to absorb Tatooine into their spice trade, Vanth killed three Pykes who were trying to smuggle spice in his territory. A single survivor was allowed to escape in his landspeeder. Shortly following this, Vanth was visited by Djarin, who asked him to assist Daimyo Boba Fett in his war against the Pykes. After Djarin left, Vanth was shot by Cad Bane, who told the inhabitants of Freetown that if the spice trade continued, they would remain unharmed. Following a battle, the Pykes were repelled from the planet, and Vanth received treatment for his wounds by a modifier.\n\nCobb Vanth lived on the desert planet of Tatooine his whole life and was once a slave, having a star-shaped mark carved onto his back as a sign of ownership, but eventually became free and came to be the sheriff of the town Mos Pelgo. The death of Jabba the Hutt and end of the Galactic Empire's occupation of Tatooine in 4 ABY led to a power struggle on the planet, and the Red Key Raiders, a crime syndicate led by the Weequay Lorgan Movellan that operated under the guise of a legitimate mining company, began to establish itself on the planet.\nThe very night after the Battle of Endor, that same year, a detachment of the Red Key Raiders known as the Mining Collective arrived at Mos Pelgo and attacked the patrons of the local bar. As they began rounding up citizens, Vanth and the Weequay bartender Taanti fled the bar, with Vanth grabbing a camtono before taking off into the desert. After days wandering around, lost without food or water, Vanth eventually collapsed and was discovered by a group of Jawa scavengers. After giving him water aboard their sandcrawler, the Jawas opened the camtono and realized that it was filled with silicax oxalate crystals. Vanth was offered multiple objects for the crystals, including the astromech droid N0-AH, but Vanth refused them all, instead pointing to a set of damaged Mandalorian armor, which once belonged to the bounty hunter Boba Fett.\nWhile Vanth was still in the sandcrawler, Adwin Charu, a representative of the Red Key sent by Movellan, arrived to barter with the Jawa scavengers for droids, weapons and mining equipment. Greeting Charu, Vanth identified the representative as an off-worlder. After Adwin asked how Vanth knew, the sheriff told the Red Key employee that he looked too clean and did not know that the Jawas worked on rapport. Charu insisted that he did not have time to build rapport with Jawas and expressed the thought of visiting Mos Pelgo instead. Vanth agreed that the town or the spaceport city Mos Espa could help, and Charu attempted to leave. However, Vanth stopped the representative and decided to vouch for him to the Jawas.\nWhen Charu asked what price the he wanted, Vanth turned down the prospect of being paid. The Red Key employee agreed, and asked for the sheriff's name, which the lawman willingly stated. Vanth then negotiated with the Jawas, promising that both he and Charu had credits. Two Jawas led the pair to a room containing droids, weapons, and the wreckage of a Hutt sail barge. Vanth and Charu looked around the room until Vanth asked Charu if he was with the \"Red Key Company,\" which the representative admitted, and mentioned the Tatooine's vacuum that the company could fill.\nCharu then eyed the Mandalorian armor, which he wished to bring to Movellan. Vanth made note of his desire to take the armor with him instead. Charu shut down Vanth, and the sheriff revealed his title to the Red Key employee. As Adwin then threatened to draw his blaster, Vanth drew his own and shot the representative in the shoulder. After explaining his disgust of the Red Key Raiders, the sheriff claimed that he was bringing law to a lawless place. Charu begged Vanth not to kill him, and the lawman asked the representative to tell Movellan to leave the sector.\nVanth returned to Mos Pelgo, wearing his newly acquired Mandalorian armor, entering the bar he had last been at. As he regarded the multiple Mining Collective members in the building, he nodded at the Taanti, who slowly took cover. Vanth then opened fire on the Collective, who failed to return fire as Vanth's armor protected him. Vanth watched as the remaining members fled for their lives in a transport, but Vanth fired a missile from his jetpack to blow up the transport. Following the event, Vanth began to watch over Mos Pelgo and protect the citizens.\nBy the year 5 ABY, Vanth was the de-facto mayor of Mos Pelgo, since renamed Freetown, where residents took a stand against the Red Key Raiders. The Red Key attempted to smuggle an infant Hutt into the palace dias at Freetown, but were stopped by Vanth, who acquired the young Hutt. One day, Malakili, the former beastmaster of the late Jabba the Hutt, was robbed by two Red Key thugs on his way to Freetown. Vanth, though, arrived with his Twi'lek companion Issa-Or and fired on the gangsters, quickly killing them.\nVanth and Issa-Or allowed Malakili to get up and claimed they were the law, both of them introducing themselves and Freetown to the beastmaster. Vanth recognized Malakili, but the beastmaster claimed that he was no one and was still mourning the death of his rancor Pateesa. Learning of Malakili's trade, the sheriff invited the beastmaster to live in Freetown as an animal trainer for the young Hutt and some resident rontos. Malakili took the offer, and Vanth and Issa-Or left for Freetown with the beastmaster.\nAlthough Freetown came to conflict with Tusken Raiders, Vanth, with the assistance of Malakili, struck a deal with the raiders to help protect Freetown by giving them water and a pearl from a krayt dragon's belly. The Tuskens regarded Freetown as a sacred place and respected the fact that they had a Hutt, which was since named Borgo. Movellan, however, led an attack on Freetown. Vanth and the residents were overpowered by the Red Key criminals, some being killed in the fighting. Upon the occupation, Movellan had two raiders, the Gran Yimug and the Rodian Gweeska, bring the cuffed sheriff before him. As Vanth was brought forward, he was thrown to the ground by the Yimug and Gweeska kicked him, the other Red Key Raiders cheering around them.\nMovellan mocked Vanth's Mandalorian armor and ordered Yimug and Gweeska to remove the sheriff's helmet. Lorgan then acknowledged Vanth for being a hindrance to the Red Key, Vanth bragging that it had brought the crime boss to Freetown, and inquired on the Vanth's intentions. After the sheriff expressed his desire for freedom, Lorgan discovered Vanth's slave mark. When Vanth asked what Movellan wanted on Tatooine, the Weequay revealed that he wished to enslave the town's population, exploit Tatooine for its dilarium oil and silicax oxalate, and sell Borgo to the Hutts.\nMovellan ordered two more raiders, the Ithorian Vommb and the brute woman Trayness, to bring forth the young Hutt and Malakili. After Lorgan taunted Vanth a final time, the sheriff returned his own remark and signaled to Malakili, who gave an order to Borgo. As the the crime boss had Trayness club the beastmaster, the Hutt gave out a shriek. This alerted Tusken Raider reinforcements to Freetown, which attacked the Red Key Raiders. As fighting broke out in the town between the raiders and the Tuskens, Vanth freed himself from his cuffs with the help of Malakili and attacked Movellan, disarming the crime boss and bringing him to the ground.\nAfter Vanth told Movellan of his deal with the Tuskens, the Weequay tried to intimidate Vanth by threatening to bring his masters to wipe out the town. Undaunted by Movellan's threats, the sheriff told Lorgan that the crime boss did not know who Vanth really was. Despite knowing that he had incurred the wrath of Red Key, the sheriff stated that he was ready to die in the service of protecting Freetown and keeping criminal elements away from Tatooine. As a parting insult to the defeated crime boss, Vanth proceeded to carve a message onto Movellan's face.\nAround 9 ABY, the Mandalorian bounty hunter Din Djarin arrived in the town searching for another Mandalorian. After learning of the man known as \"The Marshal,\" Djarin met Vanth in the local cantina. Vanth ordered two snorts of spotchka before telling Djarin that he had never met a real Mandalorian. He elaborated by saying that he knew the stories of the Mandalorians and how they were renowned for their killing ways. Vanth said that he figured only one of them was walking out of the bar, but when he saw Grogu, he said that maybe he had misjudged the Mandalorian. When Djarin demanded Vanth give up his armor, Vanth refused and stood up, preparing for a standoff.\nHowever, a nearby krayt dragon caused an earthquake that shook the entire town and ate another one of their banthas. Vanth explained to Djarin that the creature had been terrorizing the area since before Mos Pelgo was established. Vanth had been protecting the town from sand people and bandits, but the dragon was too much for him alone. He offered his armor to Djarin in exchange for help in taking down the beast, saying later he was more fond of the town than his armor. Vanth and Djarin began to ride to the krayt dragon's lair on speeder bikes. On the way there, Vanth told Djarin the story of how his city had been turned into a slavery camp the very same night they heard news of the destruction of the second Death Star, how he acquired his Mandalorian armor from Jawas, and how he took back the town with his newfound weapons.\nAs they rode, they heard a noise of a creature. Both of them immediately stopped their bikes and pulled out their weapons. Grogu hid in his bag. While Vanth watched nervously as the creatures came out from behind the rocks, Djarin began to communicate with them. A group of Tusken Raiders came out as well, and Djarin explained that they too were trying to kill the dragon. The pair made camp for the night with the Tuskens. Whilst sitting at a campfire, Vanth accidentally offended the Tuskens by not drinking a black melon. Vanth and the sand people began to argue, with Vanth claiming that he only killed their people in self-defense. Djarin then activated his flamethrower and told the both of them to settle down and focus on how they would kill the dragon.\nVanth, Djarin, and the sand people then rode by bantha to the abandoned sarlacc pit where the krayt dragon lived. Djarin translated for the Tuskens, explaining that they had studied its digestive cycle for generations, and knew how to feed it in order to make it sleep. The Tusken at the entrance of the cave tied down the bantha and began to yell in an effort to awaken the dragon. As Vanth watched on apprehensively, the Tusken tried to run away, but tripped and was consumed by the dragon, leaving the bantha unharmed. Grogu looked away, frightened, and Djarin suggested that they might be open to new ideas.\nThe cohort regrouped, and the sand people arranged a diorama of bones and pebbles, which represented the krayt dragon and its combatentes, respectively. Vanth insisted that it was not to scale, and that the krayt was too big, but Djarin assured him that it was, and that Vanth was unaware of the sheer size of the dragon. After a signal from Djarin, a Tusken Raider sprinkled in a few more pebbles. Vanth asked where the reinforcements would be coming from, and to Vanth's shock, Djarin explained that he had volunteered the people of Mos Pelgo.\nVanth and Djarin took their speeders back to Mos Pelgo. The people of Mos Pelgo gathered in the cantina. Vanth explained the problem of him having the Mandalorian armor, and that Djarin felt it was his right to take it. He also laid that Djarin was willing to help slay the krayt dragon, which had been terrorizing the town, in exchange for the armor. The people accepted this, but Vanth then revealed to them that the sand people were willing to help with the crusade. This set them off, proclaiming that they were monsters. Djarin then gave the case for the Tuskens, saying that although they were indeed raiders, they knew more about the krayt than anyone there, and would keep their word. If the carcass of the dragon was left to them, they promised to stand by Mos Pelgo in battle, and never to attack them again, unless Mos Pelgo were to break the peace. This was begrudgingly accepted.\nAs they prepared supplies and weapons, the sand people arrived on their banthas. The people of Mos Pelgo began to load the supplies onto the banthas. One of the Tuskens dropped an explosive, which caused a villager to retaliate. He began to yell at the Tusken, who started to yell back at him, until Vanth stepped in and broke up the fight, explaining that it was an accident. The fighting stopped, but the tension remained.\nThe group walked to the krayt dragon's cave. One Tusken walked up to its entrance and felt the ground near it. Djarin translated that the dragon was sleeping, and one could hear its breathing. A trench near the cave was dug, and the explosives were buried in it. The sand people also prepared a number of ballistae. A villager named Jo then handed the detonator to Vanth, who told her to stay safe. A trio of Tuskens walked up to the cave and began to yell to wake up the dragon. They ran away as soon as they heard it arise. Vanth watched as the dragon slowly crawled out. The Tuskens fired their arrows, but the dragon started to move back inside the cave. Vanth was about to detonate the explosives, but Djarin cautioned that they would only have one shot, and that they would have to get it out.\nThe villagers and sand people began to fire arrows and blaster fire at the krayt, provoking it to come out further. The krayt dragon then fired a stream of its spit on its attackers, killing several of them. It was then that Vanth detonated the explosives at Djarin's instruction. The group cautiously walked towards the explosion, although Vanth and Djarin did not think it to be dead. The dragon then suddenly burst through the hill above its cave and fired another stream of spit. Vanth remarked that they were being picked off like womp rats, put on his helmet, and flew with Djarin via his jet pack toward the dragon. The pair began to fire at it with their blaster rifles. They both took off when the krayt took notice of them.\nIt then disappeared again, and came out of the ground from behind them, chasing after the Tuskens and Mos Pelgo residents. Djarin told Vanth to get its attention, so Vanth bent over and fired a missile from his armor at it. He handed the detonator to Djarin, who subsequently hit Vanth's jet pack, causing it to malfunction and shoot straight into the air. Djarin then armed a batch of explosives that were attached to a bantha, and had the dragon swallow the both of then. The dragon then went back underground. Vanth landed awkwardly nearby. The group, including Vanth and Grogu, looked around for the krayt, wondering if Djarin would be alright. It then came back above ground, and Djarin flew out, having used his Amban phase-pulse blaster to give the dragon an electric shock. He then detonated the bantha, which remained in the krayt's stomach, killing the dragon.\nBoth parties of the group began to celebrate together, as Vanth watched. The sand people hacked away at the meat, and eventually found the krayt dragon pearl they were looking for. Djarin apologized for not explaining his plan, but Vanth told him not to worry about it, handing over the Mandalorian armor he had promised. Vanth remarked that he hoped their paths would cross again, and that he was not the one who broke the armor. Djarin and Grogu then rode off in their speeder, and were being watched by the original owner of Vanth's armor, Boba Fett. Fett would continue to track down Djarin and eventually reclaim his armor.\nAs the Pyke Syndicate began its takeover of Tatooine, some of their spice runners ventured into the Mos Pelgo territories, where Vanth found them consulting a cargo of credits and spice. The marshal warned them that no such activities would be accepted in his territory, but then offered the Pykes a chance to walk away. They attempted to shoot the Marshal, but Vanth was quicker on the draw and gunned most of them down; he sent the remaining Pyke back to the syndicate with a message that anyone running spice in Mos Pelgo would not return to their side, and he took the spice crate as a fine for trespassing. Vanth dumped its content in the sands of the desert, despite the runner's plea that it was worth more than his own town.\nA short time later, Vanth was visited by his friend Din Djarin, soothing his assistant deputy Scott about the former's parking infraction. As he bought the Marshal a drink, Djarin told him about the incoming war between the forces of Boba Fett and the Syndicate over the control of Tatooine's criminal underworld. He then asked Vanth to lead a group of citizens in assistance of Fett, offering credits for their troubles. While Vanth and Taanti agreed that the town wanted no part of the conflict, Djarin made the case that their business involved the whole planet, and eventually the Pykes would come for Freetown. Vanth considered his words and told him that he would see what he could do.\nAs Djarin left, the Marshal asked Taanti to gather all men and women capable to fight for Fett so they would discuss the matter further. As he left, however, Vanth spotted a figure in the distance, coming from the desert; he asked Jo to tell all citizens to get inside, as he didn't know what such an encounter would bring. Standing in the middle of the main street, Vanth asked Deputy Scott to get inside as well, intending to face the stranger alone: the newcomer being the Duros bounty hunter Cad Bane. The gunslinger came with a message from the Pyke Syndicate, claiming they were willing to match any price Fett had offered the Marshal for his service in order for him to ignore the conflict altogether. Scott, however, returned to assist his Marshal and claimed the Marshal wouldn't be bought, much to Vanth's displeasure and Bane's irritation.\nAs Vanth asked for his name, Bane warned him to be careful with who he was messing with, and remarked on Fett's reputation as a cold-blooded killer who was often employed by the Empire; Vanth retorted by stating that Tatooine wouldn't be part of the spice running business and had seen enough violence, telling the Duros to report it to his superiors. Bane replied that Vanth shouldn't have given up the Mandalorian armor.\nAs Bane revealed his blaster, Vanth and Scott prepared for a duel. Even though Scott was the first to reach for his weapon, Bane was faster, wounding the Marshal and executing the deputy. Bane left the town warning Taanti  that Tatooine belonged to the Pykes, and they would be left alone as long as they didn't meddle with the spice trade, while the rest of the citizens rushed to Vanth's aid.\nIn revenge, the town formed a garrison, and joined the battle against the Pyke invasion of Mos Espa, in which they assisted Fett and his allies to repel the Pykes. In the aftermath of their victory, Vanth received treatment for his blaster wounds by a modifier, while being in a bacta tank inside Boba Fett's Palace.\nCobb Vanth was a human male with light leathery skin, graying hair with a beard, pinched hazel eyes, and angular features. As a legacy of his enslavement, he had a star-shaped scar on his back with a series of dots and hashes. As a result of being a slave, Vanth sought freedom and to protect Freetown, even claiming that he would die for the settlement. He despised syndicates like the Red Key Raiders for trying to appear legitimate within the new galactic climate. Vanth also developed some rapport with some local Jawas on Tatooine, learning that it was the key to having access to goods.\nUpon greeting Adwin Charu, Vanth grinned when guessing that the Red Key employee was not from Tatooine, giving a rheumy laugh when Charu confirmed the sheriff's suspicions. Vanth chose to vouch for Adwin to the Jawas and help the representative find what he wished to purchase. After Charu discovered a set of Mandalorian battle armor, Vanth took interest in obtaining it to wear as a lawman and remained persistent when Adwin defiantly claimed the armor, shooting a glancing shot at the representative when he threatened to draw his own blaster. The sheriff kept Charu alive simply to send a message to his boss, Lorgan Movellan. Wearing the Mandalorian armor thereafter, Vanth appreciated hardships he went through before he wore it, saying it was well earned.\nVanth believed that everyone was someone, promoting this idea to Malakili when the beastmaster called himself a nobody. The sheriff recruited individuals to live in Freetown on the proviso that they proved themselves useful. Upon learning of Malakili's trade, Vanth subsequently offered him an opportunity to use his skills in Freetown. Understanding the Tusken Raiders' view on slavery, Freetown's location and the town's ownership of a Hutt, Vanth cut a deal with the Tuskens to leave the settlement alone in return for water. After Malakili cut a further deal for the Tusken's protection, Cobb used this after the Red Key Raiders occupied Freetown. Like with Charu, Vanth kept Movellan alive to send a message to his superiors.\nCobb Vanth wore a maroon shirt, brown trousers, a brown belt, a red scarf, and brown shoes. He later acquired a full set of Mandalorian battle armor, formerly owned by Boba Fett, during his visit to a sandcrawler with Charu. The armor had a largely green color scheme, and it had a jetpack armed with a missile as well as red Mandalorian vambraces. Vanth utilized a speeder made from a single modified Radon-Ulzer 620C podracer engine. The speeder had flight controls and a saddle, and was used by Vanth to travel swiftly between Mos Pelgo and the Jundland Wastes. He wielded an HF-94 heavy blaster pistol, which he carried in a holster on his belt, as well as a KA74 blaster rifle. Following the occupation of Mos Pelgo by the Mining Collective, he carried a cantomo carrying silicax oxalate.\nCobb Vanth was created by writer Chuck Wendig for his trio of novels Star Wars: The Aftermath Trilogy, appearing first in its initial installment, Aftermath, in 2015. In an interview with StarWars.com, Wendig stated that the interlude chapters in Aftermath: Empire's End, the Aftermath Trilogy's final installment released in 2017, like the one including Vanth were written to feed back into the main story.\nVanth made his live-action debut in \"Chapter 9: The Marshal,\" the season two premiere the television series The Mandalorian, directed by Jon Favreau and released on Disney+ on October 30, 2020. He was portrayed by Timothy Olyphant, with Paul Darnell serving as stunt double. Olyphant's appearance in the series was rumored on May 15 that year by The Hollywood Reporter. Slashfilm leaked four days later on May 19 that the actor had been filmed wearing the iconic armor of Boba Fett and predicted Vanth's appearance, with other sites agreeing with the speculation. Chuck Wendig later tweeted that he enjoyed the episode featuring Vanth.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Cobb",
  "/wiki/Vanth_(disambiguation)",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Tatooine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Freetown",
  "/wiki/Galactic_Civil_War",
  "/wiki/New_Republic_Era",
  "/wiki/Slavery",
  "/wiki/Planet",
  "/wiki/Red_Key_Raiders",
  "/wiki/Battle_of_Endor",
  "/wiki/Dune_Sea",
  "/wiki/Mining_Collective",
  "/wiki/Jawa",
  "/wiki/Camtono",
  "/wiki/Silicax_oxalate",
  "/wiki/Boba_Fett%27s_armor",
  "/wiki/Adwin_Charu",
  "/wiki/Sandcrawler",
  "/wiki/Lorgan_Movellan",
  "/wiki/Liberation_of_Mos_Pelgo",
  "/wiki/Mayor",
  "/wiki/5_ABY",
  "/wiki/Beastmaster",
  "/wiki/Malakili",
  "/wiki/Ronto",
  "/wiki/Borgo",
  "/wiki/Skirmish_in_Freetown",
  "/wiki/Tusken_Raider",
  "/wiki/9_ABY",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Mission_to_Tatooine_(Din_Djarin)",
  "/wiki/Unidentified_krayt_dragon_species",
  "/wiki/Krayt_dragon",
  "/wiki/Pyke_Syndicate",
  "/wiki/Spice",
  "/wiki/Pyke",
  "/wiki/Landspeeder",
  "/wiki/Daimyo",
  "/wiki/Boba_Fett",
  "/wiki/War_for_Tatooine",
  "/wiki/Cad_Bane",
  "/wiki/Battle_for_Mos_Espa",
  "/wiki/The_Modifier",
  "/wiki/Desert",
  "/wiki/Star",
  "/wiki/Sheriff",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Galactic_Empire",
  "/wiki/4_ABY",
  "/wiki/Weequay",
  "/wiki/Mining",
  "/wiki/Standard_year",
  "/wiki/Taanti",
  "/wiki/Scavenger",
  "/wiki/Astromech_droid",
  "/wiki/N0-AH",
  "/wiki/Mandalorian_armor",
  "/wiki/Droid",
  "/wiki/Spaceport",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Police_officer",
  "/wiki/Credit",
  "/wiki/Khetanna",
  "/wiki/Blaster",
  "/wiki/Death",
  "/wiki/Arkanis_sector",
  "/wiki/File:Vanth_-_unruly_rontos.ogg",
  "/wiki/Armor",
  "/wiki/Missile",
  "/wiki/Z-6_jetpack",
  "/wiki/Standard_day",
  "/wiki/Twi%27lek",
  "/wiki/Issa-Or",
  "/wiki/Gangster",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Water",
  "/wiki/Krayt_dragon_pearl",
  "/wiki/Gran",
  "/wiki/Yimug",
  "/wiki/Rodian",
  "/wiki/Gweeska",
  "/wiki/Helmet",
  "/wiki/Dilarium_oil",
  "/wiki/Ithorian",
  "/wiki/Vommb",
  "/wiki/Trayness",
  "/wiki/Spotchka",
  "/wiki/Grogu",
  "/wiki/Bantha",
  "/wiki/Speeder_bike",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Black_melon",
  "/wiki/Flamethrower",
  "/wiki/Abandoned_sarlacc_pit",
  "/wiki/Cave",
  "/wiki/Unidentified_Mos_Pelgo_villager",
  "/wiki/Jo",
  "/wiki/Womp_rat",
  "/wiki/Amban_phase-pulse_blaster",
  "/wiki/Stomach",
  "/wiki/Spicerunner",
  "/wiki/Mos_Pelgo_territories",
  "/wiki/Unidentified_Pyke_courier_2",
  "/wiki/Scott",
  "/wiki/Fett_gotra",
  "/wiki/Duros",
  "/wiki/Freetown_garrison",
  "/wiki/Bacta_tank",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/The_galaxy",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Scarf",
  "/wiki/Mandalorian_vambrace",
  "/wiki/Cobb_Vanth%27s_speeder",
  "/wiki/620C_racing_engine",
  "/wiki/Speeder",
  "/wiki/Flight",
  "/wiki/Saddle",
  "/wiki/HF-94_heavy_blaster_pistol",
  "/wiki/KA74_blaster_rifle",
  "/wiki/Chuck_Wendig",
  "/wiki/Star_Wars:_The_Aftermath_Trilogy",
  "/wiki/Aftermath_(novel)",
  "/wiki/2015",
  "/wiki/StarWars.com",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/2017",
  "/wiki/Chapter_9:_The_Marshal",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/The_Mandalorian",
  "/wiki/Jon_Favreau",
  "/wiki/Disney%2B",
  "/wiki/October_30",
  "/wiki/2020",
  "/wiki/Timothy_Olyphant",
  "/wiki/Paul_Darnell",
  "/wiki/May_15",
  "/wiki/May_19",
  "/wiki/Category:Images_of_Cobb_Vanth",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/The_Mandalorian:_The_Path_of_the_Force",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/Chapter_14:_The_Tragedy",
  "/wiki/The_Mandalorian:_The_Rescue",
  "/wiki/The_Book_of_Boba_Fett_Junior_Novel",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Disney_Magic_Kingdoms",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Mando_Mania",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_8",
  "/wiki/Pilots_and_Crew",
  "/wiki/Worldwide",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/The_Fett_Family%27s_Finest",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/%22Do_You_Speak_Bocce%3F%22",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Sixth_Scale_Figures",
  "/wiki/1:10_Scale_Statues",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/October_31",
  "/wiki/September_22",
  "/wiki/May_29",
  "/wiki/June_19"
 ]
}