{
 "name": "Cobb_Vartos",
 "display_name": "Cobb Vartos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New RepublicNew Republic Intelligence",
      "New Republic Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Cobb Vartos was a dark-skinned, male Human Major in New Republic Intelligence who led a team of Intelligence officers to liberate Verkuyl from the Galactic Empire. He along with Selby Jarrad used the guise of corporate bidders for the new bacta refining factory to get into the Verkuylian Imperial Governor's Hall in order to place a listening device in Governor Parco Ein's office and to get close enough to him to force him to liberate Verkuyl, or kill him. He was at the reception for the bidders with Sel and split from her to thoroughly reconnoiter the reception and then to reconnaissance the hall afterward.\nAfter rejoining with Sel, he told her that Imperial Daven Quarle working in the hall was a resistance fighter and on their side, little to his knowledge that Quarle was a double agent for Ein. The next day he was arrested trying to cut the power to the Governor's Hall alongside Quarle. Sel walked in during the arrest causing enough of a distraction for herself and Quarle to escape after Vartos was shot and wounded, leaving him behind to his own fate. The mission was a success after Sel discovered Quarle's duplicity and sent a signal to a New Republic fleet waiting to be called in to liberate Verkuyl. He survived his wound but required a few hours in a bacta tank to fully recover and met with Sel after the mission was complete.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cobb",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Major/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Verkuyl",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Selby_Jarrad",
  "/wiki/Bacta/Legends",
  "/wiki/Verkuylian_Imperial_Governor%27s_Hall",
  "/wiki/Governor/Legends",
  "/wiki/Parco_Ein",
  "/wiki/Death/Legends",
  "/wiki/Daven_Quarle",
  "/wiki/Fleet/Legends",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Conflict_of_Interest",
  "/wiki/Star_Wars_Adventure_Journal_13"
 ]
}