{
 "name": "Cobb Sonbepol",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gotal"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Cobb Sonbepol was a Gotal who was present in Chalmun's Spaceport Cantina in the Mos Eisley spaceport on the planet Tatooine in the year 0 BBY. When local hermit Obi-Wan Kenobi and moisture farmer Luke Skywalker entered the cantina in search of a pilot, Sonbepol sat at a table conversing with fellow patrons Momaw Nadon and Trinto Duaba.\nIn the year 0 BBY, shortly before the Battle of Yavin, the Gotal Cobb Sonbepol sat in a booth right next to the door in Chalmun's Spaceport Cantina in the Mos Eisley spaceport on the planet Tatooine, conversing with the Ithorian Momaw Nadon and the Stennes Shifter Trinto Duaba. While they spoke, local hermit Obi-Wan Kenobi and the young moisture farmer Luke Skywalker entered the cantina with their droids, C-3PO and R2-D2, to look for a pilot.\nThe bartender Wuher turned the droids away, leaving Kenobi and Skywalker to approach the bar alone. At the counter, Skywalker caught the attention of criminals Ponda Baba and Cornelius Evazan. While Nadon discussed putting down roots on Tatooine with Duaba in the booth with Sonbepol, the confrontation at the bar quickly escalated and drew interest from the rest of the cantina, ending when the criminal duo tried to attack Skywalker but were incapacitated by Kenobi with his lightsaber.\nSonbepol had brown fur and skin, and orange-colored eyes. The Gotal spoke in Antarian while conversing with Nadon and Duaba.\nWhile in Chalmun's Cantina, Sonbepol wore a brown jacket and blue pants.\nCobb Sonbepol was portrayed by an uncredited actor in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. The character's costume in the film used the same mask and prop claws as Feltipern Trevagg and Hennet Kayn, the two other Gotal characters visible in the cantina. The Gotals were added to the film as part of supplemental footage for the cantina sequence shot during post production on a sound stage in Dovington's Hollywood studio between January 24 and 25, 1977.\nThe claws had originally been crafted by costume designer Rick Baker as props from the film It's Alive, which Baker had also previously worked on. They were modified with fur for Star Wars by make-up artist Laine Liska, who also created the character's mask after it was designed by conceptual artist Ron Cobb. The cantina character Myo also used a separate pair of the same claw props but without the fur.\nHaving gone unnamed for forty years after first appearing in A New Hope, the Sonbepol character was first identified in 2017. During the \"Behind the Scenes of the Cantina\" panel at Star Wars Celebration Orlando that year, Lucasfilm Story Group member Pablo Hidalgo used elements of attendee Sonja Beyer-Paulsen's name to create the name \"Cobb Sonbepol.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Cobb",
  "/wiki/Gotal",
  "/wiki/Color",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Mos_Eisley",
  "/wiki/Spaceport",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Moisture_farmer",
  "/wiki/Luke_Skywalker",
  "/wiki/Cantina",
  "/wiki/Pilot",
  "/wiki/Momaw_Nadon",
  "/wiki/Trinto_Duaba",
  "/wiki/Battle_of_Yavin",
  "/wiki/Ithorian",
  "/wiki/Stennes_Shifter",
  "/wiki/Droid",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/Bartender",
  "/wiki/Wuher",
  "/wiki/Ponda_Baba",
  "/wiki/Cornelius_Evazan",
  "/wiki/Gender",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Antarian",
  "/wiki/Clothing",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Feltipern_Trevagg",
  "/wiki/Hennet_Kayn",
  "/wiki/January_24",
  "/wiki/January_25",
  "/wiki/Rick_Baker",
  "/wiki/Star_Wars",
  "/wiki/Laine_Liska",
  "/wiki/Ron_Cobb",
  "/wiki/Myo",
  "/wiki/2017",
  "/wiki/Celebration_Orlando",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Sonja_Beyer-Paulsen",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/StarWarsKids.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Time",
  "/wiki/File:Cobb_Sonbepol_tweet.png",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Beastmaster!",
  "/wiki/Star_Wars_Insider_126",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/Star_Wars:_Chronicles"
 ]
}