{
 "name": "Col_Takbright",
 "display_name": "Col Takbright",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Uquine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Red Squadron",
      "Red Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Col Takbright was a human male from Uquine who served as a pilot in the Alliance to Restore the Republic during the Galactic Civil War. He was known for his short temper, as well as his resemblance to Wedge Antilles—which led to his being nicknamed Fake Wedge by his fellow pilots. A member of Red Squadron, Takbright was present during the Battle of Yavin, though he remained grounded on Yavin 4's Base One due to the Rebellion's starfighter shortages.\nCol Takbright hailed from Uquine, a placid world in the Colonies region of the galaxy. The young Takbright watched in increasing agitation as the Galactic Empire spread across the galaxy, exploiting and destroying planets for ore and fuel, all the while killing all opposition to their rule. Eventually, Takbright realized he couldn't spend another day on his homeworld doing nothing; one night, the young man left Uquine with nothing but some credits, a duffel bag, and a vow to avenge those that had been wronged by the Empire.\nTakbright joined the Alliance to Restore the Republic, stationed at Base One on the fourth moon of Yavin where he flew T-65B X-wing starfighters with Red Squadron. During this period, Takbright would butt heads with his fellow pilots, particularly Puck Naeco, on account of his hotheaded, verbose nature. The presence of Wedge Antilles, another Red Squadron pilot who resembled Takbright greatly in both voice and appearance, earned the latter the nickname \"Fake Wedge\", one which Takbright greatly resented.\nBy 0 BBY, Takbright had distinguished himself flying raids, with his performance praised by Red Leader Garven Dreis, as well as several patrols and reconnaissance missions. Due to the Rebellion's starfighter constraints, he was unable to participate in the Battle of Scarif after the last place was given to Pedrin Gaul; however he hoped to be given a spot in one of the squadron's flights for the upcoming Battle of Yavin.\nAs the Death Star approached, Takbright attended the starfighter pilot briefing presented by General Jan Dodonna; he would be seated next to Luke Skywalker, a Tatooine farmboy that had helped in the rescue of Princess Leia Organa and provided the schematics for the battle station. In one of his characteristic outbursts, Takbright loudly expressed his skepticism that the station's two-meter thermal exhaust port could be reliably struck by proton torpedoes, even with the help of a targeting computer. Skywalker reassured Takbright that it was indeed possible, citing his targeting of womp rats while bush piloting on his homeworld.\nAfter the briefing, Takbright was admonished for his comments by Naeco, before relating Skywalker's optimistic comments to John D. Branon. In the squadron ready room, Dreis neglected to assign Takbright to one of the squadron's twelve spots, instead giving a spot to Skywalker, who had scored an extraordinarily high score on his flight simulation. An angry Takbright flew into a fit of rage in the ready room, only to be stopped by Antilles, who urged him to stop pushing his fellow comrades away.\nTakbright, along with fellow pilots Bren Quersey, Elyhek Rue, and Wenton Chan, watched the action in the Great Temple's war room, becoming increasingly unnerved as the rebel pilots began to be killed one-by-one by TIE fighters and turbolasers. Eventually, only Antilles, Skywalker, and Biggs Darklighter were left conducting their trench run. After Antilles' micro-maneuvering controls were rendered inoperative, Takbright urged Kelemah to get him out of there; however, Antilles would withdraw from the trench.\nAfter Darklighter was killed, Takbright grew even more worried as Antilles moved to re-enter the trench despite his loss of fine control, a move that would assuredly lead to his death, if only to buy time for Skywalker as he took his shot. However, before this could happen, Skywalker fired his torpedoes into the Death Star, destroying it and saving the rebel base from imminent destruction. Upon the return of the survivors to Yavin, Takbright chose not to join the rest of the ground crew in their ecstatic celebration around Skywalker's landed starfighter; instead, Takbright, with a new appreciation for his fellow pilot's selfless intentions, greeted Antilles and congratulated him for his valiant efforts.\nCol Takbright was a human male with brown hair, brown eyes, and light skin. He was infamous within the Alliance for his short temper; this temper had led to him being abandoned from missions for the team, causing him to lose it even more. Despite this, he was loyal to the Alliance and got on very well with his fellow pilots. Towards the end of the Battle of Yavin, Takbright began to realize that he underappreciated his friends and their morals; he began to greet them with kindness and cheer and congratulated his friends for what they did.\nCol Takbright first appeared in Star Wars: Episode IV A New Hope, where he was portrayed by actor Colin Higgins; he was first identified by name in \"Duty Roster\", a short story penned by Star Wars perennial Jason Fry as part of the From a Certain Point of View collection, celebrating the 40th anniversary of A New Hope. In Star Wars Legends sources, the character was identified as being Wedge Antilles , with both actors' lines dubbed by David Ankrum.\nHiggins was the actor initially cast as Wedge Antilles. However, he had failed to memorize his line for the scene on Yavin 4, instead expecting a production similar to television, where rehearsal was common. Higgins struggled during the shoot and grew increasingly nervous and dispirited; he was fired after one day and was replaced by Lawson. Higgins' scene, however, remained in the final film.\nWedge's appearance in the briefing room scene, incongruous with that of the rest of the film, led to a fan nickname of \"Fake Wedge\". Lucasfilm Story Group member and author Pablo Hidalgo was responsible for identifying the actor's name and background in 2004. The unofficial fan nickname for Higgins' portrayal was recognized and introduced into canon by Jason Fry in \"Duty Roster\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Uquine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Rebel_pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/Wedge_Antilles",
  "/wiki/Battle_of_Yavin",
  "/wiki/Yavin_4",
  "/wiki/Great_Temple",
  "/wiki/Starfighter",
  "/wiki/Planet",
  "/wiki/Colonies",
  "/wiki/The_galaxy",
  "/wiki/Galactic_Empire",
  "/wiki/Ore",
  "/wiki/Fuel",
  "/wiki/Death",
  "/wiki/Credit",
  "/wiki/Duffel_bag",
  "/wiki/Yavin_Prime",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Puck_Naeco",
  "/wiki/0_BBY",
  "/wiki/Red_Leader",
  "/wiki/Garven_Dreis",
  "/wiki/Battle_of_Scarif",
  "/wiki/Pedrin_Gaul",
  "/wiki/Flight",
  "/wiki/Death_Star",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Luke_Skywalker",
  "/wiki/Tatooine",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Battle_station",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Proton_torpedo",
  "/wiki/Targeting_computer",
  "/wiki/Womp_rat",
  "/wiki/John_D._Branon",
  "/wiki/Bren_Quersey",
  "/wiki/Elyhek_Rue",
  "/wiki/Wenton_Chan",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Turbolaser",
  "/wiki/Biggs_Darklighter",
  "/wiki/Meridian_trench",
  "/wiki/Micro-maneuvering_control",
  "/wiki/Kelemah",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Colin_Higgins",
  "/wiki/Duty_Roster",
  "/wiki/Jason_Fry",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars_Legends",
  "/wiki/Denis_Lawson",
  "/wiki/David_Ankrum",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Category:Images_of_Col_Takbright",
  "/wiki/Sparks_(short_story)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Databank_(website)",
  "/wiki/Servants_of_the_Empire:_Rebel_in_the_Ranks",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Players",
  "/wiki/Star_Wars_Insider_98",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Mysteries"
 ]
}