{
 "name": "Cold_Danda_Sine",
 "display_name": "Cold Danda Sine",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bedlam Spirit"
     ]
    }
   ]
  }
 ],
 "content": "Cold Danda Sine was one of the four Bedlam Spirits, transdimensional beings that resided in the Bedlam Pulsar and appeared to have completely omnipotent powers over time and matter. Cold Danda Sine was present for occasional experiments on the planet Bedlam, where the Spirits would play with the fabric of existence itself.\nAlong with Tilotny, Horliss-Horliss and Splendid Ap, Cold Danda Sine was one of the four Bedlam Spirits, omnipotent and transdimensional beings with godlike powers over form, matter and time. The four were so named because they were known to occasionally alight upon the planet Bedlam, which provided a setting for the entities' experiments upon the fabric of reality. Cold Danda Sine was present when the Bedlam Spirits discovered Rebel leader Leia Organa and a group of Imperial stormtroopers on Bedlam during the Galactic Civil War, watching as Tilotny and Horliss-Horliss killed the organics by altering the compositions of their bodies in dramatic ways. Dismayed at their treatment of the \"tiny movers,\" Cold Danda Sine urged them to leave, and Splendid Ap was assigned to restore them to their proper form. Some knowledge of Cold Danda Sine and its fellow Spirits' existence filtered out in the wider galaxy in the decades to come, as visitors to Bedlam discovered impossibly transmuted materials and objects thrown wildly through time.\nAppearing as a floating black and orange sphere with a face, Cold Danda Sine was capable of manipulating time and mass, as were the other four Bedlam Spirits. However, Cold Danda Sine and Splendid Ap were regarded as lesser powers by Tilotny—in turn, Cold Danda Sine scorned Tilotny and admired Horliss-Horliss, referring to him incomparable and inventive. Among his studies of the fabric of the universe, Cold Danda Sine was particularly proud of his \"anti-concepts.\"\nCold Danda Sine appeared in Tilotny Throws a Shape, a short comic story written by Alan Moore and illustrated by John Stokes, and originally appearing in The Empire Strikes Back Monthly 154 in the United Kingdom. In The Essential Atlas, the name is misspelled as \"Cold Danda Sire.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bedlam_Spirits",
  "/wiki/Bedlam_Pulsar",
  "/wiki/Planet/Legends",
  "/wiki/Bedlam/Legends",
  "/wiki/Tilotny",
  "/wiki/Horliss-Horliss",
  "/wiki/Splendid_Ap",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Death/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Color/Legends",
  "/wiki/Time/Legends",
  "/wiki/Tilotny_Throws_a_Shape",
  "/wiki/Alan_Moore",
  "/wiki/John_Stokes",
  "/wiki/The_Empire_Strikes_Back_Monthly_154",
  "/wiki/The_Essential_Atlas"
 ]
}