{
 "name": "Coleman_Trebor",
 "display_name": "Coleman Trebor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sembla"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Geonosis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vurk"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.13 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi assault team",
      "Jedi High Council",
      "Jedi assault team",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Coleman Trebor was a male Vurk Jedi Master who served as a member of the Jedi High Council before the Clone Wars. During the First Battle of Geonosis, Master Trebor came within seconds of neutralizing Count Dooku, only to be tragically thwarted by an unexpected series of well-placed shots from the bounty hunter Jango Fett.\nA Vurk male born on his species' homeworld of Sembla, Coleman Trebor's attunement to the Force was spotted early on, and he became the first and only Vurk to join the Jedi Order. Trebor completed his training as an Initiate and Padawan, passing the Jedi Trials and becoming a full-fledged Jedi Knight. Wielding a green lightsaber in his service to the Jedi Order, Trebor sharpened his skills and connection to the Force, taking on many assignments in the pursuit of peace and justice. Over the course of Trebor's career, the Vurk Jedi's wisdom and serene demeanor brought many disputes to a harmonious end. Eventually, Trebor was granted the rank of Jedi Master by the High Council in recognition of his years of knowledge and experience. After veteran Jedi Master Yarael Poof perished on a fateful mission, the Jedi High Council extended an invitation to Master Trebor to replace the fallen Quermian Jedi.\nIn 22 BBY, Master Trebor was present on the Council when an attempt on Senator Padmé Amidala's life was discussed. It was decided that the Jedi Padawan Anakin Skywalker was to accompany Amidala to her home planet of Naboo while his master Obi-Wan Kenobi investigated the assassin's origin. Sometime later, he was in the Jedi Temple as Kenobi made his way to confer with Master Yoda.\nOnce the Council learned of the Separatist force on the planet Geonosis, Trebor joined the Jedi assault team led by Mace Windu and traveled to Geonosis to rescue Kenobi from the Confederacy of Independent Systems. He fought in the Petranaki Arena, beginning the battle standing alongside Bultar Swan, a young Jedi Knight.\nDuring the battle, Trebor infiltrated the stands and confronted the former Jedi Master Count Dooku on a balcony, aiming to put a swift end to the conflict before it could spread out of control. The bounty hunter Jango Fett, who was standing next to Dooku, fired a quick salvo of blaster bolts at Trebor. Taken aback, Master Trebor deflected the first two shots from Fett's blaster before a third struck him in the shoulder and then a fourth in his chest, knocking him over the balcony railing and sending him falling to his death on the arena floor. Later on in the battle, Mace Windu avenged the death of his colleague, dispatching the cunning Fett with his amethyst lightsaber.\nThe death of Coleman Trebor opened up a vacancy on the Jedi High Council, an opening that remained as such for several months as the Council struggled to find a replacement for the noble Vurk Jedi. During this time, various Jedi Masters rotated in Trebor's Council position, until finally the renowned Jedi Obi-Wan Kenobi, a survivor of the Petranaki Arena, was selected. For a time, Master Kenobi inwardly grappled with feelings of doubt and insecurity, believing himself unworthy of assuming the position of a Jedi so wise, experienced, and skilled as Coleman Trebor.\nColeman Trebor stood 2.13 meters  tall. The Vurk species was renowned for its calm, highly empathic nature, and Trebor was no exception. Noble and wise, Trebor was one of the Jedi Order's great minds, and his skills as a mediator were revered.\nA towering Vurk with thick skin and a massive, imposing build, Coleman Trebor was an impressive combatant. Trebor's connection to the Force was regarded as generally unequaled, the prestigious title of Jedi Master marking him as among the most powerful members of the Jedi Order. Trebor distinguished himself and his abilities even with the ranks of the Jedi Masters, earning a seat on the elite High Council. Though Trebor's greatest skill was mediation, he was very adroit with a lightsaber.\nDemonstrating remarkable stealth and agility, Master Trebor ambushed the Sith Lord Count Dooku during the First Battle of Geonosis, and would have slain the former Jedi Master if not for Jango Fett's timely intervention; Trebor himself was instead taken by surprise, and mortally wounded.\nColeman Trebor wore Jedi robes and carried a green lightsaber with him. Trebor had thick reptilian skin, and a long, bony ridge on his head that grew perpetually. He had a food and energy capsule on his waist.\nColeman Trebor first appeared in the 2002 movie Star Wars: Episode II Attack of the Clones directed by George Lucas and written by Lucas and Jonathan Hales.\nColeman Trebor was a completely computer-generated character in the movie Star Wars: Episode II Attack of the Clones, the second installment of the Star Wars prequel trilogy. For scenes in the Jedi Council Chamber, stock footage from the 1999 film Star Wars: Episode I The Phantom Menace was reused, with Trebor digitally painted over Yarael Poof, who was replaced as George Lucas felt the audience would confuse him with the newly-introduced Kaminoans. Coleman Trebor's name was derived from that of Rob Coleman of Industrial Light \u0026 Magic . Coleman recalled that the character's name was suggested by Visual Effects Supervisor John Knoll.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Coleman_Trebor",
  "/wiki/Coleman_Trebor/Legends",
  "/wiki/Coleman",
  "/wiki/Brotherhood",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Sembla",
  "/wiki/22_BBY",
  "/wiki/Geonosis",
  "/wiki/Vurk",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Jedi_assault_team",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Master",
  "/wiki/Clone_Wars",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Species",
  "/wiki/Homeworld",
  "/wiki/Jedi",
  "/wiki/Jedi_Initiate",
  "/wiki/Padawan",
  "/wiki/Jedi_Trials",
  "/wiki/Jedi_Knight",
  "/wiki/Coleman_Trebor%27s_lightsaber",
  "/wiki/Yarael_Poof",
  "/wiki/Quermian",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Anakin_Skywalker",
  "/wiki/Naboo",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Imperial_Palace",
  "/wiki/Planet",
  "/wiki/Mace_Windu",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Lightsaber_combat",
  "/wiki/Petranaki_Arena",
  "/wiki/Bultar_Swan",
  "/wiki/Laser",
  "/wiki/Blaster",
  "/wiki/Mace_Windu%27s_lightsaber",
  "/wiki/Semblan",
  "/wiki/The_Force",
  "/wiki/Sith_Lord",
  "/wiki/Lost_Twenty",
  "/wiki/Jedi_robes",
  "/wiki/Lightsaber",
  "/wiki/Foodstuff",
  "/wiki/Energy_capsule",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/George_Lucas",
  "/wiki/Jonathan_Hales",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Jedi_Council_Chamber",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Kaminoan",
  "/wiki/Rob_Coleman",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/John_Knoll",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_Attack_of_the_Clones_Graphic_Novel_Adaptation",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Databank_(website)",
  "/wiki/32_BBY",
  "/wiki/19_BBY",
  "/wiki/Category:Images_of_Coleman_Trebor",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Homing_Beacon_(newsletter)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Yoda",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Plo_Koon",
  "/wiki/Saesee_Tiin",
  "/wiki/Even_Piell",
  "/wiki/Oppo_Rancisis",
  "/wiki/Shaak_Ti",
  "/wiki/Eeth_Koth",
  "/wiki/Adi_Gallia",
  "/wiki/Depa_Billaba",
  "/wiki/Kit_Fisto"
 ]
}