{
 "name": "Coleman Kcaj",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Skustell"
     ]
    },
    {
     "name": "Died",
     "values": [
      "By 9 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ongree"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.04 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Coleman Kcaj was an Ongree male Jedi Master who served the Jedi Order during the last years of the Galactic Republic. During the Clone Wars, Kcaj gained a seat on the Jedi High Council and then survived for years during the Great Jedi Purge, although he had been killed by the Inquisitorius by 9 BBY.\nColeman Kcaj was an Ongree male Jedi Master born on Skustell who took a seat on the Jedi Council, the governing body of the Jedi Order in 19 BBY.\nKcaj was present during a Council meeting concerning the fate of Padawan Ahsoka Tano, who was accused of the murder of Letta Turmond and orchestrating the bombing of the Jedi Temple. Wilhuff Tarkin said that the Galactic Senate wished to put her in a military trial. The Council expelled Tano from the Order after a debate and she was put on trial by the Galactic Republic, but Padawan Barriss Offee was ultimately revealed to be the true culprit.\nAfter clone trooper Tup, whose malfunctioning and secret biochip caused him to murder Jedi Master Tiplar, was sent to Kamino to have the incident investigated, Kcaj was present in a council meeting through holographic form when Jedi Master Shaak Ti turned to the council with the belief that Tup may have a tumor.\nLater, Kcaj was present when the Council agreed to send Jedi Master Mace Windu alongside Junior Representative Jar Jar Binks on an assignment to investigate a number of disappearances on Bardotta after Queen Julia.\nKcaj was present when Plo Koon reported that he found the lightsaber of Master Sifo-Dyas. Yoda confirmed that it was and decided to investigate. Kcaj was again present when it was reported that Dooku was responsible for the creation of the clone army. The Council decided to keep it a secret since people would lose trust in the Republic if the truth became public knew.\nKcaj was later present when Yoda told the Council that he had heard the voice of long-dead Jedi Master Qui-Gon Jinn in his head and hoped to learn the meaning of the communications from beyond. The Council all meditated with Yoda, but nobody heard the voice.\nKcaj was later present when Obi-Wan Kenobi and Anakin Skywalker discussed a giant kyber crystal they had found on Utapau. Kcaj was present again when they reported that the crystal had been destroyed, causing Yoda to remind the Council of stories where kyber crystals were used for weapons the Sith used.\nShortly after the Battle of Coruscant, Kcaj attended a performance of Squid Lake at the Galaxies Opera House and was seen talking to Senator Sweitt Concorkill shortly before the show.\nNear the end of the war, Kcaj was present when the Council granted Skywalker a seat on the Jedi Council, after he had been appointed there by Supreme Chancellor Sheev Palpatine. He was later present when the council discussed about how Palpatine had said that General Grievous was hiding on Utapau and recommended they send Skywalker to lead the campaign. However, the council decided that they needed a Master, with more experience, and decided on sending Kenobi instead. Shortly thereafter, Palpatine declared himself Emperor and Skywalker, having become the Sith Lord Darth Vader, helped destroy the Jedi Order.\nDuring the reign of the Galactic Empire, Kcaj was among the few Jedi to escape the ensuing carnage that was Order 66. At one point presumed to have been killed, Kcaj's name was later included on a holographic list compiled by the Inquisitorius of confirmed survivors in the time after the hunt for Eeth Koth, having hidden from the Empire extremely well.\nBy 9 BBY, however, Kcaj had been found and executed by the Inquisitors. His body was then taken and entombed in their headquarters, the Fortress Inquisitorius, on the ocean moon of Nur in the Mustafar system. Left in a petrified state, his corpse was left next to those of dozens of other Jedi. In 9 BBY, Kenobi broke into the Fortress Inquisitorius to rescue Princess Leia Organa but discovered the corpse of his fellow Jedi Council member and those of the Empire's other Jedi victims. Although disturbed, Kenobi pushed on and completed his mission.\nColeman Kcaj had yellow eyes and yellow skin. Kcaj was also skilled in meditation, military strategy, diplomacy and lightsaber warfare, making him a valued member of the Jedi Council. During his younger years, he was a formidable warrior but over time he came to see battle as a tragic failure to find mutual understanding.\nColeman Kcaj wore Jedi robes and wielded a green-bladed lightsaber.\nDuring a performance of the opera Squid Lake at the Galaxies Opera House, Kcaj wore red-and-white patterned robes very similar to those worn by Junior Representative Jar Jar Binks.\nColeman Kcaj first appeared in the 2005 film Star Wars: Episode III Revenge of the Sith. He is completely computer-animated. Originally, Kcaj was called Sweitt Concorkill, but the name was ultimately given to a Vurk Senator later on. There was originally some confusion between the Ongree Jedi Pablo-Jill seen in Attack of the Clones and the Ongree member of the Jedi Council seen in Revenge of the Sith, with early Set Diaries naming the latter Ongree Pablo-Jill and later Sweitt Concorkill, though he was eventually named Coleman Kcaj. The character was originally meant to be Pablo-Jill, but because the Ongree in Episode III needed a more detailed CGI model, a new character was created. The name Coleman Kcaj is in reference to Rob Coleman's son Jack, with Kcaj being the reversed spelling of Jack.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Coleman_Kcaj",
  "/wiki/Coleman_Kcaj/Legends",
  "/wiki/Coleman",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Skustell",
  "/wiki/9_BBY",
  "/wiki/Ongree",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Master",
  "/wiki/Republic_Era",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Death",
  "/wiki/Inquisitorius",
  "/wiki/Reproduction",
  "/wiki/19_BBY",
  "/wiki/Jedi_Council",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Letta_Turmond",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Imperial_Palace",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Galactic_Senate",
  "/wiki/Republic_Military",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Barriss_Offee",
  "/wiki/Duel_at_the_Jedi_Temple",
  "/wiki/Clone_trooper",
  "/wiki/CT-5385",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Battle_of_Ringo_Vinda",
  "/wiki/Jedi",
  "/wiki/Tiplar",
  "/wiki/Kamino",
  "/wiki/Hologram",
  "/wiki/Shaak_Ti",
  "/wiki/Tumor",
  "/wiki/Mace_Windu",
  "/wiki/Junior_Representative",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Mission_to_Bardotta",
  "/wiki/Bardotta",
  "/wiki/Queen",
  "/wiki/Julia",
  "/wiki/Plo_Koon",
  "/wiki/Sifo-Dyas%27_lightsaber",
  "/wiki/Sifo-Dyas",
  "/wiki/Yoda",
  "/wiki/Dooku",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Force_spirit",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Meditation",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Kyber_crystal",
  "/wiki/Mission_to_Utapau",
  "/wiki/Utapau",
  "/wiki/Crystal",
  "/wiki/Superweapon",
  "/wiki/Sith",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Squid_Lake",
  "/wiki/Galaxies_Opera_House",
  "/wiki/Senator",
  "/wiki/Sweitt_Concorkill",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Battle_of_Utapau",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Emperor",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Order_66",
  "/wiki/Time",
  "/wiki/Hunt_for_Eeth_Koth",
  "/wiki/Inquisitor",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Ocean",
  "/wiki/Moon",
  "/wiki/Nur",
  "/wiki/Mustafar_system",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Rescue_of_Leia_Organa",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Eye",
  "/wiki/Jedi_robes",
  "/wiki/Coleman_Kcaj%27s_lightsaber",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Vurk",
  "/wiki/Pablo-Jill",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Rob_Coleman",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Conspiracy",
  "/wiki/The_Disappeared,_Part_I",
  "/wiki/The_Lost_One",
  "/wiki/Voices",
  "/wiki/The_Big_Bang",
  "/wiki/Revenge_of_the_Sith_Read-Along_Storybook_and_CD",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Part_IV",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_72",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Template:KenobiDate",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_100",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/June_3",
  "/wiki/2022",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Saesee_Tiin",
  "/wiki/Oppo_Rancisis",
  "/wiki/Kit_Fisto",
  "/wiki/Eeth_Koth",
  "/wiki/Agen_Kolar",
  "/wiki/Depa_Billaba",
  "/wiki/Stass_Allie"
 ]
}