{
 "name": "Collan_Eislo",
 "display_name": "Collan Eislo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Apex Society"
     ]
    }
   ]
  }
 ],
 "content": "Collan Eislo was a male Human, who desired to become a Sith apprentice, and led a Sith cult called the Apex Society.\nEislo was born into nobility and developed a fascination for the Sith, believing that the Force was the ultimate power in the galaxy, and that the Sith were the only people who were unafraid to wield the power that the Force granted. He therefore desired to become a Sith apprentice, so he studied Sith holocrons and used his family's wealth to sponsor archaeological digs at Sith sites.\nHowever, he wasn't sensitive to the Force and couldn't become a Sith apprentice, regardless of how many Sith artifacts he amassed. However, he heard legends that the mask of the ancient Sith Lord Darth Nihilus could grant the wearer the power to use the Force, so he desired to find it.\nAlong with the Apex Society, an organization of Sith devotees that Eislo led, he tried to track the mask and eventually traced the mask to the planet Volik. Eislo and the Apex Society traveled to Volik, and Eislo promised the Society members that he would become their master when he possessed the power of the mask.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Apex_Society",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith_cult/Legends",
  "/wiki/Sith/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Mask_of_Darth_Nihilus",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Nihilus",
  "/wiki/Planet/Legends",
  "/wiki/Volik",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/The_Mask_of_Darth_Nihilus",
  "/wiki/The_Unknown_Regions"
 ]
}