{
 "name": "Colli",
 "display_name": "Colli",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tholothian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jogg and Mareena's garage"
     ]
    }
   ]
  }
 ],
 "content": "Colli was a male Tholothian youngling who lived on the river moon of Al'doleem.\nColli was born to the Tholothians Jogg and Mareena. By 19 BBY, he helped his parents run the garage. When Jedi Master Kirak Infil'a came, they both greeted him and he told them the tale of how he had killed a Sith and that now he wanted to go kill the Galactic Emperor as well and restore light to the galaxy. Colli was amazed by this and Mareena told him that their family never believed that the Jedi were traitors and they started fixing Infil'a ship.\nColli was shocked when Infil'a used the Force, saying that even her father couldn't lift them without help. Infil'a replied that the Force made all things light, and told her of his plans to rebuild the Jedi and to come back and teach her the mysteries of the Force. Suddenly, Infil'a felt Vader coming and dropped the materials, with Colli running to protect both himself and his sister. Colli gave the baby to her father and when they came out, Vader challenged Infil'a to a lightsaber duel. Even though the others were confused, Colli asked if Vader was the Sith, but Infil'a told them all to go back to the garage and fix the ship. Colli and his sister managed to escape, though his parents were killed when Vader flooded the city.\nColli had brown eyes and light skin. He wore a Tholoth headdress. Colli didn't believe that the Jedi were traitors and was on good terms with Kirak Infil'a. He was amazed when Infil'a used the Force.\nColli first appeared in Darth Vader  4, a 2017 canon comic written by Charles Soule and penciled by Giuseppe Camuncoli.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Tholothian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jogg_and_Mareena%27s_garage",
  "/wiki/Youngling",
  "/wiki/Al%27doleem",
  "/wiki/Reproduction",
  "/wiki/Jogg",
  "/wiki/Mareena",
  "/wiki/19_BBY",
  "/wiki/Parent",
  "/wiki/Jedi_Master",
  "/wiki/Kirak_Infil%27a",
  "/wiki/Mission_to_Al%27doleem",
  "/wiki/Death",
  "/wiki/Anakin_Skywalker",
  "/wiki/Galactic_Emperor",
  "/wiki/The_galaxy",
  "/wiki/Jedi",
  "/wiki/Kirak_Infil%27a%27s_Delta-7_Aethersprite-class_light_interceptor",
  "/wiki/Force_power",
  "/wiki/The_Force",
  "/wiki/Colli%27s_sister",
  "/wiki/Lightsaber_duel",
  "/wiki/Sith",
  "/wiki/Starship",
  "/wiki/Am%27balaar_City",
  "/wiki/Eye",
  "/wiki/Tholoth_headdress",
  "/wiki/Darth_Vader_(2017)_4",
  "/wiki/2017",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Star_Wars_(2020)_19",
  "/wiki/Star_Wars_(2020)_20"
 ]
}