{
 "name": "Colli's sister",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tholothian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "The sister of Colli was a Tholothian infant who lived on the river moon of Al'doleem.\nThis infant was born to Jogg and Mareena prior to the Imperial Era. In 19 BBY, her father was babysitting them infant when he heard noises and came out with the infant. He was shocked to hear that Jedi Master Kirak Infil'a had come back for them to mend his ship, as it had been years since he saw him last and most of the Jedi were exterminated during Order 66. While they were mending his ship, the infant was amazed when Infil'a used the Force to lift things up into the air. Then, Infil'a sensed Darth Vader coming and dropped all the things he was carrying using the Force. Colli protected the infant and ran before they both got hurt. They all witnessed Vader challenging Infil'a to a lightsaber duel. They all ran back into the garage to fix Infil'a's ship. The infant and her brother managed to escape, though her parents were killed when Vader flooded the city by destroying a dam.\nThe infant had light skin and was amazed when Infil'a used the Force.\nColli's sibling first appeared in Darth Vader  4, a 2017 canon comic written by Charles Soule and pencilled by Giuseppe Camuncoli.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/Tholothian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Colli",
  "/wiki/Al%27doleem",
  "/wiki/Reproduction",
  "/wiki/Jogg",
  "/wiki/Mareena",
  "/wiki/Imperial_Era",
  "/wiki/19_BBY",
  "/wiki/Parent",
  "/wiki/Jedi_Master",
  "/wiki/Kirak_Infil%27a",
  "/wiki/Kirak_Infil%27a%27s_Delta-7_Aethersprite-class_light_interceptor",
  "/wiki/Standard_year",
  "/wiki/Jedi",
  "/wiki/Death",
  "/wiki/Order_66",
  "/wiki/Starship",
  "/wiki/Force_power",
  "/wiki/The_Force",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mission_to_Al%27doleem",
  "/wiki/Lightsaber_duel",
  "/wiki/Jogg_and_Mareena%27s_garage",
  "/wiki/Am%27balaar_City",
  "/wiki/Am%27balaar_city_dam",
  "/wiki/Darth_Vader_(2017)_4",
  "/wiki/2017",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Star_Wars_(2020)_19"
 ]
}