{
 "name": "Colt",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Rancor Battalion",
      "Rancor Battalion"
     ]
    }
   ]
  }
 ],
 "content": "\"Colt\" was the nickname of a Clone ARC Commander who served as the commanding officer of Rancor Battalion, part of the Grand Army of the Republic, during the Clone Wars. He was killed by Asajj Ventress during the Battle of Kamino.\nColt was born on the planet Kamino, as all the clone troopers of the Galactic Republic were and, like all clones, Colt was a genetic copy of the once renowned bounty hunter Jango Fett. At an unspecified time period during the Clone Wars, he was promoted to the rank of Clone ARC Commander of the Rancor Battalion.\nShortly before the Battle of Kamino, he along with the bounty hunter's Bric and El-Les oversaw clone cadets' training. He was very impressed with Bravo Squad's performance in the Citadel Challenge. However, he was disappointed by Domino Squad's performance after they had broken various protocols. After they had graduated, Colt and his fellow ARC troopers saw off the cadets as they shipped out as soldiers for the Republic.\nColt and his fellow ARC troopers remained on Kamino. When General Grievous, the leader of the droid army, and assassin Asajj Ventress launched a surprise attack on Kamino, Colt was assigned to defend Tipoca City, where he encountered Grievous and managed to hold his own against him, accompanied by a small squad of clone troopers. However, soon after, he confronted Ventress, who Force choked him. She then proceeded to impale him with her lightsabers, while she kissed him on the cheek.\nColt was a human male clone of the bounty hunter Jango Fett, standing at a height of 1.83 meters with black hair and brown eyes.\nA segment of Colt's death in the episode \"ARC Troopers\" was removed when the episode aired. In the original scene, Ventress gave Colt a kiss after impaling him and before deactivating her lightsaber. This was later removed at the request of Cartoon Network, however the scene is included in the home video release as well as the episode's airing on other networks. A digital card on Star Wars: Card Trader released on October 12, 2018 demonstrated an image of Clone ARC Commander Colt, but the card's title stated \"Clone ARC Commander Hammer.\" \"Hammer\" is the name that production referred to another ARC trooper that has not been named in an official source.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Colt",
  "/wiki/Colt/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kamino",
  "/wiki/21_BBY",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Rancor_Battalion",
  "/wiki/Clone_ARC_Commander",
  "/wiki/Commanding_officer",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Asajj_Ventress",
  "/wiki/Battle_of_Kamino",
  "/wiki/Planet",
  "/wiki/Clone_trooper",
  "/wiki/DNA",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Bric",
  "/wiki/El-Les",
  "/wiki/Clone_cadet",
  "/wiki/Bravo_Squad_(clone_cadets)",
  "/wiki/Citadel_Challenge",
  "/wiki/Domino_Squad",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Assassin",
  "/wiki/Tipoca_City",
  "/wiki/Force_choke",
  "/wiki/Asajj_Ventress%27s_lightsabers",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/October_12",
  "/wiki/2018",
  "/wiki/Unidentified_Advanced_Recon_Commando",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Clone_Cadets",
  "/wiki/ARC_Troopers",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Across_the_Galaxy",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Leland_Chee"
 ]
}