{
 "name": "Conan_Antonio_Motti",
 "display_name": "Conan Antonio Motti",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Seswenna"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Death Star",
      "Yavin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Joint Chiefs",
      "Imperial Navy's officer corps",
      "Joint Chiefs"
     ]
    }
   ]
  }
 ],
 "content": "Conan Antonio Motti was a human male admiral in the Imperial Navy who served as a naval chief for much of the reign of the Galactic Empire. Born to an influential and wealthy family on the Outer Rim world of Seswenna, Motti became a highly decorated starship captain. He quickly rose through the ranks of flag officers and was serving as a naval chief by 14 BBY, representing the Navy on the Joint Chiefs.\nBy the early stages of the Galactic Civil War, Motti had been elevated to the position of Chief of the Imperial Navy and held the rank of Admiral of the Navy, directing the operations of the starfleet. A staunch believer in the capabilities of the Death Star, Motti viewed the battle station as invulnerable and was dismissive of the Alliance to Restore the Republic's purported threat to the station. His confidence led to confrontations with colleagues, such as with General Cassio Tagge and even Darth Vader himself; during a meeting of the Joint Chiefs, Motti's outbursts in chastising the Dark Lord of the Sith's failures led to him being force choked. Nevertheless, Motti bristled at the episode and formally protested Vader's actions.\nMotti's ambitions that grew in the wake of the battle station's completion were short-lived. The Rebel Alliance—which had obtained a copy of the Death Star plans during the battle of Scarif—discovered a weak spot in the station's exhaust port, and successfully exploited it, leading to the destruction of the battle station, along with the deaths of Motti and everyone else onboard.\nConan Antonio Motti was a human male who hailed from a wealthy and powerful family in the Outer Rim. A native of Seswenna, Motti was a naval officer in the Galactic Empire of Emperor Sheev Palpatine. He became one of the service's most highly decorated captains and a veteran naval commander, eventually rising to the rank of Rear Admiral with his flag on the Star Destroyer Steel Talon.\nBy 14 BBY, Motti was a prominent member of the Joint Chiefs, considered by the Emperor to be a potential candidate for the newly-created position of Grand Moff, a position which would eventually go to Moff Wilhuff Tarkin, however. Along with the rest of the Joint Chiefs on Coruscant, Motti helped coordinate the Imperial response to the rebel campaign of Berch Teller, a disaffected analyst whose cell threatened various Imperial outposts across the Outer Rim Territories. Due to his involvement, as well as the discrediting of the head of Naval Intelligence, Vice Admiral Dodd Rancit, Motti would receive a promotion from the Emperor.\nBy 0 BBY, Motti served as Admiral of the Navy, and held the position of Chief of the Imperial Navy. Having escalated their operations to open warfare, the Alliance to Restore the Republic managed to steal the technical readouts of the Death Star, a planet-destroying battle station. Darth Vader, the Dark Lord of the Sith, managed to capture the flagship that carried the plans, the Tantive IV, but was unable to recover the plans themselves. Not long after, Motti was present at a meeting of the Joint Chiefs onboard the battle station, during which General Cassio Tagge of the Imperial Army asserted that, until the Death Star was fully operational, the Empire was more vulnerable to the Alliance's attacks. Motti, however, retorted that, while the Alliance was dangerous to Tagge's forces, the battle station itself was invisible. Tagge further argued the Rebel Alliance would continue to gain support in the Imperial Senate, but was interrupted by Grand Moff Tarkin, who arrived with Lord Vader and informed the officers present that the Senate had just been dissolved by the Emperor himself.\nThough Vader—who had recently arrived to interrogate Princess Leia Organa—admitted that the plans were in the hands of the rebels, the Dark Lord proclaimed that the Empire would soon have them once more. Motti then boasted of the Death Star's power, claiming that it was the ultimate power in the universe and suggested that the Empire put it to the test. Vader, however, rebutted this claim, warning Motti not to underestimate the power of the Force. Arrogance clouding his judgment, Motti mocked Vader, insulting his devotion to the Force, alleging that it had not helped him recover the stolen Death Star plans or locate the Rebels' hidden base. In response, Vader began to force choke the admiral while rebuking him for his \"lack of faith\", relenting only at Tarkin's insistence. Motti slumped across the conference table, gasping for breath and considerably unnerved. Nevertheless, he later submitted a sharply worded incident report criticizing what he characterized as Vader's attempt at religious proselytization, further stressing his confidence and his pride in the battle station.\nLater, Motti supervised the final checkout of the station, and went to relay the news to Grand Moff Tarkin.  Upon arrival, Motti relayed the report to the Grand Moff, as well as to Lord Vader and General Tagge, then asked Tarkin what course the battle station would take. Tarkin asked Motti to set course for Organa's home planet of Alderaan in order to persuade Princess Leia to reveal the location of the Rebel's hidden base, and Motti responded that he would do it with pleasure. Shortly thereafter, Motti approached the Grand Moff in private, once again expressing the extraordinary capabilities of the Death Star. This time, he noted that ultimate power in the universe now rested with Tarkin, as he was in command of the battle station. Motti pointed out that the Grand Moff could, if willing, assume a position of authority in the Empire second only to the Emperor—subtly suggesting that he himself could serve with Tarkin. For his part, Tarkin regarded Motti's words as near treasonous and rejected the overture, though the ambitious Motti was not deterred from the idea.\nWhen the Death Star arrived at Alderaan, Motti approached Tarkin and told him the information. Just then, Vader appeared with Princess Leia in his possession, and, as Motti looked on, Tarkin openly threatened to destroy the planet if she did not reveal the location of the Rebel's hidden base. In response to the threat of Alderaan's destruction, Organa informed the Grand Moff that the Rebel's base was on Dantooine. However, despite the Princess' reveal, Tarkin ordered Motti to have the Death Star's superlaser fire when ready, which shocked the princess. Motti did as ordered, and the Death Star fired on Alderaan, destroying it within moments.\nBefore long, the Millennium Falcon managed to make it aboard the Death Star from Tatooine, and its crew succeeded in freeing Organa from her cell. In the ensuing fight, the crew managed to escape the battle station, but not before Imperial stormtroopers had placed a tracking device aboard the starship. The Empire managed to track the freighter to the Rebel base on the fourth moon of the planet Yavin, which was located in the Outer Rim, and, as the Death Star prepared to destroy Yavin 4, a battle began between the Imperial and Rebel forces above the Death Star.\nWhen several X-wing fighters proved adept at evading the station's defenses, Vader manned his personal TIE fighter and attacked them. He began picking off the surviving fighters one by one, but some officers nevertheless began to worry that the Rebel attack posed a danger. As the Death Star closed in on the rebel base, Motti was in the Overbridge and spoke to the station's gunner. However, the Alliance was aware of a flaw in the Death Star—a small, uncovered thermal exhaust port leading directly to the station's main reactor. Against all odds, a Rebel X-wing piloted by Luke Skywalker succeeded in flying through the trench where the exhaust port was located, and successfully fired a pair of proton torpedoes into the shaft, causing the Death Star to explode, instantly killing all those on board, Motti included.\nMotti was loyal to Grand Moff Tarkin and held a rivalry against Vader. His ambition at times overrode his loyalty to the Empire, as evidenced in his approaching Tarkin to use the Death Star in a bid for power—where Motti himself would be at Tarkin's right hand. This ambition was partially borne out of his faith in the Death Star as an instrument of ultimate power; he believed the battle station to be invulnerable and considered that any rebel attack against would be a useless gesture doomed to fail. In this sense, he was vocally critical of views such as those of General Tagge concerning a credible rebel threat, colorfully stating that \"the dog nipping at  heels is no threat to my locked and guarded house\"—referring to the Death Star. More generally, Motti was dismissive of the rebellion as a whole, viewing the Alliance's military capabilities as nothing more than a \"patchwork of X- and Y-wing fighters\".\nAccording to Leia Organa, Motti enjoyed one of the largest egos in the galaxy. His arrogance was visible in his condescension towards other high-ranking officers, and in his submission of a lengthy and strongly-worded report on the strangulation incident between him and Darth Vader. Despite having been on the receiving end of the Sith Lord's displeasure, Motti remained unrepentant, insisting that Vader was the one at fault for using violence—a fact Motti interpreted as meaning he'd won the argument. He further insinuated that Vader and Tagge were disloyal to the Empire, the former for putting his faith in the Force over the Death Star and the latter for being overly-concerned with the strength of the Rebellion.\nAlthough Motti himself was personally religious, he was also dismissive of the Force and doubted its very existence. He publicly regarded Darth Vader as a mere sorcerer with a \"sad devotion\" to an \"ancient religion\", later justifying his attitude as a response to alleged \"workplace proselytization\". This nearly resulted in his death when Vader Force-choked him for his insolence.\nMotti first appeared in the 1977 film Star Wars: Episode IV A New Hope, the first installment of the Star Wars original trilogy. He was played by Richard LeParmentier, who was credited as \"General Motti.\" Motti was originally intended to be an admiral, but as LeParmentier proved to be too tall for the uniform that he was to wear, he was fitted in the uniform of a general and Motti's rank was changed.\nRichard LeParmentier originally auditioned for the role of Han Solo, but lost out to Harrison Ford. He was then offered the role of a customs officer who would try to stop Solo from leaving Mos Eisley. A friend of LeParmentier took the part, but the role was ultimately cut from the film, yet LeParmentier was invited back one month later to read for Motti's part. An American actor, LeParmentier was one of the few non-English actors cast as Imperial officers who spoke without an English accent. During filming, LeParmentier proposed director George Lucas to do his Mid-Atlantic accent for Motti and Lucas accepted. To shoot the scene where Motti gets Force-choked by Darth Vader, LeParmentier spent days practicing choking in his dressing room to make it look convincing until he was able to control and induce spasms in his neck. While filming the scene, LeParmentier had his pants rolled up to his knees and took his boots off along with Don Henderson as it was really hot.\nIn retrospective, Richard LeParmentier liked to be remembered as Motti, considering that it was an honor to have been part of the Star Wars saga. In his opinion, A New Hope helped him to be offered more roles in some other big movies because it was the most memorable film he had been. LeParmentier was proud of the fact that Motti's Force choke was the first point in the saga that fans saw working the power of The Force, although back at that time, he had no idea if the film was to be as successful as it ultimately turned out. He greatly enjoyed his experience and cited the only inconvenience he faced on set was Motti's boots, as they caused him a considerable amount of foot perspiration. As such, the film's crewmembers would take the boots of the Imperials off and air-dry their feet between shots.\nWhile portraying the character, Richard LeParmentier saw Motti as a trigger-happy military type who was aching to demonstrate the Death Star's power and was resentful to the people who disagreed with him. He played Motti as a sanctimonious and smug character, believing that it was necessary in the contrast with the calm and reasonable Cassio Tagge played by Don Henderson to prompt Darth Vader to use The Force on Motti. By the time of his death in 2013, LeParmentier was producing an animated fan film called Motti Now, in which Motti survives the Battle of Yavin and abandons the Empire. Unfortunately, it's likely that he didn't complete it before his death, as it hasn't been released as of today.\nMotti's full name was revealed by Star Wars creator George Lucas on an episode of Late Night with Conan O'Brien on May 1, 2007. When Lucas was challenged to a trivia question by a fan—Late Night Associate Producer Jordan Schlansky—as to the name of the officer who Darth Vader Force chokes in A New Hope, Lucas jokingly replied \"Conan Antonio Motti\", a tuckerization of Conan O'Brien's name. The next day after the episode's airing, Late Night posted a blog entry on the NBC website about their surprise at the quick response of Wookieepedia in adopting the new full name for Motti as well as their appreciation for Lucas' decision to name the character after O'Brien. The name was then confirmed in-universe by Star Wars Legends novels and eventually in the canon novel Tarkin.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Conan_Antonio_Motti",
  "/wiki/Conan_Antonio_Motti/Legends",
  "/wiki/Age_of_Rebellion_-_Grand_Moff_Tarkin_1",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Darth_Vader_(2020)_6",
  "/wiki/Seswenna",
  "/wiki/0_BBY",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Yavin_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Joint_Chiefs",
  "/wiki/Admiral",
  "/wiki/Imperial_Navy",
  "/wiki/Naval_chief",
  "/wiki/Imperial_Era",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Starship",
  "/wiki/Flag_officer",
  "/wiki/14_BBY",
  "/wiki/Galactic_Civil_War",
  "/wiki/Chief_of_the_Imperial_Navy",
  "/wiki/Admiral_of_the_Fleet",
  "/wiki/Battle_station",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/General",
  "/wiki/Cassio_Tagge",
  "/wiki/Anakin_Skywalker",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Force_choke",
  "/wiki/Death_Star_plans",
  "/wiki/Battle_of_Scarif",
  "/wiki/Scarif",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Battle_of_Yavin",
  "/wiki/Imperial_officer",
  "/wiki/Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Captain",
  "/wiki/Military_rank",
  "/wiki/Rear_Admiral",
  "/wiki/Star_Destroyer",
  "/wiki/Steel_Talon",
  "/wiki/Galactic_Emperor",
  "/wiki/Grand_Moff",
  "/wiki/Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Coruscant",
  "/wiki/Berch_Teller_campaign",
  "/wiki/Berch_Teller",
  "/wiki/Berch_Teller%27s_rebel_cell",
  "/wiki/Naval_Intelligence_Agency",
  "/wiki/Vice_Admiral",
  "/wiki/Dodd_Rancit",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/Death_Star_conference_room",
  "/wiki/Imperial_Army",
  "/wiki/Imperial_Senate",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/The_galaxy",
  "/wiki/The_Force",
  "/wiki/Massassi_Site",
  "/wiki/Alderaan",
  "/wiki/Dantooine",
  "/wiki/The_Disaster",
  "/wiki/Millennium_Falcon",
  "/wiki/Tatooine",
  "/wiki/Rescue_of_Princess_Leia",
  "/wiki/Detention_Block_AA-23",
  "/wiki/Stormtrooper",
  "/wiki/Homing_beacon",
  "/wiki/Freighter",
  "/wiki/Moon",
  "/wiki/Yavin_Prime",
  "/wiki/T-65_X-wing_starfighter",
  "/wiki/Starfighter",
  "/wiki/Darth_Vader%27s_TIE_Advanced",
  "/wiki/TIE_Advanced_x1",
  "/wiki/Officer",
  "/wiki/Reactor",
  "/wiki/Luke_Skywalker",
  "/wiki/Proton_torpedo",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Richard_LeParmentier",
  "/wiki/Han_Solo",
  "/wiki/Harrison_Ford",
  "/wiki/George_Lucas",
  "/wiki/Don_Henderson",
  "/wiki/2013",
  "/wiki/Fan_film",
  "/wiki/May_1",
  "/wiki/2007",
  "/wiki/Tuckerization",
  "/wiki/Conan_O%27Brien",
  "/wiki/Special:Diff/1315629",
  "/wiki/Wookieepedia",
  "/wiki/Star_Wars_Legends",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Bounty_Hunt",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_Heroes_Path",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/Fully_Operational_(short_story)",
  "/wiki/An_Incident_Report",
  "/wiki/Change_of_Heart",
  "/wiki/Verge_of_Greatness",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/Shu-Torun_Lives",
  "/wiki/Star_Wars_(2015)_50",
  "/wiki/Darth_Vader_(2020)_24",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Mission_to_Mos_Eisley_(episode)",
  "/wiki/LEGO_Star_Wars_Terrifying_Tales",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_93",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_40",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Legion",
  "/wiki/Star_Wars:_Legion_Core_Set",
  "/wiki/Emperor_Palpatine_Commander_Expansion",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Spark_of_Hope",
  "/wiki/The_False_Economies_of_Scale",
  "/wiki/Star_Wars_Insider_192",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/From_Scarif_to_Yavin:_The_Psychology_of_War",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Vader_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Inside_Intel:_The_Death_Star",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Imperial_Officers_and_Agents",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/In_the_Star_Wars_Universe",
  "/wiki/Star_Wars_Insider_40",
  "/wiki/December_20",
  "/wiki/2016",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/October_22",
  "/wiki/May_2",
  "/wiki/2008",
  "/wiki/March_3"
 ]
}