{
 "name": "Connus_Trell",
 "display_name": "Connus Trell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "32 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Bando Gora"
     ]
    }
   ]
  }
 ],
 "content": "Connus Trell was a green-skinned male Twi'lek senator who represented the planet Ryloth and the Gaulus sector in the Galactic Senate during the final decades of the Republic Classic era. Along with Orn Free Taa and Chom Frey Kaa, Trell was a large presence in the Senate as the representative of Ryloth and head of the Senate Investigative Committee, but was ultimately murdered by Jango Fett.\nConnus Trell was a male Twi'lek who was appointed co-Senator of the Gaulus sector, serving alongside Orn Free Taa and Chom Frey Kaa in the Galactic Republic Senate on Coruscant. During his tenure, Trell became involved with the Komari Vosa-led Force-worshiping cult called the Bando Gora. Helping to traffic death sticks on Coruscant alongside drug boss Groff Haugg, Trell was obtaining the narcotics from the Malastarian Dug crime lord Sebolto. Unknown to the senator, Senator Palpatine of Naboo was aware of Trell's longtime narcotics business. Palpatine was in fact the alter-ego of Dark Lord of the Sith Darth Sidious and, after his ascension to Supreme Chancellor, Palpatine ordered his secret Sith apprentice Darth Tyranus to find a worthy template for a secret clone army. Creating a challenge to discover which bounty hunter would be selected to be that template, Sidious was prepared to put Trell in the line of fire in order to see his Sith plot come to fruition.\nCommissioned to achieve the bounty on the Bando Gora's feared leader, the bounty hunter Jango Fett began to track the trafficked narcotics  as a way to discern the cult's location. After infiltrating Groff Haugg's nerf-packing plant for answers, Fett discovered a transmission from Trell, who had apparently gotten cold feet about the business and demanded to be released from it. Fett scaled the politician's apartment tower, defeating any police officers who stood in his way, and infiltrated the senator's penthouse. Trell sounded the alarm before being dragged to the balcony of his home, where Fett threatened to drop him over the edge to his death. As Fett threatened to strangle the Twi'lek, Trell revealed his connection with Sebolto of Malastare just as a Coruscant Security Force VAAT/e gunship arrived to end the hostage situation. As CSF ordered Fett to 'release' Trell, the bounty hunter acceded to their wishes, though not in the way they expected, letting go of the senator's neck as he dangled from the balcony. Trell plummeted over a thousand feet to his death, and Fett was forced to fight his way free of the police. Afterwards, Fett stated that Trell wouldn't be missed as he \"was as dirty as they come.\"\nTrell's voice was provided by Gregg Berger.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Bando_Gora/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Gaulus_sector/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Orn_Free_Taa/Legends",
  "/wiki/Chom_Frey_Kaa",
  "/wiki/Senate_Investigative_Committee",
  "/wiki/Komari_Vosa",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Death_stick/Legends",
  "/wiki/Groff_Haugg",
  "/wiki/Malastare/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Sebolto",
  "/wiki/Palpatine/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Galactic_Republic_Chancery_election,_32_BBY",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Prime_clone",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Grand_Plan/Legends",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Variable_Altitude_Assault_Transport/enforcement",
  "/wiki/Gregg_Berger",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/Star_Wars:_Bounty_Hunter"
 ]
}