{
 "name": "Constanten_(Tarasin)",
 "display_name": "Constanten  (Tarasin)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cularin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarasin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Shorter than average"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green-gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Dariana"
     ]
    }
   ]
  }
 ],
 "content": "Constanten was a female Tarasin Jedi Knight serving the Jedi Order and the Galactic Republic during the final years of the Republic Classic era.\nBorn in the Force-rich environment of Hiironi irstat on the planet Cularin, Constanten was discovered to be Force-sensitive and given to the irstat's spiritual leader, Mother Dariana, for training in the mysterious arts. Named after a Jedi Knight who saved her life as an infant, Constanten was a very eager student and appreciated Mother Dariana's teaching methods. At the age of four, Constanten interacted with a Jedi visiting the irstat and became intrigued with the mystery that surrounded him. Following the passage of three years, the Tarasin youth traveled to one of the Jedi Order's academies on nearby Almas and petitioned for enrollment. When the Academy's Council of Masters approved of her training, Constanten went straight to work and eventually passed all of the classes the Academy had to offer. Thus graduating, Headmaster Lanius Qel-Bertuk approached the girl and gave her the choice of remaining on Almas or continuing her training on Coruscant at the Jedi Temple there. Fearing that her attachments in the Cularin system would interfere with the training, Constanten chose to travel to Coruscant to become a Jedi Knight.\nOn Coruscant, Constanten was selected by a Jedi Master for training as a Padawan and traveled the galaxy on many missions, gaining new experiences and growing in the Force. After two decades, Constanten passed the Trials of Knighthood and was given the rank of Knight within the Jedi Order. Returning to the Almas Academy where she studied to become a Jedi Guardian, the Tarasin woman befriended the Skrilling Jedi Valiri and the two worked together on many missions. A respected woman among the Jedi at the academy, Constanten was known for her intense courage in battle, like to that of fellow Jedi K'kur. This fact contributed to the surprise many felt when she refused to respond to the Jedi High Council's call to arms when the Clone Wars erupted in 22 BBY between the Republic and the Confederacy of Independent Systems. Invoking the Right of Denial, Constanten refused a rank within the Grand Army of the Republic; instead remaining on Almas performing her usual duties. Assigned to protect the fortress of long dead Sith Lord Darth Rivan, Constanten was joined by five other Knights in guarding the structure's entrances while a large research party entered its depths. Standing guard at the fortress' south entrance with Knights K'kur and Valiri beside her, the group prepared to defend against any attacks from the dark side sect known as the Believers.\nWhile the group waited outside the fortress, a sandstorm swept across the area, plunging the structure into a dismal gloom. During the storm, dark side adept Phylus Mon led a group of raiders, including a giant Force-sensitive Wampa in an attack on the ancient Sith edifice. While most of the Jedi guards were killed, Constanten and Valiri were merely wounded, and thus taken captive by the dark siders. Deep in the fortress, Adept Mon and his followers preformed a Sith ritual, planning on enslaving the two prisoners and several volunteers and transforming them into Sith battlelords. The ritual went wrong however, ripping the participants' very Force-essence from their bodies and bonding them with a crystal that Mon quickly confiscated and took with the fleeing raiders. Long after the ritual had ended, Jedi search teams happened upon the bodies of the sacrificial men and women and took them back to the academy for further analysis. There, Jedi librarian Oden Malksch accidentally possessed the body of Karae Nalvas, discovering where Mon's secret headquarters was during the experience. Reporting back to headmaster Lanius Qel-Bertuk, the Jedi sent a team to find and destroy the crystal in hopes that the Force-essences would then return to their respective bodies.\nCourageous and quick, Constanten was a fierce warrior and skilled with a lightsaber. Short and slim for a Tarasin, Constanten was surprisingly strong, and could hold her own in battle. Possessing fiery, knowing eyes the color of a gargrell flower, her translucent skin maintained a light green, almost gray, color.\nOne player character in A Mon Alone can, at a certain point, enter this non-player character's body and use Constanten's statistics until her essence can be freed , or until Constanten's body is killed in action. The text explains that some of the final scenes are so dangerous that they could easily kill the player characters - leading to the players getting angry.\nContrarily to the other \"available empty bodies\", Constanten's entry does not include her thoughts about the other \"empty bodies\" - We know that Valiri and her were friends because Valiri's entry specifies so.\nAlthough Constanten's role-playing game stats list her as a \"Male Tarasin Jedi Guardian\", all the other text references to the character specify that Constanten is a female. .",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Constanten",
  "/wiki/Cularin/Legends",
  "/wiki/Tarasin",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Dariana",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/The_Force/Legends",
  "/wiki/Hiironi_irstat",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Almas",
  "/wiki/Almas_Council",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Cularin_system",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Skrilling/Legends",
  "/wiki/Valiri",
  "/wiki/K%27kur",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Right_of_Denial",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Almas_Sith_fortress",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Rivan",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Believers",
  "/wiki/Dark_Side_Adept",
  "/wiki/Phylus_Mon",
  "/wiki/Wampa/Legends",
  "/wiki/Sith_battlelord",
  "/wiki/Jedi_Lore_Keeper",
  "/wiki/Oden_Malksch",
  "/wiki/Karae_Nalvas",
  "/wiki/Gargrell_flower",
  "/wiki/A_Mon_Alone"
 ]
}