{
 "name": "Copek_(Gungan)",
 "display_name": "Copek  (Gungan)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Before 3000 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Otoh Urs",
      "Gungan Grand Army"
     ]
    }
   ]
  }
 ],
 "content": "Copek was an Ankura Gungan and the Boss of the city of Otoh Urs on the planet Naboo in the year 3000 BBY. During a war between the Gungan tribes around that time, Otoh Urs regularly suffered attacks from native predatory bursa creatures. The city was eventually visited by Gallo, another Boss who was uniting the Gungans against Rogoe, the instigator of the war. Copek said he would join Gallo's cause if he removed the bursa threat, which Gallo was able to do. Copek then contributed four energy catapults to Gallo's Grand Army.\nCopek was a male Ankura Gungan with green skin who was the Boss of the city of Otoh Urs on the planet Naboo in 3000 BBY. While he served as Otoh Urs's Boss, the Gungan tribes became engaged in heavy warfare with each other, and at the same time, the city faced constant attacks from bursas, a carnivorous and semi-sentient predator species on Naboo. Due to the attacks, Copek was forced to keep training Gungans to defend Otoh Urs from the bursas, but he was unable to completely remove the threat.\nEventually, Copek was visited by Gallo, the former Boss of the city of Otoh Sancture, who was trying to unite the Gungans against Rogoe, the Gungan warlord who had instigated the war. Copek told Gallo that he was sympathetic to his cause, as Gallo's city had been destroyed by bursas, but said that he would only join Gallo if he agreed to kill the bursas attacking his city. Gallo led his militiagungs to destroy the bursas, and the Gungans returned to Otoh Urs carrying their pelts. Glad to finally be rid of the bursas, Copek contributed four energy catapults to Gallo's Grand Army.\nDuring the war between the Gungan tribes, Copek was forced to keep training militiagungs to fight the bursas assaulting his city, but he was unable to find a permanent way to end the threat, which caused him to ask Boss Gallo for assistance. Copek was also sympathetic to Gallo, as both of their cities had been attacked by bursas, with Gallo's being destroyed. Copek was also a Gungan surname for a violent predator found in the waterways in Naboo's core.\nThe boss of Otoh Urs was first mentioned in Star Wars: Galactic Battlegrounds: Prima's Official Strategy Guide by Steven L. Kent, released on November 7, 2001. He appeared and was identified as Copek in the second level of the Gungan campaign, \"The Gungan Who Would Be Boss,\" in the LucasArts video game Star Wars: Galactic Battlegrounds, released on November 11, 2001. The guide stated that only his voice would be heard, but in the game Copek is physically seen in Otoh Urs. The image that represents Copek in the game is the same used for several other Gungan bosses who appear, and his voice actor is uncredited in the game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Gungan/Legends",
  "/wiki/Boss/Legends",
  "/wiki/Copek",
  "/wiki/Naboo/Legends",
  "/wiki/3000_BBY",
  "/wiki/Ankura/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Otoh_Urs",
  "/wiki/Gungan_Grand_Army/Legends",
  "/wiki/City/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/War_of_the_Gungan_tribes",
  "/wiki/Time/Legends",
  "/wiki/Bursa/Legends",
  "/wiki/Gallo/Legends",
  "/wiki/Rogoe/Legends",
  "/wiki/Gungan_energy_catapult",
  "/wiki/Sentience/Legends",
  "/wiki/Species/Legends",
  "/wiki/Otoh_Sancture",
  "/wiki/Warlord/Legends",
  "/wiki/Death/Legends",
  "/wiki/Militiagung/Legends",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Steven_L._Kent",
  "/wiki/November_7",
  "/wiki/2001",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/November_11",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/The_Essential_Atlas",
  "/wiki/Galactic_Campaign_Guide"
 ]
}