{
 "name": "Cora  (Human)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish brown {{|grayish-green eyebrows}}"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Cora was a Human female Corellian Security Force officer who lived on Corellia during the Galactic Civil War.\nFollowing the Battle of Yavin, Cora was an inspector of the Corellian Security Force, stationed in Tyrena, under the orders of Captain Jark.\nIn 1 ABY, a ship piloted by CorSec Captain Donovan and carrying a cargo of weapons to the local CorSec force in Tyrena apparently crashed near the city. Cora was ordered by Captain Jark to investigate the crash. However, the ship was also carrying medical equipment for the merchant Sinis. Sinis thus recruited a spacer to investigate the ship crash site and retrieve some equipment. The spacer discovered that a criminal organization known as the Deflarians modified the ship's flight recorder and stole a part of the cargo.\nInspector Cora therefore ordered the spacer to return to the Deflarian camp were the spacer found Sinis' medical equipment. From a scan of the area, Cora identified a courier who was used by the Deflarians for deliveries between camps. The spacer followed the courier until they arrived to the Deflarian bunker. The spacer infiltrated the bunker and found the imprisoned Captain Donovan. The spacer therefore killed Vinros, several Deflarian henchmen and a Deflarian underboss to liberate Donovan. Donovan later revealed that his ship was hijacked by the Deflarians who then crashed a ship of the same model than Donovan's to cover the theft of the cargo. Cora thus tasked spacers to assault another Deflarian camp, whose location was provided by Donovan. During the raid, the spacers killed several Deflarian guards and mechanics, as well as the Deflarian leader Deflaros and his bodyguards, and finally managed to secure Donovan's ship and its cargo.\nCora was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Cora was added to the game with the release of the \"Publish 28\", on April 26, 2006.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Donovan_(captain)",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Inspector/Legends",
  "/wiki/Tyrena/Legends",
  "/wiki/Jark",
  "/wiki/1_ABY/Legends",
  "/wiki/Sinis",
  "/wiki/Deflarians",
  "/wiki/Deflarian_bunker",
  "/wiki/Vinros",
  "/wiki/Deflaros",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/April_26",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}