{
 "name": "Coral_(Human)",
 "display_name": "Coral  (Human)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Project 32"
     ]
    }
   ]
  }
 ],
 "content": "Coral was a female Human living during the Cold War. Born as part of the Republic Strategic Information Service Project 32 during the Great Galactic War, Coral was one of twelve near-identical individuals - either clones or otherwise closely related - who were supplied with extremely high-tech facial implants, which allowed them to have instance access to HoloNet.\nBy the time of the Galactic War in 3642 BBY Coral went rogue and began hunting and killing everyone involved in Project 32. SIS agents Carteri and Izak began hunting Coral down with the help of two other Project 32 subjects. At some point Coral was contacted by another one of Project 32 subjects Mako, who had no memory of the Project and believed Coral was her sister. Coral used this opportunity to set her up into meeting with Izak on Dromund Kaas instead of her, to throw him off her tail. Coral was eventually tracked down by Izak to the Gudnem's Gadget Emporium on Nar Shaddaa, though Mako got there first and confronted Coral. Coral claimed that Mako was not a real person and called her a \"cheap copy\". Izak and his men arrived shortly after and took Coral into custody.\nCoral appears in Star Wars: The Old Republic during Mako companion storyline.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Project_32",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Great_Galactic_War",
  "/wiki/HoloNet/Legends",
  "/wiki/Galactic_War",
  "/wiki/3642_BBY",
  "/wiki/Carteri",
  "/wiki/Izak",
  "/wiki/Mako_(slicer)",
  "/wiki/Dromund_Kaas",
  "/wiki/Gudnem%27s_Gadget_Emporium",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Hunter_(individual)"
 ]
}