{
 "name": "Coret_Bhan",
 "display_name": "Coret Bhan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Coret Bhan was a Zabrak male, who was a former colonist in a harsh Mid Rim region. He had a strong hatred of the Galactic Empire and became a Captain in the Rebel Alliance. He was an intense fighter who led by example.\nShortly before the battle of Talus Captain Bhan led a hit-and-run attack on the Raithal Academy. A Rebel strike force has landed just outside the Raithal Academy and—without trying to capture or destroy it—tried to disrupt Imperial planning in preparation for the operation in the Corellian system. When the cadets of Academy put up reasonable defense, Rebel forces fell back in good order towards their landing craft, leaving behind some explosives which they planned to use to blow the starport on their way out.\nLater, when the initial Imperial assault on the Talus base had failed, Bhan led a Rebel counterattack at the Imperial outpost on Talus. The Rebel attack force consisted of Rebel commandos, supported by heavy troopers and Y-wing bombers. All available Imperial soldiers rushed to defend the outpost, and eventually began to make headway against the Rebels. As this was yet another strike-and-fade operation, planned to disrupt Imperial operations, Bhan gave the order for the Alliance forces to fall back. The Rebels quickly escaped back to their base, while the Imperials were in no shape to pursue them.\nFollowing the battle of Talus, Zabrak's career was rising. Bhan's field command skills were so valuable that the Alliance High Command refused to promote him to a desk job. Bhan held the rank of Major longer than anyone else in the Alliance. The fact attracted the attention of the Galactic Empire, and Bhan's name was put onto Emperor's Most Wanted, a list of high-paid bounties on critical Alliance leaders. Two bounty hunters cooperated to capture Bhan; one of them was IG-88A, who had obtained Bhan's deployment orders from a Rebel courier. Bhan was going to lead a strike-and-fade operation on an Imperial outpost on Dantooine. The bounty hunters decided to ambush him in the field, despite knowing that Bhan would be surrounded by veteran commandos. When the Rebel strike team reached the rough terrain surrounding the outpost, the Rebels were forced to cover the last kilometers on foot. As Bhan led the commandos into a clearing, IG-88 activated the trip wires which set off flechette mines and smoke bombs placed by the assassin droid. While the Rebels were confused, the bounty hunters launched their attack. The ambush worked perfectly, and soon the Rebels were forced to surrender. Bhan ordered his men to stand down, while IG-88 put him in binders and prepared to deliver him to the Imperial authorities.\nThe temporary holding place for the captured Rebels was the Imperial prison facility in a rough mountain area just outside Bestine on Tatooine. Bhan was handed over to the Empire, but the Rebel agents learned the location of the facility and launched a bold raid in an attempt to rescue the prisoners. Despite heavy resistance from the Imperial forces, the Rebels gained the upper hand and evacuated the rescued prisoners, including Bhan, to safety.\nWhen a large shipment of ryll went missing on its way to Alliance medical facility, several Rebel operatives were dispatched to track it down. Bhan, along with several Rebel commandos, was supposed to meet with CorSec Major Alana Walden at the Mos Eisley spaceport, but while waiting for their contact to arrive, the Rebels were confronted by a band of smugglers trying to leave the spaceport. The Rebels had no choice but to fight, and eventually kill them all. After the skirmish many were tired and wounded, but were given no chance to rest. An Imperial Security Bureau  agent stepped around the corner and, after announcing that he had left Major Walden bleeding in a nearby alley, demanded from Bhan the information about the ryll shipment. Bhan's response was delivered with a blaster bolt, and his commandos had joined him, though they were weakened from the previous firefight. Soon, several of Bhan's men were killed and the rest were in no shape to fight. The Imperial got no information from Bhan, though a young wounded corporal accidentally mentioned that Bhan was supposed to meet with Han Solo on Corellia. The ISB agent jokingly saluted the wounded Rebels and departed, while they were too weak to do anything about it.\nWhile Bhan did not approve of such activities, as a Rebel officer he often had to deal with smugglers. On the moon of Rori, Bhan was supposed to meet with Dash Rendar, a smuggler, who transported valuable cargo for the Alliance, using the swoop racing to cover his movements. Bhan received a small package from Rendar behind a grandstand and prepared to leave, when he was suddenly confronted by an ISB agent. His combat skills gave him the upper hand over the Imperial, forcing the latter to retreat and to report Bhan's involvement to his superiors.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/File:Coret_Bhan_-_SWGTCG.jpg",
  "/wiki/Battle_of_Talus",
  "/wiki/Attack_on_the_Raithal_Academy",
  "/wiki/Raithal_Academy/Legends",
  "/wiki/Corellian_system",
  "/wiki/Cadet/Legends",
  "/wiki/Talus_base",
  "/wiki/Talus/Legends",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/File:Coret_Bhan_-_GH.jpg",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Major/Legends",
  "/wiki/Emperor%27s_Most_Wanted",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/IG-88A/Legends",
  "/wiki/IG-88_assassin_droid/Legends",
  "/wiki/Flechette_mine",
  "/wiki/Smoke_bomb/Legends",
  "/wiki/Assassin_droid/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/File:CoretBhan-AoD.jpg",
  "/wiki/Coruscant/Legends",
  "/wiki/Ryll/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Alana_Walden",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Corporal/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Rori/Legends",
  "/wiki/Dash_Rendar/Legends",
  "/wiki/Category:Images_of_Coret_Bhan",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Squadrons_Over_Corellia",
  "/wiki/Galactic_Hunters",
  "/wiki/Agents_of_Deception",
  "/wiki/File:Coret_Bhan_avatar_PoV.jpg",
  "/wiki/Champions_of_the_Force_(SWGTCG)",
  "/wiki/Template:SWGTCG",
  "/wiki/The_Shadow_Syndicate",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Threat_of_the_Conqueror"
 ]
}