{
 "name": "Corin Tok",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Corin Tok, known as the \"Sith Butcher\" by the forces of the Sith Empire and Verda Jédii by the Mandalorians, was a male Zabrak Jedi Master of the Jedi Order renowned for his fortitude. His most famous acts were during the Sacking of Coruscant and the Battle of Corellia.\nAt the time of the Cold War, Master Corin Tok was an aged, and battle-hardened, Jedi General working for the Republic. He had earned his stripes during the Great Galactic War, primarily during the Sacking of Coruscant. One of the few Jedi to survive that day, many Sith fell to his blade and a myth began to surround him. He was apparently able to shrug off blaster fire as if it were nothing, with lightsabers failing in his presence. Although these were due to reinforced armor and cortosis-weaves, Imperial troops throughout the Empire knew of and feared the Jedi.\nThis reputation carried him to the Battle of Corellia, where he stood as the Republic's last hope in holding Axial Park. Keeping the Imperials at bay, he drew the attention of General Hesker, the Imperial commander of the area, who sent a strike team in to eliminate him. Although he refused to go without a fight, he would ultimately fall before the Imperial forces, damaging Republic morale. In his last moments, he asked his killers to spare the lives of the wounded he was protecting.\nCorin was vastly skilled in lightsaber combat, as shown during the Sacking of Coruscant and the aforementioned Corellian Invasion.\nWhile he favored single saber combat and the Soresu form, he was also well-versed in Niman, wielding two yellow-bladed lightsabers in tandem against his foes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corin",
  "/wiki/3640_BBY",
  "/wiki/Corellia/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Mandalorian/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Battle_of_Corellia",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Jedi_General/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Cortosis-weave",
  "/wiki/Axial_Park",
  "/wiki/General/Legends",
  "/wiki/Hesker",
  "/wiki/Form_III",
  "/wiki/Niman",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Battle_of_Ilum",
  "/wiki/Standard_year/Legends"
 ]
}