{
 "name": "Corkash_Fenc",
 "display_name": "Corkash Fenc",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Intarsa League"
     ]
    }
   ]
  }
 ],
 "content": "Corkash Fenc was a Rodian male soldier who lived during the last decades of the Galactic Republic.\nFenc was a member of the Intarsa League, a criminal faction led by the Force Adept Dersa Welles, and in around 31 BBY he accompanied the league on a shuttle journey to the planet Cularin. However, the League had incurred the ire of a rival criminal faction and their vessel was attacked, leading them to crash-land on Cularin within the grounds of the Blue Star Centre, a philosophical research facility. The Intarsa League quickly seized control of the Blue Star Centre and held its' inhabitants hostage. However, the Heroes of Cularin—a band of freelance operatives that operated within the Cularin system—attacked the Intarsa League and attempted to liberate the hostages. Fenc engaged the freelancers in combat and during the conclusion of the raid Fenc lost control of his blaster, spraying blaster fire across the room and injuring several of the hostages. Fenc and the Intarsa League were ultimately defeated and the hostages were liberated.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Intarsa_League",
  "/wiki/Soldier/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Force_Adept",
  "/wiki/Dersa_Welles",
  "/wiki/31_BBY/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Blue_Star_Centre",
  "/wiki/Philosopher/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Cularin_system",
  "/wiki/Skirmish_in_the_Blue_Star_Centre",
  "/wiki/Blaster/Legends",
  "/wiki/Operation_Blue_Star"
 ]
}