{
 "name": "Corla_Unser",
 "display_name": "Corla Unser",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    }
   ]
  }
 ],
 "content": "Corla Unser was a Human female who traveled with her free-trader brother, Cobb. Cobb was constantly in debt, and resorted to desperate measures to change their situation, and Corla was along for the ride. Unfortunately, everything he tried slid them further and further into debt. Around 7 ABY, the pair was fleeing from bounty hunters when they put down on Kal'Shebbol. Their freighter was impounded when Cobb couldn't pay the harsh starport tariffs set by Moff Kentor Sarne.\nCorla settled in the starport and tried to earn enough money to get transport away from the planet. She took a job as a repulsorlift driver, while Cobb repaired droids and starships. Corla's job took her to Sarne's palace, where the Moff became enamored with her, lavishing her with gifts. Repelled by Sarne's advances, Corla was arrested and sent to the Q'Maere Research Facility to be retrained to \"appreciate him\" a few days before the Battle of Kal'Shebbol.\nAt the facility, she was well treated by Doctor Langstyn Kraay, as he was under orders from Sarne not to harm her. When Sarne arrived at the facility several weeks later and stripped it of much of its staff and military personnel, she was dumped into the main prison population.\nIn the prison block, she met and fell in love with Lowen Chase, but they put their relationship on hold until they could escape. When the FarStar landing party arrived at the facility, she was overjoyed to be reunited with her brother who had piloted their shuttle to the surface. She assisted in the prison breakout, and volunteered for service on the FarStar to be close to both Chase and her brother.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Cobb_Unser",
  "/wiki/7_ABY/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Kal%27Shebbol/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Kentor_Sarne",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Imperial_Government_Complex",
  "/wiki/Q%27Maere_Research_Facility",
  "/wiki/Battle_of_Kal%27Shebbol",
  "/wiki/Doctor/Legends",
  "/wiki/Langstyn_Kraay",
  "/wiki/FarStar",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/Harm%27s_Way",
  "/wiki/The_Kathol_Rift",
  "/wiki/Rogue_Elements",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}