{
 "name": "Corleque",
 "display_name": "Corleque",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Corleque was a human male who served in the Imperial Navy with the rank of admiral. Between 3 ABY and 4 ABY, Corleque and Administrator Sly Moore led a force of three Imperial II-class Star Destroyers while undertaking a mission assigned by Emperor Palpatine to kill the Sith Lord Darth Vader in Red Space. Corleque and Moore unleashed hundreds of TIE fighters to stop Darth Vader, but the Sith Lord managed to destroy several fighters and to escape in a nebula, where a subspecies of the summa-verminoth resided.\nCorleque was a human male who served the Galactic Empire during its reign. Between 3 ABY and 4 ABY, Corleque served in the Imperial Navy with the rank of admiral and led a force of three Imperial II-class Star Destroyers. Corleque and his forces assisted Administrator Sly Moore in following Emperor Palpatine's command to kill the Sith Lord Darth Vader and the Sith assassin Ochi in Red Space.\nMoore warned Darth Vader that their Star Destroyers would have killed him, but the Sith Lord replied that, as Ochi had failed in the task, so would they. Corleque was confident that the Star Destroyers' cannons would have shot Vader's interceptor down, but Moore ordered several TIE fighters to chase the Sith Lord's starship. After Darth Vader destroyed them, Corleque unleashed the rest of his TIEs. In order to escape, Vader flew towards a nebula, where a creature, subspecies of the summa-verminoth, resided. The admiral asked what the creature was, and Moore replied that it was the galaxy's greatest predator. The creature destroyed several TIEs that were following Vader in the nebula, but Vader managed to evade it and escape.\nCorleque had black hair, blue eyes, and fair skin. The admiral would have preferred to let the Star Destroyers' cannons shoot Vader down, but Moore ordered to unleash the TIE fighters.\nCorleque wore a green uniform, a green kepi cap, black gloves, and black boots. His uniform also featured a rank insignia plaque and four code cylinders.\nCorleque appeared in the comic book Darth Vader 10, the tenth issue of the comic book series Star Wars: Darth Vader. The comic, published by Marvel Comics on February 10, 2021, was written by Greg Pak and illustrated by Raffaele Ienco and Neeraj Menon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Imperial_Navy",
  "/wiki/Military_rank",
  "/wiki/Admiral",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Administrator",
  "/wiki/Sly_Moore",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Mission_to_Exegol",
  "/wiki/Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Death",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Red_Honeycomb_Zone",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Darth",
  "/wiki/Sith_Lord",
  "/wiki/Starfighter",
  "/wiki/Nebula",
  "/wiki/Unidentified_summa-verminoth_subspecies",
  "/wiki/Summa-verminoth",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Emperor",
  "/wiki/Sith_assassin",
  "/wiki/Ochi",
  "/wiki/Ion_cannon",
  "/wiki/Darth_Vader%27s_green_Eta-2_Actis-class_light_interceptor",
  "/wiki/Sith",
  "/wiki/Starship",
  "/wiki/Subspecies",
  "/wiki/The_galaxy",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Hat",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Code_cylinder",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Darth_Vader_(2020)_10",
  "/wiki/Star_Wars:_Darth_Vader_(2020)",
  "/wiki/Marvel_Comics",
  "/wiki/February_10",
  "/wiki/2021",
  "/wiki/Greg_Pak",
  "/wiki/Raffaele_Ienco",
  "/wiki/Neeraj_Menon",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/StarWars.com"
 ]
}