{
 "name": "Corman Quien",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Corman Quien was a Human male corporal and scout of the Alliance to Restore the Republic during the Galactic Civil War. Although he never thought his love of animals would benefit the Rebellion, Quien found use for his skills as a beast tamer. Assigned to Alliance High Command, Quien joined the Alliance Corps of Engineers as one of the first to be sent to the newly established Echo Base on Hoth, where he helped capture and train the ice planet's native tauntauns as mounts. Quien died during the Battle of Hoth in 3 ABY when a startled herd of tauntauns broke loose from their holdings, trampling him.\nCorporal Corman Quien's value to the Alliance to Restore the Republic came in his expertise with animals. The Alliance put his skills to use by charging Quien with the capture, taming, and training of native creatures to use as mounts or beasts of burden. In that capacity the Alliance High Command assigned Quien to Major Kem Monnon's Corps of Engineers, the constructors of the Alliance's headquarters of Echo Base on the remote Outer Rim Territories ice planet Hoth. Quien's presence on Hoth proved more valuable than expected when the Alliance faced difficulty adapting the base's T-47 airspeeders to the planet's freezing temperatures. While Monnon's men built the base, Quien rounded up and tamed Hoth's native tauntauns to use as mounts in place of speeders.\nQuien's service as a tauntaun handler at Echo Base continued into 3 ABY. On one occasion, at the behest of deck officer Commander Tamizander Rey, Quien took the reins of Han Solo's tauntaun to help him dismount the beast after Solo finished a routine patrol of Hoth's exterior plains around the base's outer perimeter with Luke Skywalker, which ended in Skywalker being attacked by one of the planet's native wampa ice creatures. Soon thereafter, once Echo Base discovered that Skywalker had gone missing, Quien volunteered to cover Sector 12 as part of Lieutenant Cal Alder's search party for Skywalker. Quien instructed base control to set their surveillance cameras to alpha screen.\nQuien was killed in the Rebels' subsequent evacuation of Echo Base during the Battle of Hoth, one of the Rebellion's worst defeats of the Galactic Civil War, when a startled herd of tauntauns broke free of their restraints and trampled him. Four others were similarly killed. Following his death, Quien became well-known as one of Echo Base's tauntaun handlers.\nCorman Quien was typical of scouts posted at Echo Base. He did not believe his love of animals was a skill that could be put to good use with the Rebellion, but Quien's service at Echo Base demonstrated the success the Rebels achieved by way of making use of their surroundings. He helped Echo Base round up Hoth's native tauntauns, effectively creating an alternative mode of transportation to the Rebels' snowspeeders. Quien, a Human, had brown hair and light skin.\nWhile serving at Echo Base, Quien wore the Rebels' standard cold-weather armor. At the time he assisted Han Solo in dismounting his tauntaun, Quien donned only the hat portion of the outfit's headgear as well as a padded vest, lightweight tunic, and gloves.\nCorman Quien appears in the 1980 film Star Wars: Episode V The Empire Strikes Back as the individual who takes the reins of Han Solo's tauntaun when Solo first enters the Rebel base at the beginning of the film. The character went unnamed until the November 1996 Hoth Limited expansion set of the Star Wars Customizable Card Game identified him as one \"Corman Quien\" on the \"Tauntaun Handler\" card.\nQuien is also referenced in the February 2004 article Who's Who in Echo Base, appearing in Star Wars Insider 74, which establishes Quien's background as an animal enthusiast. The Star Wars Insider article identifies Quien as being the character behind the off-screen voice in The Empire Strikes Back who announces that he will \"cover sector twelve\" in the search for the missing Luke Skywalker, and it was the first source to confirm Quien's death at the Battle of Hoth.\nThe Marvel Star Wars comic adaptation of The Empire Strikes Back—specifically, issue Star Wars  39—shows Quien teasing Solo about looking cold and not demonstrating typical Corellian toughness when he takes the reins of his tauntaun, to which Solo replies, \"Cold isn't the word for it!\" Alternatively, The Empire Strikes Back novelization features a similar exchange during this same scene moments later between Solo and Chewbacca, in which Solo recites the same line. However, the film shows no such verbal exchange between Quien and Solo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3_ABY/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/File:JamiroAssistant.ogg",
  "/wiki/Corporal/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Alliance_Corps_of_Engineers",
  "/wiki/Echo_Base/Legends",
  "/wiki/Water/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tauntaun/Legends",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Major/Legends",
  "/wiki/Kem_Monnon/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/T-47_airspeeder/Legends",
  "/wiki/Temperature/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Deck_officer/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Tamizander_Rey",
  "/wiki/Han_Solo/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/One-Arm",
  "/wiki/Wampa/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Cal_Alder/Legends",
  "/wiki/Surveillance_camera",
  "/wiki/Hair/Legends",
  "/wiki/Alliance_Cold_Weather_armor",
  "/wiki/Time/Legends",
  "/wiki/Hat/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Alliance_Cold_Weather_Headgear",
  "/wiki/Alliance_Cold_Weather_Padded_Vest",
  "/wiki/Alliance_Cold_Weather_tunic",
  "/wiki/Alliance_Cold_Weather_Gloves",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/November",
  "/wiki/1996",
  "/wiki/Hoth_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/February",
  "/wiki/2004",
  "/wiki/Who%27s_Who_in_Echo_Base",
  "/wiki/Star_Wars_Insider_74",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_(1977)_39",
  "/wiki/Corellian/Legends",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/Chewbacca/Legends",
  "/wiki/The_Empire_Strikes_Back_(radio)",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(junior_novelization)",
  "/wiki/The_Empire_Strikes_Back_Notebook",
  "/wiki/The_Empire_Strikes_Back:_The_National_Public_Radio_Dramatization",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back:_The_Illustrated_Screenplay",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Wizards.com",
  "/wiki/Hoth:_Under_the_Ice,_Part_2:_Steady,_Girl",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Ultimate_Action_Figure_Collection",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Atlas"
 ]
}