{
 "name": "Corman_Jeihn",
 "display_name": "Corman Jeihn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Calabosh-2"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Caliban",
      "Bespin Wing Guard"
     ]
    }
   ]
  }
 ],
 "content": "Corman Jeihn was a Human male from Calabosh-2 where he served for a time as a security guard for the weapons manufacturing company Caliban. When the company was nationalized by the Galactic Empire for supporting the Alliance to Restore the Republic, Jeihn left Caliban and moved to the planet Bespin, where he became a member of the Bespin Wing Guard. In 3 ABY, just prior to the Occupation of Bespin, Jeihn was present with Lando Calrissian, Lobot, and several of his fellow Wing Guardsmen to greet a group of Rebels when they arrived on the floating mining colony of Cloud City. After the Rebels were captured by forces of the Galactic Empire, Jeihn, Lobot and several other Wing Guardsmen proceeded to ambush an Imperial unit led by Lieutenant Sheckil and free three of the Rebels on Calrissian's orders.\nBorn on the world of Calabosh-2, the Human male Corman Jeihn took work on his homeworld as security for the Caliban arms-manufacturing company. He remained with the company until it was discovered by the Galactic Empire that they had been selling weapons to the Alliance to Restore the Republic during the Galactic Civil War, at which point Caliban was nationalised and its assets absorbed by Imperial Munitions, and Jeihn left Calabosh-2. He traveled to the planet Bespin, where he found work in the Bespin Wing Guard, policing Cloud City. In 3 ABY, the Empire once again impacted on his life however, when an Imperial force lead by the Sith Lord Darth Vader arrived on Cloud City in order to capture a group of Rebels headed to Bespin. The Baron Administrator of the city, Lando Calrissian, struck a deal with Vader in which he promised to help the Imperials capture the Rebels as long as Cloud City was left free of Imperial control. Jeihn, along with five other Wing Guards; Bialar Selis, Fin Mak'lath, Fantes Mer'darro, Allen Neff and Helder Spinoza, accompanied Calrissian and his Chief administrative aide Lobot to Platform 327 in Cloud City to greet the Rebels when they arrived. He and the five other guardsmen stood silently as Calrissian met with his old friends Han Solo and Chewbacca, along with their new companions Leia Organa and C-3PO, none of whom knew that a trap awaited them within the city.\nThe Rebels were all later captured by Vader, who then changed elements of the deal concerning the prisoners with Calrissian. This angered Calrissian, and caused him to secretly back out of the deal, deciding to help the Rebels instead. Using the order \"Code Force Seven\", he made Lobot aware of the change of plans, after which the aide gathered twelve guardsmen including Jeihn, Selis, Spinoza, Pedar Solardo, Gir Endac and Razell Tameron. The group cut off a squad of six Imperials lead by Lieutenant Sheckil, and accompanied by Calrissian, who were escorting three of the Rebel prisoners to Vader's personal shuttle. The guards and Lobot drew their blasters on the outnumbered Imperials, who surrendered, allowing Calrissian to free the prisoners. The Baron Administrator then ordered that the Imperials be quietly taken to the Cloud City Security Tower, which the Wing Guard used as a detention center, as to not raise suspicion in the other Imperials. After Jeihn and the other Guardsmen escorted the Imperials away, Calrissian and the other Rebels made their escape, although this left Cloud City under the control of the Empire.\nCorman Jeihn was a light skinned Human with black hair. He was not involved in the corruption that had swelled within the Wing Guards ranks under the Baron Administrator who served before Calrissian, Dominic Raynor.\nJeihn wore the standard blue uniform that all guardsmen wore while serving in the Wing Guard, and carried a standard issue Relby-k23 blaster pistol.\nCorman Jeihn first appeared in Star Wars: Episode V The Empire Strikes Back in which he was portrayed by an uncredited extra. He was identified in 2014, when several of the Wing Guards were named in the Rogues Gallery feature of Star Wars Insider 148. The feature was written by Tim Veekhoven, Kevin Beentjes and Sander de Lange, who later said in a Facebook post that all of the Wing Guards in the article who had not previously been established as corrupt were not corrupt, and most were \"good guys\" who opposed the corruption.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Calabosh-2",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Caliban_(manufacturer)/Legends",
  "/wiki/Bespin_Wing_Guard/Legends",
  "/wiki/Imperialization/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Occupation_of_Bespin",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Lobot/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Sheckil/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Imperial_Munitions/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Baron_Administrator/Legends",
  "/wiki/City/Legends",
  "/wiki/Bialar_Selis",
  "/wiki/Fin_Mak%27lath",
  "/wiki/Fantes_Mer%27darro",
  "/wiki/Allen_Neff",
  "/wiki/Helder_Spinoza/Legends",
  "/wiki/Platform_327/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/C-3PO/Legends",
  "/wiki/Pedar_Solardo",
  "/wiki/Gir_Endac",
  "/wiki/Razell_Tameron",
  "/wiki/ST_321/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Cloud_City_Security_Tower",
  "/wiki/Dominic_Raynor",
  "/wiki/Relby-k23_blaster_pistol",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/2014",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_148",
  "/wiki/Tim_Veekhoven",
  "/wiki/Kevin_Beentjes",
  "/wiki/Sander_de_Lange",
  "/wiki/The_Empire_Strikes_Back_Storybook",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/Star_Wars_(1977)_43",
  "/wiki/The_Empire_Strikes_Back_(Mighty_Chronicles)",
  "/wiki/The_Empire_Strikes_Back_(radio)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Golden_Book)",
  "/wiki/Star_Wars_Manga:_The_Empire_Strikes_Back_3",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(junior_novelization)",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(PhotoComic)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/1980_Topps_Star_Wars:_The_Empire_Strikes_Back_Series_1",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Swashbuckler_in_Disguise",
  "/wiki/Star_Wars_Galaxy_Magazine_4",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Cloud_City_Limited",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_8",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/The_Empire_Strikes_Back_(TCG)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_in_100_Scenes",
  "/wiki/2015_Topps_Star_Wars_Illustrated:_The_Empire_Strikes_Back",
  "/wiki/Arms_%26_Equipment_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/March_6",
  "/wiki/File:Wing_Guards_Facebook.pdf"
 ]
}