{
 "name": "Cormun_(Imperial_Army)",
 "display_name": "Cormun  (Imperial Army)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue-gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Fifth Infantry company",
      "Fifth Infantry company"
     ]
    }
   ]
  }
 ],
 "content": "Cormun was a Human male who served the reconstituted Sith Empire as a sergeant in the Imperial Army during the Cold War, a period of unrest between the Sith Empire and the Galactic Republic. Around the year 3643 BBY, he was part of the Korriban regiment's Fifth Infantry company and was stationed on the planet Korriban near the Sith Academy on that world. During his time there, Cormun acquired substantial knowledge about the recent events at the Sith Academy. He treated Sith respectfully, and viewed those who could use the Force as much more powerful than normal individuals. Despite his respect for the Sith, the sergeant would not allow his troops' abilities to be questioned without protest.\nWhile he was stationed on Korriban, Cormun was tasked with eliminating k'lor'slugs in the tomb of the Sith Lord Ajunta Pall. During the mission, Cormun made the decision to target the k'lor'slug egg chambers with explosives in order to negate the large worm-like creatures' fast rate of reproduction, which had foiled previous attempts at extermination. However, when his troops placed the explosives, a large number of k'lor'slugs attacked his team wildly and killed three entire squads of his troopers. After losing these troops, which comprised most of his team, Cormun retreated and took up position at one of the tomb entrances with his remaining forces. The sergeant realized that he needed someone skilled in using the Force to help him with the tomb's k'lor'slug infestation. He eventually enlisted the aid of a Sith Acolyte from the Academy, who went to the k'lor'slug egg chambers and successfully detonated the explosives.\nCormun was a Human male who was alive during the Cold War, a period of unrest between the Galactic Republic and the Sith Empire. Around the year 3643 BBY, Cormun was serving in the Imperial Army of the Sith Empire as a sergeant in the Korriban regiment's Fifth Infantry company. During that time, he was on Korriban near the Sith Academy located on that planet. He was assigned the task of exterminating an infestation of k'lor'slugs in the tomb of the Sith Lord Ajunta Pall. The k'lor'slugs, a species of large worm-like creatures, had survived initial attempts at extermination due to their high rate of reproduction. Seeing that previous attempts had failed, Cormun decided to destroy the creatures' egg chambers using explosives. However, when he and his troops entered the egg chambers and attempted to destroy them, the k'lor'slugs attacked them in a crazed frenzy.\nAlthough Cormun's troops were outnumbered, they were able to place the explosives despite losing three entire squads of experienced troops, which comprised the majority of Sergeant Cormun's forces. However, Cormun and his remaining forces were unable to detonate the explosives before they were forced to retreat from the k'lor'slug egg chambers and take up a defensive position at one of the entrances to the tomb. Cormun realized that his men would be unable to complete the mission and that he would need the help of a Force-user to destroy the k'lor'slugs' egg chambers. Without enough troops left to enter the tomb and detonate the explosives they had planted, Cormun and his remaining men guarded the entrance, along with a Sith Warrior named Veshta, and a Sith Inquisitor named Gesen, who was examining dead k'lor'slugs. By that time, only two of Cormun's troopers remained alive in the tomb, with one able to stand guard and the other unable to fight due to his wounds.\nEventually, a Sith Acolyte from the Sith Academy arrived in the tomb and spoke with Cormun, who asked for assistance in destroying the k'lor'slugs. He told the acolyte that if the explosives were successful in destroying the egg chambers, the k'lor'slugs could then be eradicated. The acolyte accepted the assignment and successfully destroyed the egg chambers using the explosives, which Cormun heard from his position at the entrance. Upon the acolyte's return, Cormun praised the individual for the successful completion of the task and stayed at the entrance to defend the position, waiting to be reassigned. While he stayed at the entrance, he warned non-Sith away from the tomb, informing them that the Sith did not appreciate visitors.\nAlthough Sergeant Cormun was in command of three entire squads of troopers, during his mission to destroy k'lor'slugs in Ajunta Pall's tomb he was unable to keep his troops from being killed. After most of his troops were eliminated, Cormun realized that he would need someone more skilled to destroy the creatures. However, he still viewed his soldiers as highly skilled, and believed that their defeat was due to them being outnumbered by the k'lor'slugs. After his encounters with the k'lor'slugs, Cormun viewed them as horrific and deadly, with more intelligence than he originally thought they possessed. He also had a fair amount of knowledge about events and new arrivals at the academy. He had fair skin, brown hair, and blue-gray eyes.\nWhen he met the Sith Acolyte, Cormun knew who the acolyte was and how the individual had arrived at the academy. When speaking to the acolyte, Cormun was respectful and asked the acolyte for permission to make his request for aid. He presented the mission to the acolyte as a way to impress the academy overseers, as well as form connections with the Imperial military. Cormun viewed the acolyte's Force-sensitivity as a major advantage, to the point of the acolyte being worth a dozen normal individuals. Although he was polite to the Sith Acolyte, Cormun insisted that he could not complete the mission without the aid of someone who could use the Force. Learning from his own mistakes, Cormun warned the acolyte against underestimating the k'lor'slugs as he had done during his attempts to exterminate them. During his assignment to destroy the k'lor'slugs, Cormun was able to come up with a solution to destroy the k'lor'slugs using explosives, which was successful, although his troops were unable to implement it.\nDuring his time in Ajunta Pall's tomb, Cormun wore a suit of red and gray armor of the same type that was worn by Imperial troopers on Korriban at the time. He used a blaster rifle and possessed the explosives necessary to destroy the nests of the k'lor'slugs.\nSergeant Cormun appears in Star Wars: The Old Republic, a 2011 MMORPG produced by BioWare. He is featured in \"K'lor'slug Infestation,\" a quest that requires the player to exterminate k'lor'slug's from Ajunta Pall's tomb on the planet Korriban. The quest is available to players who selected either the Sith Inquisitor or Sith Warrior class and is one of the first quests available to beginning players on Korriban that is not class-related. Upon the completion of the quest, the player receives fifteen in-game credits and a pair of boots appropriate for the player's class. Cormun's quest does not give the player an opportunity to receive either dark side or light side points, and the player is not required to complete the quest in order to continue. However, this article is written with the assumption that the player fully completes the game. Cormun also speaks a line of dialogue warning Imperial players who were not Sith to avoid entering the tomb, but he does not try to stop them from entering.\nIn The Old Republic, Cormun was originally going to a have a superior officer named Captain Juvarek. Dialogue in the game files has Cormun mention that Juvarek is stationed on the other side of the tomb and that the captain ordered for hazard pay to be given to anyone who destroyed the k'lor'slug egg chambers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Sergeant/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Cormun_(Cynabar%27s_Droid_Datalog)",
  "/wiki/Cynabar%27s_Droid_Datalog",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fifth_Infantry_company",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Imperial_Army_(Sith_Empire)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sith/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/3643_BBY",
  "/wiki/Korriban_regiment",
  "/wiki/Planet/Legends",
  "/wiki/Korriban",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Time/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Mission_to_Ajunta_Pall%27s_tomb_(k%27lor%27slug_extermination)",
  "/wiki/Death/Legends",
  "/wiki/K%27lor%27slug/Legends",
  "/wiki/Tomb_of_Ajunta_Pall",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Ajunta_Pall",
  "/wiki/Egg/Legends",
  "/wiki/Worm/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Imperial_soldier",
  "/wiki/Burial/Legends",
  "/wiki/Sith_Acolyte",
  "/wiki/Species/Legends",
  "/wiki/Sith_Warrior",
  "/wiki/Veshta",
  "/wiki/Sith_Inquisitor",
  "/wiki/Gesen",
  "/wiki/Canon",
  "/wiki/Trooper/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Sith_trooper_armor/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Boot/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Juvarek",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Category:Images_of_Cormun",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}