{
 "name": "Cornelius_Evazan",
 "display_name": "Cornelius Evazan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alsakan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.77 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown and gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dr. Evazan Cosmetic Surgery",
      "Jabba's criminal empire",
      "Crimson Dawn",
      "Galactic Empire",
      "Accresker Penal Legion",
      "Accresker Penal Legion"
     ]
    }
   ]
  }
 ],
 "content": "Doctor Cornelius Evazan was a human male from the planet Alsakan who was a promising cosmetic surgeon until madness made him begin practicing \"creative surgery\" on his patients, leaving his victims horrifically disfigured. During an encounter with a bounty hunter, which left his face hideously scarred, the Aqualish thug Ponda Baba rescued Evazan, following which the two formed an uneasy partnership. While working as the personal doctor of Dryden Vos, Evazan created an order of servants known as the Decraniated. Wanted men, he assumed the alias of \"Roofoo,\" while Baba became known as \"Sawkee,\" and after committing a rash of crimes on Milvayne, Evazan was nicknamed the Mutilator of Milvayne.\nIn the Holy City on Jedha, the fugitive cyborgist used his ghastly medical techniques to produce more of the Decraniated from insurgent victims. Shortly before the Battle of Yavin, Evazan and Baba were patrons in the Mos Eisley Cantina on Tatooine. When a drunk Baba decided to pick a fight with a local farmboy named Luke Skywalker, Evazan quickly escalated the conflict, causing Skywalker's guardian, a hermit named Obi-Wan Kenobi—in secret one of the few remaining Jedi Masters—to slash Evazan across the chest and sever Baba's right arm with his lightsaber. Evazan tried to use his medical training to reattach Baba's arm but failed, nearly killing the Aqualish in the process.\nHiding from the death sentences he had received, Evazan infiltrated a biofarm on Thannt and stole a pluripleq, a shape-shifting creature, and used it to disguise his face, taking the name Lopset Yas. Yas was soon imprisoned by the Galactic Empire in Accresker Jail, becoming a member of their expendable fighting force in a squad with Chelli Aphra, who nicknamed him \"Flopso.\"\nAfter Accresker Jail was decommissioned and fired on a collision course with Tiferep Major, Evazan followed Aphra, still in disguise. \"Lopset\" pretended to shape-shift into Evazan to trick the vigilante Tam Posla, who sought his arrest, into agreeing to rescue them. Aphra and Posla agreed to trade Evazan, both of them unaware of his true identity. Thinking he had been tricked, Posla returned to the prison with Yas to arrest Aphra. While there, Evazan incapacitated both Aphra and the assassin droid 0-0-0, taking them aboard Posla's ship. Revealing who he truly was, Evazan removed his proximity bomb and placed it in Triple-Zero, leaving the two stranded together for his own entertainment.\nEvazan and Baba watched from afar as Aphra and Triple-Zero traveled to Milvayne to have their proximity bombs removed. Evazan decided to hire the monster hunters Winloss and Nokk to hunt the pair, as well as broadcasting the live feed from Triple-Zero's eyes to the citizens of Milvayne, prompting any money-craving individuals to help the Milvayne Authority capture them. Eventually, though, Winloss and Nokk let their targets live and instead captured Evazan and deactivated the proximity bombs.\nAfter getting free of justice, Evazan and Baba continued to work together, the former racking up more death sentences. The doctor used the hollowed out corpse of the information broker Prima Wessex to infiltrate an informant summit on the planet Obroa-skai, massacring all attendees and taking their limbs with him. Baba refused the Evazan's request to provide him a new organic arm, the rogue surgeon going on to create a creature out of body parts, documenting his work in the book Smuggler's Guide, although the creation was eventually killed.\nHailing from the planet Alsakan, located in the Core Worlds, Doctor Cornelius Evazan studied medicine and became a skilled plastic surgeon. He started his promising career by operating a cosmetic surgery clinic in Pons Ora, a small settlement located on the remote desert world of Abafar. However, madness corrupted him during his training, and he began practicing \"creative surgery\" on his patients without the assistance of droids, rearranging the limbs of hundreds of victims and leaving them horrifically scarred.\nAfter becoming notorious for his cruel medical experiments, Evazan's own face was hideously disfigured in a bounty hunter's attempt to destroy him, though he was saved by Ponda Baba, an Aqualish thug. The two partnered together and became pirates, smuggling spice for the Hutt crime lord Jabba Desilijic Tiure. Successful at their trade, they became wanted men. However, there was no love lost in their relationship, and Baba even contemplated turning in Evazan to collect the bounty on the doctor's head before realizing that their ongoing partnership would be more profitable. Still, the two considered each other friends despite their differences.\nAfter being pursued by justice, Evazan and Baba took refuge with the Crimson Dawn syndicate, which was led publicly by the near-human Dryden Vos, by the year 10 BBY, Becoming Vos' personal physician, Evazan's job was to monitor the Crimson Dawn leader's volatile physiology, a result of the man's mixed heritage and past injuries. The doctor worked with Baba as his assistant, and at one point mended a headwound of Vos's, using mechnostaples to close it.\nWhile in the Crimson Dawn's employment, Evazan satisfied his morbid curiosity with surgical experimentation, offering to modify underworld clients to disguise their identities or enhance their physical abilities. As he delved further into the ghastly modifications, the physician created a breed of subservient, semi-organic cyberslaves known as the Decraniated. Evazan also worked at the Crimson Dawn ore hub on the astronomical object Athus Klee in the Outer Rim Territories' Tingel Arm, where he cybernetically altered the workers, who had been employed by the syndicate on lucrative one-year contracts, in a gene-mod chop shop housed on site in a cluster of hexagonal silos.\nThe Besalisk Dexter Jettster heard rumors of these illegal cyborg modifications and bodies grown to fit buyer specifications and traveled to Athus Klee from the astronomical object Pashvi to investigate. There, he found the ore hub and sneaked around the processing plant, taking scans of the workers with his macrobinoculars. After rescuing a Rodian worker from the ore hub, Jettster returned to the spaceport where he arrived and contacted a politician to inform them of the place. He wrote about his experiences after in a book he had acquired called the Smuggler's Guide.\nFollowing the death of Vos in 10 BBY, Evazan disappeared from the Crimson Dawn, supposedly scared away by the changes in leadership. Around that point, Imperial Security Bureau Agent Andressa Divo began investigating the doctor, compiling details about his time under the Vos's employment and acquiring a security image of the rogue surgeon working on a Decraniated servant with Baba's assistance. Divo made notes on Evazan, calling work a nightmare which was worse than slavery.\nAfter cutting all ties with Crimson Dawn, Evazan and Baba traveled to the Inner Rim Territories planet of Milvayne with Baba. There, the rogue surgeon, with Baba's assistance, abducted a number of victims, surgically altering and enslaving them. The pair's work continued in a number of other Inner Rim worlds and they used a number of aliases, Evazan eventually taking up the name \"Roofoo\" while Baba went by \"Sawkee.\"\nDuring that time, Tam Posla, an officer of the Milvayne Authority, was assigned to investigate the crimes of \"Roofoo\" and \"Sawkee,\" coming across the mutilations committed by the duo. Posla was affected by the horrors he saw and made it a personal goal to solve the case. The lawman also attempted to arrest Evazan and Baba, to no avail. In the meantime, the Evazan's rash of mutilations had spanned a dozen star systems, which earned him a death sentence in each of them. During his hunt, Posla dubbed Evazan the \"Mutilator of Milvayne.\"\nSometime between 8 BBY and 2 BBY, Evazan and Baba became incarcerated on the prison planet of Gulhadar, at a facility of the Benelex Marshal Service. During their imprisonment they witnessed the Wookiee Chewbacca being transferred over as a fellow prisoner. Evazan pointed out the fact to Baba, referring to Chewbacca as \"fresh meat\". The guard accompanying Chewbacca ordered Evazan to keep moving.\nBy 0 BBY, Evazan and Baba settled on the Mid Rim Territories moon of Jedha, residing in Jedha City. There, Evazan transformed wounded or incapacitated victims of the local insurgency with cybernetic technology to make them as subservient as droids, using the procedure to strip them of their identities before selling them into unwilling servitude as more of the Decraniated. He notably pieced together Caysin Bog, a high-gravity humanoid blown apart in an insurgency strike, as a prototype of the Decraniated.\nThough taken off the case on Evazan and Baba by his superior officer, Posla was able to track the pair to Jedha after hearing reports of surgical alteration and forced-servitude there, similar to the crimes committed by Evazan on Milvayne. A number of bounty hunters also became suspicious that the doctor was operating on the moon after word spread of the Decraniated appearing there. However, the lawman had disobeyed orders by continuing his vendetta with the two criminals, and since Jedha was not in his jurisdiction, he was discharged dishonorably by his superior officer. Posla continued the hunt as a vigilante and a bounty hunter.\nWhile Posla arrived on Jedha to find Evazan, the doctor and his accomplice were making their way off-world. In the busy streets of Jedha City, the pair bumped into the Rebel Alliance operatives Jyn Erso and Cassian Andor. Evazan, with Baba by his side, warned them to watch themselves, the two of them ready to fight. Andor, though, assured the doctor and is partner that he and Erso would be careful and they parted ways. Meanwhile, Posla, who had missed Evazan by seconds, found local members of the Decraniated, Bog being the only one able to speak. The Galactic Empire brought the Death Star battle station at that time, forcing the vigilante to flee the moon with Bog. Evazan and Baba had also departed the city by that point.\nEvazan and Baba traveled to the planet Tatooine, where they resumed their illegal medical experiments. The pair frequented Chalmun's Cantina in the spaceport town of Mos Eisley. Due to his dumb and aggressive behavior, no one wanted to sell Evazan materials for his operations or anodyne chemical compounds to help him cope with his injuries. As a result, he made a semi-regular arrangement with the Talz known as the Muftak; the doctor would give him a thousand credits to pay the smuggler Han Solo for his drugs, minus not-inconsiderable shipping and handling charges. Upon delivery of the illicit substance, Evazan would then pay the Talz a completion bonus and hazard stipend.\nAlthough Evazan's arrangement was meant to be discreet, everyone local who was aware of him knew about it. Despite that, Baba and Evazan agreed to back the Rodian bounty hunter Greedo's play against Solo, which regarded a confrontation on the latter's debt to Jabba the Hutt. While Evazan were at Chalmun's Cantina, a Trandoshan bounty hunter known as Bossk entered the establishment to question its bartender, Wuher, about the location of the rogue Imperial astromech droid 261. Baba approached him from behind with his blaster drawn, but Evazan held him back, allowing Bossk to depart without incident.\nLater, the doctor was talking to Kabe, a Chadra-Fan female who frequented the cantina, when a drunk Baba, bored and looking for excitement, decided to pick a fight with Luke Skywalker, a young farmboy who had taken a seat to the right of them at the bar. Assuming Skywalker would be an easy target, Evazan quickly escalated the argument despite the boy's youthful apprehension. This caught the attention of nearby Obi-Wan Kenobi, Skywalker's guardian, who offered to buy the pair drinks to ease tensions.\nHowever, paying little heed to the old man, Evazan angrily hurled the young farmboy into a nearby table, and, ignoring Wuher's protest, the pirates drew their blaster pistols. Given no other choice, the elderly Kenobi—in secret one of the few remaining Jedi Masters—ignited his lightsaber and cut a deep slash in Evazan's chest, causing the doctor to fall back against the bar screaming in pain. Kenobi then used his lightsaber to sever Baba's right arm, effectively disarming the pair before they could fire their weapons. The two survived the lightsaber strikes, as the blade had simultaneously cauterized their newfound wounds, Evazan supported the injured Aqualish on the cantina floor.\nFollowing the attack, those present in the cantina briefly turned to see what had transpired before returning to their business. The pair hastily left Chalmun's Cantina to avoid any other problems, and Baba had someone alert a squad of Mos Eisley's Imperial sandtroopers, who momentarily investigated the violence. The two temporarily lurched outside of the establishment, Baba's severed arm held in Evazan's hands. Evazan used his skills to recover Baba's arm, and he attempted to reattach it to the Aqualish using his medical training. However, the cauterization complicated the task, and the doctor nearly killed his partner in the process when the procedure failed. Evazan concluded that the operation was impossible. Skywalker later recalled his encounter with the pair while training with his own lightsaber in the Temple of Eedit on the planet Devaron.\nMeanwhile Posla had continued his hunt for Evazan, joined by Bog, his new lover. By that point, the doctor had earned the death sentence on thirteen systems. At a similar time, Evazan infiltrated a biofarm on the astronomical object Thannt. There, he stole a shape-shifting creature called a pluripleq. Wishing to evade the many death sentences he had earned, the rogue surgeon used the pluripleq to disguise himself as an alien, taking up a new identity and using the name \"Lopset Yas.\"\nFollowing Bog's untimely death, Posla continued his hunt alone and compiled a short history of Evazan's activity following his time on Jedha, including the \"scuffle\" on Tatooine and the infiltration on Thannt. The vigilante was even able to obtain Baba's severed arm, but soon found that Evazan's trail had run cold, all thanks to the doctor's identity change.\nDespite the new identity, \"Lopset Yas\" was captured by the Empire and imprisoned in the wreckage-prison known as Accresker Jail. There he was assigned into a squad in the convict army known as the Accresker Penal Legion. A proximity bomb was implanted into Evazan's throat that was linked to his squad's hubdroid so that he could not stray ten meters away from the droid. During his time in the prison, he saw several phenomena that led him to believe it was haunted, such as power couplings frying people to death despite having no power, and boarding-spikes cutting another prisoner in half.\nEvazan and the rest of his squad were deployed into an attack on a Rebel Alliance EF76 Nebulon-B escort frigate. During the battle, the inmate and rogue archaeologist Chelli Aphra, a member of the squad, sabotaged their hubdroid by feeding it false information. Yas asked what was wrong with the droid, but Aphra just greeted him, calling him by his pet name, \"Flopso.\" As Evazan corrected her on his fake name, the hubdroid exploded, killing all the other members of the squad. The disguised surgeon panicked as their proximity bombs started beeping, about to detonate. However, another hubdroid, Dek-Nil, arrived, and Yas begged him to let him and Aphra into his squad, which had been lost in a series of improbable accidents. Before their implants could explode, Dek-Nil transferred them into his squad, despite detecting three lifeforms instead of two due to Evazan's pluripleq.\nAfter informing Yas that Dek-Nil was her droid, Aphra led them around a corner, where an escape pod was stuck on the edge of the prison's airdome. As the rogue archaeologist was about to discuss helping Yas escape Accresker Jail, the restraining bolt on Dek-Nil mysteriously moved, taking control of him and leading him to destroy the escape pod due to the Imperial programming. Evazan and Aphra then noticed a Force spirit, but were were ordered back to their sector before they could investigate. Returning to the prison, Yas approached Aphra after she had been temporarily taken away for interrogation and showed her a transmitter he had discovered and repaired, telling her that he knew she had connections to someone who could help them escape. He gave her the transmitter, asking her who she would call.\nAphra took the transmitter and contacted the Imperial Lieutenant-Inspector Magna Tolvan, telling her secrets that out the Imperial forced the Imperial to help her escape to protect both of them. As she did so, Evazan was almost crushed by some wreckage which had fallen down on its own. Aphra saved him, and the disguised surgeon told her of the phenomena he had seen in the prison, claiming that he believed the jail was haunted. Aphra disregarded the idea, but confronted Yas about being a shape-shifter, as she saw him partly change as she was trying to save him from the wreckage. Evazan pretended to shape-shift into the forms of several individuals, including himself, claiming they had used him for his powers in the past. Aphra quoted her mother, telling him that evil was a measure of how much people's choices took away the choices of others.\nSquad Dek-Nil was later assigned to fight in an attack on a pirate station in the Senex-Juvex sectors. During the engagement, Aphra used an Imperial code to override Dek-Nil's restraining bolt. The rogue archaeologist led Dek-Nil and Yas to where Tolvan was waiting for them in a TIE fighter. But before they could escape, the Force spirit they had seen earlier appeared and destroyed the sensor disruptors keeping Tolvan's TIE fighter from being detected. Aphra became distracted by it, and as she was led away by the spirit, Evazan followed her, encountering the wreckage of a Penumbra-1 shattersprite starship.\nAs they investigated the ship, Tolvan was attacked by the Rebel Alliance mercenary Sana Starros, who flew in on her ship, the Volt Cobra. As it tore her TIE fighter apart, Tolvan jumped out with a rocket launcher shot down the Cobra. Witnessing the fight, Yas asked Aphra what she thought was happening, but she was distracted by the spirit, who disassembled Dek-Nil with the Force. Aphra shot the spirit, and it disappeared, revealing an infestation of gundravian hookspores, which Evazan recognized as the most infectious saprophyte in existence. They rapidly fired at the hookspores, which retreated into the ship, revealing the corpse of a long-dead Jedi. Before Aphra could retrieve the Jedi's lightsaber, the battle concluded, and the airdome began to retreat. As they ran away, Evazan retrieved Dek-Nil's central processor, preventing their implanted proximity bombs from detonating.\nEvazan and Aphra ran into Tolvan and Starros, but were encountered by a hubdroid and told to return to the prison. The hubdroid took Aphra away for another interrogation session, leaving the other three to return on their own. As they arrived, Yas told them that he was thankful that their situation couldn't get any worse, but he was proven wrong when the presence of the hookspores was revealed by Aphra to the command of Accresker Jail, who announced that the jail was decommissioned and would be propelled onto a collision course with Tiferep Major, a Rebel-affiliated planet.\nIn an attempt to find a way off the prison, Aphra made use of Lopset's \"shape-shifting\" powers to trick Tam Posla into rescuing them. Evazan pretended to shape-shift into his true form as Aphra contacted Posla. Upon seeing Evazan, Posla agreed to take his ship to Accresker Jail. The criminal surgeon changed back into his disguised appearance as Starros and Tolvan discovered that the staff off Accresker were abandoning the Arquitens-class command cruiser that pulled the prison. Yas asked if they should run, which Aphra agreed with.\nAs the cruiser crashed into the body of the wreckage-prison, Evazan watched as the convicts began to riot and fight each other. The convicts recognized Aphra as the one that had been interrogated, and she and Yas once again agreed to run. They turned around to see an alien prisoner aiming a large gun at them, but the prisoner was killed by the Force spirit, who then killed several others. Evazan noticed that the spirit disappeared if it strayed too far from its ship, and Aphra connected it to the dead Jedi they had discovered earlier.\nTolvan suggested breaking into the Arquitens-class cruiser, but Yas asked whether they should wait for Posla to rescue them. Aphra disregarded the possibility of Posla coming to Accresker, so Starros used the large weapon they had been threatened with earlier to break through the wall of the cruiser. Evazan helped hold the gun, then entered the cruiser behind Starros, Tolvan and Aphra. Inside the cruiser, Evazan came across the interrogation Bor, Bor Ifriem, which had not been properly refrozen. Aphra then discovered that an escape pod still remained in the cruiser, but they had no way of getting to it. Yas suggested the large gun, but Starros claimed the weapon was too heavy for them to move.\nAphra took Dek-Nil's head from Yas so that she could slice into the generator that controlled the prison's gravity. The rogue archaeologist did so, setting the gravity to half of what it had been while also bringing the wreckage of the hookspore-infected ship towards them. Yas took the piece of Dek-Nil back as they made their way through the prison, arriving at the Penumbra-1. The hookspores briefly possessed all four of them, but was unable to sense anything from Yas, rejecting him as a potential host. Starros realized that Aphra had purposely brought the Jedi's ship towards them so she could retrieve the lightsaber, telling her that the hookspores would not move until they had a heroic host to possess.\nAphra led Starros, Tolvan, and Yas to the single remaining escape pod in the wreckage of the cruiser. While Starros and Tolvan climbed into the escape pod, Evazan remained outside with Aphra, who launched the escape pod. Tolvan, who had not realized that Aphra was intending to stay behind, leapt out of the pod at the last second, leaving Starros alone in the launched pod. Aphra was irritated with Tolvan, telling her that she had only planned to escape alone. Yas questioned that statement, and Aphra quickly corrected herself, ensuring him that her plan would still work with the three of them.\nEvazan followed Aphra and Tolvan to the main launch hangar, and the rogue archaeologist told him to remain standing on a grille in the floor. Before \"Lopset\" could ask why he needed to stand there, Tam Posla arrived in his ship. Aphra began speaking to Evazan, who realized she wanted him to shape-shift back into his true form. Pretending to be distressed by Aphra's attempt to exploit him, he recalled the quote the rogue archaeologist told him when he first revealed his ability. Evazan shape-shifted out of his disguise, acting as if he was worried that he would give himself away. Reminding Yas of the frozen interrogation Bor they had seen previously, she revealed that he was standing on top of a coolant grille, which she activated, freezing Evazan.\nPosla exited his ship to confirm that Aphra had his target, and fell for the \"trick.\" The vigilante took the chunk of ice containing Evazan aboard his ship and traded an escape shuttle before leaving Accresker Jail. As he flew away, Posla looked behind him at his frozen prisoner, having doubts about whether it was truly who he thought it was. To find out, he ordered his ship to divert its power to the heating array, to melt the ice containing Evazan. After it did so, the criminal surgeon pretended that he was Yas, prompting Posla to return to Accresker Jail so he could confront Aphra.\nThe disguised Evazan and Posla spotted the wreckage of Aphra's escape shuttle, Yas helping the vigilante locate the rogue archaeologist by using Dek-Nil's head to home in on her proximity charge. The pair found Aphra still inside the prison watching a transmission of the Sith Lord Darth Vader interrogating Tolvan. Posla stepped out to arrest Aphra, and Yas watched as the rogue archaeologist drew the dead Jedi's lightsaber that she had recovered, only for it to deactivate due to its age. After the disguised Evazan pointed out the saber's degradation with age, the assassin droid 0-0-0, who was there to capture Aphra, intervened and killed Posla.\nEvazan fled as Posla was mauled to death. He made his way to Triple-Zero's own starship, which had been crippled by Vader. 0-0-0 soon arrived dragging Aphra, when Yas approached the pair, coming to shoot and disable the assassin droid. The rogue archaeologist began to thank Evazan, only for him to then stun her and take both her and the Triple-Zero aboard Posla's ship. The disguised surgeon escape Accresker Jail before it crashed into Tiferep Major. Afterwards, he removed the proximity bomb from his neck and implanted it into 0-0-0, bonding it to the droid's personality core so that it would explode if either it was tampered with or if the assassin droid or Aphra died. Additionally, Evazan made it so that the pair could not stray twenty meters from each other.\nBy the time that Aphra woke up and questioned what he had done, Evazan had almost finished his work on the incapacitated Triple-Zero. The rogue surgeon turned to Aphra, explaining that he was not actually Yas and removing the pluripleq from his face. He then completed his work on 0-0-0, telling a shocked Aphra that her own proximity bomb was now linked to the one placed in the assassin droid. The doctor called it an experiment of science and art. As he made his explanation, Ponda Baba docked with the ship, and Evazan began to leave, taking the Aqualish's severed arm with him. He repeated the quote that Aphra had said to him, wishing to test her mother's theory as 0-0-0's photoreceptors were transmitting a live feed for him. As he left, boarding the ship that his friend had brought, he told Aphra that she and Triple-Zero deserved to be together.\nEvazan and Baba retreated to a hidden location, the doctor keeping an eye on 0-0-0's live feed while the assassin droid and Aphra came to work together to find a way out of their situation. Evazan's two subjects found the details of Rajam Nuss, Posla's personal cyberneticist on Milvayne, and journeyed to the planet. When Baba sat to begin watching the viewscreen showing the feed, Evazan explained the two subjects before them and caught his partner up on the situation they were in. The doctor also began working on a cybernetic arm to replace the one Baba lost, watching as Aphra and Triple-Zero ventured Milvayne, finding trouble with the Milvayne Authority before eventually reaching Nuss to get their proximity bombs removed. Evazan filled his friend in on Magna Tolvan when the assassin droid brought it up to\nHowever, Triple-Zero had worked out that Evazan was watching their actions, requesting a mirror so he could look the doctor in the eye. The threat unnerved Evazan, as did the pair's success at locating Doctor Nuss, but he shrugged it off, doubting the cyberneticist's abilities. Nuss worked on extracting the proximity bombs, then woke up Aphra and the droid and claimed that he had succeeded. As the rogue archaeologist went to leave, Triple-Zero demanded that Nuss trace the broadcast signal from his eyes. Evazan and Baba were worried by that, until Aphra realized that Nuss had failed to remove the bombs, instead triggering a countdown. Cheering, Evazan watched as Triple-Zero murdered Nuss, believing that the cyberneticist was no longer useful.\nWith only ten hours until the bombs went off, Aphra and Triple-Zero sought out Professor Prexo, Nuss' mentor. At the same time, Evazan contacted the hunters Nokk and Winloss, posing as Princess Leia Organa of the Rebel Alliance using the pluripleq. As Organa, Evazan tasked the hunters with the destruction of Triple-Zero. Nokk, a Trandoshan, immediately refused and went to leave, having caught the scent of the pluripleq and Baba's Aqualish ale. The Trandoshan then stopped upon noticing Aphra on the viewscreen. As the hunters had been tricked and left for dead by Aphra before, Evazan changed the offer, requesting the death of Aphra instead. Winloss and Nokk accepted at an instant, leaving to hunt their new target.\nOnce the hunters had gone, Evazan removed the pluripleq he had been using to disguise himself as Organa. He expressed his doubt in Winloss and Nokk's success, but thought either outcome would be interesting to watch, turning nervously to look at the viewscreen, where Triple-Zero was threatening him through a mirror. Aphra and the assassin droid continued to make their way across Milvayne City, but they were intercepted by Tam Posla, who had been resurrected by the Force-imbued gundravian hookspores.\nAs Evazan and Baba watched the skirmish, Nokk arrived on the scene, impaled Posla and confronted Aphra and Triple-Zero, with Winloss at his side. However, the hunters were distracted by BT-1, who attacked them, letting the latter pair escape. With the commotion temporarily over, Evazan installed Baba's new cybernetic arm, equipped with its own mini-flamer. Fearing Triple-Zero may survive to hunt him down, he then strengthened the broadcast signal from the droid's eyes to present his entertainment back to the residents of Milvayne. With the populace now watching the live feed, Evazan announced Aphra and Triple-Zero as fugitive on the run, prompting any willing individuals to help the Milvayne Authority catch them.\nAs money-craving callers made false claims about the pair in the hopes of winning the prize, Posla, revived again by the hookspores from his impalement, joined forces with the Milvayne Authority as they were led to the fugitives at a bloatbarge by the scavenger Vulaada Klam. Despite being captured, Aphra and Triple-Zero escaped after Aphra tricked the Milvayne Authority officers into turning on Posla. Winloss and Nokk eventually pursued the pair and imprisoned them in their ship, but the Empire's Coalition for Progress intervened and fired on the city, causing the ship to crash.\nCaptain Okma of the Coalition for Progress went down with some stormtroopers to find Aphra and 0-0-0, using a signal disruptor to block the broadcast from the droid. Evazan was confused by the feed stopping, concluding to Baba that it was being jammed. Aphra resolved the situation by triggering a seismic pulse from Triple-Zero, knocking away her and the Imperials. The assassin droid then interrogated Okma and murdered him and his troops. After Aphra regained consciousness from the seismic pulse, she and Triple-Zero further conversed. The rogue archaeologist granted the droid his memories, something Evazan did not expect to see having only intended to study the assassin droid while at work. The doctor watched as 0-0-0's missing memories flicked by.\nWinloss and Nokk confronted Aphra again, but revealed that they had decided not to kill her and left. As the pair departed, Aphra revealed to them that their client was probably Evazan with a bad disguise, challenging them to find him. With Triple-Zero having fully studied his memories, he realized that his creator had rejected him, and decided to walk away. Aphra convinced him to return by reactivating BT-1. When Triple-Zero remarked the importance of a comrade, Evazan admitted that he made a point. The pair continued traveling to the residence of Professor Prexo, with Vulaada Klam returning to help them.\nHowever, Winloss and Nokk had found the Prexo first and used him to track down Evazan and Baba. The couple broke into Evazan's ship and captured the pair, deactivating Aphra and Triple-Zero's proximity bombs. Evazan called them names, claiming that they had ruined the art, but Nokk hit him with her blaster to silence him. The Trandoshan ripped off Baba's cybernetic arm before she and Winloss explained how they had found the pair. Nokk then wacked the criminal surgeon again and told Prexo to turn off the live feed. Winloss and Nokk took their captives away, intenting on bringing them in to the authorities.\nWhile he and Baba were eventually able to break free of justice once again, Evazan acquired death sentences in more systems, which counted to twenty-to after a while. Sometime later, the doctor murdered Prima Wessex, an information broker affiliated with the Whisper Network. From Wessex, the the rogue surgeon was able to attain the Smuggler's Guide as well as an invitation she had to the Obroan Intelligence Summit in the Stratosphere Room at the planet Obroa-skai.\nIn the Smuggler's Guide, and Evazan found the entry in it on his work on Athus Klee by Dexter Jettster. The doctor made an annotation on one of those pages, commenting that the work he did on the Crimson Dawn's workers had not been his best and adding that he would not waste his better skills on the syndicate. He made annotations on other pages as well, typically commenting on the references to casualties during missions and events, speaking of the hypothetical possibility of harvesting their body parts.\nWishing to infiltrate the Obroan Intelligence Summit, Evazan disembowelled Wessex's body and used the informant's skin to fool door scanners at the Stratosphere Room. His plan worked, and he entered the Stratosphere Room to find the other information brokers in attendance. The doctor massacred the informants and began a log entry into the Smuggler' Guide afterwards, writing about the events that had led him from killing Wessex to where he was at that point as well as commenting on his idea of biological art. He planned to harvest as many limbs and viscera as possible. Evazan and Baba thus loaded as many bodies aboard their ship as possible.\nIn the next fourteen days, Evazan heard no chatter about his massacre at Obroa-skai. In his next log entry to the Smuggler's Guide, he joked that killing a lot of informants meant there was noone left to spread the news and commented that it was disappointing that he got away with it so easily. In the log entry after that, the doctor documented telling Baba a story about a dying princess in the Kingdom of Tion and how a pipe-bird and other birds learned to mimic her favorite song. Evazan concluded the story declaring that he seeked immortality.\nIn the meantime, Evazan drew up ideas on adding an arm from one of the Obroa-skai victims to replace Baba's lost arm. Baba refused, favoring the idea of a cybernetic arm, and many of the subject arms began rotting. Evazan recounted the situation in another log entry. The next log entry mentioned how Baba had endeavoured to bring in more credits for them by robbing shopkeepers, with the doctor proposing to develop new poisons and test them by delivering them in sweetcakes to orphanages. In the following three log entries, Evazan told a poem verse about himself to Baba, remembered the time he applied for the Alchemists Guild before finding out they had not existed in a millennium, and looked back on his work on Athus Klee, describing how other minds quickly made him bored.\nThe doctor eventually began creating his own creature from the limbs and organs of others. In a log entry during his work, he detailed asking Baba to dig up a dozen more corpses in order to replenish his bone supply, suggesting the graves on Makem Te. The doctor wished to grind what bones were not used and sell them to elixir hustlers on Nar Shaddaa the moon of the Hutt Space world Nal Hutta. The creature was then finished and brought to life, the animal possessing a number of limbs, heads and metal attachments. Evazan called himself a parent and celebrated his success in another log entry, adding that there may be too many arms and offering to graft one to Baba's stump instead. However, the beast was soon shot dead by the mercenary Anton Markox while it had the Smuggler's Guide, the book falling into Markox's hands.\nDuring the time of the New Republic, Exantor Divo, a police commissioner in the New Republic and son of Andressa Divo, wrote about Evazan in Scum and Villainy: Case Files on the Galaxy's Most Notorious, a book that covered the experiences of three generations of law enforcement officials in his family. Divo made sure to include his mother's notes on the doctor and images of his Decraniated work with Baba.\nA human male, Cornelius Evazan had light skin and stood at a height of 1.77 meters. His eyes were colored hazel, though his right eye was blind and the flesh around it severely scarred, while his nose looked as if it had barely survived an unfortunate encounter with a meat shredder. Due to his wounds, Evazan lived in a constant state of pain and anger and relied on a constant, alternating barrage of narcotics and physical violence to mitigate his perpetual agony. His hair was colored brown with patches of gray, though he showed signs of balding, and stubble covered the lower half of his face. Evazan had foul-smelling breath.\nPrior to being gripped by madness, Doctor Evazan was a promising surgeon, though he later gained notoriety for the cruelty he inflicted upon his patients. He had a \"morbid\" curiosity for experimenting on patients, which he grew a greater taste for while under Vos's employ. The doctor's work soon spiralled into kidnapping new subjects and stripping them of their free will. Andressa Divo believed his victims' only release from suffering was death itself. He called himself as a \"techflesh,\" or \"cyborganic,\" artist, and an architect of vital arts. Stories described him not stopping the experimentation on his victims until they begged for death, just for him to refuse their request.\nEvazan enjoyed the presence of corpses, seeing them as materials for experimentation. In his annotations of the Smuggler's Guide, he expressed joy at the mentions of dead bodies in various accounts, writing a negative exclamation when reading in one account that some bloody bones had been lost into the void of space. He praised his peeling of Prima Wessex's skin to fool scanners as a clever decision. After massacring the information brokers on Obroa-skai, the doctor was excited about the opportunities that came from the different alien bodies around him. He even tried to create new creatures built from the parts of others, calling himself a proud parent when one was successful.\nEvazan and Ponda Baba enjoyed brawling and gunning down defenseless beings, and Evazan was quick to antagonize those who crossed him, as demonstrated by his brushes with Jyn Erso and Cassian Andor on Jedha, and Luke Skywalker in Mos Eisley. After Baba began to bully Skywalker, Evazan quickly escalated the argument, even going so far as to threaten Skywalker before Obi-Wan Kenobi interceded. Ignoring the old man's attempt to smooth the rising tension, the doctor resorted to violence, which ended poorly for both Evazan and Baba. Evazan once suggested poisoning orphans to Baba when he was bored.\nEvazan's reputation as a smuggler and murderer also made him many enemies across the galaxy. He was boastful of his infamy, openly informing Skywalker in the Mos Eisley Cantina about his dozen death sentences at the time. The doctor was quick to grow bored of working under contracts, believing he was wasting his genius on others. Evazan looked down on cloners, calling them obedient clerks, as well as cryptosurgeons, who he thought used their titles as a shortcut to genius. He wished to up there with the gods, trading in life and death itself, and seeked to find immortality when he tried to make new creatures, new life.\nEvazan held an uneasy alliance with Baba, but still considered him a friend, excusing that evil didn't preclude friendship. After meeting Chelli Aphra and 0-0-0, he became fascinated by the pair, considering the rogue archaeologist to be representative of \"self-centered, chaotic and accidental evil,\" and the assassin droid to be the closest thing to programmed evil. Intrigued by the relationship of the two, which involved Triple-Zero wanting to kill the fearful Aphra, he forced the two to have to be together, remarking that they deserved each other. Evazan considered it a study into evil and whether it was natural, looking back at the quote he had heard from Aphra's mother which theorized that evil was a measure of how much one's choices took away other's.\nEvazan's experiment, \"art\" and \"science\" by his own account, also sought to see how long the duo could last with each other as he found it funny and saw it as entertainment while he and Baba laid low. In the meantime of it, he brought in external pressures as a critical variable, hoping to increase the chaos and entertaining cruelty displayed by Aphra and 0-0-0. The criminal surgeon found it unexpected that Aphra had given 0-0-0 his lost memories, not expecting to be able to get a glimpse of its history. He also found it disappointing when the assassin droid made a heartwarming point to his companion.\nTo avoid his many death sentences, Evazan used a pluripleq to change his face. Adopting a new name, Lopset Yas, he stayed off the grid for over a month, until he revealed himself to Chelli Aphra. As Yas, he was quick to become nervous or fearful, begging Dek-Nil to let him into his squad after his first hubdroid exploded, and gaining a stutter whenever he became frightened. He quickly learned a lot about Aphra, second-guessing her connections with the underworld.\nEvazan was also very conscious of his surroundings, noticing a lot of weird doings in the Accresker Jail, and frequently raising questions out of curiosity concern. Yas also trusted Aphra a lot, having to follow her wherever they she went due to the hubdroid they had in common. When she followed the Force spirit to the Penumbra-1 shattersprite Yas was quick to follow and he made sure to keep Dek-Nil's central processor to keep their implants from detonating. He continued to carry the piece of Dek-Nil even when the implants were disabled.\nHaving studied Evazan was specilized in plastic surgery before his experimenting took him on a darker path. He possessed surgical skills including grafting body-parts, including cybernetics, together and even removing a bomb that was implanted in his own neck. He was a skilled electrician Aphra becoming fond of his cybernetic work. Evazan also had knowledge of other subjects, recognizing the gundravian hookspores and describing them in some depth.\nEvazan wore a long-sleeved khaki shirt underneath a brown vest, a pair of dark-brown pants, and a pair of black boots. His black belt had a golden buckle and a holster for his SE-14C blaster pistol When operating, Evazan wore scrubs and used a variety of medical instruments. During his servitude at the Accresker Jail, Evazan wore dark brown leather clothing with a large hood and compartments around the waist, an outfit worn by all prisoners at Accresker Jail.\nWhen using his pluripleq, Evazan could take many forms, including Kelko Dev and Sandewar Mandewar. But he usually had a similar appearance to the abednedo species, having brown skin, and eyes that changed color over time.\nCornelius Evazan first appeared in George Lucas's 1977 film Star Wars: Episode IV A New Hope, in which he was played by Alfie Curtis. The original 1976 novelization of Star Wars, ghostwritten by Alan Dean Foster, described the character as a \"short, grubby-looking human\" with a surprisingly deep voice. This story's version of events, which closely matches the film's revised fourth draft, describes Obi-Wan Kenobi as cutting off Evazan's arm, rather than Ponda Baba's, with Evazan retreating into the crowd without a word following the fight. The Evazan character dates back as early as The Star Wars: Rough Draft from May 1974.\nStar Wars creature effects make-up artist Nick Maley was displeased with Evazan's distinctive facial prosthetic. He felt that the prosthetic's texture did not work well with that of Curtis' face. Evazan also appears alongside Baba in the 2016 Anthology Series film Rogue One: A Star Wars Story, a direct prequel to the events of A New Hope. In Rogue One, the character was portrayed by Michael Smiley, who is credited as \"Dr. Evazan.\" Rogue One writer Gary Whitta disagreed with Evazan and Baba's inclusion in the film, opining that he \"thought having Evazan and Walrus Man was a little too much. You have to reign in that instinct to go back and put things in just because you loved them when you were a kid.\"\nThe character's name originates in Star Wars Legends storytelling, as he was first referred to as \"Roofoo\" in Brian Daley's 1981 Star Wars radio dramatization. The name \"Evazan\" originated in Galaxy Guide 1: A New Hope, a 1989 Star Wars: The Roleplaying Game supplement written by Michael Stern and Grant S. Boucher. \"Doctor Death: The Tale of Dr. Evazan and Ponda Baba,\" a short story written by Kenneth C. Flint for the 1995 anthology book Tales from the Mos Eisley Cantina, created the name \"Cornelius\" as an alias of Evazan's, while The Official Star Wars Fact File 51 from 2002 was the first source to establish the character's full name as Cornelius Evazan. The original StarWars.com Databank later established \"Roofoo\" as another of Evazan's aliases.\nIn the current Star Wars canon, Cornelius Evazan's name was used in the mobile card game Star Wars: Force Collection, which initially launched on September 4, 2013. Although the launch of Force Collection predates the Star Wars canon reset of April 25, 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon. In addition, Star Wars: Rogue One: The Ultimate Visual Guide, written by Pablo Hidalgo and published in 2016, established \"Roofoo\" as an alias.\nThe sixteenth issue of De Agostini's Star Wars Helmet Collection magazine series, released in 2016, and both the Cornelius Evazan and Ponda Baba StarWars.com Databank entries claim that Evazan died following his confrontation with Obi-Wan Kenobi, but the 2016 Star Wars Character Encyclopedia: Updated and Expanded, written by Pablo Hidalgo, states that Evazan survived the encounter. The short story \"The Secrets of Long Snoot,\" included in the 2017 anthology From a Certain Point of View, also presented Evazan as surviving his encounter with Kenobi, as well as the Star Wars: Doctor Aphra comic series showing what he did after the encounter with Kenobi. Updated and Expanded also states that Evazan is 1.77 meters tall, while the character's Databank entry provides a height of 1.7 meters. This article presents the information from Star Wars Character Encyclopedia: Updated and Expanded, \"The Secrets of Long Snoot\" and Star Wars: Doctor Aphra as more recent sources.\nSeveral sources, including the Mos Eisley Cantina and Tatooine StarWars.com Databank entries and the junior novel The Weapon of a Jedi: A Luke Skywalker Adventure, mistakenly identify Evazan as an alien.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Cornelius_Evazan",
  "/wiki/Cornelius_Evazan/Legends",
  "/wiki/Han_Solo_%26_Chewbacca_6",
  "/wiki/Alsakan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Dr._Evazan_Cosmetic_Surgery",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Crimson_Dawn",
  "/wiki/Galactic_Empire",
  "/wiki/Accresker_Penal_Legion",
  "/wiki/Doctor",
  "/wiki/Planet",
  "/wiki/Unidentified_bounty_hunter_(Cornelius_Evazan)",
  "/wiki/Aqualish",
  "/wiki/Ponda_Baba",
  "/wiki/Dryden_Vos",
  "/wiki/Decraniated",
  "/wiki/Milvayne",
  "/wiki/Jedha_City",
  "/wiki/Jedha",
  "/wiki/Cyberneticist",
  "/wiki/Battle_of_Yavin",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Tatooine",
  "/wiki/Farm",
  "/wiki/Luke_Skywalker",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Master",
  "/wiki/Dismemberment",
  "/wiki/Limb",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Death",
  "/wiki/Biofarm",
  "/wiki/Thannt",
  "/wiki/Pluripleq",
  "/wiki/Changeling",
  "/wiki/Prison",
  "/wiki/Accresker_Jail",
  "/wiki/Chelli_Lona_Aphra%27s_squad",
  "/wiki/Squad",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Tiferep_Major",
  "/wiki/Tam_Posla",
  "/wiki/Assassin_droid",
  "/wiki/0-0-0",
  "/wiki/Posla%27s_ship",
  "/wiki/Proximity_bomb",
  "/wiki/Chase_on_Milvayne",
  "/wiki/Hunter",
  "/wiki/Winloss",
  "/wiki/Nokk",
  "/wiki/Milvayne_Authority",
  "/wiki/Information_broker",
  "/wiki/Prima_Wessex",
  "/wiki/Obroan_Intelligence_Summit",
  "/wiki/Obroa-skai",
  "/wiki/Book",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Jerriko",
  "/wiki/File:Jerriko-Evazan.ogg",
  "/wiki/Homeworld",
  "/wiki/Core_Worlds",
  "/wiki/Pons_Ora",
  "/wiki/Desert",
  "/wiki/Abafar",
  "/wiki/Droid",
  "/wiki/Pirate",
  "/wiki/Smuggler",
  "/wiki/Spice",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Bounty",
  "/wiki/Standard_year",
  "/wiki/10_BBY",
  "/wiki/Crimson_Dawn_ore_hub",
  "/wiki/Athus_Klee",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Tingel_Arm",
  "/wiki/Besalisk",
  "/wiki/Dexter_Jettster",
  "/wiki/Pashvi",
  "/wiki/Macrobinoculars",
  "/wiki/Rodian",
  "/wiki/Unidentified_Rodian_cyborg",
  "/wiki/Spaceport",
  "/wiki/Unidentified_politician_(Dexter_Jettster)",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Andressa_Divo",
  "/wiki/Slavery",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Police_officer",
  "/wiki/Star_system",
  "/wiki/2_BBY",
  "/wiki/Gulhadar",
  "/wiki/Benelex_Marshal_Service",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/0_BBY",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Moon",
  "/wiki/Jedha_insurgency",
  "/wiki/Neuro-box_interface",
  "/wiki/Caysin_Bog",
  "/wiki/Gravity",
  "/wiki/Humanoid",
  "/wiki/Tam_Posla%27s_superior_officer",
  "/wiki/Bounty_hunter",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Jyn_Erso",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Standard_second",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/Lirin_Car%27n",
  "/wiki/File:Muftak-Carn.ogg",
  "/wiki/Mos_Eisley",
  "/wiki/Talz",
  "/wiki/Muftak",
  "/wiki/Credit",
  "/wiki/Han_Solo",
  "/wiki/Greedo",
  "/wiki/Trandoshan",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Bartender",
  "/wiki/Wuher",
  "/wiki/Astromech_droid",
  "/wiki/261",
  "/wiki/Blaster",
  "/wiki/Kabe",
  "/wiki/Chadra-Fan",
  "/wiki/Cantina",
  "/wiki/Blaster_pistol",
  "/wiki/Lightsaber",
  "/wiki/Desert_stormtrooper",
  "/wiki/Jedi_training",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Temple_of_Eedit",
  "/wiki/Devaron",
  "/wiki/Prisoner",
  "/wiki/Wreckage-prison",
  "/wiki/Unidentified_hubdroid",
  "/wiki/Power_coupling",
  "/wiki/Boarding-spike",
  "/wiki/Attack_on_an_EF76_Nebulon-B_escort_frigate",
  "/wiki/EF76_Nebulon-B_escort_frigate",
  "/wiki/Archaeologist",
  "/wiki/Hubdroid",
  "/wiki/Bomb",
  "/wiki/Dek-Nil",
  "/wiki/Squad_Dek-Nil",
  "/wiki/Escape_pod",
  "/wiki/Airdome",
  "/wiki/Restraining_bolt",
  "/wiki/Force_spirit",
  "/wiki/Transmitter",
  "/wiki/Lieutenant-Inspector",
  "/wiki/Magna_Tolvan",
  "/wiki/Lona_Aphra",
  "/wiki/Attack_on_a_pirate_station",
  "/wiki/Unidentified_pirate_station",
  "/wiki/Senex-Juvex",
  "/wiki/Sector",
  "/wiki/Imperial_authority_code_6690B1",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Sensor_disruptor",
  "/wiki/Penumbra-1_shattersprite",
  "/wiki/Sana_Starros",
  "/wiki/Volt_Cobra",
  "/wiki/The_Force",
  "/wiki/Gundravian_hookspore",
  "/wiki/Unidentified_Jedi_(Accresker_Jail)",
  "/wiki/Central_processor",
  "/wiki/Arquitens-class_command_cruiser",
  "/wiki/Cruiser",
  "/wiki/Mairan",
  "/wiki/Bor_Ifriem",
  "/wiki/Hangar",
  "/wiki/Coolant_grille",
  "/wiki/Unidentified_shuttle_(Tam_Posla)",
  "/wiki/Heating_array",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Touring_ship",
  "/wiki/Stun",
  "/wiki/Photoreceptor",
  "/wiki/Rajam_Nuss",
  "/wiki/Viewscreen",
  "/wiki/Cybernetics",
  "/wiki/Mirror",
  "/wiki/Standard_hour",
  "/wiki/Professor",
  "/wiki/Prexo",
  "/wiki/Hunting",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Milvayne_City",
  "/wiki/Bloatbarge",
  "/wiki/Vulaada_Klam",
  "/wiki/Winloss_and_Nokk%27s_starship",
  "/wiki/Coalition_for_Progress",
  "/wiki/Captain",
  "/wiki/Okma",
  "/wiki/Seismic_pulse",
  "/wiki/0-0-0%27s_creator",
  "/wiki/Whisper_Network",
  "/wiki/Obroa-skai%27s_Stratosphere_Room",
  "/wiki/Kingdom_of_Tion",
  "/wiki/Pipe-bird",
  "/wiki/Bird",
  "/wiki/Poison",
  "/wiki/Alchemists_Guild",
  "/wiki/Makem_Te",
  "/wiki/Nar_Shaddaa",
  "/wiki/Hutt_Space",
  "/wiki/Nal_Hutta",
  "/wiki/Parent",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Exantor_Divo",
  "/wiki/Commissioner",
  "/wiki/Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Divo_family",
  "/wiki/Eye",
  "/wiki/Nose",
  "/wiki/Hair",
  "/wiki/File:Evazan-Kenobi-Skywalker.ogg",
  "/wiki/Cloning",
  "/wiki/Electrician",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Holster",
  "/wiki/SE-14C_blaster_pistol",
  "/wiki/Clothing",
  "/wiki/Kelko_Dev",
  "/wiki/Sandewar_Mandewar",
  "/wiki/Abednedo",
  "/wiki/Species",
  "/wiki/George_Lucas",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Alfie_Curtis",
  "/wiki/1976",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Star_Wars",
  "/wiki/Alan_Dean_Foster",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/May",
  "/wiki/1974",
  "/wiki/Nick_Maley",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Michael_Smiley",
  "/wiki/Gary_Whitta",
  "/wiki/Star_Wars_Legends",
  "/wiki/Brian_Daley",
  "/wiki/1981",
  "/wiki/Star_Wars_(radio)",
  "/wiki/Galaxy_Guide_1:_A_New_Hope",
  "/wiki/1989",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Michael_Stern",
  "/wiki/Grant_S._Boucher",
  "/wiki/Doctor_Death:_The_Tale_of_Dr._Evazan_and_Ponda_Baba",
  "/wiki/Kenneth_C._Flint",
  "/wiki/1995",
  "/wiki/Tales_from_the_Mos_Eisley_Cantina",
  "/wiki/The_Official_Star_Wars_Fact_File_51",
  "/wiki/2002",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/September_4",
  "/wiki/2013",
  "/wiki/April_25",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars_Helmet_Collection_16",
  "/wiki/De_Agostini",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/The_Secrets_of_Long_Snoot",
  "/wiki/2017",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure",
  "/wiki/Alien",
  "/wiki/Category:Audio_files_of_Cornelius_Evazan",
  "/wiki/Category:Images_of_Cornelius_Evazan",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Missing_in_Action",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Bounty_Hunt",
  "/wiki/Star_Wars:_A_New_Hope_Cinestory_Comic",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/A_New_Hope_(Little_Golden_Book)",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/The_Original_Trilogy_Stories",
  "/wiki/Star_Wars:_Heroes_Path",
  "/wiki/Not_for_Nothing",
  "/wiki/We_Don%27t_Serve_Their_Kind_Here",
  "/wiki/The_Kloo_Horn_Cantina_Caper",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure_(audiobook)",
  "/wiki/Doctor_Aphra_(2016)_15",
  "/wiki/Doctor_Aphra_(2016)_18",
  "/wiki/Doctor_Aphra_(2016)_20",
  "/wiki/Doctor_Aphra_(2016)_21",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Doctor_Aphra_(2016)_23",
  "/wiki/Doctor_Aphra_(2016)_24",
  "/wiki/Doctor_Aphra_(2016)_25",
  "/wiki/Doctor_Aphra_(2016)_26",
  "/wiki/Doctor_Aphra_(2016)_27",
  "/wiki/Doctor_Aphra_(2016)_28",
  "/wiki/Doctor_Aphra_(2016)_29",
  "/wiki/Doctor_Aphra_(2016)_30",
  "/wiki/Doctor_Aphra_(2016)_31",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Red_Five_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_158",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_159",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_I_Am_a_Droid",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/A_Wretched_Hive_(Star_Wars:_The_Card_Game)",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_179",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_Outer_Rim",
  "/wiki/Gadgets_and_Gear",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Practical",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/LEGO",
  "/wiki/LEGO_Classic_Star_Wars",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Star_Wars:_Han_Solo_%26_Chewbacca",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Han_Solo_%26_Chewbacca_1",
  "/wiki/Tarkin_(novel)",
  "/wiki/Doctor_Aphra_Annual_2",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_81",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/The_Art_of_Star_Wars_Episode_IV:_A_New_Hope",
  "/wiki/September_13",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/December_11",
  "/wiki/2015",
  "/wiki/September_12",
  "/wiki/March_24",
  "/wiki/December_3",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/File:Leland_Chee_Force_Collection.png",
  "/wiki/In-universe"
 ]
}