{
 "name": "Corran",
 "display_name": "Corran",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Corran was a Force-sensitive human male that lived on the planet Daiyu. Corran and his mother desperately needed to leave Daiyu as Corran's abilities put him in danger. Corran's mother contacted a supposed Jedi named Haja Estree and asked him to get them both off Daiyu. Haja, who was actually a con artist, directed them to Gate 3-C at the port so that they could travel to Corellia in exchange for credits as payment. Corran made his way to the planet Jabiim, where he resided along with other members of the Hidden Path.\nOnce the base on Jabiim was attacked by the Galactic Empire, the innocents made a dash to Kawlan Roken's freight transport, which would take off into space, and be followed by the Devastator. The young Princess Leia Organa would use her toy droid, L0-LA59  to entertain Corran as the transport was fired upon. Obi-Wan Kenobi would distract the Devastator and its captain by fleeing in an escape pod, and through the real Jedi's sacrifice the innocents onboard were able to escape.\nCorran first appeared in the second episode of the Disney+ series Obi-Wan Kenobi, and was portrayed by Indie Desroches. Though the character's name was not mentioned in the actual episode, it did appear in the credits.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Corran_(disambiguation)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Force-sensitive",
  "/wiki/Planet",
  "/wiki/Daiyu",
  "/wiki/Corran%27s_mother",
  "/wiki/Jedi",
  "/wiki/Haja_Estree",
  "/wiki/Con_artist",
  "/wiki/Gate_3-C",
  "/wiki/Daiyu_cargo_port",
  "/wiki/Corellia",
  "/wiki/Credit",
  "/wiki/Jabiim",
  "/wiki/Hidden_Path",
  "/wiki/Attack_on_Jabiim",
  "/wiki/Galactic_Empire",
  "/wiki/Kawlan_Roken",
  "/wiki/Devastator",
  "/wiki/Youngling",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Toy_droid",
  "/wiki/L0-LA59",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Escape_pod",
  "/wiki/Part_II",
  "/wiki/Disney%2B",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Indie_Desroches",
  "/wiki/Part_V",
  "/wiki/Part_VI"
 ]
}