{
 "name": "Corso Riggs",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ord Mantell"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3665 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Corso Riggs was a Human male mercenary during the Cold War. Born on Ord Mantell, he was the employee of Viidu. He was later betrayed by his employer and joined forces with a smuggler, enemy to the infamous Skavak.\nCorso Riggs was a cheerful, disarmingly optimistic mercenary soldier. Raised as a rancher's son on the rough frontier of Ord Mantell, Corso developed a mixture of naive innocence and primitive toughness, wrapped with old-fashioned chivalry.\nIn addition to his gung-ho enjoyment of a good, dirty fight and his encyclopedic knowledge of weapons, Corso remained a ray of sunshine in even the worst circumstances. He had no sense of his own mortality and was absolutely convinced he was going to live forever. Corso also had a soft spot for damsels in distress, even when it was clear that they were up to no good.\nDuring the Great Galactic War, Corso grew grew up in a small community on Ord Mantell along with his parents and cousin, Rona Riggs. Corso looked up to Rona, who wanted to leave Ord Mantell and see the galaxy. She would often get into mischief and Corso would have to cover for her. After the Treaty of Coruscant, half of Ord Mantell's population disapproved of the local government's decision to support the Republic and a civil war broke out pitting separatists against Republic loyalists. Corso eventually left Ord Mantell to join the Peace Brigade: a group of mercenaries fighting imperial occupations on neutral planets across the galaxy, but when word reached him that the village he grew up in had been attacked by the separatists, Riggs returned to Ord Mantell vowing vengeance on the separatists responsible for his parents' deaths.\nNear the end of the Cold War, Corso worked with Skavak when a fellow smuggler named Ace arrived to deliver weapons for Viidu at a hangar in the Drelliad village. After Skavak had paid the smuggler, Corso came rushing in the hangar to signal that the Separatists hijacked an anti-air cannon, and had even managed to destroy a republic transport. He asked the Ace to go in the village destroy the remote control stations to disable the cannon, while he and Skavak were busy discharging the cargo. However, as the separatists stormed into the hangar, Corso tried to contact Ace for help but he was pinned down by Skavak, who was the one responsible for helping the attackers. After Skavak fled with Ace's XS stock light freighter, along with the weapons delivery and Corso's favorite blaster \"Torchy\". Corso managed to contact Skavak via holocom, only for the scoundrel to tell him to be thankful for still being alive. Understanding that Viidu would be the only one able to help them track Skavak, Corso asked for Ace to go ahead to meet Viddu at Fort Garnik, while he would lock the hangar and join them later.\nArriving to Fort Garnik, Corso and Ace met Viidu and explained about what happened earlier today. Viidu knew a man named Reki in the village, who knew a lot about the separatists and the freighter pilot. After Ace returned from his meeting with Reki, Corso and Viidu were about to devour a Robasteak. Eventually, he went along with Ace to the next station find out the blueprints and data that the Separatists kept. After decrypting the data from the separatists, Corso and Viidu discovered that Skavak would soon deliver weapons to the Separatist headquarters. There, the two fought Dareg, but they soon discovered that Skavak already escaped. Corso and Ace managed to kill all the separatists and spared Morant, who explained that Skavak had already flown away again a few hours ago with the weapons. After the two returned to Fort Garnik, they found Viidu dead and spotted Syreena chatting with Skavak. It turns out Syreena was a spy, but she was angry how Skavak betrayed her. The two let her go when she provided ticks for a ferry flight to Coruscant. At the spaceport, Corso and Ace encounter Kindin and Xo'ru, bounty hunters who work for Rogun the Butcher. The conversation ended when Corso and Ace had no choice but to fight them.\nDuring the Eternal Empire's Conquest, Ace went missing. Corso told Risha Drayen not to waste time searching for them, but he still held hopes that Ace was alive too.\nCorso Riggs had a tendency to form attachments to his weaponry, and was particularly angry at Skavak for stealing his best blaster, \"Torchy.\" When a smuggler associate  of his assaulted Mannett Point, Riggs wanted to join them and cut off the Separatists' legs with his vibroblade, \"Hewie.\"\nThe slicer Jettison considered Corso to be a very loyal individual.\nRiggs is the first companion character of the smuggler and the second person that the smuggler meets. He gives some helpful pointers to the smuggler when first going to Ord Mantell.\nRiggs can be recruited as a companion around level 7 to assist in the final mission of the Ord Mantell storyline. In the early beta gameplay, it appeared that Corso would be a Kiffar, as he had yellow tattoos over his nose, similar to those of Clan Vos. However, at the game's final release, the tattoos had been removed.\nCorso Riggs is voiced by Troy Hall.\nIf the Outlander is based on a smuggler, Corso and Risha return with Ace after the establishment of the Eternal Alliance.\nExplaining that after Ace went missing. Corso and Risha searched for them, but after several years, Corso told Risha not to waste time looking. When Risha was forced to hide from enemies on Dubrillion, Corso went with her. The two found a way to make credits on the side by using Skavak's name. After Vaylin sacked Dubrillion, they heard rumors that Ace was alive and tracked them down. Corso and Risha reunited with their captain, and were welcomed into their new crew.\nCorso can be romanced by a female smuggler. If the romance is pursued, then he will propose.\nHe is rather easy to romance and starts talking about this pretty soon compared to other characters. However it is important to give mostly \"good\" answers to him during the conversations, as you can easily break this romance very early if you tell him to sleep it off when he's tipsy. So far there is no chance to start a romance after that.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Korso_(disambiguation)",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/3665_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Mercenary/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Viidu",
  "/wiki/Voidhound",
  "/wiki/Great_Galactic_War",
  "/wiki/Rona_Riggs",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Separatist_War",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Peace_Brigade_(Cold_War)",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Skavak/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Drelliad_village",
  "/wiki/XS_stock_light_freighter/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Torchy",
  "/wiki/Fort_Garnik",
  "/wiki/Reki",
  "/wiki/Dareg",
  "/wiki/Morant",
  "/wiki/Syreena",
  "/wiki/Coruscant/Legends",
  "/wiki/Kindin",
  "/wiki/Xo%27ru",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Rogun_Matt%27rik",
  "/wiki/Risha_Drayen",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Corso_Riggs",
  "/wiki/Jettison",
  "/wiki/Mannett_Point",
  "/wiki/Vibroblade/Legends",
  "/wiki/Hewie",
  "/wiki/Slicer/Legends",
  "/wiki/Kiffar/Legends",
  "/wiki/Clan_Vos",
  "/wiki/Troy_Hall",
  "/wiki/Eternal_Alliance",
  "/wiki/Sacking_of_Dubrillion",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Tatooine/Legends"
 ]
}