{
 "name": "Corv",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Corv was a human male individual who served as an attendant in Lieutenant Supervisor Dedra Meero's staff within the Imperial Security Bureau of the Galactic Empire.\nDuring the Imperial Era, Corv served as an attendant within the staff of Dedra Meero in the Imperial Security Bureau. In 5 BBY, Corv and Attendant Heert summoned Syril Karn from his job at the Imperial Bureau of Standards for interrogation in the ISB Central Office. When Karn revealed during interrogation that he was unable to read the Ferrix report before being dismissed from his job in the Morlana System, Meero and Heert had to leave to attend another meeting elsewhere in the building. As the pair left, Lieutenant Meero ordered Corv to give Karn a copy of the report to read. Later that day, the two other officers returned. When Meero determined that Karn's description of Rael was not of further use, she and Heert left, while Corv dismissed Karn.\nLater that year, Corv was present on the planet Ferrix. He was pointed to Maarva Andor's residence by a local while dressed in civilian clothing.\nSome time after, he was present in a briefing in the former hotel alongside Lieutenant Meero, Captain Vanis Tigo, and Lieutenant Keysax.\nCorv wore a gray Imperial officer's uniform with black breeches, two code cylinders and a rank insignia plaque with two blue tiles, as was standard of ISB attendants. He sometimes wore a black Imperial kepi with an officer's disk.\nCorv debuted in \"Narkina 5,\" the eighth episode of the television series Andor, portrayed by Nouf Ousellam. He was identified before the episode's release in an image asset release on Getty Images by Walt Disney Studios.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/ISB_Attendant",
  "/wiki/Lieutenant",
  "/wiki/Supervisor",
  "/wiki/Dedra_Meero",
  "/wiki/Imperial_Era",
  "/wiki/5_BBY",
  "/wiki/Heert",
  "/wiki/Syril_Karn",
  "/wiki/Imperial_Bureau_of_Standards",
  "/wiki/ISB_Central_Office",
  "/wiki/Planet",
  "/wiki/Ferrix",
  "/wiki/Maarva_Andor",
  "/wiki/Unidentified_hotel_(Ferrix)",
  "/wiki/Captain",
  "/wiki/Vanis_Tigo",
  "/wiki/Keysax",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Imperial_kepi",
  "/wiki/Officer%27s_disk",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Corv",
  "/wiki/Narkina_5_(episode)",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/One_Way_Out",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/August_2",
  "/wiki/2022",
  "/wiki/Disney%2B"
 ]
}