{
 "name": "Corwin Kaezeb",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Siniteen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Corwin Kaezeb was a Siniteen yonta-level dejarik player who made HoloNet headlines in 22 BBY for a brawl during a tournament in which he was competing.\nCorwin Kaezeb was a male Siniteen, a species known for their hyperintelligence. A player of the ancient hologame dejarik, in which opponents attempted to best one another with a squad of holomonsters, Kaezeb was a yonta-level dejarik player by the time he entered into the Colonies region Dejarik tournament of 22 BBY.\nThe Siniteen reached the quarter-finals of the tournament, in which the eight remaining contestants battled it out to secure a place in the next stage. Kaezeb went up against the Abyssin Ohh Bronna, who was a sector champion. The Siniteen looked set to lose the game, but surprised his opponent when he made an unorthodox move, utilizing his ng'ok piece to leap off the back of his houjix and strike down Bronna's savrip.\nTo Kaezeb's surprise, Bronna sat in silence for a moment before knocking the hologame table over and hurling himself at the Siniteen. The Abyssin struck Kaezeb in the head and the quarter-final quickly descended into a brawl, as two of the losing players in other games made use of the resulting chaos to reset their matches illegally. The cheated players subsequently joined in the brawl; only one of the four matches continued. By the time Bronna and Kaezeb were separated, the Siniteen was bloodied and battered.\nWhen asked to comment after the brawl, Kaezeb maintained that he had made a legal move, though Bronna continued to criticize him for the tactic. The Siniteen did admit that he had enjoyed the fracas; ultimately, due to the lack of established protocol for a situation in which six quarter finalists were disqualified, the title of champion of the tournament went to D'nisenz, one of the two players who had finished their game while the brawl was in process. The tournament brawl later made the HoloNet news.\nA skilled dejarik player, Kaezeb was unused to physical brawls and violence, although he found himself fighting back and enjoying the occasion when it arose at the tournament in 22 BBY. He remained stubborn in his belief that his move had been legal and was unwilling to mollify his opponent.\nCorwin Kaezeb was introduced for the HoloNet News promotional campaign in 2002. In order to create hype for the then upcoming release of Star Wars: Episode II Attack of the Clones, StarWars.com created a series of in-universe news reports that outlined events occurring in the galaxy. While much of the material centered around the Separatist Crisis that was to be a major plot element in Attack of the Clones, other sections on \"sports\" or \"life\" focused on more esoteric aspects of the galaxy. Kaezab and the dejarik tournament brawl story were included in HoloNet News Vol. 531 51, released on April 11, 2002.\nKaezeb was the second Siniteen to be featured in Star Wars canon, the first having been Pons Limbic, a background character in the Mos Eisley cantina scene in Star Wars: Episode IV A New Hope. Kaezab's statement after the game in which he claims that his move was fair and that Bronna's reaction wouldn't help the situation bears a close similarity to a comment made by C-3PO to Chewbacca in A New Hope, the film in which dejarik was first introduced.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Siniteen/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Yonta",
  "/wiki/Dejarik/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Species/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Holomonster/Legends",
  "/wiki/Colonies_region_Dejarik_tournament",
  "/wiki/Abyssin/Legends",
  "/wiki/Ohh_Bronna",
  "/wiki/Ng%27ok/Legends",
  "/wiki/Houjix/Legends",
  "/wiki/Savrip",
  "/wiki/Hologame_table",
  "/wiki/D%27nisenz",
  "/wiki/HoloNet_News_(original_website)",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/StarWars.com",
  "/wiki/The_galaxy/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/HoloNet_News_Vol._531_51",
  "/wiki/April",
  "/wiki/April_11",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/Pons_Limbic/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/C-3PO/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/HoloNet_News/Legends"
 ]
}