{
 "name": "Cos_Dashit",
 "display_name": "Cos Dashit",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Cos Dashit was the Emperor of the New Galactic Empire. His titles included Consul to the Supreme Tribunal.\nCos Dashit rose to the position of Emperor shortly after the events of the Jedi-Bendu rebellion and the Jedi's replacement by the Knights of the Sith. Afterwards, he proceeded to have the Empire initiate a manhunt for all the Jedi involved in the rebellion. This eventually led to conflict within the Aquilaean System, the sole remaining system that was independent from the Empire, where several of the Jedi were hidden. He attempted to personally request that the Aquilae sign the Treaty of Alliance. However, as they remained undecided for a long period of time, he decided to conquer the system by force instead. He then gave his announcement regarding the Empire's campaign against Aquilae to the Imperial dignitaries and military personnel at the Plaza of the Daders in the Imperial City of Alderaan. He also publicly promoted then-governor Crispin Hoedaack to the position of First Lord of the Aquilaean System and Surrounding Territories for the campaign during this speech. Unbeknownst to Dashit, however, Hoedaack, a member of the Supreme Tribunal alongside Darth Vader and Vantos Coll, had secretly plotted to usurp Dashit's authority, with the Aquilae campaign being the deciding factor on how to implement it.\nDashit was a thin, older Human, with a mustache that hung over his lips, as well as slightly pointed ears. He also wore a red cape with gold trimmings, alongside a blue-and-black tunic with gold trimmings. He had some narcissistic qualities, as evidenced by his reply to Crispin Hoedaack, where, when informing that his speech would give divine purpose to his subjects, he repeated enthusiastically \"my words!\"\nCos Dashit was a character who appeared in George Lucas' 1974 Rough Draft for Star Wars. The character was eventually replaced by Palpatine. However, there is no evidence to suggest that Dashit was Force-sensitive or a Sith Lord like Palpatine. Also, unlike the deformed Palpatine, his appearance is that of a handsome middle-aged man.\nIn the first draft, he is renamed \"Son Hhat\". He remains otherwise identical in speech and actions.\nThe novelization of Episode IV originally stated that the Emperor  was a puppet. This is implied, though not altogether stated, in the rough draft.\nDashit's first name has caused some fans to believe that Palpatine's full name is \"Cos Palpatine\". However, this is fanon. However, an Expanded Universe character, Palpatine's father and patriarch of the House of Palpatine, was eventually granted a similar name, Cosinga Palpatine.\nCos Dashit eventually made an appearance in the comic book adaptation of the rough draft, The Star Wars, in 2013. He was not directly named in his debut issue, although the article focusing on the comic in Star Wars Insider Issue 144 confirmed that he was intended to be Cos Dashit.\nDashit's likeness in the comic bares much resemblance to Emperor Ming the Merciless, arch nemesis of Flash Gordon, in particular his depiction in the TV series. Lucas has stated that Gordon's adventures were among the bases for Star Wars.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire_(The_Star_Wars)",
  "/wiki/Emperor_(The_Star_Wars)",
  "/wiki/Consul_to_the_Supreme_Tribunal",
  "/wiki/Plaza_of_the_Daders",
  "/wiki/Imperial_City_of_Alderaan",
  "/wiki/Governor/Legends",
  "/wiki/Crispin_Hoedaack",
  "/wiki/Supreme_Tribunal",
  "/wiki/Darth_Vader_(New_Galactic_Empire)",
  "/wiki/Vantos_Coll",
  "/wiki/Cape/Legends",
  "/wiki/George_Lucas",
  "/wiki/1974",
  "/wiki/Palpatine/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/The_Star_Wars:_First_Draft",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Fanon",
  "/wiki/Cosinga_Palpatine",
  "/wiki/The_Star_Wars_1",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Star_Wars_(article)",
  "/wiki/Star_Wars_Insider_144",
  "/wiki/January_17",
  "/wiki/2012"
 ]
}