{
 "name": "Cosinga_Palpatine",
 "display_name": "Cosinga Palpatine",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "65 BBY",
      "Palpatine family starship",
      "in hyperspace along the Hydian Way"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Above average"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Naboo",
      "Royal House of Naboo",
      "House Palpatine",
      "Royal House of Naboo",
      "House Palpatine",
      "House Palpatine"
     ]
    }
   ]
  }
 ],
 "content": "Cosinga Palpatine was a Human male aristocrat and the patriarch of House Palpatine, one of Naboo's noble families. A violent man who was regarded by his firstborn son as both grossly inept and disproportionately arrogant, Cosinga spent a considerable amount of time and credits attempting to buy both political influence and his son's obedience.\nOut of a minimum of five children that he and his wife produced, Cosinga hated his eldest son, but approved of his other four sons and daughter. Unlike their father's wayward heir, the younger Palpatines were subservient to Cosinga's will; something their older brother refused to be. Ultimately, the younger Palpatine took his father's life in an act of rage in 65 BBY, using the dark side of the Force to kill him along with his mother, his siblings, and several of the family's bodyguards. His son would soon become Darth Sidious, Dark Lord of the Sith, and later Senator, Supreme Chancellor and Emperor.\nLike his forefathers, Cosinga Palpatine was born into the ancient, aristocratic dynasty of the Palpatines, one of the Royal Houses of the planet Naboo. As a young man, Cosinga frequently stood on the balcony of the family's Lake Country villa and surveyed the estate's vast grounds, reveling at the sight of all that he stood to inherit. Palpatine, his eldest son, regarded this as a testament to Cosinga's mediocrity, as the only thing his father would ever be master of was that which was already owned by right of birth. This stood in stark contrast to Cosinga's ambitious heir, who would strive to, and ultimately succeed in, dominating the entire galaxy.\nCosinga's relationship with his family was uneasy at best. The elder Palpatine's wife and younger children were completely subservient to him, even to the point of having no opinions of their own. The only one in his family whom he could not exert his will over as easily was Palpatine. Cosinga was constantly at odds with his firstborn son and heir. The younger Palpatine proved to be a rebellious youth with a penchant for mischief. His father thus used a considerable amount of credits to protect the family from any scandal that Palpatine nearly caused on many occasions with his numerous run-ins with the law.\nAt one point, Cosinga purchased an expensive prototype patrol-grade Flash landspeeder, which his son interpreted as a bribe. Due to his passion for flying, however, Palpatine accepted the vehicle. Despite the pride he came to feel for the speeder, the \"gift\" failed to eliminate—or even soften—the hatred that Palpatine harbored toward his father. Cosinga later forbade Palpatine from flying after the latter inadvertently killed two pedestrians, only to reconsider his decision because of his son's defiance against parental authority. Their mutual resentment continued to grow for years following the incident, and Cosinga refused to fly with Palpatine ever again.\nCosinga Palpatine and his eldest son attended two coronations in Theed. Years later, Palpatine the younger distinctly remembered his father's envy of the monarch's power and influence. But whereas Cosinga dreamed of wielding power over Naboo in his son's eyes, Palpatine settled for nothing less than absolute power over the galaxy.\nBy 65 BBY, Cosinga Palpatine was a member of the faction that opposed Naboo's full integration into the Galactic Republic. During the upcoming election for the planet's next monarch, Cosinga and his political allies opposed Bon Tapalo, a candidate whose platform included the promise of integrating the people of Naboo as full members of the Republic. However, Palpatine believed that his father's support of Tapalo's opponent was motivated by more personal interests rather than the overall good of Naboo. According to Palpatine the son, Cosinga was having an affair with the sister of Tapalo's rival. Thus, Cosinga sought to elevate himself to a position of power in the government once the brother of his mistress became king; an undeserved position from Palpatine's eyes.\nThe young Palpatine developed a sense of pro-unification between Naboo and the Republic as a way of further spiting his father. Without Cosinga's knowledge, he discreetly supplied valuable information to Tapalo's campaign, an act which gained the notice of Darth Plagueis, a Dark Lord of the Sith who masqueraded in public as Magister Hego Damask, owner of Damask Holdings.\nCosinga disapproved of the friendship that his son had forged with Damask. But by attempting to separate Palpatine from Damask's influence, as well as his confirming Palpatine's suspicions that Cosinga, mutual to his son's own patricidal feelings for him, harbored a murderous hatred of the boy due to the fact that his son had been \"born mature\" and thus outranked his father in every way, Cosinga inadvertently caused his son to draw upon his hidden connection to the Force, particularly the dark side. Consumed by rage and years of repressed patricidal feelings, Palpatine used the Force to violently smash his father's skull against the ship's bulkhead. He then proceeded to slaughter everyone aboard.\nThe truth behind the deaths of Cosinga Palpatine and his family was disguised as a tragic accident by Plagueis, who then claimed the orphaned Palpatine as his Sith apprentice, thus renaming him \"Darth Sidious\" in secret. Cosinga's son ultimately went on to become the Sith Lord who brought about the downfall of the Jedi Order and the Republic, becoming Emperor of the first Galactic Empire in 19 BBY.\nCosinga Palpatine was an arrogant man, and not nearly as intelligent as he believed, according to his eldest son. Though not lacking in ambition, Cosinga had a mediocre desire for power, possessing no apparent desire to advance beyond his station as a privileged aristocrat, although the younger Palpatine did note that Cosinga had a particular envy towards the power wielded by that of the Naboo monarch. Part of the younger Palpatine's resentment stemmed from his observation of how his father lacked the political savvy necessary to increase House Palpatine to a position of true entitlement and greater wealth. Much to his son's disgust, Cosinga believed he already had all the power and influence that could be obtained. Palpatine, in what ultimately turned out to be their final argument, also implied that Cosinga was a prolific liar, as he called the latter the \"father of lies.\"\nAs a husband and father, Cosinga Palpatine was feared by his wife and younger children, but utterly despised by his eldest son. One of the few traits the elder and younger Palpatine had in common, other than a thirst for violence, was a fanatical passion for speeder racing. His political views were conservative and pro-isolationist. Hence, he agreed with then-senatorial aide Vidar Kim on the prospect of maintaining Naboo's state of semi-independence from the Republic in order to prevent their homeworld's plasma reserves from being exploited by corporate entities.\nSimilar to how his own son hated him, Cosinga in turn hated his eldest son, enough that he even admitted immediately prior to his death that he was willing to kill his son right from the start, and would have done so at Palpatine's goading had the latter not killed him first. Largely because of his hatred of his son, he also held doubts that he was even related to him, making Palpatine take a paternity test at least once to make sure he was indeed his son. Even in the few instances where Cosinga bailed his son out of punishment from the law, it was solely to protect his family from the inevitable scandal that would arise from the eldest son getting in trouble with the law and not out of any genuine concern for his son's well being.\nDespite being married, Cosinga pursued an extra-marital affair with his mistress. She was also the sister of Bon Tapalo's chief rival for the monarchy. His son suspected that Cosinga was taking advantage of his affair in order to attain a position of power in the government should Tapalo's opponent win the election.\nCosinga Palpatine was first introduced in the novel Darth Plagueis. The creation of his character, along with those of his wife and his other sons and daughters, provided a considerable amount of detail to the once-obscure origins of Emperor Palpatine.\nCos Dashit was the original name of the Emperor  in the rough draft of Star Wars. Cosingas  is one of the generals mentioned by Polyaenus in his Stratagems.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Naboo/Legends",
  "/wiki/65_BBY/Legends",
  "/wiki/Palpatine_family_starship",
  "/wiki/Hyperspace/Legends",
  "/wiki/Hydian_Way/Legends",
  "/wiki/Human/Legends",
  "/wiki/Naboo_(people)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Royal_House_of_Naboo/Legends",
  "/wiki/Imperial_family",
  "/wiki/Noble/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Palpatine%27s_mother",
  "/wiki/Palpatine%27s_first_brother",
  "/wiki/Palpatine%27s_second_brother",
  "/wiki/Palpatine%27s_first_sister",
  "/wiki/Palpatine%27s_second_sister",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Death/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Lake_Country/Legends",
  "/wiki/Convergence/Legends",
  "/wiki/Master",
  "/wiki/The_galaxy/Legends",
  "/wiki/Palpatine%27s_siblings",
  "/wiki/Palpatine%27s_prototype_patrol-grade_Flash",
  "/wiki/Landspeeder/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Monarch_of_Naboo/Legends",
  "/wiki/Bon_Tapalo/Legends",
  "/wiki/Bon_Tapalo%27s_opponent",
  "/wiki/Cosinga_Palpatine%27s_mistress",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Magister",
  "/wiki/Damask_Holdings/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Racing",
  "/wiki/Aide/Legends",
  "/wiki/Vidar_Kim",
  "/wiki/Homeworld/Legends",
  "/wiki/Plasma/Legends",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Cos_Dashit",
  "/wiki/Lord/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Consul_to_the_Supreme_Tribunal",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/February_28",
  "/wiki/2020",
  "/wiki/June_3"
 ]
}