{
 "name": "CP-6824",
 "display_name": "CP-6824",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicGrand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "CP-6824, nicknamed \"Switch,\" was a clone trooper private serving in the Grand Army of the Republic during the Clone Wars.\nPrivate Switch was a \"soft-shell\"—a clone trained for technical tasks rather than combat. He proved his resourcefulness and bravery during the Battle of Juma 9. The station Juma 9 was attacked by the CIS army led by Kul Teska, and Switch proved himself invaluable to Jedi Generals Plo Koon and Obi-Wan Kenobi by restoring power to the station's critical systems, which allowed the clones and the Jedi to defend the station against the assault. The CIS forces were much greater in numbers, however, and soon the Republic was forced into retreat. When the station came under threat of being utterly destroyed, the Jedi ordered all clone troopers to abandon station. Switch and clone trooper commander CC-2224 escorted many of their brothers into escape pods and boarded the last one themselves. However, the pod was damaged and required manual activation. Switch chose to sacrifice himself, pushing Cody into the pod and ejecting it from outside, just before the massive explosion shook the station.\nThe station, however, was badly damaged but not destroyed. Switch survived, but was trapped alone in a deserted area with no means to contact anyone. Sometime later, Republic reinforcements arrived. Jedi Generals Mace Windu and Kit Fisto, accompanied by Commander CC-6454, arrived to find Koon and Kenobi, but instead heard Switch's call for help. Since Switch was in the best position to locate the missing Jedi Masters, Windu and Fisto first made their way to his location, and then escorted Switch through the hazards into the main data center, where he discovered the room Koon and Kenobi were trapped in. After the last remaining battle droids were destroyed, Switch was present at the meeting of nine Jedi, five of whom were present via hologram, and transmitted to them several important recordings, including the conversation between Kul Teska and Count Dooku and a plea for help from Senator Padmé Amidala from Behpour.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Switch_(disambiguation)",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Private/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Battle_of_Juma_9",
  "/wiki/Juma_9",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Kul_Teska",
  "/wiki/Jedi_General/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-2224/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/CC-6454",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Behpour/Legends",
  "/wiki/Category:Images_of_CP-6824",
  "/wiki/Star_Wars:_The_Clone_Wars:_Republic_Heroes"
 ]
}