{
 "name": "Cradossk",
 "display_name": "Cradossk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty Hunters' Guild"
     ]
    }
   ]
  }
 ],
 "content": "Cradossk was a Trandoshan male and the father of Bossk. A seasoned warrior and respected bounty hunter, Cradossk shared a rivalry with the Wookiee chieftain Tarfful, and, by the time of the Clone Wars, Cradossk's son gained a reputation for hunting Wookiees. Despite adopting Cradossk's trade, Bossk was reluctant to talk about his father with young accomplice Ezra Bridger. During the Imperial Era, Cradossk was a notable member of the Bounty Hunters' Guild, and he made a profit by providing services to the Galactic Empire.\nA fearsome Trandoshan male, Cradossk was an experienced warrior and respected bounty hunter. Like other Trandoshans, Cradossk had a fierce rivalry with the Wookiees of Kashyyyk, including Tarfful, a Wookiee chieftain who fought against Trandoshan hunters.\nSeveral years before the Clone Wars, Cradossk's son, Bossk, and his daughter, Doshanalawook were born on Trandosha, the species' homeworld. After hatching, Bossk ate his unborn siblings' eggs, including Doshanalawook's. Despite being told otherwise, Bossk failed to kill his sister and her cracked egg was given to the Wookiee Liswarr'arindoo in exchange for a bottle of Kowakian rum. Cradossk eventually taught Bossk how to steal landspeeders. Like his father, Bossk became a bounty hunter and a renowned Wookiee hunter. At some point Cradossk expressed his disappointment with his son over his frequent failures in capturing the Wookiee Chewbacca and his companion Han Solo, stating that he had doubts whether Bossk really was the right candidate to have devoured the nest eggs of his siblings and emerge as its only candidate. In 5 BBY, during the Imperial Era, Bossk took a mission to the planet Lothal, where he hired the street urchin Ezra Bridger as a guide. When the young human asked questions about Bossk's father, the Trandoshan became annoyed, stating that fathers were \"overrated.\"\nPrior to the start of the Galactic Civil War, Cradossk was a notable member of the Bounty Hunters' Guild, an institution designed to regulate the bounty-hunting profession. The Galactic Empire made use of the Guild's services, and, according to Captain Cassian Jeron Andor, an intelligence officer of the Alliance to Restore the Republic, Cradossk was \"making a killing.\" Andor's statement was sent to General Davits Draven, and the transmission was recorded in The Rebel Files.\nCradossk had orange eyes and green skin. He had a hatred of Wookiees, which he passed on to his son, Bossk.\nAs a bounty hunter, Cradossk wore a red flight suit and armed himself with a Relby-v10 micro grenade launcher, a weapon also used by Bossk.\nBossk's father was first referenced in the new Star Wars canon, without name, in Ezra's Gamble, a junior novel written by Ryder Windham and published by Disney–Lucasfilm Press in 2014 as a prequel to the animated television series Star Wars Rebels. The bounty hunter Cradossk first appeared in the 2014 mobile game Star Wars: Galactic Defense. Although Galactic Defense did not state Cradossk's identity as Bossk's father, a relationship originally established by author K. W. Jeter in the 1998 Star Wars Legends novel The Mandalorian Armor, dialogue in the 2017 video game Star Wars Battlefront II confirmed as much.\nIn Galactic Defense, Cradossk and Tarrful were unlockable Champions during the limited-time event \"Fierce Enemies.\" Cradossk could gain Champion Synergy with other bounty hunter Champions, namely Bossk, Cad Bane, Dengar, Boba Fett, Jango Fett, and Aurra Sing.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Cradossk",
  "/wiki/Cradossk/Legends",
  "/wiki/Tooth_and_Claw",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/File:Son-of-Cradossk.ogg",
  "/wiki/Parent",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Bounty_hunter",
  "/wiki/Wookiee",
  "/wiki/Chief",
  "/wiki/Tarfful",
  "/wiki/Time",
  "/wiki/Clone_Wars",
  "/wiki/Hunting",
  "/wiki/Ezra_Bridger",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Kashyyyk",
  "/wiki/Standard_year",
  "/wiki/Doshanalawook",
  "/wiki/Reproduction",
  "/wiki/Trandosha",
  "/wiki/Species",
  "/wiki/Homeworld",
  "/wiki/Liswarr%27arindoo",
  "/wiki/Kowakian_rum",
  "/wiki/Thief",
  "/wiki/Landspeeder",
  "/wiki/Bounty",
  "/wiki/5_BBY",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Human",
  "/wiki/Galactic_Civil_War",
  "/wiki/Captain",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Intelligence_officer",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/General",
  "/wiki/Davits_Draven",
  "/wiki/The_Rebel_Files",
  "/wiki/Eye",
  "/wiki/Flight_suit",
  "/wiki/Relby-v10_micro_grenade_launcher",
  "/wiki/Star_Wars",
  "/wiki/Ezra%27s_Gamble",
  "/wiki/Ryder_Windham",
  "/wiki/Disney%E2%80%93Lucasfilm_Press",
  "/wiki/2014",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/K._W._Jeter",
  "/wiki/1998",
  "/wiki/Star_Wars_Legends",
  "/wiki/The_Mandalorian_Armor",
  "/wiki/2017",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Cad_Bane",
  "/wiki/Dengar",
  "/wiki/Boba_Fett",
  "/wiki/Jango_Fett",
  "/wiki/Aurra_Sing",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Category:Images_of_Cradossk",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Wookiee_Hunt",
  "/wiki/Death_Trap",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Dark_Disciple"
 ]
}