{
 "name": "Crag",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Foot Patrol 7",
      "Foot Patrol 7"
     ]
    }
   ]
  }
 ],
 "content": "Crag was a human clone who served in the Galactic Empire as a sandtrooper in Foot Patrol 7. Dispatched to Tatooine by Grand Moff Wilhuff Tarkin, Crag and his unit searched the planet for two missing Rebel Alliance droids, R2-D2 and C-3PO. They combed the Mos Eisley spaceport until they came across a landspeeder with the two droids on board. However, the passengers managed to elude the unit after the old man aboard the landspeeder used a mind trick on the troopers.\nWhen the droids and their allies attempted to flee the planet via Docking Bay 94, Crag and the rest of Foot Patrol 7 were alerted to their presence, and the clone led the way to the hangar. However, his team failed to capture the droids as they fled Tatooine aboard a ship following a firefight with another sandtrooper unit in the hangar.\nCreated on the planet Kamino, Crag was a clone of the bounty hunter Jango Fett. In 0 BBY, he was assigned the role of a sandtrooper in the Galactic Empire's Foot Patrol 7 unit by Imperial Grand Moff Wilhuff Tarkin, alongside Sardis Ramsin, TD-787, Tintop, and their commander, Wanten. The unit was dispatched to the desert planet of Tatooine, where they were tasked with recovering two missing droids, R2-D2 and C-3PO, who were affiliated with the Rebel Alliance and were carrying the plans for the Death Star battle station.\nWhile stationed in the Imperial barracks located on the outskirts of the Mos Eisley spaceport, the clone witnessed an argument break out between Tintop and TD-787 after the former slipped an additive in the latter's food that made his stomach feel gaseous. Crag broke up the altercation by describing where the name \"stormtroopers\" came from, to which Tintop stated that it originated from their helmets being shaped like buckets. After Crag snubbed him for referring to the wrong origin of their name, Wanten arrived at the barracks and stated that they were \"born in the storm,\" to which Crag pointed out that it was \"the storm of history\" that served as the namesake for stormtroopers. As the clone added that their unit was created to maintain order in the galaxy, Wanten informed the unit that they were heading to Mos Eisley to look for the droids.\nArriving at Mos Eisley, Foot Patrol 7 patrolled the spaceport in search of the droids, stopping a landspeeder—driven by a boy and an old man—carrying the two droids they were looking for. Crag and the rest of the unit watched as Wanten requested the passengers' identification, but ultimately allowed them to pass by with the droids. Unbeknownst to them, the passengers were Luke Skywalker and the Jedi Obi-Wan Kenobi, the latter of whom had performed a mind trick on the entire unit and allowed them to elude the sandtroopers.\nFollowing the incident, Crag and the rest of Foot Patrol 7 stopped by Chalmun's Spaceport Cantina for drinks. Continuing their search for the droids, they left the cantina and were immediately contacted by Commander TD-4445, who informed them that the droids and their allies were boarding a ship they had commissioned in order to escape Tatooine. The commander ordered all available units to converge on Docking Bay 94, as he had received confirmation on the passengers' position from their spy, Garindan ezz Zavor. Crag led Foot Patrol 7 as they rushed to the hangar, but they were unable to reach the ship in time as it took off and left the planet after a brief firefight with another detachment of sandtroopers in the landing bay. The unit then returned to the streets of Mos Eisley. Sometime afterward, Ramsin detailed the events experienced by Foot Patrol 7 in an Imperial incident report form.\nAs an old clone, Crag had a strong sense of duty, reminding his team of their origins and how they were tasked with maintaining order in the galaxy. The unit would cease their actions and listen to Crag whenever he spoke. However, his personality earned the ire of Ramsin, who sarcastically detailed his experience in the report form, calling the clone trooper a \"relic.\" Like other clones of Jango Fett, Crag stood 1.83 meters tall.\nCrag wore sandtrooper armor that was augmented with cooling fans and a helmet sand filter, as well as a black SD-48 survival backpack stocked with extra rations and water. Like the rest of Foot Patrol 7, he carried an E-11 medium blaster rifle.\nCrag first appeared as an unnamed stormtrooper in the 1977 original trilogy film, Star Wars: Episode IV A New Hope, played by an uncredited actor. He was first identified in the 2017 short story \"Born in the Storm,\" written by Daniel José Older as part of From a Certain Point of View, a collection of short stories by various authors. However, the story does not identify which of the four troopers in A New Hope without spoken dialogue in Foot Patrol 7 is Crag.\nThe actors playing the members of Foot Patrol 7 filmed their scene with Kenobi and Luke between April 2 and April 3, 1976 at Ajim, Tunisia. The scene originally featured six troopers, but only five are shown on-screen in the final cut of the film. Foot Patrol 7 also appears in Star Wars: The Original Trilogy – A Graphic Novel; however, only three sandtroopers with light-colored backpacks are depicted in the encounter with Kenobi, as opposed to the five troopers with black backpacks seen in the film.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Crag_(disambiguation)",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Empire",
  "/wiki/Foot_Patrol_7",
  "/wiki/File:Crag1.ogg",
  "/wiki/Desert_stormtrooper",
  "/wiki/Tatooine",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Planet",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Mos_Eisley",
  "/wiki/Spaceport",
  "/wiki/X-34_landspeeder",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Landspeeder",
  "/wiki/Mind_trick",
  "/wiki/Trooper",
  "/wiki/Docking_Bay_94",
  "/wiki/Hangar",
  "/wiki/Millennium_Falcon",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/0_BBY",
  "/wiki/Sardis_Ramsin",
  "/wiki/TD-787",
  "/wiki/Tintop",
  "/wiki/Stormtrooper_Commander",
  "/wiki/Wanten",
  "/wiki/Desert",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Mos_Eisley_barracks",
  "/wiki/Helmet",
  "/wiki/The_galaxy",
  "/wiki/File:Crag2.ogg",
  "/wiki/Luke_Skywalker",
  "/wiki/Jedi",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Cantina",
  "/wiki/Commander",
  "/wiki/TD-4445",
  "/wiki/Spy",
  "/wiki/Garindan_ezz_Zavor",
  "/wiki/Time",
  "/wiki/File:Crag3.ogg",
  "/wiki/Armor",
  "/wiki/SD-48_survival_backpack",
  "/wiki/Water",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/2017",
  "/wiki/Born_in_the_Storm",
  "/wiki/Daniel_Jos%C3%A9_Older",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/April_2",
  "/wiki/April_3",
  "/wiki/1976",
  "/wiki/Ajim",
  "/wiki/Tunisia",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Backpack",
  "/wiki/Star_Wars_Storybook_Collection:_Star_Wars:_The_Prequel_Trilogy_Stories_and_Star_Wars:_The_Original_Trilogy_Stories",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/A_New_Hope_-_The_Film_Novel",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/A_Bad_Feeling_About_This",
  "/wiki/The_Original_Trilogy_Stories",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Bump",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2016_Topps_Star_Wars:_Rogue_One_Mission_Briefing",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_5",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Stormtroopers:_Beyond_the_Armor",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_8",
  "/wiki/Droid_Directory",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Grand_Tour_of_Tatooine",
  "/wiki/Star_Wars_Insider_189",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/The_Rise_of_the_Rebellion_and_the_Battle_of_Yavin",
  "/wiki/Robert_Watts:_Location,_Location,_Location!",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Databank_(website)",
  "/wiki/Category:Audio_files_of_Crag",
  "/wiki/Clone_trooper",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Join_the_Resistance:_Escape_from_Vodran"
 ]
}