{
 "name": "Crev_Bombaasa",
 "display_name": "Crev Bombaasa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Crev Bombaasa was a well-cultivated human male who worked as a shipping executive on the planet Corellia. He bribed local law enforcement to stop them from investigating violent attacks against his business rivals, but he faced greater scrutiny under the Galactic Empire. That prompted him to travel to Coronet Spaceport in order to leave Corellia in search of a new base of operations.\nWhile in the spaceport, he witnessed another traveler being arrested, which allowed the criminals Han and Qi'ra to cut in line behind Bombaasa. The executive then continued to move forward in the queue without incident.\nCrev Bombaasa was a human male who worked as a shipping executive on the planet Corellia. He paid enormous amounts to the local police in order to ensure that they did not investigate violent strikes against his business rivals. During the reign of the Galactic Empire, his work became more difficult under Imperial scrutiny, so in 13 BBY, he traveled to Coronet Spaceport in order to leave Corellia and begin scouting the Outer Rim Territories for a new location to set up his base of operations.\nWhile in the spaceport, Bombaasa stood in line waiting to pass through the Imperial checkpoint while Imperial stormtroopers dragged away another human in the line behind him. Bombaasa turned briefly to watch the commotion before returning his attention to the front of the line as the criminals Han and Qi'ra used the confusion to cut into the space in the line behind him.\nThe line then proceeded forward without further incident until Bombaasa had been called up to the booth, after which the checkpoint was locked down when Qi'ra and Han attempted to bribe their way through. Travelers who had already passed through the checkpoint were prevented from leaving.\nCrev Bombaasa was well-educated and had a refined taste in the arts. He had fair skin, brown eyes, and brown hair.\nWhile in the spaceport, Bombaasa wore a gray robe with a yellow collar under a black gaberwool overcloak with a pair of black boots. He carried a cane containing a location transponder and wore an elite-status transit tag.\nCrev Bombaasa first appeared in the new Star Wars canon in the 2018 Anthology Series film, Solo: A Star Wars Story, and was identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo. The character was portrayed uncredited by Richard Dixon. Crev Bombaasa originated in the Star Wars Legends continuity, where he first appeared in Crisis, an adventure released in The DarkStryder Campaign, a 1995 supplement to Star Wars: The Roleplaying Game published by West End Games.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Crev_Bombaasa",
  "/wiki/Crev_Bombaasa/Legends",
  "/wiki/Ulfor_Bombaasa",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Planet",
  "/wiki/Corellia",
  "/wiki/Law_enforcement_agency",
  "/wiki/Galactic_Empire",
  "/wiki/Coronet_Spaceport",
  "/wiki/Spaceport",
  "/wiki/Han_Solo",
  "/wiki/Qi%27ra",
  "/wiki/Imperial_Era",
  "/wiki/13_BBY",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Stormtrooper",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Gaberwool",
  "/wiki/Cape",
  "/wiki/Boot",
  "/wiki/Cane/Legends",
  "/wiki/Transponder",
  "/wiki/Star_Wars",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Richard_Dixon",
  "/wiki/Star_Wars_Legends",
  "/wiki/Crisis_(RPG_adventure)",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/1995",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/Category:Images_of_Crev_Bombaasa",
  "/wiki/Solo:_A_Star_Wars_Story_Look_and_Find",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/March_9",
  "/wiki/2022",
  "/wiki/The_DarkStryder_Campaign_(series)"
 ]
}