{
 "name": "Cribiriz Idollax",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Culisetto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink and yellow"
     ]
    }
   ]
  }
 ],
 "content": "Cribiriz Idollax was a Culisetto male warlord and droid mechanic during the Imperial Era. When Deva Lompop sent Zuckuss, 4-LOM and bounty hunters to kill him, they instead killed his brother, Sribiriz. Idollax spent the following years hiding, planning to avenge his brother by torturing the people who killed him. At one point he obtained 4-LOM's head and used it to create a spider-like droid, drastically changing the droid's personality; he then sent 4-LOM against his ex-partner. Zuckuss, after he discovered that the Culisetto was still alive and brainwashed his best friend, killed Idollax.\nThe Culisetto male doctor Cribiriz Idollax was a warlord and droid mechanic who held a compound on an unidentified planet serving as his headquarters. He had a brother named Sribiriz, who was known to be good-hearted and selfless. Sribiriz couldn't stand his brother's criminal and violent activities, despite loving him, as their mother, affectionately called Mamazooz by Cribiriz, often affirmed.\nIdollax crafted his own droids that served him as guards and henchmen.\nOne day, before 9 BBY, Sribiriz told his brother he was going to report his crimes to the authorities. Therefore, Cribiriz decided to change his ways and to stop being a criminal. On that same day, Deva Lompop hired a group of bounty hunters, including the infamous Zuckuss and 4-LOM, to kill the Culisetto warlord, who, in her opinion, was becoming a threat. After breaking into Idollax's facility, Zuckuss and 4-LOM found Sribiriz and, mistaking him for his brother, shot him, killing him, while Cribiriz, hidden, watched. Doctor Idollax then swore revenge against the murderers of his brother and went into hiding from the rest of the galaxy.\nWhile hiding, Idollax tried to learn more about the bounty-hunter duo, and he came into contact with the deserter Imperial stormtrooper Sardis Ramsin, who, sometime between 3 ABY and 4 ABY, brought him 4-LOM's severed head, which had been found by the Jawas on Tatooine, after it was separated from the original body by the bounty hunter Boba Fett. Idollax then created a new giant spider-like droid, reprogramming 4-LOM's head, and sent it to pursue Zuckuss.\nOn Nar Shaddaa, Zuckuss fought his ex-partner along with other bounty hunters, and won. During the battle, the Gand findsman discovered the presence of his old enemy, Doctor Idollax, who explained his story and plan. Zuckuss, after the Culisetto mechanic finished talking, shot him with his rifle, killing him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Nar_Shaddaa",
  "/wiki/Culisetto",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Warlord",
  "/wiki/Droid",
  "/wiki/Technician",
  "/wiki/Imperial_Era",
  "/wiki/Deva_Lompop",
  "/wiki/Zuckuss",
  "/wiki/4-LOM",
  "/wiki/Bounty_hunter",
  "/wiki/Sribiriz",
  "/wiki/Standard_year",
  "/wiki/Torture",
  "/wiki/Mamazooz",
  "/wiki/9_BBY",
  "/wiki/The_galaxy",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper",
  "/wiki/Sardis_Ramsin",
  "/wiki/Jawa",
  "/wiki/Tatooine",
  "/wiki/Boba_Fett",
  "/wiki/Gand",
  "/wiki/Findsman",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_4-LOM_%26_Zuckuss_1",
  "/wiki/Bounty_Hunters_15",
  "/wiki/Bounty_Hunters_19",
  "/wiki/Bounty_Hunters_20",
  "/wiki/StarWars.com",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Death",
  "/wiki/Han_Solo",
  "/wiki/Rekias_Nodo",
  "/wiki/Star_Wars_Helmet_Collection_78"
 ]
}