{
 "name": "Crix Madine",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "34 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.73 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "82 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish blond",
      "later white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Special Forces",
      "Imperial Special Forces",
      "Alliance to Restore the Republic",
      "Alliance High Command",
      "Rebel Alliance Special Forces",
      "Alliance High Command",
      "Rebel Alliance Special Forces",
      "New Republic",
      "New Republic Special Forces",
      "New Republic Special Forces"
     ]
    }
   ]
  }
 ],
 "content": "Crix Madine was a human male who led a commando unit of the Galactic Empire's military until he defected to the Rebel Alliance, where he served as a general. As the officer responsible for covert actions, he devised the attack on the Endor shield generator and trained the soldiers who accompanied Han Solo to the forest moon. At the end of the Galactic Civil War, Madine went on to serve in the New Republic, a democratic government founded by the Rebels.\nA human male native to Corellia, Crix Madine initially served in the military of the Galactic Empire, an authoritarian regime founded at the end of the Clone Wars, in which he led a commando unit. He became a highly decorated officer, and obtained the military rank of general. However, he ended up defecting to the Rebel Alliance, a resistance group that opposed the tyranny of the Empire during the Galactic Civil War. Holding the rank of General, he specialized in covert actions that involved the theft of equipment from the Empire and infiltration of strike teams onto occupied worlds. He was a practitioner of Corellian boxing.\nMadine was present on the Home One alongside Chancellor Mon Mothma and Admiral Ackbar when bounty hunter Beilert Valance provided the Rebellion with the plans for a shield generator that could withstand orbital bombardment.\nSeveral months after the battle of Hoth, Madine and other high-ranking rebel officers secretly met on Zastiga, where Chancellor Mothma revealed that the Alliance had discovered the Empire was building a new planet-killing battle station, the second Death Star, over the Forest Moon of Endor. The Alliance decided to destroy the battle station before it was completed, but needed time to gather the Alliance Fleet near Sullust. Princess Leia Organa proposed leading a mission, dubbed Operation Yellow Moon, to distract the Empire's attention to the Corva sector on the opposite side of the galaxy from Sullust.\nMadine and the other rebel commanders agreed with her plan, and Madine volunteered to serve on the mission as a commando. Admiral Ackbar rejected him, noting that he was needed to plan the assault on the second Death Star. Instead, Madine assigned one of his best commandos, Major Lokmarcha, to the mission. Leia succeeded in completing the operation, although Lokmarcha and another rebel operative died. Leia also managed to steal the Tydirium, an Imperial Lambda-class T-4a shuttle, which Madine intended to use on the mission to Endor.\nWith the Alliance Fleet in place, Madine, Mothma, and Ackbar briefed Alliance forces on the plan to destroy the second Death Star. Thanks to Leia's theft of the Tydirium, the general planned on sneaking a strike team onto the Forest Moon of Endor, where the Empire had built a shield generator to protect the battle station. From the moon's surface, the Rebels could take down the shield generator, leaving the Death Star vulnerable to the Alliance Fleet's firepower. In order to accomplish that mission, Madine asked his fellow general Han Solo to assemble and lead the strike team.\nPrior to the Battle of Endor, General Madine gave a hologram briefing to the various starfighter squadrons in the Alliance Fleet including Corona Squadron, which was based aboard the Mon Calamari cruiser Liberty. When Kendy Idele asked who would take care of the deflector shield generator on Endor, Madine reassured her that Solo's team would handle that matter. When several Corona pilots including Yendor chatted about Han, Madine interjected that Solo was one of their best assets. He then assigned Corona Squadron to escort General Lando Calrissian in the Millennium Falcon and the Gold, Red, Green, and Gray Squadrons as they penetrated the second Death Star. Madine's plan ultimately succeeded, which led to the Alliance's most crucial victory over the Empire.\nFollowing the destruction of the second Death Star, Madine kept the fleet on alert over the moon of Endor as he was concerned about a possible Imperial counterattack. The next day, Madine conferred with General Solo about an Imperial outpost still operating on the other side of the moon from the shield generator. Both agreed that they could not allow the Imperials to remain and threaten the Ewoks, and Solo led his strike team in a assault on the outpost.\nA few months after Endor, Madine and other elements of the Rebel Fleet Command were aboard a MC80 Star Cruiser at Muster Point: Stalwart. He and Admiral Gial Ackbar briefed rebel soldiers and pilots on the Empire's ongoing planetary assaults, including Operation: Cinder. Madine thanked the rebels for their efforts against the Empire and for the thousands of lives they saved countering Operation: Cinder, but sadly noted that the war was far from over.\nSometime after the Battle of Endor, the Rebel Alliance was reorganized into the New Republic and Madine was placed in command of the New Republic Special Forces. After Admiral Ackbar received vital intelligence on Imperial fleet movements from a mysterious informant called the Operator, General Madine was part of a hologram conference that included Commander Kyrsta Agate, Captain Saff Melor, and Chancellor Mon Mothma. When Madine questioned the trustworthiness of this informant, Agate responded that the Operator had been reliable so far. However, Ackbar cautioned that the Empire was playing a long game. At the advice of Ackbar, Madine agreed to divert a small team of Special Forces soldiers led by Sergeant Jom Barell to investigate the Imperial presence on Akiva. While most of the unit was killed, Barell played a role in the successful rebellion on Akiva.\nIn 5 ABY, Madine attended the Liberation Day celebrations held at Chandrila's Old Gather-House. Mothma had organized Liberation Day to celebrate the liberation of a hundred former rebel prisoners from Ashmead's Lock on the planet Kashyyyk. However, the prisoners had been fitted with inorganic biochip implants which allowed Fleet Admiral Gallius Rax, the true leader of the Imperial remnants, to transmit signals which turned the prisoners into unwilling assassins. Madine was rumored to have died during the attack on Chandrila.\nCrix Madine was a blue-eyed man of average height, standing 1.7 meters. He had reddish blond hair and, at the time of the Battle of Endor, he sported a full beard. As an officer, he was very respectful of the troopers under his command. He always made sure that his men were properly equipped and prepared for the dangerous missions he assigned to them. While writing letters of notification to the loved ones of rebels who died in the line of duty, Madine used a protocol droid to assist him.\nCrix Madine first appeared in the 1983 film Star Wars: Episode VI Return of the Jedi, the third and final installment of the Star Wars original trilogy. He was played by the Irish actor Dermot Crowley.\nWhen Crowley first walked onto the set he was smooth-faced and the crew presented him with a false beard insisting that he had to wear it. The Kenner Products toy company had already begun pre-production on Madine's action figure, and, since that toy sported a beard, Crowley had to match.\nGiven the uncertainty inherent in giving key expository dialog to the Mon Calamari Admiral Ackbar—portrayed by a fishfaced puppet—the filmmakers of Return of the Jedi shot a number of \"backup\" shots of Madine standing in for his colleague. However, those shots ultimately went unused in the movie's final cut.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Crix_Madine",
  "/wiki/Crix_Madine/Legends",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_20",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Special:Upload",
  "/wiki/Corellia",
  "/wiki/34_BBY",
  "/wiki/Human",
  "/wiki/Corellian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Special_Forces",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Alliance_High_Command",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Special_Forces",
  "/wiki/File:Madine-Imperialshuttlestolen.ogg",
  "/wiki/Imperial_commando",
  "/wiki/Imperial_Military",
  "/wiki/General",
  "/wiki/Officer",
  "/wiki/Battle_of_Endor",
  "/wiki/Endor",
  "/wiki/Deflector_shield",
  "/wiki/Deflector_shield_generator",
  "/wiki/Rebel_trooper",
  "/wiki/Han_Solo",
  "/wiki/Moon",
  "/wiki/Galactic_Civil_War",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Clone_Wars",
  "/wiki/Military_rank",
  "/wiki/Planet",
  "/wiki/Corellian_boxing",
  "/wiki/Home_One",
  "/wiki/Chancellor_(Rebel_Alliance)",
  "/wiki/Mon_Mothma",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Bounty_hunter",
  "/wiki/Beilert_Valance",
  "/wiki/Orbital_bombardment",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Hoth",
  "/wiki/Hoth",
  "/wiki/Zastiga",
  "/wiki/Battle_station",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Forest",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Sullust",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Operation_Yellow_Moon",
  "/wiki/Corva_sector",
  "/wiki/The_galaxy",
  "/wiki/Commander",
  "/wiki/Rebel_Commando",
  "/wiki/Commando",
  "/wiki/Major",
  "/wiki/Lokmarcha",
  "/wiki/Antrot",
  "/wiki/Tydirium",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Special_Forces_Trackers_Unit",
  "/wiki/Hologram",
  "/wiki/Corona_Squadron",
  "/wiki/MC80_Star_Cruiser",
  "/wiki/Liberty",
  "/wiki/Kendy_Idele",
  "/wiki/Yendor",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Millennium_Falcon",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Green_Squadron_(Rebel_Alliance)",
  "/wiki/Gray_Squadron_(Rebel_Alliance)",
  "/wiki/Imperial_outpost_(Endor)",
  "/wiki/Ewok",
  "/wiki/Assault_on_an_Imperial_outpost",
  "/wiki/Star_Cruiser",
  "/wiki/Soldier",
  "/wiki/Pilot",
  "/wiki/Operation:_Cinder",
  "/wiki/Gallius_Rax",
  "/wiki/Kyrsta_Agate",
  "/wiki/Captain",
  "/wiki/Saff_Melor",
  "/wiki/Chancellor_(New_Republic)",
  "/wiki/Sergeant",
  "/wiki/Jom_Barell",
  "/wiki/Akiva",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/5_ABY",
  "/wiki/Liberation_Day_(New_Republic)",
  "/wiki/Chandrila",
  "/wiki/Old_Gather-House",
  "/wiki/Ashmead%27s_Lock",
  "/wiki/Kashyyyk",
  "/wiki/Fleet_Admiral",
  "/wiki/Attack_on_Chandrila",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Dermot_Crowley",
  "/wiki/Kenner_Products",
  "/wiki/Mon_Calamari",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Han_Solo_-_From_Smuggler_to_General",
  "/wiki/Lost_Stars",
  "/wiki/Lost_Stars_(audiobook)",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Two_Sides_to_Every_Sortie",
  "/wiki/Empire_Ascendant_1",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Shattered_Empire_1",
  "/wiki/Shattered_Empire_2",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Shattered_Empire_4",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/The_Embersteel_Blade",
  "/wiki/Return_to_the_Wheel",
  "/wiki/A_Perilous_Rescue",
  "/wiki/Escape_from_Coruscant",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Insider",
  "/wiki/My_Star_Wars",
  "/wiki/Star_Wars_Insider_151",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Lead_by_Example",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection_7",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Helmets",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_40",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Force_Awakens:_Head-to-Head",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/Databank_(original)"
 ]
}