{
 "name": "Crofyp",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 18 BBY",
      "Anvil",
      "Rapacc system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kilji"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kilji Illumine",
      "Crofyp's task force",
      "Crofyp's task force"
     ]
    }
   ]
  }
 ],
 "content": "Crofyp was a male Kilji who held the rank of general in the Kilji government of the Illumine, commanding a task force consisting of the war cruiser Anvil and Colonel Tildnis' picket cruiser Hammer. Around 18 BBY, the Grysk operative Jixtus, an ally of the Illumine's leader, Generalirius Nakirre, sent General Crofyp's task force to capture refugees who were residing on the planet Rapacc.\nAfter confronting the Paccosh-commandeered Nikardun blockade frigate Aelos, the Chiss heavy cruiser Springhawk led by Senior Captain Mitth'raw'nuruodo \"Thrawn\"—who was returning the refugees' leader, The Magys, to Rapacc—arrived. The Chiss entered a verbal confrontation with Crofyp shortly before a skirmish with the general's force took place. After the Springhawk hit the Anvil's starboard with ship-disabling plasma spheres, Crofyp had the Anvil move into the line of laser fire in an attempt to protect the Hammer so it could flee. As a result, the Hammer was able to travel to the planet Sunrise, where the refugees came from, but the Anvil was destroyed and Crofyp was killed.\nIn 18 BBY, General Crofyp, a male member of the Kilji sentient species, served in the Kilji Illumine, the government of the Kiljis, and commanded a task force consisting of two warships, the Anvil, his war cruiser and the Hammer, Colonel Tildnis' picket cruiser. Generalirius Nakirre, the leader of the Illumine, had allied himself with the Grysk agent Jixtus, which forced Crofyp to obey the Grysk's orders. The general believed Jixtus to be merely used by the Kiljis as a guide and adviser to their conquests that spread their beliefs, which he shared with the agents of Jixtus, and referred to the Grysk as a slave of the Kiljis in public. Therefore, on Jixtus' orders, Crofyp and Tildnis were sent to the Unknown Regions Rapacc system, where they were set to retrieve some refugees that Jixtus was interested in and after retrieving them, Crofyp would travel to a rendezvous point.\nDuring the Kiljis' voyage to the system, Qilori of Uandualon, the Anvil's Pathfinder navigator, stopped the war cruiser's voyage, as the Hammer was delayed in its travel across hyperspace, which annoyed Crofyp. The general was informed by Qilori that as he wanted both cruisers to arrive at the Rapacc system at the same time, they would need to wait until the Hammer arrived at their current position to continue their hyperspace voyage, and therefore arrive at Rapacc together. At some point during the voyage, Crofyp said several times that he was operating under Grysk command.\nCrofyp's task force arrived over Rapacc, where the general was confronted by the Nikardun blockade frigate Aelos—whose commander was, unbeknownst to Crofyp and Qilori, the Paccosh Uingali foar Marocsaa, an ally of the Chiss Senior Captain Mitth'raw'nuruodo \"Thrawn\". Crofyp and the Paccosh engaged in a heated discussion, and the Anvil's navigator attempted to resolve it peacefully, claiming that the Kiljis would bring glory to the Nikardun once again, which led the Kilji general to dismiss that and order Vassal Four to signal Tildnis to move Hammer past the Aelos's starboard and continue on to Rapacc.\nThe general also commanded Vassal One to do likewise with the Anvil along the frigate's portside. Additionally, if the Aelos moved to attack, Vassal Three would destroy it on Crofyp's orders. Before the orders were executed, Qilori tried to warn Crofyp that his maneuver would allow the Nikardun to deal significant damage to the Kilji force, but General Crofyp silenced him, telling him that if he continued to show him the \"darkness\" of the Pathfinders' path, the more tempted he would be to move their enlightenment to the top of the Illumine's list. The frigate did not attack, however, and instead, the Chiss heavy cruiser Springhawk arrived at the outer Rapacc system—and shot two plasma spheres at the Anvil, which would disable the warship.\nThrawn ordered Crofyp to move aside of his prey, the Aelos, and threatened the Illumine general with the destruction of his forces if he did not comply, however, the general did not accept, and instead entered a rage, performing a maneuver which moved the Anvil to face the Springhawk, showing confidence and deliberation to the Chiss. Following the maneuver's execution, the general fired at Thrawn's cruiser with spectrum laser, the now–apoplectic general told Thrawn that his name would die with him.\nBefore Crofyp could threaten Thrawn once more, the plasma spheres that Thrawn had fired previously impacted on the Anvil's aft flank, disabling all sensors and weaponry. Qilori tried to warn his enlightened commander of the incoming threat to aft, which the general dismissed. Although Crofyp attempted to prevent it with a large black weapon, the Pathfinder fled in an escape pod, fearing for his life and calling Crofyp a fool. Just after the escape pod was jettisoned, Crofyp and his war cruiser exploded with some Chiss missiles' impact.\nAfter the general's death, the Anvil's Pathfinder was retrieved by Thrawn, and Tildnis and his Hammer escaped and traveled to the planet of Sunrise, where they perished at the hands of Thrawn. Following Tildnis' failure against Thrawn—who had boarded his warship—the Chiss senior captain talked with Qilori about Crofyp, confusing the pathfinder in an attempt to have what he said told to Jixtus so he would be confused too. Thrawn informed the navigator that the Kiljis, and their generalirius were controlling Jixtus, and that the Kilji general, who had said otherwise in the pathfinder's presence, was lying so Jixtus would not be aware of that, which in fact was a lie.\nAn enlightened Kilji male, Crofyp was very xenophobic and religious, viewing the unenlightened as fools, and treating them like nothing. The general was very impatient, demanding explanations and immediate responses from his underlings, and arrogant as well, having an inflated opinion of himself and his people's capabilities.\nHe had dark brown hair, wrinkly orange skin, and was very loud. When Qilori, an unenlightened, was succesful in timing the Hammer's arrival, Crofyp was annoyed. The wishes of the unenlightened were ignored by Crofyp, who considered them of no importance. The general insulted others, such as Uingali during their confrontation, calling him a deaf unenlightened, and Qilori during their travels, calling the Pathfinder a foolish unenlightened. Crofyp's voice was rich in arrogance and anger.\nCrofyp was able to speak the Taarja trade language and the Kilji language, Crofyp could lead a task force and several individuals during a battle, which he did when he and Tildnis attempted to capture some refugees. The general was able to read computers and datacards, and also could hold large weapons and lead enlightenment operations.\nGeneral Crofyp commanded a Kilji war cruiser, the Anvil. He also attempted to use a black weapon to kill Qilori before his death.\nCrofyp appeared in the 2021 novel Thrawn Ascendancy: Lesser Evil, the final installment on the Ascendancy Trilogy written by Timothy Zahn. In the novel, he stated that he and his forces were the Kiljis, and they took what they wanted, which is also a statement used by the ruler of the Vagaari nomadic people, the Miskara, who stated that they were the Vagaari, and they took what they wanted in Zahn's 2007 novel Outbound Flight.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/18_BBY",
  "/wiki/Anvil",
  "/wiki/Rapacc_system",
  "/wiki/Kilji",
  "/wiki/Gender",
  "/wiki/Kilji_Illumine",
  "/wiki/Crofyp%27s_task_force",
  "/wiki/File:Crofyp1.ogg",
  "/wiki/Military_rank",
  "/wiki/General",
  "/wiki/Commanding_officer",
  "/wiki/Kilji_war_cruiser",
  "/wiki/Colonel",
  "/wiki/Tildnis",
  "/wiki/Kilji_picket_cruiser",
  "/wiki/Hammer_(Kilji_picket_cruiser)",
  "/wiki/Grysk",
  "/wiki/Jixtus",
  "/wiki/Generalirius",
  "/wiki/Nakirre",
  "/wiki/Attack_on_Rapacc",
  "/wiki/The_Magys%27s_people",
  "/wiki/Planet",
  "/wiki/Rapacc",
  "/wiki/Paccosh",
  "/wiki/Thief",
  "/wiki/Nikardun_blockade_frigate",
  "/wiki/Aelos",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Springhawk",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Core_name",
  "/wiki/Refugee",
  "/wiki/The_Magys",
  "/wiki/Chiss",
  "/wiki/Starship",
  "/wiki/Plasma_sphere",
  "/wiki/Spectrum_laser",
  "/wiki/Sunrise",
  "/wiki/Homeworld",
  "/wiki/Death",
  "/wiki/File:Crofyp2.ogg",
  "/wiki/Sentience",
  "/wiki/Species",
  "/wiki/Warship",
  "/wiki/Kilji_conquests_of_enlightenment",
  "/wiki/Kilji_way_of_order_and_enlightenment",
  "/wiki/Slavery",
  "/wiki/Unknown_Regions",
  "/wiki/Star_system",
  "/wiki/Qilori",
  "/wiki/Pathfinder",
  "/wiki/Navigator",
  "/wiki/Hyperspace",
  "/wiki/Cruiser",
  "/wiki/Time",
  "/wiki/Uingali_foar_Marocsaa",
  "/wiki/Vassal_Four_(Anvil)",
  "/wiki/Vassal_One_(Anvil)",
  "/wiki/Blockade_frigate",
  "/wiki/Vassal_Three",
  "/wiki/File:Crofyp3.ogg",
  "/wiki/Unidentified_maneuver_(Nakirre)",
  "/wiki/Sensor",
  "/wiki/Color",
  "/wiki/Kilji_escape_pod",
  "/wiki/Escape_pod",
  "/wiki/Breacher",
  "/wiki/Sunrise_incident",
  "/wiki/File:Crofyp4.ogg",
  "/wiki/Xenophobia",
  "/wiki/Taarja",
  "/wiki/Language",
  "/wiki/Kilji_language",
  "/wiki/Computer",
  "/wiki/Datacard",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Timothy_Zahn",
  "/wiki/Vagaari/Legends",
  "/wiki/Unidentified_Miskara_(Jorj_Car%27das)",
  "/wiki/2007",
  "/wiki/Outbound_Flight_(novel)",
  "/wiki/Category:Audio_files_of_Crofyp",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Template:LesserEvilDate"
 ]
}