{
 "name": "Crovan_Dane",
 "display_name": "Crovan Dane",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Crovan Dane was a male Human Padawan who left the Jedi Order and became a bounty hunter during the Clone Wars, a galactic conflict between the Galactic Republic and the Confederacy of Independent Systems.\nA Force-sensitive Human male, Crovan Dane was trained in the ways of the Jedi by the Jedi Order, attaining the rank of Padawan. Before completing his training, Dane abandoned his position in the Order after a confrontation with the Jedi High Council. Disillusioned, Dane left the Jedi Temple and sought transportation offworld. Piloting a ship away from Coruscant, Dane made his living as a bounty hunter during the Clone Wars.\nAround 21 BBY, he was present on Kashyyyk during the events leading up to the Battle of Akoshissss. He was trying to make a delivery of wildlife to the Separatist agent Bitt Panith when a group of Wookiees were forced onto his shuttle to be sold as slaves. His partner, Tahnchukka, a grey-furred Wookiee, did not object and helped him to smuggle the beings offworld.\nBecause of the nature of the story The Clone Wars: Decide Your Destiny: The Way of the Jedi, multiple endings are possible. In one ending, Crovan Dane is eaten by a Terentatek, while in another he makes the delivery and repays Ziro Desilijic Tiure with the cash Panith gave him. In another he takes Jedi Initiate Jaylen Kos as a partner and together they execute Jedi Master Bant Eerin's Padawan. In another he is arrested and probably killed by Ziro and Goomi or else he is injured by Goomi and rejoins the Jedi Order.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Battle_of_Akoshissss",
  "/wiki/Bitt_Panith",
  "/wiki/Wookiee/Legends",
  "/wiki/Tahnchukka",
  "/wiki/The_Clone_Wars:_Decide_Your_Destiny:_The_Way_of_the_Jedi",
  "/wiki/Terentatek/Legends",
  "/wiki/Ziro_Desilijic_Tiure/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jaylen_Kos",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Bant_Eerin/Legends",
  "/wiki/Bant_Eerin%27s_Padawan",
  "/wiki/Goomi",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Crovan_Dane"
 ]
}