{
 "name": "Crueya Vandron",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Vandron",
      "Galactic Republic",
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Crueya Vandron was the lord of House Vandron, one of the Ancient Houses of the Senex sector; additionally, he was an advisor to Supreme Chancellor Palpatine, and an important figure in the establishment of the New Order. Alongside his wife, Lady Theala Vandron, he ruled the Senex sector, an ancient domain that operated independently from the Galactic Republic.\nAfter the Senex sector finally joined the Republic during the Separatist Crisis, Vandron became an advisor to Chancellor Palpatine and a leading member of the Commission for the Protection of the Republic. When Palpatine dissolved the Republic and created the first Galactic Empire, Vandron helped shape the Commission for the Preservation of the New Order—COMPOR's successor—into a driving force in Imperial organization, alongside the likes of Ishin-Il-Raz, Ardus Kaine, and Janus Greejatus. While he was not a member of the organization personally, he provided the funding for much of its activities, and he also helped establish the Imperial Security Bureau; a Humanocentrist and a deep believer in the Empire and its key ideals, he attempted to work the idea of \"Imperial infallibility\" into the Imperial legal code around 0 BBY, but was met with stern opposition by the Justice department. By 12 ABY, Theala Vandron Jr. had assumed the leadership of House Vandron.\nCrueya Vandron was born into nobility in the Senex sector during the waning years of the Galactic Republic. He was a member of House Vandron, thought to be the oldest and most noble of the Ancient Houses of Senex-Juvex. Vandron eventually became an influential and powerful lord, and married Lady Theala Vandron. The Senex sector was an aristocracy that operated outside of the Republic, and had its own distinct laws and customs; they bred slaves, which was against the ideals of the Republic. Because of this, the Republic—under Supreme Chancellor Finis Valorum—refused to openly trade with Crueya Vandron and his fellow lords, despite the urgings of the Senex sector's inhabitants.\nIn 33 BBY, members of the Nebula Front militant group seized control of one of the planets under the rule of House Vandron, Asmeru, from the few natives who inhabited it; as Vandron and his fellow lords did not want to become prey to the Front's attacks, they allowed them to operate out of Asmeru without interference. After a fruitless attempt to assassinate Chancellor Valorum that year, Nebula Front members led by Arwen Cohl fled to Asmeru; the houses of the Senex sector, and Crueya Vandron in particular, came under immense pressure from the Republic, who accused them of granting the terrorists safe haven. Knowing that cooperation with the Republic might persuade Valorum to grant the sector trading rights, Vandron and his counterpart in House Elegin denied the accusations, but offered to help Republic forces keep the Nebula Front resistance fighters on Asmeru while the Eriadu Trade Summit took place, to prevent the terrorists from interfering there.\nAlthough the Republic was wary of working alongside slavers, they accepted Vandron's offer, sending two Consular-class cruisers and a team of thirty Judicials and several Jedi. During the mission, one of the cruisers was fired upon, though it was never learned who by; many, such as Senator Bail Antilles, suspected House Vandron was responsible, but Vandron publicly denied this. On the surface of Asmeru, the team of Jedi overstepped their bounds and attacked natives; Vandron used this as a bargaining chip against the Republic: he agreed to let the incident pass without formally objecting to the Jedi's actions in exchange for the trading rights the Senex sector so craved. With little other option, Valorum agreed to overlook their practices regarding slavery and granted them free trading with Republic states.\nEventually, sometime between the Blockade of Naboo in 32 BBY and the outbreak of the Clone Wars in 22 BBY, the Senex sector joined the Galactic Republic, at the urging of Terr Taneel, who became its first senator. Crueya Vandron became a close advisor to Chancellor Palpatine, Valorum's successor. He became interested in COMPOR—the Commission for the Protection of the Republic—which was little more than a social gathering for fanatic supporters of the Republic; Vandron, however, saw the potential to mold it into a propaganda machine. The Senex lord was appointed to monitor the group and provide it with resources.\nMidway during the Clone Wars, SAGroup, a sub-organization of COMPOR composed entirely of youths, held a massive rally in Monument Plaza on Coruscant, which garnered the attention of much of the Republic, particularly its media. However, while the rally itself was not criticized, many echelons of the media disapproved of what they viewed as Humanocentric tendencies in SAGroup; of its three thousand members, more than 95% were Human, and those select few non-Humans were all of near-Human descent. Vandron attempted to address these concerns, telling HoloNet News reporters that this was merely coincidence and that they had had many non-Human applicants, though none had been admitted.\nIn 19 BBY, Chancellor Palpatine, with the support of the Galactic Senate, dissolved the Republic and reformed it as the first Galactic Empire, named himself as Emperor, and established the New Order. Crueya Vandron retained his post as advisor, and again was tasked with making COMPOR—which had since been reformed as the Commission for the Preservation of the New Order in one of Palpatine's first acts as Emperor—into a tool and a weapon for Palpatine to wield. Vandron corresponded with Ishin-Il-Raz, head of COMPNOR's Select Committee, as to what path the organization would take; Vandron approved, and agreed to fund expansions to the Committee.\nHowever, COMPNOR was still little more than a social club for rich, Human patriots, and few regarded it as something that would make an impact on the galaxy. Vandron, however, saw potential to make it just that; although he was not officially a member of COMPNOR's Select Committee, with the backing of Emperor Palpatine he began to mold the organization as he saw fit.\nCOMPNOR still had many prominent members who were wary of Palpatine and how COMPOR had been reorganized and reshuffled, and Vandron sought to weed them out before building the organization any further. With Palpatine's aid, he removed them, one by one, not through public opposition but through guile and intrigue; eventually, Vandron and the Emperor had the opponents of COMPNOR's change wondering what exactly was different between COMPNOR as it was and how they envisioned it through a series of shrewd moves, and opposition slowly died down. Vandron provided the funding for the likes of Il-Raz, Janus Greejatus, and Ardus Kaine to shape COMPNOR, and many sub-organizations were formed to ensure every part of the Empire was being checked over. Vandron had no official capacity within the organization, but each change or new group the Select Committee wanted to form had to go through him, and by extension the Emperor, for approval. During the period between 19 BBY and the Battle of Yavin, Vandron helped form the Imperial Security Bureau to keep tabs on Armand Isard's Imperial Intelligence.\nCOMPNOR was not without its faults, though, and it constantly feuded with Imperial Intelligence; some, such as Ardus Kaine, saw this as a huge waste of time and resources and ceased having any part in COMPNOR because of it. Several years before the Battle of Yavin, the Emperor began to have many Imperial diplomats and senators whom he did not trust killed. As a way to show the galaxy's citizens that he was a benevolent and kind leader, Palpatine spoke with the children of each of the murdered delegates, telling them their parents had been killed by anti-Imperial terrorists; the children became famous on Coruscant, and in an attempt to hold them up as an example of all, Vandron insisted that the children be drafted into the newly reformed SAGroup, where they were given a vast education, with military operations, bureaucracy, and intelligence being the foremost subjects on the curriculum. Vandron's idea was at least partially unsuccessful, as one of the children, Kerri Lessev, became a top agent of the Alliance to Restore the Republic.\nSome years later, Vandron attempted to work \"Imperial infallibility\" into the Empire's legal code, but was met with great resistance from the Justice department; he had Imperial Security agents harass his opponents, and had many of them replaced with those whose loyalty he was sure of. By 12 ABY, Vandron had been replaced by Theala Vandron Jr. as the head of House Vandron.\nCrueya Vandron was an unscrupulous man, who cared little for other beings. In his native Senex sector, he funded the \"growing\" of slaves, and refused to cease doing so even at the urging of the Republic. Thus, the Jedi High Council saw Vandron and his peers as immoral, and were reluctant to work with them during the crisis involving the Nebula Front. Vandron knew how to turn things to his advantage, and was not above using methods such as blackmail to put himself where he wanted to be. Vandron was a believer in Human High Culture and in the ideals of the New Order; loyal to a fault, he gave up his lofty position in the Senex system to work for Chancellor Palpatine. Vandron believed in the Imperial way, and considered Palpatine's Empire infallible.\nCrueya Vandron was first mentioned in Greg Gorden's 1989 Imperial Sourcebook, and later in Cracken's Rebel Operatives and the second edition of the Imperial Sourcebook. In 1995, Children of the Jedi by Barbara Hambly featured an aristocratic \"House Vandron,\" though Crueya Vandron was never linked to it. In 2001, over a decade after his creation, James Luceno featured Vandron in a minor role in his novel Cloak of Deception, which was the first source to link the character to House Vandron. Several years later, Daniel Wallace and Pablo Hidalgo made reference to the character in the Republic HoloNet News Core Edition and Special Inaugural Edition.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_Vandron",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Voren_Na%27al/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Senex_sector/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Theala_Vandron",
  "/wiki/Sector/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Commission_for_the_Protection_of_the_Republic/Legends",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/Ishin-Il-Raz",
  "/wiki/Ardus_Kaine",
  "/wiki/Janus_Greejatus/Legends",
  "/wiki/Humanocentrism",
  "/wiki/0_BBY/Legends",
  "/wiki/Coalition_for_Progress/Legends#Justice",
  "/wiki/12_ABY/Legends",
  "/wiki/Theala_Vandron_Jr.",
  "/wiki/Senex-Juvex/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Finis_Valorum/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Nebula_Front/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Asmeru/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Arwen_Cohl",
  "/wiki/House_Elegin/Legends",
  "/wiki/Eriadu_Trade_Summit",
  "/wiki/Consular-class_cruiser",
  "/wiki/Judicial_Department/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Bail_Antilles/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Terr_Taneel/Legends",
  "/wiki/SAGroup_(COMPOR)/Legends",
  "/wiki/Monument_Plaza/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Non-huMan",
  "/wiki/Near-Human",
  "/wiki/HoloNet_News/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Select_Committee/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Armand_Isard/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/Sub-Adult_Group/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Kerri_Lessev/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Human_High_Culture",
  "/wiki/Greg_Gorden",
  "/wiki/1989",
  "/wiki/Imperial_Sourcebook",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/1995",
  "/wiki/Children_of_the_Jedi_(novel)",
  "/wiki/Barbara_Hambly",
  "/wiki/2001",
  "/wiki/James_Luceno",
  "/wiki/Cloak_of_Deception",
  "/wiki/Daniel_Wallace",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Republic_HoloNet_News_Core_Edition_14:9:04",
  "/wiki/Republic_HoloNet_News_Special_Inaugural_Edition_16:5:241",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_70",
  "/wiki/Star_Wars_Insider_84",
  "/wiki/Imperial_Sourcebook_(Second_Edition)",
  "/wiki/Star_Wars:_Edge_of_the_Empire_Core_Rulebook",
  "/wiki/StarWars.com",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Pentastar_Alignment",
  "/wiki/Star_Wars_Adventure_Journal_3",
  "/wiki/Interlude_at_Darkknell"
 ]
}