{
 "name": "Cruva Lenda",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Organization"
     ]
    }
   ]
  }
 ],
 "content": "Cruva Lenda was a Twi'lek who worked for the crime lord Nirama during the reign of the New Republic. In 19 ABY, Lenda and the Twi'lek Ranso Li traveled to the moon Nar Shaddaa at Nirama's behest and attended a party that was held by the Hutt Popara Anjiliac.\nCruva Lenda was a Twi'lek who lived during the era of the New Republic and was employed by the organization of Nirama, an Oblee crime lord who was based in the Cularin system. In 19 ABY, Lenda and fellow Twi'lek Ranso Li journeyed from the planet Cularin to the moon Nar Shaddaa in order to acquire some fast, used freighters for Nirama's smuggling operation. On arrival on the world, the pair attended a party that was held by the Hutt Popara Anjiliac Diresto in Popara's penthouse, to commemorate the recent rescue of Popara's son Mika by the Jedi archivist Mander Zuma and the spacers Eddey Be'ray and Reen Irana.\nDuring Popara's party, Lenda conversed with some of the other guests about the Cularin system's qualities as a tourist destination. Lenda knew how to speak Basic, Huttese, and Twi'leki. The Twi'lek wore high-quality clothing and was equipped with a blaster pistol and a datapad.\nCruva Lenda was created by Jeff Grubb and Owen K.C. Stephens, and featured in the 2002 Wizards of the Coast paperback role-playing supplement Tempest Feud. The book includes a seating plan for Popara's party, revealing that during the event, one of Nirama's Twi'lek agents sat a table with the Corporate Sector Authority representative Miltar Dolor, the Hutt Lungru and the Cerean Kir Sesad, while the other Twi'lek sat with Mika and some Bimms. However, the adventure does not stipulate which of the seating placements applied to Lenda, and which one applied to Li. The supplement also fails to identify Lenda's gender. Furthermore, Tempest Feud did not give a date to when Popara's party took place, which thus made it possible for Lenda to feature in any role-playing era. However, the 2012 novelization Scourge later established the official series of events within Star Wars Legends continuity for Tempest Feud and revealed the party to be set in 19 ABY, which made the New Republic era the period in which Lenda lived. In addition, Lenda and Li also make a possible appearance in Scourge, which mentions that two male Twi'leks were present during Popara's party, but does not give any further clarifying information with regards to their identity.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Organization",
  "/wiki/Crime_lord/Legends",
  "/wiki/Nirama",
  "/wiki/New_Republic/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Ranso_Li",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Popara_Anjiliac_Diresto",
  "/wiki/Oblee",
  "/wiki/Cularin_system",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Popara%27s_penthouse",
  "/wiki/Mika_Anjiliac_Chiera",
  "/wiki/Jedi_archivist/Legends",
  "/wiki/Mander_Zuma",
  "/wiki/Spacer/Legends",
  "/wiki/Eddey_Be%27ray",
  "/wiki/Reen_Irana",
  "/wiki/Star_system/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/Twi%27leki/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Jeff_Grubb",
  "/wiki/Owen_K.C._Stephens",
  "/wiki/2002",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Tempest_Feud",
  "/wiki/Agent/Legends",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Miltar_Dolor",
  "/wiki/Lungru_Nokko_Vimmas",
  "/wiki/Cerean/Legends",
  "/wiki/Kir_Sesad",
  "/wiki/Bimm_(furred_species)",
  "/wiki/Gender/Legends",
  "/wiki/2012",
  "/wiki/Scourge_(novel)",
  "/wiki/Recursion"
 ]
}