{
 "name": "Crys",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "\"Crys\" was the nickname of a clone trooper who served in the Grand Army of the Republic during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. In 21 BBY, Crys served under Clone Commander CC-2224 \"Cody\" and Jedi General Obi-Wan Kenobi during the Battle of Saleucami, where the trooper assisted Kenobi in tracking the Separatist General Grievous on the Outer Rim planet Saleucami. Crys's robolobotomy skills were put to use by Kenobi in the hunt for Grievous as they dismantled a battle droid to gain intelligence on Grievous's whereabouts.\n\"Crys\" was the nickname of a clone trooper who was created on the planet Kamino and was a member of the Galactic Republic's Grand Army of the Republic. During the Clone Wars between the Confederacy of Independent Systems and the Republic, the Confederacy's Supreme Commander of the Droid Army, General Grievous, escaped to the surface of the Outer Rim planet Saleucami in a C-9979 landing craft during the Battle of Saleucami in 21 BBY. As the Confederacy's general descended upon the planet, his landing craft was damaged and its crew was forced to jettison numerous escape pods, one of which included the general himself. Republic forces, including Crys—acting as a technical specialist due to his robolobotomy skills—were quickly deployed to the planet to track down the elusive general.\nAfter Republic forces landed near the crash site in an Acclamator-class assault ship, Crys accompanied Jedi General Obi-Wan Kenobi, Clone Commander CC-2224 \"Cody,\" Clone Captain CT-7567 \"Rex,\" and many other Republic troops and vehicles in the proceeding search of the planet. As Republic forces began to inspect the landing craft's crash site and failed to locate Grievous, Kenobi split his forces to investigate the landing sites of the escape pods. Crys accompanied All Terrain Tactical Enforcer walkers, Kenobi, and Cody to an escape pod and inspected a destroyed B1 battle droid for any possible intelligence before deducing that the droid was too damaged for any reliable information to be extracted. Soon after, a fellow clone trooper spotted an intact—albeit inactive—battle droid inside the escape pod, and Kenobi ordered the droid to be brought into one of the AT-TE walkers.\nInside the AT-TE walker, Crys and Cody conducted a robolobotomy, breaking through the droid's access codes and activating its guidance systems. When Kenobi later asked if the pair had found any data regarding Grievous's pod's whereabouts, the soldiers briefed him that the droid's escape pod had crashed to avoid a midair collision with another pod, the latter being the final undiscovered pod. General Grievous was proceeding from his crash site with his remaining troops towards the final intact escape pod at the same time the Republic forces pinpointed its location. The Republic and Confederacy forces engaged, with the clone forces emerging victorious. However, Grievous—the primary objective of the mission—escaped after a Sheathipede-class transport shuttle arrived over the area to extract him.\nCrys was a clone of the human male bounty hunter Jango Fett, and as such stood 1.83 meters tall. Crys also had brown eyes, tan skin, and yellow hair.\nCrys was capable of inspecting destroyed battle droids to determine whether or not they could be useful for intelligence. He also had the skill to successfully perform a robolobotomy on a B1 battle droid in field conditions on Saleucami, being able to break through the droid's access codes and initiate the droid's guidance system.\nDuring the Battle of Saleucami, Crys was equipped with a set of Phase I clone trooper armor marked with yellow designs on the breastplates and on his helmet.\nCrys appeared in \"The Deserter,\" the tenth episode of Season Two of the Star Wars: The Clone Wars animated television series. The episode premiered on January 1, 2010. Like all clone troopers in the series, Crys was voiced by Dee Bradley Baker.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Crys",
  "/wiki/Crys/Legends",
  "/wiki/Clone_trooper",
  "/wiki/Human/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Crys_Taanzer",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/File:PickItUpFromHere-TD.ogg",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/21_BBY",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Battle_of_Saleucami",
  "/wiki/Trooper",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Saleucami",
  "/wiki/Robolobotomy",
  "/wiki/B1-series_battle_droid",
  "/wiki/File:AlertTheMen-TD.ogg",
  "/wiki/Supreme_Martial_Commander_of_the_Separatist_Droid_Armies",
  "/wiki/C-9979_landing_craft",
  "/wiki/Landing_craft",
  "/wiki/Escape_pod",
  "/wiki/Republic_Military",
  "/wiki/Technician",
  "/wiki/Acclamator-class_transgalactic_military_assault_ship",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Troop",
  "/wiki/All_Terrain_Tactical_Enforcer",
  "/wiki/Walker",
  "/wiki/Droid",
  "/wiki/Battle_droid",
  "/wiki/Soldier",
  "/wiki/Time",
  "/wiki/Sheathipede-class_transport_shuttle",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/File:BrokenTheAccessCodes-TD.ogg",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/The_Deserter",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/January_1",
  "/wiki/2010",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/StarWars.com",
  "/wiki/Category:Audio_files_of_Crys",
  "/wiki/Category:Images_of_Crys",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Death",
  "/wiki/CT-411",
  "/wiki/Lethal_Trackdown",
  "/wiki/Standard_year",
  "/wiki/Encyclopedia_(StarWars.com)"
 ]
}