{
 "name": "CS-2207",
 "display_name": "CS-2207",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "501st Legion",
      "501st Legion"
     ]
    }
   ]
  }
 ],
 "content": "CS-2207, nicknamed \"Boomer,\" was a clone trooper sergeant who served in the Grand Army of the Republic during the Clone Wars.\nAn Advanced Recon Force trooper, Boomer participated in the Battle of Ryloth. Sometime after the capital city, Lessu, was liberated by the Grand Army of the Republic, Boomer, along with Captain Rex, went on an AT-RT night patrol around the city of Resdin. The clones eliminated a large number of battle droids, but were ambushed and taken captives by the famous bounty hunter, Cad Bane. Bane needed the clones alive to protect the gravity weapon, which he had stolen from the CIS, from the battle droids ordered to retrieve it. He had attached explosives to the clones' binders and promised to let them go if they co-operated with him. Rex and Boomer had no choice but to agree. They defeated several waves of droids, until Jedi Knight Anakin Skywalker and his Padawan Ahsoka Tano arrived for help, following Rex's signal. The Jedi managed to capture the Duros and ordered Boomer and Rex to disarm him. Forcing Bane to co-operate in turn, the Jedi and clone troopers decided to use his transport, The Sleight of Hand. Bane was forced to carry the weapon to the ship, while the Jedi guarded him and Rex and Boomer went ahead to clear the way for them. At the ship, the Jedi were ambushed by the Skakoan, Kul Teska, the creator of the gravity weapon, and a fight ensued, in which the Jedi were at a disadvantage until Rex and Boomer arrived for help. The clones used their weaponry against Teska and he was forced to retreat in Bane's transport, taking the gravity weapon and Bane himself with him.\nSergeant Boomer was a tough veteran soldier with a tendency to wisecracks. After having fought alongside Rex countless times, Boomer became one of Rex's most trusted soldiers and good friend. Boomer was very sarcastic and he got the job done.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:CS-2207",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Clone_trooper_sergeant",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Advanced_Recon_Force_trooper",
  "/wiki/Battle_of_Ryloth/Legends",
  "/wiki/Lessu/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/CT-7567/Legends",
  "/wiki/All_Terrain_Recon_Transport/Legends",
  "/wiki/Resdin",
  "/wiki/Battle_droid/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cad_Bane/Legends",
  "/wiki/Gravity_weapon",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Duros/Legends",
  "/wiki/The_Sleight_of_Hand",
  "/wiki/Skakoan/Legends",
  "/wiki/Kul_Teska",
  "/wiki/Category:Images_of_CS-2207",
  "/wiki/Star_Wars:_The_Clone_Wars:_Republic_Heroes",
  "/wiki/Databank_(original)"
 ]
}