{
 "name": "CT-327",
 "display_name": "CT-327",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Rishi Moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Rishi Station unit",
      "Rishi Station unit"
     ]
    }
   ]
  }
 ],
 "content": "CT-327 was a clone trooper who served as a deck officer in the Grand Army of the Galactic Republic during the Clone Wars. CT-327 was stationed on the Rishi Station, and died when Separatist BX-series droid commandos infiltrated the base in order to launch an attack on Kamino.\nCT-327 was a clone trooper born on the world of Kamino like the rest of his brethren. During the Clone Wars in 22 BBY, CT-327 was stationed on Rishi Station, a Galactic Republic outpost on the Rishi Moon, located near Kamino, as a deck officer. While the rest of the clone troopers were stationed inside the base, CT-327 was conducting his duties, and patrolling the outside area of the base, where he reported that there were no signs of activity.\nDuring CT-327's patrol of the perimeter, a meteor shower had occurred, with several meteorites crashing onto the base's deflector shield and around the base. Following the event, CT-327 used his electrobinoculars to scout the area, where he witnessed that a Droch-class boarding ship had crashed on the surface of the moon. A Separatist BX-series droid commando appeared in front of him, and caught him off-guard. CT-327 was then electrocuted and killed from behind by another BX-series commando. After CT-327's death, more BX-series droid commandos deployed from the boarding ship, and infiltrated the base. After Sergeant O'Niner, the commanding officer of the base, made several unsuccessful attempts to contact CT-327, and when Fives was not able to locate him, O'Niner ordered Droidbait and Nub to go out and find him.\nAs Droidbait and Nub were approaching a set of blast doors that led outside, the BX-series droid commandos made their entrance, and killed them, as well as Sergeant O'Niner. The remaining clones, Echo, Fives, Cutup, and Hevy, escaped through the ventilation shaft and the droid commandos were able to successfully capture the Republic base. The Separatists were driven off, however, when an inspection team consisting of Clone Commander CC-2224 \"Cody\" and Clone Captain CT-7567 \"Rex\" managed to unite with the clone survivors. The base was later destroyed by Republic forces, to alert the Republic Navy, and deny the Separatists a stepping stone for their invasion of Kamino.\nCT-327 debuted in \"Rookies,\" the 2008 episode of the first season of Star Wars: The Clone Wars. CT-327's designation number is another appearance of 327.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/CT-327",
  "/wiki/CT-327/Legends",
  "/wiki/Kamino",
  "/wiki/22_BBY",
  "/wiki/Rishi_Moon",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Rishi_Station_unit",
  "/wiki/Clone_trooper",
  "/wiki/Deck_officer",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Death",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/BX-series_droid_commando",
  "/wiki/Defense_of_Rishi_Station",
  "/wiki/Planet",
  "/wiki/Rishi_Station",
  "/wiki/Meteor_shower",
  "/wiki/Meteorite",
  "/wiki/Deflector_shield_generator",
  "/wiki/Electrobinoculars",
  "/wiki/Droch-class_boarding_ship",
  "/wiki/Moon",
  "/wiki/Clone_Sergeant",
  "/wiki/O%27Niner",
  "/wiki/CT-5555",
  "/wiki/CT-00-2010",
  "/wiki/Nub",
  "/wiki/Blast_door",
  "/wiki/Echo",
  "/wiki/CT-4040",
  "/wiki/CT-782",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Rookies",
  "/wiki/2008",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/327",
  "/wiki/Category:Images_of_CT-327",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Supply_Lines",
  "/wiki/Bombad_Jedi",
  "/wiki/Standard_year"
 ]
}