{
 "name": "CT-4860",
 "display_name": "CT-4860",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black; red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "104th Battalion",
      "104th Battalion"
     ]
    }
   ]
  }
 ],
 "content": "CT-4860, nicknamed \"Boost,\" was a clone of the bounty hunter Jango Fett who served as a clone trooper in the Grand Army of the Republic during the Clone Wars against the Confederacy of Independent Systems. He was assigned to the 104th Battalion, known as the Wolfpack, and served under Clone Commander Wolffe and Jedi Master Plo Koon. During the war, Boost served in the siege of Hisseen, and the Wolfpack was later sent to hunt down and destroy the mysterious Separatist superweapon, Malevolence, which had been destroying entire Republic fleets without leaving any survivors. When they finally confronted the Malevolence in the Abregado system, the Separatist starship used its ion cannons to cripple Plo Koon's fleet, and then destroyed the Star Destroyers. Boost was able to escape the destruction of the Venator-class Star Destroyer Triumphant in an escape pod alongside Wolffe, Plo, and Clone Sergeant Sinker.\nWhile the three clones and their general awaited rescue in the Republic escape pod, they discovered that Separatist rocket battle droids were searching through the remains of Plo's fleet and killing any survivors. After receiving word that Skywalker and his Padawan Ahsoka Tano were in the Abregado system searching for survivors in the G9 Rigger-class light freighter Twilight, Boost, Sergeant Sinker, and Plo emerged from the pod and fought off the droids trying to destroy their pod. Plo Koon told Sinker and Boost they were not expendable to him despite being clones, and then guided Tano to he and the clones location using the Force. The four survivors were brought onboard the Twilight where the medical droid TB-2 examined them. Before the freighter could escape the system, the Malevolence became aware of its presence and fired its ion cannon; however, Skywalker managed to avoid the blast and jump safely to hyperspace.\nLater in the war, Boost and the rest of the Wolfpack fought alongside Skywalker, Tano, and the 501st Legion during a battle on the planet Felucia. As part of a group led by Tano, Boost, Sinker, and Comet scaled the walls of a Separatist outpost, which was then successfully captured. During the attack Tano was captured by the Trandoshan hunter Lo-Taren, who spirited her offworld to be hunted for sport on the moon Wasskah. Under orders from Skywalker, Boost and the other clones on Felucia searched repeatedly for the missing Padawan, but eventually left after having no success.\nAfter changing from Phase I clone trooper armor to the new Phase II armor, the Wolfpack was diverted to provide aid the planet Aleen following its devastation by earthquakes. Boost and Sinker were tasked with accompanying the astromech droid R2-D2 as he downloaded instructions for using Republic tools onto the computers at the Aleen mainframe station. After Boost blasted his way into the station, R2 successfully started the download and the troopers left him to, returning to help Wolffe and the other clones in aiding the Aleena native to Aleen. R2 and the protocol droid C-3PO eventually discovered the cause of the earthquakes was an imbalance between the surface of Aleen and its underground which they managed to fix, allowing the Wolfpack to leave Aleen and return to the war.\nCT-4860, nicknamed \"Boost,\" was a clone trooper who served in the Galactic Republic. Grown on the planet Kamino from the DNA of Jango Fett, a bounty hunter who became the template of the clone trooper army, CT-4860 participated in the pan-galactic Clone Wars between the Republic and the Separatist Alliance, assigned under Clone Sergeant \"Sinker\" in the 104th Battalion, also known as the Wolfpack Battalion. The battalion was led by Clone Commander CC-3636, who was nicknamed \"Wolffe,\" and the Jedi General Plo Koon, who served on the Jedi High Council.\nEarly on in the Clone Wars, Boost was chosen by Commander Wolffe and joined by Sergeant Sinker and Comet to infiltrate the Nexus, a floating city and trading outpost. However, they were discovered by Wat Tambor, who destroyed the city. The troopers made it out and rescued a civilian.\nEarly in the Clone Wars, the Confederacy launched a siege of the planet Hisseen, so the Jedi Council sent the 104th Battalion, along with the 501st Legion and 212th Attack Battalion, to defeat the Confederacy military. During the siege, clone troopers protected a a village from battle droids before being reinforced by Jedi Generals Plo Koon, Anakin Skywalker, and Obi-Wan Kenobi. The Jedi would go onto pursue Count Dooku and Dark Acolyte Asajj Ventress, but, when the clones were fighting a second wave of droids, Boost received a transmission from Plo, who was asking for Commander Wolffe, that was unable to come in clearly. After Clone Captain CT-7567 \"Rex\" asked what was happening, Boost explained he did not know what Plo was saying but that they needed to get the hologram to Wolffe, as it seemed that Plo was in trouble.\nAfter a new Separatist mystery weapon destroyed several Republic fleets without leaving any survivors, Plo Koon and the Wolfpack were assigned to track down the vessel and destroy it. Traveling onboard the Venator-class Star Destroyer Triumphant along with a fleet of two other Venator-class Star Destroyers, they discovered the weapon, a Subjugator-class heavy cruiser named Malevolence, in the Abregado system. After Plo Koon contacted the Skywalker's fleet and informed him of the location of the Malevolence, the Separatists blocked the Triumphant's communications, and opened fire with the Malevolence's ion cannon, which crippled the three Republic Star Destroyers and left them defenseless. Knowing the Triumphant would not last long under fire without its shields, Plo ordered that all personnel onboard evacuate in the ship's escape pods. Boost followed the order, and ended up sharing a pod with Master Plo and his fellow Wolfpack members Sinker and Commander. Their pod launched from the Triumphant moments before it was destroyed by fire from the Malevolence.\nAlthough they had survived the destruction of their ship, Boost and his comrades found themselves without power in the escape pod, meaning that there was no life support system in the pod. Plo Koon ordered that the clones try and repair the power systems, which Sinker began doing while Boost watched. The air in the ship quickly became stale, and Boost and Sinker began bickering over the cause of the smell until Wolffe interrupted by asking what Master Plo truly thought their chances were. After the Jedi Master reassured them that someone would come for them, Sinker pointed out that a rescue mission would not make sense. The four then spotted a second escape pod through their viewport, which Plo Koon span using the Force so that they could see inside. The clones were horrified to see their comrades on board the other pod were dead, as the viewport had been cut open to expose the occupants to the vacuum of space. The clones returned to their repairs, and after more bickering, Boost and Sinker finally managed to return some power to the pod. As the communications systems reactivated, the four survivors were contacted by Pod 1977, another pod of clones who had survived the attack by the Malevolence, but were now being attacked by a Separatist vessel. After Wolffe spotted the other pod, he, Boost, Sinker and Plo could do nothing by watch in horror as rocket battle droids cut open Pod 1977, killing all inside.\nAfter finishing their work on 1977, the droids quickly spotted the pod containing Boost and his comrades and the Separatist boarding craft was soon headed their way. Plo quickly ordered the clones to put on their helmets, so that they could attempt to defend themselves. Boost and Sinker obeyed and exited the escape pod with Plo, while Wolffe remained inside to monitor the communications in hope of rescue. As Boost and Sinker opened fire on the Separatists, Plo used the Force to push some of them away into space. Just at the Separatist vessel began to crush the escape pod with its attachment arms, Wolffe picked up communications from Skywalker and his Padawan Ahsoka Tano, who had traveled to the Abreadgo system in the G9 Rigger-class light freighter Twilight looking for survivors. As Wolffe tried to make contact, Plo launched Sinker into space using the force and maneuvered him behind the Separatist vessel, allowing him shoot down the droids that had been taking cover behind it. No longer under fire, the Jedi Master sliced through the attachment arms with his lightsaber, saving the pod and sending the Separatist boarding craft spinning away into debris, where it was destroyed by a collision.\nAfter Plo had returned Sinker back safely to the escape pod, he and the two clones hung to the outside of the pod as Sinker admitted he had never really believed anyone would save them. Plo then reached out through the Force to Tano, who sensed his presence and piloted the Twilight to his location. As Plo reassured Sinker that clones were not as expendable as he believed, the Twilight arrived and pulled the survivor's pod aboard with a tow cable. Once onboard, the clones and Plo collapsed, and were examined by Skywalker's medical droid TB-2 who declared that they would need to recover on a medical frigate after he stabilized them. Skywalker informed Plo that they had found no other survivors, making Wolffe, Sinker, and Boost the last surviving members of the Wolfpack. As the Twilight made to leave the Abraedgo system, the Malevolence approached again and Plo demanded that Skywalker cut all power to the freighter to avoid detection. Realizing the lights had gone out, Boost, Sinker, and Wolffe attempted to head to the bridge to find out what was wrong, but TB-2 stopped them and went in their place. Realizing that the medical droid still had power, the three Jedi quickly learned they had been detected and switched the power back on, sending TB-2 back to the clones. The Malevolence then fired its ion cannon, but the Twilight was able to outrun it and then jump to hyperspace, escaping the Separatists. Skywalker and Tano safely delivered their four passengers to Skywalker's flagship, the Resolute. Skywalker and Tano later managed to track down and destroy the Malevolence.\nLater in the Clone Wars, after Boost and Sinker had recovered from their encounter with the Malevolence, Master Plo and the Wolfpack participated in a battle against Separatist forces on the planet Felucia alongside Skywalker, Tano and the 501st Legion. The Republic forces attacked a recently reinforced Separatist outpost, splitting into three groups for the assault. Boost, Sinker, Comet and several other members of the Wolfpack split off with Tano and scaled the side of the outposts walls using grappling hooks, after shooting down the B1-series battle droid sentries stationed there. All of the clones successfully made it over the wall and began their attack, but before Tano could scale the wall herself she was stunned and captured by the Trandoshan hunter Lo-Taren. The Republic forces quickly destroyed the Separatist forces holding the outpost, not realizing Tano was gone until the battle was over. Skywalker then ordered Boost and the other clones to spread out and look for his missing Padawan, but to no avail. After dozens of unsuccessful sweeps of the area in search of Tano, Koon eventually persuaded Skywalker to stop looking, promising that alerts had been sent out and the missing Jedi would be found soon. Tano, who had been taken to the moon of Wasskah to be hunted for sport by the Trandoshans, eventually escaped with the aid of the several Wookiees and returned to the Republic.\nWhile traveling in an Acclamator-class transgalactic military assault ship to the Qiilura system to block Separatist transmissions, the Wolfpack were diverted to provide aid to the inhabitants of the planet Aleen, which had been devastated by earthquakes. Finding that thousands of the native Aleena had survived, the clones were tasked with helping to start the rebuilding process and then returning to the war. Sinker and Boost traveled to the planet's surface onboard one of the Plo's Bros Low Altitude Assault Transports/infantry which was piloted by the clone trooper pilot Warthog and also carried several other clones, crates of supplies and the droids R2-D2 and C-3PO. After disembarking, the Republic forces were greeted by the Aleena but quickly experienced an aftershock from the quakes. Wolffe ordered Sinker to take Boost and the rest of the squad, along with R2, to the Aleena's mainframe station in order to get it back online and allow R2 to upload the instructions for how to use the equipment being donated by the Republic.\nSeveral Aleena guided the clones to the station, and upon reaching the door signaled that it was blocked with rubble. Boost made to shoot through the rubble with his blaster, but was stopped by Sinker, who thought the shooting might cause the station to collapse. Unperturbed, Boost blasted the rubble apart, greatly impressing the Aleena present. Inside the station, Sinker had R2 scan the building to check it was safe, and then had the droid activate the computer and begin the download. After another small aftershock hit the station, Sinker reported into Wolffe that the download was underway and the Commander ordered Sinker, Boost, and the rest of the clones to return to aiding the Aleena, leaving R2 to complete the download. On the way out the station, Sinker barged into C-3PO, who Boost ordered out of the way as the droid tried to pass. C-3PO and R2 entered Aleen's underground, where they found that the cause of the earthquakes was a breach had opened between the underground and the surface. They then sealed the opening and restored the balance on Aleen, ending the earthquakes. Having completed their mission and helped the Aleena, Boost and the rest of the Wolfpack left Aleen to resume their mission.\nBoost then participated in the Battle of Kadavo along with the rest of the 104th, launching an aerial assault on the Kadavo slave processing facility that held multiple Togruta and Republic hostages. As a result, the Zygerrian Slave Empire's forces launched their HH-87 Starhoppers and fought in starfighter combat against the Republic Clone Z-95 Headhunters. During the engagement, Boost destroyed at least one Starhopper.\nNearly twenty years after the end of the Clone Wars, Wolffe and former clone commando Gregor fought in the Liberation of Lothal from the Galactic Empire. During the conflict, Lothal's native loth-wolves joined the fight against Imperial forces. Observing the similarity between the wolves and the \"Wolfpack\" nickname for his squad in the 104th Battalion, Gregor commented that Wolffe had his Wolfpack back. Wolffe responded that they fought just like Boost and his other men.\nLike most clone troopers, Boost stood 1.83 meters tall, with brown eyes, tanned skin and naturally black hair. He chose to dye his hair red and wore it shaved into two strips on top of his head. While stuck in an escape pod with Sinker he bickered regularly with the other clone while they tried to repair the vessel. During the bickering, Sinker claimed that Boost only bathed while on leave, and so was likely the cause of the stale air in the pod. On Aleen, when Sinker tried to stop Boost shooting through a pile of rubble, he complained that the Sergeant worried too much and fired anyway.\nAlthough a clone trooper, Boost had piloting skills and was capable of operating a Clone Z-95 Headhunter.\nDuring both his encounter with the Malevolence and the battle of Felucia, Boost wore Phase I clone trooper armor and used a DC-15A blaster carbine in combat, also using a grappling hook on Felucia. His armor, like many other members of the Wolfpack, was decorated with a stylized wolf muzzle on the helmet and purple patterning across all pieces. By the time of the mercy mission to Aleen, Boost had changed to wearing Phase II clone trooper armor along with most other clone troopers. His Phase II armor bore the wolf's head and gray colors shared by all of the Wolfpack, but was personalized with ragged gray markings under the eyes of his helmet.\nBoost first appeared in \"Rising Malevolence,\" the second episode of the first season of the Star Wars: The Clone Wars television series. In the episode, which aired in 2008, Boost was voiced by Dee Bradley Baker, who also provided the voices for all other clone troopers in the series. The clone went onto to make two further appearances in The Clone Wars, the first in \"Padawan Lost,\" the twenty first episode of The Clone Wars: Season Three, and the second in \"Mercy Mission,\" the fifth episode of The Clone Wars: Season Four, both of which aired in 2011.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/CT-4860",
  "/wiki/Boost/Legends",
  "/wiki/Template:Image",
  "/wiki/Template:Cleanup",
  "/wiki/Template:Update",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales_2",
  "/wiki/Talk:CT-4860",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/104th_Battalion",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Clone_Commander",
  "/wiki/Wolffe",
  "/wiki/Jedi_Master",
  "/wiki/Plo_Koon",
  "/wiki/Siege_of_Hisseen",
  "/wiki/Superweapon",
  "/wiki/Malevolence",
  "/wiki/Death",
  "/wiki/Fleet",
  "/wiki/Battle_of_Abregado",
  "/wiki/Abregado_system",
  "/wiki/Starship",
  "/wiki/Ion_cannon",
  "/wiki/Plo_Koon%27s_fleet",
  "/wiki/Star_Destroyer",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Triumphant",
  "/wiki/Escape_pod",
  "/wiki/Clone_Sergeant",
  "/wiki/Sinker",
  "/wiki/General",
  "/wiki/Republic_escape_pod",
  "/wiki/B1-series_rocket_battle_droid",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Star_system",
  "/wiki/G9_Rigger-class_light_freighter",
  "/wiki/Twilight",
  "/wiki/Sergeant",
  "/wiki/Droid",
  "/wiki/The_Force",
  "/wiki/Medical_droid",
  "/wiki/TB-2",
  "/wiki/Freighter",
  "/wiki/Hyperspace",
  "/wiki/501st_Legion",
  "/wiki/Second_Battle_of_Felucia",
  "/wiki/Planet",
  "/wiki/Felucia",
  "/wiki/Comet_(clone_trooper)",
  "/wiki/Separatist_outpost_(Felucia)",
  "/wiki/Trandoshan",
  "/wiki/Lo-Taren",
  "/wiki/Moon",
  "/wiki/Wasskah",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Aleen",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Aleen_mainframe_station/Legends",
  "/wiki/Aleena",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Reproduction",
  "/wiki/DNA",
  "/wiki/Clone_template",
  "/wiki/Army",
  "/wiki/The_galaxy",
  "/wiki/Battalion",
  "/wiki/Jedi_General",
  "/wiki/Jedi_High_Council",
  "/wiki/Nexus",
  "/wiki/Wat_Tambor",
  "/wiki/Orkle",
  "/wiki/Hisseen",
  "/wiki/Jedi",
  "/wiki/212th_Attack_Battalion",
  "/wiki/Confederacy_military",
  "/wiki/Unidentified_village_(Hisseen)",
  "/wiki/Battle_droid",
  "/wiki/Anakin_Skywalker",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Dark_Acolyte",
  "/wiki/Asajj_Ventress",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Hologram",
  "/wiki/Subjugator-class_heavy_cruiser",
  "/wiki/Skywalker%27s_fleet",
  "/wiki/Deflector_shield",
  "/wiki/Commander",
  "/wiki/Viewport",
  "/wiki/Telekinesis",
  "/wiki/Realspace",
  "/wiki/Pod_1977",
  "/wiki/Lightsaber",
  "/wiki/Frigate",
  "/wiki/Resolute",
  "/wiki/Battle_of_the_Kaliida_Nebula",
  "/wiki/Legion",
  "/wiki/Grappling_hook",
  "/wiki/B1-series_battle_droid",
  "/wiki/Wookiee",
  "/wiki/Acclamator-class_transgalactic_military_assault_ship",
  "/wiki/Qiilura_system",
  "/wiki/Plo%27s_Bros",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Clone_trooper_pilot",
  "/wiki/Warthog",
  "/wiki/Blaster",
  "/wiki/Battle_of_Kadavo",
  "/wiki/Kadavo_slave_processing_facility",
  "/wiki/Togruta",
  "/wiki/Zygerrian_Slave_Empire",
  "/wiki/HH-87_Starhopper",
  "/wiki/Starfighter_combat",
  "/wiki/Clone_Z-95_Headhunter",
  "/wiki/Loth-wolf",
  "/wiki/Stormtrooper",
  "/wiki/File:WolfPackBack-AFH.ogg",
  "/wiki/Standard_year",
  "/wiki/Clone_commando",
  "/wiki/Gregor",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Galactic_Empire",
  "/wiki/Hair",
  "/wiki/Pilot",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Armor",
  "/wiki/Wolf",
  "/wiki/Clone_trooper_armor",
  "/wiki/Eye",
  "/wiki/Rising_Malevolence",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/2008",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Padawan_Lost",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Mercy_Mission_(episode)",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/2011",
  "/wiki/Category:Images_of_Boost",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales_1",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/Star_Wars_Rebels",
  "/wiki/A_Fool%27s_Hope",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_53",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/LAAT/i_Gunship_Expansion_Pack",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Clone_Wars_Begin",
  "/wiki/Clone_Z-95_Headhunter_Expansion_Pack",
  "/wiki/Databank_(website)",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Time",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Christophsis",
  "/wiki/Geonosis",
  "/wiki/Destroy_Malevolence",
  "/wiki/Wookiee_Hunt",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Battle_of_Jakku",
  "/wiki/Galactic_Civil_War",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/5_ABY",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/0_BBY",
  "/wiki/Wolves_and_a_Door",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/19_BBY"
 ]
}