{
 "name": "CT-4981",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Shadow Squadron",
      "Shadow Squadron"
     ]
    }
   ]
  }
 ],
 "content": "CT-4981, also known by the nickname \"Contrail,\" was a clone trooper pilot in the Grand Army of the Republic during the Clone Wars. He flew under the callsign \"Shadow Eleven\" as part of Shadow Squadron during the Clone Wars. Piloting a Y-wing starfighter, he participated in the Battle of the Kaliida Nebula, helping to cripple General Grievous's flagship, the Subjugator-class heavy cruiser Malevolence. He piloted an Alpha-3 Nimbus-class V-wing starfighter at the Battle of Coruscant, during which he defended the Federal District.\nA clone of the infamous bounty hunter Jango Fett, CT-4981 was bred on the planet Kamino to serve in the Grand Army of the Republic as a clone trooper pilot. During the Clone Wars, he was assigned to Shadow Squadron, a squadron renowned for their effectiveness in combat and low casualties, and adopted the callsign Shadow Eleven.\nFollowing the disastrous Battle of Abregado, Shadow Squadron was assembled on the flight deck of the Venator-class Star Destroyer Resolute, where CT-4981 and the rest of his squadron were briefed by Jedi General Anakin Skywalker on their attack on the Subjugator-class heavy cruiser Malevolence. The flagship of General Grievous, the leader of the Separatist Droid Army, the cruiser was responsible for the destruction of dozens of Republic task forces, including Jedi Master Plo Koon's fleet in the Abregado system. The Jedi Knight explained that, although the Republic Navy's capital ships were vulnerable to the Malevolence's weapons systems, he believed that a squadron of bombers could outmaneuver the ship's ion cannons and destroy the heavy cruiser's bridge, hoping to kill Grievous and bring down the ship. Skywalker then ordered Shadow Squadron to prepare their Y-wing starfighters for the attack.\nAs Shadow Squadron was preparing to depart the Resolute, Admiral Wullf Yularen received reports that the Malevolence had attacked a convoy of medical transports in the Ryndellia system, which was home to the Republic's secret Outer Rim medical station, Kaliida Shoals Medical Center. Skywalker predicted that the space station would be Grievous's next target.\nCT-4981 was still a pilot in Shadow Squadron during the Battle of Coruscant, though by that point the squadron had been upgraded to piloting Alpha-3 Nimbus-class V-wing starfighters. During the battle, he defended the Federal District.\nA clone of the human male Jango Fett, Shadow Eleven was 1.83 meters tall. He had tan skin, brown eyes, and black hair. Shadow Eleven was a skilled pilot, and was able to successfully navigate through the Kaliida Nebula while only losing his astromech droid. During the Battle of the Kaliida Nebula, he was able to evade the EMP blast that disabled half of his squadron, and survived the bombing run that resulted in the destruction of the Malevolence's ion cannons and crippling of the heavy cruiser.\nShadow Eleven wore Phase I clone trooper armor with a flight helmet that was covered in gray markings. During the Battle of the Kaliida Nebula, he piloted a Y-wing starfighter.. Near the end of the war, he piloted a Alpha-3 Nimbus-class V-wing starfighter during the Battle of Coruscant.\nShadow Eleven first appeared in Shadow of Malevolence, the third episode of the canon animated series Star Wars: The Clone Wars' first season. Like all clone troopers in the show, Shadow Eleven was voiced by Dee Bradley Baker.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/CT-4981",
  "/wiki/CT-4981/Legends",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Shadow_Squadron",
  "/wiki/Clone_trooper_pilot",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Callsign",
  "/wiki/Pilot",
  "/wiki/BTL_Y-wing_starfighter",
  "/wiki/Battle_of_the_Kaliida_Nebula",
  "/wiki/Kaliida_Nebula",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Flagship",
  "/wiki/Subjugator-class_heavy_cruiser",
  "/wiki/Malevolence",
  "/wiki/Alpha-3_Nimbus-class_V-wing_starfighter",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Federal_District",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Planet",
  "/wiki/Squadron",
  "/wiki/Battle_of_Abregado",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Resolute",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Supreme_Martial_Commander_of_the_Separatist_Droid_Armies",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Jedi_Master",
  "/wiki/Plo_Koon",
  "/wiki/Fleet",
  "/wiki/Abregado_system",
  "/wiki/Jedi_Knight",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Capital_ship",
  "/wiki/Bomber",
  "/wiki/Ion_cannon",
  "/wiki/Heavy_cruiser",
  "/wiki/Bridge_(starship)",
  "/wiki/Death",
  "/wiki/Admiral",
  "/wiki/Wullf_Yularen",
  "/wiki/Battle_of_the_Ryndellia_system",
  "/wiki/Ryndellia_system",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Space_station",
  "/wiki/Kaliida_Shoals_Medical_Center",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Flight_helmet",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Category:Images_of_CT-4981",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Convergence_(Star_Wars:_Destiny)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Nimbus-class_V-Wing_Expansion_Pack",
  "/wiki/Databank_(website)",
  "/wiki/Rising_Malevolence"
 ]
}