{
 "name": "CT-55/11-9009",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Starfighter Corps",
      "Republic Starfighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "CT-55/11-9009, nicknamed \"Jag,\" was a clone trooper captain and pilot, who flew as Jedi General Plo Koon's wingman in the final hours of the Clone Wars. Born on the planet Kamino as a clone of the bounty hunter Jango Fett, Jag was trained to fight for the Galactic Republic as a part of its navy. In 19 BBY, Jag fought alongside Plo Koon and the 442nd Siege Battalion to capture Cato Neimoidia, in his ARC-170 starfighter. After successfully defeating Separatist forces occupying the planet, Jag was issued Order 66 by Supreme Chancellor Sheev Palpatine, who was secretly the Sith Lord Darth Sidious. Without hesitation, Jag opened fire on Koon's Delta-7 Aethersprite-class light interceptor, killing the Jedi Master and fulfilling his part in the Great Jedi Purge.\nCT-55/11-9009, a clone trooper who adopted the nickname \"Jag,\" was born on the planet Kamino as a clone of the infamous bounty hunter Jango Fett. He was inducted into the clone trooper pilot program due to his favorable reflexes and spatial awareness, and went on to serve the Galactic Republic's navy during the Clone Wars. At some point, he acquired the rank of Clone Captain.\nIn the year 19 BBY, Jag served as Jedi General and council-member Plo Koon's wingman, during the Republic's effort to capture the Trade Federation stronghold world of Cato Neimoidia. With help from the 442nd Siege Battalion, Koon and Jag were victorious in their mission. After the battle, CT-55/11-9009 and Koon surveyed the planet's skies on a patrol flight, in the safety of their starships' cockpits. From within his ARC-170 starfighter, Jag received a transmission from a cloaked Supreme Chancellor Sheev Palpatine, who was actually the Sith Lord and Master Darth Sidious. Palpatine issued Order 66 to the clone captain, which triggered the secret behavioral modification biochip planted in Jag's brain, compelling him to kill his Jedi General. Jag complied with the order and opened fire on Koon's Delta-7 Aethersprite-class light interceptor, killing the Jedi and causing the remains of his ship to plummet into one of the planet's many bridge cities below. On the planet Kaller, young Padawan Caleb Dume witnessed Jag's betrayal through the Force, moments before his own clone troopers opened fire on him and his master. Jag's actions contributed to the galaxy-wide Great Jedi Purge, a genocide that left the Jedi Order almost completely destroyed.\nJag was a human male clone of the bounty hunter Jango Fett, who stood at 1.83 meters tall. He had black hair, brown eyes, and tan skin. His good sense of spatial awareness and reflexes led him to be trained as a clone trooper pilot. Like almost all clone troopers, he executed Order 66 without hesitation, due to the control chip secretly embedded in his brain.\nJag wore a standard phase II clone trooper pilot flight suit, adorned by blue markings. He piloted an ARC-170 Starfighter during the capture of Cato Neimoidia.\nJag first appeared, albeit unnamed, in the 2005 Star Wars saga film, Star Wars: Episode III Revenge of the Sith. In the film, he was portrayed by Temuera Morrison, who also played all other mature clone trooper characters in the live-action films. For the role, Morrison wore a blue bodysuit that was later digitally replaced by a computer-generated flight suit. Jag was later identified by his nickname in the 2015 reference book Star Wars: Absolutely Everything You Need to Know. His clone designation in Legends, CT-55/11-9009, was confirmed to be canon in the ARC-170 Starfighter Expansion Pack for Star Wars: X-Wing Second Edition.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/CT-55/11-9009",
  "/wiki/CT-55/11-9009/Legends",
  "/wiki/Jag_(disambiguation)",
  "/wiki/CT-55/Legends",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_Starfighter_Corps",
  "/wiki/Plo_Koon",
  "/wiki/File:Jag-ItwillbedoneMyLord.ogg",
  "/wiki/Clone_trooper",
  "/wiki/Clone_Captain",
  "/wiki/Clone_trooper_pilot",
  "/wiki/Jedi_General",
  "/wiki/Wingmate",
  "/wiki/Standard_hour",
  "/wiki/Clone_Wars",
  "/wiki/Planet",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/19_BBY",
  "/wiki/442nd_Siege_Battalion",
  "/wiki/Battle_of_Cato_Neimoidia",
  "/wiki/Cato_Neimoidia",
  "/wiki/Aggressive_ReConnaissance-170_starfighter",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Order_66",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_Lord",
  "/wiki/Delta-7_Aethersprite-class_light_interceptor",
  "/wiki/Death",
  "/wiki/Jedi_Master",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Military_rank",
  "/wiki/Jedi_High_Council",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Trade_Federation",
  "/wiki/Starship",
  "/wiki/Cockpit",
  "/wiki/Sith_Master",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Jedi",
  "/wiki/General",
  "/wiki/Bridge_city",
  "/wiki/Kaller",
  "/wiki/Padawan",
  "/wiki/Kanan_Jarrus",
  "/wiki/Force_vision",
  "/wiki/The_Force",
  "/wiki/Depa_Billaba%27s_second_battalion",
  "/wiki/Depa_Billaba",
  "/wiki/Jedi_Order",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Flight_suit",
  "/wiki/Pilot",
  "/wiki/2005",
  "/wiki/Star_Wars_saga",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Temuera_Morrison",
  "/wiki/2015",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/ARC-170_Starfighter_Expansion_Pack",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Kanan_2",
  "/wiki/Category:Images_of_CT-55/11-9009",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_40",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/October_6",
  "/wiki/2016",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Orders"
 ]
}