{
 "name": "CT-782",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Rishi Moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Domino Squad",
      "Rishi Station unit",
      "Domino Squad",
      "Rishi Station unit"
     ]
    }
   ]
  }
 ],
 "content": "CT-782, nicknamed \"Hevy\" due to his expertise in the use of heavy weapons, was a clone trooper who served in the Grand Army of the Republic during the Clone Wars. Bred from the genetic template of the bounty hunter Jango Fett, Hevy trained on the planet Kamino as a clone cadet of Domino Squad. After completing his training, Hevy was deployed to the Rishi Moon which was noted for its strategic location near the Kamino system. Seeking to destroy the facilities that supplied the Republic Military with clones, the Confederacy of Independent Systems attacked the Rishi outpost with commando battle droids, putting Hevy and his squad on the defensive. Aided by Clone Commander CC-2224, \"Cody,\" and Clone Captain CT-7567, \"Rex,\" they attempted to retake Rishi Station but were outnumbered and outgunned. Armed with a Z-6 rotary blaster cannon, Hevy confronted the Separatists alone, destroying dozens of battle droids before falling to enemy blaster fire. Wounded but alive, Hevy triggered several explosives, destroying the station, and thereby sacrificed his life to alert the Galactic Republic to the Separatist presence on the moon, ultimately delaying the Confederacy's invasion of Kamino.\nCT-782 was a clone trooper who was given the nickname Hevy due to being a heavy weapons expert and training to use such weapons, including the Z-6 rotary blaster cannon. Along with all other clone troopers made for the Galactic Republic, Hevy was created on the planet Kamino. He served in the Grand Army of the Republic's Domino Squad, a unit of clone cadets during the early days of the Clone Wars. His fellow squad members were Cutup, Echo, Fives, and Droidbait.\nThe Domino Squad members were trained at Tipoca City, Kamino's capital, under Master Chief Bric, fellow Arcona bounty hunter El-Les, and Jedi Master Shaak Ti oversaw the clone cadets practice for their final test, the Citadel Challenge. The test placed the squad head-to-head with training battle droids. While the battle droids' blasters, as well as their own weapons, were non-lethal, clones could be injured during tests. Despite this, all clone cadet squads had to work as a team to successfully pass their test. For CT-782 and Domino Squad, however, the team rarely got along with each other.\nDuring the final practice test, Domino Squad were engaging droids when CT-782 broke away from the group. Watching the group, Bric, El-Les, and Shaak Ti took concern of Domino's Squad's recklessness. Bric expressed the group's inability to work as a team and wanted to send them to Tipoca City's maintenance crew, which was where rejected clones went. As the combat simulation progressed, CT-782 kept disobeying orders and assumed the squad's leadership as his own. However, the droid forces began to overwhelm the clones, causing the squad to fail. With their practice test a failure, the crestfallen Domino Squad returned to their sleeping barracks. Once there, CT-782 took off his training helmet and threw it on the ground in frustration. He then told his squad members that he was getting the job done because he was \"thinking like an ARC trooper.\"\nWhen Echo, who had a bad habit of repeating orders after they were already given, reminded him that ARC troopers follow orders, CT-782 mocked him by asking Echo to repeat himself. The two engaged in a brief hand-to-hand brawl until the fight was broken up by Bric. Bric berated the cadets by stating that they might stand a chance out in the field if they started fighting droids as much as they fought each other. Echo immediately acknowledged his Master Chief and apologized. CT-782, however, was not so easily intimidated. He then expressed his opinion on having a Jedi oversee his training instead of a paid mercenary bounty hunter. Bric harshly reminded the clone that Jedi didn't have the time to train cadets like him. The bounty hunter then told the whole squad that since they could not work together as a team, they were all a waste of his time.\nThe next day, Bric and El-Les rallied Domino Squad, as well as other clone cadet squads, for a meeting on a hangar platform. A few ARC troopers, led by Clone Commander Colt, followed by Havoc and Blitz were to watch the clone cadet's final simulator test. If one passed the Citadel Challenge, the troopers within the squad would become battle-ready clone soldiers. Colt took interest with Bravo Squad, a unit of clone cadets that passed their tests in \"ARC trooper time.\" CT-782 and Domino Squad watched as the Bravo Squad passed the simulation with flying colors. Unimpressed, CT-782 claimed that they were better than Bravo Squad. When the simulator began for Domino Squad, they managed to pass certain parts of the simulation faster than their usual rate. As the other clones were taking cover, CT-782 cleared a path for them by destroying droids with his Z-6 rotary blaster cannon. When Droidbait broke away from the rest of the squad, a droid shot him in the back. Cutup noticed this and yelled for CT-782. But the clone wanted to leave his injured teammate behind and head for the citadel. Colt and El-Les noticed squad leaving Droidbait, which forced them to stop the simulation test, causing CT-782 and Domino Squad to automatically fail the test.\nThat night CT-782 attempted to leave the clone army after his team failed to pass the final test. Before he could, however, he was approached by 99, a malformed maintenance clone whom the group had befriended. The deformed clone told CT-782 that, despite the clone cadet's differences, he should work together with his team. 99 told him that since he was never given a chance to prove himself worthy as a clone trooper, CT-782 would be unwise to throw away his chance. Throughout the conversation, 99 called CT-782 \"Hevy.\" Confused at his broken brother calling him by an actual name, CT-782 angrily told 99 to stop calling him \"Hevy.\" To CT-782, all clones were numbers and never had actual names. 99 disagreed, expressing that CT-782 always had a name.\nShaak Ti allowed Domino Squad to retake the test since she and El-Les believed in them. When the squad got ready the next day, CT-782 was not among them. Worried that without their fellow teammate they will fail again, CT-782 showed up. He then told Domino Squad that this time they will pass and that his name was now Hevy.\nBric joined Shaak Ti and El-Les to watch the newly named Hevy and Domino Squad participate in the simulation test for the last time. This time, however, Domino Squad got further into the test. When Hevy, Echo, Fives, Cutup, and Droidbait reached the bottom of the citadel, they noticed that their ascension cables in their belts was missing. Before the test, Bric took the cables from their belts to challenge the cadets. Yet, the clones improvised and decided to climb the blasters that ascended up toward the citadel's roof. Hevy successfully climbed the turrets and lifted the pole on top of the citadel, completing the test. Bric was very surprised at their sudden improvement. Due to them working as a team and completing their final test, Hevy and the rest of Domino Squad were allowed to become clone troopers.\nThey each received their own medals, as a symbol of their graduation from clone cadet. Hevy then thanked 99 for giving him the help he needed, which ultimately brought Domino Squad together. 99 then complemented Hevy on his leadership. But Hevy reminded 99 that they were all a team and told 99 how lucky he was to have a brother like him. As they said goodbye, Hevy assured 99 that they will see each other again while proceeding to give 99 his medal.\nAfter his training on Kamino, Hevy was given his first off-world assignment. Along with Echo, Cutup, Droidbait, and Fives he was stationed at the listening post Rishi Station located on a moon off the planet Rishi, under command of Clone Sergeant O'Niner. Also stationed was clone trooper Nub. As part of their assignments, they maintained the listening post to warn the Galactic Republic of any impending Separatist attacks on Kamino. Hevy was disappointed that his first assignment was not on the actual battlefield. He usually passed the time by arm wrestling with Cutup or Fives. While Hevy and the rookie troopers were on duty in the control room, Sergeant O'Niner entered the room and alerted the clone troopers of an inspection that would soon begin. Unbeknownst to the group of clone troopers, however, Confederate General Grievous had sent BX-series droid commandos in Droch-class boarding ships to attack the listening post.\nGrievous, along with the assassin Asajj Ventress, intended to invade Kamino to end the production of the Republic's clone troopers. The Republic listening post on the moon of Rishi had an \"all clear signal,\" which, if turned off, would alert a nearby Republic fleet, so Grievous ordered his droids to leave the signal untouched. Meanwhile, the clone were alerted by a meteor shower that was approaching. To protect the base, the clones raised the listening post's shield. The meteor shower, in reality, was several Separatist boarding ships used by the commando droids. The droids left their transports and began their attack on the base. In the command center, the clones tried to contact the deck officer, clone trooper CT-327, but were unable to reach him, as CT-327 had already been killed by the commando droids. O'Niner ordered Droidbait and Nub to search for him. However, the two clones encountered the droids at the base's entrance and were fired upon. Alerted to the droid's presence, O'Niner ordered Hevy, to sound the listening post's alarm, but he soon found that the droids had deactivated the beacon.\nAfter the commando droids shot and killed O'Niner, the remaining clone troopers- Hevy, Echo, Fives, and Cutup- evacuated the command center by going through the ventilation shaft, which led them outside the listening post. Exiting the ventilation shaft, the four troops, who already felt helpless without their commanding sergeant, were further disheartened when a Rishi eel attacked and devoured Cutup, leaving Hevy, Echo, and Fives to defend themselves.\nEventually, the remaining rookie clone troopers noticed a Nu-class attack/transport shuttle, flown by Clone Commander Cody and Clone Captain Rex. The clone officers had arrived for the inspection of the listening post but were unaware of the droid attack. Hevy managed to warn the officers by sending up a droid attack flare. The clones soon met Cody and Rex after they narrowly escaped a droid ambush. After meeting the clones for the first time, Rex demanded that the rookies remove their helmets to verify that they were clones. After the three rookie clone troopers obeyed and removed their protective headgear, a Rishi Moon eel appeared and began to attack them.\nThis time, Rex used his blaster to kill it with one shot to the eye, a feat that impressed the rookies. Confronting the rookie clones, Rex referred to them as \"shinies,\" a derogatory term referring to the trooper's spotless armor that had not yet seen a battle. Rex, nonetheless, found the group to be unique and took interest in Hevy's confidence, as well as stating that \" there was hope for them yet.\" Both Rex and Cody gave the rookie troopers each their own blasters before Rex suggested a plan to retake the listening post.\nThe group of clone trooper hid near the entrance of the base while Rex impersonated a commando droid unit 26 by using the droid's decapitated head. The clone captain successfully tricked the commando droids to open the listening post's main door, allowing the clone troopers to ambush the remainder of the commando droids inside the base. Upon entering the command center, the clones defeated the droid units, including their vibroblade-wielding leader.\nTheir minor victory was cut short, however when the clone troopers noticed that General Grievous' fleet had arrived above the moon. Due to the lack of communication from the commando droids, Grievous sent more battle droids to the listening post. The clones, inside the command center of the listening post, were unable to turn off the \"all clear\" signal because the droids had hot-wired it. Soon a droid landing craft descended through the atmosphere and landed near the listening post. With the battle droid reinforcements outnumbering the clone troopers, Rex ordered the complete destruction of the base, to the surprise of the rookie troops. They soon realized that if they destroyed the base, the \"all clear\" signal would stop and the Republic would be alerted to the Separatist attack. Echo offered the use of highly explosive liquid tibanna, stored in plunk droids. While Rex and Echo went to retrieve the specific droids, Cody, Hevy, and Fives grabbed weaponry from the listening post's supply room.\nWhen the battle droids reached the entrance of the base, they ordered for the doors to open up, only to find Hevy pointing a Z-6 rotary blaster cannon right at them. Hevy, Cody, and Fives opened fire on the invading battle droid forces, buying time for Rex to wire three plunk droids together. Unexpectedly, the remote activator to detonate the tibanna inside the plunk droids did not function properly. Hevy offered to stay behind and correct the problem, enabling the others to exit the listening post through the ventilation shaft.\nHevy kept trying to link the remote activator to the bombs as the droids got nearer to his position. Realizing that he didn't have enough time, Hevy quickly hid from the approaching battle droids. Assuming that the clones fled, the Separatist droids once again claimed the listening post as their own. Outside, Cody, Rex, Echo, and Fives noticed that Hevy was still inside the listening post. Rex tried to contact Hevy via comlink, but Hevy told the clone captain that he had to detonate the explosives manually. The clone trooper then started firing at the B1-series battle droids after a group spotted him. Unwilling to accept Hevy's decision, Rex and the other clones ran back to rescue him.\nInside the station, more battle droids approached the command center. Hevy, was then shot in the shoulder by one of the droids. Outnumbered and wounded, Hevy still continued to fight to the command center, ignoring the pleas of the others through his comlink. Hevy's Z-6 rotary blaster eventually ran out of ammunition. He tossed the disabled weapon at the battle droids before being shot twice in the back. Upon Hevy's regaining of consciousness, a battle droid questioned whether or not to take Hevy prisoner. Replying that he did not take prisoners, Hevy activated the tibanna explosives, sacrificing himself and destroying the listening post along with the droids inside.\nHevy's sacrifice wasn't in vain. With the listening post destroyed, the \"all clear\" signal was shut off and the Galactic Republic was alerted to the presence of General Grievous' fleet of Separatist starships. When the Republic arrived, Grievous was forced to retreat as his fleet was outgunned. Meanwhile, the remaining clone troopers witnessed the destruction of the listening post, with Echo commenting how Hevy always hated the base. The clones were then picked up by a LAAT/i gunship. Onboard the Republic attack cruiser Resolute, Jedi Generals Obi-Wan Kenobi and Anakin Skywalker awarded Echo and Fives each with medals for their service and honored Hevy's bravery and sacrifice. Echo and Fives were then brought into Rex's own clone unit, the 501st Legion.\nUnfortunately, the Separatists would launch another attack on Kamino later in the war. The Republic, after intercepting a transmission between Grievous and Asajj Ventress, traveled to Kamino to defend it against the upcoming attack. Echo and Fives were among the members of the 501st Legion sent to defend their home. Both had adopted images of a Z-6 rotary canon with the words \"For Hevy\" written in Aurebesh on their armor to honor their fallen comrade. As the two were walking down a hallway in Tipoca City, they ran into 99. The clone welcomed his brothers back, but was saddened to hear that Hevy perished on the Rishi moon outpost. He then revealed to Echo and Fives that Hevy gave him his graduation medal before departing Kamino, much to the surprise of the other clones.\nGrievous and Ventress soon led their attack on Kamino, starting with Tipoca City. Echo and Fives destroyed attacking aqua droids from a sniping position, where they were soon joined by 99, who brought them ammunition. They were then joined by a group of young clone cadets who had gotten separated from their group. They all retreated to the barracks and were soon joined by Rex and Cody. A group of battle droids soon attacked the barracks. By having the clone cadets strike from above, the troopers succeeded in destroying all of their attackers. However, 99 was killed when he tried to get more ammunition for his brothers. After the battle, both Echo and Fives were promoted to ARC troopers by Captain Rex and Commander Cody for their initiative and bravery.\nIn the final year of the war, Captain Rex sat in the barracks staring at a picture of him with some of his clone brothers, reminiscing with Commander Cody about their fallen brothers, mentioning Hevy and recalling his sacrifice.\nHevy was a human created as a clone of the bounty hunter Jango Fett. Like his genetic template, he had black hair, brown eyes, and tan skin. His hair was trimmed in a crew cut, while his eyebrows were colored dark red. Like all clone troopers, Hevy was loyal to the Grand Army of the Republic first and foremost. However, this did not stop him from almost going rogue when he believed he would be submitted to maintenance duty. Hevy was also keen to follow his own path, which contributed to his squad's initial struggles. After a failed practice test, Hevy threw his helmet down in the barracks out of frustration and eventually got into a scuffle with Echo. Eventually, Hevy was convinced by 99 to be grateful for his chance to serve and made the most of it by becoming a leader for his squad.\nDuring his training on Kamino, Hevy wore a set of padded armor designed specifically for training purposes. This armor was much lighter and more maneuverable than standard clone armor, and featured an open visor so the cadet's face could be seen. Upon completing his training, Hevy wore a set of standard phase I clone trooper armor during his tenure at the Rishi Moon outpost, which included a comlink and utility belt. He also carried a droid attack flare, which he used to alert Rex and CC-2224 of the droid invasion at the Rishi Outpost. Although Hevy was proficient in all types of weapons, he preferred to use a Z-6 rotary blaster cannon as his primary weapon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/CT-782",
  "/wiki/CT-782/Legends",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Kamino",
  "/wiki/22_BBY",
  "/wiki/Rishi_Moon",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Domino_Squad",
  "/wiki/Rishi_Station_unit",
  "/wiki/File:DoWeTakePrisoners-Rookies.ogg",
  "/wiki/Blaster_cannon",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/DNA",
  "/wiki/Clone_template",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Planet",
  "/wiki/Clone_cadet",
  "/wiki/Kamino_system",
  "/wiki/Tipoca_City",
  "/wiki/Republic_Military",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Defense_of_Rishi_Station",
  "/wiki/BX-series_droid_commando",
  "/wiki/Squad",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Rishi_Station",
  "/wiki/Z-6_rotary_blaster_cannon",
  "/wiki/Battle_droid",
  "/wiki/Blaster",
  "/wiki/Fire",
  "/wiki/Death",
  "/wiki/Moon",
  "/wiki/Battle_of_Kamino",
  "/wiki/Trooper",
  "/wiki/CT-4040",
  "/wiki/Echo",
  "/wiki/CT-5555",
  "/wiki/CT-00-2010",
  "/wiki/Capital",
  "/wiki/Master_Chief",
  "/wiki/Bric",
  "/wiki/Arcona",
  "/wiki/El-Les",
  "/wiki/Jedi_Master",
  "/wiki/Shaak_Ti",
  "/wiki/Cadet",
  "/wiki/Citadel_Challenge",
  "/wiki/Training_droid",
  "/wiki/Droid",
  "/wiki/City",
  "/wiki/Barracks",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Jedi",
  "/wiki/Mercenary",
  "/wiki/Standard_day",
  "/wiki/Hangar",
  "/wiki/Colt",
  "/wiki/Havoc_(ARC_trooper)",
  "/wiki/Blitz",
  "/wiki/Soldier",
  "/wiki/Bravo_Squad_(clone_cadets)",
  "/wiki/Army",
  "/wiki/Clone_99",
  "/wiki/Ascension_cable",
  "/wiki/Utility_belt",
  "/wiki/Medal",
  "/wiki/File:MostBoringPost-Rookies.ogg",
  "/wiki/Listening_post",
  "/wiki/Rishi",
  "/wiki/Commanding_officer",
  "/wiki/Clone_Sergeant",
  "/wiki/O%27Niner",
  "/wiki/Nub",
  "/wiki/Surface_warfare",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Droch-class_boarding_ship",
  "/wiki/Assassin",
  "/wiki/Asajj_Ventress",
  "/wiki/Fleet",
  "/wiki/Meteor_shower",
  "/wiki/Commando",
  "/wiki/Deck_officer",
  "/wiki/CT-327",
  "/wiki/Rishi_eel",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/Commander",
  "/wiki/Officer",
  "/wiki/Droid_attack_flare",
  "/wiki/Shiny",
  "/wiki/Armor",
  "/wiki/Unit_26",
  "/wiki/Vibroblade",
  "/wiki/File:BigGun-Rookies.ogg",
  "/wiki/Landing_craft",
  "/wiki/Atmosphere",
  "/wiki/Tibanna",
  "/wiki/File:DetonateItManually-Rookies.ogg",
  "/wiki/B1-series_battle_droid",
  "/wiki/Starship",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Resolute",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/501st_Legion",
  "/wiki/Legion",
  "/wiki/AQ-series_battle_droid",
  "/wiki/Sniper",
  "/wiki/Captain",
  "/wiki/File:YouWantedExcitement-Rookies.ogg",
  "/wiki/Bounty",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Category:Audio_files_of_CT-782",
  "/wiki/Category:Images_of_CT-782",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Clone_Cadets",
  "/wiki/Rookies",
  "/wiki/ARC_Troopers",
  "/wiki/The_Bad_Batch_(episode)",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Star_Wars_Helmet_Collection_16",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Databank_(website)",
  "/wiki/Supply_Lines",
  "/wiki/Bombad_Jedi",
  "/wiki/Standard_year",
  "/wiki/The_Wrong_Jedi",
  "/wiki/19_BBY",
  "/wiki/Mission_to_Mustafar",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}