{
 "name": "CT-8863",
 "display_name": "CT-8863",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Breakout Squad",
      "Breakout Squad"
     ]
    }
   ]
  }
 ],
 "content": "CT-8863, nicknamed \"Breaker\" for his interests in technology, was a clone trooper in Breakout Squad during the Clone Wars. He participated in the Mission to Kynachi, and later joined the survivors of Breakout Squad and their Jedi Commander Nuru Kungurama in a mission to the Chiss Ascendancy. After an attack forced them to escape, they found themselves trapped by a black hole with a pirate gang. They found an ancient Infinity Gate and managed to escape. They then went on an escort mission to Vaced, but Commissioner Sommilor was killed. The duel with the assassin ended in his apparent death, and Breakout Squad traced a dataimager to liberate Bilbringi Depot. They then discovered the real Sommilor tied up in his freighter's hold, and took him back to Coruscant. There Kungurama confronted his missing master, Ring-Sol Ambase. Breakout Squad's next mission was to escort Noggox the Hutt's freighter to Fondor, where they defeated the pirate Dool Pundar. At Foless they rescued a group of younglings.\nCT-8863, known as \"Breaker,\" was a Galactic Republic clone trooper, a soldier of the Grand Army of the Republic and a clone of the Human bounty hunter Jango Fett. At the time of the Clone Wars, he stood 1.83 meters tall. He wore his black hair cropped short. In 21 BBY, he and a squad of troopers under the command of Captain Lock were assigned to investigate the remains of a battle in the Kaliida Nebula. Breaker found a computer from the crashed cruiser Malevolence, which revealed it had been constructed by KynachTech Industries. His interest in technology prompted Lock to grant him the nickname \"Breaker.\" The squad was then assigned to investigate Kynachi with Jedi Master Ring-Sol Ambase. Their ship was ambushed by Vulture droid starfighters and destroyed. Along with Ambase's stowaway Padawan, Nuru Kungurama, Breaker and the survivors took an escape pod to the surface. They eventually liberated the world from the Techno Union and earned the moniker of Breakout Squad. They acquired transport back to Coruscant with Captain Lalo Gunn and her ship the Hasty Harpy.\nEn route, they received orders from Supreme Chancellor Palpatine to go to the Chiss Ascendancy for a meeting at Defense Station Ifpe'a. There they met Aristocra Sev'eere'nuruodo to discuss an alliance, and rescued her from a Techno Union attack. After escaping into hyperspace, they became trapped near a black hole with Hethra Mcgrrrr's pirate gang. Kungurama and Breakout Squad managed to locate an ancient Infinity Gate with a pair of Sullustan xenoarchaeologists. The Aristocra returned home while Breakout Squad continued back to Coruscant.\nWhen shipping back to Coruscant, Breakout Squad was contacted by Chancellor Palpatine again and asked to divert to Vaced to meet Kynachi's Commissioner Langu Sommilor and act as his escort. The Commissioner was assassinated by a sniper just after his arrival. Chatterbox and Breakout Squad pursued the sniper. The clones got onboard Gunn's ship while Kungurama took a swoop bike. The sniper, a Mandalorian managed to reach his transport and engaged the Hasty Harpy, causing both ships to crash and leading to the apparent death of the sniper. After Breakout Squad and Gunn parted, Kungurama found an imagecaster which led Breakout Squad to take Sommilor's freighter to Bilbringi Depot, where they clashed with Umbrag again, recapturing the depot.\nBreakout Squad finished investigating the Depot, and discovered that the Sommilor who had been killed on Vaced was an impostor; the real Sommilor was freed from his captivity in the freighter's hold. Clone medics arrived and stabilized the wounded Chatterbox, with the rest of Breakout Squad donating blood, excepting Sharp. The squad then returned to Coruscant with Sommilor. During the trip in hyperspace, Umbrag managed to grab Kungurama, but was shot in the attempt. Kungurama had a dream about a future duel; when he woke up, he shared his concerns with Breaker, who reassured him. On Coruscant, Jedi Master Harro Kelpura ordered their freighter to change course from the Jedi Temple to his lab in Dacho District, which had been broken into. The ship was then damaged by an impact with a dropship belonging to a bounty hunter. The ship crashed but was able to take off and escape, and Kungurama, with Breaker's support, confronted his missing master. Breakout Squad was then assigned to investigate the disappearances of the Spice Siren.\nBreakout Squad's next mission was to escort Noggox the Hutt's freighter to Fondor. When they arrived at the rendezvous on Affa, they discovered the remains of a massacre, but they continued their mission to Fondor, where they defeated the pirate Dool Pundar. Once there, their ally Gizz befriended a blind Twi'lek, Kuvuta Pindi. Kungurama agreed to help her escort orphaned younglings to Foless. Once there, they realized Pindi was trying to steal the orphans, and gave chase. They captured Pundar and freed the younglings, but Pindi was killed.\nBreaker was skilled with machinery, and was able to recognize the origins of computer parts. He knew that plans did not always work out and they had to be ready to be improvise. He and the rest of Breakout Squad were loyal to the Grand Army of the Republic and to his commander, Nuru Kungurama.\nBreaker appeared in Ryder Windham's young readers series, Star Wars: The Clone Wars: Secret Missions. He and Breakout Squad was first pictured in the comic The Clone Wars: Opress Unleashed, a comic released in 2011 as part of Free Comic Book Day and later included in the comic The Clone Wars: Strange Allies.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:CT-8863",
  "/wiki/Breakout_Squad",
  "/wiki/Breaker",
  "/wiki/Clone_trooper_captain",
  "/wiki/Second_Battle_of_Geonosis/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Mission_to_Kynachi",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Nuru_Kungurama",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Black_hole/Legends",
  "/wiki/Black_Hole_Gang/Legends",
  "/wiki/Infinity_Gate",
  "/wiki/Mission_to_Vaced",
  "/wiki/Commissioner/Legends",
  "/wiki/Langu_Sommilor_(impostor)",
  "/wiki/Death/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Bilbringi_Depot",
  "/wiki/Langu_Sommilor",
  "/wiki/Freighter/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Ring-Sol_Ambase",
  "/wiki/Noggox",
  "/wiki/Hutt/Legends",
  "/wiki/Fondor/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Dool_Pundar",
  "/wiki/Foless/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Lock_(clone_trooper)",
  "/wiki/Battle_of_the_Kaliida_Nebula/Legends",
  "/wiki/Kaliida_Nebula/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Malevolence/Legends",
  "/wiki/KynachTech_Industries",
  "/wiki/Kynachi",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Techno_Union/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Lalo_Gunn",
  "/wiki/Hasty_Harpy",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Chiss_Defense_Fleet_Command",
  "/wiki/Ifpe%27a",
  "/wiki/Aristocra/Legends",
  "/wiki/Sev%27eere%27nuruodo",
  "/wiki/Hyperspace/Legends",
  "/wiki/Hethra_Mcgrrrr/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Archaeology/Legends",
  "/wiki/Vaced/Legends",
  "/wiki/Sniper/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Hudu_Shiv%27s_Pursuer-class_enforcement_ship",
  "/wiki/Medic/Legends",
  "/wiki/Blood/Legends",
  "/wiki/CT-4012",
  "/wiki/Harro_Kelpura",
  "/wiki/Jedi_Temple",
  "/wiki/Dacho_District",
  "/wiki/Sleight_of_Hand",
  "/wiki/Spice_Siren/Legends",
  "/wiki/Affa/Legends",
  "/wiki/Gizman",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Kuvuta_Pindi",
  "/wiki/Ryder_Windham",
  "/wiki/Star_Wars:_The_Clone_Wars:_Secret_Missions",
  "/wiki/The_Clone_Wars:_Opress_Unleashed",
  "/wiki/2011",
  "/wiki/Free_Comic_Book_Day",
  "/wiki/The_Clone_Wars:_Strange_Allies",
  "/wiki/Category:Images_of_CT-8863",
  "/wiki/The_Clone_Wars:_Secret_Missions_1:_Breakout_Squad",
  "/wiki/The_Clone_Wars:_Secret_Missions_2:_Curse_of_the_Black_Hole_Pirates",
  "/wiki/The_Clone_Wars:_Secret_Missions_3:_Duel_at_Shattered_Rock",
  "/wiki/The_Clone_Wars:_Secret_Missions_4:_Guardians_of_the_Chiss_Key",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Annual_2011"
 ]
}