{
 "name": "CT-8508",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 19 BBY",
      "Bracca"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic",
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "CT-8508 was a clone trooper and later stormtrooper who was created on the planet Kamino and served the Galactic Empire during its reign. Under the command of Clone Commander CT-9904 \"Crosshair,\" he was dispatched to the junkyard planet Bracca to hunt Clone Force 99, better known as the \"Bad Batch.\" After arriving on Bracca, CT-8508 was sent to hunt secure the Bad Batch's Omicron-class attack shuttle, the Marauder.\nAfter finding the Marauder empty, CT-8508 updated Crosshair on this. He was then ordered by the commander to maintain a perimeter around the shuttle. However, he and his stormtroopers were soon killed by the bounty hunter Cad Bane, who had come to capture a member of the Bad Batch. A fellow trooper attempted to contact CT-8508 for a report on the status of the Marauder, but was unable to get a response.\nCT-8508 was created on the planet Kamino and eventually became a stormtrooper and joined the Stormtrooper Corps of the Galactic Empire during its reign, which begun in 19 BBY. Around that year, CT-8508 was deployed under the command of the elite Stormtrooper Commander CT-9904 \"Crosshair\" on a mission to the junkyard world of Bracca to hunt down the rogue clone unit Clone Force 99, also known as the \"Bad Batch.\" The taskforce traveled to Bracca on three Nu-class attack/transport shuttles and landed near a scrapped Venator-class Star Destroyer where the Bad Batch had been spotted by the local Scrapper Guild.\nThe clone stormtroopers formed up in lines of five in front of the Nu-class shuttles, CT-8508 standing ahead of his own squad, for when Crosshair and his elite squad disembarked from one of them. After assessing the Bad Batch's status, the commander ordered CT-8508 to lead a unit of clones and find the Batch's own vessel, the Omicron-class attack shuttle Marauder. The stormtrooper acknowledged and signaled his troops onto a Nu-class shuttle, which took off in search of the the Marauder once the clones were aboard.\nCT-8508 and his fellow clone stormtroopers soon found the Marauder and searched the shuttle, finding no one inside. The stormtrooper contacted Crosshair, reporting his findings. The commander then ordered him to secure the perimeter, which CT-8508 acknowledged. However, CT-8508 and his clone comrades were attacked by the Duros bounty hunter Cad Bane, who was seeking to capture the Bad Batch's youngest member, Omega. Bane killed the entire clone unit guarding the Marauder, leaving CT-8508 laying dead at the bottom of the shuttle's boarding ramp.\nAs the Bad Batch members made for their shuttle, a clone stormtrooper with Crosshair attempted to contact CT-8508 for an update, but could not receive a response from the dead trooper. When Sergeant \"Hunter\" and Omega of the Bad Batch arrived at the Marauder they found Bane and the dead troopers. The bounty hunter jeered at how easy he found it to kill stormtroopers, before injuring Hunter and kidnapping Omega. The remaining Bad Batch members soon arrived and brought the sergeant aboard their shuttle, escaping from Bracca.\nAs a clone of the human male bounty hunter Jango Fett, CT-8508 was 1.83 meters tall and had tan-colored skin. He acknowledged and obediently followed all of Crosshair's orders, relaying the commander any update he had.\nCT-8508 wore white Phase II clone trooper armor and used a DC-15A blaster carbine. He also made use of a comlink that was built into his helmet.\nCT-8508 appeared in \"Reunion,\" the eighth episode of the Disney+ animated series Star Wars: The Bad Batch, which was released on June 18, 2021. He was voiced by Dee Bradley Baker, the voice of every clone trooper in The Bad Batch as well as other animated series including Star Wars: The Clone Wars.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kamino",
  "/wiki/19_BBY",
  "/wiki/Bracca",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Clone_trooper",
  "/wiki/Stormtrooper",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Commanding_officer",
  "/wiki/Clone_Commander",
  "/wiki/CT-9904",
  "/wiki/Clone_Force_99",
  "/wiki/Omicron-class_attack_shuttle",
  "/wiki/Marauder_(Omicron-class)",
  "/wiki/Commander",
  "/wiki/Shuttle",
  "/wiki/Death",
  "/wiki/Bounty_hunter",
  "/wiki/Cad_Bane",
  "/wiki/Trooper",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Standard_year",
  "/wiki/Stormtrooper_Commander",
  "/wiki/Mission_on_Bracca",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/Unidentified_Venator-class_Star_Destroyer_(Clone_Force_99)",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Scrapper_Guild",
  "/wiki/Squad",
  "/wiki/CT-9904%27s_Elite_Squad",
  "/wiki/Starship",
  "/wiki/Duros",
  "/wiki/Omega",
  "/wiki/Sergeant",
  "/wiki/Hunter",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Jango_Fett",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Comlink",
  "/wiki/Helmet",
  "/wiki/Reunion",
  "/wiki/Disney%2B",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/June_18",
  "/wiki/2021",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones"
 ]
}