{
 "name": "CT-9904",
 "display_name": "CT-9904",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.93 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Clone Force 99",
      "Clone Force 99",
      "Galactic Empire",
      "CT-9904's Elite Squad",
      "CT-9904's Elite Squad"
     ]
    }
   ]
  }
 ],
 "content": "CT-9904, nicknamed \"Crosshair,\" was a clone commando who served in the Grand Army of the Republic during the Clone Wars as part of Clone Force 99. Crosshair possessed genetic mutations that gave him exceptional eyesight and because of it, he acted as a sniper, taking advantage of his marksmanship skills.\nUpon the activation of Order 66, Crosshair was the lone member of Clone Force 99 that attempted to carry out the order. Frustrated with his team's disregard for the rise of the Galactic Empire, Crosshair was eventually selected by Governor Wilhuff Tarkin to remain loyal to the Empire, and was deployed against his former teammates with the military rank of Clone Commander.\nWhile he had his behavioral modification biochip removed, he remained loyal to the Empire. Crosshair also wished for Clone Force 99 to band together once more, albeit under the new Empire; to that end, he shot down his Elite Squad members in Tipoca City on Kamino and fought alongside his brothers in arms before being caught in the destruction of the city. He managed to survive the destruction, but chose to remain with the Empire.\nCT-9904 \"Crosshair\" was a male defective clone of bounty hunter Jango Fett. However, Crosshair's defects proved to be effective for military purposes, resulting in him being considered an enhanced clone. As a result, he and several other clones with desirable mutations were formed into a clone commando squad known as Clone Force 99, but they informally called themselves \"the Bad Batch.\" Working together and normally not working with regular clone troopers, Crosshair and his squad-mates secured an hundred percent success rate. Although Crosshair developed a disdain for them, there were rare missions that saw regular clone troopers—whom Crosshair and the rest of his squad called \"regs\"—work alongside the Bad Batch, but, according to fellow Bad Batch member \"Wrecker,\" whatever transport the squad was using would always be shot down if they worked with regular troops. At some point, Crosshair and his squad met Cut Lawquane and his family on Saleucami.\nDuring the Battle of Anaxes, CT-9904 \"Crosshair\" was deployed alongside the rest of his squad, Clone Force 99, as special reinforcements under Jedi General Anakin Skywalker. Deployed to a Cyber Center, the squad set out to retrieve special intelligence that could turn the tide of the battle. As when they were heading there, Crosshair seemingly stared at CT-5597 \"Jesse\" who he responded of what was he looking at, Crosshair responded that he and the Bad Batch did not usually work with \"regs.\" However the situation was quickly defused and were briefed of the mission. On the way to the center, Clone Marshal Commander CC-2224 \"Cody\" was injured; when Clone Captain CT-7567 \"Rex\" attempted to take command, Crosshair met with protest alongside Wrecker, subsiding when Clone Sergeant \"Hunter\" officially ceded command to Rex. Upon reaching the cyber center, Crosshair was left outside to secure the perimeter. After the squad retrieved information revealing that CT-1409 \"Echo,\" who seemingly perished on Lola Sayu, was in fact alive on Skako Minor, Crosshair secured a shuttle and transported his squad back to the base.\nCrosshair, with the rest of Clone Force 99 as well as Rex and Skywalker, went to Skako Minor in hopes of retrieving Echo from the Techno Union city of Purkoll on the planet. Upon landing, the group were attacked by keeradaks; Crosshair shot a grapple into a keeradak that had began carrying Skywalker away, allowing Hunter to hold on and give pursuit. After the keeradak escaped with Skywalker, Crosshair and his squad rendezvoused with Hunter at the edge of a Poletec village. After a brief skirmish, the clones and the Poletecs came to an immediate ceasefire, and the chief, Qin Yazal, agreed to assist the clones and Skywalker in reaching the Techno Union facility.\nUpon arriving at the Purkoll Tower Base, Crosshair remarked that it could be a trap, and accused Rex of blindly walking the squad into a trap because of his guilt for leaving Echo for dead on Lola Sayu. Crosshair angered Rex further by saying that he would have willingly just left Echo for dead due because he was a \"reg.\" Rex, angered, assaulted Crosshair, and the fight was broken up by Skywalker. As the group made their way through the base, Crosshair assisted in clearing a large group of D1-series aerial battle droids, before continuing on. With the assistance of Skywalker, Crosshair dispatched another group of droids that had almost cornered the Jedi General.\nAs Rex and Tech located Echo, Crosshair, Skywalker, and the other members of Clone Force 99 continued to fight the aerial battle droids that were closing in on them. After Echo was freed, the clones and Skywalker began their escape, unable to call for reinforcements due to the unsanctioned nature of their mission. Echo opened a vent, which Wrecker and Skywalker helped the group into before the facility was blown up by Wrecker. Skywalker and the clones continued moving through the vents before finding themselves outside on top of a pipe. Crosshair momentarily lost his footing, but was saved by Wrecker. The group then leaped onto a flock of keeradaks flying under the pipe, and made it back to the Poletec village.\nAfter returning to the village, Crosshair spotted a group of D-wing battle droids that had followed them. He managed to take all but one out; the escaping droid then reported the clones' location to Wat Tambor. After the droid's escape, the clones briefly argue with the Poletecs, before convincing them to help them defend the village. Crosshair and his team helped to defend the village from a legion of D-wing battle droids, as well as two octuptarra tri-droids. After ending the threat of the droids, Crosshair and his team boarded the Marauder to return to Anaxes.\nBack at Fort Anaxes, Echo created a plan to drive the Separatists away from the planet. The Batch would go with Anakin and him to the Invulnerable, where he'd send false strategies to the Admiral in order to win the battle. Although the plan was approved, Crosshair and the Bad Batch still had their suspicions over Echo's true loyalty. Nevertheless, he successfully jammed the Marauder's signal, allowing the group to enter the Separatist dreadnought. Once inside the ship, Crosshair and Wrecker stood guard outside while Echo executed his plan.\nAs the system overloaded Echo with electricity, leaving him unconscious, battle droids approached their position. Crosshair dispatched them together with Wrecker, while Skywalker went to deal with Trench himself. As they returned to the Marauder, Crosshair bought them time by using his reflector disks, allowing him to destroy the approaching droids. This stunned Wrecker, who wanted to have the best move, and Crosshair told him he wouldn't be able to beat it. As they flew back to Anaxes, Crosshair nodded in disappointment as Wrecker was allowed to blow the entire ship with a remote detonator.\nOn the Republic base, the team was congratulated by the Generals. While they were getting medals for them, the Bad Batch told Echo that they were leaving, since accolades aren't \"their thing\", but allowed him to join if he wanted to, and that's what he did. As Rex watched, Crosshair and the rest of Clone Force 99 saluted him, together with Echo.\nDuring the conquest of Kaller, Clone Force 99 was led to an ongoing skirmish by Padawan Caleb Dume. As the rest of his squad fought in the battlefield below, Crosshair remained on a higher point, taking out enemy droids from above. When the operation was complete, Crosshair slid down from the hill, rejoining his squad as they approached Dume, his master Jedi General Depa Billaba, and Clone Captain CC-10/994 \"Grey.\" Under Billaba's orders, Crosshair prepared to accompany his squad and Dume to another ongoing skirmish where they were needed. However, their new mission was cut unexpectedly short when Captain Grey and a squad of clones, under the influence of Order 66, opened fire on Billaba.\nAs Dume ran to help Billaba, Crosshair and his squad gave chase. Dume escaped and Billaba was killed, much to the horror of Hunter, Echo, Tech and Wrecker. The four wondered what Order 66 was, while Crosshair did not appear to be as shocked or confused, instead looking on at the distance. Seemingly unaffected by the order, Hunter split the squad up, taking Crosshair with him to find Dume. While chasing after the Padawan, Crosshair fired at Hunter, much to his sergeant's confusion as he consistently ordered him to stand down as they needed more information. While pursuing Dume, he was knocked out by the Padawan following a brief fight; by the time he came to his senses, the Padawan was nowhere to be found. Crosshair asked his sergeant if the Jedi was dead, which Hunter confirmed, but the sharpshooter believed otherwise.\nUpon returning to Kamino, Crosshair berated Hunter for refusing to execute Order 66, surprising his teammates who pointed out that Crosshair had shared their disregard for command in prior missions. After returning to their bunks, all clones on Kamino were directed to attend an announcement regarding the Republic's status. During the assembly, Crosshair watched as the newly anointed Emperor Palpatine declared the formation of the Galactic Empire. After the announcement, Crosshair and his squad met Omega, a female, genetically altered clone who was familiar with their identities. After Omega left, Crosshair and his team came to the mess hall to eat. After Omega sat to eat with them, to Crosshair's annoyance, a group of normal clone troopers walked by, insulting Clone Force 99. As Omega and Wrecker retaliated, prompting a fight to break out, Crosshair attempted to continue eating. However, he joined the fight when Echo was thrown onto the table, and as a result, Crosshair's food.\nExpecting punishment on their way to speak to the Prime Minister, Lama Su, Crosshair and his team were warned by Echo that Admiral Wilhuff Tarkin was present on Kamino. Before reaching the Prime Minister, the squad was redirected to the training facility, where Tarkin wished to assess their combat capabilities after witnessing their fight in the cafeteria. During the initial training exercise, Crosshair assisted by taking out each of the turrets, before sniping enemy combatants from one of the towers. When Tarkin ordered a second exercise to be performed using live rounds, Crosshair took cover at ground level, and attempted to aid his squad in the exercise. When only one training droid remained, Crosshair instructed Wrecker to throw his knife into the air; Crosshair shot the knife, causing it to stab the remaining droid in the head.\nAt some point, Crosshair had filed a report against his teammates, stating their failure to faithfully execute Order 66. Taking note of this report, Tarkin decided to assign Clone Force 99 with a new mission to test their loyalty. Crosshair, alongside his squad, traveled to Onderon, believing that they were assigned to eliminate a group of insurgents supporting the Separatists. Upon realizing that the group they were assigned to eliminate consisted primarily of civilians, Crosshair was still prepared to carry out his orders, unlike the rest of his squad. Hunter ordered Crosshair to stand down, to which Crosshair responded with resistance. However, the group as a whole was apprehended by Saw Gerrera, who was leading the group of civilians in hopes of finding them safety.\nWhile Gerrera spoke to Clone Force 99 about the truth of the Empire's new order, Crosshair remained defiant to his claims, insisting that the mission be completed in full. He also remained hostile to Gerrera as a result. After the clones were released and Gerrera left, Crosshair insisted that they finish the mission, but was prevented from doing so by the rest of his squad. The group then departed to return to Kamino, hoping to retrieve Omega before she could be harmed.\nUpon returning to Kamino, Crosshair and his teammates were immediately apprehended and placed in the brig, alongside Omega. Crosshair became frustrated with Hunter, blaming him for the situation they were in due to his unwillingness to follow orders. When the argument subsided, Omega approached Crosshair, attempting to console him and convince him not to turn on his brothers, stating that his urges were not his fault. Crosshair was then taken away by clones and into the medical bay under Tarkin's orders, who had noticed that he was far more loyal to the Empire compared to his teammates. Nala Se, who accompanied Tarkin, inspected Crosshair and noted that while his inhibitor chip was not as active as a regular clone's, the order was still working, hence Crosshair's drastic change in personality. Tarkin then proceeded to have the chip enhanced to ensure full loyalty.\nCrosshair, now outfitted in new armor, was then deployed to the hangar, where he confronted his former teammates who were attempting to escape with Omega. After Hunter briefly tried to reason with Crosshair, Crosshair opened fire, forcing the squad into cover. As Clone Force 99 attempted to make their escape, Crosshair shot Wrecker, briefly incapacitating him. Before Crosshair could further harm the other members of the squad, however, his rifle was shot out of his hands by Omega. Crosshair attempted to continue fire utilizing a pistol, but was unable to prevent the escape of his former squad mates.\nAfter Crosshair's defection and Clone Force 99's escape from Kamino, the squad once again visited Cut Lawquane on Saleucami. Lawquane inquired as to why Crosshair was not present with his squad.\nSoon after Clone Force 99 escaped, Crosshair and Tarkin met with Vice Admiral Rampart, who introduced the two to a group of four non-clone humans, who had been selected to participate in elite training under Crosshair's command. One member of the squad, ES-01, was belligerent towards Crosshair, and expressed confidence that he would be taking over command of the squad soon enough. Crosshair, alongside his new squad, were given the assignment of completing Clone Force 99's final mission, as a test of their effectiveness in combat.\nReturning to Onderon, Crosshair and his squad swiftly took out the remaining Onderonian rebels, and apprehended the survivors. Crosshair placed one survivor at blasterpoint, asking her where Gerrera was. When she responded that she didn't know, Crosshair remarked that he believed her, and promptly shot her. Crosshair then turned, ordering his squad to execute the remaining survivors. ES-01 objected, stating that the survivors should have only been captured, and attempted to give the other squad members alternative orders. Crosshair then shot and killed ES-01, stating that he was placed in charge because he is \"willing to do what needs to be done\". Shortly after, the remaining squad members executed the remaining survivors under Crosshair's command.\nUpon returning to Kamino, Crosshair informed Tarkin and Rampart that the insurgents were handled, although Gerrera himself had escaped. When Tarkin asked where ES-01 was, Crosshair claimed that he was killed in battle and that he knew the risks. Without another word, he and his squad then returned to what was once Clone Force 99's bunk, where Crosshair sat in contemplation.\nMeanwhile, during a mission to Ord Mantell, Omega was given Crosshair's old comlink. As Clone Force 99 began performing more mercenary work, Wrecker complained about being ordered to take point, lamenting that it was Crosshair's old job.\nSometime after the mission on Onderon, Crosshair reported to Vice Admiral Rampart and Lama Su that the Bad Batch had been spotted on Bracca by the Scrapper Guild. While the Prime Minister advised that the rogue clones be brought in alive, Rampart ordered Crosshair to terminate his former squad.\nSoon after, Crosshair and his squad arrived on Bracca along with a large contingent of clone troopers, landing near the wreckage of a Venator-class Star Destroyer where the Bad Batch was spotted. When ES-03 reported that their sensors were being jammed, he recognized it as the work of the Bad Batch and that they were still on board the wrecked ship. After dispatching several troopers to secure the Marauder, Crosshair and the rest of the troops advanced into the wreckage.\nOnce on board, Crosshair ordered his troops to funnel the Bad Batch towards the hangar; in reality, these orders were a ruse, as he had predicted that his old comrades would tap the Imperials' comms to track their movements. This intuition proved correct, and the Imperials were able to surround the Bad Batch in the Venator's artillery deck. Crosshair chastised his former squadmates for their predictable tactics. Hunter and Omega pleaded with him to resist the inhibitor chip's influence, but Crosshair was unfazed and ordered his squad to target Omega. However, Tech and Echo managed to activate the nearby turbolasers, causing the ceiling above them to collapse, raining debris onto Crosshair and his company. After an intense firefight with several clone troopers, the Bad Batch managed to escape.\nRecovering, Crosshair ordered ES-04 to the Venator's bridge and await further orders. Crosshair boarded one of the Imperials' Nu-class shuttles, taking position the Venator's ion engines along with several clone troopers. As he expected, the Bad Batch attempted to escape through one of the Venator's ion engines. He pinned them down with his sniper rifle, taunting his former squadmates that they were surrounded. With the Bad Batch trapped inside, he ordered ES-04 to fire the engines and incinerate them. However, the Bad Batch detonated charges around the inside of the engine, causing it to split in half, sending a torrent of fire directly at Crosshair. The blast launched him backwards, knocking off his helmet and severely burning his face. A squad of clones landed nearby to recover Crosshair, and he angrily informed them that the rogue clones were headed back to their ship. A clone medic bandaged Crosshair's wounds and fitted him with a breath mask, and when the troopers informed him that the the Bad Batch was on the run, he demanded to be taken aboard the shuttle to rejoin the hunt. His shuttle then pursued the Marauder through Bracca's atmosphere. However, the Bad Batch were able to escape.\nSometime after the failed mission on Bracca, Crosshair recovered from his injuries, although he had burn scars on the back of his head, and accompanied Vice Admiral Rampart to Ryloth to root out insurgents there. In Lessu, Ryloth's capital, Crosshair kept a lookout for rebel leader Gobi Glie, eventually spotting him while Orn Free Taa and Cham Syndulla gave speeches. Sometime later, he meant with Rampart and Taa in the latter's office. Taa proposed disposing of Syndulla due to his popularity with the people, but Crosshair stated that Glie was who Taa should focus on instead, before he and Rampart left the room. Later, Crosshair spied on Hera Syndulla as she accompanied Glie on a supply rendezvous with the Bad Batch on one of Ryloth's moons. Before they left the area, Crosshair fired a tracking beacon onto their ship and reported this to the Empire.\nWhen they returned, Crosshair hit one of the ship's engines as it entered a canyon, later capturing Glie and Hera with a group of clones. When Cham came to rescue her, Crosshair initially did not participate as planned by Rampart. When the Imperials were forced to surrender, Crosshair, overlooking the scene, was then ordered by Rampart to incapacitate Taa with a shot to the head, thus framing Cham for an assassination attempt.\nA while later, Clone Force 99 arrived on the planet, having been hired by Hera to rescue her parents The Batch  attacked the imperial refinery. The clones were all ordered to the refinery. Knowing the strategies of his squad, he ordered his elite squad to remain outside the palace. After Howzer, a Clone Captain, came out denouncing the Empire, Crosshair ordered the clones who did not sympathize with Howzer to arrest him and those who followed him. He then asked Rampart for permission to hunt his old squad down, who gave him permission.\nReturning from Ryloth, Crosshair and Rampart were present when all the clone troopers were being transported off Kamino. Crosshair told Rampart that the operation was ahead of schedule. He was ordered to ensure that every viable clone was mobilized and sent off Kamino. He then questioned what would happen to the Kaminoans, and was told to keep an eye on them.\nWhilst on a mission to Daro, Hunter was captured by the Empire and imprisoned there. Crosshair visited Hunter in his cell. He told him that although he hoped for the entire Batch to be there, Hunter would suffice. He then transported Hunter to Kamino. Crosshair used Hunter's comm to lure the rest of the Bad Batch to Kamino, knowing that they would come for him despite being an obvious trap. Hunter tried to persuade Crosshair to leave the Empire, but to no avail. When the Marauder was detected entering the planet, Crosshair and his Elite Squad moved to the training ground. He again used Hunter's comm to lure Echo, Wrecker and Tech to there, while Omega was ordered to remain in the training droid storage room. Knowing the Batch would expect Crosshair to be waiting at the front door for them, Crosshair predicted that they would come through the lift.\nAs he predicted, the Batch did exactly that, and they were surrounded. He ordered Echo, Wrecker and Tech to drop all their weapons, which they did. He questioned Omega's location, sending ES-02 to find her. ES-02 was successful, and Crosshair ordered her to put Omega on a shuttle and send her off-world. Hunter argued with this, but Crosshair told him that it was for her own good, as well as Hunter's. He once again tried to persuade Crosshair to return to Clone Force 99, whilst Crosshair tried to convince the Batch to join the Empire. Crosshair revealed that he felt betrayed by the Bad Batch, feeling that their claims of loyalty to each other were ridiculous because they had abandoned him. However, he was willing to give them a chance and ordered his squad to stand down. When they refused and prepared to fire, he fired a shot from his blaster towards a reflector disk he had placed earlier, killing his entire squad.\nOmega and AZI-3 took out ES-02 and activated the training droids. Crosshair and the Batch were forced to team up to take out all the droids, with which they were successful. When Hunter tried to explain the chips once again, Crosshair revealed that he had his chip removed a long time ago and that he was genuinely loyal to the Empire. Before he could fire, however, Hunter stunned him. Hunter proceeds to turn his body over and look at the burn scar at the back of his head, implying that Crosshair's chip was damaged and removed after being wounding on Bracca.\nES-02, who had regained consciousness, rendezvoused at the training grounds and found her squad-mates dead and Crosshair fighting with the Bad Batch. ES-02 believed Crosshair had turned traitor, having been suspicious of his leniency towards his old squad, and quickly left the scene to inform Rampart that Crosshair had lost control of the situation. Rampart then ordered his Venators to sink the city into the sea, deciding to have the clones die together.\nWhen Crosshair woke up, he realized he was trapped in a flooded room with Omega and AZI-3. After a struggle, Omega and AZI managed to save Crosshair. He, Omega and AZI were able to escape the flooding room with the help of Wrecker and his vibroblade. They made their way to a tube which led to Nala Se's secret lab. Crosshair questioned Omega's lead when the tube came under attack from a large creature. The creature attempted to bite through the exterior of the tube until AZI rebooted the power. The creature was electrocuted and swam away. The Batch, Crosshair and AZI made their way to Nala Se's lab, where Crosshair was told that this was where he gained his mutations by Tech, and that Omega was older than them. Crosshair told Omega that just because she's a defective clone doesn't mean she's \"one of them\" . Before departing his presence, Omega remarked that she wanted to believe the inhibitor chip was what made Crosshair so cold but he has proven her wrong.\nThey then witnessed that the tube that would bring everyone to the Marauder's landing pad was destroyed, so they came up with a plan to get up there. They split up and got into medical pods; Crosshair was paired with Hunter. Omega set off thermal detonators, letting water flood the room and carry the medical pods out of the room. AZI guided the pods around the debris, successfully getting Hunter, Crosshair, Echo, Wrecker and Tech up to the surface, however AZI was unable to get Omega up to the surface and lost power. Omega went out of her pod to save AZI, however she was unable to do so. No one up on the surface could see Omega and AZI except for Crosshair, who launched a grapple hook onto AZI and reeled them up, saving both of them. With the rest of the Bad Batch training their weapons on Crosshair, he surrendered his rifle to Wrecker.\nWhen they arrived at the landing platform, Hunter gave Crosshair the chance to rejoin the Batch, however Crosshair declined, stating that he made his decision, wanting to stay with the Empire, and that the bombardment didn't change anything. Omega thanked him for saving AZI, and Crosshair replied to consider each other even after Omega saved him. He watched the Bad Batch depart in the Marauder while remaining on the platform, alone.\nCrosshair received his nickname due to his incredible sharpshooting abilities. According to Sergeant Hunter, he was capable of shooting targets from ten kilometers away. Crosshair cherished his 773 Firepuncher rifle. As a result of his sniping skills, the specialist commando had a feeling of superiority, disliking the idea of needing to work alongside unaltered clone troopers.\nCrosshair was also known for his caustic attitude and icy demeanor. He had a general disdain of \"regs,\" a term used by Clone Force 99 to refer to regular clone troopers, and was always the first to express criticism, usually in a very sarcastic way. Nevertheless, he proved that he could always remain calm, even remaining as such when failures occurred around him. He could be rude to others, often offering unsolicited and harsh criticisms accusing others of ineptitude or otherwise breaching a sore subject.\nCrosshair had a very dry sense of humor, which often put him at odds with his boisterous teammate Wrecker. Although the two could work together quite effectively, Crosshair and Wrecker often engaged in competitive quarrels about which one could destroy more battle droids in the course of a mission. This was especially seen when Crosshair destroyed a considerable amount of battle droids within a few seconds with a single blaster shot.\nAfter Order 66, Crosshair's free will was limited, prioritizing the Empire over his teammates, and challenging Hunter for his disobedience. Initially, the chip did not fully corrupt his mind, as he continued to stick with his group despite his frustrations with them for not obeying Order 66. However, once Admiral Tarkin had his inhibitor chip enhanced, the brainwashed Crosshair lost all loyalty to Clone Force 99, attempting to kill his brothers without remorse. Like any other clone under its effects, Crosshair attempted to follow his orders without question, even if it meant killing civilians or children, such as Omega.\nCrosshair removed his inhibitor chip at some point, but he continued to remain loyal to the Empire. Nonetheless, despite his initial attempts at killing them, he did show concern for his old squad, wishing to have them serve the Empire together. Likewise, he also showed some degree of concern for Omega's well-being, despite trying to kill her at the start, and was willing to have her taken off-world for her own good, believing that living with \"fugitives\" placed her in constant danger. He also rescued her to pay back for her saving him earlier during their escape from the Empire's bombardment of Tipoca City.\nCrosshair had a tattoo of a circle and a line vertically across his right eye. After suffering severe burns during the mission on Bracca, Crosshair had burn marks covering the right side of his head. He also shaved his head.\nBeing a genetically enhanced clone, Crosshair had exceptional eyesight. Due to this, Crosshair had almost unrivaled accuracy with ranged weaponry, particularly with his sniper rifle; no matter the distance, Crosshair could almost always hit any target he was tasked with shooting.\nCrosshair could regularly hit objects, large or small, with exceptional precision from extremely long distance. As noted by Hunter, this precision could extend to miles away. On Ryloth, despite being positioned at what seemed to be more than a mile away, Crosshair shot Gobi Glie's starship out of the sky by destroying the engine. Not soon after, this was again displayed when he shot Orn Free Taa in the head so precisely, it did not kill him.\nCrosshair could also hit small objects while they were in motion. On Anaxes, in Clone Force 99's effort to destroy a wave of oncoming droids, Crosshair shot explosive charges while they were in mid-air, causing them to activate early and maximize damage. On Kamino, during Tarkin's battle simulation, he shot Wrecker's airborne knife into the head of a battle droid. On Skako Minor, Crosshair destroyed an entire hallway of battle droids using a single blaster bolt, by precisely firing it into a series of reflective apparatus that bounced off the walls and tore through multiple targets.\nIn addition to his unrivaled marksmanship, Crosshair's enhanced eyesight also allowed him to see objects through low visibility. Following the destruction of Tipoca City, Omega nearly drowned when she swam after AZI-3. Crosshair saved them by precisely hitting the droid with his rifles grappling attachment to pull them both to the surface. He was able to achieve this despite his target being several meters under choppy sea water, a feat made even more incredible by the lack of daylight.\nServing as the Bad Batch's team sniper, Crosshair utilized a customized 773 Firepuncher sniper rifle in combat, though he was also armed with a DC-17 hand blaster. The clone commando wore modified Katarn-class Commando Armor with a semi-circular cutout on the right upper edge of his helmet visor, to adapt to the scope of his sniper rifle. He also used a special type of disk that could stick to surfaces and re-deflect his blaster bolts, allowing him to hit multiple enemies with one shot. Crosshair also owned a comlink that could be mounted on the wrist. After the rise of the Galactic Empire, Crosshair's comlink was given to Omega by the rest of the squad, reasoning that he no longer needed it if he was with the Empire.\nAfter the Order 66 directive in his inhibitor chip was enhanced, he also sported a new Elite Squad Trooper armor model during his Imperial service. His new armor was extremely similar to his older modified Katarn-class Commando Armor model, but it was colored in a sleek dark gray with slight modifications added to the armor itself, some examples are that his visor lacking the semi-circular cutout on the right side of his helmet and the addition of \"grills\" found on the Phase II clone trooper helmet. The helmet's visor was also changed from black to green in color.\nGeorge Lucas had a very specific vision of the Bad Batch, in that he wanted a version of The Dirty Dozen with clones. Dave Filoni sketched their appearances which Brent Friedman and Matt Michnovetz used to imagine the Bad Batch's voices and personalities. Matt and Brent worked with Dave to flesh out the characters and their story where Crosshair was based on Clint Eastwood, like a Clone version of Cad Bane.\nCrosshair was to appear in a four episode arc written by Michnovetz which starred the Bad Batch which now included \"Echo,\" alongside Yoda on Kashyyyk. At the \"Untold Clone Wars\" panel at Celebration Anaheim, Dave Filoni talked about the plot of the arc. He revealed that the characters would ride on \"giant ape lizards,\" that were holy to the Wookiees in a religious way. In one scene Tarfful would ask the tree spirits for permission to go into battle against the enemy, which was a Trandoshan and the Separatist Alliance. To get the enemy out of some of their cities they would have to burn some of the trees. The Clones had no problem with it, but it was upsetting to the Wookiees. A part of the arc would be about the Clones and the Wookiees finding a common ground to fight the Separatists. A story reel clip was shown at the panel, which showed the Bad Batch and other Wookiees riding on the \"ape lizards\" and battle against a new beast that was based on kinraths from the Star Wars: Knights of the Old Republic game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Image",
  "/wiki/Template:Cleanup",
  "/wiki/Template:Update",
  "/wiki/Replacements",
  "/wiki/Bounty_Lost",
  "/wiki/Devil%27s_Deal",
  "/wiki/Rescue_on_Ryloth",
  "/wiki/War-Mantle",
  "/wiki/Return_to_Kamino",
  "/wiki/Kamino_Lost",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Clone_Force_99",
  "/wiki/Galactic_Empire",
  "/wiki/CT-9904%27s_Elite_Squad",
  "/wiki/Clone_commando",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Sniper",
  "/wiki/Order_66",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Military_rank",
  "/wiki/Clone_Commander",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Tipoca_City",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Republic_Military",
  "/wiki/Squad",
  "/wiki/Clone_trooper",
  "/wiki/Trooper",
  "/wiki/Wrecker",
  "/wiki/Transport",
  "/wiki/Troop",
  "/wiki/Cut_Lawquane",
  "/wiki/Saleucami",
  "/wiki/Battle_of_Anaxes",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Cyber_Center",
  "/wiki/CT-5597",
  "/wiki/Clone_Marshal_Commander",
  "/wiki/CC-2224",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Clone_Sergeant",
  "/wiki/Hunter",
  "/wiki/Echo",
  "/wiki/Lola_Sayu",
  "/wiki/Skako_Minor",
  "/wiki/Techno_Union",
  "/wiki/Purkoll",
  "/wiki/Keeradak",
  "/wiki/Poletec",
  "/wiki/Poletec_village",
  "/wiki/Chief",
  "/wiki/Qin_Yazal",
  "/wiki/Purkoll_Tower_Base",
  "/wiki/D1-series_aerial_battle_droid",
  "/wiki/Wat_Tambor",
  "/wiki/Octuptarra_tri-droid",
  "/wiki/Marauder_(Omicron-class)",
  "/wiki/Fort_Anaxes",
  "/wiki/Invulnerable",
  "/wiki/Admiral",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Trench",
  "/wiki/Conquest_of_Kaller",
  "/wiki/Padawan",
  "/wiki/Kanan_Jarrus",
  "/wiki/Jedi_Master",
  "/wiki/Depa_Billaba",
  "/wiki/CC-10/994",
  "/wiki/Sergeant",
  "/wiki/Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Omega",
  "/wiki/Foodstuff",
  "/wiki/Prime_Minister",
  "/wiki/Lama_Su",
  "/wiki/Mission_to_Onderon_(Clone_Force_99)",
  "/wiki/Onderon",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Saw_Gerrera",
  "/wiki/Vice_Admiral",
  "/wiki/Rampart",
  "/wiki/ES-01",
  "/wiki/Mission_to_Onderon_(Elite_Squad)",
  "/wiki/Unidentified_female_Onderonian_fighter",
  "/wiki/Mission_to_Ord_Mantell_(Clone_Force_99)",
  "/wiki/Ord_Mantell",
  "/wiki/Comlink",
  "/wiki/Reunion",
  "/wiki/Bracca",
  "/wiki/Scrapper_Guild",
  "/wiki/Mission_on_Bracca",
  "/wiki/Unidentified_Venator-class_Star_Destroyer_(Clone_Force_99)",
  "/wiki/ES-03",
  "/wiki/Turbolaser",
  "/wiki/ES-04",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/Ion_engine",
  "/wiki/Ryloth",
  "/wiki/Lessu",
  "/wiki/Gobi_Glie",
  "/wiki/Orn_Free_Taa",
  "/wiki/Cham_Syndulla",
  "/wiki/Rescue_of_Hera_Syndulla_(Ryloth)",
  "/wiki/Imperial_refinery",
  "/wiki/Howzer",
  "/wiki/Extraction_on_Daro",
  "/wiki/Daro",
  "/wiki/ES-02",
  "/wiki/Treason",
  "/wiki/Vibroblade",
  "/wiki/Saberjowl",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Kilometer",
  "/wiki/773_Firepuncher_rifle",
  "/wiki/Commando",
  "/wiki/Battle_droid",
  "/wiki/Second",
  "/wiki/Unidentified_Onderonian_refugee",
  "/wiki/Youngling",
  "/wiki/Eye",
  "/wiki/Anaxes",
  "/wiki/AZI-345211896246498721347",
  "/wiki/Sniper_rifle",
  "/wiki/DC-17_hand_blaster",
  "/wiki/Katarn-class_Commando_Armor",
  "/wiki/Helmet",
  "/wiki/Elite_Squad_Trooper",
  "/wiki/George_Lucas",
  "/wiki/Dave_Filoni",
  "/wiki/Brent_Friedman",
  "/wiki/Matt_Michnovetz",
  "/wiki/Cad_Bane",
  "/wiki/Yoda",
  "/wiki/Kashyyyk",
  "/wiki/Celebration_Anaheim_(2015)",
  "/wiki/Wookiee",
  "/wiki/Tarfful",
  "/wiki/Trandoshan",
  "/wiki/Kinrath/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Category:Images_of_CT-9904",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Bad_Batch_(episode)",
  "/wiki/A_Distant_Echo",
  "/wiki/On_the_Wings_of_Keeradaks",
  "/wiki/Unfinished_Business_(episode)",
  "/wiki/The_Clone_Wars:_Season_7:_Volume_1",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Aftermath_(episode)",
  "/wiki/Cut_and_Run",
  "/wiki/Rampage_(episode)",
  "/wiki/Decommissioned",
  "/wiki/Battle_Scars",
  "/wiki/The_Bad_Batch_Season_2",
  "/wiki/LEGO_STAR_WARS:_Celebrate_the_Season",
  "/wiki/The_Pumpkin_Batch",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Clone_Wars:_The_Final_Countdown",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/StarWarsKids.com",
  "/wiki/2021_Topps_Star_Wars:_The_Bad_Batch_Exclusive_Set",
  "/wiki/Star_Wars:_I_Am_a_Clone_Trooper",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Bad_Batch",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Databank_(website)",
  "/wiki/File:WreckerTweet.png"
 ]
}