{
 "name": "CT-9/85",
 "display_name": "CT-9/85",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Navy",
      "Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "CT-9/85 was a clone trooper who served the Galactic Republic during the Clone Wars. Around 22 BBY, he was stationed on the supercruiser Nexu, where he served as communications technician under Admiral Arikakon Baraka. During that year, the Nexu was sent to Ord Cestus in order to support Jedi Masters Kit Fisto and Obi-Wan Kenobi, who had been dispatched to the planet to stop the production of JK-13 droids. Stationed in orbit over Ord Cestus, CT-9/85 received a transmission from from a clone on the surface, who ordered an orbital bombardment on his position. CT-9/85 informed Baraka of the message, and the Nexu then fired on the position, wiping out the Five Families of Cestus Cybernetics, an organization allied with the Confederacy of Independent Systems.\nCT-9/85 was one of the many clones of the Mandalorian bounty hunter Jango Fett who were born on the planet Kamino to fight for the Galactic Republic. Around 22 BBY, CT-9/85 served as a naval communications technician on the supercruiser Nexu, under the command of Mon Calamari Admiral Arikakon Baraka. At that time, the Nexu was stationed over Vandor-3 for a clone trooper training program on the planet. Shortly afterward, the Nexu was dispatched to the Outer Rim world Ord Cestus in order to support Jedi Masters Kit Fisto and Obi-Wan Kenobi in their mission to stop the production of JK-13 security droids on the planet's surface. While CT-9/85 remained with the Nexu in orbit, the Republic ground forces ran into trouble and ordered that the Nexu carry out an orbital bombardment on ChikatLik, the capital of Ord Cestus.\nSoon after, CT-9/85 received a signal from one of the ARC troopers accompanying Fisto and Kenobi on priority sequence. When CT-9/85 informed Baraka of the signal, the Mon Calamari went to CT-9/85's station and asked for the data content of the message that was contained in the signal. The message stated that the Nexu should change the coordinates for the orbital bombardment to a location east of the Kibo Lake, on Ord Cestus. After Baraka checked the position, he ordered the Nexu to open fire on the designated location, wiping out the Five Families of Cestus Cybernetics, an organization in league with the Confederacy of Independent Systems. Fisto and Kenobi were then able to complete the mission successfully.\nCT-9/85 was a veteran communications technician. He was skilled at his job, as he was able to quickly analyze the ARC trooper's transmission and give it to Admiral Baraka. When Baraka questioned the message's legitimacy, CT-9/85 assured him it was genuine, revealing that the trooper was calling for the bombardment on his own position—which he believed to be a very serious matter. As a Jango Fett clone, CT-9/85 stood 1.83 meters tall.\nCT-9/85's first and only appearance to date in Star Wars canon was in the 2004 novel The Cestus Deception, written by Steven Barnes, in which CT-9/85 served as a minor character.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Supercruiser",
  "/wiki/Nexu_(starship)",
  "/wiki/Technician/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Arikakon_Baraka",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Ord_Cestus/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Mission_to_Ord_Cestus",
  "/wiki/Planet/Legends",
  "/wiki/JK-13_security_droid",
  "/wiki/Orbit/Legends",
  "/wiki/CT-96/298",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Five_Families_of_Cestus_Cybernetics",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Time/Legends",
  "/wiki/Vandor-3",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/ChikatLik",
  "/wiki/Capital/Legends",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Kibo_Lake",
  "/wiki/Trooper/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/2004",
  "/wiki/The_Cestus_Deception",
  "/wiki/Steven_Barnes",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}