{
 "name": "Curi",
 "display_name": "Curi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Radnor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Radnoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Curi was a Radnoran who lived in the years prior to the Clone Wars.\nAlong with her brother Galen, Curi worked in a weapons factory, handling business deals, while Galen was developing deadly new weapons for Radnor. After creating a particularly dangerous toxin, Dol Heep, an ambassador from the neighboring world of Avon, demanded that his world have exclusive rights to it, offering large sums of money to have it.\nGalen seemed eager to sell it to the Avoni and collect payment, however due to the Radnoran's longstanding distrust for the Avoni, Curi convinced him to refuse the offer. All seemed well until somehow their toxin was released into the air and devastated Radnor. Millions of Radnorans were killed or near death. Curi believing that it was her own fault, made it her duty to help get the sick medical attention and worked in the Isolation Sector.\nWhen a team of Jedi was sent by the Galactic Senate to help evacuate survivors, Curi met with the Masters and had them patrol the Isolation Sector. She also introduced them to Dol Heep, whom she believed was on ambassadorial duty for Avon and became stranded on Radnor. Heep offered a fleet of Avoni ships to help with the evacuation.\nAfter it was discovered that the toxin had a short half-life and was soon harmless, Curi began to wonder why Galen did not know this. Along with proof the Jedi uncovered, it was revealed that Galen was helping the Avoni evacuate Radnor for them to conquer it. He would then be rewarded with vast riches on another world.\nAfter Galen was brought into custody, Curi was infuriated with him. She held a blaster to his head in rage for nearly two hours. Despite Galen's pleas for forgiveness she let her brother rot in prison.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Radnor/Legends",
  "/wiki/Radnoran",
  "/wiki/Gender/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galen_(Radnoran)",
  "/wiki/Poison/Legends",
  "/wiki/Dol_Heep",
  "/wiki/Planet/Legends",
  "/wiki/Avon",
  "/wiki/Avoni",
  "/wiki/Death/Legends",
  "/wiki/Isolation_Sector",
  "/wiki/Jedi/Legends",
  "/wiki/Mission_to_Radnor",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Jedi_Quest:_The_Way_of_the_Apprentice",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}