{
 "name": "Cycyed Ock",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Keredian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cyber-optic wire"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Partisans",
      "Gullet Gang"
     ]
    }
   ]
  }
 ],
 "content": "Cycyed Ock was a male Keredian who was a member of Saw Gerrera's partisans movement during their insurgency against the Galactic Empire on the moon Jedha. In the year 0 BBY, Ock was present in the partisans' base in the Catacombs of Cadera when a group of captives including Gerrera's adoptive daughter Jyn Erso were brought in. Shortly after their arrival, the partisans were forced to flee when the Empire destroyed the nearby Jedha City with their Death Star superweapon, creating a blast wave that also destroyed the catacombs. Some time after surviving these events, Ock and Kullbee Sperado found their way to the opposite hemisphere of the moon. After discovering a smuggler's guide left behind by Shesslaria, the two left Jedha in hopes of finding Maz Kanata's treasure on Iskalon with their old crew, which consisted of Nersiton, Isin, and Rufork Tamson. While initially seizing the treasure, they were soon captured and thrown into Megalox Beta Penitentiary.\nOck had a cyber-optic wire connected directly to his brain which granted him sharper vision, allowing him to analyze kyber crystal deposits, examine microcircuitry and throw his vibrorang weapon with unerring accuracy.\nCycyed Ock first appeared in the film Rogue One: A Star Wars Story, which was released in North America on December 16, 2016. He was not identified in the film, but received a name in the accompanying reference book Star Wars: Rogue One: The Ultimate Visual Guide, which was written by Pablo Hidalgo and released the same day. He was portrayed by Robert Nairne, who also played Kullbee Sperado in the film, with the animatronics performed Patrick Comerford.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Keredian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cyber-optic_wire",
  "/wiki/Partisans",
  "/wiki/Gullet_Gang",
  "/wiki/Saw_Gerrera",
  "/wiki/Jedha_insurgency",
  "/wiki/Galactic_Empire",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Catacombs_of_Cadera",
  "/wiki/Jyn_Erso",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Jedha_City",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Kullbee_Sperado",
  "/wiki/Shesslaria",
  "/wiki/Maz_Kanata",
  "/wiki/Iskalon",
  "/wiki/Nersiton",
  "/wiki/Isin",
  "/wiki/Rufork_Tamson",
  "/wiki/Brain",
  "/wiki/Kyber_crystal",
  "/wiki/Vibrorang",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/December_16",
  "/wiki/2016",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Robert_Nairne",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Alien_Archive"
 ]
}