{
 "name": "D'Wopp",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Toola"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Whiphid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Over 2.5 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pale yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lady Valarian"
     ]
    }
   ]
  }
 ],
 "content": "Lord D'Wopp was a male Whiphid bounty hunter who married Lady Valarian, a crime boss and Jabba the Hutt's main competitor on the planet Tatooine during the Galactic Civil War. D'Wopp truly loved to hunt, which ultimately led him to his demise. When he accepted a bounty offer for the smuggler Han Solo from Jabba during their wedding reception, Valarian killed him with her bare, clawed hands. His body was returned to his homeworld of Toola, missing more than a few pieces. Only Valarian and her cook knew where the rest went.\nA male Whiphid, D'Wopp was born on Toola, an ice planet located within the Outer Rim Territories. He later joined the bounty hunting profession, which was a somewhat quotidian occupation on his homeworld, and he became a hunter of great repute as well as a lord.\nIn 0 BBY, the Tatooinian crime boss Lady Valarian—a Whiphid herself—chose to procure a mate from her homeworld, and she picked D'Wopp. Valarian had him travel to the city of Mos Eisley, her base of operations on the planet Tatooine. As soon as he arrived in Mos Eisley, D'Wopp started scouting the surroundings of the spaceport looking for hunting grounds. Eventually, the wedding ceremony occurred as planned, and everything seemed to go well for the Whiphid hunter, who had found a wealthy and powerful mate who was considered a great beauty by other Whiphids. The couple planned to spend their honeymoon hunting ferocious Krayt dragons, even though it required crossing the territory of Jabba Desilijic Tiure, Valarian's arch-rival on Tatooine.\nAfter the ceremony, the newlyweds went to Valarian's Lucky Despot casino, where a wedding reception was held. The event was attended by many invited guests, and the music was supplied by the famous Bith band Figrin D'an and the Modal Nodes. D'Wopp and Valarian made a grand entrance, with their arms lashed together with a garland of imported greenery. They danced their way to the stage through the assembled guests. When Valarian was asked to check on the kitchen employees, the Whiphid hunter was left alone for a moment. Taking advantage of the Lady's absence, a Duros employee of Jabba approached D'Wopp and told him of the bounty his master had put on the Corellian smuggler Han Solo's head. At first, the Whiphid hunter told the Duros he did not need money, but he experienced a change of heart when he was told Solo was a fierce bait. Eager to prove his worth, D'Wopp decided to leave the reception immediately and investigate Solo's whereabouts. The hunter thought his new wife, a fierce and proud Whiphid like himself, would understand his sudden disappearance.\nHowever, the hunter had overestimated the indulgence of his new mate, Valarian. While D'Wopp was preparing to vacate the premises, the Whiphid crime lady reappeared out of the crowd and started insulting him. D'Wopp replied in the same tone, and soon husband and wife started attacking each other in front of everyone and in the middle of the dance floor. Quickly, the brawl spread among the guests, with Jabba's henchmen cheerleading. In the midst of the altercation, Lady Valarian ended up killing her husband with her clawed hands. She was now without a man, and the Lucky Despot had been wrecked. A few days later, D'Wopp's body was sent back to Toola in a box, with several parts of his body missing—only the widow and her cook knew what had happened to them.\nStanding at a height of over 2.5 meters, D'Wopp was a towering Whiphid with a lumpy head and a coat of pale yellow fur. He was known for his ferocity, lending credence to the Whiphid reputation for fierceness. He was also extremely proud of his well-above average hunting skills, and he would not miss a single opportunity to demonstrate his worth by capturing a \"fierce bait.\" When Jabba's Duros thug approached him about working, D'Wopp was already eager to \"splash\" a new victim.\nAlthough he ultimately abandoned her for hunting on the very day of the wedding reception, Lord D'Wopp was strongly attracted to Valarian—at least on a physical level. The hunter was also quick to take offence when the Duros compared his new bride to a big catch.\nLady Valarian's late husband first appeared in August 1995 in \"We Don't Do Weddings: The Band's Tale,\" a short story authored by Kathy Tyers for the anthology Tales from the Mos Eisley Cantina. He was also mentioned in \"Let Us Prey: The Whiphid's Tale,\" another short story published in January 1996. In that story, the late hunter was referred to as Valarian's \"first husband,\" suggesting she may have remarried later.\nThere is a slight discrepancy in the sources regarding D'Wopp's height. In \"The Band's Tale,\" both D'Wopp and Valarian were described as \"two gargantuan Whiphids—two and a half meters of tusk and claw and pale yellow fur.\" In the 2012 reference book The Essential Reader's Companion, D'Wopp was depicted as visibly taller than his bride, whose height was established as 2.5 meters in The Essential Guide to Characters. However, since the Bith Doikk Na'ts was the in-universe narrator of \"The Band's Tale,\" his estimate of the Whiphids' respective heights may have been inaccurate.\nIn the audio dramatization of \"The Band's Tale,\" D'Wopp was voiced by voice actor/musician Danny Louis of the band Gov't Mule. His name was , which is a homophone of doo-wop—a style of rhythm and blues vocalizing developed in the United States in the 1950s.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Toola/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Whiphid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Valarian/Legends",
  "/wiki/Thwim",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Wedding_of_Valarian_and_D%27Wopp",
  "/wiki/Death/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Lady_Valarian%27s_cook",
  "/wiki/Reproduction/Legends",
  "/wiki/Water/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/City/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Krayt_dragon/Legends",
  "/wiki/Lucky_Despot",
  "/wiki/Casino/Legends",
  "/wiki/Music/Legends",
  "/wiki/Bith/Legends",
  "/wiki/Figrin_D%27an_and_the_Modal_Nodes/Legends",
  "/wiki/Plant/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Unidentified_Duros_thug",
  "/wiki/Corellian/Legends",
  "/wiki/Currency/Legends",
  "/wiki/Heart/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Standard_day/Legends",
  "/wiki/Hair/Legends",
  "/wiki/August",
  "/wiki/1995",
  "/wiki/We_Don%27t_Do_Weddings:_The_Band%27s_Tale",
  "/wiki/Kathy_Tyers",
  "/wiki/Tales_from_the_Mos_Eisley_Cantina",
  "/wiki/Let_Us_Prey:_The_Whiphid%27s_Tale",
  "/wiki/January",
  "/wiki/1996",
  "/wiki/Tooth/Legends",
  "/wiki/2012",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Doikk_Na%27ts/Legends",
  "/wiki/In-universe",
  "/wiki/We_Don%27t_Do_Weddings:_The_Band%27s_Tale_(audio)",
  "/wiki/Danny_Louis",
  "/wiki/1950s",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Squadrons_Over_Corellia",
  "/wiki/Empire_Blues:_The_Devaronian%27s_Tale",
  "/wiki/Tales_from_Jabba%27s_Palace",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Area_Film_Satirized%E2%80%94Star_Wars_in_the_Onion",
  "/wiki/Star_Wars_Insider_52",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Template:SWGTCG",
  "/wiki/Battle_of_Tatooine_(Galactic_Civil_War)",
  "/wiki/The_Essential_Atlas",
  "/wiki/Galaxy_Guide_4:_Alien_Races",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Databank_(original)",
  "/wiki/October_31",
  "/wiki/2018",
  "/wiki/File:Danny_DWopp.png",
  "/wiki/August_18"
 ]
}