{
 "name": "D%27nar",
 "display_name": "D'nar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "D'nar was a Human male bounty hunter who was active during the Cold War between the Galactic Republic and the reconstituted Sith Empire. Around the year 3643 BBY, an individual affiliated with the Empire killed D'nar while the bounty hunter was in the eastern part of the Rust Yards outside the city of Jiguuna on the planet Nal Hutta.\nA Human male bounty hunter, D'nar lived during the Cold War, a period of unrest between the Galactic Republic and the Sith Empire. Around the year 3643 BBY, D'nar stayed near a stolen shuttle located by the coast in the eastern part of the Rust Yards, an industrial area outside the city of Jiguuna on the planet Nal Hutta.\nWhile in the Rust Yards, D'nar was killed by an individual affiliated with the Sith Empire.\nD'nar wore a silver-, red-, and tan-colored suit of armor while on Nal Hutta. The armor featured a back-mounted pack connected to the chest plate with a pipe. The armor's left gauntlet contained a small missile launcher and a flamethrower. D'nar also carried a blaster pistol.\nD'nar first appeared in Star Wars: The Old Republic, a 2011 BioWare–LucasArts MMORPG. In the game, the bounty hunter appears as a lower-level boss on Nal Hutta—known in-game as Hutta—the starting planet for the bounty hunter and Imperial agent classes. However, any Imperial player class—bounty hunter, Imperial agent, Sith Inquisitor, or Sith Warrior—can kill D'nar, and the bounty hunter's death is one of the required kills for completing the \"Hutta's Most Wanted\" achievement. While the achievement is not required to continue with any of the main storylines, this article is written with the assumption of 100 percent game completion. D'nar's species and gender cannot be identified from the game.\nIn the Star Wars: The Old Republic Explorer's Guide, D'nar is listed among the quest-related non-player characters for the Rust Yards, even though D'nar is neither the starting nor ending character for any quest in the game. During the game's recurring Bounty Contract Week event, D'nar does not spawn, as the bounty hunter's location is the area used to fight Grov the Destroyer, who is the kingpin bounty on the planet Hutta.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Old_Republic_era",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Darts_D%27Nar/Legends",
  "/wiki/Zygerrian/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/3643_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Standard_year/Legends",
  "/wiki/Death/Legends",
  "/wiki/Rust_Yards",
  "/wiki/City/Legends",
  "/wiki/Jiguuna",
  "/wiki/Planet/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Canon",
  "/wiki/Sith/Legends",
  "/wiki/Color/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Wrist_rocket_launcher",
  "/wiki/Flamethrower/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/2011",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Bounty/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Hunter_(individual)",
  "/wiki/Cipher_Nine",
  "/wiki/Darth_Nox",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Species/Legends",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Grov_(Evocii)",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}