{
 "name": "D%27Mayna_Stallaphalat",
 "display_name": "D'Mayna Stallaphalat",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Third Sun Cantina"
     ]
    }
   ]
  }
 ],
 "content": "D'Mayna Stallaphalat, known as Stella for short, was a female Bith who lived at the time of the Galactic Civil War. She owned and ran the Third Sun Cantina in the small desert town of Mos Taike on the Outer Rim world of Tatooine.\nStella's father left her for herself on the harsh desert planet when she was a small child. She grew up on the planet and later acquired the cantina in Mos Taike, running the establishment for many years. In this position, she got to know everyone in town and was friends with many people, including spies, miners, officers, farmers, Rebels, and cops.\nIn 1 ABY a group of customers, including Bent Spur, left her cantina without paying their debts. Stella paid a spacer to track down Spur and the others and get the credits from them. When the spacer returned with the money, Stella paid the adventurer a small reward. The powerful crime lord Jabba the Hutt had also taken interest in her cantina. A small criminal named Ulek Talstin stole the cantina's deed and tried to take it to Jabba to impress the Hutt and become a member of his gang. This would have made Jabba the owner of Stella's business. As Mos Taike was a lawless place where the law came out of a blaster barrel, she couldn't go to the police. She once again asked the spacer to help her. The adventurer found Talstin in the desert near the town and had to kill him when Talstin opened fire. Stella was very grateful when the spacer returned with the valuable stolen deed.\nTo deal with the looming threat of Jabba muscling in on the Third Sun, Stella paid a Bothan spy to secure information for her. As the spy shouldn't sent any data over the HoloNet, the spacer agreed to help Stella once again and meet the Bothan out in the desert. He brought back the datadisc that contained the promise and threat of Lady Valarian, Jabba's local rival. If Jabba tried to take over the cantina, Valarian's gang would attack the cantina and destroy the building. Stella then sent this information to Jabba, hoping that it would convince Jabba to leave her business alone.\nStella was left on Tatooine by her father as a small child and not only managed to survive on the harsh desert world, but also successfully built a small business in the lawless town of Mos Taike. She made contact with many people, many of them fringers and even some Rebels, though she tried to hide her contacts with Rebels from others.\nTo stay in business in Mos Taike, Stella had to be tough. If someone tried to run without paying their debts, Stella didn't hesitate to hire muscle to track the culprit down. She was also faced with the threat of the powerful and influential Jabba the Hutt, one of the most powerful beings in the Outer Rim. But she didn't give up the business she had built over the years and fought Jabba, using his rival, Lady Valarian, to fend off the Hutt's takeover attempts.\nStella was a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies, prior to the games closure on December 15, 2011. She could be found in the Third Sun cantina in Mos Taike on Tatooine. She offered three small quests to players that involved traveling out into the desert to meet and/or kill NPCs. For each of the three quests, the players received 30 credits.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Third_Sun_Cantina",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Desert/Legends",
  "/wiki/City/Legends",
  "/wiki/Mos_Taike/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Miner/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Farmer/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Police_officer/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Bent_Spur",
  "/wiki/Spacer/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Ulek_Talstin",
  "/wiki/Blaster/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Valarian/Legends",
  "/wiki/Sony",
  "/wiki/December_15",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide"
 ]
}