{
 "name": "Da'Gara",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "25 ABY",
      "Helska IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yuuzhan Vong empire",
      "Praetorite Vong",
      "Praetorite Vong"
     ]
    }
   ]
  }
 ],
 "content": "Da'Gara was a male Yuuzhan Vong prefect of the Praetorite Vong. He also was the commander of the first Vong worldship to enter the galaxy at Vector Prime. During the Yuuzhan Vong empire's invasion of the galaxy, Gara collaborated with Vong agent Nom Anor, who helped Gara throughout his campaigns. Later, he led the Praetorite Vong to the ice planet of Helska IV, where Gara established a base, while his worldship resided out of the icy crust of the planet, as the Vong had found the world as a perfect staging area for their future invasion. Later, Gara led his forces in an attack which destroyed Sernpidal. As the enemy of the Vong, the New Republic, speculated that the Vong had a base under Helska's icy crust, they sent a task force to the world. As Gara knew that the New Republic forces were closing in, he sent thousands of coralskippers to engage the enemy, in the meantime, however, Jacen Solo fought Vong forces on the planet. As the coralskippers attacked and protected the Praetorite Vong's base, so did a yammosk, which protected the planet with a force field, making the New Republic unable to destroy the Vong base.\nAs the task force pulled back, as their lead ship, the Rejuvenator, had been destroyed by the Vong, three starships, theMerry Miner, the Jade Sabre, and the Millennium Falcon, coordinated their plan to defeat the Praetorite Vong, which consisted of using shieldships to reflect the yammosk's effects into the planet, which would destroy Helska, and therefore, the Vong forces on the planet. After the New Republic remnants rescued Solo, they used three shieldships to reflect the yammosk's powers towards the base, destroying the planet's crust and later making it explode, killing all Praetorite Vong on the planet, as well as prefect Da'Gara.\nIn 25 ABY, some scientists at the Extragalactic Society listening post ExGal-4 tracked an asteroid to the Helska system, which in reality, was Da'Gara's worldship. Which would collide with the ice planet of Helska IV if it followed its vector. As the worldship travelled toward the icy world, Tu Shoolb, one of Gara's worldship's crew informed Da'Gara that he had consulted the worldship's yammosk, which was anxious to begin.\nLater, when Danni Quee, a scientist from ExGal, arrived at Helska, the Yuuzhan Vong forces captured her and locked her up deep within Helska's ice. Afterward, Kyp Durron's student Miko Reglia plunged down with his T-65 X-wing starfighter. He was also captured but died in the Vong's custody. When the New Republic managed an offensive against the Yuuzhan Vong, they rescued Danni Quee and destroyed the battle coordinator yammosk, both inside Helska's frozen core. They managed to super cool Helska by using shieldships to evaporate the surface ice, which upon re-warming caused the planet to shatter. Da'Gara and the yammosk were killed, and the Praetorite Vong were defeated and destroyed. After losing the fight, the Yuuzhan Vong were humiliated, and accelerated their invasion.\nDa'Gara first appeared in the 1999 novel The New Jedi Order: Vector Prime, written by R. A. Salvatore, the first volume in the Star Wars: The New Jedi Order novel series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Da%27Gara",
  "/wiki/25_ABY/Legends",
  "/wiki/Helska_IV",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Yuuzhan_Vong_empire",
  "/wiki/Praetorite_Vong",
  "/wiki/Prefect/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Da%27Gara%27s_worldship",
  "/wiki/The_galaxy/Legends",
  "/wiki/Vector_Prime",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Nom_Anor",
  "/wiki/Water/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Helska_IV_base",
  "/wiki/Destruction_of_Sernpidal",
  "/wiki/Sernpidal/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Yorik-et",
  "/wiki/Darth_Caedus",
  "/wiki/Unidentified_yammosk",
  "/wiki/Force_field/Legends",
  "/wiki/Rejuvenator",
  "/wiki/Starship/Legends",
  "/wiki/Merry_Miner",
  "/wiki/Jade_Sabre",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Shieldship",
  "/wiki/Scientist/Legends",
  "/wiki/Extragalactic_Society",
  "/wiki/Listening_post/Legends",
  "/wiki/ExGal-4",
  "/wiki/Asteroid/Legends",
  "/wiki/Helska_system",
  "/wiki/Koros-Strohna",
  "/wiki/Danni_Quee",
  "/wiki/Kyp_Durron",
  "/wiki/Miko_Reglia",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Death/Legends",
  "/wiki/Yammosk",
  "/wiki/1999",
  "/wiki/The_New_Jedi_Order:_Vector_Prime",
  "/wiki/R._A._Salvatore",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/Boba_Fett:_A_Practical_Man",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}