{
 "name": "Daakman Barrek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mrlsst"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Hypori"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.92 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "A Padawan",
      "Sha'a Gi"
     ]
    }
   ]
  }
 ],
 "content": "Daakman Barrek was a male Human from the planet Mrlsst, who lived during the last years of the Galactic Republic. At an early age, Barrek's mother discovered that he was Force-sensitive and willingly gave Daakman over to the Jedi Order. Barrek became a powerful member of the Order, quickly ascending to the rank of Master after training his first Padawan, and took a second apprentice named Sha'a Gi. In 22 BBY, Barrek and Sha'a Gi were operating in the Outer Rim when they received word that war had broken out between the Republic and Confederacy of Independent Systems on Geonosis, and that Barrek's first apprentice had died in the fighting.\nSaddened by this news, Barrek accepted the rank of Jedi General in the Republic's clone army. Four months after the start of the war, Barrek and Gi uncovered intelligence that the Separatists had built a battle droid factory on Hypori, and the two were tasked with leading an elite task force in destroying the factory. However, their battle plan went horribly wrong once the task force's transport ships exited hyperspace over Hypori, hitting an orbital mine grid, causing them to crash land on the planet. The Separatists' droid army then began to assault the crashed Republic ships, killing what was left of Barrek's clone forces, leaving Daakman and the task force's Jedi trapped in the wreckage. Stranded behind enemy lines, Barrek tried to contact General Obi-Wan Kenobi on Muunilinst, but was attacked by the battle droids' leader, General Grievous. Barrek managed to reach Kenobi and inform his fellow Jedi on his task force's situation and call for an extraction, but Grievous—a highly advanced cyborg trained in lightsaber combat—cut down the Jedi Master before help could arrive.\nDaakman Barrek was a male Human born to highly educated professors on the academy planet of Mrlsst. Barrek's mother—a famed geneticist—soon discovered her son's high midi-chlorian count through a blood screening test she had done herself. Realizing that Barrek was Force-sensitive, she contacted the High Council of the Jedi Order, hoping her descendant would find greatness serving the Galactic Republic as a Jedi Knight. Barrek was taken into the Order and trained as a Jedi, quickly showing that he was adept in the ways of the Force. Barrek eventually took on a Padawan learner, successfully achieving the title of Jedi Master in his mid-thirties after the padawan became a Jedi Knight.\nThe Jedi Master later discovered Sha'a Gi, a young Force-sensitive Human from the planet Ord Biniir, and took Gi back to the world Coruscant to become his new apprentice. Although young Gi was often cowardly and possessed self-doubt while alone, Barrek strengthened his new Padawan's confidence when he was close by, and the two worked well together.\nBarrek and Gi were disrupting pirate activity in the Outer Rim Territories when the pair received word that Barrek's first padawan had been sent to Geonosis and had died in the fighting against the Separatist Alliance. Saddened by the death of his former Padawan, Jedi Master Barrek committed himself fully to the war effort, gladly accepting the position of Jedi General in the new military.\nFour months into the war, Barrek and Gi were again investigating pirate activity in the Outer Rim when they discovered intelligence on a secret battle droid droid factory on the industrial planet of Hypori. After alerting the Jedi Council, Barrek was given command of a task force made up of several elite Jedi—including Jedi Council members Ki-Adi-Mundi and Shaak Ti—and clone trooper units, and ordered to destroy the droid factory on Hypori.\nHowever, Barrek's mission quickly collapsed into disaster once the Republic task force arrived at Hypori. As soon as Barrek's forces exited hyperspace over Hypori, their Acclamator-class transports hit an orbital mine grid, causing their ships to crash land on the Separatist planet, deep behind enemy lines. While Barrek, Gi, and the other Jedi managed to survive the crash, most of the task force's clone troopers were killed in the landing, and Confederate factory deployed thousands of battle droids to assault the Republic's landing site. Led by General Grievous—an advanced cyborg trained in lightsaber combat—the Separatist droid forces killed what was left of Barrek's clone troopers, and trapped the Jedi in the wreckage of their ships.\nRealizing the Jedi were no match for Grievous and his battle droids, Barrek attempted to contact General Obi-Wan Kenobi, currently stationed on Muunilinst, via hologram. However, as Barrek reached Kenobi and his apprentice Anakin Skywalker, Grievous attacked the Jedi Master and engaged Barrek in a lightsaber duel. Barrek managed to inform Kenobi of his task force's situation and call for an extraction while fending off Grievous's attack, but the cyborg proved too powerful for Master Barrek, striking down the Jedi Master.\nGrievous then assaulted the remaining Jedi trapped in the wreckage. After Barrek was killed by Grievous, Gi's resolve was shattered by the loss of his master, and as a result, Gi was easily killed by Grievous, along with another Jedi. Kenobi's evacuation squad managed to reach the surviving Jedi and evacuate them before Grievous could kill them all.\nDaakman Barrek loyally served the Galactic Republic and the Jedi Order, first as a Jedi Master during peace times, and later at the start of the Clone Wars, gladly accepting the rank of general in the Republic's new military.\nMaster Barrek cared about his current and former padawans. Barrek was extremely saddened after being informed that his first apprentice had died on Geonosis. Barrek also strengthened the resolve of his second padawan, Sha'a Gi, who was known to be awkward and craven while alone. However, Barrek's presence bolstered Gi's confidence, and the two worked well together.\nA powerful Force-sensitive, Daakman Barrek had enough expertise in the ways of the Force that he reached the rank of Jedi Master by his mid-30s and had the ability to train an apprentice to Knighthood. A renowned swordsman, Barrek was considered to be one of the most skilled duelists in the Jedi Order. However, Barrek was not talented enough to defeat General Grievous in a lightsaber duel, and although the Jedi Master managed to parry several attacks from Grievous, an exhausted Barrek was eventually cut down by the cyborg.\nDaakman Barrek first appeared in Chapter 20 of the Star Wars: Clone Wars animated television series, which aired April 8, 2004. In the episode, Barrek was only called Master Barrek, and was voiced by Daran Norris, who also voiced Barrek's fellow Jedi Ki-Adi-Mundi and Tarr Seirr. Barrek was later given an entry in the Star Wars Databank, which revealed his full name and his backstory. Master Barrek also appeared in a mobile strategy game, Star Wars: Battle for the Republic, and was later mentioned in the novel Labyrinth of Evil.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mrlsst/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Great_ReSynchronization",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Hypori/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Daakman_Barrek%27s_first_Padawan",
  "/wiki/Sha%27a_Gi",
  "/wiki/File:MasterBarrekComeIn-CW20.ogg",
  "/wiki/Planet/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Battle_of_Hypori/Legends",
  "/wiki/Acclamator-class_assault_ship",
  "/wiki/Hyperspace/Legends",
  "/wiki/Space_mine",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/General/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Muunilinst/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Professor",
  "/wiki/Mrlsst_Trade_and_Science_Academy",
  "/wiki/Daakman_Barrek%27s_mother",
  "/wiki/Geneticist/Legends",
  "/wiki/Midi-chlorian/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Ord_Biniir/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Death",
  "/wiki/File:BattleOfHypori2-CW20.ogg",
  "/wiki/Droid_factory",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Task_force/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Tarr_Seirr",
  "/wiki/The_Muunilinst_10",
  "/wiki/File:Sha%27aGi-CW20.ogg",
  "/wiki/Clone_Wars_Chapter_20",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/April_8",
  "/wiki/2004",
  "/wiki/Daran_Norris",
  "/wiki/Star_Wars",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Battle_for_the_Republic",
  "/wiki/Labyrinth_of_Evil",
  "/wiki/Category:Audio_files_of_Daakman_Barrek",
  "/wiki/Star_Wars_Insider",
  "/wiki/Unknown_Soldier:_The_Story_of_General_Grievous",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/The_Official_Star_Wars_Fact_File_(2013)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_3_(2013)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_6",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_New_Essential_Chronology"
 ]
}