{
 "name": "Dace Vinagar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3996 BBY",
      "Nilrebmah system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Brotherhood of the Sith"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Orb Telorn",
      "Exar Kun"
     ]
    }
   ]
  }
 ],
 "content": "Dace Vinagar was an apprentice to the Jedi archivist Orb Telorn, and lived during the Great Sith War.\nVinagar was one of the Jedi who joined Exar Kun, in search for power and knowledge, but didn't participate to the pogrom nor implied himself in the war, instead staying with his master.\nSometime after the Battle of Foerost, Vinagar and his master encountered a group of adventurers, said to be time travelers. He helped his master to search for information about a legendary Sith Lord, Ku'ar Danar, whose tomb was found by Sli'Lon Tahar. The now deceased Jedi Master tried to prevent the return of Danar.\nThe Jedi order, however, was not inclined to trust those adventurers and jailed them for interrogation. But Telorn, with the help of his apprentice, managed to free them. Vinagar then participated to an expedition in the search of the Sith tomb, in the Nilrebmah system.\nOn Nilrebmah XIII, Vinagar helped the adventurers to fight the Dark Side creatures, but as they noticed, the beast just ignored him most of the time. He finally tried to kill his comrades when they found the monolith, stole their ship and went to the tomb by himself to explore it.\nKu'ar Danar, sensing the presence of Vinagar, lured him in the depth of the planet. Danar slowed the adventurers by reanimating the skeletons of the civilization he destroyed, gaining time for Dace Vinagar to come inside the monolith. He then empowered the apprentice with his own Force abilities, allowing him to unleash dark side beasts on his pursuers. The Fallen Jedi then revealed to his comrades that he belonged to the Brotherhood of the Sith and that he would used the power of the monolith to overthrow Exar Kun. The beasts gave Vinagar just enough time to finish an old ritual and activate the monolith, liberating the spirit of Ku'at Danar. Cursing the Force spirit of the Fallen Jedi when his body started to consume itself, Vinagar let his rage amplify the power of the ritual and was finally changed in a giant Hydra moved by pure energy.\nThe entire planet started to collapse, as it moved toward Nilrebmah XII, and the hydra was shot down by a Krath starship commanded by Ulic Qel-Droma, effectively ending the life of Vinagar.\nDace Vinagar was an ambitious, opportunistic Jedi apprentice who searched power through the Dark side of the Force. Contrary to other members of the Brotherhood of the Sith, he didn't killed his master but rather stayed with him.\nHe enjoyed battle and took great pleasure in killing, but was clever enough to maintain his good image. However, his treacherous nature led him to his doom, as his attempt to betray Exar Kun was punished by another treason, that of Danar.\nDace Vinagar was proficient in meditation and competent with a lightsaber. He obtained, during his last moments, great powers from Ku'ar Danar, as he was able to summon beasts and protect himself with Force deflection.\nDace Vinagar was created by Philippe Rat and Mehdi Sahmi for the ambiguously canon roleplaying scenario \"Le Facteur X\" which appeared in the French magazine Casus Belli 115.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/3996_BBY",
  "/wiki/Nilrebmah_system",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Brotherhood_of_the_Sith",
  "/wiki/Orb_Telorn",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Jedi_archivist/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Jedi_pogrom",
  "/wiki/Battle_of_Foerost_(Great_Sith_War)",
  "/wiki/Time_travel/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Ku%27ar_Danar",
  "/wiki/Sli%27Lon_Tahar",
  "/wiki/Nilrebmah_XIII",
  "/wiki/Force_ghost",
  "/wiki/Hydra",
  "/wiki/Nilrebmah_XII",
  "/wiki/Krath/Legends",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Meditation/Legends",
  "/wiki/Force_deflection/Legends",
  "/wiki/Philippe_Rat",
  "/wiki/Mehdi_Sahmi",
  "/wiki/Canon",
  "/wiki/Roleplaying_game",
  "/wiki/Casus_Belli_115",
  "/wiki/Casus_Belli",
  "/wiki/Le_facteur_X"
 ]
}