{
 "name": "Dade Hetkins",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic right leg"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Dade Hetkins was a male human soldier of the New Republic.\nDade Hetkins and his team were assigned to cleanup duty in the weeks after the destruction of the second death star. While on patrol, a single scout trooper threw a thermal detonator near Hetkins and it took off the lower half of his right leg. His team was able to triage his leg and save Dade's life.\nAfter his injury, Hetkins found himself in the veteran hospital in Darropolis on Hosnian Prime under the care of Doctor Arsad. The doctor fit him up with a prosthetic lower leg to replace the one lost on Endor. Although the prosthetic foot provided sensations, he was aware of the differences. Before allowing him to leave, the doctor asked Hetkins a series of questions to verify his mental health. He gave lies to most of the questions in his eagerness to leave, but the doctor's FX-7 droid revealed Hetkins's deception. The doctor prescribed group therapy and a new droid, QT-9, as a companion for Hetkins.\nHetkins was not happy losing his leg on Endor and was also not thrilled with his new metal prosthetic, although he would learn to live with it. Even though he had a poor outlook on life, he genuinely did not have suicidal thoughts.\nDade Hetkins was a minor point-of-view character who first appeared in Chuck Wendig's 2016 novel Aftermath: Life Debt.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Cybernetics",
  "/wiki/Limb",
  "/wiki/New_Republic",
  "/wiki/Doctor",
  "/wiki/Arsad",
  "/wiki/Ewok",
  "/wiki/New_Republic_soldier",
  "/wiki/Standard_week",
  "/wiki/Battle_of_Endor",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Scout_trooper",
  "/wiki/Thermal_detonator",
  "/wiki/Darropolis",
  "/wiki/Hosnian_Prime",
  "/wiki/Endor",
  "/wiki/FX-7_medical_assistant_droid",
  "/wiki/QT-9",
  "/wiki/Suicide",
  "/wiki/Chuck_Wendig",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)"
 ]
}