{
 "name": "Dael_Margok",
 "display_name": "Dael Margok",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3637 BBY",
      "Rishi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nova Blades",
      "Order of Revan"
     ]
    }
   ]
  }
 ],
 "content": "Dael Margok, often referred to simply by the honorific Commodore, was a male Zabrak mercenary and criminal who worked as the commander of the Nova Blades pirate gang during the Galactic War. In 3637 BBY, Revan commissioned the Blades to remap hyperspace routes around Rishi, and Margok spearheaded the Blades' work. Revan had also commissioned a Mandalorian clan led by Torch, but backed out from the Order of Revan's control due to Margok's actions.\nMargok was the commander and unquestioned leader of the Nova Blades pirate gang operating on Rishi, and by the start of the Galactic War, he sat atop the planet's highest criminal heap. In 3637 BBY, Margok was contacted by Revan to use the Blades for hyperroute attacks and conflicts against both Republic and Imperial patrols, blocking many major hyperspace routes. Margok temporarily worked alongside a local Mandalorian clan, but due to his actions, the clan stopped working for the Order and retreated further into Rishi.\nIn the same year, the Blades were attacked by an unknown gang, losing several weapons stockpiles to aerial attacks at the Skyline Falls camp. Margok was contacted by the officer in charge, Donovarr, who asked that the camp be evacuated before all was lost. Margok flatly refused, ordering Donovarr to kill the intruders, but the officer was killed and his command outpost bombed out. Soon thereafter, the Nova Blades' slave camp was also attacked, and the majority of the slaves were released from Blade custody. Hearing the news of the attacks, Revan cut off the deal with the Blades, claiming that they had \"served their purpose.\" Margok quickly tried to cover up the incidents, but Revan was not fooled, and ordered that the threat be dealt with before resuming any alliance.\nMargok retreated to the Blades' headquarters, a crashed corvette called the Aggressor, preparing his forces to retaliate against the rival pirates. During these preparations, several comm towers were destroyed and salvaged for decoder modules by the gang, allowing the Aggressor to be located. An agent of the gang battled through Blade forces to get through to the ship, but were stopped at the main hatch. Margok contacted the operative, cursing the rival pirates and announcing his readiness to settle the conflict. The agent fought through the ship to the command deck, where Margok confronted the gang's forces. He was killed in the ensuing conflict.\nLight-skinned with dark Zabrak facial tattoos, Margok was feared throughout Rishi as a mercenary and gangster. Taking over the Nova Blades after the departure of his forebearers, he established a reputation as a merciless and controlling criminal, and due to the control he executed over the Nova Blades, nobody dared to question that fact. He ran the Blades with ruthless efficiency, and did not change tactics when the gang was commissioned by Revan to attack Republic and Imperial patrol routes.\nMargok first appeared in Star Wars: The Old Republic: Shadow of Revan, an expansion to the video game Star Wars: The Old Republic, released in 2014. Based upon the player's faction, holo messages intercepted by Theron Shan look slightly different, with some changes in dialogue. For Republic players, Margok is seen speaking directly to Revan about retracting the Nova Blades' contract, while for Imperial players, Margok is seen first speaking to a Revanite captain, demanding to see Revan, before threatening to renege on their deal, forcing Revan to step into the conversation.\nMargok is voiced by Liam O'Brien.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Dael_Margok",
  "/wiki/3637_BBY",
  "/wiki/Rishi/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nova_Blades",
  "/wiki/Order_of_Revan",
  "/wiki/Pirate/Legends",
  "/wiki/Galactic_War",
  "/wiki/Revan/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mandalore_the_Avenger",
  "/wiki/Hyperlane",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Donovarr",
  "/wiki/Aggressor_(Rishi)",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Theron_Shan",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/3638_BBY",
  "/wiki/2013",
  "/wiki/Standard_year/Legends",
  "/wiki/2014",
  "/wiki/3636_BBY",
  "/wiki/Galactic_Standard_Calendar"
 ]
}