{
 "name": "Dafi  (bounty hunter)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "H'nemthe"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  }
 ],
 "content": "Dafi was a H'nemthe bounty hunter who was active during the Galactic Civil War. A longtime rival of the Lepi smuggler Jaxxon, Dafi developed a lifelong grudge against the Lepi after a botched run that cost Dafi two fingers and his starship. In 0 ABY, Dafi helped an associate named Remel Fud hunt down Jaxxon on Nar Shaddaa and tortured his sworn enemy, but was shot and killed by Jaxxon's partner, Amaiza Foxtrain.\nA H'nemthe male, Dafi worked as a bounty hunter on the Outer Rim during the era of the Galactic Civil War. Dafi's base of operations at one point included the Corus system, where he met Jaxxon, a rough-and-tumble Lepi who at the time was running with a mercenary crew known as the Boys of Corus. Dafi and Jaxxon developed a rivalry, one that intensified after a botched run in the Corporate Sector. The fiasco cost Dafi not only his ship, but a finger from both of his hands—Dafi blamed Jaxxon for the run's failure, subsequently counting the Lepi as one of his most bitter enemies.\nIn 0 ABY, Dafi finally got the chance to settle the score. An old acquaintance, Remel Fud, had found himself in the employ of a hunter named Beilert Valance, a vicious former Imperial stormtrooper officer who had been rebuilt as a cyborg after suffering crippling combat injuries. Valance was on the trail of a pair of high-profile Imperial bounties—Rebel heroes Han Solo and Luke Skywalker—and believing the path to his targets led through Jaxxon, had dispatched Fud to track the Lepi down. Fud offered Dafi the opportunity to join him in the hunt for Jaxxon, and the H'nemthe jumped at the chance, even bringing some of his own muscle along for the ride.\nDafi and Fud tracked Jaxxon down on the \"Smuggler's Moon\" of Nar Shaddaa, cornering the Lepi in an alleyway and shocking him into unconsciousness with an electroshock net. The hunters hog-tied Jaxxon and attempted to question him as to the whereabouts of Solo and Skywalker, and Dafi delighted in torturing his old rival with an \"Agony Inducer,\" a device of Fud's own design. However, the Lepi refused to budge, and before Dafi and Fud managed to extract the Rebels' location, Jaxxon's partner, Amaiza Foxtrain, arrived and gunned both hunters down. Although Fud ultimately managed to survive thanks to his tough, rubbery skin, Dafi died from his wound.\nAn orange-skinned, yellow-eyed H'nemthe, Dafi was the type to hold a grudge—specifically, against the Lepi spacer Jaxxon, whom he blamed for the loss of not only his starship, but two of his fingers. Jaxxon's capture at the hands of Dafi and Fud allowed the H'nemthe to show off a sadistic side, as he took great joy in torturing his longtime rival.\nDafi first appeared in Star Wars  16, written by Archie Goodwin and released in 1978. Appearing as a nemesis of the rabbit-like Jaxxon, \"Dafi\" was named as an homage to Daffy Duck, a Looney Tunes character who was a rival of Bugs Bunny. Much of Dafi's backstory, including his species, was given 35 years later in The Not-So Magnificent Seven, a StarWars.com blog post written by Greg Mitchell. During his appearance in the Marvel Star Wars series, Dafi was illustrated by Walt Simonson.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/H%27nemthe_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Lepi/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Jaxxon",
  "/wiki/Limb/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Remel_Fud",
  "/wiki/Torture/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Death/Legends",
  "/wiki/Amaiza_Foxtrain/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Corus_system",
  "/wiki/Time/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Boys_of_Corus",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Beilert_Valance/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Electroshock_net",
  "/wiki/The_Agony_Inducer",
  "/wiki/Eye/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Star_Wars_(1977)_16",
  "/wiki/Archie_Goodwin",
  "/wiki/1978",
  "/wiki/Rabbit",
  "/wiki/Species/Legends",
  "/wiki/The_Not-So_Magnificent_Seven",
  "/wiki/StarWars.com",
  "/wiki/Greg_Mitchell",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Walter_Simonson",
  "/wiki/Wizards.com",
  "/wiki/The_Hunt_Within:_Valance%27s_Tale:_Part_2",
  "/wiki/So_Uncivilized:_Great_Gunslingers_in_Star_Wars",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Pablo_Hidalgo"
 ]
}