{
 "name": "Dahna",
 "display_name": "Dahna",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Jeosyn"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Teal"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Partisans",
      "Dreamers",
      "Dreamers"
     ]
    }
   ]
  }
 ],
 "content": "Dahna was a female Twi'lek who was the second in command of the rebel group known as the Dreamers. When she led the Dreamers Piikow, Nadrine, Ru Vushan, and Kaev on a mission to Otor's Hub, she decided to take in Seyn Marana, an Imperial agent who was undercover as a slave so she could join infiltrate the Dreamers. Dahna, a former slave herself, decided to help her out of kindness at allowed her to join them despite resistance from her fellow rebels. She later helped to interrogate Iden Versio, another Imperial agent who the Dreamers believed had turned traitor. As the group developed more trust for Versio, Dahna took her to their makeshift shooting range. Days after their new recruits arrived, Dahna, Kaev, and Halia Vushan went on a supply run, gathering containers filled with fruit the group affectionately called Dahna fruit because of how fond Dahna was of the tangy-sweet food.\nDespite her fierceness as a rebel in the field, she maintained a unique sympathy for Marana, taking her under her wing due to the fact that she believed they had a similar experience being enslaved. Dahna was fueled by her sense of righteous duty and, despite the brutality of the Dreamers, participated willingly in what she believed was serving the greater good.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/0_ABY",
  "/wiki/Jeosyn",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Partisans",
  "/wiki/Dreamers",
  "/wiki/Piikow",
  "/wiki/Nadrine",
  "/wiki/Ru_Vushan",
  "/wiki/Kaev",
  "/wiki/Otor%27s_Hub",
  "/wiki/Seyn_Marana",
  "/wiki/Galactic_Empire",
  "/wiki/Slavery",
  "/wiki/Iden_Versio",
  "/wiki/Agent",
  "/wiki/Halia_Vushan",
  "/wiki/Dahna_fruit",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Dahna",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)"
 ]
}