{
 "name": "Daizanna",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3641 BBY",
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Iesei Killik nest"
     ]
    }
   ]
  }
 ],
 "content": "Daizanna was a female Human living during the Cold War. She became the Joiner in the Iesei Killik nest and came to fully associate herself with it. Iesei and other nests have traveled through space in the far reaches of the galaxy and had no contact whatsoever for millennia with the nests left on Alderaan. This changed when the nests became aware of the presence of Vector Hyllus, the Joiner and Dawn Herald of the Oroboro nest who nevertheless left Alderaan and was traveling in the company of Cipher Nine. Killik flit ships have tracked the X-70B Phantom-class prototype that Vector was on and Daizanna was the one to establish contact with him. The Iesei rejoiced at finding their lost brothers and Daizanna invited Vector to their feasting. Later, Vector, also member of the Imperial Diplomatic Service, attempted to establish formal relations between the Sith Empire and the Killiks. Daizanna was one of the Killik representatives invited and though she could smell the men's fear of Killiks and the Joiners, she believed a peace offer could be made. Unfortunately, a xenophobic Imperial Falner Oeth decided to sabotage the peace talks and brought a bomb into one the meetings. Daizanna perished in the explosion while saving a Human ambassador and Oeth, who did not conceal his actions, used her death to make an anti-Killik speech he has prepared. Nevertheless, thanks to the effort of Vector Hyllus, Oeth was apprehended and a formal diplomatic relation between Killik nests and the Sith Empire was established.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3641_BBY",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Iesei",
  "/wiki/Killik/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Joiner",
  "/wiki/The_galaxy/Legends",
  "/wiki/Vector_Hyllus",
  "/wiki/Dawn_Herald",
  "/wiki/Oroboro",
  "/wiki/Cipher_Nine",
  "/wiki/X-70B_Phantom-class_prototype",
  "/wiki/Imperial_Diplomatic_Service",
  "/wiki/Falner_Oeth",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}