{
 "name": "Dal Azim",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Oppo Rancisis"
     ]
    }
   ]
  }
 ],
 "content": "Dal Azim was a human male Jedi Padawan during the High Republic Era who was apprenticed to the Thisspiasian Jedi Master Oppo Rancisis. Sometime by 232 BBY, Azim assisted Rancisis on a mission to the planet Zygerria, where they attacked a Zygerrian Alliance slave camp. They rescued and freed many slaves, including the Twi'lek Lourna Dee, whom they saved from being attacked by the Zygerrian Keeper Vardem Kroleyic. Using the Force, Azim also freed Dee from the shock collar placed on her by the Zygerrians.\nDal Azim was a human male and the Padawan of the Thisspiasian Jedi Master Oppo Rancisis during the High Republic Era. Sometime by 232 BBY, when he was fifteen years old, Azim joined Rancisis on a mission to the planet Zygerria with the Galactic Republic. Azim and Rancisis attacked a Zygerrian Alliance slave camp on the planet in order to free the slaves held there.\nAzim and Rancisis eventually broke into slave pens and saved the enslaved Twi'lek Lourna Dee from the Zygerrian Keeper Vardem Kroleyic, who was attacking her after she had attempted to use the Jedi's attack as an opportunity to revolt. After Kroleyic was incapacitated by Rancisis using the Force, Azim checked on Dee, before introducing himself and his master and telling her that they were there to help. Dee told Azim that the slaver had shot her friend, to which Azim offered condolences and an apology. He then comforted her and assured her of her safety.\nLater, after the fighting was done, Azim led Rancisis to meet Dee outside the slave pens. Rancisis had heard that she had led a revolt and wanted to speak with her. When asked of her origin by Rancisis, Dee stated that she was from nowhere, but Azim refuted this, insisting that everyone was from somewhere, which Rancisis agreed with.\nAfter Dee expressed her anger at being captured, Rancisis offered to help Dee by removing the shock collar that was placed around her neck, assigning the task to Azim as he believed it would be an interesting challenge for him. Dee was hesitant to allow him to, as she believed that it would shock her if they tried to remove it without a key, but Rancisis assured her that Azim could do it using the Force. At Rancisis's prompt, Azim used the Force to deactivate the electronic mechanism to safely unlock the collar, saying that the Force was with them as he did so. Dee thanked Azim, who then removed the collar off her neck for her.\nAfterward, Rancisis convinced Dee to attend the Carida Military Academy. He checked in on her frequently, and during one such check-in, she expressed that she felt like she could not thrive there because she was unlike Azim or Rancisis.\nDal Azim was kind and compassionate. After rescuing her from slavers, Azim made sure to check on Lourna Dee and her health to make sure that she was alright. He then offered condolences when she revealed to him that her friend had been killed. He also assured her that she was safe.\nHaving been trained as a Jedi, Dal Azim knew how to use the Force and was able to move objects telekinetically. Azim used the Force to deactivate and unlock a shock collar that had been placed on Lourna Dee.\nDal Azim appeared in flashbacks in the 2021 audio drama The High Republic: Tempest Runner, written by Cavan Scott. The character's last name was first revealed in the drama's 2022 script release.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Dal",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Jedi_Order",
  "/wiki/Oppo_Rancisis",
  "/wiki/File:Dal_Here_to_help.ogg",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/High_Republic_Era",
  "/wiki/Thisspiasian",
  "/wiki/Jedi_Master",
  "/wiki/232_BBY",
  "/wiki/Planet",
  "/wiki/Zygerria",
  "/wiki/Attack_on_the_Zygerrian_slave_camp",
  "/wiki/Zygerrian_Alliance",
  "/wiki/Zygerrian_slave_camp",
  "/wiki/Slavery",
  "/wiki/Twi%27lek",
  "/wiki/Lourna_Dee",
  "/wiki/Zygerrian",
  "/wiki/Keeper",
  "/wiki/Vardem_Kroleyic",
  "/wiki/The_Force",
  "/wiki/Shock_collar",
  "/wiki/File:Dal_everyone_is_from_somewhere.ogg",
  "/wiki/Standard_year",
  "/wiki/Galactic_Republic",
  "/wiki/Unidentified_human_slave_(Lourna_Dee)",
  "/wiki/File:Dal_here_she_is.ogg",
  "/wiki/Carida_Academy",
  "/wiki/File:Dal_youre_safe.ogg",
  "/wiki/File:Dal_the_force_is_with_us.ogg",
  "/wiki/Telekinesis",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Cavan_Scott",
  "/wiki/2022",
  "/wiki/The_High_Republic:_Tempest_Runner_(script)",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Category:Audio_files_of_Dal_Azim",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Nihil"
 ]
}