{
 "name": "Dal Rogos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Dal Rogos was an Human male agent of the Imperial Security Bureau during the Galactic Civil War.\nRogos was tracking Rebels on the Ithorian Herdship Bazaar, hoping to capture them and the merchant who was aiding them in their activities, when he learned of the murder of two obscure miners in the Graveyard of Alderaan. Vaguely aware of an operation being carried out there by Darth Vader, Ragos determined to follow discreetly to prevent any interference in Vader's plans by the Rebels. When he reached the Graveyard, Rogos made contact with Captain Janus Bonn—who was leading the operation—and offered his services and information.\nDal Rogos was an undercover agent for the ISB with an moderately successful mission record. He was trained to blend in to his surroundings, wherever he may be sent. At first glance, he seemed to be a personable man, willing to aid a needy stranger if moved to do so. In truth, he was a ruthless and efficient killer and completely loyal to Emperor Palpatine's New Order. As with most in the Imperial ranks, Rogos believed in Human High Culture and disliked contact with non-Human species, though due to the nature of his job forced him to have a working understanding of several alien languages.\nRogos often choose to wear a stylish white turban and the robes of a merchant which could easily conceal his ever-present blaster. Rogos was an ambitious man, always keeping an eye and ear open for Rebel activity and Rebel sympathizers he could report to his superiors, earning him more favor and a higher status within the ISB ranks. He was also a languages teacher on Gendoraan.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Ithorian_Herdship/Legends",
  "/wiki/Bazaar_(Ithorian_Herdship)",
  "/wiki/Merchant/Legends",
  "/wiki/Miner/Legends",
  "/wiki/The_Graveyard",
  "/wiki/Alderaan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Janus_Bonn",
  "/wiki/Spy/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Human_High_Culture",
  "/wiki/Blaster/Legends",
  "/wiki/Gendoraan",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Dal_Rogos",
  "/wiki/Graveyard_of_Alderaan",
  "/wiki/West_End_Games",
  "/wiki/Classic_Adventures:_Volume_Two"
 ]
}