{
 "name": "Dal_(Cathar)",
 "display_name": "Dal  (Cathar)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cathar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic Navy",
      "Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "Dal was a Cathar male who served as Captain of the Daybreaker during the Cold War.\nIn 3643 BBY, a Jedi Knight traveled to the medical frigate when the ship was under attack by an Imperial boarding party. The Knight and Kira Carsen boarded the ship and aided Dal, Doctor Senessa, and the rest of the crew in defeating the Imperials. Making their way to the bridge, Dal and Senessa explained how Darth Angral combined the Planet Prison, Shock Drum, and Death Mark laser into a single weapon: the Desolator and used it to destroy the planet Uphrades.\nWhen Doctor Senessa detected lifeforms on the planet, meaning there were survivors, but without supplies and help. Dal argued that if the Daybreaker landed on the planet, the ion field that had been generated by the Planet Prison component of the Desolator would destroy the ship's engines and trap them there. Dal told the Knight that as much as he wanted to help, he had a family to consider. He tried to convince the Knight to let them go by bribing the Jedi with the frigate's medical supplies, but the Knight instead informed Senessa of Dal's treachery. Dal disgustedly left in an escape pod while Senessa prepared to navigate the debris field and land on what was left of Uphrades' surface.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cathar/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Captain/Legends",
  "/wiki/Daybreaker",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3643_BBY",
  "/wiki/Hero_of_Tython",
  "/wiki/Kira_Carsen",
  "/wiki/Doctor/Legends",
  "/wiki/Senessa",
  "/wiki/Darth_Angral",
  "/wiki/Planet_Prison",
  "/wiki/Shock_Drum",
  "/wiki/Death_Mark_laser",
  "/wiki/Desolator_(superweapon)",
  "/wiki/Planet/Legends",
  "/wiki/Uphrades",
  "/wiki/Escape_pod/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}