{
 "name": "Dalla_Solo",
 "display_name": "Dalla Solo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Duro"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 52 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Amber"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Dalla Solo, also known as Dalla Suul or Dalla the Black, was a Human male of Corellian ancestry who became a notorious pirate around the time of the Clone Wars. He was sometimes said to have been the rightful heir to the Corellian throne, and the grandfather of Han Solo, but it is not clear whether either of these claims was correct.\nDalla was born on Duro, the son of Korol Solo, who claimed to be the descendant of Berethron e Solo, and who was executed for his pretensions to the throne. Korol's son assumed the pseudonym Dalla Suul to disguise his identity, and carved out a career as a pirate and kidnapper, earning the nickname \"Dalla the Black\". His illegitimate daughter was the mother of Threkin Horm, but Han Solo's father, Jonash Solo, was said to have been his firstborn, and legitimate, son.\nSometime following 0 BBY, Dalla had set up a little camp in the remote Agrilat crystal swamps on Corellia. When a spacer found him there, Solo told him that he was searching for a new partner. If the spacer would help him with a problem, Solo would consider showing the spacer his trade. He sent the spacer to kill a Gran named Yensi Kolyin, but when the spacer returned successfully, Solo withdrew his offer and told the spacer that he needed to think about it some more.\nIn The Courtship of Princess Leia, See-Threepio says that Dalla was born \"nearly sixty years\" before 8 ABY; but for him to be Han Solo's grandfather with a birth date of around 50 BBY, both he and his son would have had to have sired children in their early teens.\nHowever, this is one of a number of comparable instances where Corellians' ages seem implausibly young: some fans believe that these statements should be retconned as references to a longer calendar year used in the Corellian system.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dalla_Suul",
  "/wiki/Dalla_Solo",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Dalla_Solo",
  "/wiki/Duro/Legends",
  "/wiki/52_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Korol_Solo",
  "/wiki/Berethron_e_Solo",
  "/wiki/Threkin_Horm",
  "/wiki/Jonash_Solo",
  "/wiki/0_BBY/Legends",
  "/wiki/Agrilat_Region",
  "/wiki/Spacer/Legends",
  "/wiki/Gran/Legends",
  "/wiki/Yensi_Kolyin",
  "/wiki/The_Courtship_of_Princess_Leia",
  "/wiki/8_ABY/Legends",
  "/wiki/50_BBY/Legends",
  "/wiki/Retcon",
  "/wiki/Corellian_system",
  "/wiki/The_Paradise_Snare",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/The_New_Jedi_Order:_Ylesia",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}