{
 "name": "Dallan_Morvis",
 "display_name": "Dallan Morvis",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Mandalorian Neo-Crusaders"
     ]
    }
   ]
  }
 ],
 "content": "Dallan Morvis was the second-in-command aboard the Courageous during the Mandalorian Wars. He fought at the battles at Vanquo, Serroco, and Omonoth and was later promoted to the rank of captain and placed in the command of his own capital ship, Veltraa. Eventually, Morvis reached the rank of admiral and gained the command of Diligence.\nHis father was the founder of the Coruscant Financial Exchange and his mother—the senator from Chandrila, so Dallan Morvis has been obviously groomed for big things. But instead of typical thrust into the Naval Academy at Coruscant, Morvis choose to become an asset to the Admiralty.\nUpon graduation, he became a junior liaison between the Vanjervalis design team and Admiral Noma Sommos's staff. That assignment eventually lead him to promotion to lieutenant and his first bridge posting on Reciprocity under command on then-Captain Saul Karath. Morvis saw in Karath a leader on the rise, so he followed him to Courageous—and right into the Mandalorian Wars. But on Courageous, Morvis encountered a rival in the junior officer Carth Onasi. Onasi shared both Karath's hardscrabble beginnings and penchant for quick and sometimes reckless decision-making - neither of which applied to the high-born, calculating Morvis. In Carth, Morvis saw a competitor for the admiral's favor, so he struggled to make life more difficult for him.\nWhen fugitive Padawan Zayne Carrick was brought onboard and later joined them on the escape from Serroco, Morvis showed no sympathy for Onasi's new friend. But it was Onasi and Carrick, without whom Morvis would never escape a career-ending disaster aboard the Arkanian Legacy. There, Morvis suggested to Karath that the Republic use exogorths—weaponized space slugs capable of decimating star systems—to create a firewall of scorched systems between itself and the Mandalorians and urged him to bargain for Republic control of the slugs. But Onasi and Carrick brought the affair to an unfortunate end, leaving Morvis with empty hands back on Coruscant.\nThis time however, Morvis choose to turn to his political connections, which resulted in him not only escaping punishment but also winning a captaincy aboard Karath's successor vessel, the Swiftsure and soon enough—the command of his own capital ship, Veltraa. Morvis, thus, continued to show his talents as a survivor willing to do anything to protect his position—a hidden element of Karath's character he struggled to imitate and cultivate. He eventually became Zayne Carrick's commanding officer during the Mandalorian Wars, and both were captured by the Mandalorians. Eventually Zayne took charge during a prison escape, and the rest of the soldiers began to defer to Zayne. Morvis was enraged and blamed Carrick for everything bad that had happened. Zayne finally had enough and told Morvis that it was his own fault; now that he was in a position where he couldn't rely on favors he didn't know what to do. Morvis finally broke down and admitted that he felt the need to live up to his family's proud legacy. Zayne told him that being a hero meant facing danger when the time came.\nEventually, Morvis was promoted to the rank of admiral and was given the command of his own Inexpugnable-class ship, the Diligence. He was described millennia later by the mercenary brigadier Jarrow Rusher as a capable yet misunderstood officer. Sith Lord Arkadia Calimondra, however, claimed that his accomplishments were fraudulent.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic:_War",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Dallan_Morvis",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Saul_Karath",
  "/wiki/Courageous_(Inexpugnable-class)",
  "/wiki/Mandalorian_Wars",
  "/wiki/Battle_of_Vanquo",
  "/wiki/Battle_of_Serroco",
  "/wiki/First_Battle_of_Omonoth",
  "/wiki/Veltraa",
  "/wiki/Admiral/Legends",
  "/wiki/Diligence_(Inexpugnable-class)",
  "/wiki/Jarrow_Rusher",
  "/wiki/Herron_Morvis",
  "/wiki/Coruscant_Financial_Exchange",
  "/wiki/Morvis_(senator)",
  "/wiki/Senator/Legends",
  "/wiki/Chandrila/Legends",
  "/wiki/Naval_Academy",
  "/wiki/Coruscant/Legends",
  "/wiki/Admiralty_(Galactic_Republic)/Legends",
  "/wiki/Vanjervalis_system",
  "/wiki/Noma_Sommos",
  "/wiki/Lieutenant/Legends",
  "/wiki/Reciprocity",
  "/wiki/Captain/Legends",
  "/wiki/Carth_Onasi",
  "/wiki/Padawan/Legends",
  "/wiki/Zayne_Carrick",
  "/wiki/Serroco",
  "/wiki/Arkanian_Legacy",
  "/wiki/Exogorth/Legends",
  "/wiki/Swiftsure_(Inexpugnable-class)",
  "/wiki/Inexpugnable-class_tactical_command_ship",
  "/wiki/Mercenary/Legends",
  "/wiki/Brigadier",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Arkadia_Calimondra",
  "/wiki/Knights_of_the_Old_Republic_8",
  "/wiki/Knights_of_the_Old_Republic_14",
  "/wiki/Knights_of_the_Old_Republic_15",
  "/wiki/The_Admiral%27s_List:_Remember_Serroco!_Edition",
  "/wiki/Knights_of_the_Old_Republic_17",
  "/wiki/Knights_of_the_Old_Republic_18",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic:_Daze_of_Hate",
  "/wiki/The_Admiral%27s_List:_Karath_Home_Safely",
  "/wiki/Knights_of_the_Old_Republic_31",
  "/wiki/Knights_of_the_Old_Republic_34",
  "/wiki/Knights_of_the_Old_Republic:_War_1",
  "/wiki/Knights_of_the_Old_Republic:_War_2",
  "/wiki/Knights_of_the_Old_Republic:_War_3",
  "/wiki/Knights_of_the_Old_Republic:_War_4",
  "/wiki/Knights_of_the_Old_Republic:_War_5",
  "/wiki/Knight_Errant_(novel)",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_Handbook",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Wizards.com",
  "/wiki/KOTOR_Campaign_Guide_Web_Enhancement_2:_Captain_Dallan_Morvis",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_131",
  "/wiki/Dark_Horse_Comics"
 ]
}