{
 "name": "Dam-Powl",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cathar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Lanoree Brock"
     ]
    }
   ]
  }
 ],
 "content": "Dam-Powl was a Cathar female Je'daii Master who served the Je'daii Order on Tython at the height of the Infinite Empire's reign.\nA member of the Je'daii Order, Dam-Powl was skilled in the Force and had achieved the rank of Master by 10,667 TYA, when she began teaching Force alchemy at Anil Kesh, the Temple of Science. When Je'daii Journeyer Lanoree Brock arrived at the Temple, Dam-Powl began teaching Brock the skills required to master the Alchemy of flesh, a dangerous skill set that were test Brock's ability to remain balanced in the Force. Her most prized student, Dam-Powl and Brock retained a strong relationship in the years that followed Brock's departure from the academy. At some point during her time at Anil Kesh, Dam-Powl genetically altered the Twi'lek Tre Sana in exchange for promises of a wealth, a new identity, and a better life outside of the criminal empire he was a part of on Kalimahr. Serving as her informant and spy for a time, Dam-Powl made use of Sana during the Stargazer Uprising, tasking him with assisting Je'daii Brock on her hunt for her rogue brother, Dalien Brock. In the year before the Force Wars, Dam-Powl occasionally served as the Temple Master of Anil Kesh when Temple Master Quan-Jang was away or otherwise unavailable.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tython/Legends",
  "/wiki/Cathar/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Lanoree_Brock",
  "/wiki/Je%27daii_Master",
  "/wiki/Infinite_Empire",
  "/wiki/25,818_BBY",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Anil_Kesh",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Alchemy_of_flesh",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Tre_Sana",
  "/wiki/Kalimahr",
  "/wiki/Stargazer_Uprising",
  "/wiki/Dalien_Brock",
  "/wiki/Force_Wars",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Quan-Jang",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Dam-Powl",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)"
 ]
}