{
 "name": "Dama_Montalvo",
 "display_name": "Dama Montalvo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Cei Vookto",
      "Ki-Adi-Mundi"
     ]
    }
   ]
  }
 ],
 "content": "Dama Montalvo was a Human male Jedi Padawan that served the Jedi Order and Galactic Republic during the Clone Wars. Three months after the war's initiation, Montalvo and his Master, Cei Vookto, fought on behalf of the Republic on the planet Lianna. Although the battle ended in the Republic's favor, Vookto was slain. Montalvo attended Vookto's funeral pyre and came under Jedi Master Ki-Adi-Mundi's command. About three years later, Montalvo was captured by the forces of the newly–established Galactic Empire, led by Emperor Palpatine—the Republic's final Supreme Chancellor—who had declared the Jedi Knights to be traitors. Montalvo was interrogated by the Dark Lord Darth Vader, who hoped to gain information on the whereabouts of the former Jedi Council member Obi-Wan Kenobi. After Montalvo refused to aid the Sith Lord, Vader executed the Jedi.\nA Force-sensitive Human, Dama Montalvo was trained in the ways of the Force by the Jedi Order. Selected as the Padawan of Jedi Master Cei Vookto, Montalvo constructed his own lightsaber during his studies. When the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, Montalvo took up the rank of Commander in the Grand Army of the Republic and joined his master on the front lines.\nDuring the fighting on Lianna, Vookto was slain and Montalvo was able to survive the battle, which ended in a victory for the Republic while the planet was left devastated. When the fighting ended, Grand Master Yoda and Master of the Order Mace Windu presided over Vookto's funeral as the grieving Montalvo stood by. In order to keep Montalvo involved, the Jedi High Council temporarily assigned Montalvo as the Padawan of Master Ki-Adi-Mundi until a suitable replacement could be found.\nSurviving the rest of the war, Montalvo avoided the initial execution of Contingency Order 66 which called for the death of all Jedi. Fleeing from the clone troopers he once served alongside, Montalvo was captured by the newly-founded Galactic Empire and held in a detention facility deep beneath the Senate Building on Coruscant. Tortured by the Sith Lord Darth Vader tirelessly, Vader attempted to extract the location of Obi-Wan Kenobi from the Padawan. Refusing to reveal any knowledge he may have, Vader snapped Montalvo's neck, an action \"less than well done\" according to his master Darth Sidious, who had further interrogations planned.\nComic writer John Ostrander based Dama Montalvo's name after the screen name of a poster on the Dark Horse Comics forums. Ostrander speculated that Montalvo was born in 37 BBY on Alderaan.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cei_Vookto",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Battle_of_Lianna",
  "/wiki/Planet/Legends",
  "/wiki/Lianna/Legends",
  "/wiki/Death/Legends",
  "/wiki/Funeral_of_Cei_Vookto",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Master_of_the_Order/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Senate_Building",
  "/wiki/Torture/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/37_BBY/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Jedi:_Mace_Windu",
  "/wiki/Star_Wars:_Purge",
  "/wiki/Jedi_Council_Forums"
 ]
}