{
 "name": "Damici Stalado",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "Damici Stalado was a human female who believed that physical shape was arbitrary. While undergoing deep-tissue regrafting and splice therapy in 10 BBY, she attended a party on board the First Light, the private yacht of the Crimson Dawn crime lord Dryden Vos. After the yacht arrived on the planet Vandor, Stalado danced on the viewing deck during a performance by the singers Aurodia Ventafoli and Luleo Primoc.\nDamici Stalado was a human female who in 10 BBY was undergoing deep-tissue regrafting and splice therapy to transform her features again. While in the midst of the therapy, she attended a party held by Dryden Vos, a crime lord of the Crimson Dawn syndicate, on board his personal yacht, the First Light. Stalado was on board when the vessel arrived on the planet Vandor, and during a performance by the singers Aurodia Ventafoli and Luleo Primoc, she stood by a table of food on the viewing deck with two other humans while gesturing with her hands. Another woman then joined the trio, and Stalado began dancing as the criminal Han Solo passed by them.\nDamici Stalado was a social chameleon who believed physical shape to be arbitrary. She had dark skin and brown eyes.\nWhile on the First Light, Stalado wore a pink dress made of metachromatic trevalla cloth with a golden belt and neckpiece. She also wore a gold bracelet, golden high-heeled sandals, a black masquerade mask, and a black parabolic headdress that was good at concealing her identity.\nDamici Stalado appeared in the 2018 Anthology Series film, Solo: A Star Wars Story, and was identified in the accompanying reference book, Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/10_BBY",
  "/wiki/First_Light",
  "/wiki/Yacht",
  "/wiki/Crimson_Dawn",
  "/wiki/Crime_lord",
  "/wiki/Dryden_Vos",
  "/wiki/Planet",
  "/wiki/Vandor",
  "/wiki/Musician",
  "/wiki/Aurodia_Ventafoli",
  "/wiki/Luleo_Primoc",
  "/wiki/Starship",
  "/wiki/Foodstuff",
  "/wiki/Han_Solo",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Trevalla_cloth",
  "/wiki/Belt",
  "/wiki/Bracelet",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}