{
 "name": "Damono Deomaley",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Damono Deomaley was a short, male humanoid who was present in Chalmun's Spaceport Cantina on the planet Tatooine shortly before the Battle of Yavin. While he was in the cantina, the Jedi Obi-Wan Kenobi and the former moisture farmer Luke Skywalker entered looking for a pilot, but ended up getting into a fight with two other patrons.\nThe humanoid, male Damono Deomaley spent time in Chalmun's Spaceport Cantina on the planet Tatooine shortly before the Battle of Yavin. While Deomaley was in the cantina, the Jedi Master Obi-Wan Kenobi and the former moisture farmer Luke Skywalker entered, looking for passage to the planet Alderaan. Deomaley, standing between two human males on the opposite side of the bar, safely witnessed Kenobi and Skywalker's conflict with two other patrons, Ponda Baba and Doctor Cornelius Evazan. Following the conflict, Deomaley conversed with one of the two Tonnika sisters by the bar, as Kenobi and Skywalker negotiated with Han Solo in the booth directly behind the pair.\nDeomaley was a short humanoid, with blond hair, green eyes and fair skin.\nThis character appeared uncredited and unnamed in the 1977 film Star Wars: Episode IV A New Hope. In 2015, during the \"Secrets of the Mos Eisely Cantina\" panel at Celebration Anaheim, Pablo Hidalgo identified the individual as being incorrectly known by the production name \"Little Aunt Beru\", and allowed a fan to choose the in-universe canon name of Damono Deomaley, named partly to honor effects make-up artist Nick Maley who worked on the sequence and contributed much background info about the UK shoot. Production notes for Episode IV made by John Mollo identify \"Little Aunt Beru\" as being played by the actress Gilda Cohen; however, illustrative comparison to images on the fansite Aveleyman.com show that actor Jeff Moon is the one playing the character identified by Hidalgo as \"Little Aunt Beru\". Moon is listed in Mollo's production notes as playing one of four characters with the production name of \"Local ugly man\", suggesting either Mollo's notes, or Hidalgo's identification are incorrect.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Humanoid",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Battle_of_Yavin",
  "/wiki/Cantina",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Moisture_farmer",
  "/wiki/Luke_Skywalker",
  "/wiki/Pilot",
  "/wiki/Jedi_Master",
  "/wiki/Alderaan",
  "/wiki/Ponda_Baba",
  "/wiki/Doctor",
  "/wiki/Cornelius_Evazan",
  "/wiki/Tonnika_sisters",
  "/wiki/Han_Solo",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/2015",
  "/wiki/Celebration_Anaheim_(2015)",
  "/wiki/Pablo_Hidalgo",
  "/wiki/John_Mollo",
  "/wiki/Gilda_Cohen",
  "/wiki/Jeff_Moon",
  "/wiki/StarWars.com",
  "/wiki/The_Art_of_Star_Wars_Episode_IV:_A_New_Hope",
  "/wiki/November_5",
  "/wiki/2018"
 ]
}