{
 "name": "Damon_Krell",
 "display_name": "Damon Krell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Damon Krell was a Human male Admiral in the Imperial Navy in command of a Star Destroyer shortly after the Battle of Hoth. Krell oversaw the production of the augmented Infiltrator probe droid in 3 ABY, which he used in a plot to destroy the Rebel fleet in a bid for recognition from the Emperor. However, his chosen droid suffered a critical error during the mission, resulting in it instead destroying Krell's ship.\nAn officer in the Imperial Navy during the Galactic Civil War, Damon Krell was a Human male who by 3 ABY rose to the rank of Admiral and the command of his own Star Destroyer. In the wake of the Battle of Hoth, Krell oversaw the development of the Infiltrator probe droid, a larger and enhanced version of the more commonplace Viper probe droid with augmented weapons, armor and computer interface capabilities. Produced as part of a joint venture between Arakyd Industries and Imperial technicians, the Infiltrator droid became central to Krell's plan to annihilate the Rebel fleet in one fell swoop, making himself the hero of the war.\nKrell sent an Infiltrator droid designated 13-K to carry out his goals—he planned to direct the probe to capture a Rebel blockade runner, fly the commandeered ship to the Rebel rendezvous point and self-destruct the vessel, causing crippling damage. But while 13-K managed to seize the ship, the arrival of Rebel hero Luke Skywalker complicated matters. Skywalker's presence activated 13-K's previous programming to capture the Rebel and bring him before the Emperor, causing the droid to turn the ship around and attempt to return to Krell's Star Destroyer. However, Skywalker's sabotage and a crucial failure in 13-K's logic capacitators turned the blockade runner into a ticking time bomb, with its reactor primed to blow. Although Krell desperately ordered his crew to fire on the incoming ship, the ensuing explosion ripped through the Star Destroyer and killed everyone aboard.\nAmbitious and cunning, Admiral Damon Krell desired glory and recognition above all else, coveting the attention of the Emperor. That desire drove Krell's schemes to become an Imperial hero, a task he approached in a businesslike manner, looking to limit unknown factors and execute his plan expediently. However, his overconfidence in his Infiltrator probe droid proved to be his downfall, directly causing his death.\nDamon Krell first appeared in Star Wars  45, written by Archie Goodwin and released in 1980. During this appearance, Krell was illustrated by Carmine Infantino.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Infiltrator_probe_droid",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/13-K",
  "/wiki/Starship/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Viper_probe_droid/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Arakyd_Industries/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Probe_droid/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Haven_(rendezvous_point)",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Logic_capacitator",
  "/wiki/Reactor/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Star_Wars_(1977)_45",
  "/wiki/Archie_Goodwin",
  "/wiki/1980",
  "/wiki/Carmine_Infantino",
  "/wiki/The_New_Essential_Guide_to_Droids",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}