{
 "name": "Dané",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "49 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Naboo Underground",
      "Royal House of NabooRoyal Naboo Security Forces",
      "Royal Naboo Security Forces",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Dané was a Human female in training to become one of the elite handmaidens serving the Queen of Naboo. Trained by Captain Quarsh Panaka, she was a competent fighter, and later went into business for herself as a bodyguard, spy, and assassin.\nDané, a Human female, had once hoped to become a musical performer, and she trained on several Naboo instruments in her early teens. When she was 16, the untimely death of her parents left her with a struggling farm and a great deal of debt. Out of options, she let her debtors take ownership of the property, and then journeyed to the nearest large city, Keren, bidding farewell to the home that had been in her family for generations. Using the last of her personal savings, she volunteered for the Royal Naboo Security Forces. After training for a year with the Queen's handmaidens in Theed, she impressed Captain Quarsh Panaka with her keen mind, sharp wits, and natural mimicry skills. Dané did not take well to authority, however, and she requested a transfer from the program. Panaka recommended she look into the Customs Security division, where she soon found a new home on the undercover investigations unit, which allowed her to operate more or less on her own.\nIn 32 BBY, she became a member of the Naboo Underground and played a minor role in defending Naboo from Trade Federation forces.\nLater, she found that her role in Customs Security was not big enough for her ambitions, and she left the division after less than three years. Dané had learned much in that time, and developed into a sharp shot with a blaster, as well as a persuasive negotiator. She had also developed a somewhat flexible morality that was out of place on pastoral Naboo, so she decided the time was ripe to go into business for herself.\nLoaning out her skills to those with the most credits, her reputation grew with each successful contract. She worked as personal bodyguard for a Rodian noble, as a spy for a rival family in the household of a wealthy Chagrian, and several times was contracted to assassinate unfortunate targets. Her initial reservations over becoming a contract killer soon fell by the wayside as the credits continued to roll in. Dané believed that as long as she dealt fairly with those who employed her, she had every right to a clear conscience.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/49_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Naboo_(people)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Naboo_Underground",
  "/wiki/Royal_House_of_Naboo/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Handmaiden/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Quarsh_Panaka/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Music/Legends",
  "/wiki/Death/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Farm/Legends",
  "/wiki/City/Legends",
  "/wiki/Keren/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Handmaidens",
  "/wiki/Theed/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Standard_year/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Rodian/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Chagrian/Legends",
  "/wiki/Star_Wars:_Invasion_of_Theed_Adventure_Game",
  "/wiki/Wizards.com",
  "/wiki/Meet_Dan%C3%A9!",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}