{
 "name": "Dan G'vash",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Tajin Crosser"
     ]
    }
   ]
  }
 ],
 "content": "Dan G'vash was a human male Jedi Padawan. G'vash traveled with his master Tajin Crosser to investigate a disturbance in the Force on the planet Habo. After locating a local village, the two Jedi found a ship that Crosser believed looked like one that a Sith would use. While Crosser suggested they wait together at the ship for the individual to return, G'vash suggested he search through the mountains surrounding the village while his master stayed with the ship. Crosser agreed to the plan, and when G'vash noticed a slain vamga, he shortly after encountered an elder individual wielding two small red lightsabers. G'vash was outmatched by his opponent, suffering a serious injury when he engaged the warrior in a duel, but he was later able to help his master finish off their opponent.\nDan was a determined Padawan apprentice with black hair, blue eyes, and dark skin. He was underwhelmed by his adventures in the Outer Rim Territories, as he was hoping for more exciting action. When visiting Habo with his master, he was able to form a relationship with several local children when he spotted them looking at him, winking and smiling at them and later enlisting their help to explore the mountain areas near their village in his search for a possible Sith warrior. Despite recruiting the children to help him, G'vash felt that he was capable in mountainous terrain.\nNonetheless, G'vash proved himself insightful and wise. He urged the children he enlisted to accompany him exploring the mountains to return to the village upon discovering a recently slain Vamga knowing that something was off. When he unexpectedly found himself confronting the Sith warrior in question—an elderly man who eager for strong opponents to—\nand had to brandish his lightsaber in response of the latter's challenge, G'vash correctly deduced the danger his opponent posed and put up defensive stance instead of attacking head-on hoping to buy Tajin some time to arrive on his side albeit injured in the process. Despite this and the master-padawan duo's failure to learn more information about their enemy as the elderly Sith self-destructed his starship in his last moments, Tajin reminded the young padawan to not forget his training and his kindness and that time will make him stronger even if it would not be last.\nDan G'vash first appeared in \"The Elder,\" a short film in the Star Wars: Visions series. He is voiced by Yuichi Nakamura in Japanese version and Jordan Fisher in the English version.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Tajin_Crosser",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Jedi_Master",
  "/wiki/Disturbance_in_the_Force",
  "/wiki/Planet",
  "/wiki/Habo",
  "/wiki/Sith",
  "/wiki/Mountain",
  "/wiki/Vamga",
  "/wiki/The_Elder",
  "/wiki/Lightsaber",
  "/wiki/Lightsaber_duel",
  "/wiki/Outer_Rim_Territories",
  "/wiki/The_Elder_(short_film)",
  "/wiki/Category:Images_of_Dan_G%27vash",
  "/wiki/The_Elder_(manga)",
  "/wiki/Gangan_Comics",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_Visions_Season_One_Companion",
  "/wiki/Star_Wars_Insider_210"
 ]
}