{
 "name": "Danaan_Kerr",
 "display_name": "Danaan Kerr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Before 33 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Danaan Kerr was a Human male Jedi Knight during the final decades of the Galactic Republic. After the fall of the Republic and the rise of Emperor Palpatine's New Order, Kerr gave in to the dark side of the Force and went insane.\nDanaan Kerr was a Force-sensitive Human male who was accepted into the Jedi Order during the last years of the Galactic Republic. By the time the Clone Wars broke out across the galaxy, Kerr had been elevated to the rank of Jedi Knight. As the Great Jedi Purge was underway, Kerr was tracked down by Darth Vader and the Emperor, but the two Sith realized that Kerr was already slipping toward the dark side of the Force and let him live. As with other Dark Jedi, Palpatine saw their mere existence as serving the dark side, and therefore ultimately serving him as well.\nAfter the fall of the Galactic Empire, Kerr settled on the planet of Rannon. Circa 7 ABY, Kerr began to sense stirrings in the dark side and believed that Palpatine had managed to survive. He then began to terrorize the people of Rannon and recruit and train new Force-sensitives in the ways of the dark side. It seemed that after his detection of the change in the dark side, Kerr's power grew, as the Valley of Ternaax, where he made his home, began to become corrupted, turning to rot in his presence. Word of his depredations spread throughout the Bitrose, Hunnoverrs and Instrop sectors. These rumors of an \"insane dark magician\" reached General Airen Cracken, who composed a file on him along with a bounty of 15,000 credits.\nKerr was a very skilled individual, capable in both lightsaber combat and many Force powers. He was able to control his pain, absorb and dissipate energy, detect life, and engage in telepathy and telekinesis. In addition, he had mastered more advanced Force powers such astelekinetic kill, farsight, transfer Force, and Force lightning.\nIllustrator Mike Jackson based the image of Kerr on uncredited model Rob Deary.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Rannon_(planet)",
  "/wiki/7_ABY/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Transfer_essence",
  "/wiki/Valley_of_Ternaax",
  "/wiki/Bitrose_sector",
  "/wiki/Hunnoverrs_sector",
  "/wiki/Instrop_sector/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Control_Pain",
  "/wiki/Telepathy/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Farsight/Legends",
  "/wiki/Transfer_Force",
  "/wiki/Force_lightning/Legends",
  "/wiki/Mike_Jackson",
  "/wiki/Rob_Deary",
  "/wiki/Wanted_by_Cracken_(sourcebook)"
 ]
}