{
 "name": "Dannl Faytonni",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "76 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Dannl Faytonni was a male human and a known associate of Achk Med-Beq. The two were present in the Outlander Club on Coruscant in 22 BBY when the Clawdite assassin Zam Wesell attempted to hide there to escape the pursuing Jedi Obi-Wan Kenobi and Anakin Skywalker. By the time Kenobi and Skywalker were assisting Wesell at the back of the establishment, Faytonni and Med-Beq were patrolling the second floor of the Outlander conjuring. Three years later, Faytonni attended the Galaxies Opera House the same night Skywalker met with Supreme Chancellor Sheev Palpatine.\nBorn in around 76 BBY on the planet Corellia, Dannl Faytonni was a human male who worked as a low-level con man on the planet Coruscant, where he frequented entertainment establishments in the Uscru District most commonly between levels of Galactic City in the mid-3000s and 4000s range. The Corellian worked in partnership with fellow con man Achk Med-Beq and, after escaping from prison together, the pair procured a set of Coruscant Security Force uniforms in order to impersonate member of the Republic Judiciary in 22 BBY.\nWhile in their newly acquired uniforms, the pair visited the Outlander Club in the Uscru Entertainment District while looking for easy marks. Splitting up, Faytonni ended up lent on the bar while conversing with three human women, one of whom left just as the Jedi Knight Obi-Wan Kenobi was served a drink next to them. The trio continued talking until Kenobi suddenly drew his lightsaber and sliced off the arm of the bounty hunter Zam Wesell, who had been discreetly moving up behind the Jedi with a blaster pistol drawn. Faytonni spun round in surprise, but soon turned back to his conversation as Kenobi escorted Wesell out of the club. He turned again to listen as Kenobi's Padawan, Anakin Skywalker, announced that what the patrons had witnessed was Jedi business, telling them to go back to their drinks. As the Jedi questioned Wesell in an alley outside the club, Faytonni and Med-Beq reunited and plotted together while waling along the club's upper balcony level.\nThe fifty-four year old Faytonni's impersonation of a Judical proved to be his greatest transgression, and an warrant was issued for his arrest at the Level 3921 issuing office. Although the warrant was processed, it was ultimately not deemed to be a priority assignment due to the outbreak of the Clone Wars shortly after, which shifted the Security Force's priority to homeworld security. Nevertheless, Inspector Tanivos Divo of the Coruscant Security Force, who had kept a folder of incident reports on Faytonni, continued to keep a remote eye on the con man and encouraged beat officers in the Uscru District to do the same. While under this surveillance, Faytonni adapted by beginning to offer up usable leads and fragmented information on larger targets to the Security Force in exchange for them mostly turning a blind eye to his illegal racket.\nDivo accepted the situation with reservations, writing in his notes that although he hated such a compromise, he found it hard to argue that Faytonni was even worth the fuel cells it would take to send a speeder to bring him in. He also added a holo of Faytonni selling two spiced death sticks on the sly to an alien patron of the Outlander Club. In 19 BBY, Faytonni was still working as a con artist and wore fake military gear while attending the Galaxies Opera House in the higher levels of the Uscru District. The Corellian walked up the opera house's steps alongside another uniformed human as Skywalker ran past them while on his way to meet Supreme Chancellor Sheev Palpatine inside.\nDuring the New Republic Era, New Republic police commissioner Exantor Divo, grandson of Tanivos Divo, wrote about Faytonni in his book, Scum and Villainy: Case Files on the Galaxy's Most Notorious, which detailed the experiences of three generations of law enforcement officials in his family. He included information from his grandfather's casefile on the con man, including his arrest warrant and the holo of him dealing death sticks.\nDannl Faytonni was a constantly adaptive individual, and found his niche in providing information to other criminals to law enforcement in exchange for his own continued freedom. He had gray hair, blue eyes, and light skin.\nThe stolen uniform that Faytonni wore at the Outlander Club was blue with golden markings on the sleeves and also included black boots and a black belt and braces. In the image used on his arrest warrant, he wore a white shirt under a black jacket. The fake military gear he wore to the opera house was once again blue with gold markings on the sleeves, but this time also included further gold embellishments on the shoulders and neck, as well as a tall blue hat with a logo on the front and gold markings on the sides.\nDannl Faytonni first appeared in the 2002 film Star Wars: Episode II Attack of the Clones and was portrayed by Star Wars veteran Anthony Daniels, the actor who also played C-3PO. In the current Star Wars canon, Faytonni was identified in the 2016 reference book Star Wars: Complete Locations. Daniels' cameo as Faytonni is notable for being the first time the actor had appeared in a Star Wars film without the C-3PO costume covering his body, which would later be followed by his cameo as the Coruscanti con artist Tak during a slave uprising in the spice mines of Kessel in the 2018 film Solo: A Star Wars Story.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Dannl_Faytonni",
  "/wiki/Dannl_Faytonni/Legends",
  "/wiki/Corellia",
  "/wiki/76_BBY",
  "/wiki/Human",
  "/wiki/Corellian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Achk_Med-Beq",
  "/wiki/Outlander_Club",
  "/wiki/Coruscant",
  "/wiki/22_BBY",
  "/wiki/Clawdite",
  "/wiki/Assassin",
  "/wiki/Zam_Wesell",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Time",
  "/wiki/19_BBY",
  "/wiki/Galaxies_Opera_House",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Planet",
  "/wiki/Con_artist",
  "/wiki/Uscru_District",
  "/wiki/Galactic_City",
  "/wiki/Prison",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Clothing",
  "/wiki/Judicial",
  "/wiki/Judicial_Department",
  "/wiki/Uscru_Entertainment_District",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi%27s_second_lightsaber",
  "/wiki/Limb",
  "/wiki/Bounty_hunter",
  "/wiki/KYD-21_blaster_pistol",
  "/wiki/Padawan",
  "/wiki/Standard_year",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Clone_Wars",
  "/wiki/Homeworld",
  "/wiki/Inspector",
  "/wiki/Tanivos_Exantor_Divo",
  "/wiki/Eye",
  "/wiki/Police_officer",
  "/wiki/Fuel",
  "/wiki/Speeder",
  "/wiki/Hologram",
  "/wiki/Spice",
  "/wiki/Death_stick",
  "/wiki/Alien",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Law_enforcement_agency",
  "/wiki/Commissioner",
  "/wiki/Exantor_Divo",
  "/wiki/Book",
  "/wiki/Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Divo_family",
  "/wiki/Hair",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars",
  "/wiki/Anthony_Daniels",
  "/wiki/C-3PO",
  "/wiki/2016",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Coruscanti",
  "/wiki/Tak",
  "/wiki/Raid_on_Kessel",
  "/wiki/Spice_mines_of_Kessel",
  "/wiki/2018",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars_Insider",
  "/wiki/Red_Five_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_Special_Edition_2018",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_39",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars_-_The_Official_Collectors_Edition",
  "/wiki/StarWars.com",
  "/wiki/C.R.C.",
  "/wiki/Trade_Federation",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Reproduction",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}