{
 "name": "Dann",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Akiva"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Dann, a human male born on the planet Akiva, was the son of Senator Pima Drolley, who represented their homeworld in the Galactic Senate of the New Republic. In 5 ABY, Dann and his sister, Merra traveled to the planet Nakadia with their mother as the world was to become the new seat of the Senate for the next year. There, the siblings spotted the former Imperial Loyalty officer Sinjir Rath Velus outside the restaurant Izzik's in the planet's capital Quarrow. As Velus had played an important role in the liberation of Akiva, the two children asked him to come meet their mother; however, as Velus was busy trying to spy on Senator Ashmin Ek he refused and told them to leave him alone. Disappointed, the siblings tried to persuade him to change his mind, but realizing they had caused him to lose his target, Velus insulted Dann and dashed away to find Ek.\nDann was taller than Merra, with a very thin body but a particularly round head. His sister believed him to be fairly stupid, and had to apologize for him when he identified Velus as an Imperial rather than an ex-Imperial.\nDann first appeared in the 2017 novel Aftermath: Empire's End, which was written by Chuck Wendig.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Akiva",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Senator",
  "/wiki/Pima_Drolley",
  "/wiki/Homeworld",
  "/wiki/New_Republic_Senate",
  "/wiki/New_Republic",
  "/wiki/5_ABY",
  "/wiki/Merra",
  "/wiki/Nakadia",
  "/wiki/Parent",
  "/wiki/Standard_year",
  "/wiki/Galactic_Empire",
  "/wiki/Loyalty_officer",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/Restaurant",
  "/wiki/Izzik%27s",
  "/wiki/Capital",
  "/wiki/Quarrow",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/Spy",
  "/wiki/Ashmin_Ek",
  "/wiki/2017",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Chuck_Wendig",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}