{
 "name": "Dansra Beezer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Renegade Squadron",
      "Renegade Squadron",
      "New Republic",
      "New Republic Intelligence Service",
      "New Republic Intelligence Service"
     ]
    }
   ]
  }
 ],
 "content": "Dansra Beezer was a Human female native of the planet Alderaan who held the rank of corporal in the Alliance to Restore the Republic by 4 ABY. She was a slicer, technician, and communications specialist who trained under Sergeant Brooks Carlson to serve as a scout for the Alliance commandos. In 4 ABY, Beezer was part of a strike team sent to the Forest Moon of Endor to deactivate the planetary shield generator protecting the Galactic Empire's second Death Star battlestation in orbit around the moon.\nA part of the strike team's Renegade Squadron detachment, Beezer was responsible for communications. After arriving on Endor, Beezer and the strike team were separated from the command crew following encounters with Imperial scout trooper patrols. Eventually, they encountered an All Terrain Scout Transport while making camp for the night. Beezer, whose role included jamming Imperial transmissions in case of emergencies, did so with the walker's transmissions. She later fought in the Battle of Endor, which ended with the destruction of the shield generator, allowing Alliance starfighters to destroy the Death Star.\nAt some point by 6 ABY, Beezer served as a sergeant in the New Republic's Intelligence Service. She worked alongside her commanding officer, Major Bren Derlin, in a mission to suspend the Reuss Corporation's rule over the planet Reuss VIII by aiding Calian shockboxer Lobar Aybock in a match that the corporation had set him up to lose with the intent of subsequently selling his organs. Beezer worked as a slicer to protect Aybock from a hostile rival employed by Reussi Torel Vorne of the Reuss Corporation, whose intent was to ensure Aybock's death. Ultimately, the New Republic succeeded in the mission, Aybock won his match, and the Reuss Corporation lost control of Reuss VIII, with the New Republic taking over the planet's government.\nThe Human female Dansra Beezer hailed from the planet Alderaan. She was a member of the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. During that conflict, her homeworld was destroyed by the Empire's Death Star superweapon in 0 BBY. By the year 4 ABY, Beezer attained the rank of corporal, and she served as a slicer, technician, and communications specialist. Sergeant Brooks Carlson trained her to serve as a scout for Alliance commandos.\nIn 4 ABY, the Alliance planned to attack the Empire's second Death Star battlestation, which was being constructed over the Forest Moon of Endor. To actually destroy the station, however, the Alliance first had to deactivate the SLD-26 planetary shield generator on Endor's surface, which was protecting the superweapon. Alliance General Han Solo assembled a strike team for the mission to Endor, of which Beezer was a member. She was a part of the strike team's Renegade Squadron component, responsible for communications and ordered to disrupt all Imperial transmissions in case of emergency.\nBeezer and the rest of the strike team traveled to the Endor system aboard the stolen Imperial Lambda-class T4a shuttle Tydirium, piloted by Solo. Once it reached the Death Star construction site, the shuttle was queried by the Imperial Super Star Destroyer Executor, which was in defensive orbit over Endor. However, Solo bypassed the Executor with the use of a stolen Imperial code, and the Tydirium was given clearance to land on the Forest Moon. After disembarking, Beezer and the strike team began scouting the area, but Solo and fellow command crew members Luke Skywalker, Leia Organa, and Chewbacca, along with the droids C-3PO and R2-D2, eventually became separated from the main group after encounters with Imperial scout trooper patrols. Nevertheless, Solo ordered the squad to continue on. The squad made its way toward the shield generator under the lead of Major Bren Derlin.\nUpon nightfall, the squad made camp in a camouflaged shallow ravine, posting two sentries and setting up a blanket grid with its scanning equipment. Shortly after the squad's first sleeping shift, the scanners detected an All Terrain Scout Transport walker moving toward the Rebels' location. Beezer jammed the walker's transmissions, and another member, Lieutenant Greeve, destroyed its spotlights with a sniper rifle. The squad circled the walker to keep it off balance, and the group's medic, Corporal Delevar, fired a smoke canister into the AT-ST's cockpit window when it began firing randomly. The resulting smoke explosion forced the walker's crew to abandon the vehicle and surrender to the strike team. After capturing the Imperials, the squad forced the walker pilot to make a comm check-in at blasterpoint. The squad continued on to the rendezvous point, forcing the walker pilot to make several more check-ins along the way to explain the scout walker's absence.\nSolo and the others then rejoined the squad, having allied themselves with the Ewok tribe of Bright Tree Village, who showed the commandos a route to the shield generator bunker's backdoor. The commandos proceeded into the structure, only to be ambushed by Tempest Force, the Imperial Army legion stationed on the moon, and subsequently captured and led back outside. Their capture proved short-lived, however, when the Ewoks attacked the Imperial troops, eventually turning the tide of the battle in favor of the Rebel Alliance. The strike team successfully destroyed the shield generator with the use of 7-PrG proton grenades. With the Death Star's deflector shield demolished, Alliance starfighters destroyed the battlestation.\nAt some point following the Battle of Endor, Beezer was promoted to the rank of sergeant. She served in the New Republic's Intelligence Service sometime by 6 ABY. During that period, on the planet Reuss VIII, Calian shockboxer Lobar Aybock agreed to a contract with the Reussi Torel Vorne and the Reuss Corporation, in which he would face off in a title match against the shockboxer Tull Raine. Major Derlin met with Aybock, revealing information about Vorne privately auctioning the shockboxer's organs as well as setting up a slicer to disable Aybock's GolanGear armor during the match to ensure the Calian's death. The Intelligence Service's involvement would help the New Republic suspend the Reuss Corporation's operations, which had laid waste to the planet's citizens and environment over the last twenty years. As part of Derlin's team, Beezer's job was to work remotely as a slicer to counter Vorne's efforts. Aybock agreed to help Derlin but only on the condition that the fight with Raine be a fair one and that he be given no advantage by Beezer.\nThe day of the match, Vorne traced Beezer's signal and sent a Defel assassin to kill her. However, Tisocco, the team's bodyguard, successfully defended Beezer from the assassin, which proved to be the mission's only complication. Aybock won the match, and the New Republic's mission succeeded, with the Reuss Corporation's operations suspended pending judiciary investigation and Vorne running from an arrest warrant and several bounties. The New Republic took over Reuss VIII's government with the intent of returning the planet to its agricultural roots.\nA slicer and technician, Dansra Beezer became nervous anytime Han Solo tried to hotwire something. When first meeting Lobar Aybock, Beezer straightened up as if she had been previously bored right before getting to introduce herself. She insisted on mentioning her rank in the introduction. Beezer was initially cool to Aybock and retorted with a derogatory comment on shockboxers after the Calian made a comment making fun of slicers. However, she looked at Aybock in a different manner after he insisted on Beezer not giving him an unfair advantage in the fight. She had brown hair and fair skin.\nDuring her service with the Endor strike team, Beezer wore the forest camouflage gear of the team's members. She was armed with an A280 blaster rifle, along with a blaster pistol and a vibroblade.\nDansra Beezer originally appeared in promotional photos for the 1983 film Star Wars: Episode VI Return of the Jedi, though it is unclear whether she appears in the film itself. The photos, featured in the 1998 CD-ROM Star Wars: Behind the Magic, show Beezer and other Rebel commandos standing aboard the second Death Star with Luke Skywalker and Darth Vader. Although uncredited, stuntwoman Tracey Eddon portrayed the character. In 1990, a commando named Beezer was mentioned in the short story Night Attack, published in Galaxy Guide 5: Return of the Jedi. The release of the 1999 Endor Limited expansion set of the Star Wars Customizable Card Game established Beezer as the female Rebel commando from the Return of the Jedi production photos.\nIn 2008, Beezer appeared in the StarWars.com Hyperspace-exclusive short story Fists of Ion, written by \"What's The Story?\" author Edward M. Erdelac. In that story, she was first given the first name Dansra, although her name was alternatively spelled as \"Dansra\" and \"Dransa\" throughout the story. By Erdelac's own admission, her first name was a tuckerization of his wife's first name. He also felt that Beezer's promotion to sergeant would be a logical progression after her role in the Battle of Endor. Beezer was also given an entry in The Complete Star Wars Encyclopedia, released later in 2008, in which she was erroneously identified as being male.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Beezer",
  "/wiki/Dansra_Beezer",
  "/wiki/Beezer_(disambiguation)",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Renegade_Squadron/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Alderaanian/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Corporal/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Brooks_Carlson/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Endor_strike_team/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Endor_shield_generator_bunker",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Battlestation",
  "/wiki/Orbit/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Scout_trooper/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Jammer",
  "/wiki/Walker/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/SLD-26_planetary_shield_generator/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Major/Legends",
  "/wiki/Bren_Derlin/Legends",
  "/wiki/Reuss_Corporation",
  "/wiki/Reuss_VIII",
  "/wiki/Calian",
  "/wiki/Shockboxing/Legends",
  "/wiki/Lobar_Aybock",
  "/wiki/Reussi",
  "/wiki/Torel_Vorne",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/General/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Endor_system/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Tydirium/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Forest/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Chewbacca/Legends",
  "/wiki/Droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Blanket_grid",
  "/wiki/Scanner",
  "/wiki/Sleep/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Greeve_(Human)",
  "/wiki/Sniper_rifle/Legends",
  "/wiki/Medic/Legends",
  "/wiki/Delevar",
  "/wiki/Smoke_canister/Legends",
  "/wiki/Cockpit/Legends",
  "/wiki/Window/Legends",
  "/wiki/Comm_unit/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Bright_Tree_Village_tribe",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Commando/Legends",
  "/wiki/Planetary_shield/Legends",
  "/wiki/Tempest_Force",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Legion/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/7-PrG_proton_grenade",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Tull_Raine",
  "/wiki/GolanGear",
  "/wiki/Armor/Legends",
  "/wiki/Defel/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Tisocco",
  "/wiki/Bodyguard/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Uniform",
  "/wiki/A280_blaster_rifle/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/1998",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Tracey_Eddon",
  "/wiki/1990",
  "/wiki/Night_Attack",
  "/wiki/Galaxy_Guide_5:_Return_of_the_Jedi",
  "/wiki/1999",
  "/wiki/Endor_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/2008",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Fists_of_Ion",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/Edward_M._Erdelac",
  "/wiki/Tuckerization",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/West_End_Games",
  "/wiki/The_Movie_Trilogy_Sourcebook",
  "/wiki/Galaxy_Guide_5:_Return_of_the_Jedi_(Second_Edition)",
  "/wiki/Unbound_Worlds",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_44",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_7",
  "/wiki/Databank_(original)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_29",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/Imperial_Entanglements_(Star_Wars:_The_Card_Game)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/November_21",
  "/wiki/2017",
  "/wiki/Star_Wars:_Blogs"
 ]
}