{
 "name": "Danthe",
 "display_name": "Danthe",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Moff Sarne's forces"
     ]
    }
   ]
  }
 ],
 "content": "Major Danthe was second in command of Imperial Depot 4290-1 on Shintel during the early years of the New Republic. He was one of Colonel Heget's young officers that accompanied him to the Kathol sector, and was later assigned to the depot along with him.\nFollowing the betrayal by Moff Sarne, Danthe believed that the Moff would return, and pressed for the completion of the blastboat landing field. He maintained that the Moff's actions had been to preserve the security of the depot.\nDanthe disagreed with Heget in negotiating with the New Republic when the CR90 corvette FarStar arrived, but was careful not to openly undermine his superior's authority.\nDanthe was a Human male officer serving in the Imperial Army during the Galactic Civil War. He served under Heget, a respected combat commander, and Danthe followed his superior to the remote Kathol sector when Heget requested a transfer. During Danthe's time in the sector, the local ruler, Moff Kentor Sarne, withdrew the region from the Empire in 4 ABY, and had established himself as a warlord. By 8 ABY, Danthe held the rank of Major, and was Heget's second-in-command at Imperial Depot 4290-1 on the planet Shintel.\nIn 8 ABY, Moff Sarne's capital of Kal'Shebbol was attacked by New Republic forces, forcing him to retreat with his forces. Falling back to Shintel, Sarne began uploading the arsenal supplies from the depot and transferring loyal personnel from the base to his fleet, and dumping those he considered \"traitors\" on the planet. Sarne also arranged for the destruction of all hyperdrive units on ships stationed on Shintel, along with all hyperspace-capable courier droids. Finally, he placed an ion minefield in orbit. Sarne left the outpost with orders to hold the depot and construct a landing field suitable for Skipray Blastboats.\nThe introduction of new personnel to the depot fractured the harmony that Heget's command had instilled, and the base split into factions. Heget's faction saw Sarne's actions as a betrayal, and wanted to disregard his commands and seek to contact Imperial authorities. Danthe and his followers, however, believed that Sarne would return and that his extreme measures were meant to preserve the security of the outpost. However, Danthe also contended that their duty was to re-establish contact with Imperial command to inform them of Sarne's actions so they could either stop him, or at least prevent from returning to Imperial-controlled space. Out of respect for Heget's authority, he was careful to not voice his opinion in front of the men, so as not to undermine the Colonel.\nA week after Sarne's departure, the New Republic CR90 corvette FarStar arrived in orbit. Heget invited the corvette to land, which they did after clearing a path through the ion minefield. Danthe joined Heget in greeting the command crew of the FarStar, and was present when Heget offered a deal to the New Republic delegation; information on Sarne's whereabouts in exchange for passage to the Tanquilla Beach shadowport to contact Imperial command. Unlike his commander, Danthe saw no reason to ally with the New Republic.\nDanthe was a young officer who had suntanned skin and close-cropped blond hair, and was noted for his ready smile. A reserved individual, he was known to be talkative when amongst his fellow officers.\nDanthe was trained to use a blaster, and specialized in the use of heavy blaster pistols. He was also trained to use vehicle mounted weapons. Danthe knew how to pilot ground and hover vehicles, and specialized in controlling All Terrain Scout Transports as well as other walkers. A capable commander, he was knowledgeable about Imperial law enforcement procedures. Trained to repair blasters, Danthe was also skilled in survival techniques and first aid. He carried a blaster and comlink during the course of his duties.\nDanthe's capsule in the The DarkStryder Campaign indicates that he too wanted to re-establish communications with the Empire. He is also referred to as Palme, indicating that the capsule was partially mistaken.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Moff_Sarne%27s_forces",
  "/wiki/Major/Legends",
  "/wiki/Imperial_Depot_4290-1",
  "/wiki/Shintel",
  "/wiki/New_Republic/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Heget",
  "/wiki/Kathol_sector",
  "/wiki/Imperial_Depot_4290-1#Betrayal",
  "/wiki/Moff/Legends",
  "/wiki/Kentor_Sarne",
  "/wiki/CR90_corvette/Legends",
  "/wiki/FarStar",
  "/wiki/Officer/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Sector/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Kal%27Shebbol/Legends",
  "/wiki/Battle_of_Kal%27Shebbol",
  "/wiki/New_Republic_task_force_(Kal%27Shebbol)",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Courier_droid",
  "/wiki/Defender_ion_mine",
  "/wiki/GAT-12_Skipray_Blastboat",
  "/wiki/Standard_week/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Corvette/Legends",
  "/wiki/Tanquilla_Beach/Legends",
  "/wiki/Shadowport/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/Palme",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/Shintel_Downtime",
  "/wiki/The_DarkStryder_Campaign,_Deluxe",
  "/wiki/The_Saga_Begins"
 ]
}