{
 "name": "Dar Champion",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Dar Champion was a human male who was elected the District Advocate for the planet Lanz Carpo. He was the former boyfriend of Princess Leia Organa, whom he had met during regent training.\nDar met Princess Leia Organa when she attended a summer mock congress while in regent training. They entered into a relationship, but Leia stood him up before the graduation dance, seemingly over Dar's father being indicted by the Imperial Senate for embezzlement and abuse of office. Though Leia didn't formally break up with him, Dar didn't see his girlfriend again until the Galactic Civil War. His father's conviction led to the entire family being indicted as co-conspirators, and Dar spent years to exonerate himself and his mother.\nDar was elected the District Advocate of Lanz Carpo in the Core Worlds, around the time of the Mission to Shu-Torun conducted by members of the Alliance to Restore the Republic. Following that mission, General Carlist Rieekan dispatched Leia and Han Solo to Lanz Carpo on a mission to provoke a battle between Boss Carpo and the Galactic Empire, hoping that Leia could use her past relationship with Champion as the key to accessing Carpo's Comm Center. After arriving on-world, Leia and Han were extorted by Red Carpo Guards of the Carpo Crime Syndicate, but were saved by Champion who attacked and subdued the guards. He helped Leia up as she explained that Dar had once been her boyfriend, much to Han's consternation. Following the altercation, the guards were taken away and Dar was interviewed by Banny. However, before the suspects could be processed, a counterorder from Magistrate Eck was delivered, allowing the guards to go free, bailed out by Boss Carpo.\nChampion offered Leia and Han drinks to make up for their spoiled evening, and discussed his family history. He came to realize that the pair had feelings for one another, and lent them use of the honeymoon suite at the Grand Regent.\nDespite the rule of the Carpo Crime Syndicate on Lanz Carpo, Dar strove for justice in his work as District Advocate.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Dar_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Han_Solo",
  "/wiki/District_Advocate",
  "/wiki/Planet",
  "/wiki/Lanz_Carpo",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Dar_Champion%27s_father",
  "/wiki/Imperial_Senate",
  "/wiki/Galactic_Civil_War",
  "/wiki/Dar_Champion%27s_mother",
  "/wiki/Core_Worlds",
  "/wiki/Mission_to_Shu-Torun_(Rebel_Alliance)",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/General",
  "/wiki/Carlist_Rieekan",
  "/wiki/Mission_to_Lanz_Carpo",
  "/wiki/Boss",
  "/wiki/Carpo",
  "/wiki/Galactic_Empire",
  "/wiki/Comm_Center",
  "/wiki/Red_Carpo_Guard",
  "/wiki/Carpo_Crime_Syndicate",
  "/wiki/Banny",
  "/wiki/Magistrate",
  "/wiki/Eck",
  "/wiki/Grand_Regent",
  "/wiki/Star_Wars_(2015)_68",
  "/wiki/Star_Wars_(2015)_69",
  "/wiki/Star_Wars_(2015)_70",
  "/wiki/Star_Wars_(2015)_71",
  "/wiki/Star_Wars_(2015)_72",
  "/wiki/Star_Wars_(2015)_73",
  "/wiki/Star_Wars_(2015)_74",
  "/wiki/Star_Wars_(2015)_75",
  "/wiki/Skywalker:_A_Family_at_War"
 ]
}