{
 "name": "Dar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Trandosha"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Wasskah"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.98 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brownish-orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Garnac's hunting guild"
     ]
    }
   ]
  }
 ],
 "content": "Dar was a Trandoshan male who was the son of Garnac, the leader of a hunting guild that hunted both sentient and non-sentient prey on the moon of Wasskah. During the year 20 BBY, Dar was on the verge of becoming an official member of the guild. When the guild hunter Lo-Taren captured the Jedi Padawan Ahsoka Tano, Garnac believed that Dar's first trophy had been acquired.\nTwo days after Tano's capture, Dar was inducted into the guild by his father and led the following day's hunting expedition. Dar quickly caught onto Tano and the young Trandoshan chased the Padawan and her Jedi youngling companion Kalifa through the jungles of one of Wasskah's islands. However, the inexperienced Dar was foiled by a mixture of his targets' agility and the jungle's terrain. After a failed offense against Tano, Dar tumbled into a gully and was impaled on a stone spike.\nBelieving the Jedi to be solely responsible, Garnac executed Kalifa and swore vengeance on Tano. Garnac's campaign to avenge his son ended when Garnac himself was killed by Tano days later during a conflict that destroyed almost the entire hunting guild.\nDar was a Trandoshan male born to the Trandoshan Garnac, the leader of a hunting guild based on the moon of Wasskah. Despite not being a member of the guild, Dar nonetheless hung around the guild's Ubrikkian Floating Fortress. However, it was his father's intention to eventually bring Dar into the guild's fold.\nAs it happened, the guild was known to kidnap both sentient and non-sentient prey from across the galaxy that was then brought back to Wasskah to be hunted down for sport. Among the Trandoshans' prisoners were Jedi younglings, who were considered by the guild to be valuable targets. For Dar, killing a Jedi was an important right of passage.\nIn the year 20 BBY, Dar was set to be inducted into the guild as an official member. Several days before his induction ceremony, Dar accompanied his father on the guild's Trandoshan prisoner ship for a galactic hunt that saw the captures of various individuals. Eventually, the pilots Krix and Lagon brought the ship to the planet Felucia. By this time, the freighter's cargo bay held four prisoners, including the Selkath Morgo, the Sakiyan Vadoo, the Terrelian Jango Jumper Lika, and the Snivvian Katt Mol. Upon landing on Felucia's surface, the hunter Lo-Taren disembarked alone to find potential prey.\nWhen Lo-Taren returned, he had the Jedi Padawan Ahsoka Tano in tow, having captured her while she participated in a battle being fought as a part of the on-going Clone Wars conflict between the Galactic Republic and the Confederacy of Independent Systems. Lo-Taren eagerly conveyed his thoughts on the capture to Dar and Garnac, in which he believed that Tano would make for an exceptional hunting experience. Garnac agreed, and Dar planned to make Tano his debut hunt's first trophy.\nThe Trandoshans returned to Wasskah and dropped the prisoners they had captured on the jungle-covered Island Four. Dar watched from the freighter's cockpit as Lo-Taren used the ship's weapons to gun down two of the prisoners and force the rest into the jungle.\nThe next day, Dar was present in the fortress trophy room when Garnac announced the beginning of a new hunting period. The hunters cheered as they took up arms and rode down to Island Four on MSP80 hover pods. Dar himself participated in the hunt by piloting Lagon's hover pod, although Lagon took over when the pair were later joined by Garnac. At some point during the hunt, Dar, Garnac, and Lagon overheard Lo-Taren calling for backup. After a day of hunting, during which at least two more trophies were claimed, the Trandoshans reconvened in the trophy room for Dar's initiation ceremony. Dar's peers chanted and hooted in celebration as Dar stepped towards Garnac and was officially made a member of the guild. His first hunt began the following morning.\nFor Dar's first hunt, the young Trandoshan was given the chance to lead the expedition. Two hover pods were taken to the surface, one solo piloted by the hunter Sochek, and one piloted by Lagon with Dar and Garnac as passengers. Upon hitting the ground, it was discovered that Tano had allied herself with three other Jedi younglings that had been captured sometime prior: O-Mer, Jinx, and Kalifa. The pods gave chase, with Sochek herding O-Mer and Jinx away from Tano and Kalifa. Dar's pod continued to chase Tano through the jungle until they had successfully separated her from Kalifa. With Kalifa cut-off from Tano, Garnac urged Dar to proceed on foot and kill her.\nDar jumped from the hover pod and gave chase. He managed to corner Kalifa, but was caught by off-guard and thrown against a tree with Kalifa's use of the Force. However, having taken a fall earlier, Kalifa was exhausted by the time Dar caught up to her again. The young Trandoshan gloated over the idea of making Kalifa his first Jedi kill and took aim with his sniper rifle. Before he could shoot, Tano dropped from a nearby tree and knocked Dar onto his back. Dar responded by shooting at both Jedi, but was unable to land any killing shots.\nFrustrated, Dar resorted to attacking Tano directly, and the two engaged in hand-to-hand combat. The two traded blows, taking turns punching, kicking, and tackling each other. The agile Jedi was able to avoid several of Dar's more lumbering attacks, leading Dar to rush her head on in a final act of desperation. The Trandoshan tackled Tano, but having thrown too much force into the endeavor, he over-rolled and unintentionally released Tano before careening over a boulder and into a gully.\nDar landed on a rocky spike, ending the young hunter's life on his debut hunt before he could bag even one kill.\nDar's death enraged Garnac into a frenzy. The Trandoshan swiftly killed Kalifa with a well-aimed blaster shot and swore vengeance on Tano. Garnac swept the island for Tano, but failed to relocate her. Eventually, the Jedi managed to contact Wookiee soldiers and directly attacked the guild's fortress. Garnac personally dueled Tano in the trophy room and was beaten, after a lengthy brawl. Garnac continued to blame Tano for Dar's death, but Tano retorted that Garnac's eagerness to send his son into the hunt was to blame instead.\nUn-accepting of the accusation, Garnac reached for a blaster rifle, only for Tano to throw Garnac out of the trophy room and over the outside balcony to his death in an act of self-defense. The guild was dismantled, and its survivors fled Wasskah.\nRaised as an ambitious hunter, Dar was eager for the hunt. Garnac cherished his son, and in turn Dar looked to please his father, boldly stating his desire to personally kill a Jedi target when Garnac brought up the topic. Openly optimistic, Dar would often celebrate declarations regarding the guild's hunting activities, such as when Garnac expressed interest in making Tano Dar's first trophy or when Garnac announced the beginning of a new hunt. During his guild induction ceremony, Dar played the part of a triumphant warrior, roaring and cheering alongside his comrades. Dar even traded several chest bumps with his peers as he stepped forward to be inducted by his father.\nFor Dar's first and final hunt, he was entrusted with leading the charge, and the young hunter appeared to enjoy the hover pod chase. Dar was confident in his abilities to fight the Jedi—which he referred to as \"whelps\"—on foot, but after failing to kill Kalifa with his hands, he resorted to using his rifle. Upon cornering Kalifa he found her to be less than impressive, but hoped to maker her the first of many Jedi trophies nevertheless. He considered the idea of turning Kalifa into a trophy to be an honor on her part. Dar proved to be fast—if inaccurate—shooter, as after being knocked down by Tano he quickly popped back up to continue the fight.\nHowever, Dar's inability to kill the Jedi frustrated him, causing him to forgo his weapons and fight Tano in personal combat. Dar's subsequent attacks proved to be unfocused, as he wildly swung at the Jedi, landing only a few blows. After being tackled by Tano, Dar attempted a similar maneuver, but he put more force into the move than he needed which led to his demise.\nPhysically, Dar featured a lean build comparable to his father. Dar's scales were a brownish-orange color, and the young Trandoshan exhibited yellow eyes.\nDuring his first and final hunt, Dar's weapon of choice was a black, long-barreled sniper rifle with a vertical foregrip, a sling, and a scope. After failing to shoot his quarry with the rifle, Dar attempted to use the rifle as a club and subsequently lost hold of the weapon. Dar was also had access to and was capable of piloting the guild's hover pods.\nDar's fatigues consisted of a reddish-brown t-shirt, a gray vest with yellow shoulders, gray shorts and anklets, and gauntlets on both wrists. Dar also wore a cartridge carrier on his left arm along with a red armband on his right arm.\nDar was created for the animated series Star Wars: The Clone Wars, with his only appearance being in the episode \"Padawan Lost\" as a supporting character. The twenty-first episode of the show's third season, \"Padawan Lost\" aired on April 1, 2011. Dar was subsequently mentioned in the following episode, \"Wookiee Hunt,\" where his death served as the driving force behind the antagonist's motives.\nDar's voice was provided by Kevin Thoms. Like all of the Trandoshans that appeared in \"Padawan Lost\" and \"Wookiee Hunt,\" Dar was designed by conceptual artist Pat Presley. Star Wars creator George Lucas created Dar's name during a writing session for the show.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Dar",
  "/wiki/Dar/Legends",
  "/wiki/Dar_(disambiguation)",
  "/wiki/Trandosha",
  "/wiki/20_BBY",
  "/wiki/Wasskah",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Garnac%27s_hunting_guild",
  "/wiki/Garnac",
  "/wiki/Hunting",
  "/wiki/Sentience",
  "/wiki/Moon",
  "/wiki/Standard_year",
  "/wiki/Lo-Taren",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Standard_day",
  "/wiki/Parent",
  "/wiki/Youngling",
  "/wiki/Kalifa",
  "/wiki/Jungle",
  "/wiki/Island_Four",
  "/wiki/Death",
  "/wiki/Skirmish_on_Wasskah",
  "/wiki/Ubrikkian_Floating_Fortress",
  "/wiki/The_galaxy",
  "/wiki/Prisoner",
  "/wiki/Trandoshan_prisoner_ship",
  "/wiki/Pilot",
  "/wiki/Krix",
  "/wiki/Lagon",
  "/wiki/Starship",
  "/wiki/Planet",
  "/wiki/Felucia",
  "/wiki/Freighter",
  "/wiki/Selkath",
  "/wiki/Morgo",
  "/wiki/Sakiyan",
  "/wiki/Vadoo",
  "/wiki/Terrelian_Jango_Jumper",
  "/wiki/Lika",
  "/wiki/Snivvian",
  "/wiki/Katt_Mol",
  "/wiki/Second_Battle_of_Felucia",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Cockpit",
  "/wiki/MSP80_Pteropter_hover_pod",
  "/wiki/Sochek",
  "/wiki/O-Mer",
  "/wiki/Jinx",
  "/wiki/Tree",
  "/wiki/Force_push",
  "/wiki/The_Force",
  "/wiki/Sniper_rifle",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Blaster",
  "/wiki/Wookiee",
  "/wiki/Soldier",
  "/wiki/Blaster_rifle",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Gauntlet",
  "/wiki/Limb",
  "/wiki/Dave_Filoni",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Padawan_Lost",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/April_1",
  "/wiki/2011",
  "/wiki/Wookiee_Hunt",
  "/wiki/Kevin_Thoms",
  "/wiki/Pat_Presley",
  "/wiki/Star_Wars",
  "/wiki/George_Lucas",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Dar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ghosts_of_Mortis",
  "/wiki/Water_War",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Friends_and_Enemies",
  "/wiki/Star_Wars:_The_Clone_Wars:_Episode_Guide"
 ]
}