{
 "name": "Dar_Keyis",
 "display_name": "Dar Keyis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Churba"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Brentaal IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "New Republic Starfighter Corps",
      "Rogue Squadron",
      "New Republic Starfighter Corps",
      "Rogue Squadron",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Dar Keyis was a Human male from the planet Churba who served as a member of the New Republic Starfighter Corps during the Galactic Civil War. In 4 ABY, nine months after the Battle of Endor, he was transferred to Rogue Squadron just prior to the Battle of Brentaal IV and was assigned the call sign Rogue Ten. The New Republic had targeted the planet Brentaal IV as part of an ongoing operation to establish a foothold in the Core Worlds, and to eventually liberate the galactic capital of Coruscant.\nKeyis participated in the assault on the Brentaal IV moonbase, helping to secure it as a staging area for a direct assault on the planet itself. He then took part in the attack on the city of Vuultin, a diversionary feint that allowed the New Republic to establish a base in the city of Oradin. During the evacuation of Brentaal IV—an effort by the Imperial authorities to spirit away the wealthy and elite citizens of the planet—Keyis' fighter was destroyed by weapons fire from a TIE interceptor, and he was killed in the resulting explosion.\nDar Keyis hailed from the planet Churba and was a starfighter pilot in service to the New Republic Starfighter Corps during the Galactic Civil War. In 4 ABY, approximately nine months after the Battle of Endor, Keyis was transferred to Rogue Squadron. He had already participated in eight combat missions before being reassigned to the elite unit, which at the time was stationed at the secret Base Delta-Nine. Keyis' assignment to the squadron—along with the Rodian Standro Jcir, fellow Human Avan Beruss, and the Tunroth Xarcce Huwla—was part of an effort to bring Rogue Squadron up to full strength prior to the Battle of Brentaal IV, a New Republic effort to gain a foothold in the Core Worlds. The new recruits met their commanding officer, Captain Wedge Antilles and executive officer Tycho Celchu.\nAssigned the call sign of Rogue Ten upon joining the unit, Keyis and his squadron mates underwent holosimulator training for an assault on the Imperial-held Brentaal IV moonbase. Following a recent reconnaissance mission undertaken by Rogue Squadron to Brentaal IV, Admiral Gial Ackbar and the New Republic Provisional Council decided that it was time to strike the planet as part of their campaign to liberate the Core Worlds and eventually the capital Coruscant. Admiral Ackbar was to lead the task force assigned to capture Brentaal IV.\nNew Republic forces staged from the planet Recopia, launching their campaign against the Imperial forces in the Brentaal system. Keyis, along with the rest of Rogue Squadron, participated in the opening phases of the operation by attacking the Imperial base on one of Brentaal IV's moons. Rogue Squadron and Aggressor Wing led the assault, facing off against a squadron of elite TIE interceptors. With Imperial capital ships too far out of position to assist, the New Republic succeeded in landing troops and capturing the moonbase.\nRogue Squadron returned to Base Delta-Nine following the operation. During downtime for the squadron, Keyis played a game of dejarik against Xarcce Huwla when Captain Antilles arrived and asked to us the hologame table. Keyis deferred to his commander's use of the device, stating he was going to let Huwla win the match anyway. Antilles used the holographic game table to share information with the squadron that the TIE interceptors present defending the moonbase were from the 181st Imperial Fighter Group, an elite unit under the command of Baron-Colonel Soontir Fel.\nAlong with the rest of Rogue Squadron, Keyis was transferred to the Brentaal IV moonbase in preparation for the New Republic's assault on the planet itself. Between patrol missions, he was playing sabacc with several other members of the squadron when Baron Fel's presence on Brentaal IV was confirmed by intelligence reports. Keyis listened as members of the squadron recounted their memories of him—Tycho Celchu and Derek \"Hobbie\" Klivian had trained under Fel at the Prefsbelt Fleet Camp and admitted they never managed to shoot him down in the simulators.\nSome time after, Keyis and Rogue Squadron participated in the subsequent assault on the Brentaal city of Vuultin. Rogue Squadron hit the capital of the planet's ruler, Admiral Lon Isoto, as a diversion, allowing Colonel Horton Salm's Aggressor Wing to attack the city of Oradin and capture its spaceport. Intelligence had placed Fel and his forces in Vuultin but Rogue Squadron found that the opposition at the city was lighter than expected. Fel had correctly surmised that Oradin was the true target for the New Republic's assault and he inflicted heavy casualties on the Y-wings of Aggressor Wing. However, Isoto felt threatened by Rogue Squadron's assault, believing they were attacking him directly, and recalled Fel and his unit away from Oradin. With news that Fel was heading for Vuultin, Ackbar ordered Rogue Squadron to head to the Mon Calamari Star Cruiser Independence, one of the capital ships assigned to his task force. Despite taking heavy losses, the New Republic succeeded in capturing Oradin.\nRogue Squadron were billeted at Oradin following the capture of the city. Following the battle, Keyis and Standro Jcir were present in the main hangar when Lieutenant Plourr Ilo profusely thanked Rogue Squadron mechanic Koyi Komad for fixing her maneuvering jets. When Ilo asked Komad how she could repay her, Keyis and Jcir made several joking remarks about buying her a planet or a moon as a reward, since Ilo was also the Princess of Eiattu 6. Ilo offered to take the two pilots for drinks, reasoning that their dumb remarks would start a fight that she could enjoy.\nShortly after the capture of Oradin, an Imperial evacuation fleet arrived at Brentaal IV intent on rescuing the wealthier citizens from the New Republic invasion. Fearful that the escapees would take much of the planet's wealth and leave the economy in ruins, the New Republic Provisional Council authorized a mission to stop the population from evacuating. Rogue Squadron supported Aggressor Wing while they disabled fleeing transports with their ion cannons, first at Vuultin, then in orbit above the planet. During the space battle, Keyis' X-wing was targeted by a TIE interceptor. Rogue Nine attempted to assist Keyis but was too late, and his starfighter was hit by weapons fire from the TIE Interceptor. Keyis' X-wing was destroyed, and he was killed in the resulting explosion. Despite his death, the New Republic was victorious; the remaining Imperial forces withdrew from the system, leaving Brentaal and the disabled civilian vessels under New Republic control.\nFollowing the Battle of Brentaal IV, a mass funeral was held for all those who had been lost during the engagement. The ceremony was held on the hangar deck of a Mon Calamari star cruiser. Fifteen caskets—including ones for Keyis and squadron mate Standro Jcir—were launched into space while Colonel Salm presided over the funeral. During the ceremony, Antilles reflected on Keyis and Jcir joining Rogue Squadron's roster of the dead and that they should never be forgotten.\nDar Keyis was a light-skinned Human male with blond hair and stubble on his face. He was considered to be a capable pilot, performing well enough to earn a transfer to Rogue Squadron, an elite unit within the New Republic military. Despite being a relative newcomer to the squadron, Keyis was able to integrate himself into the unit's social structure without difficulty, joining in on sabacc games and joking around with Lieutenant Plourr Ilo over her noble status.\nDar Keyis wore a casual outfit, including a beige-colored jacket with dark brown patches at the shoulders, worn over a white undershirt. He also wore a flight suit while piloting his starfighter and a flight helmet with the emblem of the New Republic on either side. Keyis flew a T-65 X-wing starfighter while a member of Rogue Squadron. The fighter was destroyed during the Battle of Brentaal IV when Keyis was killed.\nDar Keyis was created by Michael A. Stackpole as a new pilot joining Rogue Squadron in the four-issue Star Wars: X-Wing Rogue Squadron: In the Empire's Service story arc. He debuted in the first issue of the arc, and was killed in the last issue. He was subsequently mentioned in the first issue of the Family Ties arc, as Wedge Antilles muses that Keyis is one of the latest Rogues to join their roster of the dead.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Churba",
  "/wiki/4_ABY/Legends",
  "/wiki/Great_ReSynchronization",
  "/wiki/Brentaal_IV/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Starfighter_Corps/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Battle_of_Brentaal_IV_(Galactic_Civil_War)",
  "/wiki/Call_sign",
  "/wiki/Rogue_Ten/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Liberation_of_Coruscant_(Galactic_Civil_War)",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Battle_of_Brentaal_IV_(Galactic_Civil_War)#Assault_on_the_Brentaal_IV_moonbase",
  "/wiki/Brentaal_IV_moonbase",
  "/wiki/Battle_of_Brentaal_IV_(Galactic_Civil_War)#Establishing_a_beachhead",
  "/wiki/City/Legends",
  "/wiki/Vuultin",
  "/wiki/Oradin",
  "/wiki/Battle_of_Brentaal_IV_(Galactic_Civil_War)#Evacuation_efforts",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Death/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Time/Legends",
  "/wiki/Base_Delta-Nine",
  "/wiki/Squadron/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Standro_Jcir",
  "/wiki/Avan_Beruss",
  "/wiki/Tunroth",
  "/wiki/Xarcce_Huwla",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Executive_officer/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Holosimulator",
  "/wiki/Battle_of_Brentaal_IV_(Galactic_Civil_War)#New_Republic_reconnaissance",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/New_Republic_Provisional_Council",
  "/wiki/New_Republic_task_force_(Brentaal_IV)",
  "/wiki/Recopia",
  "/wiki/Brentaal_system",
  "/wiki/Moon/Legends",
  "/wiki/Aggressor_Wing",
  "/wiki/Capital_ship/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Dejarik/Legends",
  "/wiki/Hologame_table",
  "/wiki/Hologram/Legends",
  "/wiki/181st_Imperial_Fighter_Wing/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Soontir_Fel/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Derek_Klivian/Legends",
  "/wiki/Imperial_Naval_Academy",
  "/wiki/Lon_Isoto",
  "/wiki/Horton_Salm/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Mon_Calamari_Star_Cruiser",
  "/wiki/Independence/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Isplourrdacartha_Estillo",
  "/wiki/Technician/Legends",
  "/wiki/Koyi_Komad",
  "/wiki/Maneuvering_jet/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Eiattu_6",
  "/wiki/Fleet/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Space_warfare",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Rogue_Nine",
  "/wiki/Starship/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Star_Cruiser/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/Noble/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Jacket/Legends",
  "/wiki/Flight_suit/Legends",
  "/wiki/Flight_helmet/Legends",
  "/wiki/Michael_A._Stackpole",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_In_the_Empire%27s_Service",
  "/wiki/X-Wing_Rogue_Squadron_21",
  "/wiki/X-Wing_Rogue_Squadron_24",
  "/wiki/X-Wing_Rogue_Squadron_26",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Family_Ties",
  "/wiki/Star_Wars_Handbook_1:_X-Wing_Rogue_Squadron",
  "/wiki/Tarrin_Datch",
  "/wiki/Hosh_Hune",
  "/wiki/3_ABY/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/Standard_year/Legends",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars_Omnibus:_X-Wing_Rogue_Squadron_Volume_3",
  "/wiki/X-Wing_Rogue_Squadron_23",
  "/wiki/Rogue_Twelve",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/X-Wing_Rogue_Squadron_22",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/X-Wing_Rogue_Squadron_35"
 ]
}