{
 "name": "Darbin_Sull",
 "display_name": "Darbin Sull",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish-Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian Council",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Darbin Sull was a male Human Corellian who was a promising politician and one of the youngest individuals to be elected by the Corellian Council during the Galactic War. During the war, Darbin was utterly ambitious and when he was approached by agents of Imperial Intelligence, they secretly recruited him, promising the post of prime minister once the Imperials seized power. Likewise, the Empire soon had the entire Corellian Council in its pocket and send troops on the planet. However much to Darbin's surprise, many Corellian groups and common citizens put up a stiff resistance against the Sith Empire.\nDarbin Sull had a mother whose face he claimed to be familiar with. In his early years, Sull frequently jogged in Axial Park, and never fired a blaster before the fight at the park during the Battle of Corellia.\nWhen the Jedi and Galactic Republic troops engaged in a battle against the Sith and their Corellian allies, Sull chose to side with the Empire in hopes of being elected prime minister.\nSull joined a hero team in a holographic conference with Darth Decimus in Labor Valley. The hero had already cleared out the resistance on the surface and destroyed their supplies, forcing them into the Selonian tunnels. Sull warned that the Selonians were extremely vicious and not to be underestimated.\nAfter the Imperials set off on a genocide campaign against the Selonians, the focus of the hero moved onto Axial Park. Sull was to serve a role of the hero's \"prisoner\", who was to \"escape\" and infiltrate the Republic. The hero also decided to give Sull a slight bruise to make the deception look convincing. Unfortunately for Sull, the Republic suspected him of being an Imperial spy, so to get into their good graces, he informed them of the Imperials attempting to kill Jedi Master Corin Tok. He managed to warn the hero before the ambush, but was reprimanded for the slip-up.\nThe final area for the Empire to capture was Capitol Square of the Coronet City, where the Green Jedi were the last form of resistance and had sealed themselves within the Green Jedi Enclave. Sull had managed to acquire one access code for the hero to enter, but couldn't grab another without blowing his cover. He informed his allies that all but one Green Jedi have sought haven in the enclave, except for Master Bedoch, who was trying to hold Republic Foundation Museum. The hero sacked the museum and killed Bedoch, taking his access code.\nOnce all the pieces were in place to take the Green Jedi out, Sull charmed his way into the enclave to distract the Green Jedi Council. As the hero made the way inside, Sull offered to distract the Jedi, even though he'd be blowing his cover, which his allies approved. Once the Green Jedi were all killed, the hero and Darbin Sull reported to Darth Decimus of their success. Sull tried reminding the Dark Councilor of their prior agreement to give him the post of the Prime Minister. Decimus admitted that he could imagine Corellia rebuilding under Sull's leadership, however, he felt that rebellion would only rise again if that came to pass. Agreeing with the Sith Lord, the Imperial hero decided to kill Sull and struck him down just as his dreams were closest to being realized.\nThe player can choose whether to kill Sull or spare him. If spared, Sull will be present at Corellia's inauguration into the Empire and be proudly granted the title of Prime Minister. He then urges his fellow councilors to bow before the hero. However, Councilor Jalta defiantly refuses. Angered, Sull demands the hero to kill him. The player can choose to kill Jalta  or spare him .\nIf Sull is spared, he will appear during the bounty hunter storyline. However, if Sull is killed, Supreme Chancellor Dorian Janarus will give his speech.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Darbin_Sull",
  "/wiki/Corellia/Legends",
  "/wiki/3640_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Corellian_Council",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Galactic_War",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Planet/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Axial_Park",
  "/wiki/Blaster/Legends",
  "/wiki/Battle_of_Corellia",
  "/wiki/Jedi/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Darth_Decimus",
  "/wiki/Labor_Valley",
  "/wiki/Selonian/Legends",
  "/wiki/Arfan_Ramos",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Corin_Tok",
  "/wiki/Capitol_Square",
  "/wiki/Coronet_City/Legends",
  "/wiki/Corellian_Jedi",
  "/wiki/Green_Jedi_Enclave",
  "/wiki/Bedoch",
  "/wiki/Republic_Foundation_Museum",
  "/wiki/Green_Jedi_Council",
  "/wiki/Dark_Council",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Jalta",
  "/wiki/Dorian_Janarus",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}