{
 "name": "Dareg",
 "display_name": "Dareg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mantellian Separatist Movement"
     ]
    }
   ]
  }
 ],
 "content": "Dareg was a male Human who was one of the leaders of the Mantellian Separatist Movement and the head of the Separatist stronghold inside Mount Avilatan, an active volcano on Avilatan island, Ord Mantell during the Cold War. Dareg despised alien species.\nA Human male who lived during period of the Cold War, Dareg's family inhereited a droid at some point. The droid contained records of credits legally owed to House Teraan, a Royal family on Alderaan who lost the droid to pirates, though how much he knew about the droid's true nature is unclear. Dareg lived on Ord Mantell and grew disillusioned with the Galactic Republic and the Ord Mantell Central Authority because of the corruption and what he felt was the oppression of the people of Ord Mantell. He joined the Mantellian Separatist Movement and would become a prominent leader of the Movement.\nDuring the Separatist War Dareg would command a legion of troops in a Separatist stronghold established in the heart of Mount Avilatan, which was a volcano was known to have secret dealings with Skavak; at one time Dareg scheduled a meeting with Skavak for the shipment of blasters originally intended for the Crime lord Rogun the Butcher, while Syreena would warn Dareg of a smuggler, who was after Skavak for a ship Skavak stole. Instead, Skavak betrayed him and his movement to steel the droid Dareg inherited, which bewildered Morant, who had only been with Dareg a few months, as he considered the droid ancient and worthless. By the time the smuggler infiltrated the Separatist base and confronted Dareg and his men Skavak was already gone. Dareg attacked the smuggler in retaliation but was killed instead, leaving Morant alive to tell where Skavak was instead. The smuggler would continue to pursue Skavak, but he fled to Coruscant before the smuggler could apprehend him.\nA muscular Human with brown hair and eyes, Dareg held a fanatical view of the Separatist Movement, considering his members courageous \"brothers in arms\" and \"executioners of justice\" for the people of Ord Mantell that he felt were oppressed by their corrupt planetary government. Viidu, on the other hand, considered him a psychopath.\nDareg wasn't willing to negotiate with the Smuggler for the location of Skavak because of the members killed that Morant felt would have been avoided if he just told the truth about Skavak's betrayal.\nDareg first appears in the MMORPG Star Wars: The Old Republic as a enemy Boss NPC as part of the Smuggler storyline that the player has to kill to proceed then talk to Morant.\nDatamined dialogue reveals that Dareg would've expressed a different opening line if the Smuggler was an alien, however Dareg doesn't express this line.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Separatist_stronghold",
  "/wiki/Mount_Avilatan",
  "/wiki/Volcano/Legends",
  "/wiki/Avilatan",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Time/Legends",
  "/wiki/Cold_War",
  "/wiki/Droid/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/House_Teraan",
  "/wiki/Alderaan/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ord_Mantell_Central_Authority",
  "/wiki/Separatist_War",
  "/wiki/Skavak/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Rogun_Matt%27rik",
  "/wiki/Syreena",
  "/wiki/Voidhound",
  "/wiki/Morant",
  "/wiki/Death/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Viidu",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Galactic_Standard_Calendar"
 ]
}