{
 "name": "Dariana",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cularin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarasin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hiironi irstat"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Constanten"
     ]
    }
   ]
  }
 ],
 "content": "As the Mother of the Hiironi irstat, the largest irstat on Cularin, Mother Dariana was viewed as the wisest of all Tarasin.\nThough she dreamed of it as a child, being the Mother of the Hiironi, or spiritual leader , was not a task she wanted, at least not as early as she got it. She desired the role of Irstat-Kes, or chief of the tribe , and she looked forward to taking on the role.\nBut the day after the previous Mother was killed by a kilassin, when her sister Meirana became Mother, Meirana died of a strange disease, thrusting Dariana immediately into the position of Mother. Dariana tried her best in her new job, but she was prone to tantrum when her \"wisdom\" was not listened\nDariana believed in using offworld technology in certain cases. She carried a blaster to deal with predators and recorded her memoirs on electronic media instead of relying solely on her people's oral tradition. She often worked for her own good as much as for the good of her irstat.\nDariana trained some of the young Force-sensitive members of the irstat in her people's ways of the Force, some of whom, such as Constanten, went on to the Almas Academy to train to become Jedi.\nTowards the end of her life, her skin could no longer shift colors, but she still stood tall and had an impressive stance with the traditional Mother robe. She rarely left the irstat, but was present at any important meetings between the Hiironi and offworlders: Knowing her death was approaching, she decided to committ herself more with life.\nAbout a year after the Trade Wars of 32 BBY, a trusted offworlder friend of the irstat  came to Dariana asking for a suitable location for a sanctuary, and Dariana pointed them to Cloud Mountain. Soon afterward, a group of individuals looking for the people who had disappeared themselves to join the Cularin resistance came to the irstat following clues left by the missing people. Dariana sensed a disturbance to the balance of nature around Cloud Mountain, and pointed them in the same direction as she had the irstat's friend. At this point, the Metatheran Cartel was secretly cutting down ch'hala trees and, although Dariana's friend knew it, he or she did not tell Dariana because the Tarasin would start a violent bloodshed.\nLater, another of Dariana's sisters, Liriana, turned up leading a group of Tarasin dark side witches calling themselves the Wyrd. Dariana had had her own brush with the dark side when, as a child, she used it to kill a young kilassin before it could eat her.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Tarasin",
  "/wiki/Gender/Legends",
  "/wiki/Hiironi_irstat",
  "/wiki/Constanten_(Tarasin)",
  "/wiki/Kilassin",
  "/wiki/Meirana",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Jedi/Legends",
  "/wiki/Trade_Wars",
  "/wiki/32_BBY/Legends",
  "/wiki/Nim%27Ri",
  "/wiki/Shayne_Gerrare",
  "/wiki/Gerta_Haman",
  "/wiki/Cloud_Mountain",
  "/wiki/Cularin_resistance",
  "/wiki/Metatheran_Cartel",
  "/wiki/Ch%27hala_tree",
  "/wiki/Liriana",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Witch/Legends",
  "/wiki/Wyrd",
  "/wiki/The_Resistance_Within",
  "/wiki/An_Uneasy_Peace",
  "/wiki/Holes",
  "/wiki/Wizards.com",
  "/wiki/A_Mother%27s_Memoirs",
  "/wiki/Friendship_in_the_Order",
  "/wiki/Force_Convergence",
  "/wiki/From_the_Trees",
  "/wiki/Padawannabes",
  "/wiki/A_Mon_Alone",
  "/wiki/Hunting_the_Wyrd",
  "/wiki/Destruction_(Living_Force_adventure)",
  "/wiki/The_Heart",
  "/wiki/The_Eye_(roleplaying_adventure)",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Liriana:_Dark_Force_Witch_of_Cularin",
  "/wiki/Winter_Fantasy_Preview",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Life%27s_Memories_(article)",
  "/wiki/News_of_the_Wyrd",
  "/wiki/Home_of_Wisdom_(article)",
  "/wiki/A_Mother%27s_Memoirs,_Continued",
  "/wiki/Sacrifices",
  "/wiki/View_from_the_Roof",
  "/wiki/Reprieves",
  "/wiki/A_Mother%27s_Memoirs,_Concluded"
 ]
}