{
 "name": "Darima_Kedari",
 "display_name": "Darima Kedari",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Klatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Council of Elders"
     ]
    }
   ]
  }
 ],
 "content": "Darima Kedari was a male Klatooinian who served as the Chancellor of the Klatooinian Council of Elders. During his early life, he was a gambler, and he came into contact with Lando Calrissian, although he eventually turned away from his gambling ways. In 44 ABY, he was met with crisis when a group of Sith attacked the sacred Fountain of the Ancients. With the arrival of the Hutts, who were bound by treaty to protect the Fountain, the Sith were stopped. Darima then asked Calrissian and Jedi Knight Jaina Solo, who had just arrived in-system, to mediate the situation. After hearing from all sides, Solo and Calrissian found the Sith under the command of Vyn Holpur guilty of attacking and damaging the Fountain—resulting in an execution sentence for Holpur and his crew—and that the Hutts had ineffectively protected the Fountain. However, they also decided that the Hutts had not violated the treaty, as, with the damage they had sustained during the Yuuzhan Vong War, there was no way they would have been able to stop the sudden attack, and they had acted as effectively as they could. Despite this ruling, Klatooinians across the planet began to revolt against the Hutts, and Kedari realized that any hopes of peace were gone.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Klatooine/Legends",
  "/wiki/Klatooinian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Council_of_Elders_(Klatooinian)",
  "/wiki/Chancellor_(Klatooinian)",
  "/wiki/Gambling/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/44_ABY",
  "/wiki/Sith/Legends",
  "/wiki/Violation",
  "/wiki/Fountain_of_Ancients",
  "/wiki/Hutt/Legends",
  "/wiki/Treaty_of_Vontor",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Star_system/Legends",
  "/wiki/Vyn_Holpur",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Planet/Legends",
  "/wiki/Klatooinian_uprising",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)"
 ]
}