{
 "name": "Darish_Vol",
 "display_name": "Darish Vol",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Sometime prior to 36 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "44 ABY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Balding"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith"
     ]
    }
   ]
  }
 ],
 "content": "Darish Vol was a Force-sensitive Human male born on the remote planet Kesh. He was the Grand Lord of the Lost Tribe of Sith, the highest ranking position in the Tribe. As Grand Lord, he presided over the Tribe's ruling council, the Circle of Lords. In 41 ABY, when Ship, a Sith Meditation Sphere, arrived on Kesh and spoke through the Force with Sith Tyro Vestara Khai, Vol agreed with the council's decision to promote Khai to the position of apprentice. The Tribe then began to use Ship to capture vessels for their new fleet to conquer the galaxy. Vol was present on Kesh in 43.5 ABY, when Jedi Grand Master Luke Skywalker touched an Aing-Tii relic, the Codex, alerting the Tribe to his presence. In 44 ABY, Vol accepted an alliance with the dark side entity Abeloth and led the celebration for her arrival in the capital city of Tahv.\nAbeloth betrayed the Sith, attacking first Vol and then the city itself before fleeing the planet. Vol survived, but thousands were killed as she destroyed much of Tahv, and several more Sith defected from the Tribe to join her. Meanwhile, several Sith led by High Lord Ivaar Workan worked to infiltrate the Galactic Alliance. After the Jedi Order left the planet in order to separate themselves from the government, Vol decided to come to the galactic capital himself. Workan informed Vol that the only obstacle left to Sith power was Senator Rokari Kem—who, unbeknownst to the Sith, was Abeloth in disguise. Vol thus went to kill her; however, she instead overcame and killed Vol.\nDarish Vol was a Human male Force-sensitive from the Wild Space planet of Kesh. He was born sometime before 36 BBY and trained in the ways of the dark side of the Force with the Lost Tribe of Sith—descendants of a group of Sith who survived the crash-landing of their starship, the Omen, on Kesh during the Great Hyperspace War in 5000 BBY. Vol learned the ways of the Sith, and he rose to power within the Tribe. He survived at least eighty years of political maneuvers and assassination attempts against him and eventually became the Tribe's leader, the Grand Lord. As Grand Lord, he presided over the Circle of Lords—the Tribe's ruling council—in the Circle Chambers, which were located in the planet's capital city of Tahv.\nIn 41 ABY, a Sith Meditation Sphere called Ship arrived on the planet and spoke with a young Sith Tyro, Vestara Khai, through the Force. The Circle of Lords decided that Khai should be officially taken as an apprentice, due to Ship's interest in her. Vol believed that it was an abnormal way to choose an apprentice, but he also deemed it acceptable, as the Sith Meditation Sphere's purpose was to train apprentices. The Circle of Lords decided that Khai would be put under the instruction of Lady Olaris Rhea.\nShip soon after located a Damorian s18 light freighter en route from the world Eriadu. Ship called for five Sith to assist in an attack on the vessel, and Vol was present at the meeting wherein those Sith were chosen. With the help of Ship, the Tribe thus continued to venture out into the galaxy, capturing ships to form a new armada. In 43.5 ABY, when Jedi Grand Master Luke Skywalker touched an Aing-Tii relic, the Codex, his presence was magnified and his name was whispered through the Force to the members of the Tribe. Ship gave Vol information about Skywalker and the threat that he presented to the Tribe, and Vol and Rhea handpicked a strike team to hunt the Jedi down. However, Ship then abruptly left Kesh to follow the call through the Force, and Vol ordered that the strike team find Ship before going after Skywalker.\nThe strike team encountered a powerful dark side entity called Abeloth, but the strike team and Sith fleet's numerous attempts to kill Skywalker and destroy or capture Abeloth were unsuccessful. After one such failed mission on the planet Nam Chorios, Abeloth contacted the Sith and proposed an alliance to defeat their mutual enemy, the Jedi. Vol immediately called a meeting of the Tribe in the Circle Chambers to discuss the implications of such an alliance. During the debate, the Sith Saber Yasvan reported to him that Ship had arrived in orbit with Abeloth and Saber Gavar Khai, and the Grand Lord decided to allow Abeloth to be brought down to the surface of Kesh, and arranged for a presentation to celebrate her arrival. He contacted Saber Khai and informed him that the Sith would require three days to make their preparations. With the preparations complete, Darish Vol gave a speech as Abeloth arrived on the world and accompanied her in the ensuing parade and masquerade.\nAfterward, he convened with the members of the Circle of Lords whom he trusted most. Later that night, Abeloth appeared to him in his dreams and attacked him, using her tentacles to try to kill him. In her recklessness, however, he was able to delve into her mind—he discovered that she was in great pain, and held a need to be loved and have someone be with her forever. Using a technique he had only recently learned, Vol implanted into her mind that she was ugly and that no one would ever love her, and Abeloth's attempt to kill him turned into an attempt to escape. He continued mocking her, but she suddenly broke free, causing Vol great pain. Vol was left extremely weak, and he quickly called for his aid, the Sith Saber Revar. He told Revar to get him to his ship, and to warn the Lords and the planet's defenses that Abeloth was going to attack Tahv. His warning did not come in time, however—Abeloth unleashed waves of Force energy onto the city, killing thousands instantly and laying waste to the buildings and structures. Vol managed to survive the carnage, but Abeloth and Ship both escaped, and several Sith—including Gavar Khai—defected from the Tribe, firing on the Sith ships and protecting Abeloth.\nMeanwhile, several Sith had begun to infiltrate the galactic capital planet Coruscant. High Lord Ivaar Workan had posed as Senator \"Kameron Suldar,\" and had risen to an influential spot in the Galactic Alliance Senate. Too, the Jedi Order had left Coruscant at Luke Skywalker's orders; he claimed that the Jedi needed to be an entirely separate entity from the government, and that to do so the Jedi needed to operate from somewhere else. Their departure moved the Sith closer to their goal of taking the planet, and Workan contacted Vol, revealing that the Sith were in key positions and that the last Jedi left on the world had been arrested. However, Workan also revealed that the new Senator Rokari Kem had arrived and given him concerns that she might know about their true identities. Vol was disgusted by Workan's fear of the Senator, but when Workan offered to kill her, Vol replied that he would come to the world himself and kill her, and the Sith would make their move to take control of the galaxy.\nUpon his arrival, Vol met with Workan in the Jedi Temple. The Grand Lord also had a second group of Sith ready to attack the government or infiltrate it further; whichever he decided was necessary after he killed Kem. However, unbeknownst to the Sith, Kem was actually Abeloth in disguise. When Vol went to kill her, she instead defeated and killed the Grand Lord, and beheaded him. Kem then called Workan and showed him the head of Vol, and convinced him to meet with her the next day.\nDarish Vol was a strong, wise leader and the most respected member of the Tribe. As such, he was also found rather intimidating, especially to the younger members of the Tribe. Although Vol did not fully trust anyone except for himself and the Force, he counted Ivaar Workan among those not likely to betray him. During the meeting in Tahv regarding the Tribe's interaction with Abeloth, Vol was content for the majority of the debate to simply watch the Lords argue over the matter. However, when High Lord Takaris Yur mentioned that Abeloth was the strongest dark side being they had ever encountered, Vol questioned lightly whether she was stronger than he, and Yur was forced to avoid answering the question directly so as not to insult Vol. Vol believed that although one could learn about dangerous beings by being around them, one might not be able to survive to put that knowledge to use, and he hesitated to ally with Abeloth for that reason. Nevertheless, he did not believe it would be a good idea to sever all ties with so powerful a being, either, and decided to bring her down to the surface in order to study her and make a final decision.\nWhen he spoke to Gavar Khai upon the Saber's arrival with Abeloth, Vol decided to test Khai's loyalties by telling him that Abeloth would have to wait for three days before coming to the surface, and he did not try to hide the trap from Khai. When Khai told him that Abeloth would be disappointed to have to wait, Vol replied that as a capable Sith Saber, Khai would have to convince her that the delay was only due to their respect for her and desire to give her a respectable presentation. Vol also mentioned that he looked forward to meeting Abeloth. Despite his pretenses of good manners when he first met Abeloth, Khai was able to perceive annoyance in Vol and tension between the Grand Lord and Abeloth. Vol took pride in Kesh and the accomplishments of the Tribe. He considered Abeloth to be a means to assist the Tribe to more power, after which she would be disposable. During her attack on Vol, he was surprised to find her agony over needing to be loved, and quickly took advantage of it, fighting her by telling her that she was despised. When she broke free of him, however, he realized that she was far stronger than he had imagined, and considered himself a fool for thinking he could control her.\nVol was disappointed that Workan was so disturbed by Senator Rokari Kem after he had advanced their infiltration on Coruscant so far. However, when Workan offered to eliminate her, Vol replied that he would do so himself—he was furious that Kem had so contested a member of the Tribe. However, upon his arrival on Coruscant, Vol regretted how severe he had been with Workan, as he believed the High Lord had done well in penetrating the capital. Vol, however, failed in his mission to kill Kem, and he died in what Workan—upon being shown the Grand Lord's decapitated head—believed was fear and torture.\nBy 44 ABY, Vol was well over eighty years old. Although his eyes remained sharp, he had become fragile in appearance; he was stooped with age, his face was gaunt, he had a beak-like nose, his hands were claw-like, and he was balding. Gavar Khai believed that Vol should be respected for managing to live so long, but he also wondered whether Vol was weakening and needed to be replaced. For formal ceremonies and meetings, Vol wore colorful robes and vor'shandi markings on his face.\nDarish Vol was very strong in the Force, and he became the most powerful member of the Lost Tribe of Sith. Though he was extremely old by 41 ABY, his presence in the Force was still deemed remarkable, and his power remained greater than that of anyone else on the planet. When he was attacked in his sleep, he survived and nearly destoyed Abeloth in a mental duel by using insults and Mind Shards. Vol was able to control flames and mentally order his guards to attend him. Moreover, Vol was adept at using Dark Side Force Healing. He also was able to use the Force Powers of Surge, Memory Walk even to the degree of driving people insane, and with just a thought employ Force Crush. He was skilled at analyzing the emotions of beings around him through the Force. On Coruscant, he embarked on a mission to assassinate Senator Kem; but Kem, possessed by Abeloth, was able to defeat Vol and kill him.\nDarish Vol was created by author Christie Golden for her first Star Wars novel, Fate of the Jedi: Omen, the second installment in the Fate of the Jedi series. He later appeared in \"First Blood,\" a short story also written by Golden, as well as Golden's third installment in Fate of the Jedi—the eighth novel overall—Fate of the Jedi: Ascension.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kesh",
  "/wiki/36_BBY/Legends",
  "/wiki/44_ABY",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Grand_Lord",
  "/wiki/Circle_of_Lords",
  "/wiki/41_ABY",
  "/wiki/Ship_(Sith_Meditation_Sphere)",
  "/wiki/Sith_Meditation_Sphere",
  "/wiki/The_Force/Legends",
  "/wiki/Sith_Tyro",
  "/wiki/Vestara_Khai",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith_armada_(Lost_Tribe_of_the_Sith)",
  "/wiki/The_galaxy/Legends",
  "/wiki/43_ABY",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Aing-Tii/Legends",
  "/wiki/Relics",
  "/wiki/Codex",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Abeloth",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Tahv",
  "/wiki/Sith/Legends",
  "/wiki/Destruction_of_Tahv",
  "/wiki/Death/Legends",
  "/wiki/Abeloth%27s_fleet",
  "/wiki/High_Lord_(Circle_of_Lords)",
  "/wiki/Ivaar_Workan",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/New_Jedi_Order",
  "/wiki/Senator/Legends",
  "/wiki/Rokari_Kem",
  "/wiki/Wild_Space/Legends",
  "/wiki/Sith_training",
  "/wiki/Starship/Legends",
  "/wiki/Omen",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/5000_BBY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Circle_Chambers",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Olaris_Rhea",
  "/wiki/Damorian_Manufacturing_Corporation/Legends",
  "/wiki/S18_light_freighter",
  "/wiki/Eriadu/Legends",
  "/wiki/Skirmish_near_Eriadu",
  "/wiki/Lost_Tribe_of_Sith_strike_team",
  "/wiki/Fleet/Legends",
  "/wiki/Operation_Shieldfall",
  "/wiki/Nam_Chorios/Legends",
  "/wiki/Yasvan",
  "/wiki/Gavar_Khai",
  "/wiki/Mnemotherapy",
  "/wiki/Revar",
  "/wiki/Galaxy/Legends",
  "/wiki/Galactic_Alliance_Senate",
  "/wiki/Leia_Organa_Solo",
  "/wiki/New_Jedi_Temple",
  "/wiki/Takaris_Yur",
  "/wiki/Eye/Legends",
  "/wiki/Vor%27shandi",
  "/wiki/Dun_M%C3%B6ch/Legends",
  "/wiki/Mind_Shard",
  "/wiki/Pyrokinesis",
  "/wiki/Telepathy/Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Force_speed",
  "/wiki/Memory_Walk",
  "/wiki/Torture/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Christie_Golden",
  "/wiki/Star_Wars",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/First_Blood_(short_story)",
  "/wiki/Fate_of_the_Jedi:_Omen_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_125",
  "/wiki/Star_Wars_Insider:_The_Fiction_Collection_Volume_1",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/Standard_decade/Legends",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Yaru_Korsin",
  "/wiki/Nida_Korsin",
  "/wiki/Lillia_Venn",
  "/wiki/Candra_Kitai",
  "/wiki/Dann_Itra",
  "/wiki/Varner_Hilts"
 ]
}