{
 "name": "Dark-skinned human pirate of Tarnoonga",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pirates of Tarnoonga"
     ]
    }
   ]
  }
 ],
 "content": "This crew member of pirate Captain Gir Kybo Ren-Cha served aboard the Dianoga and was later present at the pirate headquarters on Tarnoonga.\nAboard the Dianoga during a failed attempt to capture the ship that was transporting Mon Julpa back to his home world of Tammuz-an, this pirate took part in several skirmishes with Julpa's forces. On one occasion, as Julpa's adviser Jann Tosh and his droids attempted to rescue Jessica Meade from the pirate's fortress on Tarnoonga, the sleeping pirate was actually mistook by C-3PO to be Jessica.\nFollowing the escape of the prisoners, the pirate accompanied his captain aboard the captured Star Destroyer the Demolisher as the pirates launched an attack against Tammuz-an. Ultimately, they were defeated by the combined forces of Mon Julpa and Lord Malameu Toda.\nWhile mentioned in The Pirates of Tarnoonga: A Droid Adventure, this pirate does not appear in the artwork of the book. However, there is an inconsistency in the way the book describes the character as opposed to how he actually appeared in the television episode. As the book recounts the incident when C-3PO mistook the sleeping pirate to be Jessica Meade, the pirate is described as being toothless. In the TV episode, he does not appear to be missing any teeth.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Pirates_of_Tarnoonga",
  "/wiki/Pirate/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Gir_Kybo_Ren-Cha",
  "/wiki/Dianoga_(starship)",
  "/wiki/Tarnoonga",
  "/wiki/Mon_Julpa",
  "/wiki/Tammuz-an/Legends",
  "/wiki/Jann_Tosh",
  "/wiki/Droid/Legends",
  "/wiki/Jessica_Meade",
  "/wiki/C-3PO/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Demolisher",
  "/wiki/Malameu_Toda",
  "/wiki/The_Pirates_of_Tarnoonga:_A_Droid_Adventure",
  "/wiki/The_Pirates_and_the_Prince",
  "/wiki/Star_Wars:_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/The_New_King",
  "/wiki/The_Pirates_of_Tarnoonga",
  "/wiki/The_Revenge_of_Kybo_Ren"
 ]
}