{
 "name": "Darkstone",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Darkstone was a male Zabrak, who served in the Imperial Military as a Colonel during the time of the Galactic Civil War.\nWhile serving with the Imperial Military, Darkstone was based at the Imperial Oasis, a small Imperial garrison that was located on the planet Tatooine. By 1 ABY, Darkstone was on the verge of retirement, when Doctor Bledsoe, an Imperial scientist, was captured by the Rebel Alliance. Despite Bledsoe's whole-hearted support for the Empire's xenophobic views, the Zabrak felt it was his duty to make sure all Imperial hostages were freed before he gave up his post.\nFortunately for Colonel Darkstone, a spacer and a group of ragtag Imperial supporters stepped forward to assist. However, before the Imperials could rescue the doctor, Darkstone needed them to find prisoner transfer orders. After searching various locations, including a Droid Engineer's Cave on Lok, the Rogue CorSec Base on Corellia, and the Woolamander Palace on Yavin 4, the Imperials finally found the documents Darkstone sought. The Imperials learned that Bledsoe was being transported on a Rebel corvette. The only option would be to infiltrate the corvette, and carry out a daring rescue operation. In order to save the doctor before anything bad happened to him, the Imperials were immediately given a ticket to hand to an Imperial TIE pilot at the Emperor's Retreat.\nFrom here, the Imperials were flown on a Lambda-class shuttle to the corvette. After boarding the corvette, the Imperials fought their way through the corridors, and rescued Bledsoe. After evacuating the corvette through the ship's escape pods, the Imperials returned to Darkstone, and were commended for their service. The Imperial Valorous Services Medal was awarded to the Imperials for their exemplary work.\nDarkstone is a non-player character  in the MMORPG Star Wars Galaxies. In the game, players may take a mission from him which involves rescuing Doctor Bledsoe from a corvette. After completing the mission, the players are given a badge, a schematic for an AV-21, and several other rewards.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Imperial_Oasis",
  "/wiki/Garrison/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Bledsoe",
  "/wiki/Scientist/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Droid_Engineer%27s_Cave",
  "/wiki/Lok/Legends",
  "/wiki/Rogue_CorSec_Base",
  "/wiki/Corellia/Legends",
  "/wiki/Palace_of_the_Woolamander",
  "/wiki/Yavin_4/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/TIE_pilot",
  "/wiki/Emperor%27s_Retreat/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Imperial_Valorous_Services_Medal",
  "/wiki/AV-21",
  "/wiki/Sony"
 ]
}