{
 "name": "Dark_Four_(pilot)",
 "display_name": "Dark Four  (pilot)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "near the Eriadu system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Dark Squadron",
      "Dark Squadron"
     ]
    }
   ]
  }
 ],
 "content": "A human TIE pilot used the callsign \"Dark Four\" in the Galactic Empire's Dark Squadron between 3 ABY and 4 ABY. The squadron attacked the Imperial light cruiser Forerunner II to eliminate the alleged Crimson Dawn mole Tarl Sokoli. During the battle, Dark Four picked off enemy TIE fighters, but ignored their peers' warnings to pay attention to the crossfire, paying the price when they were swiftly destroyed by enemy TIEs.\nDuring the time of the Galactic Empire, the human led a successful career as an Imperial TIE pilot. They were assigned to Empire's Dark Squadron under the callsign \"Dark Four\" between 3 ABY and 4 ABY. Reporting to the Sith assassin Ochi of Bestoon, the squadron flew TIE defenders and were stationed aboard the Executor-class Star Dreadnought Executor, the Sith Lord Darth Vader's flagship. Dark Squadron was placed under the command of the cyborg Beilert Valance, \"Dark One,\" who had been captured and forced into service by Vader. The squadron was then given the mission of eliminating the Imperial Admiral Tarl Sokoli, who was alleged to have become a mole for the Crimson Dawn syndicate.\n\"Dark Four\" and the rest of their squadron traveled to Sokoli's light cruiser, the Forerunner II, near the Eriadu system, the cruiser having been redirected under Vader's orders. Valance had the squadron begin its attack immediately as the cruiser began deploying TIE fighters. With \"Dark Three\" feeling uneasy about fighting other Imperial pilots, Dark Four reminded them that the mission had come from Vader, asking if the other pilot wanted to raise the issue with the Sith Lord himself. As the battle raged on, Dark Four made picked off TIE fighters, one squadronmate commending their shooting. The pilot also heard Lieutenant Jeela Brebtin \"Dark Two\" scorn Dark Three for not calling her by her callsign.\nDark Three was soon killed by the Forerunner II's cannonfire. \"Dark Five\" iterated the words \"kill\" as they shot down TIEs, leading Dark Four to question where the Empire had found the other pilot. Brebtin told Dark Four to focus on the battle, the latter complying and having to correct themself when not using \"Dark Two.\" Valance backed the lieutenant, telling Dark Four to focus on the crossfire ahead. Dark Four did not listen, bragging that they were one of the Empire's best Imperial pilots for a long time. However, the a TIE fighter cut off the pilot by destroying them and their own fighter. Despite Dark Squadron's losses, Valance was able to kill Sokoli himself, completing the squadron's mission.\nDark Four conned a black flight suit along with a life support unit that was attached to their black helmet.\n\"Dark Four\" appeared in the nineteenth issue of the Star Wars: Bounty Hunters comic series, written by Ethan Sacks, illustrated by Ramon Bachs, and published by Marvel Comics on December 29, 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Eriadu_system",
  "/wiki/Human",
  "/wiki/Galactic_Empire",
  "/wiki/Dark_Squadron",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Squadron",
  "/wiki/Assassination_of_Tarl_Sokoli",
  "/wiki/Light_cruiser",
  "/wiki/Forerunner_II",
  "/wiki/Crimson_Dawn",
  "/wiki/Tarl_Sokoli",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/TIE_line",
  "/wiki/Imperial_Era",
  "/wiki/Sith_assassin",
  "/wiki/Ochi",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Executor",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Flagship",
  "/wiki/Squadron_commander",
  "/wiki/Cyborg",
  "/wiki/Beilert_Valance",
  "/wiki/Death",
  "/wiki/Admiral",
  "/wiki/Cruiser",
  "/wiki/Dark_Three_(pilot)",
  "/wiki/Pilot",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/Lieutenant",
  "/wiki/Jeela_Brebtin",
  "/wiki/Gender",
  "/wiki/Cannon",
  "/wiki/Dark_Five_(pilot)",
  "/wiki/Color",
  "/wiki/Flight_suit",
  "/wiki/Life_support",
  "/wiki/Helmet",
  "/wiki/Bounty_Hunters_19",
  "/wiki/Star_Wars:_Bounty_Hunters",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ethan_Sacks",
  "/wiki/Ram%C3%B3n_F._Bachs",
  "/wiki/Marvel_Comics",
  "/wiki/December_29",
  "/wiki/2021",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Bounty_Hunters_18"
 ]
}