{
 "name": "Dark Five  (pilot)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Dark Squadron",
      "Dark Squadron"
     ]
    }
   ]
  }
 ],
 "content": "A human TIE pilot used the callsign \"Dark Five\" when flying as part of the Galactic Empire's Dark Squadron between 3 ABY and 4 ABY. When the squadron attacked the Imperial light cruiser Forerunner II to eliminate the alleged Crimson Dawn mole Tarl Sokoli, Dark Five was able to take out the cruiser's hyperdrive. The pilot continued to destroy enemy TIE fighters as two of their comrades were killed. The mission was ultimately completed thanks to \"Dark One\" Beilert Valance.\nBetween 3 ABY and 4 ABY, the human TIE pilot was assigned to Empire's Dark Squadron under the callsign \"Dark Five.\" The squadron flew TIE defenders and were stationed aboard the Executor-class Star Dreadnought Executor, the Sith Lord Darth Vader's flagship, reporting to the Sith assassin Ochi of Bestoon. The cyborg Beilert Valance was placed in command of Dark Squadron as \"Dark One\" after being captured and forced into service by Vader. The squadron was then given the task of eliminating the Imperial Admiral Tarl Sokoli, who was alleged to have become one of the Crimson Dawn syndicate's mole in the Empire.\nAfter Sokoli's light cruiser, the Forerunner II had been redirected near the Eriadu system under Vader's orders, \"Dark Five\" traveled there with the rest of their squadron. Formed of five TIE defenders, Dark Squadron was quick to begin its attack under Valance's orders, with the cruiser deploying TIE fighters in response to its visitors. As the battle raged on, Dark Five was able to eliminate the Forerunner II's hyperdrive, uttering \"destroy\" when Valance commended their shooting.\nFollowing the loss of \"Dark Three,\" Dark Five shouted \"kill\" over the comm as they took out an enemy TIE fighter, \"Dark Four\" questioning where the Empire had found the pilot. Dark Four fell shortly after, and Valance crashed his defender into the Forerunner II's bridge to reach Sokoli. The squadron commander was able to kill the admiral and complete the squadron's mission.\n\"Dark Five\" appeared in the nineteenth issue of the Star Wars: Bounty Hunters comic series, written by Ethan Sacks, illustrated by Ramon Bachs, and published by Marvel Comics on December 29, 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Galactic_Empire",
  "/wiki/Dark_Squadron",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Squadron",
  "/wiki/Assassination_of_Tarl_Sokoli",
  "/wiki/Light_cruiser",
  "/wiki/Forerunner_II",
  "/wiki/Death",
  "/wiki/Crimson_Dawn",
  "/wiki/Tarl_Sokoli",
  "/wiki/Cruiser",
  "/wiki/Hyperdrive",
  "/wiki/Pilot",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Beilert_Valance",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Executor",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Flagship",
  "/wiki/Sith_assassin",
  "/wiki/Ochi",
  "/wiki/Cyborg",
  "/wiki/Squadron_commander",
  "/wiki/Admiral",
  "/wiki/Eriadu_system",
  "/wiki/Dark_Three_(pilot)",
  "/wiki/Dark_Four_(pilot)",
  "/wiki/Gender",
  "/wiki/Bounty_Hunters_19",
  "/wiki/Star_Wars:_Bounty_Hunters",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ethan_Sacks",
  "/wiki/Ram%C3%B3n_F._Bachs",
  "/wiki/Marvel_Comics",
  "/wiki/December_29",
  "/wiki/2021",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/TIE_line",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/Bounty_Hunters_18"
 ]
}