{
 "name": "Dark Apprentice",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 1 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.85 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown; red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Order of the Sith Lords"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Vader"
     ]
    }
   ]
  }
 ],
 "content": "The Dark Apprentice, also known as \"Starkiller,\" was a clone of Galen Marek, a Force-sensitive Human male taken on by the Sith Lord Darth Vader as his secret apprentice. Following Marek's death, Vader embarked on a quest to create a perfect, obedient duplicate of the man to take Marek's place. Within the cloning facilities of Kamino, hundreds of failures were produced before the Dark Lord of the Sith succeeded in creating a clone of the deceased apprentice that was able to overcome his template's emotions and submit himself entirely to the dark side of the Force.\nAs his training progressed, the Dark Apprentice surpassed all those who had come before him; he was able to store Marek's memories independent from his own and suppress the dead man's feelings. Vader planned to have the apprentice face a final test against a rogue clone of Marek during the Rebel attack on Kamino, but the Dark Apprentice did not participate in the battle, and his Sith Master was captured by the Alliance to Restore the Republic.\nCreated on the ocean-covered world of Kamino around 1 BBY, the Dark Apprentice was a clone of Galen Marek, the deceased apprentice of the Sith Lord Darth Vader, grown as part of Vader's endeavor to create a perfect and obedient substitute to take Marek's place. Several clones had come before him, all of which had been trained using memory flashes from the original Marek's life. These predecessors had failed to meet expectations in one way or another, either due to genetic defects or succumbing to their template's emotions, and were subsequently discarded.\nUpon his awakening, presided over by Vader, the Dark Apprentice was confronted with Marek's memories, specifically the man's feelings for his former pilot, Imperial-turned-Rebel Captain Juno Eclipse. Immediately, he asked about her whereabouts, but Vader announced that she was irrelevant—all that mattered was what needed to be done. This, however, did not prevent the Dark Apprentice from inquiring about who Marek was in the future. When questioned, Vader repeatedly found it unnecessary to answer directly—rather, he stated the clone had inherited the memories, thoughts and dreams of a broken man, one far less powerful than the Dark Apprentice. As a side effect of the cloning process, he possessed both the skills and weaknesses of his genetic template.\nThe Dark Apprentice was trained in lightsaber combat against several Sith Training Droids. After viewing his progress, Vader showed him the cloning platforms in Timira City's clone spire, which displayed all of his rejected brethren locked up in stasis. The clone was determined to surpass all the others, but he was curious as to know how many had preceded him. Vader disregarded the question; instead, he told the Dark Apprentice that the only number that mattered was the quantity of clones that would be needed if he failed like the rest. Vader warned him that if he could not overcome Marek's emotions, he would fail like his predecessors.\nOver time, the lead cloning technician noted that the Dark Apprentice was able to compartmentalize the memory imprints used to train him, thereby succeeding where all others had failed—the clone was able to store Marek's memories independently from his own, freeing him from his template's emotions.\nWith the apprentice free of Marek's memories, Vader brought him to a chamber where his template's lifeless body was kept. The clone understood the significance of the act, and his Master believed that he, unlike all the others before him, would prove successful. In a training match against the holodroids, the Dark Apprentice was able to rise above Marek's emotions, striking down a droid bearing the appearance of Captain Eclipse. To Vader, the clone revealed his disgust and hatred for his template's weaknesses, and his pride for being able to overcome them when those before him had failed. Satisfied, Vader replied that he was almost ready for his final test.\nDuring the final stages of the Dark Apprentice's training, a renegade clone of Marek, who had previously fled Kamino, joined with the Rebel Alliance in an attack on Timira City's cloning facilities. Vader intended to use the battle as a final test for the Dark Apprentice by drawing Starkiller into a trap atop the cloning spire.\nBefore leaving to confront Starkiller, Vader instructed the Dark Apprentice to wait until his assistance was required. The apprentice announced that he was ready to fulfill the purpose of his creation. The trap did not go as planned, however. Starkiller bested Vader in a lightsaber duel but refused to strike him down, having previously seen a vision in which he was killed by Vader's new apprentice—the reborn Starkiller—when he attempted to kill his opponent. The Sith Lord was captured by the Alliance upon the battle's conclusion, with no interference from the Dark Apprentice.\nUnlike the clones that preceded him, the Dark Apprentice was able to overcome Galen Marek's emotions, making him the lone success in a project filled with failures. To the delight of the lead clone technician who observed his progress, the apprentice managed to isolate the original Marek's memories; as a result, the clone could differentiate between his own thoughts and those of his genetic template. The Dark Apprentice grew to despise his template for his emotions and failures, ultimately feeling pride for rising above those weaknesses that had inhibited the clones who came before him.\nThe Dark Apprentice, created from the genetic template of Darth Vader's former apprentice, possessed the same abilities and Force potential as his progenitor. During his tutelage on Kamino, the Dark Apprentice was trained in lightsaber combat against multiple Sith training droids, using the dual blade form of combat known as Jar'Kai. As the clone's training progressed, Vader told the Dark Apprentice that he had become more powerful in the Force than the original Starkiller had ever been. By the time of the Rebel attack on Kamino, the Dark Apprentice's deep immersion in the dark side of the Force caused him to manifest its physical effects, making his skin pale and turning his irises red.\nThe Dark Apprentice, referred to as the \"reborn\" Starkiller, first appeared in The Force Unleashed II novelization in a vision that corresponds with the non-canon dark side ending to Star Wars: The Force Unleashed II. In addition to the video game's Databank section, the dark clone's origins were detailed in a series of cutscenes entitled \"Distant Thunder,\" extras in the game which can be unlocked by completing several challenges. In these video clips, Sam Witwer provides the voice of the Dark Apprentice. As these cutscenes have no impact on the game's progression, and in terms of time placement precede the player's decision between the canonical or non-canonical endings, it is assumed that the Dark Apprentice is canon, even though he does not appear in the light side ending of the game. This is primarily due to the fact that, in the novelization of the game, Starkiller experiences a vision wherein he attempts to kill Vader at the end of their duel, but is instead killed by the Dark Apprentice. This revelation ends up becoming one of the reasons for his decision to spare Vader's life. The vision also coincides with the material presented in the \"Distant Thunder\" extras and with the events of the non-canon dark side ending. The Dark Apprentice further appears in extra content that can be downloaded for The Force Unleashed II; a non-canon bonus mission that follows the dark side ending of the game.\nIn the non-canon dark side ending of The Force Unleashed II, the player, as the clone of Galen Marek, chooses to strike down Darth Vader. Before this can happen, however, a lightsaber blade suddenly appears through the clone's chest. A hooded figure, having used a cloaking device to get near the clone, is revealed to be the wielder of the blade; he proceeds to best Jedi General Rahm Kota in a brief duel before Force-choking the General and pushing him and several Rebel troopers into the ocean below as Terror Troopers deal with the remaining Rebel soldiers. Vader approaches the dying clone of Marek, announcing that he lied about the failure of the cloning project as the hooded figure reveals himself to be the Dark Apprentice, Galen Marek's perfect clone whose immersion in the dark side was physically reflected through his pale skin and yellow eyes.\nWith the Rebel attack repelled, Vader commends his new assassin for succeeding in his final challenge. The obedient clone kneels before Vader, who tasks him with taking the Rogue Shadow to find and eliminate the surviving Rebels scattered throughout the galaxy. As he departs, the Dark Apprentice takes a moment to glance at the lifeless body of Juno Eclipse; feeling no emotions for her, he raises his hood and continues on his way. Escorted by a group of TIE fighters, the Dark Apprentice leaves Kamino in the Rogue Shadow and enters hyperspace to fulfill his orders.\nIn content available for download, the Dark Apprentice participates in an alternate version of the Battle of Endor. The remnants of the Rebel Alliance launch an attack on the second Death Star above the Forest Moon of Endor, beating back Imperial forces and gaining access to the shield generator bunker with the assistance of the native Ewoks. Darth Vader dispatches the Dark Apprentice to the moon to deal with the threat while Vader remains with Emperor Palpatine aboard the new battlestation. Landing the Rogue Shadow on Endor, the Dark Apprentice fights through Rebel soldiers and Ewoks en route to the bunker, destroying the Alliance's shuttle in the process. At the base, the apprentice is confronted by smugglers Han Solo and Chewbacca, the latter having commandeered an AT-ST to guard the bunker's entrance. The clone kills the duo before proceeding into the bunker, where he proceeds to kill Rebels and Imperials alike.\nAt the heart of the bunker, the Dark Apprentice encounters Leia Organa, the Alderaanian princess who became a Jedi after her twin brother's death on the planet Hoth. The two duel, with Organa attempting to use the compound's machinery against her opponent. The apprentice repeatedly bests Organa, forcing the fight to continue on the roof of the bunker. Although the dark clone is impressed by Organa's skills, his own abilities enable him to overpower and kill the female Jedi. Aboard the Death Star, the Emperor revels in the Imperial victory before revealing to Vader that he knew of the Dark Apprentice's existence. Referring to his treacherous apprentice as \"Skywalker,\" Palpatine threatens to kill Vader for plotting to overthrow him. Vader activates his lightsaber in an attempt to strike down his Master, but Palpatine forces him to his knees with a barrage of Force lightning. He proceeds to order Captain Sarkli to take his forces and kill the apprentice on Endor. As the dark clone meditates near Organa's body, he senses the approach of several Star Destroyers and opens his eyes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Galen_Marek",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Star_Wars:_The_Jedi_Academy_Trilogy",
  "/wiki/Sith_Warrior_(Galen_Marek)",
  "/wiki/Kamino/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Death/Legends",
  "/wiki/Timira_City",
  "/wiki/Aberrant_clone",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Prime_clone",
  "/wiki/Sith_training",
  "/wiki/Memory_flash",
  "/wiki/Subject_1138",
  "/wiki/Assault_on_Kamino",
  "/wiki/Sith_Master/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Ocean/Legends",
  "/wiki/Planet/Legends",
  "/wiki/DNA/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Juno_Eclipse/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Sith_Training_Droid",
  "/wiki/Lead_Cloning_Technician",
  "/wiki/PROXY_droid",
  "/wiki/Droid/Legends",
  "/wiki/Escape_from_Kamino_(1_BBY)",
  "/wiki/Timira_City_Cloning_Facility",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Red",
  "/wiki/The_Force_Unleashed_II_(novel)",
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Force_Unleashed_II",
  "/wiki/Sam_Witwer",
  "/wiki/Cloaking_device/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Rahm_Kota/Legends",
  "/wiki/Telekinesis/Legends#Force_Choking",
  "/wiki/Telekinesis/Legends#Force_Push",
  "/wiki/Terror_Trooper",
  "/wiki/Rebel_trooper/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Sith_assassin/Legends",
  "/wiki/Rogue_Shadow",
  "/wiki/The_galaxy/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Hyperspace/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Endor_shield_generator_bunker",
  "/wiki/Ewok/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Battlestation",
  "/wiki/Soldier/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alderaanian/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Darth_Vader%27s_lightsaber/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Sarkli",
  "/wiki/Meditation/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Category:Images_of_the_Dark_Apprentice",
  "/wiki/Star_Wars:_The_Force_Unleashed_II#Endor_(downloadable_content)",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Databank_(original)"
 ]
}