{
 "name": "Dark Three  (pilot)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "near the Eriadu system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Academy",
      "Dark Squadron",
      "Imperial Academy",
      "Dark Squadron"
     ]
    }
   ]
  }
 ],
 "content": "A human TIE pilot used the callsign \"Dark Three\" and served the Galactic Empire's Dark Squadron between 3 ABY and 4 ABY. They and their squadron attacked the Imperial light cruiser Forerunner II as part of their mission to eliminate the alleged Crimson Dawn mole Tarl Sokoli. During the battle, Dark Three was saved from an enemy TIE fighter by Jeela Brebtin \"Dark Two,\" but fell to the cruiser's cannons shortly after.\nDuring the time of the Galactic Empire, the human attended an Imperial Academy before becoming a TIE pilot. Between 3 ABY and 4 ABY, they were eventually assigned to Empire's Dark Squadron, using the callsign \"Dark Three\" and flying a TIE defender. The squadron reported to the Sith assassin Ochi of Bestoon, and was stationed aboard the Executor-class Star Dreadnought Executor, the flagship of the Sith Lord Darth Vader. Dark Squadron was placed under the command of the cyborg Beilert Valance, \"Dark One,\" who had been captured by Vader and forced into service by the Sith Lord. The squadron was then tasked with the elimination of the Imperial Admiral Tarl Sokoli, who was alleged to have been recruited by the Crimson Dawn syndicate to be one of their moles.\n\"Dark Three\" and the rest of their squadron went near to the Eriadu system, where Sokoli, aboard the light cruiser Forerunner II, had been redirected under Vader's orders. Valance had the squadron immediately attack as the cruiser deployed its TIE fighters. Dark Three felt uneasy about fighting other Imperial pilots, adding that it was possible that they could have gone to the Imperial Academy with some of them. \"Dark Four\" chimed in that the mission had come from Vader, questioning whether Three wanted to raise the issue with the Sith Lord himself.\nAs the battle progressed, Dark Three was pursued by one TIE fighter, asking his squadronmates for help. Jeela Brebtin \"Dark Two\" destroyed the fighter and told Three to stop whining. Dark Three thanked her, only to be scorned for using her real name over her callsign. After \"Dark Five\" took out the Forerunner II's hyperdrive, the cruiser begun firing its cannons at its attackers. The Forerunner II's rear cannons nudged Dark Three towards its front cannons, which destroyed the pilot with their fighter. Despite Dark Three's loss, and eventually Dark Four's, Valance was able to kill Sokoli and complete his squadron's mission.\nDark Three wore a black flight suit with a life support unit attached to their black helmet, which bore gray markings.\n\"Dark Three\" appeared in the nineteenth issue of the Star Wars: Bounty Hunters comic series, written by Ethan Sacks, illustrated by Ramon Bachs, and published by Marvel Comics on December 29, 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Eriadu_system",
  "/wiki/Human",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Academy",
  "/wiki/Dark_Squadron",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Squadron",
  "/wiki/Assassination_of_Tarl_Sokoli",
  "/wiki/Light_cruiser",
  "/wiki/Forerunner_II",
  "/wiki/Crimson_Dawn",
  "/wiki/Tarl_Sokoli",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Jeela_Brebtin",
  "/wiki/Cruiser",
  "/wiki/Cannon",
  "/wiki/Imperial_Era",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Sith_assassin",
  "/wiki/Ochi",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Executor",
  "/wiki/Flagship",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Squadron_commander",
  "/wiki/Cyborg",
  "/wiki/Beilert_Valance",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/Death",
  "/wiki/Admiral",
  "/wiki/Pilot",
  "/wiki/Dark_Four_(pilot)",
  "/wiki/Dark_Five_(pilot)",
  "/wiki/Hyperdrive",
  "/wiki/Color",
  "/wiki/Flight_suit",
  "/wiki/Life_support",
  "/wiki/Helmet",
  "/wiki/Bounty_Hunters_19",
  "/wiki/Star_Wars:_Bounty_Hunters",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ethan_Sacks",
  "/wiki/Ram%C3%B3n_F._Bachs",
  "/wiki/Marvel_Comics",
  "/wiki/December_29",
  "/wiki/2021",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/TIE_line",
  "/wiki/Bounty_Hunters_18"
 ]
}