{
 "name": "Darnell Reggs",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Darnell Reggs was a Human male BTL Y-wing starfighter pilot who served under Admiral Krane in the Alliance to Restore the Republic during the Galactic Civil War. In 3 ABY, Reggs and Krane escorted Rebel pilot Rookie One on his way to the planet Imdaar to steal a TIE Phantom starfighter from the Executor-class Star Dreadnought Terror, helping to destroy a squadron of TIE/IN interceptors and ensuring Rookie One's safe arrival.\nA Human male born during the final years of the Galactic Republic, Darnell Reggs became a BTL Y-wing starfighter pilot in the Alliance to Restore the Republic during its war against the Galactic Empire. Reggs flew under the command of Admiral Krane, a hardened officer who believed the Empire could only be defeated by a precision fighting force and who gave little leeway to his subordinates.\nFollowing the Battle of Hoth in 3 ABY, by which time Reggs was in his late twenties, the Rebel YT-1300 light freighter Corellia Star was recovered by Rebel pilot Rookie One after it was captured by the Empire. In the ship's mission recordings, the Corellia Star's captain revealed that the Empire was processing oridium ore at a facility in the Belt of Arah to fuel some new weapon that the Dark Lord of the Sith Darth Vader intended to use to destroy the Alliance. Reggs was among the pilots who attended a briefing by Admiral Gial Ackbar aboard a Nebulon-B escort frigate in the Alliance Fleet, during which the admiral ordered a search of the Belt of Arah and the destruction of the facility's production capacity.\nRebel fighters from Rascal Squadron eventually destroyed the Arah mining facility and discovered that the Empire's new weapon was a group of modified V38 assault fighters that had been fitted with cloaking devices that rendered them effectively invisible. Soon after, Reggs again attended a briefing held by Ackbar. Intelligence reports indicated a high level of Imperial Navy activity near the planet Imdaar, in the Dantus sector of the Outer Rim Territories, and that the Executor-class Star Dreadnought Terror was en route to deploy a full wing of the new TIE Phantoms. Rookie One had volunteered to infiltrate the Terror and steal one of the new fighters to be studied in the hopes of finding a countermeasure.\nReggs and Krane were assigned to escort Rookie One on his way to Imdaar in a three-ship flight group of Y-wings. On the way, they encountered over a dozen Imperial TIE/IN interceptors. Despite being heavily outnumbered, the three Rebels were able to eliminate all the Imperials before Reggs and Krane departed, leaving Rookie One to proceed alone to Ceti 597 and the final approach to Imdaar.\nReggs was a competent Y-wing pilot who served under the demanding Admiral Krane. Reggs understood Krane's attitude and respected his military skills, but, though he unquestioningly obeyed the admiral's orders, he did not regard him highly on a personal level. Reggs was on friendly terms with Rookie One prior to the mission to Imdaar.\nDarnell Reggs was created for the 1995 LucasArts video game Star Wars: Rebel Assault II: The Hidden Empire, in which he appears in three cutscenes and the game's eighth mission, \"Flight to Imdaar.\" The character was portrayed in the game by actor Carl Magruder.\nRebel Assault II designer Vincent Lee's storyboards and scripts document, dated November 16, 1994, included a brief description of Reggs. Though not included in the game or its manual, the biography was adapted for use on the LucasArts website, and the document was later printed in Rob Smith's Rogue Leaders: The Story of LucasArts. Lee also made notes on the people he thought symbolized each character in the game, choosing actor Denzel Washington to represent Reggs.\nProps and costumes created for the original trilogy of Star Wars movies were used during the filming of Rebel Assault II. The flight helmet worn by Reggs is the same design as the blast shield helmet used by Luke Skywalker in Star Wars: Episode IV A New Hope and Dorovio Bold's helmet in Star Wars: Episode VI Return of the Jedi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Brown",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/File:Reggs1-RAII.ogg",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Krane_(Rebel_Alliance)",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Rookie_One",
  "/wiki/Planet/Legends",
  "/wiki/Imdaar/Legends",
  "/wiki/TIE/ph_phantom",
  "/wiki/Starfighter/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Terror",
  "/wiki/Squadron/Legends",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/File:Reggs2-RAII.ogg",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_Military/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Time/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Corellia_Star",
  "/wiki/Starship/Legends",
  "/wiki/Unidentified_captain_(Corellia_Star)",
  "/wiki/Oridium",
  "/wiki/Ore/Legends",
  "/wiki/Arah_mining_facility",
  "/wiki/Arah_asteroid_belt",
  "/wiki/Fuel/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Rascal_Squadron",
  "/wiki/Battle_of_Arah",
  "/wiki/Mining/Legends",
  "/wiki/V38_assault_fighter",
  "/wiki/Cloaking_device/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Dantus_sector/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Fighter_wing/Legends",
  "/wiki/Mission_to_Imdaar",
  "/wiki/Flight_group/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Ceti_597",
  "/wiki/1995",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Rebel_Assault_II:_The_Hidden_Empire",
  "/wiki/Carl_Magruder",
  "/wiki/Vincent_Lee",
  "/wiki/November_16",
  "/wiki/1994",
  "/wiki/Rob_Smith",
  "/wiki/Rogue_Leaders:_The_Story_of_LucasArts",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars",
  "/wiki/Flight_helmet/Legends",
  "/wiki/Blast_shield",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Dorovio_Bold/Legends",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Category:Audio_files_of_Darnell_Reggs",
  "/wiki/Category:Images_of_Darnell_Reggs",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/19_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy"
 ]
}