{
 "name": "Darrb",
 "display_name": "Darrb",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gabdorin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  }
 ],
 "content": "Darrb was a Gabdorin male vendor who resided on the planet Varkana sometime between 34 ABY and 35 ABY. He had a home in Vargo Spaceport and sold fruits and vegetables in the marketplace. His stall in the spaceport was disturbed by passing Resistance member Kazuda Xiono, who tripped over a pot of fruits and vegetables, causing the Gabdorin to angrily shoo Xiono away from his wares. Darrb's home was later trespassed by Xiono and a Resistance spy, Norath Kev, leading him to request the aid of First Order stormtroopers to remove them. When the Resistance members bested the stormtroopers, Darrb took it upon himself to order them out of his home.\nDarrb was a Gabdorin male vendor in the Vargo Spaceport on the planet Varkana during the First Order-Resistance War between 34 ABY and 35 ABY. Resistance member Kazuda Xiono and his droid CB-23 traveled to the spaceport from the Colossus space station as CB-23 honed in on a Resistance distress signal. While there, Xiono tripped over a pot of Darrb's, spilling various fruits and vegetables. The vendor shouted angrily at Xiono in an alien language. Although Xiono apologized before departing, Darrb tossed one of the produce at the Resistance member in frustration. Later that night, Darrb was stopped by two First Order stormtroopers and was shown a wanted poster for Xiono and Norath Kev, a Duros Resistance spy.\nWhile trying to run from two First Order stormtroopers, Xiono and Kev encountered Darrb heading into his home. They initially asked the Gabdorin if they could hide in his home. With the First Order about to apprehend them, they declared there was no time to await permission to enter the home and carried Darrb inside. He expressed concern about being robbed before Kev and Xiono covered the Gabdorin's mouth with their hands. The stormtroopers passed by the home, with Darrb unable to call for their help. He then stomped Kev's foot, causing the Duros to holler in pain and alert the stormtroopers outside.\nThe two stormtroopers knocked on the door and demanded it be opened. When their demands went unmet, one of the stormtroopers shot the door's control panel, opening the door to reveal a terrified Darrb holding a pot of fruits and vegetables. They asked the Gabdorin if two Resistance spies had been present. Darrb attempted to discreetly signal that the spies were behind the stormtroopers, but Kev and Xiono knocked the two troopers out. He then demanded that the two Resistance members leave afterward, throwing produce at the two as they departed and dragged the stormtroopers with them.\nDarrb was protective of his wares and home, expressing anger and throwing food at Xiono when the Resistance member tripped and made a mess of his stall. When the spies later trespassed into his home, he was willing to draw the attention of the First Order to maintain the sanctity of his home and, when the spies left, again showed his anger by launching food at the retreating spies. Darrb had purple skin and yellow eyes. When Darrb interacted with Kev and Xiono, he spoke a non-Basic language.\nWhen Darrb encountered Xiono, he wore a tan shirt with two vertical green stripes on either side and a green collar. The sleeves had white wraps on the forearm and ended with a brown cuff. He wore brown pants that were tan at the knees with a blue trim, along with a brown belt and brown boots. He used a light brown pot to carry fruits and vegetables.\nDarrb first appeared in \"The Missing Agent,\" the twelfth episode of the second season of the Star Wars Resistance animated television series, which aired on December 22, 2019. He was credited as \"Vendor.\" On December 29 of that year, Darrb appeared in the next episode, \"Breakout,\" with the subtitles identifying the Gabdorin as Darrb, although he was credited as \"Citizen.\" Jonathan Lipow voiced him in both appearances. The Gabdorin did not speak Basic, but the script had dialog written to convey what the alien language needed to sound like. Darrb's role in \"Breakout\" was originally scripted to be for another Resistance spy, the Elomin female Amleto. Amleto was fully designed before being cut from the arc, and her key moment was instead given to Darrb.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Gabdorin",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/File:OutOfMyHouse.ogg",
  "/wiki/Merchant",
  "/wiki/Planet",
  "/wiki/Varkana",
  "/wiki/34_ABY",
  "/wiki/35_ABY",
  "/wiki/Vargo_Spaceport",
  "/wiki/Fruit",
  "/wiki/Vegetable",
  "/wiki/Spaceport",
  "/wiki/Resistance",
  "/wiki/Kazuda_Xiono",
  "/wiki/Spy",
  "/wiki/Norath_Kev",
  "/wiki/First_Order",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Jarek_Yeager",
  "/wiki/File:MasterOfLowProfile.ogg",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Droid",
  "/wiki/CB-23",
  "/wiki/Colossus",
  "/wiki/Space_station",
  "/wiki/Rescue_of_Norath_Kev",
  "/wiki/Distress_signal",
  "/wiki/Alien",
  "/wiki/Language",
  "/wiki/Foodstuff",
  "/wiki/Local_day",
  "/wiki/Duros",
  "/wiki/Time",
  "/wiki/Thief",
  "/wiki/Mouth",
  "/wiki/Limb",
  "/wiki/Trooper",
  "/wiki/File:ThisIsAbsurd.ogg",
  "/wiki/Eye",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/The_Missing_Agent",
  "/wiki/Star_Wars_Resistance_Season_Two",
  "/wiki/Star_Wars_Resistance",
  "/wiki/December_22",
  "/wiki/2019",
  "/wiki/December_29",
  "/wiki/Breakout",
  "/wiki/Jonathan_Lipow",
  "/wiki/Elomin",
  "/wiki/Amleto",
  "/wiki/Category:Audio_files_of_Darrb",
  "/wiki/Category:Images_of_Darrb",
  "/wiki/StarWars.com",
  "/wiki/StarWarsKids.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Station_to_Station",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Standard_year",
  "/wiki/September_21",
  "/wiki/2020"
 ]
}