{
 "name": "Darryn Edalm",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Darryn Edalm was a male human who served as an Imperial bureaucrat. He was wiry, paranoid, and compulsive, and he tried to fit into the image of an Imperial governor.\nOriginally an Imperial researcher, he discovered a survey which indicated the planet Karra had a large amount of valuable resources. When this proved to be false, he was accused of treason and stripped of all authority. He was arrested and put on a Lambda shuttle to be transferred off-planet for trial and execution. The shuttle crashed and he was rescued by a group of Rebels led by Elth Nardah. When Nardah agreed to take him as a prisoner, the Karran became angry that the Imperial wasn't being killed and attacked the Rebels and their prisoner. After defeating the natives, Edalm balked at returning to the Karran village to retrieve the Rebel's ship and suggested they instead steal a confiscated smuggling ship from the local Imperial base. Upon discovering the Rebel ship was disabled by the Karran, he accompanied the Rebels to the local Imperial base. During the trip, he became annoyed at Karvinna Raen who had a hard time dealing with the death of Nardah. After escaping Karra, Edalm travelled with the group to the Alliance base Seven Flames. He was questioned by agents of Alliance Intelligence and, due to his relative unimportance, was sentenced to spend the rest of the war working at a medium-security work camp on Shimmer.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Karra",
  "/wiki/Varmigio",
  "/wiki/Treason/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Elth_Nardah",
  "/wiki/Karran",
  "/wiki/Karran_village",
  "/wiki/Starship/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Karvinna_Raen",
  "/wiki/Seven_Flames",
  "/wiki/Alliance_Intelligence",
  "/wiki/Shimmer",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Stranded",
  "/wiki/Star_Wars_Adventure_Journal_1",
  "/wiki/West_End_Games",
  "/wiki/Classic_Adventures:_Volume_Four_-_The_Best_of_the_Journal"
 ]
}