{
 "name": "Darrin_Arkanian",
 "display_name": "Darrin Arkanian",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "10 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Corwin Shelvay"
     ]
    }
   ]
  }
 ],
 "content": "Darrin Arkanian was a male Sullustan Jedi Master who served the Jedi Order during the final years of the Galactic Republic. An idealist, Arkanian loved life over any other thing, and struggled to be a model of peace and contemplation. Arkanian assumed the name Dimitri Melamor as he attempted to resist Imperial rule.\nDarrin Arkanian was a Sullustan Jedi during the waning years of the Galactic Republic, who had a sister named Dawn. Shortly before the Clone Wars, Arkanian had reached the rank of Jedi Master, and had trained several students. He was assigned to lead a Jedi task force charged with patrolling the border between the Oricho and Lahara sectors after Separatists attacked a Space Rescue Corps ship, the Iron Tether, while it was on deployment near the Cowl Crucible. The Iron Tether traveled close to the Lahara sector border, which had seceded from the Republic, prompting an attack from four C-73 Tracker starfighters and a modified Corellian freighter. Arkanian's task force was charged with patrolling the border and offering security to travelers on the Republic side of the border. Despite the rise of Galactic Emperor Palpatine and his despotic policies, Arkanian believed that as long as the Jedi Order trusted in the Force, no major threats would arise. He soon found that his belief was in error, as the Jedi were hunted down at the conclusion of the Clone Wars.\nArkanian went into hiding, working at a college under the name \"Dimitri Melamor,\" where he became a tutor to a young Human named Corwin Shelvay. He took the young man on as his apprentice, and assisted him in constructing a lightsaber. Shelvay was full of good intentions but easy to anger; Arkanian tried to teach Shelvay to control his emotions, while his apprentice tried to convince Arkanian to lead the fight against the Empire. They roamed the galaxy, attempting to unite the scattered remnants of the Jedi Order even as the Emperor continued to hunt them down. Arkanian kept in contact with his sister through letter drops, and he and Shelvay traveled to many worlds, including Bespin, Kessel, Tatooine, and Coruscant. While on the galactic capital, they tried to keep their presence a secret, but were found out, resulting in Shelvay's capture by the Empire. Imperial interrogators could not break Shelvay and force him to reveal Arkanian's location, so he was turned over to High Inquisitor Antinnis Tremayne. Under Tremayne's ministrations, Shelvay endured two weeks of torture before Arkanian arrived to rescue him.\nAs the pair escaped, they headed to rendezvous with a freighter owned by Captain Rashh. They were followed by Tremayne, and Arkanian engaged Tremayne in a lightsaber duel. Tremayne, however, had brought reinforcements, who trained their blasters on Shelvay. Tremayne ordered the Sullustan to surrender; Arkanian attempted to trade his life for Shelvay's, but Tremayne struck him with his lightsaber. With Arkanian gravely wounded, Shelvay took up his master's lightsaber and attacked Tremayne, severing his arm below the shoulder and then across his face, blinding him. Shelvay managed to flee with Arkanian. The Jedi Master died a few days later.\nDarrin Arkanian was an idealist and dreamer who had learned to cherish life. He attempted to live his life peacefully and in contemplation.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/10_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Corwin_Shelvay/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Dawn_Arkanian",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Oricho_sector",
  "/wiki/Lahara_sector",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Space_Rescue_Corps/Legends",
  "/wiki/Iron_Tether",
  "/wiki/Cowl_Crucible",
  "/wiki/C-73_Tracker_starfighter",
  "/wiki/Corellian/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Teacher/Legends",
  "/wiki/Human/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Capital/Legends",
  "/wiki/High_Inquisitor",
  "/wiki/Antinnis_Tremayne",
  "/wiki/Standard_week/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Rashh",
  "/wiki/Blaster/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_56",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Dark_Vendetta_(short_story)",
  "/wiki/Star_Wars_Galaxy_Magazine_8",
  "/wiki/West_End_Games",
  "/wiki/Graveyard_of_Alderaan",
  "/wiki/Classic_Adventures:_Volume_Two",
  "/wiki/Arkanian_Dawn_(narrative)",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxy_Magazine_7"
 ]
}