{
 "name": "Darryn Thyte",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic right arm"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New RepublicFarStar",
      "FarStar"
     ]
    }
   ]
  }
 ],
 "content": "Darryn Thyte was a Human male who served as a lieutenant with the New Republic, and as the bridge operations officer aboard the FarStar.\nThyte was a starfighter pilot, flying a T-65 X-wing starfighter. Several months before the Battle of Kal'Shebbol, he was flying air cover for a ground action in the mountains of Vaenrood. Imperial artillery fire clipped his wing, and he crashed. He lost his right arm in the crash when the canopy buckled and snapped, shearing off most of the limb. Medics were able to replace his limb with a clunky cybernetic arm. The replacement was the best available at the time. He also suffered a crisis of confidence in his abilities.\nFollowing the accident, Thyte was taken off active flight duty, and reassigned to bridge operations on a capital ship within the task force. His ship fought at the Battle of Kal'Shebbol, and when the FarStar mission was proposed, he volunteered for duty as a chance to prove his own worth.\nAs operations officer, Thyte was responsible for maintaining order and efficiency in the command center. He was the captain's eyes and ears, supervising communications, sensors and navigation. He also acted as the FarStar's navigator, since he was the only crew member with any experience of capital ship astrogation.\nThyte's greatest wish was to fly with a frontline squadron, but realized his attitude would be detrimental to the unit. Lieutenant Ranna Gorjaye insisted that Thyte not even be considered for fighter duty assignment.\nThyte was extremely bitter following his disfigurement. He initially came across to the rest of the crew as a sour, ill-tempered individual, but his relationships with them improved over time, and he even became infatuated with Ranna Gorjaye despite being resentful of her position as starfighter squadron commander.\nHe considered the bridge his domain, and was a forceful and imposing figure. He didn't let anyone push him around. Thyte was the type of officer who didn't take orders, merely \"command suggestions\". He knew that his attitude was tolerated merely because the FarStar crew needed him.\nThyte was rarely seen away from the bridge, and loathed leaving the ship in small craft, which possibly indicated a fear of traveling in them.\nAlthough his replacement arm was clunky and crude, and didn't have precise sensitivity or function, it served as a computer interface that also allowed him to manipulate data if a screen was also present.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Darryn_Thyte",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/FarStar",
  "/wiki/Ranna_Gorjaye",
  "/wiki/Lieutenant/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Battle_of_Kal%27Shebbol",
  "/wiki/Vaenrood",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Commander/Legends",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/The_Saga_Begins",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/Omens",
  "/wiki/Crisis_(RPG_adventure)",
  "/wiki/Traitor_in_our_Midst",
  "/wiki/Plant_Food",
  "/wiki/The_Kathol_Outback",
  "/wiki/Little_Empires",
  "/wiki/Wildfire_(adventure)",
  "/wiki/The_Masters_of_Exocron",
  "/wiki/Galaxy%27s_Edge",
  "/wiki/Waystation",
  "/wiki/The_Kathol_Rift",
  "/wiki/Home_(RPG_adventure)",
  "/wiki/Showdown_(RPG_adventure)",
  "/wiki/The_Saga_Nears_Its_End",
  "/wiki/Endgame",
  "/wiki/Endgame_(RPG_adventure)",
  "/wiki/Star_Wars_Miniatures_Battles#Blister_Packs",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Iron_Man",
  "/wiki/Star_Wars_Galaxy_Magazine_6"
 ]
}