{
 "name": "Darth_Gravid",
 "display_name": "Darth Gravid",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 533 BBY",
      "Jaguada"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Order of the Sith Lords"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Darth Gean"
     ]
    }
   ]
  }
 ],
 "content": "Darth Gravid was a Human male who reigned as the Dark Lord of the Sith in the lineage of the Order of the Sith Lords. During his tenure as a Sith Lord, Gravid took a Twi'lek female as his apprentice, naming her Darth Gean. Over time, he was drawn to the light side of the Force and began to lose his sanity as a result of attempting to combine some of the philosophies of the Jedi, the Sith's enemies, with his teachings. He became convinced that he had to sabotage the Sith teachings in order to preserve the Order. Around 533 BBY, Gravid destroyed the majority of the Sith's lore before Gean slew him in his bastion on the planet Jaguada. Gravid's actions against the Sith set the organization back for centuries.\nThe Human male known as Darth Gravid ruled as the Dark Lord of the Sith around 533 BBY. Gravid was a Sith Lord in the Order of the Sith Lords, which Darth Bane initiated in 1000 BBY. He owned a collection of Sith lore and also possessed the knowledge of essence transfer, which enabled a Force-user to transfer one's consciousness into another body. Gravid eventually gained a Twi'lek female as his Sith apprentice, naming her Darth Gean. He and Gean constructed a bastion on the planet Jaguada.\nHowever, Gravid came to believe that absolute commitment to the dark side of the Force would be the Sith Order's undoing. He began to incorporate altruism and empathy, which were doctrines of the Jedi—the enemies of the Sith—into his teachings and practices. During that process, Gravid began to lose his sanity and eventually came to the conclusion that the only way the Sith Order would be preserved is that if the Sith teachings, artifacts, and holocrons amassed through the generations were either hidden or destroyed. Gravid reasoned that once that was done, he would be able to guide the Sith into what he viewed as a more successful path. At some point around 533 BBY, Gravid used the Force to raise barriers around his bastion and began to destroy all the artifacts, holocrons, and tomes that were in his possession.\nGravid was interrupted by his apprentice, Gean, who had penetrated the barriers around their stronghold so that she could stop her Master from destroying the Sith's resources of knowledge. In the ensuing duel, Gravid managed to severely injure the Twi'lek by cleaving off one of her arms and shoulders as well as the left side of her face and chest. Eventually, Gean managed to overpower Gravid, killing him despite her being unarmed. Although he was slain, the impact of Gravid's actions in destroying the majority of Sith lore would be felt by the Sith Order for generations, hindering the Grand Plan that Darth Bane had initiated to eliminate the Jedi Order and topple the Galactic Republic. Nearly five centuries after Gravid's demise, the Sith Lord Darth Plagueis recounted Gravid's actions against the Sith to his apprentice, Darth Sidious.\nDuring his reign as Dark Lord, Darth Gravid was drawn to the light side of the Force and began to believe that the Sith's absolute dedication to the dark side was a flaw. He attempted to introduce Jedi characteristics into his lifestyle and teachings. However, Gravid began to lose his sanity as a result, and he believed that it was necessary for the destruction of Sith lore so that he could mold the Order to his teachings.\nGravid was sensitive to the Force and was powerful enough to ascend to the rank of Dark Lord of the Sith. He also possessed the knowledge of essence transfer, which gave the user the ability to transfer his or her consciousness into another host. He was capable of raising barriers with the Force that were large enough to cover his bastion. During his confrontation with Darth Gean, Gravid managed to cleave off his apprentice's left arm, shoulder, face, and torso, severely crippling her before he was killed by the Twi'lek.\nDarth Gravid was introduced in the 2012 novel Darth Plagueis, written by James Luceno, who created Gravid to provide an explanation as to why the titular character, Darth Plagueis, did not have access to some of the old Sith teachings and Force techniques.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/533_BBY",
  "/wiki/Jaguada/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Darth_Gean",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Time/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Duel_in_Darth_Gravid%27s_bastion",
  "/wiki/Darth_Gravid%27s_bastion",
  "/wiki/Planet/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/1000_BBY",
  "/wiki/Force_power/Legends",
  "/wiki/Transfer_essence",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Sith_holocron/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_barrier/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Death/Legends",
  "/wiki/Grand_Plan/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/2012",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/James_Luceno",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/Darth_Cognus",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Leland_Chee",
  "/wiki/StarWars.com",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/46_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/33_BBY/Legends",
  "/wiki/Darth_Bane:_Path_of_Destruction",
  "/wiki/TheForce.net",
  "/wiki/January_25",
  "/wiki/February_28",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties"
 ]
}