{
 "name": "Darth Acina",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3629 BBY",
      "Iokath"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark green",
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Dark Council",
      "Sphere of Technology",
      "Dark Council",
      "Sphere of Technology"
     ]
    }
   ]
  }
 ],
 "content": "Darth Acina was a Human female Dark Lord of the Sith who ruled the reconstituted Sith Empire as Sith Empress. Prior to her accession, she was a member of the Dark Council and head of the Sphere of Technology.\nUnder her reign, the Sith Empire waged war against the Eternal Empire of Zakuul. Not long after Zakuul was overthrown, she met her end at the hands of an Iokath superweapon that she had hoped to claim for the Empire. She was thereafter succeeded by Darth Vowrawn.\nAcina spent her early Sith training in the Sith Academy on Korriban, where as some of her earliest trials as the Sith apprentice she was required to kill local vermin in the tombs located in the Valley of the Dark Lords. She eventually obtained the title of Dark Lord of the Sith. After the death of Darth Karrid at Duro in 3640 BBY, Acina was chosen by the Emperor's Hand to be the new head of the Sphere of Technology and to watch over a warehouse of powerful technology known as the Arcanum. During that time her position on the Dark Council was strong, as she controlled all access to Arcanum, requiring others Councillors to impress her. However, one of her apprentices had secretly sworn loyalty to the Dread Masters, which allowed their follower Tagriss to organize a Raid on the Arcanum and escape with many dangerous artifacts such as the Darkstaff and the Seeds of Rage. Her position imperiled, Acina was quick to summon help from an Imperial individual to assist in locating and recovering the seeds. Eventually succeeding in recovering the last of the Seeds on Ilum, the Imperial returned them to Acina, who planned to hide them on Ziost.\nIn 3636 BBY the Eternal Empire of Zakuul revealed itself to the larger galaxy and launched the Eternal Empire conquest on both the Empire and the Republic. Within a year, Dromund Kaas was blockaded and most of the Dark Council members either died or disappeared during the chaos. Darth Acina was the first to recognize that the Sith were outmatched and the only one of the Dark Council besides Darth Vowrawn to remain by the time Zakuul–Imperial treaty was negotiated by the Minister of Logistics. In a power vacuum, Darth Acina assumed leadership of the Empire and declared herself Empress of the Sith, declaring loyalty to Emperor Arcann of the Eternal Empire, who publicly acknowledged her claim.\nAcina continued to rule the Sith Empire for the next five years, her rule supported by the majority of the population. As Empress, she bided her time during Arcann's reign, but after his defeat at the hands of the Outlander during the Battle of Odessen, she saw the opportunity to reclaim the Sith Empire's power. Realizing that the Alliance that defeated Arcann would be strong enough to eventually defeat Arcann's notoriously unstable sister Vaylin, she openly defied her heralds, putting an end to an era of Sith submission. When Vaylin's Eternal Fleet launched an Invasion of Voss, Acina set the Imperial fleet to aid the Alliance and its Commander in battle. The timing of the Imperial fleet's arrival proved fortunate, as it was able to drive away the Eternal Fleet and put a decisive end to the battle. In the aftermath, Acina acknowledged the Alliance as an independent power and invited the Alliance Commander to Dromund Kaas to negotiate an agreement.\nWhen the Alliance Commander arrived on Dromund Kaas, Acina sent the current Minister of Logistics Gelmid Lorman to escort her guest from the spaceport. After the Alliance Commander with the advisors Lana Beniko and Theron Shan were brought to Acina's chambers, whothe Empress suggested that she and the Commander should discuss their alliance in private aboard her personal shuttle. In flight and away from prying eyes, Acina assured the Commander that her offer was genuine, and that she had no intention of taking the Eternal Throne for herself. Their conversation was interrupted by a sudden engine failure, requiring Acina to down the shuttle and abandon ship. Now stuck in the wilderness of Dromund Kaas, Empress Acina and the Commander were forced to contend with the planet's dangerous wildlife and lightning storms. The pair eventually discovered that their shuttle had been sabotaged by the GenoHaradan, whom the Empress had always assumed to be a myth. The legendary assassins proved no match for the Alliance Commander and the Empress of the Sith, however, as the pair shortly dealt with the assassins and located their camp. The Commander discovered from the camp's logs that the assassination attempt was organized by none other than Leontyne Saresh, the former Supreme Chancellor of the Republic, in a bid to take over the Alliance.\nWhen they came under heavy fire, Empress Acina and the Commander took shelter in a nearby Sith tomb. As the pair descended further into the tomb's depths, the Empress and the Outlander were confronted by a traitorous Minister Lorman, who was behind the shuttle sabotage, and a GenoHaradan strike team seeking to finish their job. After the GenoHaradan were dispatched, Acina offered the Alliance Commander to decide Lorman's fate. After the Alliance Commander returned to their headquarters on Odessen and dealt with Saresh, Acina contacted the Commander again with a formal offer on an alliance. Shortly afterwards, she pardoned the Imperial officer Malavai Quinn, who had been imprisoned by former Minister Lorman for defiance, and took him on as her advisor.\nThe Commander's Alliance proceeded to wage war against Vaylin, eventually striking her down. Unfortunately, that left the Eternal Throne empty, leading the GEMINI captains to revert to their basic programming and commanding the Eternal Fleet to bombard inhabited worlds indiscriminately. Acina issued an emergency distress call to the Alliance, who proceeded to claim the Eternal Throne and take control of the Eternal Fleet. Wary of the power the Eternal Alliance now possessed, Empress Acina began preparing her people for war even as cleanup continued on Dromund Kaas from the last Eternal Fleet bombardment.\nWhen the Empire received an anonymous intel regarding an immensely powerful superweapon on a recently rediscovered world of Iokath, Acina sent a detachment of Imperial forces to secure the weapon. While on Iokath, Imperials encountered Republic forces who were after the same objective and were soon joined by the Eternal Alliance's Eternal Fleet. Acina sent Major Quinn as an ambassador to the Alliance Commander, with the orders to sabotage the meeting and escape should the Alliance turned against Empire. The Empress herself made a holocall and formally asked the Commander to side with the Empire against the Republic forces led by Supreme Commander Jace Malcom.\nAcina was a pragmatic and progressive Sith, whose approval as the Dark Council member was hard to get. Conversations with her were described as a pleasurable guessing game. After the death of Darth Marr she sought to unify the remnants of the Sith Empire and during attack on the Sith space by the Eternal Empire avoided the other Dark Councilors' attempts to fight the new enemy, a decision which eventually left her the only one standing. Unopposed and having avoided personal involvement with the Sith's capitulation to Zakuul, Acina easily claimed the throne for herself, with an unexpected amount of popular support. Although it was easy to brand her a cowardly opportunist, many acknowledged that Acina's more measured and calculated approach enabled her to rise higher than anyone predicted, and some began to call her the \"wisest of the Sith\".\nAcina tended to stay up late and wake up early, taking few visitors even during her time as the Empress. She diligently practiced lightsaber techniques and drank only purified water from Dromund Kaas. Unexpectedly for the Head of the Sphere of Technology, Acina dabbled into horticulture as a hobby. During her interactions with the Outlander, Empress Acina displayed a willingness to work with them against Zakuul, and proved to be a reliable ally both during their personal interactions and their later struggles against the Eternal Throne. She was, nonetheless, as ruthless as any Sith, and was eager to execute Minister Gelmid Lorman for his betrayal during the revolt against the Eternal Empire.\nShe was eventually killed on Iokath and was succeeded by Vowrawn as Emperor of the Sith Empire.\nAs befitting the head of the Sphere of Technology, Acina possessed technical skills that other Sith Lords rarely concerned themselves with. Despite this, Darth Acina seemed to eschew the cybernetic enhancements that many of her peers and underlings relied upon, although she may simply have not suffered any injuries that would have made them necessary. She was a capable pilot, and even used associated jargon when presented with an emergency.\nAs a member of the Dark Council, Darth Acina was strong in the Force, competent in combat, although during her initial tenure in the Council, she was a relatively minor player and seemed to demure to Darth Marr's leadership alliance. She relied on a purple double-bladed lightsaber in combat, though as Empress she lamented that she got few opportunities to personally use it.\nDarth Acina was first introduced in Star Wars: The Old Republic: Rise of the Hutt Cartel, the first Digital Expansion for the BioWare video game Star Wars: The Old Republic, where her Codex entry stated that she was the successor to Darth Hadra, who had been killed on Corellia. However, this contradicted the 2012 novel The Old Republic: Annihilation, which stated that Darth Karrid was chosen as Hadra's successor. This was determined to be an error, and the Codex entry was rectified in Update 2.1.1 to correctly state that Acina succeeded Karrid. Acina was voiced by Rosalind Ayres.\nHer ascension to the throne is first mentioned in dialog by Lana Beniko when she updates the Outlander on the events of the last few years in Star Wars: The Old Republic: Knights of the Fallen Empire. In Chapter XV: The GEMINI Deception, if the Outlander rescues Zasha Ranken, the latter informs Empress Acina, who conveys her gratitude in an e-mail, even though she cannot openly support the Alliance. Darth Acina's initial character model was a generic human female, but she received an updated model with a unique face and armor as Empress in Knights of the Eternal Throne.\nWhen speaking to Acina after the events on Voss, if the player had done her mission with the Seeds of Rage in the past, she will greet the Commander as an old acquaintance rather than a first-time meeting. She will likewise acknowledge Darth Nox as a former fellow Dark Council member if the player is a Sith Inquisitor.\nDuring the events on Iokath, the player has to choose between siding with the Republic or the Empire, neither of which is a light side or dark side option. The fates of both Acina and Malcom are affected greatly by this decision, with them mirroring each other's role as either an ally to the Eternal Alliance or a person who seeks to activate the superweapon.\nIf the player sides with the Empire, the Republic launches a counter-offensive against the Imperial base on Iokath. Acina meets with the Commander after the initial attack was repelled and the two agree to reclaim weapons from an Iokath weapons cache to gain an advantage over the Republic. As Supreme Commander Malcom threatens to activate a superweapon capable of wiping out all life on Iokath, Acina provides the Commander with a walker called Crimson Talon to storm the Republic base and stop Malcom. Though the Commander and Theron Shan arrive in time and try to talk him out of it, Malcom still activates the superweapon, awakening the Six Gods, which costs him his life. Though leaderless, Republic forces keep resisting and Acina assures the Commander that their future partnership will remain strong.\nIf the player sides with the Republic, it is Acina who launches an attack against both the Republic and the Alliance and later discovers a backdoor into the superweapon, seeking to activate it without realizing its danger. In this version of the events, Acina taunts the Commander about the superweapon and assumes an Iokath throne, which rejects her input and kills her. Lying wounded, Acina apologizes to the Commander for her mistake, claiming that nothing can stop the awakened Six Gods, before she dies. Since both Imperial and Republic players can side against their original faction on Iokath, neither version of events has any precedence over the other in-game. A newscast overheard during the \"Traitor Among the Chiss\" flashpoint reveals that she was succeeded by Emperor Vowrawn if killed on Iokath.\nIn the Imperial storyline, if Acina survived the events on Iokath, she will be debriefed on the whereabouts of Darth Malgus by Darth Rivix in the aftermath of the Commander's mission to the Dantooine Jedi Enclave.\nPlayer characters of any gender and faction can attempt to have romantic interactions with Acina throughout various storylines in Star Wars: The Old Republic. During the opening and closing conversations in the \"Seeds of Rage\" storyline, Imperial-aligned players can compliment Acina on her appearance. She appears flattered, but both times shifts the topic back to the mission at hand.\nDuring Chapter II: Run for the Shadows of Knights of the Eternal Throne, the players of any gender and faction may attempt to flirt with Acina while in the Imperial Citadel and when stranded alone with Acina in the jungles of Dromund Kaas. Acina is flattered and interested in the prospect of a romance, but turns down the offer out of propriety.\nFinal attempts at starting a romantic relationship with Acina can be made during the Iokath storyline available to Imperial players only. Acina turns down the offer once again, claiming that the current battle is more important. She does, however, hint that after the battle is resolved, perhaps she would take up the player on the offer.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Forum:CT:The_Old_Republic:_Commander%27s_storyline_affiliation",
  "/wiki/Alliance_Commander",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Darth_Acina",
  "/wiki/3629_BBY",
  "/wiki/Iokath",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Sphere_of_Technology",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Sith_Emperor/Legends",
  "/wiki/War_against_Zakuul",
  "/wiki/Eternal_Empire",
  "/wiki/Zakuul",
  "/wiki/Battle_of_Zakuul",
  "/wiki/Superweapon/Legends",
  "/wiki/War_on_Iokath",
  "/wiki/Darth_Vowrawn",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Korriban",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Valley_of_the_Dark_Lords/Legends",
  "/wiki/Darth_Karrid",
  "/wiki/Duro/Legends",
  "/wiki/3640_BBY",
  "/wiki/Hand_of_the_Empire",
  "/wiki/Arcanum",
  "/wiki/Dread_Masters",
  "/wiki/Tagriss",
  "/wiki/Raid_on_the_Arcanum",
  "/wiki/Darkstaff",
  "/wiki/Seeds_of_Rage",
  "/wiki/Ilum/Legends",
  "/wiki/Ziost/Legends",
  "/wiki/3636_BBY",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Dromund_Kaas",
  "/wiki/Zakuul%E2%80%93Imperial_treaty",
  "/wiki/Minister_of_Logistics",
  "/wiki/Emperor/Legends",
  "/wiki/Arcann",
  "/wiki/Lana_Beniko",
  "/wiki/Battle_of_Odessen",
  "/wiki/Eternal_Alliance",
  "/wiki/Vaylin",
  "/wiki/Eternal_Fleet",
  "/wiki/Invasion_of_Voss",
  "/wiki/Gelmid_Lorman",
  "/wiki/Theron_Shan",
  "/wiki/Eternal_Throne",
  "/wiki/GenoHaradan",
  "/wiki/Leontyne_Saresh",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Odessen",
  "/wiki/Malavai_Quinn",
  "/wiki/GEMINI",
  "/wiki/Supreme_Commander_(Republic)",
  "/wiki/Jace_Malcom",
  "/wiki/Darth_Marr",
  "/wiki/Water/Legends",
  "/wiki/Horticulturist",
  "/wiki/Shuttle/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Darth_Hadra",
  "/wiki/Corellia/Legends",
  "/wiki/2012",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Zasha_Ranken",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Darth_Nox",
  "/wiki/Sith_Inquisitor",
  "/wiki/Crimson_Talon_(walker)",
  "/wiki/Six_Gods",
  "/wiki/Darth_Malgus",
  "/wiki/Darth_Rivix",
  "/wiki/Dantooine/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Imperial_Citadel_(Sith_Empire)",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith",
  "/wiki/Tenebrae",
  "/wiki/4999_BBY",
  "/wiki/2017",
  "/wiki/3628_BBY",
  "/wiki/Galactic_Standard_Calendar"
 ]
}