{
 "name": "Darth_Millennial",
 "display_name": "Darth Millennial",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mutant Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black and silver beard"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue",
      "yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Order of the Sith Lords",
      "Dark Force"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Cognus"
     ]
    }
   ]
  }
 ],
 "content": "Darth Millennial was a three-eyed mutant Sith Lord and Shadow Hand, heir to the lineage of Darth Bane, who lived almost a thousand years before the Battle of Yavin. Apprenticed to Darth Cognus, Millennial was powerful in the Force and had the ability to see the future. However, he and his Master disagreed on many aspects about the Sith, and Millennial became disillusioned with the Rule of Two, which he felt was far too restrictive, and saw far more sense in Lord Kaan's Rule by the Strong.\nEventually, he left his enraged Master and founded the Dark Force religion, which would later become the Prophets of the Dark Side on the planet Dromund Kaas. Proclaiming himself as a prophet chosen by the will of the Force, he attracted many Force-users from across the galaxy to his religion before passing away.\nMillennial was a three-eyed mutant of Human descent who lived almost one thousand years before the Battle of Yavin. He was at some point in his life seduced by the dark side of the Force, whereupon he joined the Order of the Sith Lords. He was apprenticed to a female Iktotchi Dark Lord of the Sith, Darth Cognus, who was a firm believer in Darth Bane's Rule of Two, which stated that there should always be two Sith: a Master and an apprentice. Millennial proved to be a talented user of the Force; he had powerful precognitive abilities and was trained as a Shadow Hand of Darth Cognus.\nBut while Millennial was a talented Force-user, he and Cognus disagreed on many aspects of the Sith, most notably the Rule of Two. Millennial was forever questioning what he had been taught, and he vehemently disagreed with the philosophy of the Rule of Two, which the mutant found to be far too restrictive. Instead, he believed in the more martial philosophy put forward by former Dark Lord and the founder of the Brotherhood of Darkness Lord Kaan: the Rule by the Strong, which stated that there should be many Sith, with the leader being whomever was the strongest at any one time. Millennial's Master, though, rejected the concept, and the two clashed many times during his apprenticeship. Eventually, tensions reached a boiling point, and Millennial abandoned his Master and fled to the remote planet of Dromund Kaas, where he sought refuge from his Master's wrath. Cognus trained a new apprentice and continued the lineage of the Rule of Two, while Millennial went about founding his own dark side religion on Dromund Kaas.\nMillennial settled on the swamp world and spent much time contemplating and focusing on Kaan's ideas. Melding them with teachings of two Pre-Republic era philosophers named Plaristes and Dak Ramis, Millennial started his own unique religion, named the Dark Force, and built a temple in the swamps of Dromund Kaas. He proclaimed himself a prophet chosen by the will of the Force and invited Force-users from across the galaxy to join him on Dromund Kaas and initiate themselves into the Dark Force. Many Force-sensitives from all sorts of backgrounds, as well as hordes of naïve Sith cultists, joined him, though they attempted to keep the religion secret. Anyone who did not believe in the Dark Force was slandered and labeled as a heretic, and Millennial and his religion encouraged the killing of such non-believers. Millennial became the Supreme Prophet of the Dark Side, and his organization made multitudes of prophecies during his lifetime.\nEventually, Millennial passed away, but his religion lived on. Practitioners of the Dark Force came to be known as Prophets of the Dark Side, and the order survived on Dromund Kaas in seclusion for centuries, away from the prying eyes of the Jedi Order and the Galactic Republic. Eventually, the Prophets came to the attention of a Sith Lord named Darth Sidious, who recruited them as advisers in his capacity as Supreme Chancellor and Galactic Emperor. After the Prophets were attacked by Sidious's Inquisitors, they fled to Bosthirda. Millennial's order was eventually wiped out by a trio of darksiders: Azrakel, a former student of the Prophets; Lumiya, the Dark Lady of the Sith; and her apprentice, Carnor Jax. By the end of the Yuuzhan Vong War, they had yet to be reformed, at least not openly. A false group of prophets sprung up after the Battle of Endor, using the ancient prophecy that another three-eyed mutant would rise among the prophets to promote a slave lord named Trioculus as the new Emperor. These false prophets were themselves killed off, however.\nMillennial's existence was known to the New Jedi Order, and, after the Yuuzhan Vong invasion, Jedi Master Tionne Solusar published a series of texts, several of which mentioned Millennial. The New Jedi Order, however, knew little information other than that he founded the Dark Force.\nMillennial was not one to blindly follow his superiors and questioned everything he was taught, formulating his own opinions. He saw strength in numbers and felt that the Sith would thrive under the Rule by the Strong. He felt that a leader should be the strongest of the group and that if another became stronger than the leader, he or she had the right to claim command for himself or herself. Millennial himself was a strong leader, as he persuaded many followers of the dark side to leave their respective orders and join him on Dromund Kaas.\nMillennial had great belief in himself and his abilities, particularly those that allowed him to see the future, and he thought that he was special enough to be chosen as the prophet of the will of the Force. But while Millennial was supremely confident in himself, he knew when to run and hide. After his and his Master's confrontations over how the Sith should be ruled escalated, he knew he was no match for her and went into hiding. Millennial was pale-skinned, with a black-and-silver-colored beard. He had two blue eyes and an yellow-colored third eye that was positioned in the center of his forehead.\nMillennial had powerful precognitive abilities and was trained as a Shadow Hand of Darth Cognus. Later, Millennial created his own organization of Force wielders that also had strong precognitive abilities.\nDarth Millennial was created by Abel G. Peña prior to 2001, as part of Evil Never Dies: The Sith Dynasties, an article discussing the various lesser-known Sith organizations. The article describes Millennial as a \"three-eyed mutant,\" retconning him to be the Dark Lord mentioned in the children's novel The Glove of Darth Vader. Peña considered the character to likely be Human, though this wasn't established firmly in canon. However, Evil Never Dies would not be published for a number of years; in the interim, Peña mentioned Millennial briefly in The Dark Forces Saga, released on the Wizards of the Coast web site in June 2005, marking the character's first appearance in canon. Evil Never Dies was subsequently released on StarWars.com Hyperspace one year later, expanding Millennial's backstory as established in The Dark Forces Saga.\nWith Peña's previous Darth creation, Darth Ruin, he had followed George Lucas's pattern of short Sith names, such as Darth Bane and Darth Maul; however, with Millennial, he decided to be adventurous and go with a longer name, in the same vein as Lucas' Darth Sidious and Darth Plagueis. Millennial was a religious figure, so Peña wanted to integrate the concept of infinity with his name; he chose to base it off the word \"millennium,\" meaning a thousand years, as one thousand is the Arabic symbol used to represent infinity, similar to how Western Culture uses the ∞ symbol, and Chinese culture the 萬物. The figure one thousand also crops up in a number of prominent Star Wars works, such as A New Hope, The Phantom Menace, and Tom Veitch's Star Wars: Dark Empire, which contributed toward Peña's choice. Additionally, as Millennial existed around the same time the Sith became extinct, Peña sees his name as a prophecy in itself, as the Sith remained extinct for a thousand years.\nMillennial was subsequently referenced in Ryder Windham's Jedi vs. Sith: The Essential Guide to the Force, as well as Matthew Grau's Behind the Threat: The Sith, Part 1: Portrayal, and The Complete Star Wars Encyclopedia, by Daniel Wallace, Pablo Hidalgo, Stephen J. Sansweet, and Bob Vitas. In The Complete Star Wars Encyclopedia, Millennial's name is misspelled as \"Darth Millenial.\" He also received his first official depiction in that work, which showed him to be Human, canonizing Peña's previous comments that he was likely a member of that species.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Mutant",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Dark_Force",
  "/wiki/Darth_Cognus",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Shadow_Hand",
  "/wiki/Darth_Bane/Legends",
  "/wiki/1000_BBY",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Rule_of_Two/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Skere_Kaan",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/Prophets_of_the_Dark_Side",
  "/wiki/Planet/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Iktotchi/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Pre-Republic_era",
  "/wiki/Plaristes",
  "/wiki/Dak_Ramis",
  "/wiki/Dark_Force_Temple",
  "/wiki/Supreme_Prophet",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Bosthirda/Legends",
  "/wiki/Darksider",
  "/wiki/Azrakel",
  "/wiki/Lumiya",
  "/wiki/Carnor_Jax",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Church_of_the_Dark_Side",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Trioculus",
  "/wiki/New_Jedi_Order",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Tionne_Solusar",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/2001",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/Retcon",
  "/wiki/The_Glove_of_Darth_Vader",
  "/wiki/Canon",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Wizards.com",
  "/wiki/June",
  "/wiki/2005",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/2006",
  "/wiki/Darth_Ruin",
  "/wiki/George_Lucas",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Tom_Veitch",
  "/wiki/Star_Wars:_Dark_Empire",
  "/wiki/Ryder_Windham",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Matthew_Grau",
  "/wiki/Behind_the_Threat:_The_Sith,_Part_1:_Portrayal",
  "/wiki/Daniel_Wallace",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Stephen_J._Sansweet",
  "/wiki/Bob_Vitas",
  "/wiki/Species/Legends",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/Book_of_Sith:_Secrets_from_the_Dark_Side",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/100_BBY/Legends",
  "/wiki/Kadann",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who:_Imperial_Grand_Admirals",
  "/wiki/Star_Wars_Insider_66",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Darth_Bane:_Dynasty_of_Evil"
 ]
}