{
 "name": "Darth Rivix",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Hand of the Empire",
      "Hand of the Empire"
     ]
    }
   ]
  }
 ],
 "content": "Darth Rivix was a male humanoid Sith Lord of the reconstituted Sith Empire in the renewed conflict with the Galactic Republic. He first gained recognition during his dedicated service in the Imperial Diplomatic Service. In 3626 BBY, following the battle of Corellia, Emperor Darth Vowrawn appointed him as the liaison of the Hand of the Empire, a position coveted by many powerful Sith.\nLittle is known for certain about Darth Rivix's origins, or any part of his personal history before he joined the Imperial Diplomatic Service, and all inquiries into the matter seem to be met with dead ends. Even those who have directly asked Rivix to confirm details about his past have come away with more questions than answers. The perception of his interests and opinions seem to shift depending on who is speaking about him.\nThose who worked with Rivix in the Diplomatic Service remember him as dedicated, charming, and as someone whose performance consistently stood out. Naturally, it came as no surprise to anyone when he was selected to lead the newly-formed Hand of the Empire.\nAlthough other powerful Sith had competed for the position, naming Rivix as the Hand's liaison to the Alliance pleased many among the Empire's ranks, as Rivix's organizational and networking skills are considered second-to-none--despite his notorious secrecy.\nDarth Rivix was a humanoid male who had medium-length black hair, red skin and orange eyes. He wore black and red robes with shoulder armor and armored gloves.\nDarth Rivix possessed a very charming personality and was able to easily sway many of those he spoke to into liking him, even if they were not sure why. His opinions and interests appeared to change depending on who talked to him. After meeting him Vector Hyllus suspected that there was something different and unnatural about his ability to charm others. Darth Rivix was also an especially secretive individual, with nothing being known about his past prior to joining the Imperial Diplomatic Service. Those who questioned his background often ended up with more questions than answers. Additionally, Rivix was known to have exceptional organizational and networking skills.\nIn the Imperial storyline, Darth Rivix arrived on Odessen with a small task force and made first contact with the Commander via hologram and told them that he wished to speak with them in person. Rivix's shuttle landed in the hangar where the Commander received him. Rivix informed the Commander that he was there to assist the Commander in their missions and he would report their achievements back to Emperor Darth Vowrawn while the Emperor's orders would be given to the Commander. He requested a tour of the base before the pair discussed their business in the operations room.\nAfter settling in, Rivix accompanied the Commander and Darth Krovos when they traveled to the Dantooine Jedi Enclave to investigate the whereabouts of Darth Malgus. Darth Rivix reported their findings to the Sith Emperor after returning from their mission.\nThe player has the option to flirt with him regardless of their gender. Depending on if the player is an Imperial loyalist or saboteur and rejoined the Empire or kept the Alliance independent after the battle on Corellia, then Rivix will have varying conversations between the individual characters:",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Hand_of_the_Empire",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Third_Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Imperial_Diplomatic_Service",
  "/wiki/3626_BBY",
  "/wiki/Meridian_Complex_assault",
  "/wiki/Corellia/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Darth_Vowrawn",
  "/wiki/Hair/Legends",
  "/wiki/Eye",
  "/wiki/Robe/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Vector_Hyllus",
  "/wiki/Odessen",
  "/wiki/Alliance_Commander",
  "/wiki/Hologram/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Darth_Krovos",
  "/wiki/Dantooine/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Darth_Marr",
  "/wiki/Darth_Acina",
  "/wiki/Dark_Council",
  "/wiki/Imperial_Reclamation_Service",
  "/wiki/Moff/Legends",
  "/wiki/Valion_Pyron",
  "/wiki/Silencer_(superweapon)",
  "/wiki/Darth_Xarion",
  "/wiki/Category:Images_of_Darth_Rivix",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}