{
 "name": "Darth_Decimus",
 "display_name": "Darth Decimus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Facial implants"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireDark CouncilSphere of Military Strategy",
      "Dark Council",
      "Sphere of Military Strategy"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Darth Charnus",
      "Darth Krovos"
     ]
    }
   ]
  }
 ],
 "content": "Darth Decimus was a Human male who served as Dark Lord of the Sith of the reconstituted Sith Empire during the Cold War and the Galactic War. He served as the head of the Sphere of Military Strategy.\nDecimus ascended to the Dark Council in the last months of the Great Galactic War when a Jedi Strike Team killed the Dark Councilor Darth Azamin in his secret stronghold and after, all Jedi of the team died on the ship they used to escape, which exploded due to a mechanical malfunction, probably sabotage. There were rumors that Decimus sold information to the Jedi in order to kill his rival, but these suspicions were never proven.\nAs a member of the Dark Council, Decimus took Krovos as an apprentice after she caught his attention during her final trials on Korriban. In the trials, she convinced her fellow Sith Acolytes to work together rather than alone, resulting in all her fellow students surviving the ordeal.\nDecimus was chosen to lead the Imperial invasion of Corellia and conceived a plan that permitted the Empire to take control of the world with no significant resistance. He established a base in the former offices of the planet's Trade Tariff Service, both due to it being rendered obsolete and it being an unlikely military target, converting it into an Imperial Fortress and naming it Decimus's Rise.The Imperial army under his command annihilated most of the Green Jedi. With the Imperial occupation complete, he awarded those involved the Medal of Imperial Glory. Later, the Republic attacked and recaptured Corellia and in the fighting Decimus was killed in the Speaker's Garden of the Corellian Legislature Building.\nDecimus was known for his brilliant military strategies and ability to exploit any situation for his own uses. Despite his wanton ambition, Decimus was fiercely loyal to the Sith Emperor.\nDarth Decimus used a single-bladed Sith lightsaber, and his combat abilities as a Sith Warrior were considered notable, alongside premier Sith such as Darth Malgus and even, Darth Marr.\nDecimus's dialogue during the Imperial Corellian Story Arc, particularly his introductory dialogue, changes depending on the player's class, usually offering to support the player against the final antagonist of their class storyline.\nDecimus is voiced by Welsh actor Mark Lewis Jones, who also portrayed Captain Moden Canady in Star Wars: Episode VIII The Last Jedi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Darth_Decimus",
  "/wiki/3640_BBY",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Sphere_of_Military_Strategy",
  "/wiki/Darth_Charnus",
  "/wiki/Darth_Krovos",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Great_Galactic_War",
  "/wiki/Darth_Azamin",
  "/wiki/Korriban",
  "/wiki/Sith_Acolyte",
  "/wiki/Imperial_Central_Command_(Corellia)",
  "/wiki/Corellian_Jedi",
  "/wiki/Medal_of_Imperial_Glory",
  "/wiki/Battle_of_Corellia",
  "/wiki/Legislature_Building",
  "/wiki/Coronet_Durasteel",
  "/wiki/Tenebrae",
  "/wiki/Sith_lightsaber/Legends",
  "/wiki/Darth_Malgus",
  "/wiki/Darth_Marr",
  "/wiki/Mark_Lewis_Jones",
  "/wiki/Captain",
  "/wiki/Moden_Canady",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/3653_BBY",
  "/wiki/Battle_of_Ilum",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends"
 ]
}