{
 "name": "Darth Mekhis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Well before 3681 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Vesla system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark gray"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Facial implants"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireDark CouncilSphere of Technology",
      "Dark Council",
      "Sphere of Technology"
     ]
    }
   ]
  }
 ],
 "content": "Darth Mekhis was a Human female Dark Lord of the Sith of the resurgent Sith Empire who served as the head of the Sphere of Technology during the entire Great Galactic War and most of the Cold War with the Galactic Republic. Greatly warped by the dark side of the Force, Mekhis was a brilliant scientist, creating weapons for the Sith Empire. She was defeated by the Jedi Satele Shan at the Battle of Rhen Var near the end of the Great War, but survived and continued to construct superweapons throughout the Cold War that followed. She was ultimately killed in 3643 BBY, when the SIS agent Theron Shan sabotaged her Sun Razer project in the Vesla system and paralyzed Mekhis, leaving her to die when the Sun Razer exploded.\nDarth Mekhis, a scientist and Dark Lord of the Sith who served on the Dark Council in the resurgent Sith Empire, led the Sith forces in the Battle of Rhen Var, establishing a fortress as a command center until Satele Shan and her Republic forces arrived. Breaking open the door to Mekhis's chamber with the Force, Shan asked the Sith Lord to surrender and offered protection in exchange. However, Mekhis refused, and the two began a fierce duel that resulted in Mekhis being grievously injured before she escaped.\nDuring the Cold War, Darth Mekhis served as a weapon designer working on projects to give the Sith the advantage when hostilities resumed, most of them produced at the Sun Razer facility she created to provide the resources to construct them. Mekhis designed a new and experimental class of warship called the Javelin Dreadnought, capable of using its weapons to flash irradiate a planet's surface from space, wiping out all life below within a three kilometer radius. She christened the prototype Ror'jhan, which meant \"she-whose-leaves-sweat-poison\" in the Sith language.\nDarth Mekhis also had in her employ a legion of Sith Knights, semi-mechanical thralls created from captured Jedi and corrupted by her power. She was later seen aboard her Sun Razer in the Vesla system completing the last modification when the captain Eisek informed her of the capture of Theron Shan and Master Ngani Zho and she immediately ordered the execution of the Jedi Master. Things took an unexpected turn when the two of them escaped. Ngani eventually died, protecting the female Twi'lek Teff'ith from blaster shots. In the same time, Theron made his way to Mekhis, and after revealing his relation to Satele Shan to throw her off guard, defeated her using a toxicity-ten poison, leaving her on the Sun Razer as it exploded. Her rival, Darth Hadra, took her place on the Dark Council.\nDarth Mekhis could utilize Force lightning and telekinesis.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mechis_(disambiguation)",
  "/wiki/3681_BBY",
  "/wiki/3643_BBY",
  "/wiki/Vesla_system",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Sphere_of_Technology",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Battle_of_Rhen_Var",
  "/wiki/Superweapon/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Theron_Shan",
  "/wiki/Sun_Razer",
  "/wiki/Darth_Mekhis%27_fortress",
  "/wiki/Javelin_Dreadnought",
  "/wiki/Planet/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Kilometer/Legends",
  "/wiki/Sith_(language)",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Mekhis%27_Sith_Knights",
  "/wiki/Captain/Legends",
  "/wiki/Eisek",
  "/wiki/Ngani_Zho",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Teff%27ith",
  "/wiki/Darth_Hadra",
  "/wiki/Force_lightning/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_1",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_3",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_4",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_5",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/The_Old_Republic:_Annihilation_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/3640_BBY",
  "/wiki/Fury-class_Imperial_interceptor",
  "/wiki/Standard_year/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Sith_training"
 ]
}