{
 "name": "Darth_Caldoth",
 "display_name": "Darth Caldoth",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Caldoth's Master"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Ry Nymbis"
     ]
    }
   ]
  }
 ],
 "content": "Darth Caldoth was a Force-sensitive Duros male Sith Lord. At one point, Darth Caldoth wrote a book titled The Bestiary of Darth Caldoth, which mentioned various Sith warbeasts such as the veergundark.\nDarth Caldoth eventually gained a Sith apprentice, the Twi'lek Ry Nymbis. Caldoth killed his own apprentice with a Sith ritual that turned the young Twi'lek's body into stone.\nThere was a legend about Caldoth coming into conflict with the Nightsisters of Dathomir after stealing a pod of a buried Nightsister. The coven member Zeldin was chosen to practice magick in order to seek revenge against Darth Caldoth. Zeldin reached out telepathically to influence the Sith Lord, however, Darth Caldoth was aware of her presence, and trapped Zeldin in a cage in his own mind.\nDarth Caldoth eventually gained a Sith apprentice named Ry Nymbis, and they were considered the two most powerful individuals in the galaxy at one point. Caldoth killed his own apprentice with a Sith ritual that turned the person's body into stone when he felt Nymbis was going to betray him. With the ritual, Nymbis was trapped in an eternal nightmare.\nThere was a legend about Caldoth's search for Force powers leading him into conflict with the Nightsisters of Dathomir, after stealing a pod of a buried Nightsister. The adept coven member Zeldin was chosen to practice magicks in order to seek revenge against Darth Caldoth, reaching out telepathically to influence the Sith Lord, including the encounter with his apprentice Nymbis. Later, when on her final attempt, Zeldin realized that Darth Caldoth was aware of her mental presence, and trapped the Nightsister in a cage in his own mind, occasionally remembering her presence.\nAccording to legend, Darth Caldoth was a rival to Jedi Master Bran Ath'Morath. Darth Caldoth would lure the Jedi into a battle on the planet Kizan by destroying the key city of Pundith. While the battle remained equally matched, Caldoth purposefully allowed Ath'Morath's lightsaber to pierce himself through the shoulder, beheading the Jedi while he was still shocked at what Caldoth had done.\nDarth Caldoth was first mentioned in the 2019 canon audiobook Dooku: Jedi Lost, written by Cavan Scott. The official spelling of his name was revealed in \"Gaze of Stone,\" a story from Myths \u0026 Fables, a middle-grade novel by George Mann that was released on August 6, 2019.\nCaldoth's mention in Dooku: Jedi Lost was added by Scott after Mann told him about the character he had created for Myths \u0026 Fables, leading Scott to include a reference to Caldoth in his audiobook prior to his first appearance in Mann's novel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Duros",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sith",
  "/wiki/Darth_Caldoth%27s_Master",
  "/wiki/Ry_Nymbis",
  "/wiki/Force-sensitive",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/The_Bestiary_of_Darth_Caldoth",
  "/wiki/Sith_warbeast",
  "/wiki/Veergundark",
  "/wiki/Sith_apprentice",
  "/wiki/Twi%27lek",
  "/wiki/Death",
  "/wiki/Sith_stone_ritual",
  "/wiki/Stone",
  "/wiki/Nightsisters",
  "/wiki/Dathomir",
  "/wiki/Zeldin",
  "/wiki/Magick",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Darth_Caldoth",
  "/wiki/The_galaxy",
  "/wiki/Treason",
  "/wiki/The_Force",
  "/wiki/Dathomir_Magic",
  "/wiki/Jedi_Master",
  "/wiki/Bran_Ath%27Morath",
  "/wiki/Jedi",
  "/wiki/Kizan",
  "/wiki/Pundith",
  "/wiki/Lightsaber",
  "/wiki/2019",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Cavan_Scott",
  "/wiki/Gaze_of_Stone",
  "/wiki/Myths_%26_Fables",
  "/wiki/George_Mann",
  "/wiki/August_6",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Myths_%26_Fables_(audiobook)",
  "/wiki/The_Gilded_Cage",
  "/wiki/Dark_Legends",
  "/wiki/StarWars.com"
 ]
}