{
 "name": "Darth Acharon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Extensive facial implants"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Dark Council",
      "Sphere of Biotic Science",
      "Dark Council",
      "Sphere of Biotic Science"
     ]
    }
   ]
  }
 ],
 "content": "Darth Acharon was a male Human Sith Lord of the reconstituted Sith Empire who served as one of the twelve Dark Lords of the Sith on the Empire's ruling Dark Council during the Cold War with the Galactic Republic. Trained as a Sith Warrior, Acharon controlled the Sphere of Biotic Science within the Empire and was universally despised by the Imperial Military for his zero-tolerance policy on incompetence. During the Galactic War with the Republic, Acharon was sent to the Core World of Corellia to oversee the Battle of Corellia, and he was killed by a Republic strike team while defending the Ion Wall weapon in the Government District.\nA Human male trained as a Sith Warrior, the Sith Lord Darth Acharon had ascended to the resurgent Sith Empire's ruling Dark Council by the end of the Cold War with the Galactic Republic. As a Dark Councilor, Acharon headed the Sphere of Biotic Science, one of the twelve Spheres of Influence within the Empire, and in that position he oversaw the branches of the Empire that dealt in medical science, cybernetic augmentation and physical enhancement—often in conjunction with Sith alchemy and magic. During his career as a Dark Councilor, Acharon quickly became known for his views on incompetence among the Imperial Military. The Sith's zero-tolerance policy regarding failure led him to personally execute over two hundred soldiers throughout his tenure, regardless of whether the soldiers had failed critical missions or simply worn their uniforms incorrectly. Those officers and troopers who volunteered to serve under him received even more detrimental treatment at Acharon's hands, as the Dark Councilor despised sycophants as well.\nIn 3640 BBY, Acharon and fellow Dark Councilor Darth Hadra traveled to the contested planet of Corellia to reinforce Darth Decimus, head of the Sphere of Military Strategy, in the war effort there. During the Battle of Corellia, Darth Acharon attended an eventful meeting of the Dark Council on Korriban via hologram. The meeting was originally called by Darth Baras, who attempted to declare himself the Voice of the Emperor to the rest of the Council, a position that would have granted Baras control over the entire Empire—but the Dark Councilor was killed by his former apprentice, the newly appointed Emperor's Wrath. Along with the rest of the Council, Acharon acknowledged the Wrath's autonomy and the fact that the Sith Warrior served a power greater than the Council's one. After the Wrath departed, Acharon's fellow Dark Councilor Darth Thanaton revealed another matter before the council: he appealed to the other Councilors to destroy his rival and subordinate Lord Kallig, though the two dueled when the Council refused to fight Thanaton's battles. Acharon watched from Corellia as Kallig defeated Thanaton, and the Dark Councilors present on Korriban rewarded the young Sith with Thanaton's seat on the Dark Council.\nIn the later stages of the battle, Acharon remained in the Government District of Coronet City to guard the Ion Wall, a powerful weapon that could disable all electronics across a wide area. Cole Cantarus, an officer in the Corellian Security Force, briefly encountered Acharon during his time gathering information on the Imperial occupation forces. Cantarus' info, combined with the help of Councilor Belos—a member of Corellia's ruling Council—allowed the Republic to learn the location of the Ion Wall's transmitters and direct them at the Legislature Building instead of Republic forces. A Republic strike team then stormed the Intra-Corellian Intelligence building to reach the Ion Wall's controls, cutting through the Imperial soldiers that Acharon had stationed in the building. As the strike team reached the weapon's control room, Acharon decided to execute the officer in charge of defending the building because of his failure and choked the commander to death with the Force before tossing the man's body across the room as a display of his power. The Sith Lord then questioned the invaders as to the identity of their spy, but when the strike team refused to answer Acharon drew his red-bladed lightsaber and attacked. However, the Dark Councilor was ultimately no match for the combined strength of the strike team, and the Dark Councilor was struck down in battle with the Republic fighters.\nA Human male with orange eyes and extensive cybernetic enhancements, Darth Acharon's pale skin was turned ashen gray on most of his face by the corrupting effects of the dark side of the Force. The Sith Lord was famous for his extremely cruel views on failure and sycophants, and he had no qualms about killing soldiers who failed him in any way. Acharon also despised subordinates who attempted to gain favor with him, treating them with the same disgust that he did incompetents.\nDarth Acharon trained as a Sith Warrior and became proficient in both lightsaber combat and the use of the Force, skills that eventually led to his appointment to the Dark Council. He utilized both a single red-bladed lightsaber and offensive Force powers in battle, and his body was heavily augmented with cybernetic implants.\nDarth Acharon first appeared in \"Government Clearance\", the final mission in the Republic storyline on Corellia in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare and LucasArts. Players confront him in an attempt to take control of the Ion Wall weapon, and he is killed in battle. The 2012 reference guide Star Wars: The Old Republic Encyclopedia identified Acharon as the head of the Sphere of Biotic Science.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3640_BBY",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Sphere_of_Biotic_Science",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Warrior",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Battle_of_Corellia",
  "/wiki/Death/Legends",
  "/wiki/Ion_Wall",
  "/wiki/Governmental_Sector",
  "/wiki/Spheres_of_Influence",
  "/wiki/Cybernetics/Legends",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Sith_magic",
  "/wiki/Sith/Legends",
  "/wiki/Darth_Hadra",
  "/wiki/Planet/Legends",
  "/wiki/Darth_Decimus",
  "/wiki/Sphere_of_Military_Strategy",
  "/wiki/Korriban",
  "/wiki/Hologram/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Emperor%27s_Voice_(Sith_Empire)",
  "/wiki/Duel_in_the_Dark_Council_Chambers_(Galactic_War)",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Tenebrae",
  "/wiki/Darth_Thanaton",
  "/wiki/Darth_Nox",
  "/wiki/Duel_in_the_Dark_Council_Chambers_(Kaggath)",
  "/wiki/Coronet_City/Legends",
  "/wiki/Cole_Cantarus",
  "/wiki/Corellian_Security_Force",
  "/wiki/Belos",
  "/wiki/Corellian_Council",
  "/wiki/Legislature_Building",
  "/wiki/Intra-Corellian_Intelligence",
  "/wiki/Telekinesis/Legends#Force_choke",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/2012",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Category:Images_of_Darth_Acharon",
  "/wiki/Battle_of_Ilum",
  "/wiki/Standard_year/Legends"
 ]
}