{
 "name": "Darth Ruin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Circa 2000 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Umbaran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "New Sith"
     ]
    }
   ]
  }
 ],
 "content": "Darth Ruin, formerly known as Phanius, was a male Umbaran who reigned as a Dark Lord of the Sith at the beginning of the Draggulch Period in around 2000 BBY. Previously an esteemed Jedi Master, Phanius gained notoriety within the Jedi Order due to his prominently self-centered philosophy—the idea that his very will superseded everything in existence. At odds with the Jedi tenets, Phanius eventually abandoned the Order in pursuit of his individualistic ideology, steering him towards the dark side and leading him on an alternate path—the way of the Sith.\nIntent on reviving the Sith into a new empire, Phanius rallied various surviving Sith clans under his banner. The former Jedi Master then declared himself a Dark Lord of the Sith under the new identity of Darth Ruin, simultaneously converting fifty additional Jedi in the Fourth Great Schism. Finalizing the Sith resurgence, Lord Ruin gave rise to a galactic-scale conflict—the New Sith Wars—against the Jedi Order and the Old Republic.\nThe reign of Darth Ruin met an untimely end due to the Dark Lord's own ruthless egomania, evoking the wrath of his Sith disciples and resulting in his assassination. In spite of Ruin's death, his machinations left behind an enduringly bloody legacy; the Sith crusades—while frequently plagued by disagreement and backstabbing—continued for a millennium in his absence, bringing galactic civilization to the brink of collapse.\nA Force-sensitive male Umbaran, Phanius was a Master of the peacekeeping Jedi Order who lived near the advent of the Draggulch Period, an era beginning in 2000 BBY during the time of the Old Republic. Up to this point, Phanius had attained a polarizing reputation in his Jedi career. While highly regarded for his intellect and charisma, the Jedi Master unsettled many of his peers—even facing condemnation from the Jedi Council—by exhibiting solipsistic traits; the Umbaran had begun to perceive his own mind and, by extension, himself, as the only thing to truly exist. Upon realizing the Order's refusal to accept his stance, Phanius chose to abandon the ways of the Jedi, driven to uncover alternate teachings that would allow him to fully embrace his individualistic ideology. Having renounced his place among the Jedi, he became formally recognized as one of \"The Lost\"—Jedi Masters who voluntarily left the Order over ideological differences.\nAt some stage in his quest for knowledge, Phanius managed to obtain a holocron—a crystalline data storage device—from a Jedi temple. The device in question contained teachings of the millennia-old Sith Order, a cult that adhered to the ways of the dark side of the Force. By around this point, Phanius himself had fallen under the dark side's corruptive power, though his former Jedi allies remained completely oblivious to his conversion at the time. Armed with his new-found knowledge of the dark side, the former Jedi Master set out to recruit more disciples to the ways of the Sith, vowing revenge against the Jedi Order for dismissing his beliefs.\nIn an effort to revive the Sith Order, Phanius sought out a number of Sith clans that had survived throughout the galaxy, disproving the common belief that the dark side cult had been destroyed for centuries up to this time. Working outside of the Jedi Order's notice, he managed to infiltrate and unite these clans, paving the way for what would ultimately become a new empire of the Sith. In the process, Phanius relinquished his former identity—determined to break his mental barriers in pursuit of egocentric self-interest—and declared himself a Dark Lord of the Sith under the new moniker of Darth Ruin. With his new title, the Dark Lord convinced fifty additional Jedi to leave the Order and rally behind his cause, resulting in the Fourth Great Schism.\nThe culmination of Darth Ruin's machinations gave rise to the New Sith, a resurgent Sith faction that engaged the Jedi Order and the Republic in a galactic conflict called the New Sith Wars. By the time of his reign over the Sith, Darth Ruin had enlisted a squire by the name of Eradicus. The Dark Lord held his disciples in low regard, viewing them literally as \"nothing\" in the grand scheme of his individualistic obsession. This attitude led Ruin to sacrifice many of his Sith followers seemingly on a whim, provoking their ire and eventually driving them to conspire against him. Despite the murderous intent of his disgruntled underlings, Lord Ruin never even considered the possibility that they would bring about his demise. This single-minded confidence facilitated a premature end to the reign of the new Dark Lord, resulting in his assassination.\nThe actions of the late Darth Ruin brought about a new age of expansion and reclamation for the Sith. Even in his absence, the New Sith Wars persisted for a thousand years. During this time, a number of Dark Lords rose to leadership in various destructive campaigns against the Jedi and the Republic, pushing the latter to the brink of collapse. Among these leading figures was Darth Rivan, a Sith Lord who at one point owned a scripture containing a text passage in the Sith language—titled the \"creed of ruin\"—reminiscent of Ruin's solipsistic philosophy. Despite a string of crushing victories achieved by Ruin's successors, the treachery that originally led to his death continued to plague the Sith ranks, with many subsequent Dark Lords falling to the same fate.\nAt some point during the Republic Dark Age that began in 1100 BBY, the Sith finally turned against one another in a bloody period of civil war, fracturing the empire that Ruin had founded. The Sith remnants were later reorganized into the Brotherhood of Darkness, only to meet their ultimate demise at the conclusion of the New Sith Wars in 1000 BBY. A lone Brotherhood survivor—Darth Bane—went on to establish a new Sith doctrine to overcome the pitfalls that destroyed Ruin and his successors, of which Bane discussed in a historical compilation called the Book of Sith. The Jedi Order expressed a grim view of Ruin's legacy in a guidebook titled The Jedi Path, stating that his revival of the Sith nearly led to the end of galactic civilization.\nIn 40 ABY, an encyclopedic compendium about the Force—compiled by Jedi historian Tionne Solusar—briefly explored details regarding Ruin's former life as a Jedi Master, as well as his motivations for leaving the Order and establishing the New Sith.\nA pale blue-skinned member of the Umbaran species, Master Phanius stood among the most charismatic and talented Jedi of his time. In spite of this, the Jedi Master stirred controversy with his intellectual pursuits, particularly his growing fascination with the philosophy of solipsism. An ambitious, abstract thinker, Phanius believed that his own perceptions superseded all things in existence, meaning that—from his point of view—he was essentially the only thing to exist. This self-centered mindset led Phanius to resent the Jedi Order for not accepting his vision; he came to view the Jedi teachings as a hindrance, one that would prevent the Umbaran from fully realizing that he was, in fact, \"everything\". Determined to obliterate these inhibitions, Phanius fell to the dark side and pursued the alternate path of the Sith, assuming the identity of Darth Ruin as a Dark Lord. Throughout his campaign to revive the Sith, Ruin grew increasingly consumed by his individualistic obsession, developing a sense of utter detachment from his Sith disciples. Many of Ruin's followers fell victim to his ruthless impulses, making him a widely detested leader and, ultimately, a target for assassination. Nonetheless, the Dark Lord maintained an unyielding confidence in his monomaniacal pursuit, leaving him completely blind to the treachery that would bring about his death.\nDarth Ruin was first mentioned as an unidentified Jedi Knight-turned-Sith in the novelization of The Phantom Menace, written by Terry Brooks and published in 1999. The book incorrectly cites Ruin as the original founder of the Sith Order as a whole. In 2000, this error was corrected in The Essential Chronology, establishing the still-unidentified Ruin as the creator of a successor faction—the New Sith. The character was officially named Darth Ruin by author Abel G. Peña in Vader: The Ultimate Guide, a limited edition magazine released in 2005. To this end, Peña saw the name Ruin—derived from the Latin word \"ruīna\", meaning \"fall\"—as a fitting representation of the character's fall to the dark side, as well as the destructive chaos following his demise. Several other Darth titles were considered, such as Reaper, Fatalis, Necro, Mortalis, Eradicus, Execute and Solopsis. While creating Ruin's backstory, Peña envisioned him as an intelligent, wise and evil individual in the same vein as Dooku from the Star Wars prequel films, as well as Darth Traya from the video game Knights of the Old Republic II. In 2006, Peña further expanded Ruin's history in an article titled Evil Never Dies: The Sith Dynasties, confirming his species and former identity as a Jedi Master named Phanius.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/New_Sith",
  "/wiki/Darth_Ruyn",
  "/wiki/2000_BBY/Legends",
  "/wiki/Umbaran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Draggulch_Period",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Empire_(disambiguation)",
  "/wiki/Sith_cult/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Fourth_Great_Schism",
  "/wiki/Lord/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Assassin/Legends",
  "/wiki/Death/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Millennium/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Republic_Dark_Age",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Lost_Twenty/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Jedi_Temple_(structure)",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Empire_(disambiguation)",
  "/wiki/Great_Schism/Legends",
  "/wiki/Eradicus",
  "/wiki/Standard_year/Legends",
  "/wiki/Darth_Rivan",
  "/wiki/Book/Legends",
  "/wiki/Sith_(language)",
  "/wiki/1100_BBY",
  "/wiki/Sith_civil_war_(Republic_Dark_Age)",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/Ruusan_campaign",
  "/wiki/1000_BBY",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Rule_of_Two/Legends",
  "/wiki/Book_of_Sith",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force",
  "/wiki/40_ABY",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_historian",
  "/wiki/Tionne_Solusar",
  "/wiki/Species/Legends",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Terry_Brooks",
  "/wiki/1999",
  "/wiki/2000",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Vader:_The_Ultimate_Guide",
  "/wiki/2005",
  "/wiki/Dooku/Legends",
  "/wiki/Prequel_trilogy",
  "/wiki/Kreia",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/2006",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/Knight_Errant_(novel)",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(unabridged_audiobook)",
  "/wiki/Star_Wars_Episode_I_Journal:_Darth_Maul",
  "/wiki/Wizards.com",
  "/wiki/Echoes_of_the_Jedi",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_116",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Insider",
  "/wiki/Heritage_of_the_Sith",
  "/wiki/Star_Wars_Insider_88",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Roleplaying_Game_Saga_Edition_Core_Rulebook",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Star_Wars_Annual_2009",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.27",
  "/wiki/Book_of_Sith:_Secrets_from_the_Dark_Side",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Darth_Desolous",
  "/wiki/Dark_Underlord",
  "/wiki/1750_BBY",
  "/wiki/January_19",
  "/wiki/2009",
  "/wiki/July_9",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/PlayStation_Portable",
  "/wiki/PlayStation_2",
  "/wiki/Wii"
 ]
}