{
 "name": "Darth Tenebrous's Sith Master",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between c. 167 BBY and c. 124 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Order of the Sith Lords"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Darth Tenebrous"
     ]
    }
   ]
  }
 ],
 "content": "A Twi'lek Dark Lord of the Sith reigned as the Sith Master of the Bith male Darth Tenebrous during the final centuries of the Galactic Republic. The duo followed the lineage of the Sith Lord Darth Bane, adhering to his Rule of Two, which restricted the Sith to one Master and one apprentice. During the Master's reign, the Twi'lek opened a hole in the Force, allowing the Jedi Order to feel the dark side for the first time in over eight centuries after the final battle of the New Sith Wars. Eventually, the Twi'lek was slain by Tenebrous, who carried the Sith imperative forward by taking the Muun Hego Damask as his apprentice, dubbing him Darth Plagueis.\nIn the final centuries of the Galactic Republic, a Twi'lek who was sensitive to the Force joined the Order of the Sith Lords, eventually ascending to the rank of Dark Lord of the Sith. In keeping with the Sith Lord Darth Bane's Rule of Two, which limited the Sith to a Master and apprentice, the Twi'lek Sith Lord eventually took the Bith male Rugess Nome as a pupil, naming him Darth Tenebrous. The Twi'lek Sith Master and Tenebrous were dedicated to advancing the Grand Plan, which was a Sith imperative focused on destroying the Jedi Order and the Republic. The pair worked for years to develop a virus that would target and sever a Jedi's connection to the Force. However, the Master and Tenebrous ultimately abandoned the project. At some point during the Sith Master's reign, the Twi'lek opened a rift in the Force, allowing the Jedi Order to sense the dark side of the Force for the first time in the eight centuries since the final battle of the New Sith Wars.\nDarth Tenebrous's Sith Master burdened the Bith with studying the Force, which Tenebrous viewed as simple. The Bith eventually came to believe that the Force was an energy source that he could manipulate in order to achieve his goals. After reading the prophecies in the Journal of the Whills regarding the Chosen One who would bring balance to the Force, Tenebrous was determined to use a variation of the essence transfer—a Force technique that enabled its user to transfer their consciousness into another body—at the moment of the individual's birth, thus making himself the Chosen One. Between approximately 167 BBY and approximately 124 BBY when Tenebrous's calculations for his scheme were complete, the Twi'lek was slain by the apprentice, who went on to take the Muun Hego Damask as his apprentice, naming him Darth Plagueis.\nPlagueis, the Sith Master's eventual successor, acknowledged the Twi'lek's role in advancing the Grand Plan to topple the Jedi and the Republic and opening a rift in the Force. The Muun Sith Lord recounted the Master's and Tenebrous's achievements to his apprentice, Darth Sidious.\nThe Twi'lek Sith Master was dedicated to the Sith initiative to topple the Jedi and the Republic. Despite the Master's and Tenebrous's attempts to create a virus that would separate the Jedi from the Force, they ultimately abandoned their efforts. Tenebrous viewed his Master as simplistic and tottering.\nTenebrous's Master was capable enough to cause a rift in the Force that enabled the Jedi Order to feel the dark side's presence for the first time since the New Sith Wars' final battle. However, the Twi'lek was not able to withstand Tenebrous, who slew his Master.\nDarth Tenebrous's Sith Master was first mentioned in the short story The Tenebrous Way, which was written by Matthew Stover for Star Wars Insider 130 and released in December 2011. The Sith Master was later mentioned in the novel Darth Plagueis, which was written by James Luceno and published on January 10, 2012. Tenebrous's Master's species was established as a Twi'lek in the novel.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/167_BBY",
  "/wiki/124_BBY",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Darth_Tenebrous/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Rule_of_Two/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Wound_in_the_Force",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Time/Legends",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/New_Sith_Wars",
  "/wiki/Death/Legends",
  "/wiki/Grand_Plan/Legends",
  "/wiki/Muun/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Virus",
  "/wiki/Journal_of_the_Whills/Legends",
  "/wiki/Chosen_One/Legends",
  "/wiki/Dark_transfer",
  "/wiki/Force_power/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/The_Tenebrous_Way",
  "/wiki/Matthew_Stover",
  "/wiki/Star_Wars_Insider_130",
  "/wiki/December",
  "/wiki/2011",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/James_Luceno",
  "/wiki/January_10",
  "/wiki/2012",
  "/wiki/Species/Legends",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider:_The_Fiction_Collection_Volume_1",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/Darth_Gean",
  "/wiki/533_BBY",
  "/wiki/Darth_Venamis",
  "/wiki/67_BBY",
  "/wiki/Darth_Tenebrous",
  "/wiki/Kursid",
  "/wiki/54_BBY/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Leland_Chee",
  "/wiki/StarWars.com",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/46_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/33_BBY/Legends",
  "/wiki/Duel_in_Darth_Gravid%27s_bastion"
 ]
}