{
 "name": "Darth_Voren",
 "display_name": "Darth Voren",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Revanchists",
      "Revanchists",
      "Galactic Republic",
      "Darth Revan's Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Unidentified Jedi Master",
      "Unidentified Sith Knight"
     ]
    }
   ]
  }
 ],
 "content": "Darth Voren, originally known as Voren Renstaal, was a male Human who served Darth Revan's Sith Empire as a Sith apprentice. Renstaal was originally a member of the Jedi Order, and he fought alongside the Revanchists during the Mandalorian Wars, a conflict that erupted in 3976 BBY when the Mandalorian Neo–Crusaders began an invasion of the Outer Rim Territories.\nFollowing the conclusion of the Mandalorian Wars in 3960 BBY, the Revanchists reformed to become Revan's Sith Empire. Renstaal became an apprentice and took up the Sith title \"Darth,\" renaming himself as Darth Voren. The Empire began an invasion of the Galactic Republic, and Voren was assigned to serve aboard Revan's flagship. In 3957 BBY, the ship was attacked by the Galactic Republic, and Voren encountered a Republic strike team in the ship's Security Command center.\nThe Human male Voren Renstaal was born during the time of the Galactic Republic. He joined the Jedi Order and completed his Jedi training on the planet Ossus under the tutelage of a Jedi Master. In 3976 BBY, the Mandalorian Neo–Crusaders began attacking worlds in the Outer Rim Territories, beginning the Mandalorian Wars. Renstaal fought alongside his Master during the early stages of the conflict until his Master was killed during the First Battle of Onderon. Afterward, Renstaal joined the Revanchists, a renegade faction of Jedi led by the Jedi Knight Revan, and fought in the Mandalorian Wars against the wishes of the Jedi High Council. Following the defeat of the Mandalorians in 3960 BBY, the Revanchists traveled to the Unknown Regions, and Renstaal accompanied them. There, the Revanchists adopted the teachings of the Sith and reformed themselves to become Darth Revan's Sith Empire. Renstaal took up the Sith title of \"Darth\", renaming himself \"Darth Voren.\" He became a Sith apprentice and trained under a Sith Knight, who was under the direct command of the newly-christened \"Darth\" Revan.\nThe Sith Empire began an invasion of the Republic, and during the conflict, Voren was appointed to serve aboard Revan's flagship, where he helped to control the ship's security forces. In 3957 BBY, Voren was aboard the flagship when it was attacked by Republic forces, who planned to capture Darth Revan. During the attack, a team of Republic agents was sent to the ship's Security Command, or \"SecCom,\" center, from where they planned to order all of the ship's security teams to go to the aft side of the flagship, allowing a team of Jedi to make their way to the bridge and capture Revan. The strike team was made up of the Jedi Knights Aldren Dayos and Anyara; the scout Haden Vazzar; the soldier Kagen Brendel; the spy Mara Davos; and the intelligence officer Samar.\nThe group made their way to the Security Command center, where the Republic squad found Voren standing in the middle of the center with fifteen Sith troopers and several Sith Marauders, who were all under his command. The Sith troopers attacked the strike team, while Voren and the Sith Marauders ignited their lightsabers and deflected any blaster shots that were fired at them. The Republic team was eventually able to obtain the codes required to access the SecCom computer system, and they used them to order the Sith security teams to move to the aft side of the ship, eventually capturing Revan.\nVoren was ambitious and hoped to be able to rise quickly through the ranks of the Sith Empire. To achieve this, he strove to complete his Sith training and hoped to remove at least one of his superiors to quicken his ascent. He wore dark-colored robes and a featureless black-tinted faceplate that obscured his facial features. He also wielded a lightsaber, which he had constructed himself.\nVoren knew how to use the Force to move objects, influence the minds of others, and create an energy-resistant field around himself. He could also manipulate the dark side of the Force, using Force lightning and Force Slow to directly attack others, or to employ Force rage to enhance the rest of his powers. Voren was bilingual, able to speak both Basic and the Sith.\nDarth Voren was created by Patrick Stutzman in The Betrayal of Darth Revan, a supplement to the Star Wars Roleplaying Game that was released in 2008. In the supplement, the players role-play as the Republic agents that Voren encounters and their encounter with him can go a number of ways, depending upon the actions of the player characters. If the players kill more than half of the Sith troopers in the SecCom center, Voren and the Sith Marauders directly attack the player characters and will fight to the death, rather than surrender.\nThe players can speak to Voren and try and get him to tell them the code for the SecCom computer system, which they can do by either interrogating him or by trying to persuade him that it is his best interest to help them. If they tell him that the aim of their mission is to capture Darth Revan, then Voren becomes more likely to help them, as he believes that removing Revan would help him to rise through the ranks of the Sith. However, if either of the Jedi player characters are still conscious, Voren will not voluntarily help the players and remains hostile. If the players do succeed in gaining Voren's favor, he enters the code into the computer system and orders the security teams to move aft. However, if the player characters then decide to alter the ship's systems, for example by disabling the weapons or lowering the shields, Voren becomes hostile to them again. When the players leave the SecCom center, if Voren is still assisting them, he remains behind to ensure that the Sith security teams stay away from the flagship's bridge. If the players fail to obtain the code from Voren, they can get it by interrogating any surviving Sith troopers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Revanchist",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Voren_Renstaal%27s_Jedi_Master",
  "/wiki/Unidentified_Sith_Knight",
  "/wiki/Darth/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/3976_BBY",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/3960_BBY",
  "/wiki/Sith/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Darth_Revan%27s_flagship",
  "/wiki/3957_BBY",
  "/wiki/Capture_of_Darth_Revan",
  "/wiki/Jedi_training/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ossus/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Death/Legends",
  "/wiki/First_Battle_of_Onderon_(Mandalorian_Wars)",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Battle_of_Malachor_V",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Aldren_Dayos",
  "/wiki/Anyara",
  "/wiki/Scout/Legends",
  "/wiki/Haden_Vazzar",
  "/wiki/Soldier/Legends",
  "/wiki/Kagen_Brendel",
  "/wiki/Spy/Legends",
  "/wiki/Mara_Davos",
  "/wiki/Samar",
  "/wiki/Squad/Legends",
  "/wiki/Sith_trooper_(Sith_Empire)",
  "/wiki/Sith_Marauder",
  "/wiki/Lightsaber/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Energy_resistance",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Force_Slow",
  "/wiki/Force_rage",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Sith_(language)",
  "/wiki/Patrick_Stutzman",
  "/wiki/The_Betrayal_of_Darth_Revan",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/2008",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}