{
 "name": "Darth_Plagueis",
 "display_name": "Darth Plagueis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "By 32 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Muun"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Tenebrous"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Darth Sidious"
     ]
    }
   ]
  }
 ],
 "content": "Darth Plagueis  was a Force-sensitive Muun male Dark Lord of the Sith and the Sith Master of Darth Sidious. Plagueis lusted for immortality, believing the secret laid in science. To that end, he worked with his Sith apprentice, conducting research into bioengineering and experimenting with his ability to influence the midi-chlorians to create life. In doing so, Plagueis acquired considerable knowledge of the Force, but he was ultimately betrayed and murdered by his own apprentice in accordance with the Rule of Two. Sidious later recounted the tale of his master's demise to lure the Jedi Knight Anakin Skywalker to the dark side of the Force, calling the fallen Sith Lord Darth Plagueis the Wise. After his own demise, Sidious used his master's teachings to cheat death, though true immortality still eluded him up until his final end.\nDarth Plagueis was a legendary Dark Lord of the Sith trained by the Sith Master Darth Tenebrous. At some point during his life, Plagueis acquired the protocol droid 11-4D. During his time as a Sith Lord and studying the Force, Plagueis acquired a vast amount of knowledge about the dark side and its teachings.\nThe time period of when Plagueis came to possess his Sith apprentice was unknown, but the Dark Lord chose Sheev Palpatine, a human from Naboo, as his apprentice. As master and disciple, Plagueis and Palpatine—who took the Sith moniker Darth Sidious—worked together for years, trying to unlock the secrets of immortality as Plagueis lusted for it and to execute the Sith Order's long-percolating plan of supplanting the Galactic Republic with a new Sith Empire.\nWhile training Sidious, Plagueis taught him that two Sith were required for their perilous machinations. So, if they worked together in accordance to the Rule of Two, with one of them serving as a bait for the dark side of the Force and the other as a vessel, they would succeed in acquiring the ability to harness the full power of the dark side and rule immortal for ten thousand years. While apprenticed by Plagueis, Sidious also built his own lightsabers.\nPlagueis attempted to forge a Force dyad with Sidious, a unique Force-bond as strong as life itself and which was the predecessor to the Rule of Two. However, Plagueis was unsuccessful in forming the dyad.\nBelieving the secrets to immortality lie in science, Plagueis conducted in-depth research into the biological underpinnings of life. Some of that research constituted unnatural experiments, through his ability to coax the midi-chlorians, in an attempt to cheat death, that, though incomplete, were encouraging to his apprentice. The Sith Order had long coveted the ability to live forever, unwilling to accept the Jedi Order's belief that death was a natural part of life, but over the centuries generations of Sith Lords failed to unlock the ability that led to eternal life. He was so obsessed with the subject that he ignored the signs that his \"faithful apprentice\" was progressing in a disturbing way for him.\nAccording to Darth Sidious' book, The Secrets of the Sith, Plagueis discovered a form of immortality through transference, a Force power that allowed the user to transfer his consciousness to another body, essentially using bodies as vessels.\nDarth Plagueis had arranged for his apprentice to become the Senator of Naboo and the rest of the Chommell sector. By the time that Sidious, under his public persona of Sheev Palpatine, was appointed to the Galactic Senate as the Senator of Naboo, Plagueis was still teaching him, which allowed Palpatine to sharpen his political skills within the plan imagined for him by his master, before they returned to Coruscant.\nAccording to Sidious, Plagueis was powerful enough that he could use the Force to influence the midi-chlorians to create life and keep the ones he cared about from dying, a precious knowledge that awarded him the epithet of \"The Wise.\" However, Plagueis also developed a belief that the Force could \"strike back\" at him for his power. In truth, he became so powerful that the only thing he still dreaded was losing his power.\nUltimately, Plagueis' only fear was bound to come true; at some point, Sidious had learned everything he needed from his distracted master, after which he decided that he had no further use for his teacher. In accordance with the Rule of Two tradition, Sidious broke into his master's apartment and disposed of Plagueis, murdering his mentor in cold blood, killing him in his sleep, and ascending to ultimate power and acquiring the title of Sith Master for himself. As noted by Sidious, Plagueis didn't act fast enough to prevent his own demise.\nSometime before or after Plagueis' demise, Sidious acquired his own pupil in the Nightsister Mother Talzin's son, Darth Maul, a young Dathomirian Zabrak whom Sidious had kidnapped from Talzin when he was only a child.\nSidious accomplished his ascendance as a Dark Lord of the Sith by killing Plagueis, adhering to the Sith Order's tradition in which the apprentice completed his dark-side training by killing his master. Plagueis' legacy continued through Sidious; With the death of Plagueis, Sidious not only gained the status of Master, but also acquired 11-4D, the late Sith Lord's multi-limbed assistant. In addition, Sidious also inherited Plagueis' studies; in depth research into the biological underpinnings of life with the end goal of discovering how to cheat death.\nPlagueis' death served as an example to the apprentice who betrayed and killed him; Sidious regarded his master's trust in him as a mistake, which he vowed to never make. During the Clone Wars, Sidious was aware that his second apprentice, Darth Tyranus, plotted to usurp his title of Sith Master by killing him. Sensing that Tyranus' betrayal was imminent, Sidious successfully conspired to have his student killed by his intended replacement, the Jedi Knight and prophesied Chosen One Anakin Skywalker.\nIn the waning days of the Republic, Sidious recounted the history of his late master to Skywalker, whom he befriended years before the Clone Wars in an effort to gradually turn him to the dark side of the Force. Skywalker, who was unaware at the time that his friend was in fact a Sith Lord, and having developed premonitions of his secret wife's death in childbirth, was intrigued by the story of Plagueis, particularly his ability to prevent death. When the fear of loss drove Skywalker to betray the Jedi Order, turning him into the Sith Lord Darth Vader, Sidious reformed the Republic into the Galactic Empire and declared himself Emperor. At the same time, he had the Jedi systematically executed throughout the galaxy by Order 66, completing the Sith plan that lasted for over a millennium.\nOne of the few Jedi to survive was a Padawan named Ferren Barr. Barr began investigating as to why the Jedi fell so quickly and learned of Plagueis' existence, putting his file on him in his list of individuals involved in the crisis. In the years that followed his rise to power, Sidious came to genuinely, if posthumously, appreciate Plagueis for the planner and prophet he had been. Sometimes, Sidious mused about how his late master would have reacted when confronted with the trivial, day-to-day matters of Imperial politics, remarking that Plagueis never foresaw that he would become Emperor.\nPlagueis' failure to form a dyad with his apprentice had convinced Sidious that his master was unworthy of the task. However, Sidious also failed to recreate the dyad with his own disciple Vader, despite their combined power as scions of the two strongest Force-sensitive bloodlines, the Palpatines and the Skywalkers.\nBetween 3 and 4 ABY, cultists searching the catacombs beneath the Sith Citadel on the planet Exegol, a secret Sith world that Palpatine had taken over, repeated Plagueis' name in something similar to a chant, along with the names of other Sith.\nDuring the Battle of Endor in 4 ABY, Sidious was killed by a redeemed Anakin Skywalker, who turned back to the light side of the Force and threw Sidious down a reactor shaft to save his son Luke Skywalker. While falling, however, Sidious reflected that he had prepared himself for that scenario unlike Plagueis and called on all the power of the dark side to leave his body and thrust his consciousness to a cloned body created by the Sith Eternal on the secret Sith world of Exegol.\nHowever, Sidious' use of transference had confined his essence in a flawed vessel that was incapable of containing his dark side energy, causing severe physical deformities to his new body. Because of the imperfect transfer, Sidious later surmised that Plagueis may have kept his secrets in his grave and was \"having the last laugh after all.\"\nWhen Sidious used Plagueis' secret to immortality and his own research into mix of Sith sorcery and technology to resurrect his spirit in a new vessel, he was able to stave off death for a time, but immortality still eluded the Dark Lord. To this end, the transfer was imperfect; when Sidious thrusted his essence toward the new cloned vessel, and had awoken, he realized the painful, temporary existence he was now within, the body racked with decay in consequence to his massive power within the dark side of the Force, leading the Sith Lord toward death permanently if not dealt with. Because of this, Sidious mused that perhaps Plagueis, in the end, was having the final laugh over his apprentice, as karma for his demise.\nIn the years following the Empire's end, during the final stages of the war between the First Order and the Resistance, Sidious' granddaughter, Rey tracked him down to Exegol as the Resistance and the Sith Eternal prepared for a final showdown. Before a redeemed Ben Solo came to her rescue, Sidious insisted his granddaughter to strike him down as he did with Plagueis, allowing Rey to read his mind and realize how he came back thanks to Plagueis' teachings. Ultimately, Rey used the voices and power of the past and deceased Jedi to destroy Sidious and the Sith for good.\nDarth Plagueis was a wise Dark Lord of the Sith who possessed a vast knowledge of the dark side of the Force. He was a Muun male, and had orange eyes. He was a meticulous planner, who tried to accomplish the Sith's goal to replace the Galactic Republic with a Sith Empire. Due to his powers, he also became paranoid, believing that the Force could \"strike back\" against those who sought to meddle with the very fabric of both the physical and cosmic realms.\nObsessed with achieving immortality, Plagueis strived to discover the path towards becoming an eternal being alongside his apprentice Darth Sidious and rule together for thousands of years, and believed the secret to it laid in science. While Plagueis became afraid of losing his power, he never expected his apprentice to be the reason he would lose power. Ultimately, Plagueis had trusted and underestimated Sidious, who betrayed and murdered him when he least expected it. Though Plagueis did not live to achieve his goals, Sidious succeeded to survive his death, but given that his transfer was imperfect, he asked himself if maybe Plagueis got the last laugh after all at his failure.\nAccording to Darth Sidious, Darth Plagueis was a powerful Sith Lord who was able to use the Force to influence the midi-chlorians to create life, a power that was reportedly to be extremely rare for one sensitive to the Force to possess, and could even be used by certain Sith Lords to prolong or even cheat death. Utilizing this ability, Plagueis was able to conduct unnatural experimentations in his bid to discover immortality. His great knowledge of the dark side of the Force could also even aid him in keeping the ones he cared about from dying.\nFocused on achieving immortality, Darth Plagueis managed to discover a way to become immortal, which consisted on transferring his consciousness to another body and use it like a vessel. His apprentice Darth Sidious was later able to survive his first death through this method, yet the transfer was imperfect.\nDarth Plagueis may have had the ability to see into the future as his apprentice later mused in appreciation of him for the prophet he had been. However, what Plagueis never saw coming was his apprentice's rise to power.\nDarth Plagueis was first mentioned on-screen in the 2005 film Star Wars: Episode III Revenge of the Sith, the third and final installment of the Star Wars prequel trilogy. Although Palpatine was never confirmed to be Plagueis' apprentice in the movie itself, a link to the official encyclopedia on StarWars.com did refer to Sidious as having been \"trained by Darth Plagueis.\"\nThe character was created by George Lucas as early as the first draft of Revenge of the Sith—dated April 2003—and possibly earlier. His story was massively expanded upon in the 2012 Star Wars Legends novel Darth Plagueis, written by James Luceno. It notably established Plagueis to be a Muun just as Lucas proposed.\nAlthough Legends works show that Plagueis had power over life and death, Lucas himself stated Palpatine's tale about Plagueis' abilities was a lie. The Biography gallery of Darth Sidious' Databank entry states that Plagueis was killed by Sidious after he took Darth Maul as his apprentice. However, the 2019 reference book Ultimate Star Wars, New Edition lists Plagueis' murder at Sidious' hands as taking place before Sidious takes Maul under his wing.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Darth_Plagueis",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Sith_Lord",
  "/wiki/Star_Wars_Legends",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Darth_Plagueis",
  "/wiki/Masters",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/Emperor_Palpatine",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/32_BBY",
  "/wiki/Muun",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sith",
  "/wiki/Darth_Tenebrous",
  "/wiki/Darth_Sidious",
  "/wiki/Force-sensitive",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Sith_Master",
  "/wiki/Immortality",
  "/wiki/Sith_apprentice",
  "/wiki/Bioengineering",
  "/wiki/Midi-chlorian",
  "/wiki/The_Force",
  "/wiki/Death",
  "/wiki/Rule_of_Two",
  "/wiki/Tragedy_of_Darth_Plagueis_the_Wise",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Battle_of_Endor",
  "/wiki/Transference",
  "/wiki/Battle_of_Exegol",
  "/wiki/Darth",
  "/wiki/Protocol_droid",
  "/wiki/11-4D",
  "/wiki/Time",
  "/wiki/Lord",
  "/wiki/Human",
  "/wiki/Naboo",
  "/wiki/Standard_year",
  "/wiki/Grand_Plan",
  "/wiki/Galactic_Republic",
  "/wiki/Sith_Empire",
  "/wiki/Darth_Sidious%27_lightsabers",
  "/wiki/Lightsaber",
  "/wiki/Force_dyad",
  "/wiki/Force-bond",
  "/wiki/Doctrine_of_the_Dyad",
  "/wiki/Midi-chlorians",
  "/wiki/Jedi_Order",
  "/wiki/Standard_century",
  "/wiki/Book",
  "/wiki/The_Secrets_of_the_Sith",
  "/wiki/Force_power",
  "/wiki/Senator",
  "/wiki/Chommell_sector",
  "/wiki/Galactic_Senate",
  "/wiki/Coruscant",
  "/wiki/Darth_Plagueis%27_apartment",
  "/wiki/Sleep",
  "/wiki/Nightsisters",
  "/wiki/Mother_(title)",
  "/wiki/Talzin",
  "/wiki/Maul",
  "/wiki/Dathomirian",
  "/wiki/Zabrak",
  "/wiki/Youngling",
  "/wiki/Limb",
  "/wiki/Aide",
  "/wiki/Clone_Wars",
  "/wiki/Dooku",
  "/wiki/Chosen_One",
  "/wiki/Standard_day",
  "/wiki/Timeline_of_galactic_history",
  "/wiki/Cloning",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Reproduction",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Galactic_Emperor",
  "/wiki/Jedi",
  "/wiki/Great_Jedi_Purge",
  "/wiki/The_galaxy",
  "/wiki/Order_66",
  "/wiki/Millennium",
  "/wiki/Padawan",
  "/wiki/Ferren_Barr",
  "/wiki/Prophet",
  "/wiki/Politics",
  "/wiki/Emperor",
  "/wiki/Blood",
  "/wiki/Palpatine_family",
  "/wiki/Skywalker_family",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Sith_Citadel",
  "/wiki/Planet",
  "/wiki/Exegol",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Luke_Skywalker",
  "/wiki/Sith_Eternal",
  "/wiki/Sith_sorcery",
  "/wiki/Battle_of_Jakku",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Rey_Skywalker",
  "/wiki/Ben_Solo",
  "/wiki/Eye",
  "/wiki/Living_Force",
  "/wiki/Cosmic_Force",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/George_Lucas",
  "/wiki/April",
  "/wiki/2003",
  "/wiki/2012",
  "/wiki/James_Luceno",
  "/wiki/Muun/Legends",
  "/wiki/Databank_(website)",
  "/wiki/2019",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Category:Images_of_Darth_Plagueis",
  "/wiki/The_Skywalker_Saga",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_44",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Endless_Vigil",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_16",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars_Made_Easy",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_193",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_1",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars_Bust_Collection_4",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Darth_Zannah",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Jedi_Master",
  "/wiki/Yoda",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Sacrifice",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_3",
  "/wiki/Darth_Vader_(2020)_11",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/The_Making_of_Star_Wars_Revenge_of_the_Sith",
  "/wiki/TheForce.net",
  "/wiki/January_10",
  "/wiki/May_6",
  "/wiki/2016",
  "/wiki/The_Star_Wars_Archives:_Episodes_I%E2%80%93III,_1999%E2%80%932005"
 ]
}