{
 "name": "Darts D'Nar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zygerria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zygerrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.89 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems",
      "Zygerrian Slave Empire",
      "Zygerrian Slave Empire"
     ]
    }
   ]
  }
 ],
 "content": "Darts D'Nar was a male Zygerrian who worked with the Confederacy of Independent Systems and his homeworld's slave Empire during the Clone Wars. Allied with Count Dooku, he led Separatist forces to the planet Kiros and instrumented the kidnapping of a colony of Togruta. When Republic forces arrived, D'Nar fought against Jedi Master Obi-Wan Kenobi until his plans to detonate bombs around the city were foiled by Kenobi's Jedi companions, Anakin Skywalker and Ahsoka Tano. D'Nar attempted to flee in his ship, but was caught by Skywalker and Tano.\nDarts D'Nar was a male Zygerrian who was a part of the Zygerrian Slave Empire. During the Clone Wars, D'Nar allied with the Confederacy of Independent Systems and accompanied his tactical droid, Count Dooku, and their battle droids to Kiros. After Dooku spoke with its governor, Gupat Roshti, D'Nar order his tactical droid to round up all the citizens of a Togruta colony. D'Nar then stayed inside the governor's tower, collecting birds. Ten cycles after his round-up, he and his forces came under attack by the Galactic Republic under Jedi Generals Obi-Wan Kenobi, Anakin Skywalker, and Commander Ahsoka Tano. D'Nar then contacted Clone Commander Cody and invited Kenobi into the tower to negotiate the terms of surrender.\nD'Nar spoke with Count Dooku and Zygerrian Prime Minister Atai Molec about the last slave shipment and assured them that he would deal with Jedi. As Kenobi arrived, D'Nar was ordered by Dooku to bring Kenobi to him on his knees. D'Nar then told Kenobi that is he who would surrender. At first, Kenobi refused, but D'Nar revealed he had planted several bombs around the city in various buildings and threatened to blow them up if he did not surrender. Kenobi, knowing that Skywalker and his apprentice were listening, agreed with D'Nar's demands and surrendered his lightsaber to him. D'Nar then told Kenobi that he would punish him for what the Jedi did to his people's slave empire, but Dooku would displeased. Kenobi then offered to fight him in the Zygerrian way, agreeing to surrender if D'Nar were to win, an offer the Zygerrian accepted. D'Nar fought Kenobi until his tactical droid informed that Skywalker had defused all of his bombs. Refusing to surrender, D'Nar then activated a bomb on his tactical droid's back and threw the droid at Kenobi, knocking the Jedi over and giving him time to make his escape.\nD'Nar scrambled to to his ship, the Tecora, as he was being pursued by Skywalker and Tano. As he took off, D'Nar's ship was then crippled. When he saw the Jedi, D'Nar unleashed his pet blixus upon them. D'Nar was then confronted by Tano in the ship's cockpit. He fought her using his electro-whip, but was subdued by her. Skywalker then questioned him as to the location of the missing colonists. At first, D'Nar refused and taunted the two Jedi, but conceded and told Skywalker when he was threatened with the Jedi's lightsaber, revealing that his Queen would be auctioning off the colonists to bring back their empire.\nDarts D'Nar was a ruthless Zygerrian slaver, determined to restore the slave empire to its former glory. He was a decent fighter in hand-to-hand combat, dealing out multiple punishing blows when fighting against Obi-Wan Kenobi. He was also considerably strong, at one point tossing Kenobi a fair distance across a room. He did not have much respect for the lives of others, working in a slave empire. In addition to enslaving sentient beings, he also sold various animals as pets.\nD'Nar first appeared in the episode \"Kidnapped,\" the eleventh episode of the Star Wars: The Clone Wars television series' fourth season. He was voiced by Nick Jameson.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Darts_D%27Nar",
  "/wiki/Darts_D%27Nar/Legends",
  "/wiki/Zygerria",
  "/wiki/Zygerrian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Zygerrian_Slave_Empire",
  "/wiki/Clone_Wars",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Planet",
  "/wiki/Kiros",
  "/wiki/Artisan_colony",
  "/wiki/Togruta",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Ahsoka_Tano",
  "/wiki/Tecora",
  "/wiki/Unidentified_T-series_tactical_droid_(Kiros)",
  "/wiki/Battle_droid",
  "/wiki/Governor",
  "/wiki/Gupat_Roshti",
  "/wiki/T-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/Governor%27s_tower",
  "/wiki/Kiros_bird",
  "/wiki/Battle_on_Kiros",
  "/wiki/Jedi_General",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Prime_Minister",
  "/wiki/Atai_Molec",
  "/wiki/Jedi",
  "/wiki/Blixus",
  "/wiki/Electro-whip",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Miraj_Scintel",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Sentience",
  "/wiki/Kidnapped",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/Nick_Jameson",
  "/wiki/Slaves_of_the_Republic",
  "/wiki/Category:Audio_files_of_Darts_D%27Nar",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)"
 ]
}