{
 "name": "Darth_Gravus",
 "display_name": "Darth Gravus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "over Leritor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Facial Implants"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Thana Vesh"
     ]
    }
   ]
  }
 ],
 "content": "Darth Gravus was a male human Sith Lord who served the resurgent Sith Empire during the Cold War and the Galactic War. By the restart of hostilities with the Republic, he had earned a reputation of being ruthless and skilled at political maneuvering throughout the Empire. He oversaw Imperial operations on Taris, undermining the Galactic Republic's efforts to rebuilt the planet after Darth Malak's bombardment.\nAfter the death of Darth Hadra, head of the Sphere of Technology, many members of the Dark Council supported Gravus induction into their ranks, after he had reclaimed the resource rich world of Leritor. For his numerous merits Gravus was considered as a potential candidate to ascend to the Dark Council during the year 3640 BBY, but before he could accept the position he was killed by Darth Karrid, the other potential nominee for Darth Hadra's Dark Council seat after she goaded him into firing upon her ship the Ascendant Spear, forcing her to destroy him. Though the battle had ultimately been a success for the Empire, the recklessness of Gravus' attack on a fellow Sith Lord's ship discredited him in the eyes of the Dark Council.\nDarth Gravus was a human male, and an influential and politically adept Sith Lord in addition to being an ally of Dark Councilor, Darth Mortis. He was the main Sith overseer on the planet of Taris during 3642 BBY, and was to ensure that the Galactic Republic's attempts to restore the destroyed planet failed, to prove that the Republic could not recover from such a thing. He had committed himself to finishing what Darth Malak had begun on Taris more than three hundred years ago. Thanks to the assistance of various members of the Empire, Gravus succeeded in halting the project, and Taris was consequently occupied by Imperial Forces.\nThe victories Gravus achieved on Taris made the Dark Council consider him for a seat within their ranks. The Council agreed that he should be given a seat after the planet of Leritor had been recaptured. Darth Karrid, seeking to gain the Dark Council's favor, attempted to assist him in destroying the Republic Fleet engaged in battle with Gravus over Leritor. Gravus then ordered his fleet to fire upon Karrid's ship the Ascendant Spear in an effort to destroy her, and stop her from disrupting the battle with her intervention. Karrid retaliated by using the Ascendant Spear's gun batteries to attack the Imperial Fleet under Gravus' command. Eventually, Gravus realized the battle was lost and tried to flee to hyperspace; when Karrid took this option away, he finally swallowed his pride and hailed her to beg for mercy. Nevertheless, Karrid was unimpressed and mercilessly finished him off. When word of Gravus' defeat was presented to the Dark Council, they agreed unanimously to grant Darth Karrid a seat on the Dark Council.\nDarth Gravus was a human male, who was ruthless in suppressing rebellion. He was cold, and unforgiving in battle. He was marked by cybernetic implants on his face and supported Darth Mortis. He also seemed to dislike alien species and was a true proponent of the bigotry of the Empire. Also, in spite of his strength, he demonstrated cowardice when faced with a truly superior opponent. When Darth Karrid outplayed him, he was reduced to begging for mercy.\nDarth Gravus was skilled at Sith politics. He was also proficient enough in space battle to gain the upper hand in the Battle of Leritor. In combat Gravus wielded a single-hilt lightsaber.\nIn Star Wars: The Old Republic there is a glitch where Gravus can appear vastly smaller than his actual height.\nHe was a very calm and intelligent commander in the Taris questline, unlike in the novel he was portrayed as a reckless hothead.\nGravus' voice is provided by actor Clive Revill, who also provided the voice of Palpatine in the original release of Star Wars: Episode V The Empire Strikes Back.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/3640_BBY",
  "/wiki/Leritor/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Thana_Vesh",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Taris/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Destruction_of_Taris",
  "/wiki/Darth_Hadra",
  "/wiki/Sphere_of_Technology",
  "/wiki/Dark_Council",
  "/wiki/Ascendant_Spear",
  "/wiki/Darth_Mortis",
  "/wiki/Sith/Legends",
  "/wiki/Planet/Legends",
  "/wiki/3642_BBY",
  "/wiki/3956_BBY",
  "/wiki/Darth_Karrid",
  "/wiki/Second_battle_of_Leritor",
  "/wiki/File:Gravus.png",
  "/wiki/Clive_Revill",
  "/wiki/Palpatine/Legends",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Darth_Gravus",
  "/wiki/The_Old_Republic:_Annihilation_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}