{
 "name": "Darth Mortis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3628 BBY",
      "Nathema"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Dark Council",
      "Sphere of Laws and Justice",
      "Dark Council",
      "Sphere of Laws and Justice",
      "Order of Zildrog"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Zavrasha"
     ]
    }
   ]
  }
 ],
 "content": "Darth Mortis was a Human male Dark Lord of the Sith who served on the reconstituted Sith Empire's ruling Dark Council during the Cold War with the Galactic Republic. One of the twelve Dark Lords who sat on the Council, Mortis presided over the Sphere of Laws and Justice. Mortis trained at least one Sith apprentice, Zavrasha, and he was committed to ensuring that the Treaty of Coruscant remained in place, though he assumed a leadership role alongside Darth Marr and Darth Ravage as the Dark Council's numbers thinned throughout the Galactic War with the Republic.\nDarth Mortis was a Human male who had risen to the rank of Sith Lord in the resurgent Empire by the time of the Cold War with the Galactic Republic. The older man was sufficiently powerful enough to be granted a seat on the Empire's ruling Dark Council, and as one of the twelve Dark Lords of the Sith he controlled a Sphere of Influence within the Empire: specifically, Mortis controlled the Sphere of Laws and Justice. As head of the Sphere, Mortis was charged with overseeing the Imperial justice system and those branches of the Empire that maintained the law within its society. By the end of the Cold War, Mortis had also begun training a Sith apprentice named Zavrasha, and he dispatched her to the neutral moon of Nar Shaddaa in order to ensure that Admiral Jefand Ange's efforts there did not endanger the peace brought about by the Treaty of Coruscant. The Sith Lord Darth Gravus, who was placed in charge of the invasion of Taris, was a political ally of Mortis.\nAs the Galactic War broke out with the Republic, Darth Mortis and the other members of the Council were summoned by fellow Councilor Darth Baras to their meeting chamber on Korriban. Darth Decimus, Hadra, and Acharon were overseeing the Battle of Corellia, so the three attended via hologram. Darths Marr and Ravage were present on Korriban with Mortis, where Baras attempted to declare himself the Voice of the Emperor—the public extension of the Sith Emperor's will and thereby the ruler of the entire Empire. However, Baras was interrupted by the arrival of Darth Vowrawn and Baras' former apprentice. The Sith Warrior, who had been appointed as the Emperor's Wrath after Baras had betrayed his student, battled the false Voice before the rest of the Council.\nAfter the Wrath killed Baras, Darth Vowrawn led Mortis and the others in acknowledging the truth of the Emperor's support for the warrior, accepting that the Wrath was not bound by the Council's wishes. When the Wrath departed, Darth Thanaton brought his own matter before his fellow Councilors: the head of the Sphere of Ancient Knowledge was engaged in a Kaggath, an ancient Sith ritual duel, against his rival and subordinate Lord Kallig. After being bested by Kallig on Corellia, Thanaton appealed to Mortis, Ravage, Vowrawn, and Marr to eliminate the upstart slave, though the other Dark Councilors refused to interfere when Kallig arrived to continue their battle. After Kallig defeated Thanaton and forced him to submit, Mortis rose from his seat and apologized to his fellow Councilor before breaking his neck with the Force. Acknowledging Kallig as the victor, the four Dark Councilors present rewarded the young Sith Lord with Thanaton's now-vacant seat on the Council, and they brushed off the newly-appointed Darth Nox's question when the Emperor would meet with the Council. As the Council adjourned, Mortis advised Nox to return Dromund Kaas and ensure the loyalty of their followers, promising to summon Nox the next time the Dark Council congregates.\nAfter the Battle of Corellia ended with a Republic victory and the deaths of Decimus, Hadra, and Acharon, the Dark Council was angered to learn that the Sith Lord Darth Malgus declared his own empire on the planet Ilum—an empire that did not discriminate against alien species and was not beholden to the political infighting that the current Empire was. Mortis assumed a leadership role on the Council along with Marr and Ravage, dispatching Grand Moff Ilyan Regus and Darth Arho, Baras' successor as head of the Sphere of Military Offense, to conduct the campaign against both Malgus and the Republic there. Mortis and the other Councilors would later meet in their chambers beneath the Imperial Citadel on the capital of Dromund Kaas to debate who would succeed Darth Hadra as the head of the Sphere of Technology, and Mortis was one of several Councilors who refused to support Darth Marr's candidate, the Falleen Darth Karrid. Mortis believed that the Empire was wrong in adopting Malgus' policy of allowing aliens to join their ranks, and he proposed the Human traditionalist Darth Gravus in opposition to Karrid. To that end, he tried to convince the rest of the Council to grant Gravus a seat once he reclaimed the mineral-rich world of Leritor. After Karrid disposed of Gravus, Mortis chose to support Karrid, admitting that he had underestimated her.\nDuring Makeb invasion by the Hutt Cartel, Darth Mortis summoned an Imperial individual to assist him against The Shroud, a spy who wanted to plan a rogue attack on Dromund Kaas. The Dark Councilor introduced Evie Bo, the ex top-lieutenant of The Shroud, to the Imperial individual who gave him the microbinoculars in order to find another lieutenant in the city and stop The Shroud. After neutralizing the Shroud lieutenant, the Imperial individual traveled across the galaxy to uncover the Shroud's plan. The trail eventually lead to Nar Shaddaa, where Bo and the Imperial individual uncovered the Shroud's plan to launch a ship through hyperspace into Kaas City. The Imperial individual managed to thwart both the attack and kill the Shroud, or so it seemed. When the individual returned to Dromund Kaas, the Shroud hijacked Mortis' holofrequency, revealing that a double was killed in his place. Before signing off, the Shroud used a trigger phrase to activate a neural scrambler in Bo's brain, erasing her memory. As Mortis managed to get through, the individual convinced an amnesiac Bo that she is a servant of the Empire.\nIn 3636 BBY the galaxy was invaded by the Eternal Empire of Zakuul, with Darth Marr being one of the first victims of the Eternal Empire conquest. Eternal Fleet had blockaded Dromund Kaas before the end of the year, and the members of the Dark Council fought the invasion of Zakuulan Emperor Arcann with ruthlessness, only to lose. The surviving members of the Dark Council went into hiding rather than be destroyed, and Darth Acina remained the only Dark Councillor left alive and in the public eye, proclaiming herself the Empress of the Sith without opposition. Acina signed a peace treaty with Zakuul and continued to rule with public support for the next six years. Around 3630 BBY Zakuul's Empire was defeated by the Eternal Alliance formed by former Sith Intelligence Minister Lana Beniko, and the surviving members of the former Dark Council began to re-emerge, Vowrawn, Ravage and Mortis among them.\nHaving prevailed over Zakuul, the Commander of the Eternal Alliance took over the Eternal Throne and with it control over the massive Eternal Fleet. However, rather than using it to seize control over the galaxy, the Commander instead proclaimed an era of peace and sought to win over new allies with diplomacy. Seeing such massive power wasted, Mortis became disgusted at the Commander's weakness and the betrayal of Lana Beniko, who abandoned the Sith Empire in favor of the Eternal Alliance. Willing to see the Eternal Fleet destroyed if it meant denying it to those undeserving of its power, Mortis joined the Order of Zildrog, a secretive group formed by former Horizon Guard Vinn Atrius and dedicated to killing the Outlander and destroying the Eternal Alliance. Persuading Vinn Atrius with his desire for revenge, Mortis traveled with the rest of the Order to Nathema, where GEMINI 16 found and planned to awaken Zildrog, an ancient Iokath superweapon. However, the GEMINI droid deceived and betrayed many of her allies, locking them inside energy transfer chambers to be used as fuel for Zildrog's awakening. Darth Mortis was among the victims drained to awaken Zildrog, and the Alliance Commander along with Lana Beniko and Theron Shan arrived shortly after and destroyed the mechanical entity, after which the entire chamber that housed it and the GEMINI's victims exploded.\nA Human male with orange eyes, pale skin, and black hair, Mortis was among the older members of the Council by the end of the Cold War. He did not place much faith in Sith traditions, though he was a believer in the Empire's anti-alien policies—something that led him to support Darth Gravus over Darth Karrid when the Dark Council was considering whom to give Darth Hadra's Dark Council seat to. Nevertheless, he changed his tune when Karrid outmaneuvered and killed Gravus, realizing that he had underestimated her.\nA powerful practitioner of the dark side of the Force, Darth Mortis was a master of telekinesis and lightsaber combat. Darth Mortis was also well skilled in the art of Force choke. He was known to be a master of mental manipulation and was an adept user of spells and telepathic skills that drove victims insane. He was a master of Force lightning and of sith sorcery particularly rituals, the use of blast spheres and explosions of pure dark side energy.\nDarth Mortis is a character in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare and LucasArts, originally appearing only duing the final missions of the Sith Warrior and Sith Inquisitor's respective class storylines on Korriban. After the game's release, he was also featured in the 2012 reference guide Star Wars: The Old Republic Encyclopedia, which identified him as the head of the Sphere of Laws and Justice, and appeared in The Old Republic: Annihilation novel by Drew Karpyshyn set after the events of the Battle of Ilum. In 2013 Rise of the Hutt Cartel Mortis plays a significant role in the Shroud-related macrobinoculars storyline, available for all Imperial classes.\nKnights of the Fallen Empire established that all Dark Council members except for Darth Acina died or disappeared during the Eternal Empire conquest, but Mortis is later revealed to have survived and appears during \"The Nathema Conspiracy\" flashpoint. He is present only if the player, regardless of their class, made the Light Side choice to address the galaxy as a peacekeeper during the very end of the Knights of the Eternal Throne. If the player makes the Dark Side choice to become a new Emperor and use the Eternal Fleet to empower themselves, Mortis has no reason to oppose them, and his place as Zildrog's victim is taken by Indo Zal instead.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mortis/Legends",
  "/wiki/3628_BBY",
  "/wiki/Nathema",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Sphere_of_Laws_and_Justice",
  "/wiki/Order_of_Zildrog",
  "/wiki/Zavrasha",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Darth_Marr",
  "/wiki/Darth_Ravage",
  "/wiki/Galactic_War",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Spheres_of_Influence",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Jefand_Ange",
  "/wiki/Darth_Gravus",
  "/wiki/Invasion_of_Taris",
  "/wiki/Taris/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Dark_Council_Chambers",
  "/wiki/Korriban",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Decimus",
  "/wiki/Darth_Hadra",
  "/wiki/Darth_Acharon",
  "/wiki/Battle_of_Corellia",
  "/wiki/Hologram/Legends",
  "/wiki/Emperor%27s_Voice_(Sith_Empire)",
  "/wiki/Tenebrae",
  "/wiki/Darth_Vowrawn",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Sith_Warrior",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Duel_in_the_Dark_Council_Chambers_(Galactic_War)",
  "/wiki/Darth_Thanaton",
  "/wiki/Sphere_of_Ancient_Knowledge",
  "/wiki/Kaggath_(Galactic_War)",
  "/wiki/Sith/Legends",
  "/wiki/Darth_Nox",
  "/wiki/Corellia/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Duel_in_the_Dark_Council_Chambers_(Kaggath)",
  "/wiki/The_Force/Legends",
  "/wiki/Darth_Malgus",
  "/wiki/New_Empire",
  "/wiki/Planet/Legends",
  "/wiki/Ilum/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Ilyan_Regus",
  "/wiki/Darth_Arho",
  "/wiki/Sphere_of_Military_Offense",
  "/wiki/Battle_of_Ilum",
  "/wiki/Dark_Council_chamber_(Dromund_Kaas)",
  "/wiki/Imperial_Citadel_(Sith_Empire)",
  "/wiki/Capital/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/Sphere_of_Technology",
  "/wiki/Falleen/Legends",
  "/wiki/Darth_Karrid",
  "/wiki/Second_battle_of_Leritor",
  "/wiki/Leritor/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Canon",
  "/wiki/Makeb",
  "/wiki/The_Shroud",
  "/wiki/Evie_Bo",
  "/wiki/3636_BBY",
  "/wiki/Eternal_Empire",
  "/wiki/Zakuul",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Eternal_Fleet",
  "/wiki/Arcann",
  "/wiki/Darth_Acina",
  "/wiki/Zakuul%E2%80%93Imperial_treaty",
  "/wiki/3630_BBY",
  "/wiki/Eternal_Alliance",
  "/wiki/Sith_Intelligence_Minister",
  "/wiki/Lana_Beniko",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Alliance_Commander",
  "/wiki/Eternal_Throne",
  "/wiki/Horizon_Guard",
  "/wiki/Vinn_Atrius",
  "/wiki/GEMINI_16",
  "/wiki/Zildrog",
  "/wiki/Iokath",
  "/wiki/Superweapon/Legends",
  "/wiki/GEMINI",
  "/wiki/Theron_Shan",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Telekinesis/Legends#Force_choke",
  "/wiki/Force_lightning/Legends",
  "/wiki/Sith_magic",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/Sith_Inquisitor",
  "/wiki/2012",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/Drew_Karpyshyn",
  "/wiki/2013",
  "/wiki/Macrobinoculars/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Indo_Zal",
  "/wiki/The_Old_Republic:_Annihilation_(audiobook)",
  "/wiki/2017",
  "/wiki/3629_BBY",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Standard_year/Legends",
  "/wiki/3631_BBY",
  "/wiki/2016"
 ]
}