{
 "name": "Darth Reave",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "137 ABY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "One Sith",
      "Darth Krayt's Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Darth Reave was a male Devaronian Sith Lord who served as a member of Darth Krayt's One Sith in 137 ABY. During the Second Imperial Civil War, Reave was stationed on the Deep Core world of Had Abbadon. It was there that Reave encountered a former Jedi Padawan named Cade Skywalker, whose healing powers Darth Krayt wanted to use to cure his own Yuuzhan Vong biot infestation. Reave engaged Skywalker and several of his companions in battle while on Had Abbadon, and while he fought his opponents, Reave was bitten by an ancient and thought-to-be extinct form of Sithspawn known as a rakghoul. Only after his return to the galactic capital of Coruscant to report his findings to Lord Krayt was it discovered that he had been infected by the rakghoul's plague. Unable to withstand the debilitating effects, Reave then transformed into one of the rakghoul mutants, but was beheaded and killed by one of Krayt's Hands, Darth Stryfe.\nThe Devaronian known as Darth Reave was a Sith Lord of Darth Krayt's Sith Order, and also a commander within the Imperial Navy of Krayt's Sith Empire. Reave wielded two red-bladed lightsabers in the service of the Emperor, and employed them during the Second Imperial Civil War while he was assigned to the Deep Core world of Had Abbadon. He was also accompanied by a garrison of Imperial stormtroopers which were under his command.\nIn 137 ABY, Reave sensed the presence of Jedi on the planet. Before he could investigate or prepare his forces, his position was ambushed by two Jedi and the Imperial Knight Azlyn Rae, who arrived to do battle. He recognized one of the attackers as Krayt's escaped prisoner, Cade Skywalker, whose Force-based healing powers the Emperor wanted to use to cure himself of the Yuuzhan Vong implants that threatened to consume him. Reave dueled Skywalker while his stormtroopers opened fire on the other perpetrators. The female Jedi, Celeste Morne, then used ancient Sith magic to transform Reave's stormtroopers into mutants known as rakghouls who obeyed only her commands. Reave immediately recognized Morne's command of dark side power, and was surprised to learn that she was not a Sith, but a Jedi instead. Reave's mutated troopers then attacked him upon Morne's order. Terrified by the creatures, Darth Reave attempted to fend them off, and slew three of them with one attack as they swarmed him. He also happened to be bitten by one before he threw himself through a window and escaped. Unbeknownst to Reave, the rakghoul's bite transmitted a plague which transformed those infected with it into rakghouls as well. The Jedi and Imperial Knight did not pursue him, as they were content to let the Devaronian reveal their presence to Darth Krayt, for whom they planned to set a trap. Though he was badly wounded, Darth Reave made his way back to the Temple of the Sith on Coruscant to alert Emperor Krayt that Skywalker and his companions were the ones who attacked him on Had Abbadon.\nReave bled profusely from his bites and wounds as reported to Darth Krayt of his failure. He did make Krayt aware that it was Skywalker who battled him in the Deep Core and that another unfamiliar Jedi was present—one who used the dark side to create monsters out of Reave's stormtroopers. Before he could complete his report, Reave himself began to transform into one of the very creatures he encountered on Had Abbadon. When the change was complete, the Devaronian Sith was no more; instead he was mindless Sithspawn, and he charged forward to attack Darth Krayt. He never reached his target, as he was intercepted by Krayt's Hand, Darth Stryfe, who proceeded to behead the creature. Lord Krayt then questioned Darth Maladi, an expert of Sith alchemy, into what it was, and she immediately discovered that he had been transformed into a product of an ancient Sith alchemy, a rakghoul, he had been infected with the creature's plague.\nAs a member of the One Sith, Darth Reave was a loyal minion to Darth Krayt. Like nearly all of his Sith brethren, Reave was fully adorned with red and black Sith tattoos all over his face, as well as on the visible parts of his body. He was aware of Cade Skywalker's importance to Lord Krayt, and making the Emperor aware of his whereabouts became his utmost priority. His blind obedience to Lord Krayt caused Reave to report his knowledge of Skywalker directly to the Emperor, even before he sought any sort of medical attention for the wounds he suffered in battle.\nLike many of the One Sith, Darth Reave wielded two red-bladed lightsabers as an adept of the Jar'Kai form of combat. He was also a military commander, and was left in command of the garrison which was stationed on Had Abbadon. Strong in the Force, Reave was also able to command telekinesis, something which he used to repel the rakghouls that had swarmed him. He was able to sense through the Force the presence of the Jedi on Had Abbadon before they appeared. He was also familiar with Sith magic, as he recognized its power when the rakghouls were transformed before him. He recognized as well that the female Jedi was in command of the dark side. However, Reave was not strong enough to purge the plague from his own body. It consumed him as it had done his garrison, and he—like them—was killed, as there was no way to cure him of the affliction.\nDarth Reave first appeared—albeit unnamed—in the tenth installment of the Star Wars: Legacy Vector series, titled Vector, Part 10, by artist Jan Duursema and writer John Ostrander. He appeared in the subsequent issue, Vector, Part 11, where he was first identified as being \"Darth Reave.\" In this issue, Ostrander uses this character to alert Darth Krayt of Cade Skywalker's presence on Had Abbadon, as well as to introduce the Sith to the reemergence of the ancient rakghoul mutants. Reave only appears in these two comics, with the second appearance being his last.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/137_ABY",
  "/wiki/Coruscant/Legends",
  "/wiki/Devaronian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/One_Sith",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Deep_Core/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Had_Abbadon/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Force_healing/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Yorik-Kul",
  "/wiki/Mission_to_Had_Abbadon",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Sithspawn/Legends",
  "/wiki/Rakghoul",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Rakghoul_plague",
  "/wiki/Mutant",
  "/wiki/Sai_cha/Legends",
  "/wiki/Death/Legends",
  "/wiki/Hand_(One_Sith)",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Stryfe",
  "/wiki/Commander/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Garrison/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Imperial_Knight",
  "/wiki/Azlyn_Rae",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Celeste_Morne",
  "/wiki/Sith_magic",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Window/Legends",
  "/wiki/Temple_of_the_Sith",
  "/wiki/Darth_Maladi",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Red",
  "/wiki/Black",
  "/wiki/Sith_tattoo",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars:_Vector",
  "/wiki/Legacy_(2006)_29",
  "/wiki/Jan_Duursema",
  "/wiki/John_Ostrander",
  "/wiki/Legacy_(2006)_30",
  "/wiki/Category:Images_of_Darth_Reave"
 ]
}