{
 "name": "Darth Xedrix",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3954 BBY",
      "Bosthirda"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Dark Council",
      "Dark Council",
      "Bosthirda separatists"
     ]
    }
   ]
  }
 ],
 "content": "Darth Xedrix was an elderly male Human who was one of the Dark Lords of the Sith who served in the Dark Council of the reconstituted Sith Empire. He was also the Council's longest serving member. As of 3954 BBY he and 5 other members of the Dark Council, including Darth Nyriss, were working to bring the Emperor down, as they considered him arrogant, powerful, and mad, and viewed his plan to attack the Republic as suicidal.\nIn an attempt to keep the alliance unknown to the Emperor, Darth Nyriss faked assassination attempts on her life. Although it was planned to have Nyriss' own followers investigate, the Emperor sent Lord Scourge, and the plan changed. Sechel, another of Nyriss' men, and Scourge were able to discover that a group of Human separatists from Bosthirda were behind the assassination attempts, and during a raid on their compound found evidence that Xedrix was allied with them.\nUsing a replication of the separatists' coded communications, Scourge sent a message to Xedrix impersonating the separatists and asking the Sith Lord to meet with them at a cave on Bosthirda. Xedrix traveled to the location, bringing one male Human and one female Human apprentice with him. When they arrived they were attacked by Scourge, who defeated and killed the two apprentices. Xedrix, who weak from age and use of the dark side, after watching the whole scene unfold before him without making a single move, gathered his strength for one attack and unleashed a violent and devastating attack of Force lightning at Scourge. Scourge, though both taken by surprise and hurt by the elderly Human's attack, recovered and prepared to kill the Sith Lord. Xedrix attempted to turn Scourge to his side, by lying to him that Nyriss had sent him to die and, though truthfully, telling him that she was using him as a pawn in a greater game. Scourge was not convinced and, realizing that the Sith was as weak as Nyriss had said, he killed Xedrix and brought his severed head back to Nyriss as proof that the Sith was dead.\nIn the brief duel between Xedrix and Lord Scourge, Xedrix was able to hold the Sith Lord back until his acolytes could join the fight.\nDarth Xedrix was very talented in masking his true emotions behind a shield of dark side energy. In the fight with Scourge, Xedrix hid his fear of dying at Scourge's hand behind a \"swirling maelstrom of dark side energy\", enabling him to gather the Force for a final attack.\nXedrix was also capable of summoning purple Force lightning powerful enough to fry his enemies.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/3954_BBY",
  "/wiki/Bosthirda/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Bosthirda_separatists",
  "/wiki/Darth_Nyriss",
  "/wiki/Scourge",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Tenebrae",
  "/wiki/Sechel",
  "/wiki/Mission_to_Bosthirda_(3954_BBY)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Darth_Xedrix",
  "/wiki/The_Old_Republic:_Revan",
  "/wiki/The_Old_Republic:_Revan_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}