{
 "name": "Darth Zhorrid",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Dark CouncilSphere of Imperial Intelligence",
      "Dark Council",
      "Sphere of Imperial Intelligence"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Jadus"
     ]
    }
   ]
  }
 ],
 "content": "Darth Zhorrid was a female Human who was the daughter and apprentice of Dark Councilor and Sith Lord Darth Jadus during the Cold War and the Galactic War between the Galactic Republic and the Sith Empire. She later succeeded her father in becoming Councilor of the Sphere of Imperial Intelligence.\nDarth Zhorrid was the only known apprentice trained by her father, Darth Jadus. In her early years, she was talented at singing, which even her father acknowledged. Jadus hired a tutor to teach his daughter, who wasn't a Sith at that time, to sing. When the Sith Lord set up an event in Kaas City for her only, the overjoyed Zhorrid's singing made all her subjects cry. Zhorrid sang her first and last opera for hours until she could sing no longer. It was then that Jadus chose to start her apprenticeship, as he knew his daughter's love for him would turn to lifelong hatred.\nAfter her father's alleged murder at the hands of the terrorist known as the Eagle, she was named a member of the Dark Council to take his place. She later summoned Cipher Nine to her offices on Korriban, where she tested the agent's skills by ordering her guards to attack Nine. She then excused the Cipher to hunt down the terrorist cells.\nThough she demanded respect from her fellow Councilors, they simply laughed at her, viewing her as a child. She wished to seek revenge on Jadus' \"killer,\" the Eagle, and all involved with him.\nCipher Nine eradicated those who were a part of the Eagle's network, which gave Zhorrid more personal power. In 3640 BBY the Star Cabal nearly brought Imperial Intelligence, one of the organizations operating inside her sphere of influence, to its knees. She disbanded the agency and, along with the Dark Council, established Sith Intelligence, which she headed directly, though Darth Marr later replaced her with Lana Beniko.\nShe had scars from the edges of her mouth to her ears.\nDarth Zhorrid wielded a single-bladed Sith lightsaber in combat. Zhorrid was capable of Force lightning and Force storm.\nDarth Zhorrid was first indirectly mentioned in Darth Jadus's Holonet entry on the website for BioWare's video game Star Wars: The Old Republic. The entry contains several Aurebesh phrases; one of them is \"Daughter is only known apprentice.\"\nShe would be killed if the Agent allied with the secretly alive Darth Jadus; otherwise, the Agent presumably remained loyal to Zhorrid.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Darth_Zhorrid",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Sphere_of_Imperial_Intelligence",
  "/wiki/Darth_Jadus",
  "/wiki/Sith_Master/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_training",
  "/wiki/Parent/Legends",
  "/wiki/Kaas_City",
  "/wiki/Eagle",
  "/wiki/Cipher_Nine",
  "/wiki/Korriban",
  "/wiki/Eagle%27s_network",
  "/wiki/3640_BBY",
  "/wiki/Star_Cabal",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Sith_Intelligence",
  "/wiki/Darth_Marr",
  "/wiki/Lana_Beniko",
  "/wiki/Sith_lightsaber/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Force_lightning/Legends#Force_storm",
  "/wiki/The_Holonet",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Aurebesh/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}