{
 "name": "Darth Ikoral",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3642 BBY",
      "Red Reaper above Chandrila"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Order of Ragnos",
      "Order of Ragnos"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Darth Vindican",
      "Kherus"
     ]
    }
   ]
  }
 ],
 "content": "Darth Ikoral was a male Pureblood Sith Lord of the reconstituted Sith Empire in the decades before the Great Galactic War.\nBorn into an old line of red-skinned, pureblooded Sith, Ikoral was able to trace his ancestry almost as far back as King Adas's time. Ikoral survived many battles and trials, even earning the notice of the Sith Emperor himself, which Ikoral claimed was proof of pureblood superiority. It was said that he was so devoted to purity that he would not even tolerate alien slaves in his household. The Sith was the master of Lord Vindican.\nAround 3712 BBY, Ikoral convinced the Dark Council to allow an expedition to search for pureblooded Sith outside the Empire, hoping to find Sith who fled Korriban after the Great Hyperspace War who had not made the journey to Dromund Kaas with the Sith Emperor. When Ikoral failed to return from his quest, he was celebrated as a martyr; for decades his name was synonymous with determination and sacrifice in the Sith Empire.\nThe truth, however, was that Ikoral had indeed succeeded in his search. During the Cold War, Darth Ikoral returned with thousands of pureblood Sith. But the Empire had changed much in Ikoral's seventy-year absence. Appalled by the Empire's peace with the Republic and sickened by the appearance of aliens in the Sith ranks, Darth Ikoral led his fellow purebloods to cleanse the galaxy by force of violence.\nThe response to Ikoral's quest was the dispatching of a strike team to eliminate him. After boarding his flagship, the Red Reaper, the strike team found Ikoral in his personal sanctum and engaged him in combat. The attackers soon found out that he had experimented on the purebloods and increased his power. The strike team, however, ultimately proved more powerful and killed Ikoral at the behest of Darth Malgus, who was apprenticed to Lord Vindican, of whom was in turn a former apprentice of Ikoral.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Darth_Ikoral",
  "/wiki/3642_BBY",
  "/wiki/Red_Reaper",
  "/wiki/Chandrila/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Order_of_Ragnos",
  "/wiki/Darth_Vindican",
  "/wiki/Kherus",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/King/Legends",
  "/wiki/Adas",
  "/wiki/Tenebrae",
  "/wiki/Alien/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/3712_BBY",
  "/wiki/Dark_Council",
  "/wiki/Korriban",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Battle_of_the_Red_Reaper",
  "/wiki/Darth_Malgus",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}