{
 "name": "Darth_Havok",
 "display_name": "Darth Havok",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Iktotchi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red with black tattoos"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fel Empire",
      "Imperial Knights",
      "Imperial Knights",
      "One Sith",
      "Darth Krayt's Galactic Empire"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Antares Draco"
     ]
    }
   ]
  }
 ],
 "content": "Eshkar Niin was a male Iktotchi and a member of the Imperial Knights, a Force-using Order loyal to Emperor Roan Fel of the Galactic Empire. Niin became a Master within the Order and the instructor of Antares Draco, to whom he taught strategy and philosophy while training the Human in the ways of the Force. Niin later abandoned his vows as an Imperial Knight and deserted the Order. He attacked the Empress Elliah Fel and killed her, but was subsequently defeated by Draco, who had been sent to kill him by the Emperor. Draco believed Niin to be dead, but the Iktotchi survived and joined Darth Krayt's Sith Order, becoming the Sith Inquisitor Darth Havok. Krayt's Empire seized control of the galaxy from Fel in 130 ABY, and seven years later, a group of Sith took Fel's daughter Marasiah captive and brought her to the galactic capital of Coruscant. From there, Havok took her to the Sith planet Korriban and began torturing her, hoping to learn valuable secrets of her father's.\nIn between interrogation sessions, Draco arrived on a mission to rescue her and remained on-world to buy her time as she escaped the planet. Havok confronted his former student and defeated him in a lightsaber duel before taking him prisoner deep in the planet's dungeons. Havok inflicted agonizing torture on Draco in an effort to learn Imperial secrets, and eventually used Draco's love for Marasiah to prompt the prisoner to reveal the existence of a Jedi Hidden Temple on Taivas. Krayt's forces then attacked the temple, but the Jedi and their allies evacuated and then counterattacked at Coruscant. Krayt was slain, and his Sith trooper army, whose members were linked to his will, went insane. Havok and several other Sith escaped from the mad troopers on Korriban and fled the planet, and Havok rendezvoused with Darth Nihl, his new Master. Under Nihl's leadership, the Sith went into hiding.\nPrior to 137 ABY, the male Iktotchi Eshkar Niin was a member of the Imperial Knights, an order of Force-users dedicated to protecting Emperor Roan Fel and preserving his Empire. Niin was a Master both within the Order and of his pupil Antares Draco, and he trained the young Human as a Knight of the Empire. During his time as an Imperial Knight, Niin constructed a holocron and recorded some of his teachings within the device. He eventually abandoned his vows as an Imperial Knight and deserted the Order, prompting the Emperor to send Draco to kill him.\nNiin, meanwhile, tracked down Fel's wife, the Empress Elliah Fel, and both hunts culminated on a rooftop in a city of skyscrapers as a three-way lightsaber duel broke out. Draco and Elliah both called on Niin to stop as he attacked the Empress, but he ignored their pleas and shoved Draco away with the Force before striking Elliah down. Draco immediately retaliated, and at the end of their duel, he believed Niin to be dead. Niin in fact survived, but allowed his former apprentice to remain confident of his demise. The Imperial Knights thus thought that Niin, the only member of their order to ever desert his vows, was dead.\nAfter leaving the Imperial Knights, Niin joined the One Sith and became a Sith Lord and Sith Inquisitor serving Darth Krayt, the Dark Lord of the Sith. He took the name Darth Havok, abandoning his former identity. In 130 ABY, Krayt seized galactic control from Emperor Fel, and seven years later, Fel's daughter Marasiah was taken captive by several Sith who ambushed a group of Imperial Knights on Agamar. She was brought to the galactic capital of Coruscant, the seat of Krayt's Empire. Havok was ordered to take her to the Sith world of Korriban by Darth Wyyrlok, who had been ruling the Empire since his attempted assassination of Krayt and usurping of the throne.\nImmediately after Marasiah exited the starship of her escort, Moff Rulf Yage, Havok approached them on their landing platform, concealing his identity from Marasiah with a hood. Despite protests from Imperial Regent Morlish Veed, Havok took the prisoner away from Yage and brought her to Korriban. Once there, Havok chained Marasiah up in the Chambers of Persuasion and began to torture her with Force lightning, hoping to glean secrets about her father's Empire-in-exile. She was resistant, however, prompting Havok to remove his hood and reveal his identity. Marasiah was shocked to see him alive, but shook off her surprise and telekinetically tossed a bowl of hot coals at him. Havok deflected the attack, but the distraction allowed Marasiah to seize his lightsaber with the Force and place it beneath her chin, hoping to die rather than talk. Havok drew on the Force himself and took the weapon back. He then left the chamber to allow his prisoner some recovery time.\nWhile Havok was away, Antares Draco, fellow Imperial Knight Ganner Krieg, and the Jedi Knight Shado Vao arrived at the chambers on a mission to rescue the Princess, and they freed her from her bonds. Draco remained on-world to allow his allies time to flee the planet in their escape ship, and Havok approached him as he was slaughtering a group of Sith. As they engaged each other in lightsaber combat, Darth Krayt, alive and well, projected his will across the galaxy. Both Havok and Draco were drawing on the dark side of the Force and felt his call. Havok offered Draco a chance to join the Sith, but when the Imperial Knight refused, Havok shocked him with Force lightning. Draco's presence was severed from the Force, and, defeated, he became Havok's prisoner.\nDeep in Korriban's dungeons, Havok subjected Draco to agonizing torture, using the Force to slice his body with shards of transparisteel. Draco refused to divulge Imperial secrets, insisting that he would rather die; Havok gave him periodic rest in a bacta tank to ensure that he remained alive long enough to reveal the information that Havok sought. Having trained Draco in the ways of the Force, Havok knew Draco's vulnerabilities, and created a Force illusion that took his former apprentice back to the day that Elliah Fel had died. As Draco relived the duel, Havok appealed to his guilt and claimed that he had been too weak to save her. Havok then projected another illusion onto his fellow Sith Lord Darth Talon, making her appear to be Marasiah Fel. He told Draco that Vao and Krieg had been killed during their escape from Korriban and that Marasiah had been recaptured, and Talon planted a kiss on Draco's lips to promote the deception. When Havok threatened to kill her if Draco did not tell him any valuable information, Draco lost his resolve and revealed the existence of a Jedi Hidden Temple on Taivas. Talon left to relay the findings to Darth Krayt, now back in control of the Empire, and Havok continued to torture Draco with Force lightning.\nTalon delivered Draco to Krayt's nemesis, Cade Skywalker, whom Krayt hoped to entice into a confrontation. The Jedi Order and its allies gathered to defend the Hidden Temple from Krayt's forces, and there, the Dark Lord unleashed upon them his secret army of Sith troopers, dark warriors who were linked to his will. After the allies evacuated Taivas, they launched a counterstrike at Coruscant that saw Krayt die at Skywalker's hands. The Dark Lord's death saw Sith troopers across the galaxy go mad, and the Sith forces at Coruscant killed many of them before fleeing the capital. On Korriban, many Sith died at the hands of the insane troopers, but Havok and several others evacuated. Havok rendezvoused with Darth Nihl, Krayt's de facto successor, elsewhere in the galaxy, and Nihl instructed him to hide what was left of the Sith fleet. Krayt's Empire was fractured, and the Sith would now disperse themselves throughout the galaxy, infiltrate planetary governments, and wait for their opportunity to strike from the shadows.\nAs an Imperial Knight, Eshkar Niin was recognized for his knowledge of strategy. He taught Draco a parable involving a fever wasp and a krayt dragon, informing his pupil that a small fever wasp could bring death to places where a large krayt dragon was unable. He also instructed Draco to always ensure that a slain opponent was definitely dead. Niin eventually left the Order, believing that the ways of the Sith were where his destiny lay. When he later dueled Draco on Korriban, he hoped to recruit his former student into the Sith's ranks rather than kill him. He struck Draco with Force lightning when the offer was refused. Havok was loyal to Darth Krayt, but he accepted Darth Nihl as his new Master following Krayt's death and addressed Nihl as \"My Lord.\"\nAs a Sith Inquisitor, Darth Havok tortured information out of prisoners, inflicting pain on them until they wished for death. In addition to subjecting his charges to physical torture, he employed mind games in his interrogation, such as when he caused Marasiah Fel to doubt the honesty of Antares Draco. When he later tortured Draco, he used his knowledge of his former student's vulnerabilities and used Force illusions to appeal to Draco's guilt over not having saved Empress Elliah Fel. He eventually got Draco to talk by making him believe that Marasiah's life was in danger, but continued to torture his subject even after receiving valuable information.\nEshkar Niin was a Master within the Imperial Knights, an organization that was said to be among the most talented and dangerous Force-users in the galaxy. The title of Master was reserved for its highest-ranking members. After he deserted the Order, however, he was bested by his former student Antares Draco during a confrontation and was believed to be dead.\nAs a Sith Lord, Darth Havok was able to use telekinesis to counter and overpower Marasiah Fel's own telekinetic exertion; she herself was a fully-trained Imperial Knight. He could also create Force lightning and used it to defeat Antares Draco, an Imperial Knight Master. Havok was proficient in the art of creating Force illusions, and employed them while torturing his subjects.\nDarth Havok was created by John Ostrander and Jan Duursema for the comic book series Star Wars: Legacy and first appeared in its forty-eighth issue.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Iktotchi/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_tattoo",
  "/wiki/Fel_Empire",
  "/wiki/Imperial_Knight",
  "/wiki/One_Sith",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Antares_Draco",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Human/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Rooftop_duel",
  "/wiki/Elliah_Fel",
  "/wiki/Death/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Sith_Inquisitor",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/The_galaxy/Legends",
  "/wiki/130_ABY",
  "/wiki/137_ABY",
  "/wiki/Sith/Legends",
  "/wiki/Marasiah_Fel",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Korriban",
  "/wiki/Torture/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Mission_to_Korriban_(Second_Imperial_Civil_War)",
  "/wiki/Time/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Empire-in-exile",
  "/wiki/Jedi/Legends",
  "/wiki/Hidden_Temple_(Sith%E2%80%93Imperial_War)",
  "/wiki/Taivas",
  "/wiki/Attack_on_the_Hidden_Temple",
  "/wiki/New_Jedi_Order",
  "/wiki/Battle_of_Coruscant_(Second_Imperial_Civil_War)",
  "/wiki/Darth_Krayt%27s_Sith_trooper",
  "/wiki/Army/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Darth_Nihl",
  "/wiki/Eshkar_Niin%27s_holocron",
  "/wiki/Holocron/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/City/Legends",
  "/wiki/Skyscraper/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Operation:_Thunderstroke",
  "/wiki/Agamar/Legends",
  "/wiki/Darth_Wyyrlok_(III)",
  "/wiki/Assassin/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Rulf_Yage",
  "/wiki/Regent/Legends",
  "/wiki/Morlish_Veed",
  "/wiki/Chambers_of_Persuasion",
  "/wiki/Force_lightning/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Ganner_Krieg",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Shado_Vao",
  "/wiki/Prince/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Transparisteel/Legends",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Mind_trick/Legends#Force_illusion",
  "/wiki/Darth_Talon",
  "/wiki/Cade_Skywalker",
  "/wiki/Fleet/Legends",
  "/wiki/Fever_wasp/Legends",
  "/wiki/Krayt_dragon/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Legacy_(2006)_48",
  "/wiki/Category:Images_of_Darth_Havok",
  "/wiki/Legacy_(2006)_26",
  "/wiki/Star_Wars:_Legacy:_Extremes",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Legacy%E2%80%94War_2",
  "/wiki/Legacy%E2%80%94War_3",
  "/wiki/Legacy%E2%80%94War_6",
  "/wiki/Legacy_(2006)_49",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Legacy_(2006)_50",
  "/wiki/Legacy_(2006)_1",
  "/wiki/Legacy_(2006)_31",
  "/wiki/Legacy_(2006)_34",
  "/wiki/Legacy%E2%80%94War_4",
  "/wiki/Legacy_(2006)_23",
  "/wiki/Star_Wars:_Legacy_0%C2%BD"
 ]
}