{
 "name": "Darth Shaar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Dark Council",
      "Sphere of Civil Administration",
      "Dark Council",
      "Sphere of Civil Administration"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Vowrawn"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Tarnux",
      "Darth Norok"
     ]
    }
   ]
  }
 ],
 "content": "Darth Shaar was a Sith female who was a Sith Lord of the Sith Empire during the Galactic War. A particularly passionate Sith, Shaar had a \"vigorous\" relationship with Lord Raxxus in her youth several decades before the Galactic War, though their relationship soured and the radical Sith was marked for death by the Dark Council before Raxxus was captured by the Jedi. During the invasion of Belsavis, Shaar learned that Raxxus was among the prisoners on Belsavis, and enlisted Imperial aid in eliminating her former lover.\nLord Shaar would continue her service to the Empire for several years, even surviving the Eternal Empire's invasion to the known galaxy. In that time, she became a Darth and operated freely within the Empire's civil administration.\nLord Shaar was a crafty and hedonistic individual who excelled at the game of Sith politics, knowing how not to appear threatening and maintaining many contradictory alliances until ready to strike. She liked to savor physical and experiential luxuries provided by her position in the civil administration.\nLord Shaar appears on Belsavis in the video game Star Wars: The Old Republic, where she provides Imperial players with the Heroic mission \"Old Enemies.\"\nDarth Shaar is voiced by Lucy Robinson.\nIn a 2018 State of the Galaxy article released by the game's developers, Lord Shaar was confirmed to have survived past the game's Knights of the Eternal Throne expansion.\nFor players that sided with the Republic on Iokath and killed Empress Darth Acina, Shaar is stated to have ascended to the Dark Council as an overseer of the Sphere of Production and Logistics and the Sphere of Law and Justice, replacing Darth Vowrawn who would have become Emperor under these circumstances. Alternatively, if Jace Malcom is killed in Acina's place, then Shaar remains a Lord of the Sith.\nIf the player supports the Republic in the Onslaught expansion, they will meet Shaar at the Huttbreaker's auction. In the aftermath of the Empire's attack on the Mek-Sha docks, Tau Idair notes that Shaar was missing and speculated that she either fled or was amongst the Imperial shuttles the Republic shot down.\nIf the player supports the Empire in the Onslaught expansion, Shaar will be the player's liaison throughout their operations on Mek-Sha. If Acina is the Empress, Shaar will be accompanied by Darth Vowrawn. If Vowrawn is Emperor, then Shaar alone will direct the Commander. If the player is a Saboteur for the opposing faction and sabotaged Shaar's plan to destroy the Republic fleet, the player can order Lana to kill Shaar  by decapitation.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Sphere_of_Civil_Administration",
  "/wiki/Darth_Vowrawn",
  "/wiki/Tarnux",
  "/wiki/Darth_Norok",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Galactic_War",
  "/wiki/Sith/Legends",
  "/wiki/Raxxus",
  "/wiki/Standard_decade/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Invasion_of_Belsavis",
  "/wiki/Prisoner/Legends",
  "/wiki/Belsavis/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/The_galaxy/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Iokath",
  "/wiki/Emperor/Legends",
  "/wiki/Darth_Acina",
  "/wiki/Sphere_of_Production_and_Logistics",
  "/wiki/Sphere_of_Laws_and_Justice",
  "/wiki/Jace_Malcom",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Huttbreaker",
  "/wiki/Mek-Sha",
  "/wiki/Tau_Idair",
  "/wiki/Lana_Beniko",
  "/wiki/Sai_cha/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith"
 ]
}