{
 "name": "Darth_Shaa",
 "display_name": "Darth Shaa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Prior to Darth Momin's destruction of a city"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Darth Momin"
     ]
    }
   ]
  }
 ],
 "content": "Darth Shaa was a female humanoid Sith Lady with the title of Darth. After hearing of a Force-sensitive sculptor named Momin who had been imprisoned by his people, Lady Shaa went to free him, and made him her apprentice. Eventually, she was slain by her apprentice. She carried two red Sith lightsabers.\nDarth Shaa was a female humanoid Sith who lived prior to the Sith Rule of Two doctrine, which was created by Darth Bane at the end of the Jedi-Sith War and the reformation of the Galactic Republic. She eventually became a Lady of the Sith and acquired the title of Darth, as well as two red Sith lightsabers. During her time, she heard tales of Momin, a Force-sensitive individual who was imprisoned for his creations. Shaa freed Momin, killing the guards and cutting through to his cell, taking him as her Sith apprentice. Over time, she trained Momin, who was able to learn much from her and also gained the title of Darth, constructing his own lightsabers. During Darth Momin's apprenticeship, he created the Mask of Lord Momin and mutilated his own face.\nAlthough under Darth Shaa's tutelage, Darth Momin was never able to understand why Lady Shaa called herself Momin's master while he was her apprentice. Momin knew that he would never be bold enough to call himself a master, but believed that being called an apprentice was reprehensible. Shaa disagreed, and during a lightsaber duel, Momin proved to Shaa that she was wrong, impaling her mid-air in the abdomen with one of his lightsabers and killing her.\nAfter Shaa's death, Darth Momin studied the lore of the dark side of the Force by visiting its many great sites. Through his studies, Momin realized that his audience was not the people of the galaxy, but rather the Force itself. Although Momin swore never to take an apprentice, he maintained a group of acolytes who helped him in his goals. Eventually, using resources he had inherited from Shaa, Momin created a superweapon to destroy a city, but was stopped by the Jedi Order. Momin's physical body was destroyed during the events, but his spirit remained in the mask.\nDarth Shaa was a female humanoid who eventually rose to become a lady. She had brown hair, black eyes, and grey skin. After hearing of Momin's abilities, she decided to seek him out and believed she could take him as her apprentice. But Shaa's faith in Momin ultimately proved to be her undoing: finding the role of apprentice distasteful, Momin killed Shaa by impaling her with one of his lightsabers.\nDarth Shaa was able to effectively use a pair of lightsabers in combat, using a reverse grip on one hand while using a standard grip on the other at times. Shaa was able to duel with Momin for a time, but was not able to foresee that he would take the opportunity to murder her during the duel. Shaa had a great knowledge of the Force and its dark side, and was able to pass on that knowledge to Momin.\nDarth Shaa utilized a pair of red Sith lightsabers and a helmet that concealed her face. She also used an outfit that donned spikes and a cape.\nDarth Shaa debuted in the 2018 canon comic Darth Vader  22 in a flashback. The comic was written by Charles Soule and illustrated by Giuseppe Camuncoli. She was identified as Darth Shaa in the 2020 reference book The Star Wars Book.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Shaa_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Darth_Shaa",
  "/wiki/Darth_Momin%27s_destruction_of_a_city",
  "/wiki/Humanoid",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sith",
  "/wiki/Darth_Momin",
  "/wiki/Anakin_Skywalker",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/Force-sensitive",
  "/wiki/Sculptor",
  "/wiki/Lord",
  "/wiki/Death",
  "/wiki/Darth_Shaa%27s_lightsabers",
  "/wiki/Rule_of_Two",
  "/wiki/Darth_Bane",
  "/wiki/Jedi-Sith_War",
  "/wiki/Galactic_Republic",
  "/wiki/Sith_lightsaber",
  "/wiki/Time",
  "/wiki/Prisoner",
  "/wiki/Sith_apprentice",
  "/wiki/Darth_Momin%27s_lightsabers",
  "/wiki/Mask_of_Lord_Momin",
  "/wiki/Sith_Master",
  "/wiki/Lightsaber_duel",
  "/wiki/The_galaxy",
  "/wiki/Darth_Momin%27s_acolytes",
  "/wiki/Darth_Momin%27s_superweapon",
  "/wiki/Unidentified_city_(Momin)",
  "/wiki/Jedi_Order",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Limb",
  "/wiki/Helmet",
  "/wiki/Cape",
  "/wiki/2018",
  "/wiki/Darth_Vader_(2017)_22",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/2020",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_The_Bogan_Collection"
 ]
}