{
 "name": "Darth_Vindican",
 "display_name": "Darth Vindican",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3681 BBY",
      "space station above Korriban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Ikoral"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Darth Malgus"
     ]
    }
   ]
  }
 ],
 "content": "Darth Vindican was a male Pureblood Sith Lord who served the Sith Empire in the early days of the Great Galactic War. Having been trained in the dark side of the Force by the conservative Darth Ikoral, Vindican advanced to the rank of Sith Master and took an apprentice of his own—the young Human Malgus. In 3681 BBY, Vindican and Malgus joined an armada of Imperial battlecruisers to retake the planet Korriban from the Galactic Republic and the Jedi. After they engaged the small Republic force over Korriban, the Sith Master and Malgus boarded a shuttle, docked with the Republic's space station orbiting Korriban, and attacked two Jedi defenders—a Zabrak Master and his Human apprentice. The Jedi Master incapacitated his Sith counterpart, but Malgus soon killed the Zabrak Jedi before he murdered his injured master.\nDarth Vindican was a male Sith Pureblood who lived during the era of the Sith Empire's return to the galaxy. Vindican was trained in the dark side of the Force by his Sith Master, the legendary Sith hero, Darth Ikoral, and was widely believed to be the Lord's greatest student. Around 3712 BBY, Ikoral, a firm believer in the superiority of the Sith species, led an expedition into the Unknown Regions to find any surviving colonies of Purebloods. Now master-less, Vindican advanced to the level of Sith Lord and took an apprentice of his own—the young and talented Human Malgus. The two served the Sith Empire during the early years of the Great Galactic War, and in 3681 BBY, the Sith Master and his apprentice joined the Empire's campaign to retake the planet Korriban, which had been under Republic and Jedi control. An armada of thirty Imperial battlecruisers, including Vindican and Malgus, jumped to Korriban space and engaged the small Republic force stationed there.\nVindican and Malgus detached from the Imperial fleet and boarded a shuttle to dock with the Republic's space station orbiting Korriban. After they landed in a hangar on the station, the Sith Master, flanked by Malgus, spotted two Jedi—a Zabrak Jedi Master, Kao Cen Darach, and his Human Padawan, Satele Shan—and confronted them. With his double-bladed lightsaber, Vindican attacked his Jedi counterpart, while Malgus fought Shan. The Sith Master advanced against Darach, whom he engaged in a swift flurry of swordplay before he unleashed a volley of Force lightning at Shan. After he was Force-pushed across the hangar by the Jedi Master, Vindican blasted lightning at an escaping smuggler's freighter—the vessel in which the Jedi intended to escape the station.\nShan boarded the departing freighter and left her master behind to fight Vindican and Malgus alone. The Sith Master engaged Darach once again, in an attack coordinated with the flanking Malgus. When the Sith Master unleashed lightning at the Zabrak, Darach deflected it with his and Shan's lightsaber toward Malgus. Darach's two lightsabers also struck the right side of Sith Master's head, which lifted his helmet off his face and left a scar over his right eye. Vindican was incapacitated when Darach activated one of the ends of Shan's double-bladed weapon through the Sith's abdomen. The Sith Master's fallen double-bladed weapon was taken by Malgus, who engaged and killed Darach with it. After Malgus returned to Vindican, he exchanged words with him, before executing him.\nThe aggressive Vindican had red skin and yellow eyes. He wore black-colored robes and a mask that covered his face. When the Pureblood Sith did not stop Darach's apprentice from leaving the station, his apprentice, Malgus, regarded him as a failure; however, Vindican believed that it was only the beginning of the Sith's reemergence. Before the Sith Master was killed, he was welcomed home by Malgus, since Korriban was the ancient homeworld of the Sith.\nVindican was a Sith Master, Lord, and Inquisitor. He was skilled in the art of lightsaber combat and used a double-bladed weapon during his fight with Darach in the Republic's Korriban space station. With his lightsaber, Vindican was also able to deflect a missile that was launched from a trooper's missile launcher. However, during their fight, the Sith Master failed to see Darach's deactivated blade end which was pointed at his midsection. When the Jedi activated it, the lightsaber's blade stabbed Vindican.\nVindican first appeared as an unidentified Pureblood Sith in Return, a cinematic trailer for the video game Star Wars: The Old Republic that was released on June 6, 2011. A few months after the trailer's release, Vindican received his name in an article that was published in The Old Republic's official website on August 12, 2011. He was later confirmed to hold the title of Darth in an article published over 10 years later, on February 4, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/3681_BBY",
  "/wiki/Korriban%27s_orbital_security_station",
  "/wiki/Korriban",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Darth_Ikoral",
  "/wiki/Darth_Malgus",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Human/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Harrower-class_dreadnought",
  "/wiki/Battle_of_Korriban",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Fury-class_Imperial_interceptor",
  "/wiki/Orbit/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Kao_Cen_Darach",
  "/wiki/Satele_Shan",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Death/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Return_(cinematic_trailer)",
  "/wiki/Darth/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sith_training",
  "/wiki/3712_BBY",
  "/wiki/Darth_Ikoral%27s_expedition",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Nico_Okarr",
  "/wiki/XS_stock_light_freighter/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Tutaminis",
  "/wiki/Lightsaber/Legends",
  "/wiki/Shiim/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Shiak",
  "/wiki/Homeworld/Legends",
  "/wiki/Sith_Inquisitor",
  "/wiki/Missile/Legends",
  "/wiki/Jace_Malcom",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Video_game",
  "/wiki/June_6",
  "/wiki/2011",
  "/wiki/August_12",
  "/wiki/February_4",
  "/wiki/2022",
  "/wiki/Category:Images_of_Darth_Vindican",
  "/wiki/Cartel_Market",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Timeline_6:_Onslaught_of_the_Sith_Empire",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/The_Old_Republic:_Deceived",
  "/wiki/The_Essential_Atlas",
  "/wiki/Hope_(cinematic_trailer)",
  "/wiki/Deceived"
 ]
}