{
 "name": "Darth_Lachris",
 "display_name": "Darth Lachris",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3642 BBY",
      "Balmorra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireSith OrderSphere of Defense of the Empire",
      "Sith Order",
      "Sphere of Defense of the Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Marr"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Lerek Serrus"
     ]
    }
   ]
  }
 ],
 "content": "Darth Lachris was a Human female Sith Lord who served the Sith Empire during the Cold War and the Galactic War against the Galactic Republic. A former apprentice of the Dark Council member Darth Marr, Darth Lachris was appointed Governor of Balmorra after executing her predecessor, the inept Lysennius Melchiro, and tasked with quashing a rebel insurgency led by Grand Marshal Cheketta.\nWhen a Jedi Consular, the Barsen'thor, came to liberate Balmorra, Lachris was robbed of her apprentice, Lerek Serrus, and was eventually killed by the Jedi and a Balmorran resistance member, Zenith.\nDuring the outbreak of the Great Galactic War, a war which was fought between the Sith Empire and the Galactic Republic, Lachris was a talented fighter in the dark side and became an apprentice of Darth Marr, member of the Dark Council. She finally received the title of Darth and rose to become a powerful Sith Lord.\nIn 3653 BBY, Lachris was part of the invasion force of the Sith Empire that attacked Coruscant, the capital planet of the Republic. Following the Treaty of Coruscant, Darth Lachris took Lerek Serrus as her first apprentice during the galaxy-wide conflict, known as the Cold War that raged on for ten years.\nDuring the war, Darth Lachris and her apprentice led their Imperial forces on Balmorra under the rule of the Dark Council. After she executed her predecessor, she appointed herself as the local commander in chief. This was where many Balmorrans formed a resistance to strike against Lachris and her Imperial forces.\nAs the Sith Empire had reached the world in progress in 3643 BBY, Lachris decided to personally visit and travel to the Sundari flat land, where there was the advanced command base of the Sith Empire. She was informed that Grand Marshal Cheketta had sent a number of Jedi reinforcements to support the resistance. She tasked an Imperial strike team to shut down the barricades from the Balmorran Arms Factory and find solid evidence of official involvement by the Republic. As the Imperials managed to infiltrate the Imperial factory and defeat the Jedi Ralon Nys along with his Tempest-squad commandos, Lachris sent the Imperials to meet the Grand Marshal. As the last remnants of the resistance formed an army, Lachris tasked the Imperial strike team to break the remaining resistance. The mission was successful and Darth Lachris took control of the world.\nThe following year, Lachris managed to capture the Balmorran President Retheus Galthe to intimidate the Balmorran Resistance. However, this was when Tai Cordan and Agent Zenith were able to penetrate a weapons factory, where it was assumed that Lachris held the president. Lachris was aware of the presence of the Jedi and made sure that Galthe remained frozen in carbonite. In the processing room 59, Lachris encountered the Barsen'thor who allied with Zenith stop the Sith Lord's rule. During the fight, she deflected every blaster shot from Zenith and fought against Barsen'thor in a lightsaber duel. However, the Jedi Consular took the upper hand and Lachris was badly wounded. Saying her last words, Lachris died from her injuries. With the death of the Sith Lord, Tai Cordan became the new president of Balmorra.\nDarth Lachris initially appears during the bonus arc on Balmorra, and is a flirtation option for all male Imperial characters, even developing into the option to kiss her after defeating Cheketta. In addition, Imperial players can choose the light side option of speaking up while Lachris is strangling Governor Melchiro, sparing the governor's life.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3642_BBY",
  "/wiki/Balmorra/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Order_(Sith_Empire)",
  "/wiki/Sphere_of_Defense_of_the_Empire",
  "/wiki/Darth_Marr",
  "/wiki/Lerek_Serrus",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dark_Council",
  "/wiki/Lysennius_Melchiro",
  "/wiki/Cheketta",
  "/wiki/Jedi_Consular",
  "/wiki/The_Barsen%27thor",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Balmorran_resistance",
  "/wiki/Zenith",
  "/wiki/Great_Galactic_War",
  "/wiki/3653_BBY",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Coruscant/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Standard_year/Legends",
  "/wiki/3643_BBY",
  "/wiki/Balmorran_Arms_Factory",
  "/wiki/Ralon_Nys",
  "/wiki/Retheus_Galthe",
  "/wiki/Tai_Cordan",
  "/wiki/Lightsaber/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/The_Price_of_Power",
  "/wiki/The_Sixth_Line",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}