{
 "name": "Darth_Wyyrlok_(II)",
 "display_name": "Darth Wyyrlok  (II)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chagrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red with black tattoos"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "One Sith"
     ]
    }
   ]
  }
 ],
 "content": "Darth Wyyrlok was a female Chagrian who served the Sith Lord Darth Krayt as a Sith Master. She became Krayt's closest advisor sometime after 41 ABY, following in the footsteps of her father, who had also been called Darth Wyyrlok. She additionally acted as Krayt's voice and the Regent of his Sith order while he rested in stasis. Wyyrlok eventually mothered a son, who assumed her name and duties before 130 ABY.\nThe female Chagrian Darth Wyyrlok served the Sith Lord Darth Krayt as a Sith Master of his One Sith. Her father was also called Darth Wyyrlok and was Krayt's top lieutenant and closest advisor as early as 41 ABY. His duties were eventually passed down to his daughter, who became Krayt's most trusted advisor and acted as the guardian of the One Sith while her Master rested in stasis. The Sith remained hidden on the planet Korriban for a century, and as Krayt's order and his plans to conquer the galaxy developed and grew, he often retired to stasis for years at a time. Like her father before her, Wyyrlok became Krayt's voice and the Regent of the One Sith during these periods. She had a son at some point, and after she passed away he assumed her name and responsibilities. The third Darth Wyyrlok was serving Darth Krayt by 130 ABY when Krayt seized control of the galaxy.\nDarth Wyyrlok was a Sith Master of the One Sith, an organization of Force-users deeply immersed in the dark side of the Force. Darth Krayt placed great faith in her ability to lead the Sith in his absence, appointing her as his voice and the Regent of the order while he rested in stasis.\nDarth Wyyrlok was created by John Ostrander and Jan Duursema, the architects of the comic series Star Wars: Legacy. She was first indirectly mentioned in the 2006 preview comic Legacy  0, which noted that her son was the third Sith to take the name Darth Wyyrlok. Her first direct mention occurred in 2007, when Legacy's fourteenth issue established that she was the mother of the third Darth Wyyrlok. 2010 brought her first visual depiction in a flashback scene in the first issue of Legacy's followup miniseries, Star Wars: Legacy—War. While designing the character's look, Duursema consulted with fellow artist Douglas Wheatley, who was also penciling female Chagrian characters for the comic series Star Wars: Dark Times.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Darth_Wyyrlok",
  "/wiki/Chagrian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_tattoo",
  "/wiki/One_Sith",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Sith_Master/Legends",
  "/wiki/41_ABY",
  "/wiki/Parent/Legends",
  "/wiki/Darth_Wyyrlok_(I)",
  "/wiki/Voice",
  "/wiki/Regent/Legends",
  "/wiki/Suspended_animation/Legends",
  "/wiki/Darth_Wyyrlok_(III)",
  "/wiki/130_ABY",
  "/wiki/Darth/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Korriban",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/2006",
  "/wiki/Legacy_(2006)_0",
  "/wiki/2007",
  "/wiki/Legacy_(2006)_14",
  "/wiki/2010",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Star_Wars:_Legacy%E2%80%94War",
  "/wiki/Douglas_Wheatley",
  "/wiki/Star_Wars:_Dark_Times",
  "/wiki/Legacy_(2006)_30",
  "/wiki/Legacy_(2006)_31",
  "/wiki/Legacy_(2006)_34",
  "/wiki/Star_Wars_Insider",
  "/wiki/Legacies_of_Future_Orders",
  "/wiki/Star_Wars_Insider_88",
  "/wiki/Legacy_(2006)_0%C2%BD",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/138_ABY",
  "/wiki/Crosscurrent",
  "/wiki/Legacy_(2006)_18",
  "/wiki/Legacy_(2006)_1",
  "/wiki/Jedi_Council_Forums",
  "/wiki/February_3",
  "/wiki/2013"
 ]
}