{
 "name": "Darth_Sidious",
 "display_name": "Darth Sidious",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "82 BBY",
      "Naboo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Death Star II",
      "Endor system",
      "35 ABY",
      "Exegol"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.73/1.78 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "75 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red",
      "later white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue",
      "yellow",
      "white"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light",
      "later pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Ommin harness"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Palpatine family",
      "Sith",
      "Royal House of Naboo",
      "Galactic Republic",
      "Naboo delegation",
      "Office of the Chancellor",
      "Naboo delegation",
      "Office of the Chancellor",
      "Trade Federation",
      "Confederacy of Independent Systems",
      "Galactic Empire",
      "Sith Eternal",
      "First Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Plagueis"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Wilhuff Tarkin",
      "Darth Maul",
      "Darth Tyranus",
      "Gallius Rax",
      "Darth Vader",
      "Inquisitorius",
      "Snoke",
      "Kylo Ren",
      "Kylo Ren"
     ]
    }
   ]
  }
 ],
 "content": "Darth Sidious, born Sheev Palpatine and also known simply as the Emperor, was a human male Dark Lord of the Sith and Emperor of the Galactic Empire, ruling from 19 BBY to 4 ABY. Rising to power in the Galactic Senate as the senator of Naboo, the secretive Sith Lord cultivated two identities, Sidious and Palpatine, using both to further his political career and deceive his way into accomplishing his goal. He orchestrated the fall of the Galactic Republic and the Jedi Order through the Clone Wars, and then established his reign over the galaxy which lasted until his death at the Battle of Endor. However, the dark side of the Force gave rise to powers which allowed the Emperor to return from the grave.\nBorn on the Mid Rim planet Naboo in 82 BBY during the Republic Era, Sidious possessed a strong connection to the Force, and was secretly trained in the ways of the Sith by Darth Plagueis. He eventually betrayed and killed his Sith Master, in order to train his own Sith apprentice, Darth Maul, for the Rule of Two limited their ranks to two Sith Lords at any given time. As a result of the Invasion of Naboo, a crisis orchestrated by Sidious, the Senate elected Palpatine as Supreme Chancellor. The Separatist Crisis and the Clone Wars were masterminded by Sidious and his new apprentice, Darth Tyranus, in an effort to achieve galactic dominance. Following an attempt to arrest the chancellor, the Great Jedi Purge commenced with Sidious enacting Order 66.\nWith the Jedi all but extinct, Sidious installed the New Order in the Republic's place, declaring himself Galactic Emperor and bringing an end to millenia of democracy. Not too long after betraying and causing the death of Tyranus, he took on a new apprentice, having lured the Jedi Knight Anakin Skywalker to the dark side and transforming him into Darth Vader. Their reign was virtually unchallenged for a generation until the formation of the Alliance to Restore the Republic. During the Galactic Civil War, the Emperor sought to betray Vader, by replacing him with the latter's son, Luke Skywalker. However, Sidious' plan backfired when Vader ultimately renounced the dark side and killed Sidious to protect Luke. Thus, with the Sith's destruction, the Force was brought back into balance, fulfilling Anakin's destiny as the prophesied Chosen One.\nThrough his master's teachings, however, Sidious transferred his essence to an imperfect clone vessel that had been modeled on his original body. Anticipating the possibility of defeat, he created the Contingency to destroy the Galactic Empire and replace it with a new Sith Empire, in the event of such a setback. His plans culminated in the destruction of the New Republic and the emergence of the First Order, the creation of Supreme Leader Snoke, who turned Ben Solo—heir to the Skywalker bloodline—to the dark side, and the establishment of the Final Order. When the Emperor announced his return to the galaxy in 35 ABY, the Resistance invaded the planet Exegol, Sidious' hidden stronghold in the Unknown Regions. During the battle, he discovered a dyad in the Force in the form of the bond between Solo and Rey, a Jedi apprentice sired from the Emperor's bloodline. His lifelong dream of eternal rule was finally quashed when Rey called upon the strength of past Jedi to vanquish her grandfather by turning his own power against him, destroying Sidious and his Sith Eternal cultists.\nThe origins of Darth Sidious were closely guarded secrets that he took to his grave more than once. He was born on the Mid Rim planet Naboo as Sheev Palpatine, eighty-two years before the Battle of Yavin. The noble Palpatine family belonged to the affluent class in Naboo society, although by the time of the Imperial Era Palpatine did not have a family as far as the public was aware. Palpatine was raised in the cultured city of Theed, his homeworld's capital; he formed connections with a reputable host of credible politicians produced over the centuries, all the while acquiring a great amount of knowledge on governance and the subtleties of power during his youth. As such, Palpatine had been skilled in manipulation since boyhood.\nThe details about how Sidious came to study under the Sith were known by very few, with it not even being known of when he did, but he became the Sith apprentice to Dark Lord of the Sith Darth Plagueis and took on the name Darth Sidious. As a Sith Lord, Sidious learned all his Sith Master knew about the dark side of the Force, following the tradition first set by the ancient Darth Bane. While apprenticed to Plagueis, Sidious constructed his own Sith lightsabers. At the same time, little by little, he began to secure political power.\nAs a young man, Palpatine had traveled throughout the galaxy, collecting art, at least some of which was connected to the dark side, while doing so. Unaware docents would have written off his collection as junk, but Palpatine knew better. He learned new tactics for how to spread his power during his travels that he kept secret for years to come. While training with Plagueis, Sidious was taught that two Sith were required for their perilous machinations. So, if they worked together in accordance to Darth Bane's Rule of Two, with one of them serving as bait for the dark side of the Force and the other as a vessel, they would succeed in acquiring the ability to harness the full power of the dark side and rule immortal for ten thousand years.\nDarth Sidious and Darth Plagueis worked together for years, trying to unlock the secrets to immortality, which was the obsession and longtime lust of Plagueis. Sidious was eventually made aware of Plagueis' ability to manipulate the midi-chlorians to create life, which his master employed to prevent the people he cared for from dying. Plagueis believed the secret to immortality laid within science, and so conducted \"unnatural\" experiments with his rare ability to manipulate the midi-chlorians, as part of the pair's in depth studies into the biological underpinnings of life itself. Though they were incomplete, they were encouraging to Sidious. According to Darth Sidious' book, The Secrets of the Sith, written later on his life, Plagueis discovered a form of \"immortality\" through transference, a Force power that allowed the user to transfer his consciousness to another body, essentially using bodies as vessels.\" This obsession with extending one's own life later passed onto Sidious from his time as Galactic Emperor. Plagueis also attempted to create a Force dyad with Sidious, a unique Force-bond as strong as life itself and which was predecessor to the Rule of Two. However, Plagueis was unable to form the dyad.\nIn his public persona as Sheev Palpatine, his embarkment on a career in politics was aided by his master, who raised him to the position of senator for his homeworld in the Galactic Republic Senate. Additionally, his role made him the senator for the rest of the Chommell sector, meaning he represented a total of thirty-six planets. It was Plagueis that had arranged for his apprentice to become the Senator of Naboo and the rest of the Chommell sector. Once elected, the representative for Naboo quickly joined incumbent Supreme Chancellor Skor Kalpana's ruling party, and noticed the fervent bickering and corruption that mired the Republic. He began to establish relations with those who would become his future collaborators, such as Wilhuff Tarkin. The duo met for the first time when Tarkin was still a cadet of the Sullust Sector Spacefarers Academy, and while Palpatine was still apprenticed to Plagueis.\nTaking an interest in the younger man, Senator Palpatine resolved to help him to join the Judicial Department, according to Tarkin's desire but advised him to also consider a political career. In the following years, their relationship became more and more confidential. Palpatine often lauded Tarkin for his talents and skills and remarked they were very similar: they both came from planets at the edge of the galaxy but were destined to have great repercussions on the history of the galaxy itself. Tarkin eventually became one of the few people who called Palpatine by his first name.\nKeeping his Sith identity a secret from the public eye, Sidious took it upon himself to execute the Sith's long-percolating plan of supplanting the Republic with a new Sith Empire, as well as destroying the Jedi Order. In the process, he would deceive the Senate, Republic and Jedi.\nSeeking a Sith apprentice, Sidious traveled to the planet Dathomir and met with the Dathomirian Nightsister Mother Talzin. Intermingling his knowledge of the dark side of the Force with Talzin's knowledge of Nightsister magicks, Sidious had considered to make Talzin his apprentice and right hand. However, Sidious chose her infant son, the Zabrak Nightbrother who would become his true Sith apprentice, Darth Maul. When Sidious visited Talzin, Maul always hid in his room, afraid of the man and worried about Talzin's increasing bond with him. Sidious was drawn to Maul for his inability to control his anger. Eventually, Sidious ordered Talzin to give up Maul to a keeper, threatening to not follow through on his promise to make her his apprentice. She reluctantly agreed, and Maul ran into the forest angrily, overhearing the conversation from behind his door. When he returned the next morning, a Nightbrother took him and threw him in a pit, not allowing him to say goodbye to his own mother.\nOver the course of months, Maul was put through relentless domestic abuse, all orchestrated by Sidious as a test. With the influence of his Keeper's sons beating him and the abuse, Sidious' wish for Maul came true; Maul's perceptions, and his love for his mother eventually turned into resentment and hatred for abandoning him. Maul's hatred started manifesting through the Dark Side, and he would practice using the Dark Side of the Force every chance he got; eventually, the two brothers stopped beating him after seeing that their provocations were no longer affecting him. Sidious eventually orchestrated a selection to gain himself an apprentice. At the Selection Arena, Sidious witnessed Maul after he was initially prevented from participating. In a sudden burst of anger, he used the Dark Side of the Force to Force-choke the two brothers, and then the keeper, all in front of Sidious and Talzin. Beyond pleased at Maul's progress and potential, Sidious declared Maul the winner and his new apprentice, much to Talzin's dismay.\nAs such, instead of following through on his promise of giving the apprenticeship to Talzin, Sidious stole her son from her and left Dathomir, leaving the Nightsister longing for revenge against the Sith Lord. However, by taking Maul under his wing, the Rule of Two had been violated, as it demanded only two Sith. Following the traditions set forth by the Rule of Two and deciding that Plagueis had outlived his usefulness, Sidious betrayed his master by breaking into his apartment and murdering him in his sleep. Sidious remembered with fondness the moment he realized he was more powerful than Plagueis and could kill the man who had trained him. He later reflected that \"Master\" was the first title of power he claimed for himself. Now the Sith Master himself, Sidious brutally trained Maul to be a weapon of the Sith, viewing Maul's prowess and combat abilities as an invaluable asset to his Grand Plan.\nIn 42 BBY, Palpatine was introduced to Dooku, a Jedi, by the latter's former Padawan Rael Averross, after the Jedi Master delivered an address to the Galactic Senate on Coruscant. Following the invasion of Serenno, Dooku left the Jedi Order to claim the title of planetary count, but Sidious eventually recruited Dooku to the Sith by exploiting his anger with the Republic despite also having Maul under his wing. Indeed, Dooku would not yet become a Sith apprentice. To fulfill Sidious's plans, Dooku betrayed and orchestrated the death of Jedi Master Sifo-Dyas and took over his clientele for the commission of a clone army produced on Kamino; the event was subsequently covered up when Dooku erased all records of Kamino from the Jedi Archives.\nIn need of pawns for his plans but preferring a mysterious, hooded presence through holographic transmissions rather than direct communication, Sidious contacted the galaxy's most powerful beings and convinced them to do his bidding with promises and threats. To that end, Sidious was also able to manipulate Nute Gunray's rise to the position of Viceroy of the Trade Federation and convinced the Trade Federation to obey him by promising wealth. Ordering the Federation to construct a droid army, Sidious also helped the Geonosian Poggle the Lesser rise to the position of Archduke of Geonosis and controller of their droid foundries. With Sidious's backing, Poggle produced millions of B1-series battle droids for the Trade Federation military.\nSidious, as Palpatine, moved to seize power from Supreme Chancellor Finis Valorum, who had virtually no political power and counted Palpatine as a close friend and ally, allowing for Sidious to easily manipulate him. In the Senate, Sidious secretly ensured that the Senate repeatedly battled over bills concerning taxation, bringing about voting sessions that ended in both Federation defeats and victories, while Gunray falsely believed Sidious was working towards Federation victories all the time. Following a discussion in his office about the latest version of the bill, Valorum requested Palpatine to stay behind and confided in him that he was considering having a Jedi step in to serve as an independent moderator, which Palpatine appeared to be surprised by before requesting he hold off on that option for the time being. Moving up his plans upon being told of the summit on Naboo that threatened to strengthen the sector, Sidious used holographic communication to order Gunray to blockade the planet Naboo, making it seem as though it was in protest of the Senate's taxation of trade routes to outlying star systems. Eventually, driven to desperation by the inactivity of the Senate, Valorum secretly dispatched two Jedi Knights—Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi—as ambassadors to negotiate with the Trade Federation's Neimoidian leaders.\nWith Sidious pleasantly surprised at the ingenuity the Geonosians had shown in creating the Federation's battle droid army, the Trade Federation initiated the Invasion of Naboo on the orders of Sidious, who also instructed Gunray to kill Chancellor Valorum's Jedi ambassadors. When Gunray questioned the legality of the invasion, Sidious simply stated that he would make it legal. The Neimoidians acted accordingly, but the Jedi survived the assassination attempt and escaped the Federation ship. After Sidious terminated his communication with Gunray, Queen Padmé Amidala contacted him concerning the Federation's denial that the Chancellor had sent ambassadors to speak with them as promised. Sidious, as Palpatine, feigned concern at this supposed revelation, but was cut off mid-sentence by the Trade Federation's communication blackout, notifying the Naboo to their invasion.\nThe Federation's droid army proceeded with their assault. Within a day, the army occupied the planet's capital city and its surrounding regions. Additionally, Amidala and her retinue were captured and presented with a treaty that would bring an air of legitimacy to their invasion. However, the Jedi arrived to rescue them, and they successfully evaded the blockade aboard the queen's starship.\nWhen Gunray informed Sidious of Amidala's failure to sign the treaty, the livid Sith Lord introduced them to Darth Maul, whom he dispatched to find and recapture Amidala. Due to Amidala's ship sustaining damage in the escape, the queen opted to land on Tatooine, an obscure desert world in the Outer Rim Territories, to repair the ship. Maul managed to ascertain the queen's location, and assured his master that his search on the sparsely populated world would be a short one. Sidious told him to move against the Jedi first, and then take the queen once they were dead. Maul left for Tatooine, but he failed to kill the Jedi or retrieve Amidala. Sidious knew she would come to Coruscant if Maul failed.\nWhile waiting for Amidala to reach Coruscant, Sidious found he had little to do, although he made sure to go to the Senate to vote on its current matters, even though he did not care for them. With nothing else to do, Palpatine took to looking through his catalogue of art, having run out of space in his office to store the rest of his collection. He stopped his scrolling when he saw a black statue known as the Yonta Prime, which, despite being one of his favorite pieces, he found he could not fit into his office without looking careless. He resolved to take it out of storage, ordering it to be taken to his apartment, so he could place it into the Supreme Chancellor's office when his current plan had finished.\nDespite these setbacks, Palpatine was able to convene with Amidala on Coruscant, where she intended to plead her case to Chancellor Valorum before the Galactic Senate. Bringing Amidala to his apartment for an audience, Palpatine told the queen that the senate was long past caring about the common good, while Valorum was essentially powerless against them. With both the Senate and Valorum closed off to her as options, Palpatine offered her two choices: she could move for a Vote of No Confidence in Chancellor Valorum, and push for the election of a more effective leader; or she could take the matter to the courts, which would take even longer. Hoping still to reach some resolution to the matter in the Senate, Amidala opted to attend the special session of the body the next day.\nDuring the awaited Senate session, Amidala attempted to make her case for Republic intervention to stop the Trade Federation's occupation of her world. However, the Federation representative Lott Dod fervently objected to the \"accusations\" levied against the Federation, citing that there was no proof that an invasion or occupation had even occurred. He recommended that a commission be sent to Naboo to ascertain the truth of the situation, a motion that was seconded by the Senator from Malastare, Aks Moe. Vice Chair Mas Amedda conferred quietly with Valorum for a few moments, and Palpatine took the opportunity to predict that the Chancellor, shackled to Senatorial procedure at the behest of bureaucrats who were more than likely on the payroll of the Federation, would fail to help Naboo. When Valorum reluctantly admitted that the Federation was within their rights to request a commission, an outraged Amidala realized that Palpatine was right; Valorum was too weak and ineffectual to provide her world with the help it needed. As such, she took Palpatine's advice and publicly moved for a Vote of No Confidence in the Chancellor. Within moments, hundreds of Senators began demanding for an immediate vote, leaving Valorum thunderstruck.\nThe sudden power vacuum led to Palpatine's nomination as Supreme Chancellor alongside Bail Antilles of Alderaan and Ainlee Teem of Malastare. When he announced his nomination to Amidala, however, the queen declared her intention to return to Naboo and reclaim it from the Trade Federation by whatever means she could. Palpatine made a show of concern and tried halfheartedly to convince her to stay on Coruscant. She left regardless, taking both Jinn and Kenobi with her for protection and wishing Palpatine success in the election.\nSidious contacted the Neimoidians on Naboo, instructing them to kill Amidala upon arrival, and sent Maul to accompany them with orders to make certain the Neimoidians killed the queen, and that the Jedi fell by his own hand. Even while he managed the election on Coruscant, he made time to go over the Neimoidians' progress. Against his expectations, he learned that Amidala not only managed to escape Gunray's reach but also forged an alliance with the Gungans and assembled an army in the planet swamp in preparation for a strike against the Federation occupation force. He doubted she would last even five minutes in such a contest, and gave his approval to Gunray's plan to meet the Gungans head-on.\nUltimately, Palpatine won the election for Supreme Chancellor. However, the Federation army was defeated, Gunray was captured by Amidala's forces, and Maul met his presumed death at the hands of the Jedi Obi-Wan Kenobi, though not before striking down Qui-Gon Jinn, whose funeral Palpatine would later attend. Palpatine also learned that the Naboo owed their victory to the unexpected intervention of Anakin Skywalker, a young, freed slave from Tatooine who was highly attuned to the Force, fueling the belief that he was the Chosen One of Jedi prophecy who would bring balance to the Force. After much debate, the Jedi Council decided that Skywalker would be apprenticed to Kenobi as a Jedi. Palpatine personally congratulated the two Jedi during the celebration on Naboo, telling young Skywalker that his career would be watched with \"great interest.\"\nOver the next ten years, Supreme Chancellor Palpatine amassed a favorable reputation as a mild-mannered servant of the common good, and the public remained oblivious to his true, insidious persona. As Anakin Skywalker grew older, his relationship with Palpatine deepened; on many occasions, Palpatine lauded Skywalker as the most gifted Jedi he had ever encountered, one who would surpass even Yoda, the Grand Master of the Jedi Council. Skywalker, who grew increasingly frustrated with the strict lifestyle of the Jedi under his master Kenobi's guidance, appreciated Palpatine's praise and greatly took to his counsel. In truth, this was all part of Sidious' plan to gain Skywalker's trust and groom him into his eventual Sith apprentice.\nHowever, Sidious was well aware that his plan to turn Skywalker to the dark side could not bear fruit for many years to come, and with Maul presumed dead, Sidious needed an apprentice in the interim. As such, he turned to Dooku to fill that role, making the former Jedi his interim apprentice under the name Darth Tyranus. Sidious and Tyranus gained control of a Behavioral modification biochip that Sifo-Dyas wanted instilled in each clone as a safeguard against rogue Jedi, and the two then retooled the chip for Sidious's purpose. Subsequently, bounty hunter Jango Fett was hired as the genetic template for the clone army on Kamino, and the clones were fitted with the Sith's retooled biochip, the latter containing a protocol that would ensure their total obedience to Sidious when the time came for it.\nIn 30 BBY, Sidious and his Adviser Yupe Tashu traveled to the barren Inner Rim planet of Jakku, which lay at the edge of the Unknown Regions. After landing his yacht Imperialis in the Plaintive Hand plateau, Tashu ordered a detachment of six droids to begin excavating. The yacht soon left off-world but a local twelve-year-old boy named Galli sneaked aboard the Imperialis. Sidious sensed his presence and gave the boy the choice of dying or serving him. Sidious then instructed Galli to return to the excavation site and guard it against any intruders. He stressed that intruders should not be allowed to taint the site and ordered Galli to kill them. Sidious then introduced himself on a first-name basis as Sheev.\nFor the next ten years, Galli guarded the Plaintive Hand excavation site. In 20 BBY, Sidious returned and invited the boy aboard the Imperialis this time as a guest of honor. By that stage, work on the Jakku Observatory had been completed. Using a game of Shah-tezh as an illustration, Sidious explained that his future Galactic Empire could not be allowed to outlive its Emperor should he die prematurely. To demonstrate his seriousness, Sidious Force choked Galli. He tasked Galli with executing his secret Contingency plan and inducted the boy into Imperial service. Galli subsequently joined the Naval Intelligence Agency as a commander and adopted the name Gallius Rax.\nAs Anakin Skywalker grew older, the relationship between Palpatine and the young Jedi greatly deepened. On many occasions, the Chancellor attended the boy's training at the Jedi Temple expressing appreciation for the progress reached by the young Padawan in lightsaber combat. He could notice that he was deeply conditioned by his emotions and he asked Master Mace Windu to send Skywalker to him, saying he could help with the boy's formation. When Skywalker arrived in the company of his Master Obi-Wan Kenobi, Palpatine asked to be accompanied by Skywalker for an errand in the lower levels of Coruscant. Dismissing Master Kenobi's reminder that Skywalker was not yet a Jedi and dangers could lie ahead, the Chancellor brought Skywalker to Level 2685. Both disguised as travellers, Palpatine told the youth that he himself frequents the area when his duties permitted it—to try to do some good. Eventually, the duo arrived at Club Kasakar.\nThere, Palpatine expressed some form of envy in the life of young Jedi Padawans, that was already decided from an early age, in difference with his political life, one of the troubling choices and difficult decisions. He also explained that the Club was full of Senators. In particular, he pointed out Senator Colandrus, a Tarsunt who often went there for gambling. While the Tarsunt senator was betting at a game table, Palpatine said that Colandrus was corrupt, but there were no proofs of it. Inspired by that unflattering description Anakin used the telekinetic Jedi power to rig Colandrus' last dice, making him lose large sums of money. Hearing the disguised Palpatine laugh at his misfortune, Colandrus sicced his bodyguard on him, but the Chancellor defused the situation by explaining that \"his son\" had just made a joke, and promised that they would leave at once. Still unconvinced, Colandrus nevertheless allowed the cloaked nuisances to go freely.\nOnce the duo returned back to the Chancellor's office, Palpatine \"apologized\" to Anakin for involving him in a Senate matter. Anakin said the Jedi could arrest Senator Colandrus, but Palpatine replied that the Jedi were not required to obey him because if they did, he would be like a dictator and that wasn't his wish. He also told the boy not to talk about what had happened to them with his masters and further asked if Anakin was happy in the temple. When the Padawan answered positively, Palpatine felt the truth of it through the Force. Eventually, Palpatine thanked him for his decisive role in the Battle of Naboo, and said there would always be a place for Anakin near him, and that he could make extraordinary use of a young man like Anakin.\nPalpatine continued to act as a confidant to Skywalker, providing guidance to the young Padawan who trained to become a true Jedi. Skywalker was grateful to Palpatine, and viewed the chancellor as a mentor as well as a friend. In private, Palpatine expressed to Skywalker his confidence in him, including his belief that Skywalker's power would eventually eclipse the combined strength of the Jedi Order, including Grand Master Yoda.\nUnder Sidious' direction, Tyranus rallied several thousand solar systems into declaring independence from the Galactic Republic, instead joining the Confederacy of Independent Systems with himself as its leader. Two years after the Confederacy was founded, civil war seemed to be imminent and the Jedi's numbers were too few to maintain galactic peace. The Senate pushed for a vote to create a Grand Army of the Republic. Keeping his true motives a secret, Palpatine resisted all of the Senate's attempts to create an army and the push to go to war with the Confederacy.\nUpon arriving in Coruscant to vote on the matter, Palpatine's successor as Senator of Naboo, former Queen Padmé Amidala, narrowly avoided an assassination attempt carried out by Zam Wesell on behalf of the vengeful Nute Gunray. Palpatine had the vote delayed and placed the senator under the protection of Obi-Wan Kenobi and Anakin Skywalker, her old allies from the Battle of Naboo. After a second attempt on the senator's life was made, Skywalker was assigned to protect her back on her homeworld of Naboo. There the two secretly started to fall in love which, coupled with Skywalker's later discovery of his mother Shmi's death at the hands of Tusken Raiders on the planet Tatooine, would bring the young Jedi ever closer to the dark side of the force, and even more vulnerable to Sidious' deceptive machinations.\nHowever, when it was revealed that the Separatists were secretly building a battle droid army with the support of many commercial organizations, including the Trade Federation. Palpatine used the situation to have himself granted emergency powers from the Senate by Representative Jar Jar Binks. Palpatine feigned reluctance to accept this authority, promising to return it to the Senate once the crisis ended. His first act was to allow the use of the clone army, which was discovered by Kenobi on Kamino, to counter the Separatist threat; this resulted in the Battle of Geonosis, which served as the opening salvo of the Clone Wars. After clone template Jango Fett was killed and the Separatist partners escaped the battle, Tyranus met with Sidious at the Coruscant tower in The Works with not only good news that the war the Sith had been orchestrating had begun, but with plans for a Geonosian superweapon that may be of use for their future Sith-led regime. Sidious was pleased with these turn of events, and later with the leaders of the Senate oversaw the new Republic army marching towards war, while Skywalker and Amidala secretly wed on Naboo with their two droids, C-3PO and R2-D2, as sole witnesses besides a local holy man who officiated the rite, which Sidious would later use as an advantage to lure Skywalker to become his next apprentice.\nAfter the Confederacy's Droid Army seized control of the major hyperspace lanes, Sidious had Tyranus and his assassin Asajj Ventress kidnap the Hutt Clans' Council leader, Jabba's son, Rotta. After he was taken to Teth, Sidious contacted both Ventress and Tyranus. He assured them that the Jedi would be at war with the Hutts as well the Confederacy.\nPalpatine then received a message from Jabba, asking for help in rescuing his son. Despite Master Windu's reservations about allying the Republic with the Hutt, Palpatine knew they need the Hutt's space lanes to move their troops. Despite General Grievous spreading the Republic forces thin, Windu told Palpatine that Skywalker and Kenobi could carry out the rescue. During the rescue, Palpatine learned that Jabba believed that the Jedi were behind his son's kidnapping and told Senator Amidala of this. Jabba refused to speak with him, so Amidala decided to speak with Jabba's uncle Ziro at his palace, despite Palpatine's warning. Kenobi, Skywalker, and his new Padawan, Ahsoka Tano were able to return Rotta to his father and secure a treaty with the Hutts. Following the events, Sidious spoke with his apprentice about this setback. He assured Tyranus that the war was turning in their favor.\nPalpatine learned that Senator Amidala moved through enemy territory into the Outer Rim, causing him to contact her aboard her H-type Nubian yacht. Amidala explained that an old family friend, Senator Farr of Rodia, had asked for her personally, as his people were starving. Palpatine claimed to understand, although he argued that she should have a clone trooper escort. However, Amidala had trust in diplomacy. After Representative Binks tried to talk to Palpatine, he caused C-3PO's chair to move, knocking the Gungan down and causing the ship to veer off course. Amidala was able to regain control, but Palpatine discreetly urged her to keep Binks out of the negotiations, which she agreed to.\nYet once Amidala was planet-side, she learned Farr had joined the Separatists to help his people, and she was captured by Nute Gunray's battle droids. However, Binks helped disrupt the Separatist's plans and Farr decided to side with the Republic. Thanks to a message sent by C-3PO, the 41st Elite Corps arrived on the planet and captured Gunray. Palpatine contacted them via hologram, stating that Amidala had brought Rodia's needs to his attention. The Chancellor had deployed a convoy of supply ships and stated that Gunray's capture was a major Republic victory.\nHowever, the secret Sith Lord saw the danger Nute Gunray's capture posed, as the viceroy would not last under the Jedi's questioning. Contacting Darth Tyranus, Sidious was informed by his apprentice that Asajj Ventress could infiltrate the Republic warship, allowing her to rescue or kill Gunray. While Sidious was apprehensive about using an agent who had previously failed them in the past, Tyranus argued that she was a skilled assassin. Ultimately, the master allowed his pupil to proceed in this plan; Ventress successfully rescued Nute Gunray, denying the Jedi and the Republic the opportunity to extract secret information from the Separatist leader, whilst also demonstrating her ability to handle a Star Destroyer's contingent of clone troopers, a Jedi Padawan, and a Jedi Master all at once.\nAs the war got underway, Dooku crash-landed his ship on Vanqor and was captured by the Ohnaka Gang. Kenobi and Skywalker were sent to verify their leader Hondo Ohnaka's demand for a reward, and then sent Senator Kharrus and Representative Binks to deliver it. Ultimately, Dooku escaped from the pirates.\nSidious paid Cad Bane to steal a Holocron from the Jedi Temple's Holocron Vault, which when used in conjunction with the kyber memory crystal would reveal the location of Force-sensitive infants across the galaxy. He had Bane kidnap these children to his facility on Mustafar to commence the creation of an army of Force-sensitive spies, Sidious told the nanny droids of the children's natural talent and how he would harness that power for his own needs. Looking into the future, Sidious saw a vision of Force talented spies trained in the dark side that would appear in every corner of the galaxy doing his bidding. The nanny droid told the Dark Lord that subjects rarely survive the procedure at a young age but Sidious said the risk was necessary and that if the procedure failed he would lose nothing. As the surgery was about to happen, an alert from a nanny droid told the Sith Lord of an incoming shuttle that was approaching and it did not belong to the bounty hunter. This surprised Sidious as he did not foresee this and ordered the droids to evacuate the children and destroy the facility to protect his identity and ended the transmission quickly. the Jedi foiled Bane and rescued the younglings.\nDuring the Battle of Malastare, the Zillo Beast was inadvertently awakened and Palpatine wanted the creature killed, but changed his mind when Doctor Sionver Boll and Skywalker pointed out the beast's indestructible hide could prove fruitful if analyzed. The Zillo Beast was instead rendered unconscious, and transported to Coruscant. It broke out of its restraints and rampaged through the Senate District before being killed with poison gas. Palpatine ordered Boll to clone the animal.\nDuring the Senate hostage crisis, Cad Bane demanded Ziro the Hutt be released from prison in exchange for the hostages' release. Palpatine reluctantly complied after Skywalker was subdued by Bane's gang.\nThe following year, while the Senate was considering deregulating the banks to increase funding for the war. Palpatine was soon informed by Amidala that the Separatist Senate, led by Mina Bonteri, was considering peace negotiations. Dooku had the central power distribution grid bombed, and then staged another attack on the Confederacy, which killed Bonteri and was blamed on the Republic, dashing any hope of peace.\nDesperate, Amidala attempted to rally support for opposing the bill but found few willing to do so. Upon further investigation, Amidala found that many of the senators who voted in support have actually been blackmailed to do so. She also discovered that supporting the bill would mean bankrupting certain segments of the Republic such as their social programs, due to the Banking Clan's high interest rates. Pursued by assassins, Bail Organa, Onacondo Farr and Amidala continued attempting to oppose the bill with Amidala stepping up in front of the Senate. In her speech, she pointed out that passing the bill would harm the citizens it was supposedly attempting to protect. Her speech marshals loud respect and support from the Senate audience. Later, Palpatine expressed his displeasure to Mas Amedda, noting how the success of one individual's passionate voice can have over his power. Palpatine resolved to wait until fate and the Senate once more turn to favor him.\nWhen a military enhancement bill for more clone troopers was introduced, Palpatine claimed to be opposed to it. The bill encountered minor but effective resistance, although one of its greatest critics, Onaconda Farr, seemingly died of a heart failure before it could be voted on. Palpatine attended the funeral, but, in the Chancellor's office, he and others met with inspector Tanivos Exantor Divo, who revealed a poison had actually killed the senator. As the inspector left, the Chancellor claimed that murder in the Senate was unthinkable. Later, Palpatine and the others reunited in his office, where Divo nearly arrested the false suspect, the Kaminoan Senator Halle Burtoni. However, Amidala realized Farr's aide, Lolo Purs, was the true culprit, and the Rodian was arrested. Soon afterward, the military enhancement bill was passed; Palpatine claimed to a disappointed Amidala that he too was disappointed, but that democracy needed to be respected, and stated that, with more troops, the war could possibly end more quickly.\nDuring the Battle of Sullust, Sidious felt Asajj Ventress growing stronger in the ways of the dark side of the Force. Through a hologram, Darth Sidious accused Tyranus of wanting to overthrow him as Dark Lord which shocked his apprentice who stated his loyalty belonged only to his Master. Sidious then demanded proof and ordered him to eliminate Ventress which the Count sadly obliged to. After assuming success in the death of his former disciple, Dooku contacted Sidious of his apparent success. Satisfied, Darth Sidious praised his apprentice for once again proving his loyalty. The two were unware the Ventress survied.\nSidious ordered Tyranus to ally with the resurgent Zygerrian Slave Empire, explaining past Sith Empires were built on the backs of slaves and theirs would be no exception. They soon plotted for bounty hunters such as Cad Bane and Rako Hardeen to \"kidnap\" Palpatine during the Festival of Light on Naboo. Kenobi infiltrated the plot and helped the Jedi to prevent it, lulling them into a false sense of security. Dooku showed up the evening after the festival but was defeated and forced to flee.\nThe next year, Maul returned to the galaxy after a decade of hiding, with his brother Savage Opress now acting as his apprentice. The Jedi were concerned but Palpatine disagreed, convincing Yoda that the Separatists should be their concern and that Maul's vendetta was a private matter for Kenobi to resolve. When Maul seized control of Mandalore, the most powerful planet in the Council of Neutral Systems, Sidious realized that Maul had grown too dangerous and was a threat to his future conquest of the galaxy. Deciding to end the threat personally, Sidious had his shuttle flown to Sundari, where he confronted Maul and Opress.\nNot fooled by Maul's attempts to become his apprentice once again, Sidious engaged the rival Sith Lords in combat. Sidious proved himself to be not only a match for their combined strength but also superior, as after a prolonged duel, he separated the brothers by first bypassing Savage's defense and knocking him away with a kick and then force-pushed Maul, briefly knocking him out. Sidious then briefly toyed with Savage, not even bothering to engage, before he then began battling him again and soundly slayed Opress in single combat. Not bothering to prevent Maul from going to his brother, knowing it was too late for him to do anything to save Savage after Opress finally succumbed, Sidious taunted Maul again, reminding him of the ancient rules of the Sith and how Maul had been replaced before he then once again engaged his former apprentice. Although Sidious found Maul to be far more ferocious than Savage, he ultimately won the final blade lock and brought Maul to his knees, but chose not to kill him, foreseeing that his fallen apprentice could be useful to him in the near future.\nChancellor Palpatine served as the judge of the trial of Ahsoka Tano, who was accused of masterminding a bombing at the Jedi Temple. Flanked by two crimson-robed guards, he listened while Senator Amidala and Admiral Tarkin made their arguments as the defense and the prosecutor, respectively. When they had finished, the Chancellor delivered a speech warning the court to beware of Separatist schemes that aimed to undermine the Jedi Order, and by extension, the Galactic Republic, from within. Before he could announce the verdict, however, Skywalker interrupted with Barriss Offee, who confessed to the crime. Palpatine ordered Offee taken away, and Tano was acquitted.\nDuring the Battle of Ringo Vinda, the clone trooper CT-5385 \"Tup\" suddenly faltered, becoming confused, betraying and killing the Jedi Master Tiplar, before ultimately succumbing to insanity and dying himself. This incident was instigated by a faulty biochip, inserted into clones for the purpose of enforcing loyalty to the Supreme Chancellor and which laid the groundwork for their execution of Protocol 66. With his plans threatened, Sidious, as Chancellor Palpatine, had Tup's body taken to the Grand Republic Medical Facility for autopsy. Shaak Ti and Nala Se brought the rebellious clone CT-5555 \"Fives\" to Palpatine, who had uncovered the inhibitor chips implanted in each clone trooper, and believed them to be part of a Separatist conspiracy. The Chancellor informed Fives of his involvement with the chips and had his guards stage an attack, making Fives look dangerous to the Republic and discrediting him. Following Fives' death, he informed the Jedi that a parasite native to Ringo Vinda was responsible for Tup and Fives's behavior, for which all of the clone troopers would be inoculated against. Sidious furthered the beneficiary opportunities from this series of events as he transferred the bulk of his Sith artifact collection to the Medical Facility from an abandoned store-house in The Works district, where the elusive Sith feared the Jedi may discover.\nDuring a diplomatic mission to Scipio, Senator Padmé Amidala learned from Rush Clovis that the InterGalactic Banking Clan had gone bankrupt. Palpatine told her to trust Clovis while hiring the bounty hunter Embo to target them on the Clan's apparent behalf. Sidious and Tyranus agreed to make Clovis the new head of the Banking Clan: the Muun government arrested the Core Five, and Clovis was elected by a Senate majority to replace them. Dooku blackmailed Clovis into raising the Republic's interest rates and sent a fleet to blockade Scipio, to which Palpatine responded by sending a fleet commanded by Skywalker. As Scipio fell under the Republic's control and Clovis committed suicide, the Muuns ceded control of the banks to the Office of the Chancellor.\nWhen Queen Julia of Bardotta requested assistance from the Senate regarding the disappearance of several Dagoyan Masters, Palpatine offered to send Bail Organa and Senator Amidala, but she insisted the aid of Representative Binks. Palpatine informed the Jedi Council, who deemed it unwise, so Master Windu volunteered to accompany him.\nPalpatine was visited by Yoda when the Jedi discovered Sifo-Dyas' lightsaber at the location of a distress beacon: apparently, Sifo-Dyas had died on a mission to Felucia, but details were sealed by the Office of the Chancellor. Palpatine told Yoda to consult former Supreme Chancellor Finis Valorum, since he was still a Senator at the time. Sidious then went to berate Tyranus via hologram over this loose end, ordering him to sort it out. Vexed by Tyranus' carelessness, Sidious Force choked his apprentice, warning him to remember the price for failure. Dooku prevented Kenobi and Skywalker from learning who killed Sifo-Dyas, but they still deduced the Sith were responsible for the creation of the clone army.\nWhen Yoda entered the Valley of the Dark Lords on Moraband during a quest to uncover immortality, Sidious and Tyranus sensed his presence and convened at The Works on Coruscant. Greeting his apprentice once he arrived, Sidious led Tyranus to the tower's ceremonial chamber. Exploiting Tyranus and Yoda's Force-bond, Sidious used a Balc incantation to cast a dark illusion to ensnare the Jedi Master. Using Sifo-Dyas' visage, he offered to reveal his identity if he would join him, but Yoda refused. The illusion then made it seem that they were in The Works pursuing the Sith Lords with Anakin Skywalker and the 501st Legion. Sidious dueled Yoda on the catwalks outside the tower, with Skywalker arriving outside shortly after. Sidious rendered Skywalker unconscious with Force lightning while he continued fighting Yoda. As the illusion unfolded, Yoda refused to sacrifice Skywalker to pursue Sidious, and instead demonstrated he was willing to sacrifice himself to save the Chosen One. Sidious's illusion faltered: the Jedi Master won. Defeated, Sidious stated that they would need more time to defeat the Jedi.\nWhen he learned the otherwise unremarkable planet Utapau had produced a massive kyber crystal, the world became of interest to Sidious, as he wanted the large crystal for his battle station project. With the crystal in the hands of a Sugi arms dealing group, Dooku agreed to a sale, claiming he wanted the crystal for the Separatist Alliance. Grievous himself arrived to oversee the deal, ultimately killing the Sugi leader, Endente, and taking the crystal to his Separatist fleet. However, after they had arrived on Utapau to investigate the death of Jedi Master Tu-Anh, Kenobi and Skywalker fought to stop the Separatist operation, pursuing the crystal into space and destroying it aboard Grievous's DH-Omni Support Vessel. Nevertheless, Yoda feared that Sidious was planning to create a superweapon, and Sidious remained interested in Utapau. Thus, the planet was targeted to be occupied, which would allow a crystal search to begin. Within months, the Separatists invaded the world.\nMeanwhile, Sidious wanted to use Maul to draw out Mother Talzin, the Nightsister witch who could pose a threat to his plans. His operations against Talzin began when Mandalorian super commandos broke Maul out of his imprisonment in the Spire on Stygeon Prime. Maul called on Mother Talzin for help after General Grievous defeated his forces at Zanbar, precisely what Sidious and Dooku wanted. Talzin foresaw this and ordered her son to draw the Separatists to Ord Mantell, where he defeated and captured Dooku. Maul contacted Sidious and informed him of their capture: the Sith Lord responded he should execute them, saying there were of no more use to him. Maul informed Dooku, goading him into allying with him.\nMaul and Dooku flew to Dathomir, where Talzin intended to siphon Dooku's lifeforce to regain her physical body. Sidious and Grievous also arrived on the planet and attacked Maul and the Talzin-possessed Dooku. Talzin regained her physical body and fended off Sidious's lightning, sacrificing herself to allow her son to escape. Taking the opportunity, Grievous plunged two lightsabers into her body, eliminating the foe of Sidious. Despite Maul's escape, Sidious was satisfied that the Shadow Collective had been destroyed.\nLater, the Jedi sent Quinlan Vos to work with Ventress to kill Count Dooku. This mission was deemed Jedi business, so Palpatine was not informed. However, Skywalker was unsure if that was the correct decision, and he felt that the Jedi keeping secrets from the Chancellor was wrong. Eventually, aboard the Republic's Venator-class Star Destroyer Vigilance in orbit of Christophsis, Vos, who had fallen to the dark side and tasked himself with becoming Dooku's apprentice so as to discover Darth Sidious' identity, and Dooku, held in captivity of several clone troopers and Jedi, including Obi-Wan Kenobi and Anakin Skywalker, had enlisted the assistance of Asajj Ventress in their escape.\nThe trio, however, crash-landed onto Christophsis under Republic pursuit, with the Count of Serenno suffering grievous injuries. Having sought shelter in a hidden Confederacy fortress, Tyranus contacted a long-awaiting Darth Sidious within a hologram communications chamber in seek of help, yet not before Vos and Ventress slipped in. Tyranus was thus forced to introduce Quinlan Vos, presenting the former Jedi as his \"new assassin\" to Sidious, who had customarily hidden his facial features behind his dark cowl, whilst Ventress remained hidden in the shadows. After expressing disapproval with his apprentice's new employ, Darth Sidious listened to Tyranus' plea for an evacuation ship as a second battle of Christophsis ensued with Skywalker leading the ruthless Republic onslaught. Giving only a vague answer, Sidious ended the holo-communication as the Christophsis Separatist tower fell to Republic gunship fire. The battle resulted in an inevitable Separatist loss, and with Ventress' redemption through sacrificing herself for her lover, Quinlan Vos, Tyranus' \"new assassin\" chose to allow Anakin Skywalker and Obi-Wan Kenobi take him back to the Jedi Temple on Coruscant for reassessment. Meanwhile, as the Jedi took Vos, a ship sent by Darth Sidious arrived to retrieve Tyranus, letting the Separatist leader return to safety.\nTowards the end of the war, Palpatine passed a constitutional amendment known as the Sector Governance Decree. He also had been granted near-absolute power over military affairs through the Reflex Amendment. Deciding that it was time to make Skywalker his next apprentice, Sidious devised a plan for Palpatine to be captured in order for Skywalker to rescue him. The plan included sacrificing Darth Tyranus, who was to be killed by Skywalker, which would tempt Skywalker to the dark side and eventually lead to the young Jedi replacing Dooku as the Dark Lord's new apprentice. Sidious ordered Grievous to capture Palpatine and Dooku to hold him hostage. Grievous and Dooku, however, were unaware of Sidious' true intentions.\nDuring the Outer Rim Sieges, Grievous commanded a massive invasion of Coruscant, accompanied by Dooku. While the Republic and Separatist fleets clashed above the planet, Grievous went to the ground in order to capture Palpatine, Shaak Ti and Roron Corobb, along with a clone task force were sent to protect him. Corrob and the clones fell to Grievous, while Ti managed to fight further. Grievous took the upper hand by electrifying the Jedi Master with cables, knocking her unconscious in the process. Grievous took her lightsaber and fled with the captive Palpatine to the Separatist flagship Invisible Hand.\nKenobi and Skywalker, who at the time were in the middle of making preparations to take Mandalore, were called upon to rescue him. After landing in the Invisible Hand's hangar, the two found Palpatine bound to a chair on the bridge. They were confronted by Dooku, who they entered a duel with. Dooku took out Kenobi with ease and then focused on Skywalker. They continued the duel until Skywalker cut off his hands. Disarmed and on his knees, Dooku was bested. Palpatine commended Skywalker on his accomplishment. However, he then betrayed Dooku by urging Anakin to kill him, due to Dooku having served his purpose. A horrified Dooku looked to Palpatine pleadingly, only to be met with another, more sinister urging. With one swift move, Count Dooku was beheaded. Anakin was conflicted on his actions but was comforted by Palpatine, who told him that it was a simple act of revenge in return for Dooku cutting off his arm. Beyond luring Skywalker closer to the dark side, the act also served to tie up the loose end Dooku would be if he lived, robbing the Jedi of the chance to question him to learn more about Sidious.\nSkywalker went to pick up the unconscious Kenobi, to which Palpatine pleaded with the Jedi to leave his master. His plea was denied, and the three began their descent to the hangar. Meanwhile, the Invisible Hand was attacked by the Guarlara, with the former taking extensive damage and losing its position, momentarily falling towards that planet's surface. With the ship on its side, the three began running down an elevator shaft, only to lose their footing as the Invisible Hand regained its position. They managed to get out and to a hallway, where they were then captured in a ray shield. They were brought before Grievous in the control room, where R2-D2, who was also a captive, gave a distraction that allowed Kenobi and Skywalker to take control. With nowhere to run, Grievous broke open a window and found his way to the escape pods, which he activated as he fled. The ship then became caught in Coruscant's gravity well and began barreling towards the surface. Skywalker and Kenobi attempted to land it, but only managed to ease the crash. Following the crash, Palpatine and the Jedi were escorted to the Senate Building.\nSidious soon began preparing for the war's end. Sidious instructed Grievous to move the Separatists to Mustafar. Skywalker, who had just been hailed as a hero for killing Count Dooku and rescuing the Chancellor, began having visions of his wife dying in childbirth. Sidious decided to use that to his advantage. Throughout the next few rotations, their relationship kept growing. Ultimately, Palpatine appointed Skywalker to be his representative to the Jedi Council.\nMeanwhile, the Jedi began to distrust and resent the Chancellor's accumulating power and control. The Council, who was not happy with Skywalker's appointment by one not of their order, denied him the rank of \"Jedi Master.\" This turn of events simply furthered Sidious' plans. The Council, however, decided to use this appointment as a chance to spy on Palpatine. Skywalker, who felt insulted by that demand, regretfully agreed and began to devote his time to getting to know the Chancellor better. Some Jedi, such as Mace Windu, were concerned about their relationship, seeing that it could be dangerous putting the two together. Windu ultimately noted that the dark side of the Force surrounded the Chancellor.\nAt an opera show, Palpatine and Skywalker discussed the situation with Palpatine revealing to know that the Council wanted Skywalker to spy on him. At the same time, Skywalker, who was dealing with the fear of his wife's loss was beginning to distrust the Jedi Council. This allowed Sidious to orchestrate Skywalker's downfall; he claimed that the Jedi and the Sith were alike in nearly every way, setting the stage for the young Jedi to switch sides while playing to his devotion to the Jedi ideology. Next, Palpatine told him the story of his master, \"Darth Plagueis the Wise.\" According to the story, Plagueis possessed such strength in the Force that he could use it to prevent the ones closest to him from certain death. Skywalker asked what happened to him, to which Palpatine said that he was afraid of losing his power, but had taught his apprentice everything, and then his apprentice killed him in his sleep. Skywalker, enthralled by the story, wished to know more about this power, asking him if he himself could learn it with Palpatine stating that, though possible, such things could not be taught by members of the Order. Skywalker, however, was unware that Palpatine was really talking about how he killed his mentor Plagueis, in order to lure him to the dark side.\nAs the situation grew worse, Skywalker went to speak with the Chancellor regarding the Battle of Utapau. Anakin expressed his disappointment that he was not chosen for the assignment. Palpatine told Skywalker that the Council did not trust him and that the Jedi were plotting to take control of the Republic. Palpatine then revealed that he was trained in the ways of the Force, \"even the nature of the dark side.\" This led to Skywalker concluding that Palpatine himself, was the Sith Lord the Jedi were hunting down and drew his lightsaber. Palpatine said he was the path to the power that could save his wife from dying. Stunned by the revelation, Skywalker responded by reporting him to the Jedi. Skywalker was deeply conflicted realizing that he could not lose the Sith Lord as he thought he needed to learn the dark side power to \"save\" his wife Amidala. Skywalker, who desired to kill him, went to the Jedi Council with this information.\nMace Windu, realizing that the Jedi had been deceived by Sidious, after learning about the Chancellors' double identity from Skywalker, went to confront the Chancellor along with fellow Jedi Council Masters Kit Fisto, Agen Kolar, as well as Saesee Tiin. Windu and the three other Jedi boldly ignited their lightsabers and declared that he was under arrest. Igniting his own crimson lightsaber, Sidious declared the four Jedi as traitors to the Republic. Letting out an inhuman wail of fury, he then lunged forward and slew Kolar and Tiin in mere seconds, and Fisto slightly later, leaving Windu to face the Dark Lord alone. Sidious and Windu then engaged in a ferocious one-on-one duel. While the fight appeared to be even, Windu eventually disarmed him, knocked him to the floor and held him at blade point.\nSkywalker soon arrived after this and both sides tried to persuade him that the other was a traitor. Windu taunted Sidious in his defeat which prompted the Sith Lord to attempt to kill Windu with Force lightning, but Windu managed to deflect it back at Sidious, causing the Sith Lord's face to take on a hideously disfigured appearance in the process, due to the dark side energy emanating from the lightning. As a result of this, Sidious then switched his strategy to pretending to be a defenseless old man, dropping his lightning attack and proclaiming that he was too weak to carry on. Skywalker told Windu that Sidious had to stand trial, though Windu claimed that Sidious possessed far too much influence to be left alive, as he controlled both the courts and the senate. Deciding that his wife's survival was more important than his loyalty to the Jedi Order, Skywalker betrayed Windu by cutting off his lightsaber hand, giving Sidious the opening to drop his feigned weakness and throw Windu out the office window with a full barrage of Force lightning.\nSkywalker, although initially stunned by what he had done, ultimately viewed Windu's transgressions as the final act of Jedi hypocrisy that he would not tolerate, and knelt before the now-scarred Chancellor, agreeing to join the dark side on the condition that he was be shown how to save Amidala's life, thus betraying the Jedi. Sidious bestowed on the young man the Sith name of Darth Vader, promising the young apprentice that together they would discover the hidden art of preventing death. Sidious informed Vader of his intention to purge the galaxy of all Jedi, claiming that the Order was a threat to the Senate as well as the security of the Republic. Sidious ordered Vader to attack the Jedi Temple on Coruscant, and then execute the Separatist leaders on Mustafar. He declared that the galaxy would then return to a state of peace under the rule of the Sith.\nWhile Vader led the 501st Legion's attack on the Jedi Temple, Sidious ordered the rest of the clone troopers to execute Order 66, declaring every Jedi an enemy of the Republic. Order 66 activated the biochips within the clones, who were programmed to kill the Jedi for treason against the state. Despite serving and forming deep relationships with the Jedi, the activation of their biochips by Sidious, immediately and forcibly brainwashed them into believing that the Jedi were traitors to the Republic that needed to be executed, resulting in the start of the Great Jedi Purge. The Jedi were consequently betrayed and gunned down by their soldiers, although some managed to survive such as Obi-Wan Kenobi, Yoda, and Caleb Dume. Sidious also used Order 66 to compel Clone Commander CT-7567 \"Rex\" to eliminate the former Jedi Ahsoka Tano, along with his former apprentice Maul who had been captured and brought to Coruscant by the 501st Legion. However, both attempts were unsuccessful as Tano freed Maul, and then subsequently freed Rex of the mind control by removing his biochip.\nAfter the Jedi Temple fell, Sidious congratulated his new apprentice, Vader, who killed several Jedi during the siege including Padawans and younglings. Sidious then contacted the Separatist Council to inform them that Vader would arrive and take care of them, though none of them were aware that Sidious had betrayed them, and had really sent Vader to kill them. Sidious, as Palpatine, then addressed the Senate and accused the Jedi of attempting to assassinate him and overthrow the Republic, using his newly scarred face as evidence. He ultimately announced the Republic's reorganization into the first Galactic Empire while declaring himself Emperor of the new regime, with little if any resistance from the majority of the senators present.\nWith Kenobi and Yoda realizing what had happened upon witnessing a recording within the Jedi Temple, Yoda went to face the Emperor personally, while a reluctant Obi-Wan stowed away onboard Amidala's yacht, en route to Mustafar to kill Vader. Upon arriving at the working office of the Chancellery Secretariat, Yoda disposed of the pair of guardsmen by the entryway, surprising Sidious. Within moments, however, the Sith Lord had recollected himself, unleashing a barrage of Force lightning at the Jedi Master after a brief exchange of acknowledgement between the two. Yoda quickly recovered and Force pushed Sidious backwards. Yoda then engaged him in a duel when he refused to allow Sidious to escape. Sidious declared that Vader would become more powerful than both of them, while Yoda told Sidious that his faith in his nascent apprentice was a mistake, along with his faith in the dark side.\nThe two then dueled in the Senate hall. No longer having his lightsaber shortly after, Sidious utilized the use of his Force powers by sending numerous Senate pods at the Jedi Master, which he closely dodged. Yoda eventually managed to redirect one of Sidious's pods at him, which the Sith Lord dodged. Sidious then unleashed a torrent of Force lightning at Yoda, which he was able to redirect back on him, giving the Jedi master the upper hand. However, the build up of energy led to an explosion that caused Sidious to fall back and Yoda to take a huge fall to the ground. Luckily, Sidious managed to hang on to the pod and get back up. While neither conquered the other, Yoda believed he lost for being unable to stop Sidious, and then fled and decided to go into exile.\nAs Imperial shock trooper of the Coruscant Guard arrived in the Senate Chamber following the battle, the Emperor stood with Mas Amedda on a Senatorial pod as they searched for the Jedi Master. However, they could not find any trace of a body. The Emperor had more pressing concerns however: he had sensed that Vader, far away on Mustafar, was in danger of being destroyed. He ordered the clones to double their search for Yoda, and that his shuttle be prepared to depart.\nThe Emperor made haste to Mustafar, accompanied by a squad of the best shock troopers under the authority of Commander CC-4477 \"Thire.\" On planet, he found that Vader had been dismembered, horrifically burned, and left for dead by Obi-Wan Kenobi after the conclusion of their duel. He ordered the clones accompanying him to prepare a medical capsule for his apprentice. As they left to obey his instructions, the Emperor crouched beside his fallen apprentice, determined to find a way to keep him alive.\nThe Emperor was keenly aware that, without Vader, the foundations of his newfound power would be badly shaken; he needed an apprentice capable of ensuring that his Empire would survive the inevitable challenges that would rise up against it. To make certain that Vader would be capable of remaining a powerful apprentice, the Emperor contacted the boldest scientists he could, those whose practices would have been frowned on by the Jedi and the Republic. Among these scientists was an expert in cybernetics named Doctor Cylo.\nThe Emperor brought Vader to the Grand Medical Facility, far above Coruscant's surface as a storm raged across the capital. A strenuous night, followed during which the scientists, their droids and their technology worked to save the critically-injured Vader before he died. The new Sith apprentice was kept awake for the whole procedure, feeling the pain that came with saving his life. Cylo and the other scientists designed a suit of armor that would protect his weakened body and allow his scorched lungs to breathe. Cybernetic limbs were added to replace the legs and the arm that Kenobi had taken.\nAfter what the Emperor would call a \"long night,\" Skywalker was surgically reconstructed as a cyborg and encased in the armor and mask that would forever hide away who he had once been from the galaxy. As the procedure ended and the Sith apprentice rose, the Emperor approached him. Vader's first query was to know whether or not his wife was safe. The Emperor told him that he had killed Amidala in his anger. This final loss sent Vader over the edge of pure wrath and anguish, completing his transition into the apprentice Sidious had spent decades grooming. In his rage, Vader used his new limbs to tear away the restraints that held him to the operating table and the Force to destroy the droids who had just saved his life, before stepping unsteadily onto his new legs and screaming his despair to the galaxy as a satisfied Sidious looked on with a devilish smile.\nVader then turned his rage onto the Emperor, throwing him into the wall of the operating room with the Force. He angrily berated his master for promising that he could save his wife from death. The Emperor conceded that he had failed him in that regard but countered that, with her death, Amidala had given him something so much stronger: pain. This pain would fuel his power for decades and make him the dreaded Sith apprentice that Sidious had always coveted. It would also allow him to live. After a tense few moments, Vader released his master and proclaimed that he would live. Satisfied, the Emperor then assaulted Vader with Force lightning and warned him never to use the Force against him in such a way again, or he would finish what Kenobi would not.\nDuring the Imperial Era, secure in power as Emperor of the galaxy, Sidious pursued his obsession with immortality; he mostly withdrew from the public eye to probe the secrets of the dark side and study his Sith arcana extensively to unlock the ability to live forever. He prepared the ancient Sith world of Exegol, constructing a base of power within the Sith Citadel located on the surface, planning to claim the ancient throne of Sith as his permanent seat of power. His loyal cult following, the Sith Eternal, began to experiment with technology and genetic cloning science to expand his lifespan. Exegol was also home to his most promising experimentations within a vergence of the Force.\nThe planet Byss in the Deep Core was of great importance to Palpatine. Ultimately, Palpatine's true goal was for the Death Star to take over as the symbol of fear that would keep the galaxy in line, giving himself and Vader the freedom to pursue the deepest secrets of the dark side. Beyond simple immortality, Sidious sought the power to alter reality itself and bring every living being under his dark control. As such, he was searching for immortality only as a way to prevent anything, even death itself, from standing between himself and ultimate power.\nThe Sith Eternal utilized a method of cloning known as Strand-Casting in addition to modified cloning technology, producing countless modified cloned bodies of Sidious' original in the attempt to give him a vessel worthy of containing and preserving his essence, so he could ultimately obtain immortality. In 12 BBY, the only survivor of this process, that grew and aged normally, was created. Designed and assembled from Sidious' clone tissue samples and other donated blood cells, the artificial construct was thriving in health and had the Palpatine bloodline rushing through his veins. The unnamed strandcast was Sidious' \"son.\" The strandcast, not a direct cloned replicate of Sidious, so nor entirely identical in appearance, was ultimately be a source of disappointment for Sidious. Sidious was disgusted with the son he sired through science; the boy possessed no force-sensitivity like his father, and Sidious, who relished the powers of the Force, immediately rejected the \"useless creature\" that was his son. Sidious deemed the boy an example of such \"disappointing ordinariness,\" unable to bare even looking upon him, the inferior child spawned from his flesh undeserving of his legacy.\nBut the Sith Lord surmised, that because the boy possessed his blood, he might still produce some usefulness at some point. Therefore, Sidious chose to permit his son to continue living, the clone's health providing Sidious the means to continue on his bloodline and possibly yield more promising results for producing a vessel for his spirit through more natural means. For this reason, Sidious granted his cloned progeny protection from the Sith Eternal cultists, them being unable to \"recycle\" him as a failed experiment, and allowing him to live on Exegol. Sidious neglected his son, ignoring him like the cultists, never naming him, and hardly acknowledging his existence. However, Sidious made his son aware of the Force and its nature as the mystical energy of the galaxy that surrounded all life, especially the its dark side, and the Sith that wielded them.\nAfter the creation of his Sith Empire, Sidious established himself in the old Jedi Temple on Coruscant, transforming it into the Imperial Palace. The Jedi had built the palace atop an ancient Sith shrine, in order to neutralize and cap the dark power that sprang from its depths. Sidious entrusted the reopening and restoration of the ancient temple to droids under the supervision of 11-4D, a protocol droid inherited from Darth Plagueis. During the early days of the Empire, making a rare public address, Sidious claimed the Empire would do whatever was needed to ensure a lasting reconciliation now that the Clone Wars had ended.\nDuring his rule, Sidious sent explorers to unmapped regions of the galaxy to search for the source of the dark side, believing it lay there. These explorers built labs on distant moons and asteroids. As part of his planned Contingency, Sidious had Imperial scouts explore the Unknown Regions while also utilizing extensive resources to seed laboratories, shipyards, and observatories within that same region. This arrangement would continue over a period of decades and would be known solely by him and the elect. At some point during the Imperial Era, Sidious created an Imperial hunter droid named M-OC. The B1 battle droid R0-GR of the Freemakers claimed to have fought Sidious.\nIn his early days as Senator Palpatine, Sidious had closely associated with Wilhuff Tarkin, whom he encouraged to pursue a career in politics after his training with the Judicials was completed. Tarkin went on to become Governor of Eriadu and one of the Republic's foremost military leaders during the Clone Wars. Sidious had learned of Tarkin's upbringing on Eriadu, where he had been trained in harsh conditions through a brutal initiation in the wild Carrion Plateau of his homeworld. Tarkin had been taught to hunt savage creatures and emerged from his training with the belief that only the brutal application of the law and the fear of force could keep beings in line with a central galactic government. Although Tarkin lacked Force-sensitivity, Sidious identified him as one whose mindset was very close to that of the Sith.\nFive years after the end of the Clone Wars, Cham Syndulla, a war hero who liberated Ryloth from the Separatist forces during the war, organized and led the Free Ryloth Movement in order to liberate his homeworld once again, this time from an Imperial military occupation. Sidious summoned the Senator of Ryloth, Orn Free Taa, in order to incorporate the senator into his plan to eradicate the \"terrorists.\" He ordered the Twi'lek to accompany him and his right-hand man, Darth Vader, for an official visit to Ryloth. Once Sidious dismissed Taa, Vader asked him why he couldn't simply wipe out the Senator along with his entire staff, in which the two Sith suspected there were one or more traitors, who provided aid to the terrorist movement. But the Emperor wished to find the roots of the treachery, eliminate them and make of it an example for the entire galaxy. Eventually, he ordered Vader to inform the Moff of Ryloth, Delian Mors, of the arrival of Senator Orn Free Taa, but not of the two of them.\nWhile on the way to Ryloth aboard the Star Destroyer Perilous, Sidious instructed the ship to stop at the Denon system for a meeting on the training cruiser Defiance with several Imperial Navy chiefs to discuss a realignment of the Imperial Naval Academy. Sidious ordered Darth Vader to oversee training exercises conducted by Commandant Pell Baylo while the Emperor was in his meeting with the naval chiefs. During one such exercise, Baylo set a hyperspace route that would have crashed the Defiance into Christophsis' sun. Cadet Rae Sloane and Darth Vader uncovered this assassination attempt and redirected the Defiance. Baylo confronted the Emperor, accusing the Galactic Empire of being a hostile force that had taken over the Galactic Republic. Vader killed Baylo, which upset Sidious, who wanted Baylo to suffer as the Navy becomes something he hated and watch as the Defiance was decommissioned and turned into \"cafeteria trays.\" Instead, the Defiance was renamed Obedience as a final jab at Baylo and a not-so-subtle reminder toward Vader to remember his place, and Sidious and Vader re-boarded the Perilous and continued on their way to Ryloth.\nThe two Sith and Senator Taa came to the Ryloth system aboard Perilous. When the ship exited from the hyperspace, they found themselves in the middle of a minefield: Syndulla was waiting for them. The Twi'lek wished to eliminate them to strike at the heart of the Empire. However, Sidious was unperturbed by the ambush, having evidently foreseen such an occurrence. When the shields were overwhelmed, Sidious remained on the bridge, while Vader took off with his fighter leading a squadron to deal with a swarm of vulture droids. The former Separatist fighters released thousands of explosive buzz droids which further damaged the Star Destroyer. Vader returned aboard the Perilous where he met the Emperor and Senator Taa after finding that the Emperor's personal shuttle had been destroyed in the attack. Because he suspected there was a traitor in the Senator's staff, Sidious ordered to isolate them in their own quarters and deny them access to any communications equipment.\nIn the meantime, a Twi'lek task force reached the ship disguised as a repair team and placed explosive charges in the hyperdrive chamber, to trigger a chain reaction. After discovering the sabotage and realizing that the ship was doomed, Vader contacted the Emperor. The Emperor informed Vader that he had prepared a second shuttle either as a contingency or because he had foreseen the destruction of the first shuttle and told Vader to meet him there. However, Vader delayed his arrival by a few minutes in an attempt to find and eliminate the saboteurs. The Twi'lek rebels just barely managed to escape, and so Vader hurried to the Emperor's shuttle, which departed as soon as Vader was aboard. A few minutes later, the Perilous exploded. Once in space, the fugitive task force searched for the Imperial shuttle and caught up with it. Vader Force-choked the resistance pilot of the pursuing ship through the shuttle viewport. In a desperate attempt to get free from Vader's grasp and to kill both him and the Emperor, the Twi'leks rammed the stolen starship into the Imperial shuttle, critically damaging the latter. Vader attempted to regain control of the shuttle while Sidious remembered they had already been in situations like this. Thanks to the piloting skills of Vader the shuttle crash-landed on Ryloth's surface, in the middle of a forest.\nOnce on the planet surface, Sidious noted with mild annoyance that the landing had been far beneath what he knew Vader to be capable of and that Vader's lapse had left four corpses in the rear compartment of the shuttle. Vader admitted to having been distracted by thoughts of his past and attempted to dismiss it as nothing. Sidious however, was unconvinced, though he shelved the matter and proceeded with Vader into the rear compartment. There, three of the shuttle's occupants, Sergeant Erstin Deez, his captain, and another member of the Imperial Guard had survived the crash, though one was badly injured and unconscious. Vader noted with mild surprise that the Emperor appeared to have been wrong; there were only three corpses in the compartment. One of the conscious guards noted that his injured comrade had not strapped himself in during the landing, and as a result had been thrown about the compartment when the ship had crashed. However the Emperor, seemingly having known about the guard, had him executed for his stupidity, leaving the fourth corpse.\nThe survivors exited in the night, and while the two guards who survived were checking the survival kits, Vader asked his master if he was testing him. Sidious answered they were always being tested, and they must pass all tests to gain strength and power. Meanwhile, the guards had activated the generator and the communication array to call for help. At that moment the Sith sensed that two Twi'lek ships were approaching and prepared themselves for a confrontation. The Twi'lek rebel's ships fired upon them, while Vader, immersed in the Force, deflected the laser beams with his lightsaber.\nThe captain suggested to take cover in the woods, but the Emperor refused and instead, removed his cloak, and ignited his lightsaber. The two Sith spun their red blades, turning every shot back at the ships. When the enemy ships engines were hit and began to explode in flames and smoke, Sidious unleashed a bolt of Force lightning on their hulls and then, with the Force, drove one of the ships to the ground, while Vader did the same with the other. The two freighters exploded, and Vader sent Deez to check for survivors. They realized the rebels had jammed the communication network and that they were hunting for them.\nThey walked for a long time into the depths of the forest. Sidious went forward in the darkness seeing through the Force while testing Vader's loyalty once again until he decided to stop for a while. While the guards were eating, the two Sith began to meditate. The Emperor sensed his apprentice's murderous feelings towards him. When Vader ended his meditation, Sidious told him what he had sensed, but the former Jedi pledged his loyalty to his Sith Master. At that moment, the guards, whom the Emperor had sent away, had returned, pursued by a horde of lyleks. The Emperor remained calm, sending torrents of Force lightning against the predators, and began to advance back-to-back with Vader, their lightsabers ignited.\nWhile Vader and the guardsmen held back the advancing lyleks with their weapons, Sidious used the Force to topple trees over the advancing lylek horde. Through the Force, Sidious sensed a tunnel a hundred meters away. The four retreated into the tunnel with the lyleks in pursuit. This tunnel turned out to be the home of the lylek horde, and the four Imperials were forced to fight through hundreds of the creatures. The guards used their blasters and grenades while the two Sith Lords used the Force and their lightsabers to fight through the horde.\nAs they waded deeper into the cave, Sidious realized that the lyleks were herding the intruders towards their queen. At Vader's instigation, the four resolved to kill all their opponents with the Emperor activating his red blade. After a fierce battle with the lyleks, Sidious and Vader found themselves back to back. When Sidious asked his apprentice whether he had ever toyed with the idea of letting his Emperor die to fulfill his own ambitions, Vader admitted he had entertained such thoughts but reassured his master it was only for a moment. Sidious accepted Vader's loyalty and the two joined forces to tackle the lylek queen.\nFollowing a savage battle, Vader managed to kill the queen; scattering the remaining lyleks. However, the royal guard captain was killed, leaving only Sidious, Vader, and Sergeant Deez. Based on their battle with the lyleks, master and apprentice quickly surmised that Cham and his rebels were trying to kill them to bring about the Empire's destruction. Having triumphed over the lylek horde, the three Imperials found an opening at the end of the tunnel which led back to the forest.\nWhile Sidious and his companions were traveling through the forest, they encountered a young Twi'lek girl named Drua. Sidious made a move to kill her, but Vader blocked his master's death blow and convinced Sidious that she could lead them to a settlement where they could contact reinforcements. Drua led them to her village, which was home to escaped Twi'lek slaves. When the village head Narmn asked for their identities, Sidious introduced himself, Vader, and Deez as \"Krataa,\" \"Irluuk,\" and the Sergeant. Sidious and Vader alone knew that their pseudonyms stood for \"death\" and \"fate.\"\nSidious warned Vader that his act of mercy towards Drua would cost both her and her fellow villagers their lives. Vader then managed to win over the villagers by offering to repair an ancient communications device. Once Vader had fixed the machine, Sidious ordered Deez to contact Moff Mors; whom he knew to be loyal. After re-establishing contact with the two Sith Lords, Mors took steps to eliminate the Imperial traitor Colonel Belkor Dray, who was secretly aiding Cham's rebels. She foiled Belkor's plot to order V-wing fighters to strike Drua's Village and the massed Free Ryloth forces in a nearby quarry. After executing Belkor, Moff Mors sent her forces to rendezvous with Sidious and Vader at the Twi'lek village.\nCham's forces, unwilling to harm the villagers, fired warning shots so that the villagers would flee the scene of the upcoming battle. The villagers reacted by fleeing to a nearby mine shaft, a sanctuary in time of danger. However, Sidious, Vader, and Deez stood their ground at the center of the village. Before Cham's forces could launch their attack, Moff Mors' forces arrived in two transport vessels and trapped the rebel fighters. With many of the Free Ryloth fighters killed, Cham narrowly managed to avoid capture at the hands of Vader. Under the orders of Sidious, Mors's Imperial forces massacred the surviving Free Ryloth fighters. Following a brief exchange with Cham's lieutenant Isval, Sidious ordered Vader to execute her and then afterward, the surviving Twi'lek villagers hiding in the mine shaft as well, in order not to leave any witnesses. After a brief moment of hesitation, Vader complied with his master's orders and massacred the villagers.\nBy 14 BBY, Sidious had placed Moff Wilhuff Tarkin in charge of the secret Death Star project. The battle moon was being constructed above Geonosis and was supplied by a series of marshaling stations. The Empire faced a new threat in the form of Berch Teller, a former Republic Intelligence agent who opposed the Empire. He led a rebel cell consisting of survivors and witnesses of the Antar Atrocity, a mass crackdown on Antar 4 following the Clone Wars that had seen the killing of innocent Gotal and Koorivar loyalists. Teller had a special animus for Tarkin, the architect of the Antar Atrocity. He was secretly aided and equipped by Vice Admiral Dodd Rancit, the Director of the Naval Intelligence Agency and a rival of Tarkin.\nFollowing Teller's attack on Sentinel Base, the Emperor convened a meeting of his Ruling Council to discuss the discovery of a cache of communications jammers on the planet Murkhana. The Imperial Security Bureau had purportedly discovered the cache and feared that dissidents were planning to disrupt the Imperial HoloNet; echoing the Separatist Shadowfeed broadcasts during the Clone Wars. The Emperor dispatched both Moff Tarkin and Lord Vader to investigate the matter. However, this played into Teller's hands and allowed the insurgents to steal Tarkin's corvette Carrion Spike, which they intended to turn into a symbol of resistance against the Empire.\nAfter being briefed about the theft of the Carrion Spike, Vice Admiral Rancit suggested that the ship's thieves were the same people who attacked Sentinel Base earlier. In response, the Emperor ordered Rancit to divert Imperial forces in the Belderone system to aid Tarkin and Lord Vader. While Tarkin and Vader pursued the insurgents, the Emperor chaired another meeting of the Ruling Council. During the meeting, Rancit advocated diverting more Imperial forces to reinforcing Imperial facilities across the Perlemian Trade Route and Hydian Way. The Council also learned that Teller' insurgents had attacked the TaggeCo mining facilities on Lucazec and were transmitting holovids of their attacks on the HoloNet.\nFollowing a skirmish in the Phindar system between Imperial forces and the stolen Carrion Spike, Rancit convinced the Emperor to deploy interdictor vessels against the insurgents. Grand Vizier Amedda then informed the Emperor that the Murkhana communications jammers had been discovered by an ISB asset tasked with investigating the find by his case officer. Acting on this information, Sidious interrogated the Koorivar ISB asset Bracchia and his case officer Stellan, who revealed that they had been tipped about the discovery by Naval Intelligence. After viewing the holovid, the Emperor determined that the communications cache had been planted by a high–level Imperial official who was aiding the insurgents.\nMeanwhile, Lord Vader discovered that Rancit was the Imperial traitor and executed him. While Tarkin led Imperial forces against Teller's insurgents in a space battle near the Gulf of Tatooine, Darth Sidious mediated on his quest for galactic dominance. Following the defeat of Teller's insurgency, Tarkin and Vader spent the next three weeks hunting down Teller's collaborators and contacts in a ruthless crackdown. The two briefed the Emperor, who appointed Tarkin as Grand Moff and Governor of the Outer Rim Territories. The Emperor also reshuffled the Ruling Council in the wake of Rancit's execution. He also folded Naval Intelligence back into Imperial Intelligence.\nBy 14 BBY, Sidious had also ordered for Project Auger to begin on the planet Zeffo, which had been home to the species of the same name before their hubris nearly destroyed them. The project saw Imperial mining begin on Zeffo to locate artifacts. The commanding officer, Krane, kept one uncovered artifact secret in order to win support from Sidious by giving it to him personally. However, she died when the cave she chose to hide it in collapsed.\nDuring the Empire's reign, Sidious' interest in the Unknown Regions continued. This came to a head when the crew of the Venator-class Star Destroyer Strikefast, under the command of Captain Voss Parck, encountered the Chiss known as Thrawn in Wild Space. Many years earlier, Anakin Skywalker told Palpatine of this alien and how they worked together. This alien claimed to have a great deal of knowledge on the Unknown Regions. Thrawn was then brought before the Emperor on Coruscant in order to be questioned. Thrawn told the Emperor of threats lurking within the Unknown Regions and how they might one day find the Empire and offered his military skills. The Emperor then deduced that Thrawn's intentions were to help protect his people from these threats. Thrawn assured the Emperor that his allegiance would be to the Empire. Thrawn then revealed that he had known Anakin Skywalker during the Clone Wars, thus proving who he was to the Emperor.\nFor their service, the Emperor promised Captain Parck and his crew rewards. Thrawn however, requested that his translator Eli Vanto stay with him. The Emperor then asked Thrawn to walk with him outside. In his personal garden, the Emperor told the Chiss of his interest in the Unknown Regions. Thrawn then warned that there was great danger to be found there, however, he assured the Emperor that he would share his knowledge of the Unknown Regions. The Emperor ordered that Eli Vanto would be transferred to Thrawn's side and that they would both undergo training at the Royal Imperial Academy.\nIn 9 BBY, after Vader failed to kill Kenobi during their confrontation on a barren moon, the repaired Sith Lord reached out to his master via a hologram, informing Sidious he had dispatched probe droids to hunt down Kenobi, adding that his former master would not evade him again. Noticing Vader's agitation, the Emperor questioned his apprentice whether he was affected by his feelings for his former master, suggesting that said feelings had left him weakened. This prompted Vader to affirm that Kenobi meant nothing to him and that he only served the Emperor.\nWith the Jedi mostly defeated, Sidious felt secure behind his huge galactic military and dominion over most of the known galaxy. Despite this, remaining Separatist holdouts and surviving Jedi would gnaw at his confidence of the longevity of his new Empire. Seeking to secure the center, the Emperor supported mass military excursions into the Outer Rim Territories in an effort to bring more systems under his fold. With his ultimate goal of bending reality into something of his own creation, an omnipotent Empire would allow all the galaxy's inhabitants to be held in his dark embrace. Despite the Jedi being all but extinct, Force-sensitive children were still being born across the galaxy. In an effort to combat this threat, Sidious created the Inquisitorius composed of dark side adepts and commanded his apprentice, Lord Vader, to contact the Grand Inquisitor to hunt them down and destroy them if they did not serve the Empire.\nDuring Vader's hunt for the Hidden Hand, the Emperor contacted his apprentice through a hologram, expressing his disappointment in his failure to track down the criminal syndicate. He stated that they must be crushed at once, as they stole weapons from the Empire and supplied them to the Rebellion.\nFollowing the raid on the Imperial garrison on Aldhani in 5 BBY, Palpatine spoke with Colonel Yularen, giving the ISB direct control of operations going forward and the authority to arrest anyone who was considered a disrupter to the Empire. The next day, the Emperor convened an emergency session of the Senate in order to propose a legislative package of bills and amendments and to officially invoke the Public Order Resentencing Directive.\nDuring the fifteenth Empire Day, celebrating the anniversary of the Empire's rise to power, the Emperor presided over the Imperial Senate on Coruscant with his Royal Guards, and invited Lothal governor Arihnda Pryce to celebrate with him. After the Inquisitor's death, at the hands of Kanan Jarrus and his Padawan Ezra Bridger, the Emperor dispatched his apprentice to Lothal as an \"alternative solution\" to the growing rebel problem. The Emperor was contacted by Darth Vader after he had defeated the Rebel fleet in the Lothal system. Vader informed his master that he had discovered that his former Jedi apprentice, Ahsoka Tano, still lived. The Emperor was pleased with the news that Tano possibly knew the location of other hidden Jedi, and capturing her would allow the Empire to find them and destroy them before they became threats. Although Vader was more interested in finding his former Master Obi-Wan Kenobi, the Emperor told his apprentice to have patience and to send an Inquisitor to hunt down Tano and the other Jedi discovered on Lothal.\nIn 2 BBY, the Emperor promoted the Chiss Imperial Navy officer Thrawn to the position of Grand Admiral for his role in suppressing the rebel insurgency in the Batonn sector. During the promotion however, Thrawn questioned Sidious on the practicality of the Death Star. The Emperor questioned if the reason for Thrawn's worries were because of the threat the station posed to the Chiss species. However, because Thrawn had fulfilled his end of the bargain by sharing his information on the Unknown Regions, he let the issue go. The Emperor then introduced Thrawn to his personal enforcer, Darth Vader. Later, Thrawn would be dispatched to deal with the growing rebel threat.\nLater, the rogue Senator Mon Mothma incurred the Emperor's wrath when she denounced him as a liar and condemned his complicity in the Ghorman Massacre. As a result, Mon Mothma was designated a traitor and Imperial forces were dispatched to hunt her down. Despite the efforts of Grand Admiral Thrawn to trap Mon Mothma and the Spectres in the Archeon Nebula, Hera Syndulla managed to deliver Mon Mothma safely to Dantooine where she gave a speech urging the galaxy to rise up against the Empire.\nAfter Thrawn's defeat at Atollon, Sidious sensed a great disturbance in the Force somewhere on the edge of the galaxy. Therefore, the Emperor summoned Thrawn and Vader to Coruscant for a meeting. During the meeting, the Emperor ordered the two to the planet Batuu to locate a disturbance in the Force that he had sensed, testing Vader on his vulnerability to his past and Thrawn on his loyalty.\nAfter the discovery of a Jedi temple on Lothal, the Emperor directed Minister Veris Hydan to excavate the ruins and uncover its secrets. Sometime thereafter, the Emperor was contacted by Hydan, who informed him that they had reached the roots of the temple and uncovered a mural of the Mortis gods, which was reminiscent of art and iconography found at the former temple on Coruscant. The Emperor told Hydan that he had sensed that the death of Jarrus had altered the fate of Lothal. Vowing to control the conduit between the living and the dead, the Emperor urged his minister to quicken the pace of his work.\nLater, the Emperor used Sith alchemy in an attempt to open a portal to the World Between Worlds where Bridger and Tano were. The Emperor taunted them through the portal and unleashed his power against them, which they were able to hold back. He then caught Bridger's leg and pulled him so that he could get through the portal. However, before he could get through the portal to enter the realm, Tano cut the fiery lasso. The Emperor then tried again but failed as Bridger and Tano made it back to their world. In the process, the Lothal Jedi Temple was destroyed.\nFollowing the defeat of the treasonous Grand Admiral Balanhai Savit and Thrawn losing the funding for his TIE defender program to the Death Star, Sidious spoke with his Chiss Grand Admiral over his private communications display to determine if his loyalties truly lied with the Empire, as Thrawn had worked with members of the Chiss Ascendancy to combat a Grysk Hegemony force that had infiltrated Imperial space. After confirming with Thrawn that Savit had in fact been a traitor, the Emperor turned the topic of discussion to the Chiss officer's loyalties, though Thrawn insisted that his work with the Ascendancy was not treason. Thrawn admitted that the Grysks were primarily a threat to his own people, but he argued that they had taken an interest in the Empire and could want control of the Death Star, which Sidious instantly denied, telling Thrawn that neither the Grysks nor the Chiss would control his station.\nWhile Thrawn denied seeking the battle station for his people and promised to fight against such a situation, Sidious clearly saw the Chiss's divided loyalties. Pondering Thrawn's true allegiances and the other factors at play, Sidious wondered if an alliance between the Empire and the Ascendancy could be useful if Thrawn was correct. However, in such a case, Sidious wanted control of both governments and pondered if Thrawn could be manipulated or persuaded into betraying his kind. Deciding such a possibility required additional meditation and turning his attention to the more urgent matter of the Lothal rebels, Sidious informed Thrawn that he was sending instructions for a chamber to be built aboard the Chimaera. He ordered Thrawn to put down the rebel insurgency on Lothal and bring Bridger to the chamber, which was a portion of the Lothal Jedi Temple he wanted brought aboard \"stone by stone.\" Leaving Thrawn to carry out his duties, he gave the Grand Admiral one last order: once the battle at Lothal was over, he was to return to Coruscant so they could have a \"long long talk.\"\nFulfilling his orders, Thrawn brought Bridger aboard the Chimaera when, in order to stop the Chiss officer from bombarding Lothal's Capital City, the young Jedi surrendered himself to the Empire. After the officer and the Padawan talked about the fate of the Jedi and Lothal, Thrawn brought Ezra to the room that contained the temple portion, bringing Bridger face-to-face with the Galactic Emperor. Since the Emperor was off-world, he used a hologram projection to present himself in his more benevolent, pre-scarred form. Sidious then ordered Thrawn to leave the room, leaving him alone with Bridger and the temple fragment.\nIn an attempt to get Ezra to unlock the portal to the World Between Worlds, Sidious tried to tempt Ezra with the opportunity of reuniting with his deceased parents. Ezra, however, recalling his earlier lesson in the World Between Worlds, decided to reject this offer, knowing he had a family and then proceeded to pull down the Temple into rubble. This caused the Emperor's hologram projection to shift from his benevolent persona to his true form. With his plan in tatters, the Emperor ordered three members of the Royal Guard and three stormtroopers to enter the room and execute Ezra. However, after Sidious deactivated his hologram, Bridger was able to use the Force to crush the soldiers with rubble and escaped. Ultimately making his way to the bridge of the Chimaera, Bridger, having previously ordered his ally Mart Mattin to summon a pod of Purrgil with Frequency Zero, successfully liberated his homeworld from the Empire, as the creatures defeated the blockade in orbit and proceeded to take hold of the Chimaera, dragging it, Thrawn, the rest of the crew, and him into hyperspace. Thus, Bridger unknowingly also stopped Sidious' future plans for Thrawn from becoming a reality.\nLater that year, having deliberately placed a trap inside the Death Star, scientist Galen Walton Erso dispatched pilot Bodhi Rook to Jedha to meet with Saw Gerrera's Partisans and inform the Rebel Alliance of the existence of the planet-killing superweapon. Fearing that the Imperial Senate would learn of the Death Star's existence, Grand Moff Wilhuff Tarkin decided to test the Death Star's superlaser on Jedha City, killing the traitorous pilot and proving that the station worked. Tarkin relayed his decision to the Emperor, who would await for the Governor's report. Director Orson Callan Krennic, however, expressed disappointment that neither the Emperor nor his favored emissary, Darth Vader, would be present for the occasion. This prompted Tarkin to explain that their absence served as a protection for Krennic should another failure occur during the testing of the weapon. Despite the animosity between the commanders, the Death Star fired on Jedha City, destroying it within moments. Soon after, Krennic asked Tarkin if he would report to the Emperor that his efforts had paid off, only for Tarkin to reveal that he would instead inform the Emperor that he would be taking executive control of the Death Star.\nNot long after, Rogue One squad, led by Jyn Erso and Captain Cassian Jeron Andor, as well as a large portion of the Alliance's fleet managed to steal a complete technological readout of the Death Star from an Imperial Research Facility on Scarif. This loss, as the space station neared completion, was a bitter, and potentially fatal, blow to the Emperor's long-term plans. In order to deal with the problem, Sidious sent Vader to retrieve the Death Star plans.\nVader destroyed the rebel flagship and much of the rebel fleet. However, the plans had escaped aboard the Tantive IV, a CR90 Corvette, in the hands of Princess Leia Organa, the Imperial Senator for Alderaan and a suspected Rebel sympathizer. Vader soon trapped the corvette over Tatooine, boarding the ship and taking the Princess as a hostage. Although Vader failed to acquire the plans, he arrested Organa as a traitor and, as such, provided Sidious with the excuse he needed to dissolve the Imperial Senate. One of the last remnants of the Galactic Republic, Sidious had always planned to remove it but he needed to wait for the Death Star to be completed so that order could be maintained through fear instead of representation in the Senate. With the space station nearly completed and a Senator accused of supporting the rebellion, Sidious ordered the dissolution of the Senate. Legislative power was transferred to regional governors and select members of the Imperial military, such as Sidious' ally, Grand Moff Tarkin, allowing the Emperor to gain complete control over the Empire with no checks to his power.\nAfter Vader's duel with Obi-Wan Kenobi, Vader reported to Sidious the death of Kenobi, to Sidious' surprised glee. However, he was still troubled by Kenobi's last words, his body's disappearance upon death, and the still-mysterious whereabouts of Yoda. Sidious resolved to keep the Empire strong and to destroy the Rebellion.\nDespite Sidious's careful planning for seizing complete power over the Empire, his plans were jeopardized when the Rebel Alliance launched an attack on the Death Star during the Battle of Yavin. As the Death Star was about to fire, Sidious sensed a disturbance in the Force, merely a blink from his point of view. In that moment, the Rebel pilot Luke Skywalker launched his proton torpedoes, succeeding in destroying the Death Star, killing Tarkin and most of the Empire's high-ranking officers, while also leaving Sidious concerned of the pilot's connection to the Force.\nThe only survivors were Sidious's apprentice, Darth Vader, who had failed to defend the space station and General Cassio Tagge, who had been sent to investigate Princess Leia Organa's claims about an active Rebel base on Dantooine. The Rebels' victory at Yavin was followed by another victory on Cymoon 1, where a Rebel team destroyed the Empire's main production facility, Weapons Factory Alpha. Several other assaults by Rebel forces, such as the bombing of a supply base on Imdaar and the shipyards at Kuat, harassed the Empire in the weeks following the Death Star's destruction. In addition, the aftermath of the Death Star's destruction saw a rise in pirate activity against Imperial supply convoys as the galactic government was no longer seen as invulnerable. The Empire's hold over vital worlds also began to slip; one of the worlds which began to question Imperial domination was the mining world of Shu-Torun. Ruled by a mercantile nobility called the ore-dukes, Shu-Torun provided important materials the Empire required for its construction projects, including the development of the second Death Star, and the Emperor constantly demanded higher tithes, especially in the aftermath of the Battle of Yavin. Opposing this unsustainable increase, the Ore-dukes convinced their aged King to rebel against the Empire.\nDetermined to prevent the destruction of his Empire, Sidious reorganized Imperial High Command by appointing General Tagge as Grand General with command of all military matters. Tagge had argued against the strategy of having the Death Star as the Imperial military's sole weapon, believing that the military was all that was needed to safeguard the Empire and that depending on a single weapon was inviting catastrophe. Vader, who had failed to protect either the Death Star or Cymoon 1, was demoted and ordered to serve under Tagge as the Grand General saw fit. The Emperor gave orders that the military was to focus its attention on the conquest of the Outer Rim until the time when the second Death Star was completed. Tagge and Vader begun targeting the pirates for destruction as well as cracking down on criminal elements which had gone unchecked in the past, such as the Son-tuul Pride.\nThe only ones spared the Empire's wrath were the Hutts, who had entered into an alliance with the Empire. Needing raw materials for Imperial military production and knowing that the Hutts could provide them for the right price, Sidious sent Vader to Tatooine to negotiate an agreement with Jabba for their support in exchange for the Hutts being allowed to maintain their power base in the Outer Rim and the underworld. The destruction of competitors, such as the Son-tuul Pride, also allowed the Hutts to profit from the alliance as their position in the underworld fell to them.\nWhen Shu-Torun rose up in open rebellion against the Empire following Darth Vader's brutal suppression of an assassination attempt made against him by the King, Sidious sent his apprentice back to the mining world with a large military force at his command. His orders were to end the Ore-dukes' rebellion and preserve the Imperial-backed government led by Queen Trios, whom Vader had placed on the throne after her father's treason.\nAt some point following the Battle of Yavin, the Emperor's luxury yacht Imperialis was stolen by the gambler Lando Calrissian and his associates while it was undergoing repairs at Sienar Fleet Systems' Orbital Shipyard CC-24 above the planet Castell. Grand Vizier Amedda informed the Emperor of this loss. In response, the Emperor dispatched three Star Destroyers commanded by Commodore Idel, Captain Shan, and Captain Conro to recover his ship. These Star Destroyers destroyed CC-24 to punish the base's Commander Pasqual for failing to protect the Emperor's property. After the Star Destroyers failed to recover the ship, the Emperor dispatched the bounty hunter Chanath Cha to recover the vessel. Should she fail to recover it, he instructed her to destroy the Imperialis to avoid letting its secrets fall into the hands of others. Unwilling to harm her former friends Lando and Lobot, Chanath opted to destroy the vessel instead. The wreckage of the Imperialis eventually ended up on Quantxi, the junk moon of Ord Mantell.\nIn the aftermath of Darth Vader's failure to prevent the Death Star's destruction, Sidious was approached by one of the scientists involved in the Tarkin Initiative: Doctor Cylo. One of the specialists who had saved Vader's life after sustaining his fatal injuries on Mustafar, Sidious had kept him on and funded his research into upgrading organic species into cybernetically-enhanced subjects. Cylo believed that organisms could only survive by adapting with technology, and eliminating weaknesses. He also believed that in the new world he foresaw, the Force would be rendered obsolete. Although Sidious dismissed these thoughts by saying that everything was of the Force, he was curious to see what these scientists could do unconstrained by the presence of the Old Republic or the Jedi.\nDuring the twenty years which had passed since the end of the Clone Wars, Cylo had worked to create several subjects which possessed the best genetic and cybernetic upgrades that he could provide, preparing them as potential enforcers for the Empire. With Vader's disgrace clear and the Emperor's need for strong elements to prevent further damage being done to the Empire, Cylo suggested that he replace his apprentice with one of his subjects. Vader's role would be reduced to a ceremonial one, while the doctor's subjects would enforce Sidious's will throughout the galaxy. Intrigued by Cylo's proposition, Sidious agreed to provide his subjects with a chance to impress him.\nHowever, unbeknownst to the scientist, the Emperor had come to believe that Cylo had grown too powerful as a result of his involvement with the Tarkin Initiative. He could do nothing about it because of the doctor's connection with several of the Empire's greatest scientific minds, and removing him could cause a splint among them. When Cylo presented him his plan, however, Sidious knew that he could cause him to overplay his hand which would make him a traitor to the Empire. Knowing that Vader would be the perfect foil to Cylo's subjects, the Emperor made sure the two men met. The day he informed Vader of his punishment for his failure at the Imperial Palace on Coruscant, he also summoned Cylo for a private meeting. When his apprentice asked who the scientist was, Sidious refused to answer him, leading Vader to conduct his own investigation into the Emperor's secrets.\nAfter Vader's hired bounty hunter Krrsantan successfully apprehended Cylo in his fourth body, he revealed under torture the location of his secret research base. The Sith Lord made his way to the base where he began an assault to find his potential rivals and destroy them. However, Cylo-IV's death at the hands of Vader's torture droid 0-0-0 had not killed the scientist: having recreated himself as an immortal system, whenever one of Cylo's bodies died, another was activated on board his research base. Cylo-V had guessed that Vader had discovered the location of his base and that he would be coming when he was activated. As such, he contacted the Emperor so that he could give him a demonstration of his subjects. Sidious arrived as Vader was about to kill the scientist. Only his intervention saved Cylo-V from suffering his predecessor's fate. With all the elements for his plan to begin, the Emperor demanded Cylo start the presentation.\nAs they fought with Vader, Cylo presented to him the subjects that he had been working on over the past twenty years: Aiolin Astarte and Morit Astarte, twins born to a family which had supported the Separatists during the Clone Wars, who had been upgraded genetically and cybernetically to possess abilities similar to the Jedi and Sith of old without having to use the Force; Tulon Voidgazer, a genius scientist involved with high-level R\u0026D development before she was upgraded with a cloud of drone-droids, connected directly to her brain, who allowed her to see and fight through them; Commander Karbin, a Mon Calamari veteran of the Clone Wars who had spent eighteen years on life support after his ship crashed, and who had been upgraded into a model resembling the late General Grievous and trained in lightsaber combat. Finally, Cylo had created a system which could possess various hosts, tested on a Trandoshan, and remove any traits the Emperor would not desire, such as pain and emotions. Sufficiently impressed, Sidious demanded a real demonstration of their abilities. Vader and the subjects began to fight to the death against one another, and the Trandoshan was killed by Morit before the Emperor called a stop to the fight. He announced that he would find a use for every one of them, but that only one would win a place as his enforcer. The sole rule he established was that they not kill each other; or make sure if they did that he not find out. As he made to leave, the Emperor called Vader to speak to him privately.\nWhen they were alone, Sidious complimented Vader on his ability to discover Cylo's project. He was also impressed with his apprentice's ability to act beyond his knowledge, and how he had been able to acquire a private army of Separatist-era commando droids to use for his own ends. Vader was displeased with being forced to prove himself against Cylo's subjects, especially as he considered them blasphemous to the ways of the Force. Sidious chastised him for reprimanding him, reminding him that he was the teacher while Vader remained the apprentice: his task was to learn what Sidious knew, and Sidious's was to discover what there was to teach. The Emperor also revealed that he needed Vader to overcome the disappointment he had caused in him when he almost fell on Mustafar, and prove himself worthy of carrying the name Sidious had given him when he had pledged himself to the Sith. With his business concluded, the Emperor left Cylo's base and returned to Coruscant.\nAt the Emperor's directive, Cylo's subjects were placed at Grand General Tagge's disposal, while the doctor acted as a consultant for the military. The rivalry between them and Vader eventually led to the confrontation with the Rebel Alliance on Vrogas Vas. As a result of Karbin's manipulation, Vader crashed on Vrogas Vas when he confronted three Rebel squadrons. One pilot chose to crash his X-Wing into Vader's TIE fighter to bring him down. On the surface, Vader confronted a large force or Rebel soldiers assembled by Leia Organa to eliminate his threat. The confrontation culminated in a battle between the Sith Lord and Karbin, which resulted in the latter's death. The Rebellion suffered important losses on Vrogas Vas, and Karbin's disappearance led the Emperor to search for him. Vader eventually made his way to Coruscant where he presented his master with Karbin's corpse. Although Sidious was annoyed that his apprentice had violated his rule, he was impressed when Vader challenged him to provide him with another way to prove himself worthy of his trust. The Emperor gave his apprentice command of the military force he was sending to Shu-Torun to preserve Queen Trios's hold on the throne. However, he also sent Cylo and his remaining subjects, apparently on Grand General Tagge's request. Before Vader left the Imperial Palace, Sidious warned him not to disappoint him, as he relied on him more than he let on.\nVader's campaign on Shu-Torun was a success, and the rebellious Ore-dukes were brought down. In the middle of the battle, Cylo attempted to have his rival killed by forming an alliance with Baron Rubix, the leader of the Shu-Torun rebels. Vader evaded the trap and, with the help of a dying Aiolin Astarte who had been betrayed by her brother, secured the proof needed to prove the doctor's treachery from her memory circuit. Once Vader's business was concluded on Shu-Torun, he informed the Emperor of Cylo's betrayal and told him that he had fled with his remaining subjects. Pleased that his plan had worked, Sidious summoned Vader to him on the shipyard where the Executor-class Star Dreadnought Executor was being built.\nAt Kuat, the Emperor revealed his fear of Cylo's growing influence to his apprentice, the doctor's role in rebuilding him, and the purpose of the contest for his position as an enforcer. Vader recognized that, should one of his rivals had been the last one standing, the Emperor would be having the same conversation with them. However, he declared that he had succeeded and that he represented the strength of the dark side. Sidious was pleased with his apprentice's success and ordered him to find Cylo and destroy him.\nWhile the Executor was still under construction, Cylo's fleet attacked the dreadnought. During the assault, one of his creations, Tulon Voidgazer sabotaged the vessel. Sidious contacted Tagge, demanding to know what was happening, however the general and his crew were knocked unconscious by toxic gas. The Emperor was then informed by one of his guards that they were trapped.\nAfter Vader killed Cylo's minions and destroyed his current body, he informed the Emperor of his success. Pleased with his apprentice, Sidious told him to finish his mission then return. At that moment, the archaeologist Dr. Aphra entered his private chambers. She then claimed they had a \"mutual friend\" and that she had things the Emperor needed to know.\nAfter Vader finished off Cylo for good, he returned to his master. It was then that Sidious told Vader that Aphra had informed him of all of his secret endeavors, many of which had been technically treasonous. However, rather than chastise or punish Vader, the Emperor told his apprentice that he was impressed with his ambitions and that he was everything he could have hoped for. He then left Vader to deal with Aphra as he pleased. Due to Tagge's failure, the Emperor demoted him and transferred command of the Executor and its fleet to Vader. Pleased with his apprentice, he left him to \"educate\" his subordinates of the future.\nThree years after the Battle of Yavin, the Empire had managed to gain a major victory by capturing the Rebel base on the ice planet of Hoth. However, something bigger was growing. Sitting within his Imperial Office, Sidious sensed a great disturbance in the Force. It was not unlike that which he had sensed within the moments before the Death Star's destruction. Sidious sought to see within the disturbance, which brought him to a vision of a boy holding a crimson lightsaber, having seemingly decapitated the Emperor's Royal Guards within his very own Imperial Office. As he watched, the boy approached a seated Sidious within the vision, calling to the Force to choke Sidious' doppelganger. The doppelganger attempted to electrocute the boy with Force Lightning, but failed to stop him. The doppelganger attempted to call upon his lightsaber but instead the boy commanded it and turned the saber on midflight, eventually overpowering the doppelganger when the Sith Lord's own saber struck him down. A familiar voice then called to the boy, who proceeded to walk to the same spot the real Sidious now occupied. The boy knelt in front of the hidden figure as the voice noted that the boy had done well. Sidious then realized who the voice belonged to: That of Anakin Skywalker. Sidious concluded that this must be a dream of Anakin's.\nProbing deeper within the vision, Sidious witnessed the scene of the unmasked and unburnt Anakin Skywalker walking beneath the sight of endless Star Destroyers, walking together with a figure that seemingly resembled him as well as the looming figure of the long deceased Senator Padme Amidala, now alive once more. The figure referred to Anakin as Father and to Padme as Mother. Anakin then motioned to the fleet, referring to the boy as Luke, stating that the fleet that flew above them was now the most powerful in the galaxy. Having witnessed this, Sidious was thrown out of the vision, but he had witnessed enough. From these pieces he deduced that Vader's prior actions made supposedly under the guise of destroying the Alliance leadership were actually motivated by a desire to find his son and shape him to his vision. Sidious then resolved to give Vader the resources to do just that while waiting for Vader to make a mistake. When he made that mistake, Sidious would be ready to take advantage of it for his own purposes and ensuring Vader's simultaneous downfall. With Darth Vader aboard his command ship, Executor, the Emperor ultimately contacted the commanding officer of the vessel, Admiral Piett, telling him to have Lord Vader contact him immediately. Vader did as he was instructed and was told of his son, Luke Skywalker, fully aware that Vader was knowledgeable of this information. The Emperor then proceeded to state his desire for the elimination of this threat, yet Vader suggested that young Skywalker could become an ally. With calculated words of approval, the Emperor allowed his enforcer to pursue this possible \"asset.\" The cloaked master then left Vader to find Luke Skywalker after his apprentice pledged to confront the offspring of Anakin Skywalker and either bring him to the Emperor or have his son destroyed. While Vader would make a failed attempt to have Luke join him and help him in overthrowing Sidious, Sidious planned for Luke to kill Vader and become his apprentice.\nDarth Vader eventually lured Luke Skywalker to Cloud City on Bespin, where the Sith Lord attempted to capture Skywalker in carbonite and transport the Jedi-aspirant to the Emperor. However, Skywalker evaded capture and was confronted by Vader in a duel on Cloud City. There, with the Jedi-aspirant beaten by a precarious ledge, Vader divulged knowledge of his relationship with Skywalker, his son, and gave an ultimatum for the youth: to join forces—as said to be destiny—with his father, Darth Vader, or die. However, Luke Skywalker rejected his newfound father, and allowed himself to fall into the abyss.\nHaving failed in recruiting or destroying Skywalker, Vader returned to the Executor, only to be interrupted by its crew, which reported the Millennium Falcon's escape from Cloud City. Upon the Executor's bridge, Vader sensed the presence of his son aboard the Falcon. Calling out for the young Skywalker to join himself in vain, the father of Skywalker watched as the Falcon slipped past Imperial forces with its fully functional hyperdrive.\nAngered, Lord Vader left his flagship aboard an Imperial shuttle with a forensics droid and a unit of death troopers for revenge against those responsible for withholding the knowledge of his offspring's survival, altering the droid's systems that would force its motivator to trigger a self-destruct sequence should the droid reveal any information to anyone—including Imperials and the Emperor himself—regarding their quest.\nMeanwhile, the Emperor had Grand Vizier Mas Amedda contact Admiral Piett by hologram. After Piett's confirmation on the escape of the Millennium Falcon, the Grand Vizier relayed the Emperor's demand for Vader to contact him immediately, yet an officer alerted Piett of the departure of Lord Vader's shuttle as the admiral reached for his comlink to Vader. Cautiously wording his response, Piett told Vizier Amedda of Vader's unavailability. Hearing word of Vader's failure and his leave from Imperial command, the Emperor began to laugh before the holo-transmission of Piett while he sat on his throne in his palace on Coruscant as Amedda stood next to him.\nWith the assistance of Sabé and her Amidalans, Vader eventually discovered the true fate of his deceased wife, traveling to Polis Massa and viewing a recording of her final moments, during which she said there was still good in her husband. After uncovering this, Vader returned to his master on Coruscant. Upon his arrival, Sidious chastised his apprentice for wallowing in his grief. He then told Vader that he would have to start again with fear before attacking his apprentice with Force lightning. In the ensuing struggle, Amedda revealed the Emperor's knowledge of Vader's failure to turn his son and collusion with the Amidalans. Vader was then attacked by the Emperor's guards before subduing them and Amedda with a Force choke. While impressed by Vader's strength, Sidious used the Force to crush Vader's limbs, telling him to forget everything but his master. With only his right arm remaining, Vader was told by Sidious that he would have to find himself again or die.\nAccompanied by a pair of death troopers, Sidious returned Vader to Mustafar and left him on the very shore where he had found him. He then told his apprentice that he would have to rebuild himself without using the Force before leaving him to do so. Back on his shuttle, Sidious was informed by Amedda that Vader was heading for the ruins of the Techno Union installation, which was filled with machinery that he would most likely use to rebuild himself and kill Sidious. To this, Sidious revealed his own plan; to remind Vader of his pain in order for him to build himself back up to power. For this purpose, he would send Ochi of Bestoon, a Sith huntsman to hunt down his apprentice for sport, saying he would turn Vader's anger back to pain as many times as it took.\nHowever, much to Sidious' dismay, Vader fought off his assassin and discovered a Sith wayfinder which led the way to the hidden Sith world of Exegol in the Unknown Regions, where much of Sidious' spare power and resources were kept in reserve. Defeating an Imperial fleet and a Summa-verminoth guarding the planet, Vader reached Exegol with Ochi in tow. Stepping outside of his Sith Citadel, the Emperor was met by Ochi, who warned him of Vader's arrival. Looking up at his apprentice as he rode on the back of the Summa-verminoth, Sidious asked Vader what this experience had taught him, to which Vader replied that he would teach his master what it was to fear. Vader then rode the Summa-verminoth into battle, to which Sidious sent out two crustaceous creatures to attack the monster. Though the creatures were defeated, Sidious then used the Force to crush the Summa-verminoth himself, forcing Vader to return to ground level as Sidious went back inside the Citadel. As Vader and Ochi followed him inside, Sidious taunted his apprentice through the Force, explaining to him the horrors that he would find.\nWithin the Citadel were large vats containing bioengineered organisms strong in the dark side of the Force, along with countless Sith statues, Sith guards, Sith cultists and a jar containing the severed hand of Vader's son. Though these creations were not Sith, Sidious claimed that any one of them could replace Vader if he were to fall. After fighting his way through his master's monsters, Vader was followed by Ochi to one of the Citadel's lower levels. There, they discovered an entire fleet of star destroyers, each armed with a planet-destroying cannon. Just beyond this fleet was a massive dome filled with red light and piercing screams. Despite Ochi's attempts to dissuade him, Vader entered the dome and came upon his master's greatest secret; a subterranean mountain of kyber crystal, bled red by the Sith cultists who kept it in constant pain. Sidious explained that he did this in order to power the cannons of his fleet. When the crystal was cut, it screamed in pain and sent out a wave of power, knocking off Ochi's helmet and burning his unprotected eyes. Vader suffered as well as Sidious mocked him for attempting to claim his power. Sidious then told his apprentice that if he continued to walk with him, he would never escape his pain. But only by walking with him would he be able to share his master's power. When Sidious asked his apprentice if he had chosen, Vader replied \"Yes, my master\" before departing from Exegol along with Sidious, Ochi, Amedda and Sly Moore.\nAmong the chaos of these events, Sidious and the cultists were unaware that his son, by then known as \"The Abomination,\" who had been wondering the Citadel and watching from afar, had escaped with the help his symeong slave friend Dathan aboard the ship Vader had arrived with Ochi aboard, escaping from Exegol to live a life away from the dark side of the Force and to shun his cruel Sith father, ultimately rejecting the ways of the Sith.\nReturning to Coruscant, Sidious brought Vader to the very facility where he had first been restored. As Vader was repaired once again, Amedda warned Sidious of his intentions to kill him. Sidious replied that with Vader now knowing the limits of his role, he would find a more appropriate target for his hate, assuring both Amedda and Moore that he was beyond Vader's reach and they were beneath his notice. Once Vader was repaired, he asked Sidious his will, to which Sidious told him to decide that for himself. Vader then called over Ochi, who had just been given a cybernetic visor so he could continue to see. After gaining the Emperor's approval, Ochi departed with Vader in a Lambda-class shuttle to begin their next assignment; killing Luke Skywalker.\nThis quest eventually led Vader to the Auction for Han Solo held by Lady Qi'ra of the newly reemerged crime syndicate Crimson Dawn. Vader retrieved the stolen smuggler from the auction on Jekara in order to lure Luke Skywalker to him. However, this move drew the ire of the Grand Hutt Council, who attacked the Executor to reclaim Jabba's prize from the Empire. While Vader engaged his son in a dogfight over the planet, Admiral Piett called Vader for assistance against the Hutt attack, to which Vader replied that the attack was not his concern. In turn, Piett contacted the Emperor himself to appraise him of the situation. Sidious then told the Admiral to inform Vader that eliminating the Hutt Council was his new priority. Vader conceded and allowed his son to escape before slaughtering the Hutt Council, ending their attack while Boba Fett retrieved his bounty from the Executor and brought him to Jabba's Palace on Tatooine. As Vader choked Moore on the Executor for betraying him, he was contacted by Sidious, to which he released his grip on the Umbaran and knelt before the Emperor. After restating his loyalty to his master, Vader was instructed by Sidious to hunt down and eliminate Crimson Dawn's agents within the Empire.\nSometime later, Vader and his followers returned to Coruscant and struck down all of the Royal Guards and aides in the Emperor's throne room. Unfazed by this, Sidious pointed out Vader should have kept one of them alive for questioning. When Vader asked him if they were loyal, Sidious said they were loyal to strength, which Vader showed them. However, only one of them was Crimson Dawn, meaning that Vader's list was flawed. When Sidious questioned if his apprentice already knew that, Vader hesitated before assuring his master that he would bring him order. Stoked by attacks from Crimson Dawn, the most powerful syndicates in the criminal underworld, except for the Hutts, began to fight amongst themselves. Displeased with the growing Syndicate War, Sidious ordered Amedda to contact his apprentice and inform him that his intervention was required. As he returned to his throne room, the Emperor was informed by Amedda that the syndicates were allegedly vying for his favor. Sidious then decided to use his own fleet to quell their exuberance. But as he ordered Amedda to inform Piett and Veers, his entire Royal Guard suddenly fell over dead before him.\nIn the months after the events on Bespin, Luke Skywalker would continue to hone his skills in the light side of the Force; nonetheless, Sidious still believed Skywalker liable to turn to the dark side.\nIn an attempt to gain a new Sith apprentice as well as end the Galactic Civil War, Sidious purposely allowed the Rebels to obtain the plans of the new Death Star under construction over the forest moon of Endor. Following the presumed destruction of a vast majority of the Rebellion in a doomed confrontation against an unknowingly armed and operational Death Star, Sidious planned on commencing the deployment of some of the largest invasion fleets known in galactic history to blockade the known rebel strongholds of Mon Cala and Chandrila until the Death Star II could destroy them, permanently ending the Rebellion and all those that would oppose his rule through sheer terror.\nThe Emperor went to the second Death Star intending to oversee the ultimate defeat of the Rebellion and the Jedi, using himself as additional bait to draw the Alliance out. A massive amount of Imperial personnel, including two astromech droids, witnessed their Emperor's momentous arrival. Shortly before his meeting with Luke Skywalker, the Emperor sensed the existence of a mysterious, malevolent force in the farthest reaches of the unexplored regions; he suspected it to be the possible source of the dark side of the Force, but even the Emperor wasn't sure who or what he was sensing.\nWhilst on the Death Star, Luke Skywalker, Han Solo, Princess Leia, and Chewbacca managed to sneak past the shield and land on the Sanctuary Moon. Vader, who had been told to dispatch the fleet to the moon and to remain on a command ship, sensed his son's arrival. Because of this, he journeyed to the Death Star, where he told the Emperor that he sensed Luke's arrival. Surprised that he himself was unable to sense it, the Emperor commanded Vader to go and wait for him, saying that he had foreseen Luke seeking Vader out and surrendering to him personally out of compassion for his father.\nShortly after Skywalker and the rebel strike team landed on Endor, the Emperor summoned his secret protégé, Admiral Gallius Rax, for a secret meeting aboard his throne room on the second Death Star. Sensing a shatterpoint approaching, Darth Sidious warned Rax that it may soon be time to implement the Contingency. He then ordered Rax to take the Executor-class Star Dreadnought Ravager into the Vulpinus Nebula and hide until the events of this shatter point had resolved. He also told Rax that there would be others he had to call to his side.\nOnce Luke surrendered, Darth Vader brought his son to the space station and his master's throne room. The Emperor greeted Luke, dismissed the guardsmen and removed his chains. Luke was told that the Emperor planned to turn Luke to the dark side and that all that has happened on the Moon was all his plan. The Emperor also managed to explain that his father was irredeemable and could never be turned from the dark side. Sidious also had a surprise in store for the Rebels. When the Alliance Fleet arrived, the Death Star's superlaser was operational, contrary to what the Rebels had been led to believe. The Death Star was able to destroy several of the command ships, but the Rebels both on the surface and in space managed to press forward with their attack, as Lando was counting on Han to destroy the Shield Generator.\nLuke was then manipulated by the Emperor, who told him of his friends' impending doom and Luke was told that he would soon become his apprentice. Luke at first resisted, but as the Emperor continued to taunt him, Luke grew angrier and then grabbed his lightsaber to strike the old man down. Darth Vader intercepted Luke's strike and the two began to engage in a duel much to the Emperor's delight.\nLuke was first able to calm himself, refusing several times to continue fighting his father. Luke attempted to hide from Vader as their fight became more intense but Vader was able to sense his son's thoughts and learned that Luke had a sister. With this knowledge, Vader told Luke that if he did not turn to the dark side, perhaps Leia would. The threat of losing his sister enraged Luke and drove him to angrily attack Vader.\nAfter Luke cut off Vader's mechanical hand, Sidious betrayed Vader by instructing Luke to take Vader's place by his side, much like how he betrayed Dooku and had him replaced with Vader. However, Luke began to see what had happened and that he was dangerously close to becoming like his father was now; a slave to the dark side of the Force. Luke threw away his lightsaber and turned to face the Emperor. He told the Emperor that he would never turn to the dark side and that he was a Jedi, like his father before him.\nAngered by Skywalker's defiance, the Emperor unleashed a torrent of Force lightning upon him, forcing him onto the floor. The Emperor then proceeded to torment Luke, remarking that his rudimentary skills were no match for the power of the dark side. Meanwhile, Darth Vader watched his son struggle and plead for him to intervene, with Sidious threatening to kill the defenseless, young Skywalker; unbeknownst to Sidious, this was troubling Vader. Ultimately his concern and compassion for his son, caused the former Anakin Skywalker to wake up and save Luke. The redeemed Anakin grabbed the Emperor, and threw him off a ledge down the Death Star's reactor shaft to his imminent death. Firing his lightning upward as he fell, the Emperor apparently could do nothing but scream as he went the long way down towards the second Death Star's reactor, causing a great explosion upon hitting it and releasing a light blue wind which encompassed the throne room before falling back down the shaft.\nThe Reborn Jedi Knight Anakin Skywalker had killed Sidious and destroyed the Sith. With his armor badly damaged by the Emperor's lightning, Anakin's decision to save his son's life would cost him his own. Before passing away into the Force, a dying Anakin requested Luke to remove the helmet Sidious forced him to wear all those years so he could finally see his son's face with his own eyes. Luke tried to convince Anakin to let him be saved by him, but Anakin told Luke that he already did and that he was right about there still being good in him, despite all that he had done, before dying peacefully. By destroying Sidious and the Sith, Anakin brought balance to the force, ultimately fulfilling the ancient prophecy of the Chosen One as Qui-Gon Jinn had believed he would thirty-five years earlier. With this his nightmarish era of tyranny died with him. Or so the galaxy believed, as Sidious was not so easily destroyed.\nWhile he died in every natural sense of the word, even death wasn't the end for Sidious. When betrayed by Anakin Skywalker aboard the second Death Star, Sidious had little time to realize that his apprentice had turned on him much like he once did with Darth Plagueis, but unlike his former master, he had prepared himself for Skywalker's betrayal. Calling on all the power of the dark side of the Force, the Emperor transferred his consciousness far, far away as his empty body kept falling towards the battle station's reactor to his death.\nFollowing the Emperor's demise, the Empire attempted to suppress the true outcome of the Battle of Endor. In the Anoat sector, which was cut off from the rest of the galaxy by an Imperial blockade in the days following the attack, Imperial propaganda claimed that the attack on the second Death Star had failed and the rebellion was no longer a threat. Rumors of the Emperor's death were dismissed as treasonous fabrications by Governor Ubrik Adelhard. Although several holovids were circulated to show that the second Death Star had been destroyed, both rebels and Imperials around the galaxy discussed whether the Emperor or Darth Vader had really died or not, as no one was sure what exactly happened. Many Imperial messages surrounding the Emperor's death contradicted each other; some Imperials like Grand Moff Lozen Tolruck suggested that the Emperor had escaped the second Death Star through miraculous means, others wildly claimed that the Emperor was still leading the Empire from beyond the grave and some simply refused to acknowledge for months the Emperor's demise.\nThe Emperor also posthumously issued Operation: Cinder to a select group of Imperial officers, including Admiral Garrick Versio and Captain Lerr Duvat, which called for the scouring of multiple worlds, including his own homeworld of Naboo. The days following the Emperor's death were chaotic, as massive uprisings, which the Empire tried to cease, took place on thousands of planets to prove that the rebels had been right all along about public sentiment toward the Empire. Months after Endor, dark side adherents such as the Acolytes of the Beyond came to worship Vader and the dark side of the Force on planets across the galaxy such as the planet Taris.\nAs several New Republic soldiers were discussing what they would do if Sidious' body had been recovered, a Mon Calamari soldier of the 61st Mobile Infantry expressed his wish that the Emperor had survived Endor, as that would have allowed him to face trial for every crime. While searching the Hall of Imperial Register on Coruscant in 5 ABY, Grand Admiral Rae Sloane discovered that the Emperor's personal Super Star Destroyer Eclipse had mysteriously disappeared instead of being destroyed by the New Republic as reported in the Imperial charts. She also found an image crystal showing a still image of Sidious and several Imperial Guards, stormtroopers, and officials including Wullf Yularen, Dodd Rancit, Terrinald Screed, Grand Vizier Mas Amedda, and Gallius Rax. Rax had since risen to the rank of Fleet Admiral and was Sloane's secret puppet-master. Following the Attack on Chandrila, Rax brought the Empire to Jakku.\nThough Rax claimed that he was testing the resolve of the Empire before a showdown with the New Republic, Rax secretly intended to carry out the Contingency. The Contingency involved orchestrating a battle between the Imperial and the New Republic fleets and destroying the two belligerents by detonating Jakku's core. The Jakku Observatory contained a deep borehole which led to the planet's core. Rax planned to pour various Sith artifacts into the borehole in order to activate the planet's self-destruction. In secret, Rax had arranged for himself and several \"worthy\" Imperials including Brendol Hux, his son Armitage Hux, and a contingent of child soldiers to flee into the Unknown Regions. Sloane managed to stop Rax's plan to destroy Jakku with the help of the rebels Norra Wexley and Brentin Lore Wexley. Despite perishing on Jakku, Rax succeeded in fulfilling his master's orders to bring about the collapse of the \"Old Empire.\"\nEventually, the legacy Darth Sidious left behind ended up becoming the basis of the regime that developed into the First Order, the Empire's successor, led by the mysterious Snoke, who took over the position of Supreme Leader of the Order. After wiping out most of what remained of the Imperial leadership, with several exceptions such as Armitage Hux, Snoke went to discover several truths about Sidious, such as the fact that Sidious' Contingency had always been a two-fold plan, one that involved ensuring the Empire's rebirth among the survivors of the Old Empire.\nIn 34 ABY, thirty years after the Battle of Endor, Sidious's voice was heard during a Force vision experienced by the Jakku Force-sensitive scavenger Rey at Takodana Castle. Sometime afterward, while teaching Rey on Ahch-To, Luke Skywalker cited the rise of Darth Sidious and the Empire he created along with his father as a failure of the Jedi Order.\nSending his consciousness towards a cloned body of his own creation designed with Clone Wars era technology by the Sith Eternal, a secret cult of Sith loyalists who continued to follow the religious traditions of the Sith and sought to resurrect their order, Sidious took his first breath as he jolted to a new awareness, but it was one of pain, as he realized the vessel he settled in was temporary. This was at Sidious' Sith Citadel on Exegol, which he had planned and prepared to make his permanent seat of power during his reign as Emperor, and he took possession of the ancient Throne of the Sith. Sidious however did not return unscathed. Because of his timely intervention, Sidious was able to prevent his demise unlike his own master Plagueis, but while he was able to stave off death with the cloning technology and concentration of dark side energy on the planet, immortality eluded the dark lord. Additionally, his new body was insufficient for containing his spirit, due to his power in the dark side of the Force being so immense, and consequently began to decay.\nBuoyed by the faith of the Sith Eternal cultists on Exegol, Sidious fought to survive in his rotting, weak, and temporary vessel. His body soon was unable to move on its own, and he took on a ghoulish, undead appearance with missing appendages and eyes clouded over with cataracts. Sidious was mobilized through the use of an Ommin harness, a mechanical spine once worn by Ommin, an ancient Sith king, and the decay of his body was slowed by vials of restorative fluid.\nDue to his immobility, Sidious was unable to leave the planet and forced to live in exile for years, but while his body was broken his mind was sharper than ever and his spirit unbound, and the fallen Emperor over the ensuing decades patiently plotted his return to power as Emperor and a Sith Lord, forging a sinister plan to take ultimate revenge on the Skywalker family, halt the restoration of the Jedi Order, and decimate the New Republic.\nOn Exegol, other Sith cultists had gathered to venerate the ancient Sith Order and swear fealty to the last Sith Lord, Sidious. These followers venerated his efforts to bring about a new Sith Empire and labored to rebuild the Empire from Exegol as a true Sith Empire. To this end, Sidious' underlings crafted a vast armada of planet-killing warships, the Final Order. From the shadows, Sidious plotted his return to power, and forged the remnants of the Empire into the First Order while he manipulated the New Republic. Once deployed from Exegol, the Final Order would bolster the forces of the First Order military, allowing the regime to finalize its subjugation of the galaxy. The Sith Eternal labored for a generation, raising children in secret military camps, while building war machines in secret factories and shipyards.\nSith loyalists served on the executive boards of corporations such as Kuat-Entralla Engineering and Sienar-Jaemus Fleet Systems, which allowed them to funnel assets critical to their domineering machinations through subsidiaries to Exegol. Under Sidious, the children of the Sith Eternal were raised to covet the religion of the Sith, while being ingrained with the utmost loyalty to their Emperor. Their efforts yielded legions of Sith troopers, soldiers trained to be fanatically loyal to the Sith via flash imprinting technologies built upon the Kaminoan techniques in the training of clone troopers. The efforts of the Sith Eternal led to the creation of a fleet and army which would spell the end of freedom in the galaxy were they to escape into hyperspace.\nSidious utilized one of the Sith Eternal's and his genetic experiments to spread his influence across the galaxy through indirect means while he was forced to remain on Exegol due to his situation. This being was Snoke, a humanoid genetic strandcast that, like the Emperor's cloned body, originated from the Sith Eternal's experimentation in attempts of extending Sidious' lifespan and produce him a vessel worthy of housing the dark essence that was his spirit, during the reign of the Galactic Empire. Though Snoke was naturally force-sensitive, Sidious deemed his body an unworthy vessel for housing his dark essence, but still found use for him as puppet for his plans of restoring himself to power.\nSnoke became Sidious' proxy in power over the First Order, a hermit state that began as the remnants of the Galactic Empire that escaped under the Contingency, and by extension, helped ensure the faction would be his to control. Snoke rose to become Supreme Leader over the faction, and through manipulating his puppet, Sidious gathered the forces that would go on to form the First Order's military, while under Snoke's guidance, the militia developed into a technologically superior war machine over the one under the Galactic Empire. In addition, while the First Order served as the military arm of the Contingency, the Sith Eternal secretly served as its hidden spiritual heart, while none were aware they were secretly controlled by the Sith.\nMany were confused to some of Snoke's motives upon his rise to power, such as making no effort to claim the old title of Emperor held by Palpatine during the reign of the Empire, while he also delegated main control and building of the First Order to his subordinates and focused on spiritual matter instead. Nevertheless he possessed the knowledge and power to rule them, which made him the undisputed heir to the Contingency. However, even though the highest echelons of the First Order, remained unaware of Snoke's true origins and their ultimate purpose in the form of the Contingency, some in the Order, such as Enric Pryde, came to suspect that Snoke was subservient to some greater power.\nIn addition to restoring himself to power as Galactic Emperor, Sidious endeavored to convert the next generation of the Skywalker bloodline to the dark side of the Force. The Sith Lord targeted Ben Solo, the son of Han Solo and grandson of Anakin Skywalker through his mother, princess Leia Organa, and nephew of the last Jedi Luke Skywalker, for his prodigious strength in the Force inherited from his family's bloodline. Through the Force, Sidious watched over Solo throughout his life, using telepathy to communicate with him as a variety of dark voices. The voice Solo would hear in his mind told him secrets and provided warnings of danger, comforting and guiding him, but also deceiving him with false promise that he could not survive on his own without its help, effectively play on his insecurities and using his fears against him.\nFurthermore, Sidious, in addition to using him as a placeholder for the First Order, utilized Snoke as his proxy for luring Solo to the dark side. In addition to Sidious, Snoke whispered to the young Jedi telepathically, cultivating a friendship with the boy as he manipulated him with deceit, encouraging his negative thoughts about his family and his impulsive tendencies, while utilizing his desperate need for a teacher and fascination with his family's legacy to influence him. When Palpatine and Snoke constantly whispered to Solo, the Phantom Emperor also utilized this when Solo joined the new Jedi Order as a Padawan under his maternal uncle, Jedi Master Luke Skywalker, during his attempt to restore the religious faction of peacekeepers, and partially engineer the failures that would lead to its eventual destruction.\nSidious never anticipated his son's union, now going by the name Dathan, but the clone met a woman named Miramir and became intimately involved, and eventually with whom he sired a Force-sensitive daughter, Rey, in 15 ABY. To the Emperor, Rey was regarded as an ideal vessel to contain his spirit and all the power of the Sith, and he was determined to capture his granddaughter at any cost. However, his son and his wife went into hiding to protect their daughter from the Sith Lord, living as junk traders on the desert planet of Jakku.\nSidious dispatched Ochi, now a cultist of the Sith Eternal, to track down and retrieve Rey from her parents and bring her to Exegol. In 21 ABY, Ochi was close to discovering the location of Rey and her parents, and wanting to protect their daughter, Rey's parents sold her to Jakku junk boss Unkar Plutt, leaving her in his care, and he held her hand and ordered her to keep quiet as she watched the Bestoon Legacy, Ochi's starship, fly off the planet. After refusing to reveal the location of their daughter, on the Emperor's order, Ochi stabbed the clone and his wife to death aboard his ship. Despite their deaths, their sacrifice allowed Rey to elude capture, and she would remain hidden on Jakku for the next thirteen years, until 34 ABY.\nSidious' followers had designed Snoke to groom Solo, serving as the one who molded him into a master of attack and cunning, while also testing his capacity to inherit not only the legacy of his grandfather, Darth Vader, but of the entire Sith Order. Snoke came to believe that Ben Solo had the right balance of the light and dark sides of the Force in him due to his heritage as Anakin Skywalker's grandson. Snoke manipulated Solo for more than a decade, his influence proving crucial as the fledgling Jedi learned that Darth Vader was his grandfather, having been kept from such a truth by his family.\nWhen Luke Skywalker sensed Solo's growing darkness, the Jedi Master approached his student as he slept and, in a brief moment of instinct, activated his lightsaber with the intention of killing his nephew. Skywalker immediately hesitated and regretted his actions, but it was too late. Solo awoke confused and scared, seeing no other recourse than to ignite his own saber and intercept Skywalker's. Though his master attempted to assuage the situation, Solo immediately used the Force to topple his room and trap his uncle beneath the rubble. Shortly thereafter, a violent storm caused by Solo suddenly set Skywalker's Jedi temple ablaze, destroying it and killing all the students inside.\nSolo fled the temple after he burned and destroyed it. At the insistence of Snoke, Solo sought to join the Knights of Ren. After being tested by the Knights, he was reluctantly accepted into the mysterious group. Although their leader Ren saw potential in Solo's raw power, he doubted the boy's hatred and ability to kill. Ren's suspicions were confirmed on a mission to the Minemoon after Ben hesitated to kill his former friend and fellow student of Luke Skywalker, Tai. Enraged and disappointed in Solo, Ren engaged him in a duel. Across the galaxy, Sidious sensed Ben's every move and emotion. Prompting the fallen Jedi through the Force, the Dark Lord of the Sith called for Ben to claim his birthright and strike down the leader of the Knights of Ren. Giving in to Sidious' manipulation, in a fit of rage Ben overpowered and stabbed Ren. Taking up the mantle of master of the Knights of Ren, Solo dubbed himself \"Kylo Ren.\" To ensure Kylo remained on the dark side, Sidious would communicate with Ren from afar, impersonating the spirit of his grandfather and idol, Darth Vader.\nThrough Snoke, Sidious was able to indirectly oversee the young Ben Solo's training, thinking the humanoid taught their mutual apprentice well. Though he considered himself to be Ren's true master the whole time, through the dark side adept, the Emperor also planned to sidestep the tradition of a dark apprentice slaying their dark master to ascend to ultimate power, which Snoke's entire existence was built for in the first place.\nSnoke's training of Kylo Ren proved effective, warping his understanding of his grandfather' history, conditioning him to believe the worst in people and that they would reject him and redemption would be impossible after his actions, while instructing him to pursue his impulses as a shortcut for power in the dark side when he chased his desires.\nIn 34 ABY, Rey confronted the Supreme Leader and his dark apprentice aboard the Supremacy, believing she could turn the former Ben Solo back to the light. Snoke overpowered Rey, and having gauged her resolve, he saw that she had the spirit of a true Jedi. Determined to see every trace of the Jedi Order eradicated, he ordered her death, but left the deed to Kylo Ren. Sensing his apprentice's newfound resolve, Snoke urged Ren to complete his training and fulfill his destiny by executing Rey. Instead, Ren outmaneuvered his master by assassinating him with the Skywalker lightsaber. With Snoke dead, Ren asserted his claim to the title of Supreme Leader, seizing political and military control of the First Order. By murdering his master in the name of obtaining greater power, Ren had unknowingly completed the Sith Eternal's final test and proved himself as an individual worthy of inheriting the legacy of the Sith.\nDespite Snoke's unexpected death, and failure to bring Rey to Palpatine, the zombified Sith Lord continued to pull the strings from afar, manipulating both Kylo Ren and Rey, in order to lure them toward him. His granddaughter coming to Exegol was a key and vital part of his plan.\nIn 35 ABY, a mysterious audio broadcast using the voice of Emperor Palpatine, the public identity of Darth Sidious, who was still thought to be dead by the galaxy at large, was released to the galaxy, threatening revenge. Upon this, Supreme Leader Kylo Ren began a search for the broadcast's source, deeming it a challenge to his rule. After acquiring a Sith wayfinder on Mustafar that led him to Exegol, Ren entered the Sith Citadel on the planet's surface and confronted the decrepit Emperor, who admitted that he had created Snoke and impersonated Vader.\nWhen the Supreme Leader threatened the decaying Emperor with death, the Dark Lord merely stated that he had already died before, and that the dark side of the Force was pathway to many abilities some considered to be unnatural. Sidious then revealed his creation of the Final Order, a Sith armada comprised of numerous Xyston-class Star Destroyers, TIE/dg starfighters, and an army of loyal Sith troopers. The purpose of this new military was to restore Sith rule across the galaxy in the form of a new Sith Empire, which Sidious offered to Ren along with the title of Emperor, but only if he killed the Jedi apprentice Rey. To Ren's surprise, Sidious revealed that he was Rey's \"grandfather.\"\nRen shared this revelation with Rey, believing the truth of her heritage would turn her to the dark side. Rather than killing her, Ren hoped that Rey would aid him in the usurpation of her grandfather, allowing the pair to rule the galaxy as Emperor and Empress. Rey's continued survival caused Sidious to suspect treachery from Ren and as such he threatened to turn the Sith fleet against the Supreme Leader unless he killed her. Having been warned, Kylo went to the Endor system where he dueled Rey on the remains of the second Death Star in the sea of the moon of Kef Bir until Rey fatally wounded him. However, upon sensing the death of Leia Organa at Ajan Kloss, Rey saved Kylo's life using Force healing and left him behind to mourn his mother. Ben would finally turn back to the light side after reflecting on Rey's act of compassion and his parents' sacrifice. Having felt Organa's passing, Sidious cursed the former Princess of Alderaan for disrupting his plans one last time by costing him Kylo Ren's loyalty.\nStill, the Emperor remained confident that victory was at hand and asserted that Anakin Skywalker's daughter had died in vain. Sidious then communicated via hologram with Allegiant General Enric Pryde, who had previously served him during the Galactic Civil War. With the Supreme Leader gone, the First Order's command defaulted on Pryde, whose allegiance to Sidious was secured, officially combining the First Order's forces with those of the Sith Eternal's Final Order. Realizing that the time had come to make his return, Sidious ordered Pryde to send one of his Star Destroyers, named the Derriphan, to Kijimi and destroy it in order to send a clear message to the Resistance.\nWhile initially intending to live out the rest of her days in exile like Luke Skywalker due to the fear of becoming a Sith herself, Rey was convinced to desist doing so by the Force spirit of Luke Skywalker himself, who encouraged her to not let her bloodline define her legacy and actions by gifting her a lightsaber which once belonged to Leia. After coming to terms with her past, Rey traveled to Exegol alone to face Sidious and transmitted the route to the Resistance. Upon finding her grandfather surrounded by the Sith Eternal in his throne room, Rey was welcomed by Sidious, who rejected the notion that he wanted her dead, rather brought to him to succeed him as \"Empress Palpatine.\"\nSidious attempted to goad his granddaughter into striking him down, much like he had done to Luke Skywalker thirty-one years before, remarking that while Skywalker had his father to save him that day, he was the only family she had. In actuality, Sidious wished for Rey to strike him down in order to initiate a Sith ritual that would transfer his spirit from the decaying clone body into the youthful Rey's, where he hoped to possess her body. In an attempt to increase her anger and hatred of him, Sidious told Rey that by transmitting the route to Exegol to her friends, she had led the Resistance into a trap that would see all of them wiped out by the Sith Eternal forces.\nHowever, a glimpse of hope for Rey came when a redeemed Ben Solo, no longer Kylo Ren, arrived on Exegol to help her in her fight against Sidious. Unknown to Sidious, his granddaughter had been stalling for time upon feeling that Solo had arrived on Exegol, precluding her from succumbing to the temptations of absolute power and the dark side of the Force. Feigning that she was going to strike him down with the Skywalker lightsaber, Rey transferred the lightsaber to Solo through their Force-bond, allowing Solo to promptly destroy the Knights of Ren while Rey used the lightsaber of her master, Leia Organa, to defend herself against the Emperor's Sovereign Protectors.\nAstonished that his granddaughter didn't kill him like he had gleefully anticipated, Sidious realized with horror the mistake in allowing Rey and Solo to come together: their Force-bond had been forged in the fire of mutual searching, shared grief, rage, and hate, but what Sidious hadn't anticipated was that it also encompassed compassion and empathy.\nWith all the Knights and Sovereign Protectors dead, Solo joined Rey and dropped into a fighting stance against Sidious, who decreed that they would perish together for their insolence, before raising his rotting hand and impaling them with the Force, pulling the two helpless warriors towards him. However, as an unforeseen consequence, their combined life force began to heal the clone vessel that was serving Sidious as his new body. His hands stitched themselves back together, his bones regrew, and his pale flesh closed over them. Sidious realized at once what was before him: a dyad in the Force, a prophesied phenomenon stronger than life itself, one which had not been seen for generations.\nRealizing that their power would allow him to fully return to life, Sidious used the Force to drain the life energy of both Force-users in order to restore himself to full strength. As triumphant thoughts invaded his mind, Sidious harnessed the power of both the dark side and all the Sith who preceded him, continuing to pull more life energy from the dyad as if he was drawing on a flowing river of light so only he, the one true Emperor, would be restored. With his body and mobility fully restored and his powers amplified beyond measure, the Dark Lord released himself from the Ommin harness and declared himself the immortal Emperor of the Sith before his Sith loyalists, who praised their master's return. Having no further use of Solo and exclaiming revenge for his first death, the Emperor flung him into a pit as reinforcements brought by Lando Calrissian arrived to aid the Resistance.\nIntending to dispose of the Resistance as well and with his powers now stronger than ever before, the Emperor claimed that nothing would stop the resurgence of the Sith before he shot an immense amount of Force lightning into the atmosphere of Exegol, thereby disabling every Resistance ship for the time being. His attention soon returned to Rey, who was now empowered by the ghosts of the past Jedi. The Emperor, unfazed by Rey's defiance, declared her death to be the ultimate end of rebellion throughout the galaxy, during which he then unleashed a barrage of Force lightning on his granddaughter, which she blocked with the lightsaber of Leia Organa. Sidious redoubled the intensity of his Force lightning to kill Rey, but Rey called on the power of the Jedi of the past, ignited the Skywalker lightsaber as well as Organa's and deflected the Force lightning back onto the Emperor, while declaring herself as all of the Jedi embodied. As a result, Darth Sidious—the former Senator of Naboo, the last Supreme Chancellor of the Galactic Republic, Emperor of the galaxy, the Phantom Menace, and final Dark Lord of the Sith–was destroyed after well over a century by his very own power once and for all, vaporizing his entire body and releasing a great Force wave that decimated the entire arena, along with killing all of the Sith Eternal loyalists. Sidious was gone both in body and soul. With the demise of Darth Sidious and the destruction of his cult, the rebirth of the Sith and establishment of the new Sith Empire was prevented.\nGiven the amount of power required to forever destroy Sidious, Rey died after vanquishing the Emperor. However, Solo emerged from the pit where the Emperor had previously flung him and gave his remaining life energy to revive Rey, whom he shared a kiss with before he vanished into the Force as the last of the Skywalker bloodline. Despite her Sith lineage as Sidious' descendant, Rey renamed herself \"Rey Skywalker\" to honor the family of her masters.\nFollowing the Battle of Exegol, the galaxy celebrated Sidious' death and the defeat of the Final Order, with uprisings against the weakened First Order taking place on several planets. Bespin, Jakku, Corellia, Lothal, Thyferra, Endor, Coruscant and even Sidious' native Naboo were amongst the systems reported to be openly rebelling against his forces.\nDuring the victory celebration at the Ajan Kloss Resistance base, Finn and Poe Dameron discussed the possibility of Sidious coming back once more, given that he came back more powerful than ever following his defeat at Endor. They concluded that while Sidious could perhaps return yet again, some other evil would arise as evil always rises, though not for a long time.\nPrior to the Galactic Empire, Darth Sidious was careful to put on a charade, presenting himself as a grandfatherly gentleman and a servant of the public good. When in character, he often spoke of himself with great modesty and maintained only as much luxury as was expected of someone of his stature. However, Sidious was, in fact, a skilled manipulator and strategist, having orchestrated countless events in the galaxy, from the Invasion of Naboo to the Clone Wars, while deceiving the Jedi, Senate, Republic, and even the Separatists, with the sole aim of increasing his own power. Even when something occurred that he did not initially plan for, the Sith Lord demonstrated that he was as adept at improvisation as he was at plotting, continuing to play his long game—a smart game—for power. Sometimes he indugled in a simple fantasty by imagining lighting the Senate Building aflame, which he enjoyed thinking about because it would force everyone inside to run in panic while he watched. Still, he understood that fantasty to be foolish and petty, knowing it would not bring about his plans. Almost as satisfysing to the Sith Lord was watching the Senate grapple with the Clone Wars and his new political powers.\nDuring the Republic Era, Sidious did not feel the need to hide in the lower levels of Coruscant, which he developed a personal dislike of. Instead, he preferred to remain amongst those who thought they were safe from the dark side. He would find the \"weak points\" of these places, ensuring the dark side took the light's place where-ever it was fading. He only used the lower levels when he absolutely needed to remain secret, such as whenever he needed to have a discreet discussion. Furthermore, he prefered to speak to his pawns via hologram, knowing that his in person presence could be overwhelming to people like Nute Gunray. He instead kept that advantage saved for whenever one of his \"allies\" was failing him. In public, as Senator of Naboo, he portrayed himself in a perfect state of blandness, looking interested in whatever was said nearby but never showing his true face. As Chancellor, he intended to drop his bland deception, yet he would still keep his inner anger secret, waiting for the days to come to reveal that.\nAfter his ascension to Galactic Emperor, he essentially dropped his public persona and started living as Sidious full-time. Despite this, very few people other than Vader and some Royal Guard members knew that the Emperor was a Sith, as he took great pains to hide his capabilities. Even Grand Moff Wilhuff Tarkin, perhaps Sidious's most trusted servant besides Vader, only suspected that Sidious was a Sith. Sidious also regarded Gallius Rax as a confidante and allowed Rax to address him as \"Sheev.\" Freed from having to portray his gentle alter-ego, Sidious allowed his true personality, one of great cruelty and sadism, to occasionally shine through in ways that were obvious even to the most sycophantic of his servants. This caused many of those who worked closely with him, such as Senator Orn Free Taa and some of the Empire's intelligence chiefs, to greatly fear him. Sidious was also known to loath ostentation and luxury.\nAmong Sidious' most effective traits was his deeply manipulative nature, manipulating and deceiving both the Jedi and Separatists, seducing many parties with promises of power, prize, or even salvation to further his agenda. He enjoyed the rush manipulating others to his will gave him. Even so, he was annoyed by when his pawns, such as Nute Gunray, failed to understand the grand scope of his plans. Nevertheless, he successfully manipulated the leaders of the Separatists and Darth Tyranus under the pretense of a better future, coerced Anakin Skywalker into becoming Darth Vader by promising to save his beloved, Padmé Amidala, attempted to sweet talk Bridger with being able to reunite with his deceased parents by altering fate and also tried to push Luke Skywalker into murdering his father so they could rule the galaxy together. While trying to steer Bridger, he displayed himself in his public personality via hologram, showing himself as benign and polite. Once Bridger frustrated his plans, his true malignant self was revealed as he had underestimated the boy's hatred for the Empire and devotion to the Rebellion and new-found rebel family. Likewise, when Sidious tried to motivate Luke into killing his father upon momentarily embracing the dark side of the Force, the young Skywalker desisted due to his compassion for his father; his Jedi teachings.\nSidious saw his allies as pawns that he could use for his grand plan, and was more than willing to dispose them if they no longer served a purpose. He kept his allies as long as they served his purpose, but cut them loose when their purpose was over. He never actually cared for any one of his allies. He betrayed countless allies, including Darth Plagueis, Maul, Dooku, the Separatist Council, and Vader. The way he betrayed Dooku, not only showed that he never really cared for him, but also showed how he was always one step ahead. While acknowledging to Vader that he was the ideal apprentice, that didn't stop him from later trying to replace him with Luke. At the end of the day, Sidious was only out for himself.\nHe considered his manipulation to be a sharp knife that, when stabbed into another, took time for that individual to notice, only realizing they had spread what he deemed to be the infection of his manipulation when it was too late. Even if the way his manipulation spread surpised him, it always gave him joy. Manipulation was ultimately his favorite way to grow his power. Sidious was known for being hypocritical and arrogant; whilst he told Yoda that his arrogance had blinded him when the Jedi Master confronted him, he had previously declared himself to be the Senate when Windu tried to arrest him. Even shortly before his second death years later, Sidious declared himself to be all the Sith while trying to finish off with his Jedi granddaughter.\nAfter toppling the Republic and shedding his benevolent persona, Sidious essentially disappeared from public life and left most of the day-to-day affairs of the Empire in the hands of the Imperial Ruling Council. His absence did not go unnoticed by the citizenry of the Empire, and rumors began to circulate that the Jedi assassination attempt had not only resulted in his disfigurement but in the death of the sanguine politician that he had once been. In order to quash the gossip and rumor-mongering, the Ruling Council took to dispatching skycar processions in Imperial Center in an effort to make it appear as though Sidious still moved about in public.\nFrom his secured position as Emperor, Sidious devoted most of his time to study and meditation, often in the ancient Sith shrine situated beneath the Imperial Palace. Wishing to rule his Empire for eternity, Sidious launched numerous inquiries into the topic of immortality. One of the most notorious of these was Project Blackwing; an attempt to unlock the secrets of immortality through Sith alchemy, but the project ended in failure. However, Sidious's true goal was ultimately to discover a way to use the dark side to manipulate reality itself, and with that power, not only achieve what he termed \"mere immortality\" but acquire the ability to reshape the galaxy and its people to his satisfaction. Whether or not Sidious made any significant progress in obtaining this goal is not known however, as he would have needed Vader's assistance to perform the sorts of rituals he had in mind. During the Imperial Era, Darth Sidious sought to gain access to the World between Worlds in order to control time as well as the universe. Following his first death, Sidious still sought ways to achieve immortality and the preservation of the Sith, as was seen by his attempt to perform a ritual on his granddaughter Rey in order to transfer his spirit into her body, which would allow Sidious to continue the Sith's legacy.\nAlthough Sidious' reign saw a rise in alien prejudice across the Empire, with humans being the masters of the galaxy while the other species were enslaved by the Empire, Sidious was more than willing to work with aliens. During his rise to power alone, he relied on a number of them, such as the Separatist Council whom he controlled during the Clone Wars, and his political right hand, the Chagrian Mass Amedda. In addition, Sidious was trained by a Muun, Darth Plagueis, and his first apprentice was a Zabrak, Darth Maul.\nTo those who had been at his nonexistent mercy, Sidious was known to be exceptionally sadistic, and he often took visible pleasure in torturing others. He was similarly quite bloodthirsty as well, and frequently reveled in combat to the point of laughing while he fought or killed. He was also noted for his lack of forgiveness, as even Darth Vader, who was well known for summarily executing officers who failed him, considered Sidious to be even less clement than himself. According to Sosha Soruna, the reason Sidious left his homeworld of Naboo relatively untouched during his reign was because he enjoyed tormenting the populace with the fact that he could destroy the serene beauty of the planet at anytime. In spite of his exceptional mastery of the dark arts, he was no less susceptible to fear, one of the primary emotions of the dark side, than any other Sith: after being attacked by a powerful Force push from Yoda, he displayed visible panic, attempted to flee rather than fight, and only confronted his opponent when he appeared to have no other choice. Despite this, his passion to inflict pain on others and his hate were a priority to him over his own well-being: while he could have used his own powers to save himself from Darth Vader during the Battle of Endor, Sidious' hate was so strong that his only thought was to harm Vader as his apprentice carried him to his first death.\nUnlike Darth Vader, his more conservative apprentice, Sidious believed that progress was in no way contrary to the ways of the Sith. When Vader was presented to the cyborgs created by Doctor Cylo, he denounced them as abominations and heresy to the ways of the Force. However, Sidious claimed that he was merely an apprentice and was meant to learn what he knew and that Sidious was meant to discover what there was to teach. He also dismissed Vader's hatred of technological superiority by replying that everything was of the Force.\nSidious saw the fall of the Galactic Empire as a necessary consequence of his demise; he believed that the Empire had failed to protect its Emperor, despite the vast military at its disposal, and was therefore undeserving of a future without him. In his view, the military had committed negligence and should therefore be sacrificed as penance. Using a game of Shah-tezh as an illustration, Sidious believed that the sole purpose for the Empire's existence was to protect his own life and well-being. He believed that the Empire was a failure if it failed to ensure the survival of its Emperor. Even before the formation of the Empire, Sidious had prepared for this fate by formulating a contingency plan. The Contingency involved luring the Empire to the barren Inner Rim planet Jakku and detonating the planet's core. The explosion would destroy both the planet and the orbiting Imperial and enemy fleets, an outcome which Sidious regarded as retribution for the Empire's failures. The key to the Contingency was the Jakku Observatory, which concealed a borehole that penetrated the planet's core, and Counselor to the Empire Gallius Rax. Decades after his death, however, Supreme Leader Snoke discovered that the Contingency planned for the Empire's rebirth, secretly constructing shipyards and laboratories in the Unknown Regions in pursuit of this goal.\nFollowing his demise on Endor and resurrection, in spite of his physical frailness, Sidious' mind was sharper than ever before. Upon realizing that the Jakku scavenger Rey was his granddaughter, Sidious manipulated Kylo Ren into bringing the young woman to him in order to steal her body as a new host. While he tried to sway Rey to his side by claiming that he cared for her, Rey saw through his ruse; by sensing his thoughts, she realized that his motives were fixated purely on his own preservation, indicating that there was no good in it and what was left was pure evil. When it became clear that Rey would not submit to his ritual, Sidious unleashed his fury, trying to kill both her and a redeemed Ben Solo. Even after experiencing death, Sidious's beliefs and way of being remained largely unchanged; his sole overriding ambitions were the attainment of unlimited power, a grand empire under his legacy and the perpetuation of a Sith Order embodied through him. He would go to any lengths to realize these goals, including harm his own progeny.\nSidious was a human male who stood at 1.73 to 1.78 meters and weighed 75 kilograms. Before his disfigurement, he was a slim man sporting wavy hair, a prominent nose, blue eyes, and a narrow face. By the Invasion of Naboo, his red hair was graying, and it had turned entirely silver ten years later. As he became more embroiled in his plot to control the galaxy, the strain of leading a double life began to show in his face. After his duel with Windu, Sidious' visage was heavily disfigured and withered, with deathly pale, wrinkled skin, flesh sagging from his bulging forehead and around his piercing yellow eyes. Serving as a reminder of his own weakness and mortality, as well as the price that he paid for power according to Luke Skywalker, the change further fueled his hatred of the Jedi. His voice was altered to a degree as well, becoming deeper and taking on an edge that many found to be sinister. Tarkin, however, was of the opinion that Sidious's voice merely sounded strained when compared to that of his pre-war persona.\nFor most of his reign, the Emperor remained away from public view and crafted holograms or idealized portraiture that depicted him in his prime, as he was in the last years of the Galactic Republic. Even so, as the reign of the Empire solidified, the citizenry of the galaxy largely forgot the name of \"Palpatine,\" and the man was known simply as \"the Emperor.\" When he was discovered on Exegol, Sidious, inhabiting a clone body, appeared to be in a putrid and decaying state. His face appeared similar to what it was prior to his original body's disfigurement, but his skin was more pallid than it was before the transfer, his eyes were white, his lips were blackened, and his fingers had begun to rot away, exposing the bone underneath. Upon draining Rey and Ben Solo of their life energy to restore his own, his appearance more closely resembled what he looked like before his first death.\nAs a Sith Lord, Darth Sidious possessed a very powerful connection to Force that allowed to using various Force powers that were beyond the abilities of the most powerful Jedi Masters. For this he was to be one of most powerful Force-users in galactic history. Among the abilities Sidious would use was Force lightning, which he used as both as a deadly attack and as a means of torture. On several occasions on Ryloth, he utilized blasts of Force lightning powerful enough to not have only killed the lyleks on contact, but also badly charred and scorched their carapaces, which were tough enough to repel heavy blaster fire. On another occasion, he used the ability to damage a Twi'lek freighter's engines badly enough to pull it out of the sky with telekinesis. Sidious could use Force lightning in a number of ways, including striking multiple enemies at once, with the bolts jumping from one victim to the other, like a chain and imbuing the ground around a victim's feet with energy, effectively electrocuting them. His Force lightning's raw power was demonstrated to be far greater than that of Dooku's; while Yoda was able to effortlessly absorb and deflect Dooku's lightning, he was only able to partially deflect Sidious's. Another more obscure ability that he possessed was the power to produce a Dark Aura, a miniature storm of malevolent Force energy that slowed the movement of and tortured all that it caught within its radius. The maximum potential of Sidious's Force lightning, however, was achieved before his final death on Exegol; when restored back to his former self, Sidious unleashed an immense wave of Force lightning towards the sky which rapidly expanded enough to disable all the ships of the Resistance.\nHe was also highly skilled with telekinesis; during his duel with Yoda, during which the two were equally matched, Sidious levitated several Senate pods simultaneously, including the one he was standing on, with great dexterity and accuracy. Likewise, he was skilled enough with telekinesis that he was also able to remove Luke Skywalker's handcuffs while barely having to lift even a finger when they met face to face on the second Death Star. Sidious was capable of unleashing a Force push strong enough to easily send Maul and Opress flying and he was able to keep them pinned with little effort. He later effortlessly slammed Maul into the ground and walls, badly wounding him. Sidious was also highly skilled with Force choke. When he arrived on Mandalore, he was effortlessly able to telekinetically throttle two Mandalorians to death at once and used this power on two others while standing on the other side of the room that they were in. He was even able to use his abilities on a target from hundreds of light years away, using only a holo-transmission to show him his target, allowing him to telekinetically choke and pick up Count Dooku and open the handcuffs of Bridger while projecting himself to their respective locations through the use of a hologram.\nAmong Darth Sidious's most powerful abilities wad being able foresee the future, an ability which allowed him to plan for nearly any contingency. He believed that, with enough time and practice, he would eventually have been able to use the dark side to view the future with infallible accuracy.\nThe Dark Lord also was proficient in Sith magic, as he was able to cast a Dark illusion on Yoda using a ritual that applied Balc speech incantations and managed to access the World between Worlds using an unknown ritual. He was also capable of using Sith magic to generate a blue fiery energy, which he used to attack Ezra Bridger and Ahsoka Tano, that he could use both as a weapon and a tool in order to bind and draw someone closer, as it did with Bridger; the energy wrapping around his leg and becoming akin to a tangible rope as well as knowledge of the ancient Sith tongue, ur-Kittât. The Dark Lord was also adept in the use of Force Persuade to such an extent that he was able to take complete control of a subject's mind and force them to obey his commands.\nLikewise, Sidious was also capable of using Dark Absorption. He was also capable of telepathically communicating with Darth Vader over a distance of hundreds of light-years. It appeared, however, as though this ability may have been limited to sending and receiving relatively simple messages such as Vader requesting that a starfighter be shipped to him, as the two Sith Lords communicated through holoprojections while discussing more complex matters. Sidious also had a remarkably keen ability to sense the thoughts and feelings of others, including those of incredibly powerful Force adepts such as Darth Vader and Luke Skywalker. On a related note, he was also capable of hiding his own thoughts and feelings from even such individuals as Yoda, and managed to conceal his true dark nature from the entire Jedi Council for decades before deliberately revealing himself. Sidious also used Force Dash and could move as fast as a \"lightning strike\". He had the ability to drain the life force of other Force-sensitives such as Ben Solo and Rey, a dyad that he overpowered in the Force despite the physically weakened state of his cloned body. After restoring his strength with the dyad's energy, Sidious demonstrated his proficiency in telekinesis by lifting Solo and throwing him into a chasm.\nDarth Sidious was a highly skilled swordsman, having been well trained in the art of lightsaber combat by his master Darth Plagueis. Although he favored his power in the dark side as his principle form of attack instead of his lightsabers, Sidious attested that only a few individuals were able to survive against his skill with the blade. He had an extremely aggressive, rage-fueled dueling style and augmented his swordplay by using Force-enhanced speed, which allowed him to kill three experienced Jedi Masters at once within seconds. He utilized a violently ferocious yet extremely fluid fighting style during his fight with Maul and Savage Opress, holding off the Sith brothers on equal grounds and ultimately separating them by stunning Maul for a brief time with the Force before toying with and killing Opress. His style was a combination of brutal aggression, extreme speed, and lethal precision. Kit Fisto, a Jedi Master who specialized in combat, was unprepared for the ferocity of Sidious' attack and consequently cut down by the Sith's lightsaber.\nSidious was able to fight alone against multiple opponents at once, such as the brothers Maul and Opress, as well as several members of the Jedi High Council. Being proficient in the style of Jar'Kai, he wielded two lightsabers during an intense duel in which he killed Opress and disarmed Maul. While skilled in dual-wielding lightsabers, Sidious was also adept with a single blade which he used against four Jedi Masters, and later Grand Master Yoda. Upon revealing his true identity to the Jedi, Sidious dispatched three Jedi Masters with haste, killing Agen Kolar and Saesee Tiin with a single blow each, before striking down Kit Fisto only moments later. Unlike the Jedi who fell to Sidious' blade, Mace Windu was able to fight the Dark Lord of the Sith on equal grounds for an extended period of time before ultimately disarming Sidious of his weapon with a kick to the Sith Lord's face. The duel between Sidious and Yoda, both of whom were masters of the Force, was an intense battle in which the Dark Lord ultimately prevailed, albeit with the use of his Force powers rather than a lightsaber.\nDuring a sparring match, Sidious was able to quickly overpower his apprentice Darth Vader and knock Vader's lightsaber out of his hand without much effort. He was also skilled in blaster deflection, able to easily deflect every single blaster shot aimed at him when he fought on Ryloth.\nDuring the Naboo Crisis, Sidious wore an elaborate blue cloak. As Supreme Chancellor, he wore golden robes with a velvet overcloak in the days surronding the Battle of Geonosis and a dark crimson gigot-sleaved robe in the final days of the Clone Wars. As he rose to power he wore cloaks more infitting with Sith traditions, although without lessening his taste in lavish and comfortable fabrics. When declaring himself Emperor, Sidious wore a red robe patterned with emblems reminiscent of the serpents of the planet Moraband. As Galactic Emperor, he later wore a black zeyd cloth robe with a hood to hide his disfigured face. He used two identical lightsabers.\nFrom the very beginning of the writing process on the 1977 original Star Wars film Star Wars: Episode IV A New Hope, director George Lucas had in mind the character that would eventually develop into the currently known Emperor. One of the earliest documents regarding the project is a paper dating to early 1973, which compiled a list of names to potentially use in the story. At the very top of this list appeared the name \"Emperor Ford Xerxes XII,\" as Xerxes was a historical Persian king who was assassinated by his own son, and would be then changed to \"Alexander Xerxes XII,\" then \"Emperor of Decarte.\" None of these mentioned names would be used ultimately.\nIn 1983's Star Wars: Episode VI - Return of the Jedi, Darth Sidious was never identified neither by his real name or his Sith alter ego on-screen, as he was referred just as \"The Emperor\" by most characters or \"Master\" by Darth Vader. The Emperor's name was supplied in supplementary materials, including the script for Episode VI. It wasn't until the 1999 film, Star Wars: Episode I The Phantom Menace, that the Emperor's name and alter ego were first mentioned on-screen.\nLeland Chee has stated that Darth Sidious' name may have derived from the word \"insidious.\"\nDarth Sidious, namely the Emperor at that time, was mentioned in A New Hope. The Emperor first appeared in the 1980 sequel Star Wars: Episode V The Empire Strikes Back, played by the experienced actress Marjorie Eaton. In Return of the Jedi, the Emperor was played by Ian McDiarmid. McDiarmid then reprised the role for the three films of the prequel trilogy, as well as in The Rise of Skywalker in the sequel trilogy.\nFor The Empire Strikes Back, the Emperor was portrayed by Eaton as a holographic image with test shots done by actress Elaine Baker. The mask worn by Eaton was sculpted by Phil Tippett and applied by Rick Baker, Elaine's husband. Eaton's face was then composited with an image of a chimpanzee for the eyes and the voice was provided by Clive Revill.\nIn the 2004 DVD release of The Empire Strikes Back, Eaton was digitally replaced by McDiarmid, and the scene was re-shot to include new dialogue provided by McDiarmid and James Earl Jones. This re-shoot was shot during the production of the 2005 film, Star Wars: Episode III Revenge of the Sith, which McDiarmid had a starring role in.\nFor Return of the Jedi, the role was to be played by veteran thespian Alan Webb, who was 75 years old at the time. However, as filming was about to commence, Webb fell ill due to the record cold England was experiencing at the time. He wrote a letter to the director Richard Marquand, saying that he was very sorry, but that he felt the part was too big for him, shortly dying afterward on June 22, 1982. English actor Ben Kingsley read then for the role but was considered \"very English\" for playing the Emperor. With filming behind schedule, Ian McDiarmid was drafted in as a late substitute.\nFor the prequel trilogy, McDiarmid reprised the role for all three films, playing a younger Chancellor Palpatine in The Phantom Menace and a middle-aged Palpatine in Star Wars: Episode II Attack of the Clones and in Revenge of the Sith. He became at first surprised that Lucas asked him to reprise the role, as he supposed that Darth Sidious would be played by a young actor, but he accepted the offer and returned for the role once more. One of the things that George told McDiarmid about playing the young Palpatine was to imagine that his face was a mask that was hiding the monster's face, which made him portray him a seemingly friendly man who was always nice to people.\nDuring Celebration Chicago 2019, it was officially confirmed that McDiarmid would be reprising his role as Darth Sidious in Star Wars: Episode IX The Rise of Skywalker, the final installment of the sequel trilogy and the Star Wars saga overall, scheduled to be released on December 20, 2019. Upon the announcement, The Rise of Skywalker director J.J. Abrams expressed his delight that McDiarmid's appearance on the film wasn't leaked. Producer Kathleen Kennedy then confirmed that Sidious' return stemmed from discussions during the development of Star Wars: Episode VII The Force Awakens although original director Colin Trevorrow stated that Sidious' return wasn't an idea presented in his original script for the film. On hinting Sidious' comeback, McDiarmid told Warwick Davis during the panel that over the years, he has had conversations with George Lucas, who affirmed that Sidious was definitely dead by the end of Return of the Jedi. Although the film doesn't explain how Sidious survived, editor Maryann Brandon has said that earlier cuts of the film had an explanation.\nFor the Star Wars: The Clone Wars film and subsequent TV show, Darth Sidious was voiced by veteran actor Ian Abercrombie. In the Creative Conservation commentary on the film's Blu-ray and audio commentary on the film's DVD, Director Dave Filoni noted that he found the fact that Palpatine and Jabba the Hutt were talking to each other fascinating. It was a character dynamic that he never thought would be seen. Abercrombie passed away on January 26, 2012, leading to actor Tim Curry replacing him in the final seconds of \"The Lawless\" as well as the remaining episodes of the series, for which he was credited, beginning the fifth season finale \"The Wrong Jedi.\"\nFor Star Wars Rebels, Sidious was voiced by Star Wars veteran Sam Witwer in \"The Siege of Lothal\", the show's second season premiere episode. For the fourth and final season of the show, McDiarmid returned to provide the Emperor's voice instead, as well as subsequently re-recorded Witwer's dialogue from the second season premiere.\nStuart Beattie wrote the script for the first of three Obi-Wan Kenobi feature films. From the beginning of Beattie's story, Emperor Palpatine would tell Vader to forget Kenobi and focus on the present problems. In one scene, Palpatine sent Vader to crush a rebel uprising and he was trying to forget Kenobi. Vader later told Palpatine that Kenobi and Yoda were the two biggest threats, causing Palpatine to get angry and remind Vader of his place. McDiarmid reprised the role for the sixth episode of the television series Obi-Wan Kenobi. David Decio was the double and stand-in for McDiarmid. McDiarmid's scene was filmed against a blue screen. Director Deborah Chow wanted Palpatine to tell Vader that his obsession with Kenobi is a weakness. She told McDiarmid to film his scene between being on an edge and having some lines be more casual. McDiarmid struggled with remembering to use the word \"execute\" during filming.\nGeorge Lucas compared the story of Darth Sidious to real-life individuals such as Julius Caesar, Napoleon, Adolf Hitler, Joseph Stalin, Ferdinand Marcos, and Alberto Fujimori. All of them used methods similar to the Emperor's while turning their respective democracies into personal dictatorships in real life. The Adolf Hitler similarities are particularly evident from Palpatine's position as Chancellor and the use of emergency powers to cement his hold on the waning Republic. Palpatine's consolidation of power is also similar to Roman Emperor Augustus, the heir to Casear.\nRichard Nixon was used as the primary political model for the Emperor, both because his presidency was known as the Imperial Presidency, plus the constitutional crisis caused by the Watergate Scandal. Lucas, in fact, created the first Star Wars film as an anti-Vietnam War message, implying that the Empire was what America could have been, had it won the war ten years before 1973. Lucas opined, however, that Vice President Dick Cheney was actually closer to Darth Sidious.\nIn addition, film critic Roger Ebert and film historian Robin Wood noted that Darth Sidious' appearance resembled Death from the 1957 epic historical film, The Seventh Seal and Queen Grimhilde's witch form in the Disney's 1937 animated film, Snow White and the Seven Dwarves. George Lucas himself said that where realistically, and originally, Darth Sidious appeared in a dark color, the Dark Lord of the Sith was brightened-up in post-production to the extent where he became a white-faced figure that resembles Death, a fittingly spooky look desired by Lucas himself.\nDarth Sidious was originally conceived as a weak-willed dullard named Cos Dashit with delusions of grandeur who was elevated first to President of the Republic and then Emperor, controlled by the Imperial bureaucracy, conformed by ministers like Wilhuff Tarkin. However, he was neither a Force user nor a great political strategist. Although this version of Sidious appeared in the original film's novelization, it was superseded by every other appearance since which revealed Darth Sidious as the mastermind of the events of the Star Wars saga. Although The Empire Strikes Back made clear his Force connection, his Sith affiliation was first revealed in The Phantom Menace.\nIn the original story treatment for Revenge of the Sith, Darth Sidious was intended to reveal that he created Anakin Skywalker through the midi-chlorians, thus making him, in some way, Anakin's father, although George Lucas ultimately cut this out of the film. Though this was dropped from the final cut, some hints that Darth Sidious and/or Darth Plagueis were responsible for Anakin's creation were included in the film.\nOne known debate about Darth Sidious is his real appearance. In Revenge of the Sith, during his duel against Mace Windu, upon being disarmed, Sidious uses Force lightning against the Jedi Master, but he deflects it back to him, causing his face to be disfigured and scarred in the process. Later on, when Anakin cuts Windu's hand to succor Sidious, he electrocuted Windu, knocking him off the window to his death, although the Force lightning doesn't disfigure Windu for the short period of time it is used.\nHowever, previous to the Force lightning's appearance in Revenge of the Sith, when it first appeared in Return of the Jedi, Sidious used it against Luke Skywalker, and it didn't disfigure or scar Skywalker.\nThroughout the original Star Wars saga films, the character was referred to as either Palpatine or Darth Sidious. The character was not given a full name in any canonical or Star Wars Legends source until 2014, when the character's first name—Sheev—was revealed in the canon novel Tarkin by author James Luceno. However, according to Luceno in an interview with StarWars.com, the name was reportedly created by George Lucas for the Star Wars: Underworld TV show that he planned to make before budget constraints, his semi-retirement and Lucasfilm Ltd.'s buyout by The Walt Disney Company prevented him to do so.\nSidious' height has been stated to either be 1.73 meters, or 1.78 meters. This article assumes the newer databank entry height on StarWars.com to be the correct height.\nIn a question and answer session for The Clone Wars: The Lost Missions, Dave Filoni stated that Sidious had Darth Maul and Darth Tyranus as apprentices at the same time. However, Sidious's biography gallery in the Databank claimed that he recruited Dooku into the Sith during his time as Supreme Chancellor after the Invasion of Naboo. Maul was thought to be killed during that event, and Star Wars: The Secrets of the Sith also stated Dooku became an apprentice after Maul's apparent demise. However, \"The Lost One\" establishes that Dooku, in some form, must have joined the Sith before The Phantom Menace; Finis Valorum loses his position as Supreme Chancellor within that movie, yet Dooku had Sifo-Dyas killed for the Sith Plan during Valorum's chancellery.\nIn the non-canon LEGO Star Wars: The Freemaker Adventures, Darth Sidious was voiced by Trevor Devall. In the first season, Sidious and Darth Vader learned about the history of a powerful lightsaber called the Kyber Saber, which was made out of several kyber crystals. However, the Jedi Master who crafted the sword had deemed it too dangerous and destroyed the lightsaber before scattering all of the crystals throughout the galaxy. Seeking to destroy the galaxy in one blast, Darth Sidious attempted to collect all of the crystals. He and Vader dispatched the Sith agent Naare to recover the Kyber Saber crystals. However, Naare's mission was complicated by her encounter with the Force-sensitive Rowan Freemaker and his family. In an attempt to gain the crystals, Naare pretended to be a Jedi and offered to train him in the ways of the Force. Despite Sidious' efforts, the Sith Lord failed to take the Kyber Saber from Rowan, who managed to destroy the weapon.\nIn the second season, Darth Sidious creates an Imperial hunter droid called M-OC, whom he tasks with hunting down Rowan. This arouses the jealousy of Darth Vader, who undermines M-OC's efforts on several occasions. Despite failing to capture the Freemakers on several occasions, M-OC manages to deflect blame by pointing out that Lord Vader obstructed his efforts to obtain an XX-23 S-thread tracker. After Rowan builds a powerful starship called the Arrowhead, Sidious forces Vader and M-OC to work together. M-OC lures Rowan into a trap on Qalydon but Vader outsmarts the droid and brings him to the Emperor.\nIn Imperial captivity, Rowan reveals that he destroyed the Kyber Saber. Though the Emperor wants to kill Rowan, Vader convinces the Emperor that Rowan can help them find more kyber crystals to power up the second Death Star. After Vader forces Rowan to reveal the location through a mind probe, the Emperor deems that Rowan has outlived his usefulness and orders his execution. However, Rowan is rescued by his siblings. Meanwhile, M-OC rebuilds himself and steals the Arrowhead from the Freemakers, currying the Emperor's favor. The Emperor orders M-OC to hunt down the Freemakers.\nFollowing a skirmish on Shantipole, Rowan convinces M-OC that his programming is flawed. M-OC instead deduces there is a flaw in the second Death Star and rushes to the Endor system. However, M-OC's warnings fall on deaf ears since the Emperor is preoccupied with Luke Skywalker. Later, M-OC is distracted when he watched the Emperor falling to his death, allowing Rowan to defeat him once and for all.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Darth_Sidious",
  "/wiki/Palpatine/Legends",
  "/wiki/Palpatine_(disambiguation)",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Queen%27s_Peril",
  "/wiki/Darth_Maul_(2017)_1",
  "/wiki/Darth_Maul_(2017)_2",
  "/wiki/Darth_Maul_(2017)_5",
  "/wiki/Age_of_Republic_-_Darth_Maul_1",
  "/wiki/The_Sith_Lord",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Age_of_Republic_-_Count_Dooku_1",
  "/wiki/Queen%27s_Hope",
  "/wiki/Brotherhood",
  "/wiki/Dooku_Captured_(short_story)",
  "/wiki/Bane%27s_Story",
  "/wiki/Star_Wars:_Darth_Vader_(2017)",
  "/wiki/The_Lesson_(Darth_Vader)",
  "/wiki/Darth_Vader_Annual_2",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Thrawn:_Treason",
  "/wiki/Palpatine_(short_story)",
  "/wiki/Doctor_Aphra_(2016)_13",
  "/wiki/Star_Wars_(2015)_37",
  "/wiki/Star_Wars_(2015)_47",
  "/wiki/Star_Wars_(2015)_55",
  "/wiki/Doctor_Aphra_(2016)_36",
  "/wiki/Target_Vader_1",
  "/wiki/Target_Vader_6",
  "/wiki/Tales_of_Villainy:_A_Last_Chapter",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_(2020)_8",
  "/wiki/Darth_Vader_(2020)_5",
  "/wiki/Star_Wars:_Darth_Vader:_Into_the_Fire",
  "/wiki/Star_Wars:_Darth_Vader_Vol._3_%E2%80%94_War_of_the_Bounty_Hunters",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Darth_Vader_(2020)_17",
  "/wiki/Crimson_Reign_1",
  "/wiki/Darth_Vader_(2020)_20",
  "/wiki/Crimson_Reign_2",
  "/wiki/Crimson_Reign_3",
  "/wiki/Crimson_Reign_4",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/Darth_Vader_(2020)_27",
  "/wiki/Darth_Vader_(2020)_28",
  "/wiki/Crimson_Reign_5",
  "/wiki/Star_Wars_(2020)_28",
  "/wiki/TIE_Fighter_4",
  "/wiki/Age_of_Rebellion_-_Luke_Skywalker_1",
  "/wiki/Masters",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Star_Wars_Adventures:_Shadow_of_Vader%27s_Castle",
  "/wiki/Victory%27s_Price",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Age_of_Resistance_-_General_Hux_1",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_44",
  "/wiki/Nexus_of_Power",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/TIE_Fighter_Owners%27_Workshop_Manual",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/The_Phantom_Apprentice",
  "/wiki/Shattered",
  "/wiki/Victory_and_Death",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Star_Wars_Helmet_Collection_15",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_60",
  "/wiki/Starfighter_Aces",
  "/wiki/Lightsabers_and_Jedi_Equipment",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/An_Unwilling_Apprentice",
  "/wiki/Darth_Sidious/Legends",
  "/wiki/Naboo",
  "/wiki/82_BBY",
  "/wiki/4_ABY",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Endor_system",
  "/wiki/35_ABY",
  "/wiki/Exegol",
  "/wiki/Cloning",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Ommin_harness",
  "/wiki/Palpatine_family",
  "/wiki/Sith",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Galactic_Republic",
  "/wiki/Naboo_delegation",
  "/wiki/Office_of_the_Chancellor",
  "/wiki/Trade_Federation",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Galactic_Empire",
  "/wiki/Sith_Eternal",
  "/wiki/First_Order",
  "/wiki/Darth_Plagueis",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Maul",
  "/wiki/Sith_apprentice",
  "/wiki/Dooku",
  "/wiki/Gallius_Rax",
  "/wiki/Anakin_Skywalker",
  "/wiki/Inquisitorius",
  "/wiki/Jedi_hunter",
  "/wiki/Snoke",
  "/wiki/Ben_Solo",
  "/wiki/Reproduction",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Galactic_Emperor",
  "/wiki/19_BBY",
  "/wiki/Galactic_Senate",
  "/wiki/Senator",
  "/wiki/Sith_Lord",
  "/wiki/Politics",
  "/wiki/Grand_Plan",
  "/wiki/Jedi_Order",
  "/wiki/Clone_Wars",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Imperial_Era",
  "/wiki/The_galaxy",
  "/wiki/Death",
  "/wiki/Battle_of_Endor",
  "/wiki/Transference",
  "/wiki/Immortality",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Republic_Era",
  "/wiki/The_Force",
  "/wiki/Sith_Master",
  "/wiki/Rule_of_Two",
  "/wiki/Lord",
  "/wiki/Time",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Supreme_Chancellor",
  "/wiki/Separatist_Crisis",
  "/wiki/Galaxy",
  "/wiki/Duel_in_Palpatine%27s_office",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Order_66",
  "/wiki/Jedi",
  "/wiki/New_Order",
  "/wiki/Emperor",
  "/wiki/Millennium",
  "/wiki/Democracy",
  "/wiki/Jedi_Knight",
  "/wiki/Darth",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Civil_War",
  "/wiki/Luke_Skywalker",
  "/wiki/Chosen_One",
  "/wiki/Clone_template",
  "/wiki/Contingency",
  "/wiki/Battle_of_Jakku",
  "/wiki/Sith_Empire",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/New_Republic",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Strand-Cast",
  "/wiki/Supreme_Leader",
  "/wiki/Skywalker_family",
  "/wiki/Final_Order",
  "/wiki/Palpatine%27s_broadcast",
  "/wiki/Resistance",
  "/wiki/Battle_of_Exegol",
  "/wiki/Unknown_Regions",
  "/wiki/Force_dyad",
  "/wiki/Force-bond",
  "/wiki/Rey_Skywalker",
  "/wiki/Padawan",
  "/wiki/Dathan",
  "/wiki/Force_lightning",
  "/wiki/Sith_cultist",
  "/wiki/Burial",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Noble",
  "/wiki/City",
  "/wiki/Theed",
  "/wiki/Homeworld",
  "/wiki/Capital",
  "/wiki/Standard_century",
  "/wiki/Darth_Bane",
  "/wiki/Sith_lightsaber",
  "/wiki/Midi-chlorian",
  "/wiki/Book",
  "/wiki/The_Secrets_of_the_Sith",
  "/wiki/Force_power",
  "/wiki/Chommell_sector",
  "/wiki/Skor_Kalpana",
  "/wiki/Sullust_Sector_Spacefarers_Academy",
  "/wiki/Judicial_Department",
  "/wiki/Timeline_of_galactic_history",
  "/wiki/Dathomir",
  "/wiki/Dathomirian",
  "/wiki/Nightsisters",
  "/wiki/Mother_(title)",
  "/wiki/Talzin",
  "/wiki/Magick",
  "/wiki/Zabrak",
  "/wiki/Nightbrothers",
  "/wiki/Unidentified_Nightbrother_keeper",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Darth_Plagueis%27_apartment",
  "/wiki/Sleep",
  "/wiki/42_BBY",
  "/wiki/Rael_Averross",
  "/wiki/Invasion_of_Serenno",
  "/wiki/Count_of_Serenno",
  "/wiki/Mission_to_Oba_Diah_(pre%E2%80%93Naboo_Crisis)",
  "/wiki/Sifo-Dyas",
  "/wiki/Kamino",
  "/wiki/Jedi_Archives",
  "/wiki/Hologram",
  "/wiki/Nute_Gunray",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Trade_Federation_Droid_Army",
  "/wiki/Geonosian",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Archduke",
  "/wiki/Geonosis",
  "/wiki/Controller",
  "/wiki/Geonosian_droid_factories",
  "/wiki/B1-series_battle_droid",
  "/wiki/Trade_Federation_military",
  "/wiki/File:RevengeAtLast-TPM.ogg",
  "/wiki/Finis_Valorum",
  "/wiki/Summit_on_Naboo",
  "/wiki/Star_system",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Neimoidian",
  "/wiki/Assassin",
  "/wiki/Escape_from_the_Saak%27ak",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Queen",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Droid",
  "/wiki/Capture_of_Theed",
  "/wiki/J-type_327_Nubian_royal_starship",
  "/wiki/Tatooine",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Duel_on_Tatooine",
  "/wiki/Yonta_Prime",
  "/wiki/Coruscant",
  "/wiki/Vote_of_No_Confidence",
  "/wiki/Lott_Dod",
  "/wiki/Malastare",
  "/wiki/Aks_Moe",
  "/wiki/Vice_Chair",
  "/wiki/Mas_Amedda",
  "/wiki/Bail_Antilles",
  "/wiki/Alderaan",
  "/wiki/Ainlee_Teem",
  "/wiki/Gungan",
  "/wiki/Battle_of_Naboo",
  "/wiki/Jedi_funeral",
  "/wiki/Yoda",
  "/wiki/Grand_Master",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/30_BBY",
  "/wiki/Yupe_Tashu",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Jakku",
  "/wiki/Imperialis",
  "/wiki/Plaintive_Hand_plateau",
  "/wiki/20_BBY",
  "/wiki/Jakku_Observatory",
  "/wiki/Shah-tezh",
  "/wiki/Force_choke",
  "/wiki/Naval_Intelligence_Agency",
  "/wiki/Commander",
  "/wiki/Imperial_Palace",
  "/wiki/Mace_Windu",
  "/wiki/Coruscant_Underworld",
  "/wiki/Level_2685",
  "/wiki/Club_Kasakar",
  "/wiki/Colandrus",
  "/wiki/Tarsunt",
  "/wiki/Telekinesis",
  "/wiki/Chance_cube",
  "/wiki/Credit",
  "/wiki/Bodyguard",
  "/wiki/Raxus_Address",
  "/wiki/Military_Creation_Act",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Zam_Wesell",
  "/wiki/Mission_to_rescue_Shmi_Skywalker_Lars",
  "/wiki/Shmi_Skywalker_Lars",
  "/wiki/Tusken_Raider",
  "/wiki/Mission_to_Kamino_(Separatist_Crisis)",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Inquisitorius_Headquarters",
  "/wiki/The_Works",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Wedding_of_Anakin_Skywalker_and_Padm%C3%A9_Amidala",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/File:WithTheHuttClanAsWell-TCWf.ogg",
  "/wiki/Hyperspace_route",
  "/wiki/Asajj_Ventress",
  "/wiki/Hutt_Clan",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Rotta",
  "/wiki/Teth",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Ziro%27s_Palace",
  "/wiki/Ahsoka_Tano",
  "/wiki/H-type_Nubian_yacht",
  "/wiki/Rodia",
  "/wiki/41st_Elite_Corps",
  "/wiki/Convoy",
  "/wiki/Rescue_on_the_Tranquility",
  "/wiki/Star_Destroyer",
  "/wiki/Skirmish_at_Vanqor",
  "/wiki/Vanqor",
  "/wiki/Ohnaka_Gang",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Kharrus",
  "/wiki/Mission_to_Florrum",
  "/wiki/Pirate",
  "/wiki/Cad_Bane",
  "/wiki/Raid_on_the_Jedi_Temple",
  "/wiki/Holocron",
  "/wiki/Jedi_temple",
  "/wiki/Holocron_Vault",
  "/wiki/Kyber_memory_crystal",
  "/wiki/Force-sensitive",
  "/wiki/Mustafar",
  "/wiki/Mission_to_Mustafar_(Skywalker_and_Tano)",
  "/wiki/Youngling",
  "/wiki/Battle_of_Malastare",
  "/wiki/Zillo_Beast",
  "/wiki/Doctor",
  "/wiki/Sionver_Boll",
  "/wiki/Zillo_Beast_incident",
  "/wiki/Federal_District",
  "/wiki/Poison",
  "/wiki/Senate_hostage_crisis",
  "/wiki/Prison",
  "/wiki/Republic_financial_reform_bill",
  "/wiki/Separatist_Senate",
  "/wiki/Mina_Bonteri",
  "/wiki/Confederate%E2%80%93Republic_peace_initiative",
  "/wiki/Central_power_distribution_grid",
  "/wiki/Bombing_of_Coruscant%27s_central_power_distribution_grid",
  "/wiki/Attack_on_Confederate_people",
  "/wiki/Republic_military_enhancement_bill",
  "/wiki/Onaconda_Farr",
  "/wiki/Funeral_of_Onaconda_Farr",
  "/wiki/Inspector",
  "/wiki/Tanivos_Exantor_Divo",
  "/wiki/Halle_Burtoni",
  "/wiki/Lolo_Purs",
  "/wiki/Battle_of_Sullust",
  "/wiki/Zygerrian_Slave_Empire",
  "/wiki/Rako_Hardeen",
  "/wiki/Festival_of_Light",
  "/wiki/Skirmish_in_Theed",
  "/wiki/Savage_Opress",
  "/wiki/Takeover_of_Mandalore",
  "/wiki/Mandalore",
  "/wiki/Council_of_Neutral_Systems",
  "/wiki/Darth_Sidious%27_shuttle",
  "/wiki/Sundari",
  "/wiki/Battle_of_Mandalore",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Barriss_Offee",
  "/wiki/Battle_of_Ringo_Vinda",
  "/wiki/CT-5385",
  "/wiki/Tiplar",
  "/wiki/Grand_Republic_Medical_Facility",
  "/wiki/Shaak_Ti",
  "/wiki/Nala_Se",
  "/wiki/CT-5555",
  "/wiki/Darth_Sidious%27_collection",
  "/wiki/Mission_to_Scipio",
  "/wiki/Scipio",
  "/wiki/Rush_Clovis",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Embo",
  "/wiki/Muun",
  "/wiki/Core_Five",
  "/wiki/Suicide",
  "/wiki/Julia",
  "/wiki/Bardotta",
  "/wiki/Dagoyan_Order",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Felucia",
  "/wiki/Valley_of_the_Dark_Lords",
  "/wiki/Moraband",
  "/wiki/Force_spirit",
  "/wiki/Balc",
  "/wiki/Dark_illusion",
  "/wiki/501st_Legion",
  "/wiki/Utapau",
  "/wiki/Kyber_crystal",
  "/wiki/Sugi",
  "/wiki/Endente%27s_arms_dealing_group",
  "/wiki/Endente",
  "/wiki/Mission_to_Utapau",
  "/wiki/Tu-Anh",
  "/wiki/DH-Omni_Support_Vessel",
  "/wiki/Invasion_of_Utapau",
  "/wiki/Campaign_against_the_Shadow_Collective",
  "/wiki/Mandalorian_super_commando",
  "/wiki/Spire_(Stygeon_Prime)",
  "/wiki/Stygeon_Prime",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Battle_of_Zanbar",
  "/wiki/Zanbar",
  "/wiki/Ord_Mantell",
  "/wiki/Second_Battle_of_Dathomir",
  "/wiki/Shadow_Collective",
  "/wiki/Quinlan_Vos",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Vigilance_(Venator-class)",
  "/wiki/Orbit",
  "/wiki/Christophsis",
  "/wiki/Second_battle_of_Christophsis",
  "/wiki/Christophsis_Separatist_tower",
  "/wiki/Sector_Governance_Decree",
  "/wiki/Reflex_Amendment",
  "/wiki/Outer_Rim_Sieges",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Roron_Corobb",
  "/wiki/Shaak_Ti%27s_lightsaber",
  "/wiki/Flagship",
  "/wiki/Invisible_Hand",
  "/wiki/Siege_of_Mandalore",
  "/wiki/Bridge_(starship)",
  "/wiki/Guarlara_(Venator-class)",
  "/wiki/Battle_of_Utapau",
  "/wiki/Kit_Fisto",
  "/wiki/Agen_Kolar",
  "/wiki/Saesee_Tiin",
  "/wiki/Treason",
  "/wiki/Second",
  "/wiki/Siege_of_the_Jedi_Temple",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Executive_Separatist_Council",
  "/wiki/CC-2224",
  "/wiki/Kanan_Jarrus",
  "/wiki/Clone_Commander",
  "/wiki/Rex",
  "/wiki/File:Palpatine-Proclamation.ogg",
  "/wiki/Special_session_of_Congress",
  "/wiki/Monarchy",
  "/wiki/Duel_in_the_Galactic_Senate",
  "/wiki/J-type_Naboo_star_skiff",
  "/wiki/Duel_on_Mustafar",
  "/wiki/Chancellor%27s_working_office",
  "/wiki/Chancellery_Secretariat",
  "/wiki/Imperial_shock_trooper",
  "/wiki/Coruscant_Guard",
  "/wiki/Thire%27s_squad",
  "/wiki/CC-4477",
  "/wiki/Cybernetics",
  "/wiki/Cylo",
  "/wiki/Vader%27s_armor",
  "/wiki/Sith_Citadel",
  "/wiki/Byss",
  "/wiki/Deep_Core",
  "/wiki/Alter_Reality",
  "/wiki/12_BBY",
  "/wiki/Shrine_in_the_Depths",
  "/wiki/11-4D",
  "/wiki/Laboratory",
  "/wiki/Hunter_droid",
  "/wiki/M-OC",
  "/wiki/R0-GR",
  "/wiki/Freemakers",
  "/wiki/Eriadu",
  "/wiki/Carrion_Plateau",
  "/wiki/14_BBY",
  "/wiki/Cham_Syndulla",
  "/wiki/Ryloth",
  "/wiki/Free_Ryloth_Movement",
  "/wiki/Orn_Free_Taa",
  "/wiki/Twi%27lek",
  "/wiki/Mission_to_Ryloth",
  "/wiki/Moff",
  "/wiki/Delian_Mors",
  "/wiki/Perilous",
  "/wiki/Denon",
  "/wiki/Denon_system",
  "/wiki/Obedience",
  "/wiki/Imperial_Navy",
  "/wiki/Commandant",
  "/wiki/Pell_Baylo",
  "/wiki/Hyperspace",
  "/wiki/Christophsis%27_sun",
  "/wiki/Cadet",
  "/wiki/Rae_Sloane",
  "/wiki/Ryloth_system",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Pistoeka_sabotage_droid",
  "/wiki/Hyperdrive",
  "/wiki/Sergeant",
  "/wiki/Erstin_Deez",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Darth_Vader%27s_lightsaber",
  "/wiki/Lylek",
  "/wiki/Grenade",
  "/wiki/Drua",
  "/wiki/Drua%27s_Village",
  "/wiki/Narmn",
  "/wiki/Colonel",
  "/wiki/Belkor_Dray",
  "/wiki/Isval",
  "/wiki/Project_Stardust",
  "/wiki/Berch_Teller",
  "/wiki/Republic_Intelligence",
  "/wiki/Berch_Teller%27s_rebel_cell",
  "/wiki/Antar_Atrocity",
  "/wiki/Antar_4",
  "/wiki/Gotal",
  "/wiki/Koorivar",
  "/wiki/Vice_Admiral",
  "/wiki/Dodd_Rancit",
  "/wiki/Attack_on_Sentinel_Base",
  "/wiki/Sentinel_Base",
  "/wiki/Ruling_Council",
  "/wiki/Murkhana",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/HoloNet",
  "/wiki/Shadowfeed",
  "/wiki/Mission_to_Murkhana",
  "/wiki/Carrion_Spike",
  "/wiki/Belderone_system",
  "/wiki/Perlemian_Trade_Route",
  "/wiki/Hydian_Way",
  "/wiki/Attack_on_Lucazec",
  "/wiki/Tagge_Corporation",
  "/wiki/Lucazec",
  "/wiki/Holovid",
  "/wiki/Battle_in_the_Phindar_system",
  "/wiki/Phindar_system",
  "/wiki/Interdictor_vessel",
  "/wiki/Bracchia",
  "/wiki/Stellan",
  "/wiki/Battle_near_the_Gulf_of_Tatooine",
  "/wiki/Gulf_of_Tatooine",
  "/wiki/Grand_Moff",
  "/wiki/Governor",
  "/wiki/Imperial_Intelligence",
  "/wiki/Project_Auger",
  "/wiki/Zeffo",
  "/wiki/Zeffo_(species)",
  "/wiki/Krane",
  "/wiki/Strikefast",
  "/wiki/Voss_Parck",
  "/wiki/Chiss",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Wild_Space",
  "/wiki/Eli_N._Vanto",
  "/wiki/Royal_Imperial_Academy",
  "/wiki/9_BBY",
  "/wiki/Fight_on_a_barren_moon",
  "/wiki/Probe_droid",
  "/wiki/Dark_side_adept",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Hidden_Hand",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani_Garrison",
  "/wiki/Aldhani",
  "/wiki/5_BBY",
  "/wiki/Public_Order_Resentencing_Directive",
  "/wiki/4_BBY",
  "/wiki/Empire_Day",
  "/wiki/Imperial_Senate",
  "/wiki/Lothal",
  "/wiki/Arihnda_Pryce",
  "/wiki/Ezra_Bridger",
  "/wiki/Attack_on_Phoenix_Squadron_(4_BBY)",
  "/wiki/Lothal_system",
  "/wiki/2_BBY",
  "/wiki/Grand_Admiral",
  "/wiki/Batonn_insurgency",
  "/wiki/Batonn_insurgents",
  "/wiki/Batonn_sector",
  "/wiki/Death_Star",
  "/wiki/Mon_Mothma",
  "/wiki/Ghorman_Massacre",
  "/wiki/Spectres",
  "/wiki/Archeon_Nebula",
  "/wiki/Hera_Syndulla",
  "/wiki/Dantooine",
  "/wiki/Battle_of_Atollon",
  "/wiki/Atollon",
  "/wiki/Lothal_Jedi_Temple",
  "/wiki/Minister",
  "/wiki/Veris_Hydan",
  "/wiki/Painting_of_the_Mortis_gods",
  "/wiki/Sith_alchemy",
  "/wiki/World_Between_Worlds",
  "/wiki/Fiery_energy",
  "/wiki/Lasso",
  "/wiki/Skirmish_against_the_Third_Fleet",
  "/wiki/Balanhai_Savit",
  "/wiki/Grysk_Hegemony",
  "/wiki/Chimaera",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Capital_City",
  "/wiki/Portal",
  "/wiki/Mart_Mattin",
  "/wiki/Purrgil",
  "/wiki/Frequency_Zero",
  "/wiki/Scientist",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Bodhi_Rook",
  "/wiki/Jedha",
  "/wiki/Jedha_City",
  "/wiki/Director",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Rogue_One",
  "/wiki/Squad",
  "/wiki/Jyn_Erso",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Death_Star_plans",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Imperial_Military",
  "/wiki/Rescue_of_Princess_Leia",
  "/wiki/Cassio_Tagge",
  "/wiki/Assault_on_Cymoon",
  "/wiki/Cymoon_1",
  "/wiki/Weapons_Factory_Alpha",
  "/wiki/Imdaar",
  "/wiki/Kuat",
  "/wiki/Shu-Torun",
  "/wiki/Ore-duke",
  "/wiki/Unidentified_King_of_Shu-Torun",
  "/wiki/Grand_General",
  "/wiki/Son-tuul_Pride",
  "/wiki/Hutt",
  "/wiki/Assault_on_Cymoon#Aftermath",
  "/wiki/War_on_Shu-Torun",
  "/wiki/Trios",
  "/wiki/Monarch_of_Shu-Torun",
  "/wiki/Theft_of_the_Imperialis",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Sienar_Fleet_Systems",
  "/wiki/Orbital_Shipyard_CC-24",
  "/wiki/Castell",
  "/wiki/Commodore",
  "/wiki/Idel",
  "/wiki/Captain",
  "/wiki/Shan",
  "/wiki/Conro",
  "/wiki/Pasqual",
  "/wiki/Chanath_Cha",
  "/wiki/Lobot",
  "/wiki/Quantxi",
  "/wiki/Tarkin_Initiative",
  "/wiki/Whale-ship",
  "/wiki/Krrsantan",
  "/wiki/Cylo%27s_research_base",
  "/wiki/Skirmish_in_Cylo%27s_research_base",
  "/wiki/0-0-0",
  "/wiki/Aiolin_Astarte",
  "/wiki/Morit_Astarte",
  "/wiki/Tulon_Voidgazer",
  "/wiki/Karbin",
  "/wiki/Unidentified_Trandoshan_(Cylo-V%27s_warrior)",
  "/wiki/Trandoshan",
  "/wiki/Secret_mission_to_Geonosis",
  "/wiki/BX-series_droid_commando",
  "/wiki/Battle_of_Vrogas_Vas",
  "/wiki/Vrogas_Vas",
  "/wiki/Throne",
  "/wiki/Rubix",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Executor",
  "/wiki/Hijacking_of_the_Executor",
  "/wiki/Archaeologist",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Death_Squadron",
  "/wiki/Battle_of_Hoth",
  "/wiki/Commanding_officer",
  "/wiki/Admiral",
  "/wiki/Cloud_City",
  "/wiki/Bespin",
  "/wiki/Carbon-freezing",
  "/wiki/Duel_on_Cloud_City",
  "/wiki/ZED-6-7",
  "/wiki/Death_trooper",
  "/wiki/Forensics_droid",
  "/wiki/Motivator",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Emperor%27s_throne_room_(Imperial_Palace)",
  "/wiki/Sab%C3%A9",
  "/wiki/Amidalans",
  "/wiki/Polis_Massa",
  "/wiki/Ochi",
  "/wiki/Sith_wayfinder",
  "/wiki/Summa-verminoth",
  "/wiki/Exegol_Sith_guard",
  "/wiki/Axial_superlaser",
  "/wiki/Dathan_(Symeong)",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Qi%27ra",
  "/wiki/Crimson_Dawn",
  "/wiki/Jekara",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Syndicate_War",
  "/wiki/Assassination_of_the_Emperor%27s_Royal_Guard",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Endor",
  "/wiki/Mon_Cala",
  "/wiki/Chandrila",
  "/wiki/Astromech_droid",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Emperor%27s_Throne_Room",
  "/wiki/Shatterpoint",
  "/wiki/Ravager",
  "/wiki/Vulpinus_Nebula",
  "/wiki/Anoat_sector",
  "/wiki/Iron_Blockade",
  "/wiki/Propaganda",
  "/wiki/Ubrik_Adelhard",
  "/wiki/Lozen_Tolruck",
  "/wiki/Operation:_Cinder",
  "/wiki/Garrick_Versio",
  "/wiki/Lerr_Duvat",
  "/wiki/Acolytes_of_the_Beyond",
  "/wiki/Taris",
  "/wiki/Unidentified_Mon_Calamari_soldier",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Hall_of_Imperial_Register",
  "/wiki/5_ABY",
  "/wiki/Eclipse_(Executor-class)",
  "/wiki/Image_crystal",
  "/wiki/Wullf_Yularen",
  "/wiki/Terrinald_Screed",
  "/wiki/Fleet_Admiral",
  "/wiki/Attack_on_Chandrila",
  "/wiki/Observatory",
  "/wiki/Brendol_Hux",
  "/wiki/Armitage_Hux",
  "/wiki/Norra_Wexley",
  "/wiki/Brentin_Lore_Wexley",
  "/wiki/34_ABY",
  "/wiki/Force_vision",
  "/wiki/Scavenger",
  "/wiki/Takodana_Castle",
  "/wiki/Ahch-To",
  "/wiki/Religion",
  "/wiki/Throne_of_the_Sith",
  "/wiki/Ommin",
  "/wiki/King",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/First_Order_military",
  "/wiki/Kuat-Entralla_Engineering",
  "/wiki/Sienar-Jaemus_Fleet_Systems",
  "/wiki/Sith_trooper",
  "/wiki/Kaminoan",
  "/wiki/Sith_Eternal_army",
  "/wiki/Imperial_cloning_program",
  "/wiki/Enric_Pryde",
  "/wiki/Miramir",
  "/wiki/15_ABY",
  "/wiki/21_ABY",
  "/wiki/Unkar_Plutt",
  "/wiki/Bestoon_Legacy",
  "/wiki/Jedi_Temple_of_Luke_Skywalker",
  "/wiki/Destruction_of_the_Jedi_Temple",
  "/wiki/Knights_of_Ren",
  "/wiki/Ren_(human)",
  "/wiki/Minemoon",
  "/wiki/Tai",
  "/wiki/Master_of_the_Knights_of_Ren",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Supremacy",
  "/wiki/File:Palpatines_Broadcast.ogg",
  "/wiki/Mission_to_Mustafar_(First_Order)",
  "/wiki/TIE/dg_starfighter",
  "/wiki/Sith_Eternal_military",
  "/wiki/Mission_to_Kef_Bir",
  "/wiki/Death_Star_ruins",
  "/wiki/Kef_Bir",
  "/wiki/Ajan_Kloss",
  "/wiki/Force_healing",
  "/wiki/Allegiant_General",
  "/wiki/Derriphan",
  "/wiki/Kijimi",
  "/wiki/Destruction_of_Kijimi",
  "/wiki/Leia%27s_lightsaber",
  "/wiki/Sith_Citadel_throne_room",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Sovereign_Protector",
  "/wiki/Unidentified_Sith_Eternal_prophecy",
  "/wiki/Force_drain",
  "/wiki/Atmosphere",
  "/wiki/Uprising_against_the_First_Order",
  "/wiki/Corellia",
  "/wiki/Thyferra",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Finn",
  "/wiki/Poe_Dameron",
  "/wiki/Imperial_Ruling_Council",
  "/wiki/Project_Blackwing",
  "/wiki/Alien",
  "/wiki/Chagrian",
  "/wiki/Sosha_Soruna",
  "/wiki/Force_push",
  "/wiki/Counselor_to_the_Empire",
  "/wiki/File:AsIHaveForeseen-ROTJ.ogg",
  "/wiki/Torture",
  "/wiki/Dark_Aura",
  "/wiki/Ur-Kitt%C3%A2t",
  "/wiki/Mind_trick",
  "/wiki/Force_Dash",
  "/wiki/Lightsaber_combat",
  "/wiki/Jar%27Kai",
  "/wiki/Cloak",
  "/wiki/Clothing",
  "/wiki/Velvet",
  "/wiki/Snake",
  "/wiki/Zeyd_cloth",
  "/wiki/Ralph_McQuarrie",
  "/wiki/1977",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/George_Lucas",
  "/wiki/1973",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Leland_Chee",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Marjorie_Eaton",
  "/wiki/Ian_McDiarmid",
  "/wiki/Elaine_Baker",
  "/wiki/Phil_Tippett",
  "/wiki/Rick_Baker",
  "/wiki/Clive_Revill",
  "/wiki/2004",
  "/wiki/James_Earl_Jones",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Nilo_Rodis-Jamero",
  "/wiki/Alan_Webb",
  "/wiki/Richard_Marquand",
  "/wiki/June_22",
  "/wiki/1982",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Celebration_Chicago",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars_saga",
  "/wiki/December_20",
  "/wiki/J.J._Abrams",
  "/wiki/Kathleen_Kennedy",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Colin_Trevorrow",
  "/wiki/Warwick_Davis",
  "/wiki/Maryann_Brandon",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Ian_Abercrombie",
  "/wiki/Dave_Filoni",
  "/wiki/January_26",
  "/wiki/2012",
  "/wiki/Tim_Curry",
  "/wiki/The_Lawless",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Sam_Witwer",
  "/wiki/Star_Wars_Rebels:_The_Siege_of_Lothal",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/Star_Wars_Rebels_Season_Four",
  "/wiki/Stuart_Beattie",
  "/wiki/Part_VI",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Deborah_Chow",
  "/wiki/1950s#1957",
  "/wiki/1930s#1937",
  "/wiki/Cos_Dashit",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Star_Wars_Legends",
  "/wiki/2014",
  "/wiki/Tarkin_(novel)",
  "/wiki/James_Luceno",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Underworld",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/The_Lost_One",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Trevor_Devall",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures_Season_One",
  "/wiki/Kyber_Saber",
  "/wiki/Naare",
  "/wiki/Rowan_Freemaker/LEGO",
  "/wiki/Freemakers/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures_Season_Two",
  "/wiki/Hunter_droid/LEGO",
  "/wiki/M-OC/LEGO",
  "/wiki/XX-23_S-thread_tracker",
  "/wiki/Arrowhead_(Freemakers)",
  "/wiki/Capture_of_Rowan_Freemaker",
  "/wiki/Qalydon",
  "/wiki/Rescue_of_Rowan_Freemaker",
  "/wiki/Skirmish_on_Shantipole",
  "/wiki/Category:Audio_files_of_Palpatine",
  "/wiki/Category:Images_of_Palpatine",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Darth_Maul_(2017)_3",
  "/wiki/Darth_Maul_(2017)_4",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/The_Phantom_Menace_(Golden_Book)",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Short_Negotiations",
  "/wiki/5-Minute_Star_Wars_Stories_Strike_Back",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(television_series)",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Obi-Wan_and_Anakin_1",
  "/wiki/Obi-Wan_and_Anakin_2",
  "/wiki/Obi-Wan_and_Anakin_3",
  "/wiki/Obi-Wan_and_Anakin_4",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Choose_Your_Destiny:_An_Obi-Wan_%26_Anakin_Adventure",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Adventure_in_the_Arena",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_5",
  "/wiki/Cat_and_Mouse",
  "/wiki/Ambush",
  "/wiki/Sharing_the_Same_Face",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Rising_Malevolence",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/Destroy_Malevolence",
  "/wiki/Bombad_Jedi",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Lair_of_Grievous",
  "/wiki/Dooku_Captured",
  "/wiki/The_Gungan_General",
  "/wiki/Storm_Over_Ryloth",
  "/wiki/Liberty_on_Ryloth",
  "/wiki/Holocron_Heist",
  "/wiki/Cargo_of_Doom",
  "/wiki/Children_of_the_Force",
  "/wiki/The_Zillo_Beast",
  "/wiki/The_Zillo_Beast_Strikes_Back",
  "/wiki/A_Jedi%27s_Duty",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Lightsaber_Lost",
  "/wiki/Voyage_of_Temptation",
  "/wiki/Duchess_of_Mandalore",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Catalyst:_A_Rogue_One_Novel_(audiobook)",
  "/wiki/Corruption_(episode)",
  "/wiki/Sphere_of_Influence",
  "/wiki/Evil_Plans",
  "/wiki/Hostage_Crisis",
  "/wiki/Hostage_Crisis_(short_story)",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Pursuit_of_Peace",
  "/wiki/Pursuit_of_Peace_(short_story)",
  "/wiki/Senate_Murders",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_Give_%26_Take",
  "/wiki/Star_Wars_Adventures_(2020)_12",
  "/wiki/Nightsisters_(episode)",
  "/wiki/Monster",
  "/wiki/Ghosts_of_Mortis",
  "/wiki/Citadel_Rescue",
  "/wiki/Shadow_Warrior",
  "/wiki/Mercy_Mission_(episode)",
  "/wiki/Darkness_on_Umbara",
  "/wiki/Carnage_of_Krell",
  "/wiki/The_Shadow_of_Umbara",
  "/wiki/Escape_from_Kadavo",
  "/wiki/A_Friend_in_Need",
  "/wiki/Deception",
  "/wiki/Friends_and_Enemies",
  "/wiki/The_Box",
  "/wiki/Crisis_on_Naboo",
  "/wiki/Brothers",
  "/wiki/Revenge_(episode)",
  "/wiki/Dark_Vengeance:_The_True_Story_of_Darth_Maul_and_His_Revenge_Against_the_Jedi_Known_as_Obi-Wan_Kenobi",
  "/wiki/Revival_(episode)",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/The_Unknown",
  "/wiki/Conspiracy",
  "/wiki/Fugitive",
  "/wiki/Orders",
  "/wiki/An_Old_Friend",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/Crisis_at_the_Heart",
  "/wiki/The_Disappeared,_Part_I",
  "/wiki/Voices",
  "/wiki/Sacrifice",
  "/wiki/The_Big_Bang",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_1",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_2",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_3",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_4",
  "/wiki/Age_of_Republic_-_Padm%C3%A9_Amidala_1",
  "/wiki/Revenge_of_the_Sith_(Golden_Book)",
  "/wiki/Revenge_of_the_Sith_Read-Along_Storybook_and_CD",
  "/wiki/The_Last_Adventure",
  "/wiki/5-Minute_Star_Wars_Stories_(2015)",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Aftermath_(episode)",
  "/wiki/Kanan_1",
  "/wiki/Kanan_2",
  "/wiki/Darth_Vader_(2017)_1",
  "/wiki/Resolve_(episode)",
  "/wiki/Darth_Vader_(2017)_2",
  "/wiki/Darth_Vader_(2017)_3",
  "/wiki/Darth_Vader_(2017)_4",
  "/wiki/Darth_Vader_(2017)_5",
  "/wiki/Darth_Vader_(2017)_6",
  "/wiki/Darth_Vader_(2017)_7",
  "/wiki/Darth_Vader_(2017)_8",
  "/wiki/Darth_Vader_(2017)_9",
  "/wiki/Darth_Vader_(2017)_10",
  "/wiki/Star_Wars_(2020)_25",
  "/wiki/Bounty_Lost",
  "/wiki/Darth_Vader_(2017)_11",
  "/wiki/Darth_Vader_(2017)_12",
  "/wiki/Kanan_3",
  "/wiki/Darth_Vader_(2017)_13",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/Darth_Vader_(2017)_15",
  "/wiki/Darth_Vader_(2017)_16",
  "/wiki/Darth_Vader_(2017)_17",
  "/wiki/Kanan_4",
  "/wiki/Kanan_5",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Adventures_in_Wild_Space:_The_Escape",
  "/wiki/Adventures_in_Wild_Space:_The_Snare",
  "/wiki/Adventures_in_Wild_Space:_The_Nest",
  "/wiki/Adventures_in_Wild_Space:_The_Steal",
  "/wiki/Adventures_in_Wild_Space:_The_Dark",
  "/wiki/Adventures_in_Wild_Space:_The_Cold",
  "/wiki/Adventures_in_Wild_Space:_The_Rescue",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Ahsoka_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/So_Much_More",
  "/wiki/Star_Wars_Adventures_Annual_2019",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Voice_of_the_Empire",
  "/wiki/Star_Wars_Insider_170",
  "/wiki/Orientation",
  "/wiki/Star_Wars_Insider_157",
  "/wiki/Lords_of_the_Sith",
  "/wiki/Lords_of_the_Sith_(audiobook)",
  "/wiki/Mercy_Mission_(short_story)",
  "/wiki/The_Rise_of_the_Empire",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_2",
  "/wiki/Age_of_Rebellion_-_Darth_Vader_1",
  "/wiki/Darth_Vader_(2017)_18",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/Darth_Vader_(2017)_20",
  "/wiki/Darth_Vader_(2017)_21",
  "/wiki/Darth_Vader_(2017)_23",
  "/wiki/Darth_Vader_(2017)_24",
  "/wiki/Darth_Vader_(2017)_25",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Trouble_Again",
  "/wiki/Star_Wars_Adventures_(2017)_9",
  "/wiki/Most_Wanted",
  "/wiki/Most_Wanted_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Han_Solo_-_Imperial_Cadet_1",
  "/wiki/Lando_-_Double_or_Nothing_1",
  "/wiki/Rebel_Rising",
  "/wiki/Rebel_Rising_(audiobook)",
  "/wiki/Thrawn_(novel)",
  "/wiki/Thrawn_(audiobook)",
  "/wiki/Thrawn_1",
  "/wiki/Thrawn_4",
  "/wiki/Thrawn_5",
  "/wiki/Thrawn_6",
  "/wiki/Bottleneck_(short_story)",
  "/wiki/A_New_Dawn_(novel)",
  "/wiki/A_New_Dawn_(audiobook)",
  "/wiki/The_Ghosts_of_Maul",
  "/wiki/Part_I",
  "/wiki/HoloNet_News_(Tumblr)",
  "/wiki/HoloNet_News_Exclusive:_Mas_Amedda_receives_Governor_Arihnda_Pryce_for_Lothal_report",
  "/wiki/Lost_Stars",
  "/wiki/Lost_Stars_(audiobook)",
  "/wiki/Lost_Stars_(webcomic)",
  "/wiki/Servants_of_the_Empire:_Edge_of_the_Galaxy",
  "/wiki/Aldhani_(episode)",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Rise_of_the_Rebels",
  "/wiki/Ezra%27s_Gamble",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion",
  "/wiki/Droids_in_Distress_(book)",
  "/wiki/Rise_of_the_Old_Masters",
  "/wiki/Servants_of_the_Empire:_Rebel_in_the_Ranks",
  "/wiki/Breaking_Ranks",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/Kallus%27_Hunt",
  "/wiki/Star_Wars_Rebels_Magazine_4",
  "/wiki/Empire_Day_(episode)",
  "/wiki/HoloNet_News",
  "/wiki/Ezra%27s_Duel_with_Danger",
  "/wiki/Kanan_6",
  "/wiki/Kanan_7",
  "/wiki/Kanan_8",
  "/wiki/Kanan_9",
  "/wiki/Kanan_10",
  "/wiki/Kanan_11",
  "/wiki/Kanan_12",
  "/wiki/Servants_of_the_Empire:_Imperial_Justice",
  "/wiki/Servants_of_the_Empire:_The_Secret_Academy",
  "/wiki/Battle_to_the_End",
  "/wiki/Fire_Across_the_Galaxy",
  "/wiki/Senate_Perspective",
  "/wiki/Star_Wars_Rebels_Magazine_9",
  "/wiki/Star_Wars_Rebels:_Chopper_Chase",
  "/wiki/The_Lost_Commanders",
  "/wiki/No_Sympathy",
  "/wiki/Star_Wars_Rebels_Magazine_14",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/Leia,_Princess_of_Alderaan_(audiobook)",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess",
  "/wiki/The_Future_of_the_Force",
  "/wiki/A_Princess_on_Lothal",
  "/wiki/Academy_Cadets",
  "/wiki/Star_Wars_Rebels_Magazine_18",
  "/wiki/Shroud_of_Darkness",
  "/wiki/Twilight_of_the_Apprentice",
  "/wiki/Endangered,_Part_1",
  "/wiki/Star_Wars_Adventures_(2017)_7",
  "/wiki/Endangered,_Part_2",
  "/wiki/Star_Wars_Adventures_(2017)_8",
  "/wiki/Star_Wars_Rebels:_Steps_Into_Shadow",
  "/wiki/Legacy_of_Mandalore",
  "/wiki/Secret_Cargo",
  "/wiki/Twin_Suns_(episode)",
  "/wiki/Zero_Hour",
  "/wiki/Thrawn:_Alliances_(audiobook)",
  "/wiki/Star_Wars_Rebels:_Heroes_of_Mandalore",
  "/wiki/Jedi_Night",
  "/wiki/Thrawn:_Treason_(audiobook)",
  "/wiki/Wolves_and_a_Door",
  "/wiki/A_World_Between_Worlds",
  "/wiki/A_Fool%27s_Hope",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!_(audiobook)",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_1",
  "/wiki/Vader_-_Dark_Visions_3",
  "/wiki/Vader_-_Dark_Visions_4",
  "/wiki/Blood_Moon_Uprising_(short_story)",
  "/wiki/Guardians_of_the_Whills_(novel)",
  "/wiki/Red_Four_(comic)",
  "/wiki/Marvel_Comics_1000",
  "/wiki/Obi-Wan_3",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_1",
  "/wiki/Rogue_One_Adaptation_2",
  "/wiki/Rogue_One_Adaptation_3",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Raymus",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Episode_IV:_A_New_Hope_Read-Along_Storybook_and_CD",
  "/wiki/The_Rise_of_a_Hero",
  "/wiki/The_Adventures_of_Luke_Skywalker,_Jedi_Knight",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_Battlefront",
  "/wiki/The_Bucket",
  "/wiki/Fully_Operational_(short_story)",
  "/wiki/An_Incident_Report",
  "/wiki/Change_of_Heart",
  "/wiki/Verge_of_Greatness",
  "/wiki/Bump",
  "/wiki/End_of_Watch",
  "/wiki/Time_of_Death",
  "/wiki/Contingency_Plan",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/Smuggler%27s_Run:_A_Han_Solo_%26_Chewbacca_Adventure",
  "/wiki/Smuggler%27s_Run:_A_Han_Solo_%26_Chewbacca_Adventure_(audiobook)",
  "/wiki/Princess_Leia_2",
  "/wiki/Princess_Leia_5",
  "/wiki/Heir_to_the_Jedi",
  "/wiki/Heir_to_the_Jedi_(audiobook)",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure_(audiobook)",
  "/wiki/Choose_Your_Destiny:_A_Luke_%26_Leia_Adventure",
  "/wiki/Star_Wars_Annual_(2015)_4",
  "/wiki/Star_Wars_(2015)_1",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/Star_Wars_(2015)_4",
  "/wiki/Darth_Vader_(2015)_2",
  "/wiki/Darth_Vader_(2015)_3",
  "/wiki/Doctor_Aphra:_An_Audiobook_Original",
  "/wiki/Darth_Vader_(2015)_4",
  "/wiki/Darth_Vader_(2015)_5",
  "/wiki/Darth_Vader_(2015)_6",
  "/wiki/Star_Wars_(2015)_12",
  "/wiki/Darth_Vader_(2015)_7",
  "/wiki/Darth_Vader_(2015)_8",
  "/wiki/Darth_Vader_(2015)_9",
  "/wiki/Star_Wars_Annual_(2015)_1",
  "/wiki/Darth_Vader_Annual_1",
  "/wiki/Vader_Down_1",
  "/wiki/Star_Wars_(2015)_14",
  "/wiki/Star_Wars_(2015)_16",
  "/wiki/Star_Wars_(2015)_18",
  "/wiki/Star_Wars_(2015)_19",
  "/wiki/Darth_Vader_(2015)_16",
  "/wiki/Darth_Vader_(2015)_17",
  "/wiki/Darth_Vader_(2015)_19",
  "/wiki/Darth_Vader_(2015)_20",
  "/wiki/Darth_Vader_(2015)_21",
  "/wiki/Darth_Vader_(2015)_22",
  "/wiki/Darth_Vader_(2015)_23",
  "/wiki/Darth_Vader_(2015)_24",
  "/wiki/Darth_Vader_(2015)_25",
  "/wiki/The_Screaming_Citadel_1",
  "/wiki/Star_Wars_(2015)_36",
  "/wiki/Doctor_Aphra_(2016)_21",
  "/wiki/Doctor_Aphra_(2016)_23",
  "/wiki/Doctor_Aphra_(2016)_26",
  "/wiki/Doctor_Aphra_(2016)_27",
  "/wiki/Doctor_Aphra_(2016)_29",
  "/wiki/Doctor_Aphra_(2016)_30",
  "/wiki/Doctor_Aphra_(2016)_31",
  "/wiki/Shu-Torun_Lives",
  "/wiki/Star_Wars_(2015)_50",
  "/wiki/Star_Wars_(2015)_46",
  "/wiki/Star_Wars_(2015)_62",
  "/wiki/Doctor_Aphra_(2016)_33",
  "/wiki/Doctor_Aphra_(2016)_34",
  "/wiki/Doctor_Aphra_(2016)_35",
  "/wiki/Doctor_Aphra_(2016)_37",
  "/wiki/Doctor_Aphra_(2016)_38",
  "/wiki/Doctor_Aphra_(2016)_39",
  "/wiki/Doctor_Aphra_(2016)_40",
  "/wiki/Star_Wars:_Commander",
  "/wiki/Vader_-_Dark_Visions_2",
  "/wiki/Star_Wars_Adventures_(2020)_13",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Lando_1",
  "/wiki/Lando_2",
  "/wiki/Lando_3",
  "/wiki/Lando_4",
  "/wiki/Lando_5",
  "/wiki/The_Coin",
  "/wiki/Star_Wars_Adventures_Annual_2021",
  "/wiki/Epilogue",
  "/wiki/Empire_Ascendant_1",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Episode_V:_The_Empire_Strikes_Back_Read-Along_Storybook_and_CD",
  "/wiki/Heroes_of_the_Rebellion_(short_story)",
  "/wiki/The_Final_Order",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Yoda_%E2%80%93_The_Jedi_Master",
  "/wiki/Disturbance",
  "/wiki/Amara_Kel%27s_Rules_for_TIE_Pilot_Survival_(Probably)",
  "/wiki/Lord_Vader_Will_See_You_Now",
  "/wiki/Vergence_(short_story)",
  "/wiki/The_Witness",
  "/wiki/The_Backup_Backup_Plan",
  "/wiki/Darth_Vader_(2020)_1",
  "/wiki/Star_Wars_(2020)_1",
  "/wiki/Star_Wars_(2020)_3",
  "/wiki/Star_Wars_(2020)_4",
  "/wiki/Star_Wars_(2020)_5",
  "/wiki/Star_Wars_(2020)_6",
  "/wiki/Star_Wars_(2020)_9",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/Darth_Vader_(2020)_2",
  "/wiki/Darth_Vader_(2020)_3",
  "/wiki/Darth_Vader_(2020)_6",
  "/wiki/Darth_Vader_(2020)_7",
  "/wiki/Darth_Vader_(2020)_8",
  "/wiki/Darth_Vader_(2020)_9",
  "/wiki/Darth_Vader_(2020)_10",
  "/wiki/Darth_Vader_(2020)_11",
  "/wiki/Doctor_Aphra_(2020)_5",
  "/wiki/Doctor_Aphra_(2020)_9",
  "/wiki/Darth_Vader_(2020)_12",
  "/wiki/Darth_Vader_(2020)_14",
  "/wiki/Darth_Vader_(2020)_13",
  "/wiki/Darth_Vader_(2020)_15",
  "/wiki/Doctor_Aphra_(2020)_12",
  "/wiki/War_of_the_Bounty_Hunters_3",
  "/wiki/Darth_Vader_(2020)_16",
  "/wiki/War_of_the_Bounty_Hunters_4",
  "/wiki/Bounty_Hunters_17",
  "/wiki/Doctor_Aphra_(2020)_23",
  "/wiki/Bounty_Hunters_18",
  "/wiki/Star_Wars_(2020)_21",
  "/wiki/Darth_Vader_(2020)_18",
  "/wiki/Darth_Vader_(2020)_19",
  "/wiki/Darth_Vader_(2020)_21",
  "/wiki/Darth_Vader_(2020)_23",
  "/wiki/Darth_Vader_(2020)_25",
  "/wiki/Bounty_Hunters_28",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/Hidden_Empire_1",
  "/wiki/Revelations_1",
  "/wiki/TIE_Fighter_1",
  "/wiki/TIE_Fighter_3",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure_(audiobook)",
  "/wiki/Tales_from_Wild_Space:_The_Blue_Brothers",
  "/wiki/Star_Wars_Adventures_(2017)_13",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Blade_Squadron_(short_story)",
  "/wiki/Star_Wars_Insider_149",
  "/wiki/Star_Wars_Insider_150",
  "/wiki/Return_of_the_Jedi:_The_Battle_of_Endor",
  "/wiki/Luke_vs._Emperor_Palpatine_-_Rise_to_Evil",
  "/wiki/The_Levers_of_Power",
  "/wiki/Shattered_Empire_1",
  "/wiki/TIE_Fighter_5",
  "/wiki/A_Race_for_Answers",
  "/wiki/Star_Wars_Adventures_(2017)_23",
  "/wiki/Shattered_Empire_2",
  "/wiki/Shattered_Empire_3",
  "/wiki/Turning_Point_(Jason_Hough)",
  "/wiki/Star_Wars_Insider_169",
  "/wiki/Hare-Brained_Heist",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Star_Wars_Adventures:_Ghosts_of_Vader%27s_Castle_5",
  "/wiki/Shattered_Empire_4",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/The_Legends_of_Luke_Skywalker",
  "/wiki/The_Legends_of_Luke_Skywalker_(audiobook)",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/The_Rise_of_Kylo_Ren_4",
  "/wiki/Phasma_(novel)",
  "/wiki/Phasma_(audiobook)",
  "/wiki/The_Crimson_Corsair_and_the_Lost_Treasure_of_Count_Dooku",
  "/wiki/Tales_from_a_Galaxy_Far,_Far_Away:_Aliens:_Volume_I",
  "/wiki/Before_the_Awakening",
  "/wiki/Poe_Dameron_8",
  "/wiki/Poe_Dameron_9",
  "/wiki/Poe_Dameron_10",
  "/wiki/Poe_Dameron_18",
  "/wiki/Destroyer_Down",
  "/wiki/Star_Wars_Adventures:_Destroyer_Down",
  "/wiki/Force_Collector",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/Age_of_Resistance_-_Rey_1",
  "/wiki/Star_Wars_Adventures_Ashcan",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi_Adaptation_3",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/The_Witch_%26_the_Wookiee",
  "/wiki/Myths_%26_Fables",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Dok-Ondar%27s_Den_of_Antiquities",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/William_Shakespeare%27s_The_Phantom_of_Menace:_Star_Wars_Part_the_First",
  "/wiki/William_Shakespeare%27s_The_Clone_Army_Attacketh:_Star_Wars_Part_the_Second",
  "/wiki/LEGO_Star_Wars:_Revenge_of_the_Sith_(Scholastic)",
  "/wiki/William_Shakespeare%27s_Tragedy_of_the_Sith%27s_Revenge:_Star_Wars_Part_the_Third",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/Star_Wars_Epic_Yarns:_The_Empire_Strikes_Back",
  "/wiki/A_Hero_Discovered",
  "/wiki/The_Mines_of_Graballa",
  "/wiki/Zander%27s_Joyride",
  "/wiki/The_Lost_Treasure_of_Cloud_City",
  "/wiki/Peril_on_Kashyyyk",
  "/wiki/Crossing_Paths",
  "/wiki/Race_on_Tatooine",
  "/wiki/The_Test",
  "/wiki/The_Kyber_Saber_Crystal_Chase",
  "/wiki/The_Maker_of_Zoh",
  "/wiki/Showdown_on_Hoth",
  "/wiki/Duel_of_Destiny",
  "/wiki/Return_of_the_Kyber_Saber",
  "/wiki/A_New_Home",
  "/wiki/Home_One_(episode)",
  "/wiki/Rowan%27s_Secret_Adventure",
  "/wiki/Beware,_the_Gamorrean_Flu!",
  "/wiki/Trouble_on_Tibalt",
  "/wiki/The_Tower_of_Alistan_Nor",
  "/wiki/The_Embersteel_Blade",
  "/wiki/The_Storms_of_Taul",
  "/wiki/Return_to_the_Wheel",
  "/wiki/The_Pit_and_the_Pinnacle",
  "/wiki/Flight_of_the_Arrowhead",
  "/wiki/A_Perilous_Rescue",
  "/wiki/Escape_from_Coruscant",
  "/wiki/Free_Fall",
  "/wiki/Return_of_the_Return_of_the_Jedi",
  "/wiki/Star_Wars_Epic_Yarns:_Return_of_the_Jedi",
  "/wiki/LEGO_Star_Wars:_Droid_Tales_Episodes_I-III",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Exit_from_Endor",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/Gambit_on_Geonosis",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/From_Trenches_to_Wrenches:_The_Roger_Story_(episode)",
  "/wiki/The_Good_Stuff!",
  "/wiki/The_Droid_Rescue_Gambit",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/Fortnite_X_Star_Wars",
  "/wiki/William_Shakespeare%27s_The_Merry_Rise_of_Skywalker:_Star_Wars_Part_the_Ninth",
  "/wiki/The_LEGO_Star_Wars_Holiday_Special",
  "/wiki/LEGO_Star_Wars_Terrifying_Tales",
  "/wiki/LEGO_Star_Wars_Summer_Vacation",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Launchpad",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Rebels:_Meet_the_Rebels",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Ultimate_Sticker_Collection:_Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels:_Head_to_Head",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Rebel_Rouser",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/Cowboy_Jedi",
  "/wiki/The_Making_of_A_New_Dawn",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Sabine_My_Rebel_Sketchbook",
  "/wiki/Star_Wars_Rebels:_Rebel_Power!",
  "/wiki/Star_Wars:_Star_Pilot_(2015)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Ships_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Rey%27s_Survival_Guide",
  "/wiki/Star_Wars:_A_Galaxy_at_War",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_I_Am_a_Jedi",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Princess_Leia:_Royal_Rebel",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars_-_The_Official_Magazine",
  "/wiki/Star_Wars_-_The_Official_Magazine_84",
  "/wiki/Database",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Databank_A-Z",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Star_Wars_Helmet_Collection_6",
  "/wiki/Star_Wars_Helmet_Collection_8",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Star_Wars_Helmet_Collection_11",
  "/wiki/Star_Wars_Helmet_Collection_12",
  "/wiki/Star_Wars_Helmet_Collection_13",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Star_Wars_Helmet_Collection_16",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars_Helmet_Collection_20",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Star_Wars_Helmet_Collection_25",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_68",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_1",
  "/wiki/Droid_Directory",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Forces_of_Destiny:_Tales_of_Hope_%26_Courage",
  "/wiki/Ghosts_of_Dathomir",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_A-wing_Deluxe_Book_and_3D_Wood_Model",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Last_Jedi:_Incredible_Cross-Sections",
  "/wiki/The_Last_Jedi:_Bomber_Command",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Star_Wars_Helmet_Collection_28",
  "/wiki/Star_Wars_Helmet_Collection_29",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Star_Wars_Helmet_Collection_32",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Star_Wars_Helmet_Collection_39",
  "/wiki/Star_Wars_Helmet_Collection_40",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars_Helmet_Collection_42",
  "/wiki/Star_Wars_Helmet_Collection_43",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Star_Wars_Helmet_Collection_48",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Star_Wars:_Lightsaber_Battles",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars_Lightsabers:_A_Guide_to_Weapons_of_the_Force",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Star_Wars:_Resistance_Bomber_Book_and_3D_Wood_Model",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Galactic_Empire_Conversion_Kit",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_23",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Star_Wars_Helmet_Collection_55",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Star_Wars_Helmet_Collection_68",
  "/wiki/Star_Wars_Helmet_Collection_69",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Star_Wars_Helmet_Collection_72",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Star_Wars_Helmet_Collection_75",
  "/wiki/Star_Wars_Helmet_Collection_77",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/The_Long_Game_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_188",
  "/wiki/ARC-170_Starfighter_Expansion_Pack",
  "/wiki/Sith_Infiltrator_Expansion_Pack",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Gadgets_and_Gear",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_193",
  "/wiki/Rebel_Starfighters_Owners%27_Workshop_Manual",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_62",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Starships_and_Speeders",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Technology",
  "/wiki/Score",
  "/wiki/LEGO_Classic_Star_Wars",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Naboo_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Star_Wars_Bust_Collection_1",
  "/wiki/Behind_the_Cameras",
  "/wiki/Star_Wars_Bust_Collection_2",
  "/wiki/Star_Wars_Bust_Collection_4",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Emperor_Palpatine",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Exegol,_the_Unknown_Regions,_and_Wild_Space",
  "/wiki/Star_Wars_Inside_Intel:_Coruscant",
  "/wiki/The_Separatists",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Star_Wars_Inside_Intel:_The_Inquisitorius",
  "/wiki/Obi-Wan_Kenobi:_A_Jedi%27s_Return",
  "/wiki/Darth_Zannah",
  "/wiki/32_BBY",
  "/wiki/22_BBY",
  "/wiki/Oshadam",
  "/wiki/28_BBY",
  "/wiki/40_BBY",
  "/wiki/The_Saga_of_Rey",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Galaxy%27s_Edge",
  "/wiki/In_Search_of_the_Crystal",
  "/wiki/Crystal_Crisis",
  "/wiki/A_Death_on_Utapau",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_36",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Star_Wars:_Droidography",
  "/wiki/The_Eye",
  "/wiki/Kassa_(episode)",
  "/wiki/Darth_Vader_(2015)_18",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/December_17",
  "/wiki/February_20",
  "/wiki/2020",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/The_Rise_of_Kylo_Ren_1",
  "/wiki/Star_Wars_Inside_Intel:_Palpatine%27s_Contingency_Plan",
  "/wiki/The_Rise_of_Skywalker_(Little_Golden_Book)",
  "/wiki/Endless_Vigil",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/The_Making_of_The_Empire_Strikes_Back",
  "/wiki/File:Pablo_Emperor_actress_tweet.png",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/File:IX-Palpatine.png",
  "/wiki/November_22",
  "/wiki/February_15",
  "/wiki/April_15",
  "/wiki/December_16",
  "/wiki/March_2",
  "/wiki/July_6",
  "/wiki/2022",
  "/wiki/Star_Wars_and_History",
  "/wiki/Special:BookSources/9780978465230",
  "/wiki/April_19",
  "/wiki/2009",
  "/wiki/August_11",
  "/wiki/2018",
  "/wiki/Special:BookSources/0-231-12966-1",
  "/wiki/The_Making_of_Star_Wars_Revenge_of_the_Sith",
  "/wiki/November_2",
  "/wiki/May_6",
  "/wiki/2016",
  "/wiki/Jedi_Master"
 ]
}