{
 "name": "Darth_Ruyn",
 "display_name": "Darth Ruyn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "137 ABY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red and black Sith tattoos"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "One Sith",
      "Darth Krayt's Galactic Empire"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Darth Talon"
     ]
    }
   ]
  }
 ],
 "content": "Darth Ruyn was an aged male Twi'lek Sith Lord who served the Dark Lord of the Sith Darth Krayt and his One Sith. He instructed several apprentices in the Sith arts, including the female Twi'lek Darth Talon. In 137 ABY, seven years after Krayt deposed Galactic Emperor Roan Fel and established his Galactic Empire on the galaxy, Ruyn completed Talon's training and presented his apprentice to his Lord. As Talon's final test, Krayt commanded her to kill Ruyn, whom she respected and cared for, but a task she nevertheless completed without hesitation.\nOld at the time of the conflict between the Sith-backed Fel Empire and the Galactic Alliance beginning in 127 ABY—known as the Sith–Imperial War—the male Twi'lek Darth Ruyn was a Sith Lord and member of the One Sith Order under the direction of Dark Lord of the Sith Darth Krayt. Ruyn trained Sith apprentices in the ways of dark side of the Force, the last of which was fellow Twi'lek Darth Talon. While teaching his apprentice, Ruyn would often take her to the Sith Art Chamber, within the Temple of the Sith on Coruscant, as he found it conducive to meditation.\nIn 137 ABY, seven years after Krayt deposed Galactic Emperor Roan Fel and established his Sith Empire at the end of the Sith-Imperial War, Ruyn completed Talon's training and presented his apprentice to Krayt. The Dark Lord gave Talon one final test: to kill her Master, whom she respected and cared for. Talon carried out Krayt's order without hesitation, decapitating Ruyn with a sweep of her lightsaber. Having passed the test, Talon was given her Sith name and promoted to the position of Krayt's Hand—his own personal assassin.\nTalon would later reflect that had Ruyn not deemed her ready, he would have blocked her attack. Instead, he died so that she could touch the dark side and complete her training.\nA burly and venerable Twi'lek with yellow eyes, Darth Ruyn was a knowledgeable Sith who considered Darth Talon to be the best apprentice he had ever instructed. Talon believed Ruyn had embraced his death at her hands to allow her to touch the dark side and complete her training. Like most members of the One Sith Order, Ruyn's face and body were fully covered in red and black Sith tattoos.\nDarth Ruyn made his first appearance in the second issue of the Star Wars: Legacy comic series, Broken, Part 2, released in July 2006. The issue was written by John Ostrander and Jan Duursema, and was also penciled by Duursema.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Darth_Ruin",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/137_ABY",
  "/wiki/Coruscant/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_tattoo",
  "/wiki/One_Sith",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Darth_Talon",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Sith_training",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/The_galaxy/Legends",
  "/wiki/File:DeathDarthRuyn.jpg",
  "/wiki/Time/Legends",
  "/wiki/Fel_Empire",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/127_ABY",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_Art_Chamber",
  "/wiki/Temple_of_the_Sith",
  "/wiki/Sai_cha/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Hand_(One_Sith)",
  "/wiki/Death/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_2",
  "/wiki/July",
  "/wiki/2006",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Legacy_(2006)_17",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Legacy_(2006)_0",
  "/wiki/Legacy_(2006)_1"
 ]
}