{
 "name": "Darth Ravage",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Facial implants"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireDark CouncilSphere of Expansion and Diplomacy",
      "Dark Council",
      "Sphere of Expansion and Diplomacy"
     ]
    }
   ]
  }
 ],
 "content": "Darth Ravage was a Human male Dark Lord of the Sith of the reconstituted Sith Empire and a member of the Dark Council during the Cold War.\nWhen Darth Baras announced himself as the Voice of the Emperor, Ravage was among those who tolerated his claim for a time being. When Darth Vowrawn, accompanied by Baras' former apprentice, announced the latter as the Emperor's Wrath and stated that Baras was deceiving the Dark Council, Ravage saw the supposed Wrath to be insignificant and was willing to aid Baras in destroying the Wrath. However, Darth Marr stated that it was unclear who truly spoke for the Emperor, and that the one who survived the ensuing battle would speak truth. In the ensuing duel, when it became apparent that Baras was becoming exhausted, he called on the Dark Council for aid, but even Ravage refused to stand in the path of the Wrath. After the Wrath executed Baras, Ravage, along with the rest of the Dark Council, bowed and pledged loyalty to the Wrath, although he personally labeled the new Wrath as a threat.\nSometime later, Darth Thanaton tried petitioning the Council's aid in killing the former apprentice of Darth Zash, Lord Kallig. However, Kallig intervened and stated that Thanaton deserves to die for abandoning the Kaggath on Corellia. Ravage retorted that the Kaggath is merely trivial and murder had no rules. Though Thanaton tried to defend himself, the Council refused to aid him against Kallig. When Thanaton was brought to his knees, Darth Mortis snapped his neck with the Force. Ravage expressed his relief that they are rid of Thanaton. Marr countered that Thanaton was a better Sith than he gives credit for. Mortis then offered Thanaton's seat to Kallig, which Ravage voiced opposition to, stating that they could not put a mere Lord on the Dark Council. Marr advised him to be silent, stating that Kallig has earned it in defeating Thanaton in fair combat. He then remedied Ravage's protest by granting Kallig the title of Darth Nox. As the Dark Council retired, Ravage advised Nox not to trust men as humble as Marr.\nRavage, along with his fellow Dark Councilors Marr and Nox, was called to Ilum to discuss the betrayal of Darth Malgus. He approved of the death of Darth Serevin during the Battle of Ilum, stating that the time spend among Voss had made him weak. Ravage expressed extreme disdain for Malgus' actions, and later was more than satisfied to hear of his defeat.\nIn the aftermath of the Battle of Corellia, the Dark Council met to discuss the successor to the seat of Darth Hadra, as Hadra had perished during the battle. Ravage was strongly against Darth Marr's nomination of Darth Karrid as Hadra's replacement and instead supported Darth Mortis's nomination of Darth Gravus. However, when news arrived that Karrid had killed Gravus, Ravage supported Karrid, complimenting the fact that she saw what she wanted and seized it.\nBy 3637 BBY, Ravage rapidly expanded into Alzarian territory, believing them to hold no value.\nDarth Ravage detested Darth Thanaton like no other. He was also distrustful of others and was upset when the Council made Kallig a Dark Lord, as well as granting Kallig the place of Darth Thanaton. He shared this sentiment again when Darth Marr nominated Darth Karrid as Darth Hadra's replacement, since she was the former apprentice of the traitor Darth Malgus. Ravage showed much more emotion compared to some of his fellow Dark Councilors. He also seemed to be far more loyal to the Emperor than any of his fellow council members.\nDuring the flashpoint \"The Nathema Conspiracy\", if the Outlander is a Sith Warrior who made the Dark Side choice to kill Darth Baras, Ravage will seek revenge on them for killing Emperor Vitiate and join the Order of Zildrog led by Vinn Atrius, only to be sacrificed as fuel to awaken Zildrog by GEMINI 16 on Nathema. If the warrior made the Light Side choice to spare Baras, he will appear instead of Ravage, while the other classes face antagonists from their own class stories.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Darth_Ravage",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Sphere_of_Expansion_and_Diplomacy",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Darth_Baras",
  "/wiki/Emperor%27s_Voice_(Sith_Empire)",
  "/wiki/Darth_Vowrawn",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Darth_Marr",
  "/wiki/Tenebrae",
  "/wiki/Duel_in_the_Dark_Council_Chambers_(Galactic_War)",
  "/wiki/Darth_Zash",
  "/wiki/Darth_Nox",
  "/wiki/Kaggath",
  "/wiki/Corellia/Legends",
  "/wiki/Darth_Mortis",
  "/wiki/Ilum/Legends",
  "/wiki/Darth_Malgus",
  "/wiki/Darth_Serevin",
  "/wiki/Battle_of_Ilum",
  "/wiki/Voss_(species)",
  "/wiki/Battle_of_Corellia",
  "/wiki/Darth_Hadra",
  "/wiki/Darth_Karrid",
  "/wiki/Darth_Gravus",
  "/wiki/3637_BBY",
  "/wiki/Alzarian/Legends",
  "/wiki/Darth_Thanaton",
  "/wiki/Alliance_Commander",
  "/wiki/Sith_Warrior",
  "/wiki/Order_of_Zildrog",
  "/wiki/Vinn_Atrius",
  "/wiki/Zildrog",
  "/wiki/GEMINI_16",
  "/wiki/Nathema",
  "/wiki/Category:Images_of_Darth_Ravage",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/The_Old_Republic:_Annihilation_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}