{
 "name": "Darth_Achelon",
 "display_name": "Darth Achelon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Sphere of Ancient Knowledge",
      "Sphere of Ancient Knowledge"
     ]
    }
   ]
  }
 ],
 "content": "Darth Achelon was a Human male Sith Lord of the Sith Empire, that served Darth Thanaton of the Dark Council. Moff Pyron saw an opportunity to test the Silencer superweapon against a fleet. Lord Kallig, Thanaton's nemesis, was looking forward to testing the Silencer to win an alliance with anti-Thanaton Moffs and had to choose whether to save Achelon or not.\nDarth Achelon is a character in the 2011 Star Wars: The Old Republic MMORPG video game.\nAchelon's fate can be decided three ways. Kallig can choose to let the Republic destroy his flagship, fire the Silencer at him or tell him to withdraw. If Kallig tells Achelon to withdraw to a safe distance before firing the Silencer, the latter would agree not to attack Kallig on sight. Achelon is later seen on Corellia, commanded by Thanaton to kill the player. However, Achelon refused to turn on Kallig after being spared by his enemy. After Kallig manages to defeat Thanaton and assume his place on the Dark Council, Achelon would be among those who swear loyalty to the newly anointed Dark Lord. You may then instruct him on what to do with your resources. If Achelon is dead, Lord Kirnon will take his place.\nIf Achelon was killed, Thanaton will order Darth Kallous to kill Lord Kallig.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sphere_of_Ancient_Knowledge",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Thanaton",
  "/wiki/Dark_Council",
  "/wiki/Valion_Pyron",
  "/wiki/Silencer_(superweapon)",
  "/wiki/Superweapon/Legends",
  "/wiki/Darth_Nox",
  "/wiki/Moff/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Corellia/Legends",
  "/wiki/Kirnon",
  "/wiki/Darth_Kallous"
 ]
}