{
 "name": "Darth Rivan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Almas"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 1000 BBY",
      "Ruusan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zelosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Sith"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Darsin",
      "Valin Draco"
     ]
    }
   ]
  }
 ],
 "content": "Darth Rivan was a Zelosian male who was a Sith Lord during the time of the New Sith Wars. He took his Sith name from a corrupted Sith manuscript which incorrectly identified Darth Revan, the Dark Lord of the Sith who was redeemed during the Jedi Civil War, as \"Rivan.\"\nDuring the New Sith Wars, Darth Rivan visited the uncharted Cularin system and settled on the planet Almas, despite the planet's inhospitable atmosphere. There, he built a fortress, intending to delve in the mysteries of the dark side.\nRivan's true purpose for constructing the fortress, however, lay in the creation of Sith battlelords. Rivan's vision for this elite new corps lay in the very nature of the dark side itself; specifically, in its inherent discord. Whenever many darksiders gathered in one location, sooner or later some of them would die, or turn on one another. Enlightened inter-cooperation was not held to be a virtue by darksiders. Eliminating insubordination amongst the Sith ranks became a mission of Rivan's, and his creation of the battlelord would serve to Force bond a commander to his troops—if a soldier attempted to harm their commander, the intended wound would instead be inflicted upon the soldier.\nAnalysis of the fortress performed shortly after the Battle of Naboo revealed that the dome on the fortress was well over 1,000 years old. The fortress itself was essentially a gigantic dark side focal-point, capable of shooting lightning at passing starships.\nThe castle was plagued with mechanical traps which could not be detected with the Force or with advanced technological means. Rivan would use Mandalorian iron, resistant to the Force and to the lightsaber, to keep his most valued books, and for the floor of his lightsaber training room. He also designed the fortress so that his slaves/prisoners  would be cut off from the Force, feeling absolutely lost and despaired. Darth Rivan wrote his autobiography in Sithese in the inner walls of his fortress.\nDarth Rivan was known for being the wielder of the powerful artifact known as the Darkstaff, a semi-sentient weapon capable of draining Force-essence from a living being.\nDarth Rivan also created the kaluthin grass to modify the planet's landscape and atmosphere, and make it breathable. Although the kaluthin terraformed Almas to a gardenlike place, it could not remove the noxious local gases and Almas's atmosphere would never be exactly pure.\nRivan lived in Almas for decades until driven off by the Jedi Knights, at some point before 1250 BBY. During the Battle of Almas, the Jedi destroyed Rivan's fortress structure, although the core tower, impervious to blaster fire, survived the attack.\nIn the end, it was known that Rivan's quest for physical immortality never truly succeeded. It was initially believed that, after being driven off Almas by a massive Jedi/Republic assault, Darth Rivan barely escaped with his life, and eventually perished after being betrayed by his fellow Sith—specifically, his own apprentice, Darsin.\nIn actuality, however, Rivan left the fortress one day leaving Darsin behind, and Darsin died before Rivan, his body modified by Rivan's alchemies to create a slave Force spirit. Rivan managed to harness the power of the Darkstaff to create a Force storm that swept him through time and space to the planet Ruusan, during the battles between the Jedi Army of Light and the Sith Brotherhood of Darkness several centuries later. There, with his Force power drained by the Darkstaff, he was easily slain by a Force-sensitive warrior, someone who had been another apprentice of Rivan . Rivan could not be buried in the crypt he had created for himself.\nPortions of Rivan's journals were excavated and recovered from his Almas fortress during the Clone Wars, and presented to the Jedi Council on Coruscant for study.\nRivan was well known for the power to form the Sith battlelords. Rivan has shown in his fortress that he studied and applied himself to mastering the dark side. Rivan's most noticeable creation was the kaluthin grass to modify the planet Almas' atmosphere in order to make it breathable.\nRivan is chronologically the last known Darth before Darth Bane. Initially, Bane was believed to be the inventor of the title, as at that point, no earlier Sith Lords used it. It was later revealed that the title \"Darth\" originates in the Mandalorian Wars, or even earlier. Darth Rivan predates Bane, author of the Rule of Two. However, one of the traps in Darth Rivan's fortress, as shown in A Mon Alone, is based on the Sith adherence to the Rule of Two.\nRivan has never actually been featured or mentioned in a story. So far, both he and the Almas fortress have only been mentioned in source books and role playing scenarios.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Revan/Legends",
  "/wiki/Dix_Rivan",
  "/wiki/Almas",
  "/wiki/1000_BBY",
  "/wiki/Ruusan/Legends",
  "/wiki/Zelosian",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Sith",
  "/wiki/Darsin",
  "/wiki/Valin_Draco",
  "/wiki/Darth_Rivan%27s_holocron",
  "/wiki/Sith_Lord/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Cularin_system",
  "/wiki/Planet/Legends",
  "/wiki/Almas_Sith_fortress",
  "/wiki/Sith_battlelord",
  "/wiki/Darksider",
  "/wiki/Force_bond",
  "/wiki/Homeworld/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Mandalorian_iron",
  "/wiki/Sith_(language)",
  "/wiki/Darkstaff",
  "/wiki/Kaluthin",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/1250_BBY",
  "/wiki/Battle_of_Almas",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Force_storm_(wormhole)",
  "/wiki/Army_of_Light/Legends",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/Rule_of_Two/Legends",
  "/wiki/A_Mon_Alone",
  "/wiki/The_Kaluthin_Are_Always_Greener",
  "/wiki/Recursion",
  "/wiki/Wizards.com",
  "/wiki/Echoes_of_the_Jedi",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/The_Sith_Fortress",
  "/wiki/Dragon_of_the_Desert",
  "/wiki/Almas_(article)",
  "/wiki/The_Darkstaff",
  "/wiki/Tramsig%27s_Plan",
  "/wiki/Vader:_The_Ultimate_Guide",
  "/wiki/Sith_Battlelords_(article)",
  "/wiki/The_Eye_(roleplaying_adventure)",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Star_Wars_Annual_2009",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/Dark_Underlord",
  "/wiki/1750_BBY",
  "/wiki/Belia_Darzu",
  "/wiki/1230_BBY",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_New_Essential_Guide_to_Droids"
 ]
}