{
 "name": "Darth Vengean",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3641 BBY",
      "Dromund Kaas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireDark CouncilSphere of Military Offense",
      "Dark Council",
      "Sphere of Military Offense"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Darth Baras",
      "Draahg"
     ]
    }
   ]
  }
 ],
 "content": "Darth Vengean was a male Human Sith Lord of the Sith Empire; he was the Sith Master of Darth Baras and a member of the Dark Council. He was the Dark Council's military leader and a warmonger seeking to re-ignite war with the Republic and finally exterminate the foe that drove the Sith into exile a millennium earlier. Vengean was openly outraged when the Treaty of Coruscant was signed into law, criticizing all who supported the peace accord and even quietly disparaging the Sith Emperor. His survival of such insolence was a testament to his power. Darth Vengean and Baras spent years carrying out deft political manipulations and quiet assassinations in tandem, both against the Republic and within the Empire.\nDuring the Cold War, Vengean began plotting to reignite the war. He tasked Baras with eliminating General Karastace Gonn, who had been preventing the Empire from conquering the fringe systems. Baras dispatched his latest apprentice, a powerful Sith Warrior, to perform this task. This allowed Vengean to dispatch his flagship to begin his conquest. However, Republic Admiral Monk, revealed to be Baras' spy, was waiting and ambushed the flagship, destroying Vengean's credibility and dissolving the Treaty of Coruscant.\nWhen Plan Zero was completed, Baras recalled the Warrior back to Dromund Kaas to discuss Vengean's downfall. Because of his blunder at Quesh, the Dark Council called for Vengean's head. Baras sent the Warrior into Vengean's sanctum to free Lord Draahg, Vengean's apprentice, who was secretly working for Baras. But Vengean found out before the warrior could rescue Draahg and incarcerated him. After freeing Draahg, the two worked together to break into Vengean's inner sanctum, where the Dark Lord was gathering his strength. Faced with his opponents, Vengean swore to bleed Draahg anew before turning to the Warrior. He reminded the young Sith that Baras wouldn't have gotten to where he was today without the help of his strong enforcer. He called Baras a coward, plotting from the shadows, whereas the Warrior and Vengean himself were people of action. Vengean proceeded to duel with the apprentice of Baras and lost, allowing Baras to ascend to Vengean's seat on the Dark Council.\nDarth Vengean was a Human male with pale skin and orange eyes. Vengean was known as a man of action and a warmonger. He hated those who betrayed him, as he threatened to bleed Draahg and destroy Baras for betraying him.\nDarth Vengean was skilled with his single-bladed Sith lightsaber. Vengean was also powerful in the dark side of the Force and was capable of Force choke and telekinesis.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Darth_Vengean",
  "/wiki/3641_BBY",
  "/wiki/Dromund_Kaas",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Sphere_of_Military_Offense",
  "/wiki/Darth_Baras",
  "/wiki/Draahg",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Tenebrae",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Plan_Zero",
  "/wiki/Karastace_Gonn",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Admiral/Legends",
  "/wiki/Monk_(Human)",
  "/wiki/Spy/Legends",
  "/wiki/Battle_for_Darth_Vengean%27s_flagship",
  "/wiki/Quesh",
  "/wiki/Sith_lightsaber/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Telekinesis/Legends#Force_choke",
  "/wiki/Telekinesis/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Standard_year/Legends",
  "/wiki/3653_BBY",
  "/wiki/3643_BBY",
  "/wiki/Hero_of_Tython",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Battle_of_Ilum",
  "/wiki/3640_BBY",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/3642_BBY"
 ]
}