{
 "name": "Darth Venamis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Prior to 75 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "42 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.73 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Order of the Sith Lords"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Tenebrous",
      "Darth Plagueis"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Naat Lare"
     ]
    }
   ]
  }
 ],
 "content": "Darth Venamis was a prospective Sith Lord of the lineage of Darth Bane. A male Bith, he was the Sith apprentice of the Dark Lord, Darth Tenebrous. Tenebrous trained Venamis in violation of the Rule of Two, since he had another apprentice, Darth Plagueis. Despite Venamis's use of the Sith title, Darth, it was not legitimately bestowed upon him.\nVenamis claimed to have been found by the Bith Dark Lord of the Sith, Darth Tenebrous, and selected as an apprentice unbeknownst to the other Banite Sith trained under Tenebrous' tutelage, the Muun Darth Plagueis. After Plagueis discovered Venamis' existence, the Muun doubted that the latter had been trained as a true Sith, thus seeing the self-bestowed title of \"Darth\" as illegitimate and considered the secret apprentice, who was a Bith himself, to be biologically related to their common master, possibly as an offspring.\nAround the year 67 BBY, Venamis posed as a physician, using fraudulent information regarding place of residence and practice, to free the Nautolan Naat Lare from the Bedlam Institution for the Criminally Demented on Bedlam who had been incarcerated there three years before in 70 BBY. The Bith then tasked his potential apprentice to cull the population of marsh haunts near a Barabel settlement on Abraxin.\nAfter Tenebrous died on Bal'demnic at the hands of Plagueis in 67 BBY, the latter discovered that Venamis kept a list of certain Force-sensitive beings as potential apprentices of his own—other than Lare, they were a Shi'ido changeling who worked as a professional gambler and the Iktotchi prophet of Saleucami, as well as another being that had been previously killed in a barfight, and one other being who had died by that point. However, before Venamis could pursue his own agenda, he moved to fulfill Tenebrous' final command to eliminate Plagueis, leaving Lare on Abraxin.\nTraveling to Sojourn—a moon owned by Plagueis and maintained as a personal retreat—Venamis was bested in a duel and forced to ingest a coma-bloom, a poisonous species of flora, putting him into a coma. As part of his experiments with midi-chlorians over the following decades, Plagueis and his droid 11-4D kept the comatose Venamis alive to manipulate and study. Around the year 42 BBY, Venamis was eventually allowed to die by Plagueis, his usefulness finally fulfilled. Afterwards, he was resurrected and killed again and again in the presence of 11-4D, as well as Plagueis's apprentice, Darth Sidious, until Venamis' organs finally ceased to function and Plagueis finally allowed the Bith to die for the final time.\nIn his duel with Plagueis, Darth Venamis demonstrated a superior offensive skill in lightsaber combat taught to him by his master, Darth Tenebrous. His attacks were so powerful that Plagueis had to change tactics and defeat Venamis with his use of the power of the dark side of the Force.\nVenamis could also generate Force lightning, as Plagueis sensed him about to do so, before he crossed his blades to Venamis's neck, and caused him to \"yield.\" Among his talents, was also the difficult ability to levitate himself, doing so when Plagueis used the Force to break the greel branch he was perching on, and suspended himself in midair and continued the duel using that ability.\nDarth Venamis first appeared in the 2012 novel Darth Plagueis, written by James Luceno. The novel tells the backstory of Darth Plagueis. It revealed that Venamis was Darth Tenebrous' secret apprentice.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/75_BBY",
  "/wiki/42_BBY/Legends",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Darth_Tenebrous/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Naat_Lare",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Rule_of_Two/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Muun/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/67_BBY",
  "/wiki/Doctor/Legends",
  "/wiki/Nautolan/Legends",
  "/wiki/Bedlam_Institution_for_the_Criminally_Demented",
  "/wiki/Bedlam/Legends",
  "/wiki/70_BBY",
  "/wiki/Marsh_haunt",
  "/wiki/Barabel/Legends",
  "/wiki/Abraxin",
  "/wiki/Bal%27demnic",
  "/wiki/Shi%27ido",
  "/wiki/Changeling/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Iktotchi/Legends",
  "/wiki/Unidentified_Iktotchi_prophet",
  "/wiki/Saleucami/Legends",
  "/wiki/Sojourn_(moon)",
  "/wiki/Moon/Legends",
  "/wiki/Contest_on_Sojourn",
  "/wiki/Coma-bloom",
  "/wiki/Midi-chlorian/Legends",
  "/wiki/11-4D/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Time/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Telekinesis/Legends#Force_Flight_2",
  "/wiki/Greel_tree",
  "/wiki/2012",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/James_Luceno",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/Maul:_Lockdown",
  "/wiki/Maul:_Lockdown_(audiobook)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Retcon",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}