{
 "name": "Darth Malora",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue",
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Dark Council",
      "Sphere of Scientific Advancement",
      "Ossus Assault Battalion",
      "Dark Council",
      "Sphere of Scientific Advancement",
      "Ossus Assault Battalion"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Renning"
     ]
    }
   ]
  }
 ],
 "content": "Darth Malora was a female Human Dark Lord of the Sith of the reconstituted Sith Empire who originally served as an apprentice to Lord Renning during the Cold War between the Sith Empire and the Galactic Republic.\nDuring her time on Korriban, Malora felt that her Master's experiments were a waste of time and resources and that he had deluded the Dark Council into believing that his experiments were advancing Sith Knowledge. This prompted her to sabotage one of Renning's experiments involving a mutated tuk'ata brain. However, the two acolytes that she tried to recruit for the task decided to inform Renning of her treachery, who proceeded to torture her with Force lightning as punishment in addition to removing her as his apprentice. Malora outlived her master, who perished during the Korriban Incursion.\nYears later, Malora would become a Dark Lord of the Sith in her own right. Going by the name Darth Malora, she was chosen to become a member of the Empire's Dark Council. Her expertise was as Head of Scientific Advancement, replacing Technology and Biotic Science.\nMalora commanded the Imperial forces during the Invasion of Ossus, using her expertise as a scientist to genetically modify Geonosians and use them against the Jedi in battle. However, Darth Malgus unexpectedly appeared on the planet and took command of the entire invasion force. Malora attempted to attack Malgus, but failed. She was thereafter removed from the Dark Council. She was replaced on the Dark Council by Darth Savik.\nIn the Korriban side mission, \"Dark Science,\" the player had the option of either giving the tuk'ata brain to Malora and earning light-side points, or giving it to Renning and informing him of Malora's treachery, earning dark-side points. This will impact the player's interactions with Malora during the Jedi Under Siege. Players, either Republic or Imperial, can recruit Malora to the Eternal Alliance or outright reject her.\nAlternatively Republic players or Imperial players who side with the Republic in Jedi Under Siege can either imprison or execute Malora.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Malora_Pradon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dark_Council",
  "/wiki/Sphere_of_Scientific_Advancement",
  "/wiki/Ossus_Assault_Battalion",
  "/wiki/Renning",
  "/wiki/Moff/Legends",
  "/wiki/Valion_Pyron",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Korriban",
  "/wiki/Sith_Master/Legends",
  "/wiki/Tuk%27ata/Legends",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Darth_Nox",
  "/wiki/Force_lightning/Legends",
  "/wiki/Korriban_Incursion",
  "/wiki/3628_BBY",
  "/wiki/Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Sphere_of_Technology",
  "/wiki/Sphere_of_Biotic_Science",
  "/wiki/Invasion_of_Ossus",
  "/wiki/Geonosian/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Darth_Malgus",
  "/wiki/Ossus/Legends",
  "/wiki/Darth_Savik",
  "/wiki/Eternal_Alliance",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}