{
 "name": "Darth Bandon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3956 BBY",
      "in Hrakert Station on Manaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Darth Revan's Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "A Jedi",
      "Darth Malak"
     ]
    }
   ]
  }
 ],
 "content": "Darth Bandon was a Human male Jedi Padawan who defected to the Sith Empire during the Jedi Civil War, a conflict initiated by the Sith Lords Darth Revan and Darth Malak. Sometime after Malak betrayed his Master, Revan, during an ambush by the Jedi and Republic forces attempting to capture them, Bandon became the new Dark Lord's first Shadow Hand, elevating him to second-in-command of the Sith Empire. When the Sith attacked the Republic warship Endar Spire above the planet Taris, Bandon boarded the ship along with the Sith troopers and Dark Jedi under his command and tried to capture the Jedi Knight Bastila Shan. He killed the Republic ensign Trask Ulgo, who sacrificed himself to save the former Sith Lord Revan, who had been mentally reprogrammed to be loyal to the Republic and to serve as a common soldier by the Jedi Council.\nShortly after the destruction of Taris, the bounty hunter Calo Nord was hired by Malak to follow in pursuit of Shan, who escaped the bombardment with the help of Revan and his companions. After Nord was slain by Revan, Malak dispatched Bandon to find and capture the Jedi. Bandon located Revan in Manaan's underwater kolto harvesting base known as Hrakert Station, on the Selkath homeworld Manaan. The Sith apprentice confronted Revan and his allies after they found a fourth Star Map that would give them the location of the Star Forge—the ancient Rakatan space station under Malak's control. Bandon underestimated the former Dark Lord and his companions, assuming that they would be no match for him. This proved to be his downfall, as Revan and his team vanquished Malak's Shadow Hand, along with the two Dark Jedi accompanying him. After his death, Bandon's head was severed from his body and preserved by the Sith. Three hundred years later, it had eventually been put on display in the House Alde Royal Museum on Alderaan.\nThe Human male who would be known as Darth Bandon was a Jedi Padawan, though he never fully accepted the teachings of the Jedi Code. Even though the Force flowed through him, Bandon's powerful emotions, such as anger and hatred, raged within and fueled his strength. His Jedi Master tried to curb these strong emotions, but the brash Padawan chafed under his Master's guidance.\nIn the year 3959 BBY, the former Jedi Knights Revan and Malak, the heroes of the Mandalorian Wars, found the ancient space station known as the Star Forge—a relic of the Rakatan Infinite Empire that had ruled the galaxy nearly 20,000 years before—and named themselves the new Dark Lords of the Sith. Revan and Malak declared war on the Jedi Council and the Galactic Republic, initiating the Jedi Civil War. Bandon rejected his old Master and the Jedi Order, fleeing to the revitalized academy on the ancient Sith homeworld of Korriban.\nAs a student in the new Korriban academy, Bandon fully embraced the teachings of the dark side and the Sith Code. This—along with Bandon's strength with the Force, his natural cruelty, and his utter ruthlessness in his quest for power—soon set Bandon apart from his fellow students and brought the attention of Darth Malak, Revan's Sith apprentice. Bandon eventually won Malak's admiration. Two years into the Jedi Civil War, the Jedi and Republic forces set a trap for Revan and Malak in an attempt to capture both Sith Lords. During the battle, Malak betrayed his Sith Master by ordering his flagship Leviathan to open fire on Revan's vessel. After Malak thought he successfully eliminated Revan, he seized his former Master's mantle of Dark Lord of the Sith.\nIn the tradition of the Sith Order, Malak sought a single learner among his followers to become his official apprentice, someone that could learn the Sith secrets and use them to effectively destroy the Jedi and the Republic. Malak took the promising Bandon as his Shadow Hand, which made him second only to his Master in the Sith Empire. The Dark Lord taught much of his knowledge of the Sith to Bandon. Malak was not disappointed with his choice of taking Bandon as his apprentice, because Bandon killed many Jedi during the war. In a short time, rumors began to surface that Bandon would challenge Malak for the right to rule the Sith; Bandon eventually began to set his sights on his Sith Master's throne.\nIn the year 3956 BBY, Darth Malak was searching for a Jedi Knight named Bastila Shan, fearing her strength in Battle meditation, a Force power that boosted the Republic forces' morale during battle while sapping the Sith's will to fight. When Malak learned of Shan's location aboard the Republic warship Endar Spire, he sent a Sith battle fleet to ambush the ship. Above the planet Taris, Bandon led the boarding party that stormed the Endar Spire, in an attempt to capture or kill Shan. An amnesiac Revan—who had been rescued by Shan after Malak betrayed him and later mind-wiped by the Jedi Council—was placed under Shan's command as a common Republic soldier. Bandon confronted Revan and the Republic ensign Trask Ulgo during their attempt to reach the ship's escape pods, also hoping to ensure that Shan fled the ship alive.\nBandon was given a chance to kill both Republic soldiers. However, before he could do so, Ulgo made a desperate charge, sacrificing himself so that Revan could get to the escape pods and flee the ship with the Republic commander Carth Onasi. After Bandon killed Ulgo, he departed the Endar Spire before Sith interceptors destroyed the ship. Shan had successfully fled the ship aboard one of the escape pods and crash-landed on Taris. Revan and Onasi also crashed onto the Tarisian surface. In response, Malak captured Taris and ordered a blockade of the planet so that the Sith could search for Bastila Shan.\nAfter Malak ordered the destruction of Taris in an attempt to kill Bastila Shan, Malak was informed by the bounty hunter Calo Nord, who survived Taris' destruction, that Shan had successfully escaped Taris; although, Nord was unaware that it was Revan, Malak's former Master, who assisted in her escape. Malak hired the bounty hunter to find and capture Shan, however, Nord was killed by Revan during the Jedi's search for the Star Forge. The Sith Admiral Saul Karath informed Malak of Nord's failure on Malak's flagship Leviathan, and asked if he should hire another bounty hunter to send after Shan. The Dark Lord determined, however, that no mere bounty hunter could stand against a Jedi. Bandon was summoned to the ship's bridge immediately; when Bandon arrived on the bridge, he killed a Sith trooper that walked in his way. Malak sent Bandon after Revan, Shan, and their companions, and Malak ordered his apprentice to bring Shan to him alive, if possible.\nBandon located Revan at the Republic's kolto harvesting base known as Hrakert Station, which was named for the Hrakert Rift in which the base was located, on the Selkath homeworld Manaan. The Shadow Hand confronted Revan and his allies in the station after Revan located a fourth Rakatan Star Map, which was necessary to learn the location the Star Forge. Accompanied by two Dark Jedi, he presumed that Revan and his team would be no match for him. He expressed his fear that someone else had killed Revan, thereby depriving him the \"pleasure\" of slaying Revan. When Bandon was asked by Revan how he managed to make it to Hrakert Station, the Sith Lord replied he acquired an underwater vessel and used the same route that Darth Revan and Darth Malak used underwater, leading him to the station. Bandon also told Revan that he was no match for the Sith apprentice, although Revan had defeated Calo Nord, whom Bandon thought was pathetic. Revan recognized Bandon, stating that he would pay for killing Trask Ulgo. The Sith Lord told Revan that his words meant nothing to him, unless he wished to beg for his life, and added that he would try to make Revan's death both quick and painful. Bandon and his Dark Jedi then engaged Revan and his companions in a duel. Despite Bandon's skill, he and the two Dark Jedi assisting him were killed by Revan and his allies.\nAfter Bandon fell in battle and Revan's party left the scene, his remains were retrieved by a group of Sith acolytes who preserved his head through Sith alchemy. Some time after Malak's death and the Sith Empire's collapse, the acolytes found themselves lacking leadership, and began to believe they could use the preserved head to communicate with Bandon's spirit. The acolytes eventually embarked on a misguided attempt to reattach the head to a new body, attracting the attention of the Jedi, who put an end to this cult. However, no trace of the head was found.\nSomehow the head ended up in the possession of Risha Drayen during the Cold War, and she used it during her quest to locate the treasure of her father, Nok Drayen. Peema Ahuff, curator of the House Alde Royal Museum, wished to acquire the head and place it on display to honor Alderaanian hero Trask Ulgo, who died in combat against the Sith Lord. Ahuff was willing to trade a hyperdrive engine for it, which Risha and her smuggler cohort needed, so the smuggler went to make the trade and learned that the gangster Skavak had traded a fake head and absconded with the hyperdrive. The smuggler pursued Skavak's agents and retrieved the hyperdrive, then gave the real head to the museum, where it was put on display. At some point after Bandon's death, his double-bladed lightsaber also came into the possession of the resurgent Sith Empire, and was available for purchase by a well-trained Force-sensitive agent.\nBandon's role in the Jedi Civil War was remembered for millennia to come, though not always with perfect accuracy. According to an entry on the Jedi Civil War from the Twi'lek Jedi Deesra Luur Jada's holocron, when Revan and Bastila Shan were captured by the Leviathan, Bandon was killed after Revan managed to escape. In 40 ABY, the investigatory agent Gannod Chant, who worked for the Council on Security and Intelligence, translated a manuscript written by suspected Sith sympathizer Ingo Wavlud. Wavlud's manuscript, however, stated that Bandon died in the year 3951 BBY along with Darth Sion and Darth Nihilus.\nDuring his time as a Sith Lord, the Human male known as Darth Bandon was known for his ruthless behavior. He was willing to take the lives of people and damage equipment to enforce his position, even for a perceived transgression as minor as walking in his way. He was also focused on the destruction of the Republic as well as the slaughter and extinction of the Jedi Order. Bandon thought that his skills were more than adequate to defeat Revan and his companions, telling the former Dark Lord that he was no match for him.\nSome in the Sith hierarchy felt that Bandon would eventually rise to challenge Malak for his mantle of Dark Lord, because of the Sith belief that the strongest must rule; and, it was also believed, that when the apprentice surpassed in ability the Master, the Master must fall. As time went by, Bandon grew arrogant, and he began plotting to overthrow Malak.\nDarth Bandon was light-skinned with dark brown eyes. The Sith Lord also had a bald head in addition to a brown goatee at the time of his death.\nDarth Bandon spoke and comprehended Basic and Sith. He was proficient in the use of his double-bladed lightsaber, killing many of his former Jedi brethren. He also displayed his proficiency in using a single lightsaber when he dueled the Cathar Jedi Juhani. Before Bandon fought Revan, he had yet to meet his equal in combat.\nBecause of his strength in the Force, Bandon was capable of using many Force powers. He could use the Force to push his opponents to the ground and could use it to alter the air currents around his opponent, turning it into a maelstrom. This swirling vortex of Force energy would lift an opponent into the air, spin them around, and completely immobilize them. Bandon was also able to use the Force to render himself virtually invulnerable to most offensive Force powers for a limited time, demonstrating this against Revan. Bandon's strength with the dark side of the Force enabled him to use dark-sided powers such as Force lightning, and he also used the dark side to tap into his rage and direct it against his opponents. He could use the Force to instill fear in his opponents, driving them temporarily insane. Bandon was capable of using the dark side to drain his enemies' life-forces, and to strangle his opponents. He could also use it to debilitate his victims, having it work as a fast-acting toxin.\nAfter Bandon joined the Sith ranks, he constructed a saberstaff containing a red crystal. His lightsaber resembled the one used by the Sith Lord Exar Kun, who initiated the Great Sith War forty years before the end of the Jedi Civil War. Bandon also wore a customized set of light fiber armor which he fitted to his robes.\nDarth Bandon wielded a double-bladed lightsaber with a red blade, and wore black torso armor over a set of dark blue clothing.\nDarth Bandon was created by the developers at BioWare as a villain for the 2003 Xbox and PC video game Star Wars: Knights of the Old Republic, where he is voiced by Neil Kaplan. Bandon's name was derived from the word \"abandon.\" In the article \"The 100 Greatest Things About Star Wars... Ever!\", which was published in Star Wars Insider 100, Bandon came in the twenty-second place, beating his Sith Master Darth Malak, who came in at twenty-third place. A picture of Darth Bandon in the Knights of the Old Republic Campaign Guide depicts him dueling the female Cathar Jedi Juhani. When Abel G. Peña, who was one of the authors of the campaign guide, was asked on his official thread on the StarWars.com Message Boards whether or not Juhani was present when Darth Bandon confronted Revan, Peña stated that it was \"up in the air for the moment\". A miniature figure of the Jedi Academy wave of Star Wars Miniatures resembles Darth Bandon, although the figure, released on June 30, 2009, was simply named \"Sith Apprentice.\" Bandon received an entry in The Complete Star Wars Encyclopedia.\nDarth Bandon is referred to as a Sith Lord in the section detailing the Sith Order in the Knights of the Old Republic Campaign Guide. However, both his entries in the campaign guide and the Databank refer to him as a Sith apprentice. The guide Jedi vs. Sith: The Essential Guide to the Force states that Revan killed Darth Bandon after escaping the Leviathan. However, Bandon was defeated by Revan after he found the fourth Star Map, shortly before Revan and the crew of the Ebon Hawk were captured by the Leviathan. The guide also states that Bandon died in the year 3951 BBY, along with Darth Traya, Darth Sion, and Darth Nihilus. However, Bandon was killed by Revan five years before in 3956 BBY.\nThe planet on which Revan battles Bandon is determined by the order in which the Star Maps, which lead to the location of the Star Forge, are obtained by the player. Although canonically appearing on Manaan, Bandon appears on the planet where the fourth Star Map of the journey is found. If the player has already found three Star Maps, and for any reason returns to the site of one of the previous ones, Bandon will be confronted. Bandon is accompanied by two hooded Dark Jedi on Manaan or the desert world Tatooine. If Bandon is encountered on the Wookiee homeworld of Kashyyyk, he is accompanied by two Dark Jedi wearing armor. On Korriban, Bandon is accompanied by two students from the Sith Academy, the place where he was trained.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/3956_BBY",
  "/wiki/Hrakert_Station",
  "/wiki/Manaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Darth_Bandon%27s_Jedi_Master",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Sith_Master/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Capture_of_Darth_Revan",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Shadow_Hand",
  "/wiki/Sith/Legends",
  "/wiki/Attack_on_the_Endar_Spire",
  "/wiki/Endar_Spire",
  "/wiki/Planet/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Sith_trooper_(Sith_Empire)",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Death/Legends",
  "/wiki/Ensign/Legends",
  "/wiki/Trask_Ulgo",
  "/wiki/Soldier/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Destruction_of_Taris",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Calo_Nord",
  "/wiki/Rescue_of_Bastila_Shan",
  "/wiki/Ambush_on_Tatooine_(Jedi_Civil_War)",
  "/wiki/Kolto/Legends",
  "/wiki/Selkath/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Star_Map",
  "/wiki/Star_Forge",
  "/wiki/Rakata/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Duel_in_Hrakert_Station",
  "/wiki/Royal_Museum_of_Alderaan",
  "/wiki/Alderaan/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/3959_BBY",
  "/wiki/Mandalorian_Wars",
  "/wiki/Infinite_Empire",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Korriban",
  "/wiki/Sith_academy",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Code_of_the_Sith/Legends",
  "/wiki/3957_BBY",
  "/wiki/Flagship/Legends",
  "/wiki/Leviathan_(Interdictor-class_cruiser)",
  "/wiki/Darth_Revan%27s_flagship",
  "/wiki/Sith_Order",
  "/wiki/Time/Legends",
  "/wiki/Battle_meditation",
  "/wiki/Force_power/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Carth_Onasi",
  "/wiki/Sith_fighter",
  "/wiki/Capture_of_Taris",
  "/wiki/Blockade/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Saul_Karath",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic#Alternatives_in_gameplay",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Hrakert_Rift",
  "/wiki/Submersible",
  "/wiki/File:WhyCantSithJustCollectStamps-TOR.ogg",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Risha_Drayen",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Nok_Drayen",
  "/wiki/Peema_Ahuff",
  "/wiki/House_Alde",
  "/wiki/Alderaanian/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Voidhound",
  "/wiki/Skavak/Legends",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Deesra_Luur_Jada",
  "/wiki/Holocron/Legends",
  "/wiki/Skirmish_aboard_the_Leviathan",
  "/wiki/40_ABY",
  "/wiki/Gannod_Chant",
  "/wiki/Council_on_Security_and_Intelligence",
  "/wiki/Wavlud_Manuscript",
  "/wiki/Ingo_Wavlud",
  "/wiki/3951_BBY",
  "/wiki/Darth_Sion",
  "/wiki/Darth_Nihilus",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Sith_(language)",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Cathar/Legends",
  "/wiki/Juhani",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_resistance",
  "/wiki/Force_lightning/Legends",
  "/wiki/Force_rage",
  "/wiki/Mind_trick/Legends",
  "/wiki/Force_drain/Legends",
  "/wiki/Force_Slow",
  "/wiki/Lightsaber_crystal",
  "/wiki/Lightsaber/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/3996_BBY",
  "/wiki/Darth_Bandon%27s_fiber_armor",
  "/wiki/Clothing/Legends",
  "/wiki/BioWare",
  "/wiki/2003",
  "/wiki/Xbox",
  "/wiki/Personal_computer",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Neil_Kaplan",
  "/wiki/The_100_Greatest_Things_About_Star_Wars..._Ever!",
  "/wiki/Star_Wars_Insider_100",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Jedi_Academy_(Star_Wars_Miniatures)",
  "/wiki/Star_Wars_Miniatures",
  "/wiki/June_30",
  "/wiki/2009",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Ebon_Hawk",
  "/wiki/Tatooine/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Category:Images_of_Darth_Bandon",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Chronicles_of_the_Old_Republic",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Roleplaying_Game_Saga_Edition_Core_Rulebook",
  "/wiki/Star_Wars_Insider",
  "/wiki/Wizards.com",
  "/wiki/Fringe_Stat_Pack",
  "/wiki/Heritage_of_the_Sith",
  "/wiki/Star_Wars_Insider_88",
  "/wiki/File:Bandonjuhani.jpg",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_2",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Leland_Chee",
  "/wiki/StarWars.com",
  "/wiki/May_9"
 ]
}