{
 "name": "Dasariah_Kothos",
 "display_name": "Dasariah Kothos",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "14 ABY",
      "Vjun"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Disciples of Ragnos",
      "Imperial Remnant"
     ]
    }
   ]
  }
 ],
 "content": "Dasariah Kothos was a male Human Dark Jedi who was one of the high-ranking cult members of the Disciples of Ragnos.\nAlong with his twin brother, Vil, he was known as one of the \"Kothos Twins\" or \"Reborn Twins.\" The two twins became legendary symbols for the cult, and were powerful opponents for any Jedi. Unlike most of the New Reborn members of Tavion Axmis's cult, Dasariah did not use lightsabers, but relied instead on his tremendous abilities in the dark side of the Force and Force-enhanced acrobatics.\nBoth of the twins were considered masters of the dark side of the force, and their dark side abilities probably even surpassed those of Tavion, who concentrated more on lightsaber combat.\nDasariah Kothos wore an orange battle suit and had an almost inhumanly deep voice which was enough to scare the wits out of many sentient beings.\nThe twins accompanied Tavion Axmis to the Massassi Temple on Yavin 4 where she syphoned the Force energy from the temple with the Scepter of Ragnos. They later assisted Rosh Penin when he dueled Jaden Korr in the Bast Castle on Vjun, empowering Penin through the Force. Korr realized that if he were to have any chance of beating Penin, he would have to defeat the twins first, while warding off Penin's attacks. The twins used all their power to keep Korr from harming Rosh.\nWhile powerful in the Force, the twins were eventually both slain by Korr who afterward defeated Penin. Despite their imposing skills, the dark side alone was not powerful enough to beat Jaden Korr and the twins ended up dead on the cold floor of Bast Castle, being consumed by the dark side of the Force.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/14_ABY/Legends",
  "/wiki/Vjun/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Disciples_of_Ragnos",
  "/wiki/Imperial_Remnant",
  "/wiki/Jaden_Korr",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Vil_Kothos",
  "/wiki/Jedi/Legends",
  "/wiki/New_Reborn",
  "/wiki/Tavion_Axmis",
  "/wiki/Lightsaber/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Yavin_4_Incursion",
  "/wiki/Great_Temple/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Scepter_of_Ragnos",
  "/wiki/Rosh_Penin",
  "/wiki/Bast_Castle",
  "/wiki/Star_Wars:_Jedi_Knight:_Jedi_Academy",
  "/wiki/Star_Wars:_Jedi_Knight:_Jedi_Academy:_Prima%27s_Official_Strategy_Guide"
 ]
}