{
 "name": "Dashan Joyl",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Dashan Joyl was a Duros male who was the grandson of the infamous Usan Joyl, a con artist and an identity forger. By 44 ABY, both Joyl and his grandfather were captured and held prisoner by corrupt Galactic Alliance General Stavin Thaal in the lower levels of Vandor-3's Caridan animal exhibit, where Thaal conducted his criminal activities across the galaxy. Even as they were imprisoned, Joyl's grandfather was used for his identity-forging talents so that Thaal could retire from the Galactic Alliance Defense Force with the new identity of Thadley Biolan.\nWhen Wraith Squadron began their investigation into Thaal's guilt regarding his involvement with the Lecersen Conspiracy, the Joyls were freed by Wraiths Myri Antilles and Trey Courser. When both Bhindi Drayson and Sharr Latt's units of Wraith Squadron were discovered throughout the animal exhibit, the Joyls joined them in escaping and holing up in the fortress at Mount Lyss. They spent several days there, and during this time, Joyl's grandfather told Wraith Squadron about Thaal's transformation into Thadley Biolan, something that helped them along and conclude their mission later on. The Joyls later joined Wraith Squadron in escaping Vandor-3 by shuttle escorted by the legendary Wedge Antilles and Tycho Celchu, at which point both Duros had gained their freedom.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Usan_Joyl",
  "/wiki/44_ABY",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/General/Legends",
  "/wiki/Stavin_Thaal",
  "/wiki/Vandor-3",
  "/wiki/Caridan",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Alliance_Defense_Force",
  "/wiki/Thadley_Biolan",
  "/wiki/Wraith_Squadron",
  "/wiki/Lecersen_Conspiracy",
  "/wiki/Myri_Antilles",
  "/wiki/Trey_Courser",
  "/wiki/Bhindi_Drayson",
  "/wiki/Sharr_Latt",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)"
 ]
}