{
 "name": "Dasita Lyros",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Commission for the Preservation of the New Order",
      "Commission for the Preservation of the New Order"
     ]
    }
   ]
  }
 ],
 "content": "Dasita Lyros was a human female fashion-holographer who became art director of the Galactic Empire's Commission for the Preservation of the New Order. She found success in glorifying the Imperial Military in her work despite never having set foot on a battlefield. To produce propaganda posters such as Expose, Pursue, Destroy she used carefully posed models in clean environments, far from the chaotic battlefront of the Galactic Civil War. Such models were supposedly picked from citizens who reported suspicious agitators in their communities, but were in fact only chosen from those who already shared a good relationship with the commission. She herself was depicted in a COMPNOR Recruitment poster alongside Captain Edmos Khurgee, with whom she was rumored to be romantically involved, although ultimately this was dismissed.\nDasita Lyros was introduced in the 2016 reference book Star Wars Propaganda: A History of Persuasive Art in the Galaxy, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order",
  "/wiki/Hologram",
  "/wiki/Art_director",
  "/wiki/Imperial_Military",
  "/wiki/Propaganda",
  "/wiki/Painting",
  "/wiki/Expose,_Pursue,_Destroy",
  "/wiki/Galactic_Civil_War",
  "/wiki/COMPNOR_Recruitment",
  "/wiki/Captain",
  "/wiki/Edmos_Khurgee",
  "/wiki/2016",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Pablo_Hidalgo"
 ]
}