{
 "name": "Dathka Graush",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Korriban"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 6950 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Cronal"
     ]
    }
   ]
  }
 ],
 "content": "Dathka Graush was a male Sith sorcerer who lived on the planet Korriban more than seven thousand years before the Battle of Yavin. Brutality and trepidation were the tools Graush used to defeat his enemies during one of Korriban's recurrent civil wars, the end of which saw him acclaimed king and overlord of his species. In the war's wake, Graush made use of both Sith magic and alchemy to perfect the Tsaiwinokka Hoyakut spell, through which he resurrected an army of reanimated corpses bound to him through the dark side of the Force. He also had his heart removed and replaced with a magical crystal that was imbued with the power of the Force's malevolent side. Graush's dynasty ultimately culminated with his death at the hands of assassins, and the Sith King was interred within Korriban's Valley of Golg.\nSometime between the destruction of the first Death Star and the Battle of Endor, the spirit of the long-dead Sith King was disturbed after millennia of slumber. Cronal, a dark side prophet formerly in the service of his Imperial Majesty Palpatine, forcefully sundered Graush's ghost from his Korriban grave and compelled the Sith King to reveal the most potent of his alchemical secrets. The knowledge Graush imparted to Cronal assisted the latter in the creation and manipulation of the electromagnetically-charged meltmassif crystals.\nA pure-blooded male Sith from the planet Korriban, Dathka Graush lived in the especially tumultuous era between the Subterra and Manderon periods of galactic history. Graush's was a life thrust into the commonplace violence of the indigenous Sith as civilization on Korriban degenerated into a primitive state of perpetual war in the millennia following the death of Sith King Adas nearly twenty thousand years prior. With none to justly assume the mantle, many Sith declared themselves Sith'ari, or overlord in the native tongue, as tradition had dictated since Adas's passing. Such was the civil strife that Sith society as a whole was forced to relocate to the nearby world of Ziost, while those who remained on Korriban became religious cultists. Regardless of the controvertible affirmations of authority made by various Sith who felt entitled to the throne, commonality on Korriban remained utterly fragmented as individual Sith vied for worldwide domination.\nIt was during that time when Dathka Graush earned the reputation of a fierce conqueror. In 7000 BBY, he and his forces championed a civil war that resulted in the destruction of the majority of Korriban's population centers. Graush emerged victorious and was crowned king of the Sith. At the height of his power, Graush built a fortress in the Naos Asteroid Belt, where he would store powerful artifacts. During his reign, Graush expanded his reach across Korriban's territories until two-thirds of the planet submitted to his rule. Graush dominated his kinsfolk in a manner that was considered extremely brutal even by Sith standards, and his endeavors of bloodshed and terror saw countless corpses strewn across the battlefield in his wake. Graush took interest in the abundance of cadaverous material, and with ancient Sith sorcery and alchemy as his means, he performed the Tsaiwinokka Hoyakut, translated from ancient Sith as the \"Reanimated Dead\" spell, whereby he resurrected an army of Korriban zombies. The entities were undead humanoids, whose plight was spread to other sentient beings through their bite.\nIn an effort to sustain himself through unnatural means, Graush had fashioned for himself a crystalline jewel filled with dark side spirits that had been collected over the millennia. Using both Sith magic and the most advanced technology of the day, Graush replaced his natural-born heart with the crystal. Despite the belief of some that the crystal made Graush invincible, he fell victim to assassins after only fifty years of rule. With his death, the spirits of his reanimated zombie army were wrenched from their bodies and made to join those already trapped within Graush's crystal heart.\nAn elaborate tomb was constructed for Dathka Graush in Korriban's Valley of Golg. Located near Korriban's equator, the millennia-old tomb metropolis at Golg was one of the many \"Valleys of the Sith Lords\" scattered across the planet. Graush's and the other tombs that were erected in the Valley were lined with stonework carvings and runes of protective Sith magic. The late King's personal crypt was in a part of the Valley utterly devoid of sunlight, within a large cavernous gallery, wherein the shrines and respective pictograms of fourteen Sith sorcerers were kept. The largest shrine of all contained Graush's sarcophagus, where his actual remains had been entombed with a sword, an amulet, his holocron, and his crystalline heart.\nIn 3963 BBY, a clandestine subsect of supposed lightsiders known as the Jedi Covenant undertook the task of collecting and quarantining all known Sith artifacts, with hopes of both preventing the return of the Sith, as well as the spread of dark side influence through their treasures. Among them was the Helm of Dathka Graush, a battle-headdress thought to have once been worn by the ancient Sith King. Graush's device considerably amplified the Force abilities of its wearer, and was also believed to strengthen the sword of the ancient Sith Lord Ieldis. The power of Graush's helm was also such that, when removed from the protective nullification resin, its residual energies caused significant atmospheric disturbances within a six-kilometer radius of the planet Odryn's Sanctum of the Exalted.\nAround 3643 BBY, in the final days of the Cold War, an archeological crew travelled to the Naos Asteroid Belt and rediscovered the millennia-old fortress of Dathka Graush. The lost vaults, which had remained untrespassed for centuries, were opened, and a series of precious artifact fragments were salvaged.\nExactly six months before the destruction of the first Death Star, pirate captain Naz Felyood crashed his ship, the Jynni's Virtue, on Korriban after it had been fired upon by cloaked Imperial ships and a subsequent hyperdrive malfunction. The Virtue landed two kilometers north of the Valley of Golg, and the crew was forced to stay on Korriban longer than they had originally intended. They hoped that the faint power emanations they had detected from the Valley was enough to revitalize the Virtue, but in actuality the faint energy signatures that had interfered with their electrical systems were the result of the Valley's lingering dark side power. Nevertheless, Felyood entered the Valley himself and found his way into Graush's resting place. The starship captain infiltrated the crypt, singled out Graush's shrine, and planned to raid it first. As he worked to liberate Graush's sarcophagus of its treasures, the long-dead King's spirit appeared and tried to convince Felyood that he had something the pirate wanted before finally possessing him.\nGraush also resurrected his undead army, whose ravenous hunger for living flesh sent them after the Jynni's Virtue's remaining crewmembers. The zombies spread their plight throughout the crew, but in a final act of despair, the uninfected crewmembers committed suicide through the activation of their ship's self-destruct mechanism. The resultant explosion vaporized a large portion of the army that Graush had loosed upon the crew. What remained of Graush's zombies took the crystalline heart from Felyood, and Graush's shade left with it. Felyood, now alone and undying, was compelled by the power of Graush's heart and searched the expanse of Korriban for its master for all eternity.\nIn the period between the Battle of Yavin and the Empire's defeat at Endor, the former Emperor's Hand known as Lord Cronal devoted his life to the study of ancient and forgotten knowledge, such as that of the ancient Sith and other supposed masters of what the Sorcerers of Rhand called the Dark. Following his Darksight visions to numerous places around the galaxy in his quest for ancient Sith lore, Cronal was led to Dathka Graush's spirit in the Valley of Golg. With knowledge he obtained from the Temple of Korman Lao, Cronal captured Graush's spirit and forced the ancient Sith King to relinquish his most arcane alchemical secrets. From Graush's teachings, Cronal constructed his Sunset Crown, a device he used to control the electrochemical crystalline meltmassif substance of the planet Mindor.\nEventually, trusted Jedi researchers of Master Luke Skywalker's Jedi Academy were sent to the Sith homeworld of Korriban and came across Graush's tomb. There they retrieved a set of recordings that had originally belonged to the crew of the Jynni's Virtue, which spoke of the events leading to Graush's awakening years before. A brief written message showing the last known words of Captain Felyood was also found with the tapes. Even though the tapes were dismissed as frauds by some historians and Jedi, enlightenment from them led Jedi researchers to attempt to locate Graush's crystal heart. At a great risk to their own lives, surveyors were sent into Graush's tomb to find the Sith King's heart, but they found nothing despite a thorough survey of his crypt.\nDathka Graush was a pure-blooded member of the Sith species. Sith like Graush typically were known for their glowing yellow eyes, crimson-hued skin, sharp predatory features over their bodies, and Force-sensitivity, especially attuned to the dark side of the Force.\nGraush's fifty-year reign and the acts that ultimately resulted in his rise to power, such as the mass accumulation of corpses and devastation of Korriban's cities, left him remembered as a bloodthirsty conqueror and a tyrant. The acts of terror he committed over the people he ruled were considered cruel even by Sith standards—a species that placed acts of violence, war, sentient sacrifice, and blood consumption on par with peace. Such behavior was dubiously attributed to the absence of his biological heart, after he replaced it with a Force-sensitive crystal.\nWith his personal Sith sword, Dathka Graush proved himself as a reckoning force on the battlefield. His tactics helped him to emerge victorious over his enemies, and those who survived the war of his instigation became his subjects in its aftermath. A powerful Sith magician and alchemist as well, Graush's Force talents and scientific aptitude served him in both the creation of his Korriban zombies and cardiac transplantation procedure. Graush's facility with Sith alchemy was legendary, and he was credited as the pioneer of the \"Reanimated Dead\" spell, Tsaiwinokka Hoyakut. The Sorcerer of Rhand Cronal believed the ancient Sith had little understanding of the Dark and destruction but reasoned that accomplishments like those of Graush's were impressive nonetheless. He concluded that were he to study and pursue Graush's ancient lore himself, he would be able to achieve more through whatever enlightenment he gained. It was through Graush's knowledge that Lord Cronal learned to construct his dark side–oriented devices called Shadow Crowns.\nDathka Graush received his first mention in Korriban: Planet of Lost Souls, a roleplaying supplement written by Cory J. Herndon that was first published online on October 2, 2003 by Wizards of the Coast. Korriban: Planet of Lost Souls erroneously refers to Dathka Graush as a \"pureblooded Sith Dark Lord\" who ruled over two-thirds of Korriban before 7000 BBY, despite later sources, such as Jedi vs. Sith: The Essential Guide to the Force, establishing the consecration of the first Dark Lords of the Sith fifty years after Graush's death. Luke Skywalker and the Shadows of Mindor, a 2008 novel by Matthew Stover, identifies Dathka Graush as a Sith king.\nGraush received a fleeting mention in Knights of the Old Republic 29, wherein his name was misspelled \"Grausch.\" Graush did not receive his own entry in 2008's The Complete Star Wars Encyclopedia, but he was mentioned in the entries for both the Heart of Graush and Korriban zombie. He was also mentioned in the 2009 release of The Essential Atlas, in the entry for Korriban. Grausch was later referenced in the 2012 publication Book of Sith: Secrets from the Dark Side, by Daniel Wallace. The book also included an illustration of the Dark Jedi Exile Ajunta Pall beheading the Sith king Hakagram Graush and Wallace originally intended for Dathka Graush to be the murdered king. However, after realizing that that would not fit with Dathka's previously-established timeline, Wallace introduced Hakagram instead, as a probable descendant of Dathka.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Korriban",
  "/wiki/6950_BBY",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Cronal",
  "/wiki/Sith_sorcerer",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Sith_King",
  "/wiki/Sith%27ari",
  "/wiki/Sith_magic",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Tsaiwinokka_Hoyakut",
  "/wiki/Army/Legends",
  "/wiki/Korriban_zombie",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Heart/Legends",
  "/wiki/Heart_of_Graush",
  "/wiki/The_Force/Legends",
  "/wiki/Death/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Dathka_Graush%27s_tomb",
  "/wiki/Valley_of_Golg",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Force_ghost",
  "/wiki/Prophets_of_the_Dark_Side",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Meltmassif",
  "/wiki/Crystal/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Subterra_Period",
  "/wiki/Manderon_Period",
  "/wiki/Timeline_of_galactic_history/Legends",
  "/wiki/Korriban_civil_war",
  "/wiki/Adas",
  "/wiki/27,700_BBY",
  "/wiki/Sith_Overlord",
  "/wiki/Sith_(language)",
  "/wiki/Ziost/Legends",
  "/wiki/Time/Legends",
  "/wiki/7000_BBY",
  "/wiki/Korriban_civil_war_(Dathka_Graush)",
  "/wiki/Dathka_Graush%27s_fortress",
  "/wiki/Naos_Asteroid_Belt",
  "/wiki/Zombie/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Burial/Legends",
  "/wiki/Sith_runes",
  "/wiki/Star/Legends",
  "/wiki/Dathka_Graush%27s_sarcophagus",
  "/wiki/Sith_sword",
  "/wiki/Sith_amulet",
  "/wiki/Dathka_Graush%27s_holocron",
  "/wiki/3963_BBY",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Jedi_Covenant",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Helm_of_Dathka_Graush",
  "/wiki/Force_power/Legends",
  "/wiki/Sword_of_Ieldis",
  "/wiki/Ieldis",
  "/wiki/Nullification_resin",
  "/wiki/Atmosphere/Legends",
  "/wiki/Kilometer/Legends",
  "/wiki/Odryn",
  "/wiki/Sanctum_of_the_Exalted",
  "/wiki/3643_BBY",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/1_BBY/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Naz_Felyood",
  "/wiki/Starship/Legends",
  "/wiki/Jynni%27s_Virtue",
  "/wiki/Cloaking_device/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Suicide/Legends",
  "/wiki/Self-destruct_mechanism/Legends",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Sorcerers_of_Rhand",
  "/wiki/Way_of_the_Dark",
  "/wiki/Darksight",
  "/wiki/The_galaxy/Legends",
  "/wiki/Temple_of_Korman_Lao",
  "/wiki/Shadow_Crown",
  "/wiki/Mindor/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Academy_(Ossus)",
  "/wiki/Homeworld/Legends",
  "/wiki/Historian/Legends",
  "/wiki/Species/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/City/Legends",
  "/wiki/Sword/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Korriban:_Planet_of_Lost_Souls",
  "/wiki/Roleplaying_game",
  "/wiki/Cory_J._Herndon",
  "/wiki/Wizards.com",
  "/wiki/October_2",
  "/wiki/2003",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/6900_BBY",
  "/wiki/Luke_Skywalker_and_the_Shadows_of_Mindor",
  "/wiki/2008",
  "/wiki/Matthew_Stover",
  "/wiki/Knights_of_the_Old_Republic_29",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2009",
  "/wiki/The_Essential_Atlas",
  "/wiki/2012",
  "/wiki/Book_of_Sith:_Secrets_from_the_Dark_Side",
  "/wiki/Daniel_Wallace",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Exiles",
  "/wiki/Ajunta_Pall",
  "/wiki/Hakagram_Graush",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sony",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/King/Legends",
  "/wiki/28,000_BBY",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/Template:TOR_dates",
  "/wiki/Tales_of_the_Jedi_Companion",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Golden_Age_of_the_Sith_2"
 ]
}