{
 "name": "Dathan",
 "display_name": "Dathan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Exegol"
     ]
    },
    {
     "name": "Born",
     "values": [
      "12 BBY",
      "Exegol"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 ABY",
      "aboard the Bestoon Legacy",
      "Jakku system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Palpatine family",
      "Sith Eternal"
     ]
    }
   ]
  }
 ],
 "content": "Dathan, also known as \"the Abomination,\" was a human male Strand-Cast genetically engineered by the Sith Eternal cult on the planet Exegol in 12 BBY. The Sith cultists utilized the template of Darth Sidious—the Dark Lord of the Sith and Emperor of the Galactic Empire—to create cloned vessels for the preservation of his essence. The strandcast who became known as Dathan was a byproduct of the cult's experiments, however he lacked a strong connection to the Force, despite his genetic connection to Sidious, and thus was deemed a failed experiment by his father. Although Dathan was treated by Sidious with disdain for his powerless nature—being referred to as a \"useless creature\"—the excellent health he possessed nevertheless made him permitted to live as a means for continuing the Palpatine bloodline.\nFor his creator's neglect, Dathan would ultimately reject him and the ways of the Sith in a similar fashion by escaping from his homeworld, intent on pursuing a life away from the dark side of the Force. He eventually married a woman named Miramir, who gave birth to their daughter Rey in 15 ABY. Rey was strong with the Force unlike the strandcast who sired her, and as such, was deemed a viable host for her grandfather's essence. Determined to claim his granddaughter at all costs, Sidious sent the assassin Ochi of Bestoon to find and bring Rey to Exegol.\nDathan and his family settled for a time on the planet Jakku, where he and his wife struggled to survive in the desert as junk traders during the New Republic Era. They were captured and killed by Ochi in 21 ABY, though not before Dathan and Miramir managed to hide their daughter by leaving her with the junk boss Unkar Plutt. Rey remained hidden on Jakku for several years before discovering her dormant connection to the Force, which in turn led to her path to becoming a Jedi.\nLittle was known about the life of Dathan, but his origins could be traced back to the Imperial Era when the Dark Lord of the Sith Darth Sidious—publicly known as Galactic Emperor Sheev Palpatine reigned over the galaxy as Emperor of the Galactic Empire. The Sith's rule ended when Sidious was betrayed and killed by his apprentice, Darth Vader, during the Battle of Endor in 4 ABY.\nHowever, the Emperor subverted death by transferring his spirit into a cloned shell of his original body on the planet Exegol, the home of a secret cult of Sith loyalists known as the Sith Eternal. Despite his successful revival, and the fact that he long suspected Vader would betray him, it happened faster than he expected and caught him by surprise, so the preparations at the Sith Citadel had not been fully complete.\nThe process was flawed and far from perfected, while the cloning techniques employed by the Sith Eternal were also inadequate despite years of experimentation, leading to the body—unable to contain Sidious' immense power within the dark side of the Force—to suffer with rapid decay. Essentially trapped in a rotting corpse, weak and temporary, Sidious was accelerating toward death again, but this time permanently. So his followers labored to create a new vessel for their master while he fought to survive in this temporary form and was sustained by life support and machinery.\nThe son of Darth Sidious was created in 12 BBY, prior to the Sith Lord's first death in 4 ABY. An unnamed strandcast, Sidious' son was a result of the Sith Eternal's efforts to produce a body worthy of his vast power. The Sith cult was prepared to do and risk anything in their goal of designing a cradle worthy of housing their \"god consciousness,\" and so experimented further. Using a method of cloning known as Strand-Casting, a variety of dark sciences, with modified Kaminoan cloning technology, the cultists produced countless modified clone bodies from their master's genetic template. Splicing together genes and bolstering tissue, these artificial constructs were engineered from Sidious' cloned tissue samples in addition to other donated blood cells. However, all but one were complete failures and did not survive the cloning process.\nThat lone surviving modified clone became Sidious' \"son.\" Lacking a name of his own, the strandcast was referred to as \"the Abomination.\" As a strandcast, he was not entirely identical in appearance to his donor. Nevertheless, he was thriving and possessed excellent health. However, he would prove to be nothing but a source of disappointment for the man he was created from. Despite having the blood of the Palpatine family rushing through his veins, he was devoid of any strength in the Force, unable to harness its abilities like his \"father,\" who relished in such capabilities.\nThe strandcast was rejected by his father, who held disdain for the ordinary son he sired through science. Though the Sith Lord acknowledged their blood connection to each other, he nonetheless saw the strandcast as a \"useless creature\"—referring to his son as \"it\"—and an inferior child that happened to be spawned from his flesh. However, despite being powerless and deemed a useless failure and an abomination, the strandcast's health afforded Sidious with other potential uses for him.\nSurmising that his cloned progeny having the Palpatine bloodline within him, regardless of not possessing a sensitive connection to the Force, might one day prove useful, Sidious permitted his genetic offspring to survive. The strandcast's health afforded the Emperor the means to continue on and preserve his bloodline, and potentially yield more favorable results in producing a vessel worthy of containing his spirit through more natural means.\nBecause of the disappointment his \"son\" turned out to be, it was surmised by historians that Sidious would have likely neglected the boy. In actuality, Sidious could not bear to look upon his powerless failure of a strandcast, disgusted with what he considered an example of such \"disappointing ordinariness\" and viewing the strandcast as undeserving of his family's legacy. Because of his neglecting and rejection, the strandcast, in return, shunned his \"father\" and the ways of the Sith during his time on Exegol. The only reason the cloners on Exegol did not \"recycle\" him was because Sidious offered the strandcast a modicum of protection, believing there might still be some usage to the failed clone. Although he renounced the Sith Eternal and his donor, the Palpatine bloodline would prosper through him, just as Sidious predicted.\nThe strandcast was able to escape from Exegol shortly after the arrival of Darth Vader and the Jedi hunter Ochi. Having been known only as the Abomination throughout his childhood, the strandcast assumed the name of Dathan, a Symeong slave who had treated him with kindness. The strandcast had left Exegol to pursue a life away from his creator, having grown to desire the life of an ordinary man by the time he matured into a young man. As such, he chose to give up his identity, the name \"Dathan\" being lost to history. The strandcast was errant to his cruel Sith father and rejected a life of darkness. Despite the fact the Sith Lord had discarded his clone, Sidious nevertheless viewed this as unforgivable betrayal to himself, and that once his son had fulfilled his purpose and was found, would be punished accordingly.\nIn addition to rejecting Sidious, Dathan married a woman named Miramir, whom he fell in love with. Together, they conceived a child, their daughter Rey who was born in 15 ABY.\nWhile Sidious had not anticipated Dathan's relationship with Miramir, he nonetheless saw it as an opportunity because his granddaughter, unlike his clone, inherited his connection to the Force. Rey was therefore deemed the perfect vessel for her grandfather's essence. Dathan eventually settled with his family on Jakku, a backwater world where Rey's parents struggled to survive as junk traders. Despite his efforts to stay hidden from his father's agents, they eventually tracked the clone and his family to Jakku. Following the Sith assassin Ochi's hunt for them, Dathan and his wife stole Ochi's starship, the Bestoon Legacy, to return to Jakku; the threat of discovery compelled Rey's parents to leave her with Unkar Plutt. As reluctant as they were to leave Rey behind, they did so to protect her from Sidious. As they bid their goodbyes, Dathan also noticed as Miramir took a necklace of Aki-Aki beads from Plutt, which she stated would be their insurance.\nAs they departed Jakku, Dathan and Miramir were captured by Ochi, who had tracked them aboard a Corporate Sector Authority ship thanks to a homing beacon implanted on the Bestoon Legacy by High Colonel Enric Pryde. With Ochi reclaiming the Bestoon Legacy, he held them as prisoners. They were interrogated by the alien, who demanded to know the whereabouts of his master's granddaughter, but neither of them would cooperate. The clone remained silent while his wife lied to Ochi, claiming that Rey was nowhere on Jakku. Ochi knew that they had tried to deceive him, an action he considered intolerable.\nFailing to coerce information from either captive, Ochi executed both of Rey's parents. The clone was the first to die as Ochi stabbed him in the stomach with his dagger. Miramir, who watched her husband die in front of her, was then stabbed to death, also on Sidious' order. Their bodies were subsequently disposed of; Ochi stuffed their bodies in a crate and sent it drifting in space. The crate was soon found by Lando Calrissian and R2-D2, who recovered their bodies and took them to the frozen world of Neftali, where they buried them together with the help of Luke Skywalker and Komat. However, Miramir's plot with the Aki-Aki beads worked, as it tricked Ochi into traveling to the dangerous world of Pasaana instead of heading to Jakku.\nThe name of Rey's father was forgotten; both Dathan and Miramir became little more than fragments of memory to the daughter that they left on Jakku. There was no record that Sidious' cloned son inherited his father's power in the Force, leading historians to surmise that the strandcast was a source of much disappointment to the Sith Lord who created him.\nAccording to Darth Sidious' book, The Secrets of the Sith, Dathan was remembered by the Dark Lord of the Sith as his errant clone that rejected for not possessing any sensitivity to the Force, rejected him as his \"father\" and the ways of the Sith Order, and who betrayed him for taking his granddaughter away into hiding with his mate, temporarily robbing him of his to ensure his legacy as a Sith Lord arose once again.\nRey remained on Jakku for years, learning to support herself as a scavenger while unaware of her dormant Force powers or her relation to Emperor Palpatine. During this time in her life, she had all but forgotten the parents who left her when she was a child, having subconsciously suppressed the memories of her childhood. Despite this, she was hopeful that her father and mother would eventually return to her, giving her a reason to stay on her homeworld instead of exploring the wider galaxy. Yet a lifetime of isolation also left Rey struggling with feelings of solitude and abandonment, an experience which contributed to the emotional bond she would form with Ren during the First Order-Resistance War.\nRen, having seen who Rey's parents were and how they lived through the Force-bond that he shared with their daughter, urged Rey to admit the truth about her parents. When Rey confessed that her father and mother were no one significant, Ren elaborated, revealing that they were junk traders who bartered their daughter away in exchange for money. Ren had learned the identities of Rey's parents through a Force vision, and told Rey that her father was an insignificant junk trader who sought money to feed his alcoholism. Though she later believed that Ren had only divulged this information as a means to turn her to the dark side, Rey sensed that he had not tried to deceive her, yet was still reluctant to admit that she was born to parents of no background.\nAlthough Ren had not lied to Rey about her parents, he later realized that the vision he saw of them was incomplete. He eventually learned the full truth from Sidious while confronting the Dark Lord of the Sith on Exegol. Sidious revealed that Rey's father was his son, making Rey his biological granddaughter. The revelation of the scavenger's origins reignited Ren's desire to rule the galaxy with Rey at his side. In addition, he discovered that together they formed a rare and powerful dyad in the Force, which only further convinced him of their shared destiny.\nRey, who began training as a Jedi apprentice, was astonished to discover her biological connection to the fallen Emperor. As a Jedi, she struggled to control her anger, but the knowledge that Sidious gave the order to kill her parents fueled her desire for revenge. Yet her devotion to the Jedi Order and the light side of the Force helped to restrain her from giving into the impulse to kill in anger. It was also the memory of her father and mother that prevented Rey from turning to the dark side; whereas Sidious believed this made her as weak as her parents, she considered them to be strong for protecting her. During the Battle of Exegol, their daughter vanquished the reborn Emperor with the aid of the spirits of past Jedi.\nDathan was genetically a human male, but as a clone offshoot of Darth Sidious' genetic experiments, he was actually a strandcast artificially constructed mainly from cloned samples of Sidious in addition to donated blood cells from other genetic sources. The son of the Emperor had short dark hair, blue eyes, and light skin. However, his physical appearance was not entirely identical to that of his genetic donor, a byproduct of the modifications to his genome. He was young when he became a father, and had a scruffy red beard by the time he lived on Jakku. He was known to have a \"glib tone and a charming smile\", a trait that he shared with his progenitor Darth Sidious, who was known to be a charmer and a manipulator.\nThough he was cloned from the Sith Lord who masterminded the fall of the Galactic Republic and ruled the Galactic Empire through fear, the strandcast sought to live as an ordinary man with his family; he rejected his father and the ways of the Sith, and pursued a life apart from darkness. Having inherited neither his progenitor's power nor his character, he was regarded by Sidious as a powerless and useless disappointment. Despite the harsh conditions of Jakku, he took on the difficult life of surviving in a desert environment in order to keep Rey hidden from her grandfather. Dathan was haunted by his past, and revisited his time on Exegol in his nightmares, truly not looking back on his time on his homeworld very fondly. He also loved his wife very deeply, and fondly remembered his time with her on her own homeworld. Like his wife, he was saddened by their decision as parents to sell their daughter. Before leaving Rey with Unkar Plutt, Rey's father promised that she would be safe on Jakku.\nDespite being partially created from the genetic template of Darth Sidious, one of the most powerful Sith Lords to have ever lived, the Emperor's son was an ordinary man who had no ability to harness the powers of the Force. However, as Dathan was part of the Palpatine bloodline and in excellent health, he was able to sire a Force-sensitive child with strength in the mystical energy comparable to the Emperor himself.\nDathan was physically strong enough to survive the harsh conditions of the desert planet Jakku, and was skilled enough with his wife Miramir to keep himself, and their child hidden from Sidious for years until being found by Ochi of Bestoon.\nDathan was first mentioned, albeit indirectly, in the 2015 film Star Wars: Episode VII The Force Awakens, the first installment of the Star Wars sequel trilogy. He first appeared in a flashback sequence of the 2019 film Star Wars: Episode IX The Rise of Skywalker, where he was portrayed by Billy Howle.\nIn Star Wars Legends, Emperor Palpatine also had experimented with cloning himself, to which he intended to transfer his spirit. In another work, he also had a son named Triclops, who first appeared in the 1993 book Mission from Mount Yoda, the fourth installment of the young readers Jedi Prince series written by Paul and Hollace Davids. Similarly to Rey's father, Triclops also conceived a child with a woman, and that child became an apprentice of Luke Skywalker as well.\nAdam Christopher, the author of the book Shadow of the Sith, named the character after a childhood friend named Dathan. The author wanted a name that sounded earthly, like Luke and Ben, but not too common. According to the author, Dathan rhymes with \"Nathan\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Move_protection",
  "/wiki/Darth_Sidious",
  "/wiki/Gender",
  "/wiki/Symeong",
  "/wiki/Dathan_(Symeong)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Dathan",
  "/wiki/Exegol",
  "/wiki/12_BBY",
  "/wiki/21_ABY",
  "/wiki/Bestoon_Legacy",
  "/wiki/Jakku_system",
  "/wiki/Human",
  "/wiki/Strand-Cast",
  "/wiki/Color",
  "/wiki/Palpatine_family",
  "/wiki/Sith_Eternal",
  "/wiki/DNA",
  "/wiki/Bioengineering",
  "/wiki/Sith_cult",
  "/wiki/Planet",
  "/wiki/Sith_cultist",
  "/wiki/Clone_template",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Galactic_Emperor",
  "/wiki/Galactic_Empire",
  "/wiki/Cloning",
  "/wiki/Immortality",
  "/wiki/Imperial_cloning_program",
  "/wiki/The_Force",
  "/wiki/Homeworld",
  "/wiki/Marriage",
  "/wiki/Miramir",
  "/wiki/Reproduction",
  "/wiki/Rey_Skywalker",
  "/wiki/15_ABY",
  "/wiki/Assassin",
  "/wiki/Ochi",
  "/wiki/Bestoon",
  "/wiki/Time",
  "/wiki/Jakku",
  "/wiki/Desert",
  "/wiki/Junk_dealer",
  "/wiki/New_Republic_Era",
  "/wiki/Junk_boss",
  "/wiki/Unkar_Plutt",
  "/wiki/Standard_year",
  "/wiki/Jedi_training",
  "/wiki/Jedi",
  "/wiki/Imperial_Era",
  "/wiki/The_galaxy",
  "/wiki/Emperor",
  "/wiki/Sith",
  "/wiki/Death",
  "/wiki/Sith_apprentice",
  "/wiki/Anakin_Skywalker",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Transference",
  "/wiki/Sith_Citadel",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Life_support",
  "/wiki/Ommin_harness",
  "/wiki/Darth",
  "/wiki/Sith_Lord",
  "/wiki/Deity",
  "/wiki/Kaminoan",
  "/wiki/Gene",
  "/wiki/Blood",
  "/wiki/Force_power",
  "/wiki/Lord",
  "/wiki/Historian",
  "/wiki/Jedi_hunter",
  "/wiki/Slavery",
  "/wiki/Force-sensitive",
  "/wiki/Sith_assassin",
  "/wiki/Quest_for_Exegol",
  "/wiki/Starship",
  "/wiki/Aki-Aki",
  "/wiki/Corporate_Sector_Authority",
  "/wiki/Homing_beacon",
  "/wiki/High_Colonel",
  "/wiki/Enric_Pryde",
  "/wiki/Prisoner",
  "/wiki/Alien",
  "/wiki/Blade_of_Ochi_of_Bestoon",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/R2-D2",
  "/wiki/Neftali",
  "/wiki/Burial",
  "/wiki/Luke_Skywalker",
  "/wiki/Komat",
  "/wiki/Pasaana",
  "/wiki/Book",
  "/wiki/The_Secrets_of_the_Sith",
  "/wiki/Scavenger",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Force-bond",
  "/wiki/Force_vision",
  "/wiki/Credit",
  "/wiki/Alcohol",
  "/wiki/Force_dyad",
  "/wiki/Padawan",
  "/wiki/Jedi_Order",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Battle_of_Exegol",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Republic",
  "/wiki/2015",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Billy_Howle",
  "/wiki/Star_Wars_Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Transfer_essence",
  "/wiki/Triclops",
  "/wiki/1993",
  "/wiki/Mission_from_Mount_Yoda",
  "/wiki/Jedi_Prince",
  "/wiki/Paul_Davids",
  "/wiki/Hollace_Davids",
  "/wiki/Ken",
  "/wiki/Kendalina",
  "/wiki/Padawan/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Adam_Christopher",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:Dathan",
  "/wiki/Rey%27s_First_Flight",
  "/wiki/Galactic_Adventures_Storybook_Collection",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_1",
  "/wiki/The_Force_Awakens_Adaptation_2",
  "/wiki/The_Force_Awakens_Adaptation_4",
  "/wiki/The_Force_Awakens_Adaptation_5",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars:_The_Last_Jedi_Graphic_Novel_Adaptation",
  "/wiki/The_Last_Jedi_Adaptation_3",
  "/wiki/The_Last_Jedi_Adaptation_4",
  "/wiki/The_Last_Jedi_Adaptation_5",
  "/wiki/Through_the_Turbulence",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Template:ShadowoftheSithDate",
  "/wiki/The_Saga_of_Rey",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/34_ABY",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/September_5",
  "/wiki/2022",
  "/wiki/September_7",
  "/wiki/Star_Wars:_Dark_Empire",
  "/wiki/The_Star_Wars_Spy_Game:_SPIN_Declassified",
  "/wiki/The_Lost_City_of_the_Jedi",
  "/wiki/May_19"
 ]
}