{
 "name": "Dav Kathis",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Dav Kathis was an officer of the Imperial Navy and later a highly regarded free-trader in the Enarc Run, as well as husband to Leanna Carella and father of a son. Still loyal to the ideals of the Galactic Empire, Kathis refused to serve as an agent of the Alliance to Restore the Republic. This did not stop COMPNOR from kidnapping him and trying to make him confess.\nDav Kathis was an officer of the Imperial Navy, but he wanted to become the captain of an independent freighter and a free-trader.\nAt one point, the Bureau of Ships and Services of Nigel III offered a Kazellis-class light freighter, the Longrunner, in open auction. Kathis resigned from the Navy, bought the ship and began his dream life of freetrading through the Enarc Run. He was esteemed along the people he met.\nKathis married a former agent of Imperial Customs, Leanna Carella, and fathered a son with her. The three of them lived in the Longrunner.\nAgents of Alliance Intelligence repeatedly approached Kathis, wanting him to provide them with valuable information. However, Kathis refused, being still convinced that the Empire was not evil at all.\nLater, Empire-aligned agents of COMPNOR mistakenly believed Kathis to be an spy for the Alliance, providing them with information about the Kira sector. A particularly paranoid COMPNOR leader ordered to kidnap Kathis . Under nearly-fatal torture, Kathis did not reveal anything of interest — prompting the COMPNOR agents to target Carella as the potential spy.\nMeanwhile, Carella had taken over her husband's business and traveled through his usual areas of operation along with their child. Carella was actively trying to find any lead to Kathis' location.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Free-trader",
  "/wiki/Enarc_Run/Legends",
  "/wiki/Leanna_Carella",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/Bureau_of_Ships_and_Services/Legends",
  "/wiki/Nigel_III",
  "/wiki/Kazellis-class_light_freighter",
  "/wiki/Longrunner",
  "/wiki/Imperial_Office_of_Customs/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Kira_sector",
  "/wiki/Torture/Legends",
  "/wiki/Stock_Ships"
 ]
}