{
 "name": "Davar Hamalcal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kaellin III"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Davar Hamalcal was a hunter from a primitive culture who stowed away on a Rebel shuttle. Hamalcal subsequently joined the Alliance.\nDavar Hamalcal typically dressed in a sleeveless coverall with many pockets, a supply belt, a cloak, and shiny black boots. This, combined with his mane of long blond hair, tended to make him look out of place in most environments.\nDavar Hamalcal was born and raised on the backwater world of Kaellin III, in the Malenstorr system, where he served as a hunter and scout for his village. Hamalcal and his village lived a technologically primitive life, and were far behind the galactic standard of technology and economy, to the point that they did not even use credits as currency.\nWhen a Delta-class shuttle crashed near his village in the aftermath of a space battle between a Rebel warship and an Imperial supply convoy, Hamalcal's life took an unexpected turn. The village elder approached the shuttle with a peace overture, which was mistaken by the stormtroopers on board for an attack. The village elder was killed, inciting the villagers to attack the stormtroopers. With the timely aid of a landing party from the Alliance Blockade Runner which was still in orbit, the villagers wiped out the stormtroopers in a \"glorious battle.\"\nDuring the victory celebration which followed this skirmish, Hamalcal stowed away aboard the Rebel shuttle. The Rebels were impressed with his skill in battle and his charismatic manner, and so they subsequently allowed Hamalcal to join them on various missions.\nDavar Hamalcal was a jovial and likable barbarian, who greatly enjoyed his experiences in the galaxy with the Rebel Alliance. He thrived on violence and conflict, particularly enjoying battles against Imperial stormtroopers.\nSince he had lived most of his life without relying on technology on his homeworld, Hamalcal was happy to cope without using it after joining up with the Alliance. Nevertheless, Hamalcal did hope to one day learn how to use technology, and other trappings of modern civilization. In particular, Hamalcal hoped to learn the value of money, a concept with which he had frequent difficulty.\nHamalcal often used his primitive appearance and demeanor to his advantage. He was fond of making people believe that he was in awe of their technology, which he would refer to as \"powerful magic,\" thus encouraging them to underestimate him.\nDavar Hamalcal was a formidable warrior in hand-to-hand combat, although he was almost totally unskilled with any sort of modern technology, including blasters.\nDespite his lack of ability with modern technology, Davar Hamalcal usually carried a Merr-Sonn DeathHammer blaster pistol, and a SoroSuub Stormtrooper Two blaster rifle. He preferred to use his trusty Vibro-ax in combat, however, since it was more suited to his abilities.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kaellin_III",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Malenstorr_system",
  "/wiki/Galaxy/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Delta-class_shuttle",
  "/wiki/Warship/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Convoy/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Merr-Sonn_Munitions,_Inc./Legends",
  "/wiki/434_blaster_pistol",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Stormtrooper_Two_blaster_rifle",
  "/wiki/Vibro-ax/Legends",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}