{
 "name": "Davin Felth",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "Davin Felth was a human male who served the Galactic Empire as a sandtrooper during the Galactic Civil War. Following the escape of two droids from the Rebel cruiser Tantive IV after it was captured by Imperial forces above the planet Tatooine, Felth was amongst a squad of stormtroopers sent to search for the droids in the desert. While searching, he managed to locate evidence of the droids' presence.\nDavin Felth was a human male who served as a member of the Galactic Empire's Stormtrooper Corps during the Galactic Civil War against the Alliance to Restore the Republic. In 0 BBY, the Rebel CR90 corvette Tantive IV was captured by the Empire over the planet Tatooine while carrying plans to the Empire's Death Star superweapon. The droids R2-D2 and C-3PO managed to slip through the Empire's clutches and leave the vessel with the plans in an escape pod that carried them to the surface of the planet Tatooine.\nKeen to recover the plans, the Empire dispatched sandtroopers, including Felth, into the deserts of Tatooine to search for the droids. The troopers managed to locate the droid's escape pod where Felth discovered a metal O-ring that had jarred loose from C-3PO's left knee joint. Felth picked up the evidence and alerted his commander. Ultimately the droids successfully escaped Tatooine and delivered the plans to the Alliance.\nFelth wore stormtrooper armor with a white pauldron while in the desert.\nDavin Felth first appeared in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. Disc jockeys Terence McGovern, Jerry Walters, Scott Beach, and Morgan Upton provided the voices for all of the stormtroopers in the film while speaking over a walkie-talkie. The voices were then recorded by Star Wars sound designer Ben Burtt. McGovern maintains a personal Web site that lists all of the dialogue he was responsible for in the film, which does not include Felth's one line of dialogue.\nIn the new Star Wars canon, the character was first identified in \"Dominate the Desert\", an article published on Fantasy Flight Games' official site in 2019. The name originated in the Star Wars Legends continuity, where it was first used When the Desert Wind Turns: The Stormtrooper's Tale, a short story written by Doug Beason and published in the 1995 anthology book Tales from the Mos Eisley Cantina. In the book Felth is also depicted as being the stormtrooper with an orange pauldron seen in Chalmun's Spaceport Cantina; however, in the new Star Wars canon this trooper was identified as Wanten in the short story \"Born in the Storm\", which was written by Daniel José Older and published in the 2018 anthology, From a Certain Point of View.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Davin_Felth",
  "/wiki/Davin_Felth/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/File:Look_Sir_Droids.ogg",
  "/wiki/Desert_stormtrooper",
  "/wiki/Galactic_Civil_War",
  "/wiki/Droid",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Cruiser",
  "/wiki/Tantive_IV",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Imperial_Military",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Squad",
  "/wiki/Desert",
  "/wiki/Stormtrooper",
  "/wiki/0_BBY",
  "/wiki/CR90_corvette",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Starship",
  "/wiki/Escape_pod",
  "/wiki/Trooper",
  "/wiki/Commanding_officer",
  "/wiki/Stormtrooper_armor",
  "/wiki/Color",
  "/wiki/Pauldron",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Terence_McGovern",
  "/wiki/Jerry_Walters",
  "/wiki/Scott_Beach",
  "/wiki/Morgan_Upton",
  "/wiki/Star_Wars",
  "/wiki/Ben_Burtt",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/2019",
  "/wiki/Star_Wars_Legends",
  "/wiki/When_the_Desert_Wind_Turns:_The_Stormtrooper%27s_Tale",
  "/wiki/Doug_Beason",
  "/wiki/1995",
  "/wiki/Tales_from_the_Mos_Eisley_Cantina",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Wanten",
  "/wiki/Born_in_the_Storm",
  "/wiki/Daniel_Jos%C3%A9_Older",
  "/wiki/2018",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_A_New_Hope_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_2",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/The_Sounds_of_Star_Wars",
  "/wiki/July_17",
  "/wiki/2011"
 ]
}