{
 "name": "Davits Draven",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pendarr III"
     ]
    },
    {
     "name": "Born",
     "values": [
      "45 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Executor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.91 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Intelligence",
      "Republic Intelligence",
      "Alliance to Restore the Republic",
      "Rebel Alliance Intelligence Service",
      "Massassi Group",
      "Operation Fracture Oversight",
      "Rebel Alliance Intelligence Service",
      "Massassi Group",
      "Operation Fracture Oversight"
     ]
    }
   ]
  }
 ],
 "content": "Davits Draven was a human male who served as a general in the Alliance to Restore the Republic during the Galactic Civil War. He was stationed at the Great Temple on the moon Yavin 4 when Jyn Erso was given the task of stealing the Death Star plans by Mon Mothma, a leader of the Rebel Alliance. Extraction Team Bravo, the team responsible for Jyn's break out of a labor camp on the planet Wobani, was under Draven's command.\nDavits Draven was born on Pendarr III in 45 BBY.\nDuring the Clone Wars, Draven served in the Galactic Republic's Military Intelligence. During this time, he never met any of the Jedi Generals in command of the Clone Army. Draven routinely worked with the Republic's strategists, fleet commanders, and other officers that would become part of the Empire's Military.\nWith an urgent drive to stop the Empire before it grew too powerful, Draven joined the Alliance to Restore the Republic before its formal creation. He stayed in contact with Senator Mon Mothma, who was working to bring various cells together under a single banner. Draven was also trained as a field operative by Airen Cracken. After recruiting him into the Rebellion, Draven became the case officer for agent Cassian Jeron Andor.\nPrior to the outbreak of the Galactic Civil War, Draven carried out surgical strikes against the Empire, conducting sabotage, theft, and assassinations that earned unglamorous but necessary victories for the Alliance. He became a trusted officer, earning Mon Mothma's respect despite his no-nonsense attitude proving difficult at times, and served as a general and as the leading Rebel Alliance Intelligence Service officer on Yavin 4 in Cracken's absence. He typically caused Alliance High Command meetings to halt with his blunt speech and pragmatic views, and it often fell to Draven to make unpopular and difficult decisions.\nDraven worked on gathering information on the various resistance factions throughout the galaxy. He received information on the Spectres from Ahsoka Tano and he provided a summary on the major factions to Mon Mothma. He was directed by Mon Mothma to make contact with the criminal underworld and other factions in the galaxy to assess their sentiment to the Rebel alliance. Draven tasked Cassian Jeron Andor with the mission, and Andor reported that the Bounty Hunters' Guild was unlikely to be an ally as the Empire's deeper pockets made the Guild more apt to work with them. Draven relayed the information to Mon Mothma, but suggested the Alliance reach out to the Mining Guild who would be more likely to give them safe passage. At another time, he was approached by Andor about a mission to Wecacoe to access an captured Imperial warship that had been fallen into private hands. Andor hoped to recover Imperial security protocols from the wreckage. Draven suggested he take Kertas and Rismor with him on the mission.\nIn 0 BBY, he oversaw the mission he dubbed Operation Fracture in an attempt to piece together the puzzle of Galen Walton Erso's involvement with the Empire's Death Star project. Although some in the rebel council believed reports of the superweapon to be a ploy, Draven's firsthand experience with Imperial megalomania led him to believe the plausibility of the so-called \"planet-killer\". He reported to Cracken that Bodhi Rook had defected on Jedha and had information related to Galen Erso and a possible planet-killer superweapon. He requested permission to have an undercover agent on Vulpter slice into the Arakyd Industries data node to get confirmation. When it was successful, he reported back to Cracken with the details. While the Rebel Council debated on how to proceed, Draven received a document from Haxen Delto speculating about a connection between Geonosis and the Imperial superweapon. While waiting for a mission, he forwarded a report authored by Harisha Gulan to Mon Mothma about the security droid K-2SO. Mon Mothma directed Draven and Cracken to find possible leads on the Imperial superweapon by looking at supply lines, laborers, and possible orbital construction sites.\nDraven oversaw the rescue of Galen's daughter, Jyn Erso, to help with the mission. He had Ruescott Melshi put together a plan for breaking her out of an Imperial labor camp which Draven then forwarded to Mon Mothma. Meeting and speaking with her, Draven was not impressed with her defiance. After the briefing, he sent a notice to Mon Mothma strongly urging that she reconsider involving Erso in the mission. In Draven's mind, Erso was a Rebel deserter and a criminal who showed no loyalty to anyone except herself. Mothma overruled him, arguing that, besides them needing her to identify her father, Jyn Erso was much like other Rebels who had lost their way and deserved a second chance. He put together a mission and team for assaulting Saw Gerrera's fortress in case Jyn Erso was unable to get the job done. Nonetheless, he ordered Captain Cassian Jeron Andor to kill Galen Erso if he had the opportunity, countermanding his initial orders to extract the Imperial scientist for questioning.\nAs Operation Fracture got underway, Draven received a communication from Andor confirming the Destruction of Jedha City by the Death Star. The general reinforced the need to kill Erso, and sent a squadron of starfighters to his location on Eadu with assassination orders. However, Andor called in to inform Draven that Alliance operatives would be caught in the line of fire, but by that time the fighters were already engaged. The strike led to Erso's death, and Andor's team returned to Yavin 4. There, Jyn rallied the rebel council, and her Rogue One squad led a mission to Scarif to obtain the Death Star plans.\nFollowing the Battle of Yavin and the assault on Sunspot Prison, Draven was placed in charge of the interrogation of Grakkus the Hutt after Alliance forces intercepted his prison transport vessel. Smuggler and rebel ally Han Solo was recruited to transport Grakkus, and it was Solo who suggested that instead of a typical interrogation, that they trick the Hutt into revealing his power base. Draven communicated over the radio to inform Solo and his first mate Chewbacca that they were sending X-wings to investigate the base on Teth.\nLater, he was present at the Mako-Ta Space Docks, and was part of high-level briefings. He was critical of Leia Organa's plan to free King Lee-Char. During the Assault on the Mako-Ta Space Docks, Draven and other rebel forces accompanied Organa to sneak aboard the Executor in order to steal codes that disabled their rebel fleet. Organa was able to escape, while Draven and the other rebels held Darth Vader and Imperial forces back. After all the rebels were killed, Draven was killed by Vader when his neck was snapped through the ways of the Force.\nDavits Draven was a human man with brown hair, blue eyes and light skin. A veteran of the Clone Wars as part of Republic Intelligence, Draven represented the Rebel Alliance's Intelligence. He and his operatives worked in the shadows performing unglamorous activities such as sabotage, infiltration and assassination, believing them to be necessary responses to the Galactic Empire's cruelty and power, thus becoming a person who made no apology for his methods. He was vengeful and had something of a sadist in his personality, since before he died he desired to see Queen Trios paying for her treason and expressed that it would be wonderful to see Darth Vader burn alive.\nDraven demonstrated a no-nonsense and difficult attitude sometimes, often sharing his stubborn opinions, like when he critiziced Princess Leia Organa's plan to free King Lee-Char from his imprisonment. But though he mostly answered with aggressiveness, what bugged Draven secretly was that Jyn Erso got to become a hero and while he got to become the guy who was wrong. During his last moments aboard the Executor, Draven confided Leia his personal feelings and she responded that she would have liked to become friends with him. Remaining at the Executor to save time for Organa to escape made Draven pay with his life, but the gruff General was able to die acknowledging that every second he and his men bought would save the day, thus becoming the hero he always wanted to be.\nDavits Draven, portrayed by Alistair Petrie, was first revealed in the first teaser trailer for the Star Wars Anthology Series film Rogue One: A Star Wars Story on April 7, 2016. The physical similarities between Draven and Agent Kallus, a character from the animated television series Star Wars Rebels, led to a popular fan theory suggesting that this character was Kallus, and that the Imperial Security Bureau operative had defected from the Galactic Empire. However, Rogue One director Gareth Edwards confirmed in Entertainment Weekly, in a story from October 15, 2016, that the character's name is Draven.\nOriginally as established by Star Wars: The Rebel Files, Draven was alive prior to the Battle of Endor. Due to a degree of miscommunication, notes were missed during production of Star Wars: The Rebel Files, Star Wars  54, had Draven dying aboard the Executor. Matt Martin specified that for the time being, the comic is the definitive story for Draven. Star Wars lead writer Kieron Gillen was the one who came up with killing off Draven, as he thought about how the heroes rose through the ranks so quickly.\nThe following section details his overridden involvement in the rescue of Han Solo from Star Wars: The Rebel Files.\nDraven sent a report to General Airen Cracken on Leia Organa's rescue of Han Solo in, asking if she was running her own operation. He stated in the report that Boba Fett was one of the best bounty hunters in the galaxy, that Jabba Desilijic Tiure was untouchable, and that carbon freeze had low survival rates. Draven continued in the report, stating that his department was still pulling reports for Organa despite his response to the inquiries.\nDraven listed several requests from just that morning, which included architectural specs for Jabba's Palace on file with the Mos Eisley Territorial Planning Authority, eyewitness descriptions of the palace interior collected by Tac-Comm from interviews with musicians and entertainers under the transcripts \"Rystall\" and \"Rappertunie,\" dossiers on prominent courtesans , 18-month log of Jabba's movements offworld and in the Dune Sea, blueprints for the Khetanna, and Ebenn Q3 Baobab's Easy Ubese Phrase Book.\nDraven finished by stating that he couldn't deny a request from a senior member of Alliance High Command, but he wasn't willing to send his agents on a suicide mission. Draven, however, also pointed out that Organa hadn't asked for any such help, and she hadn't asked Pitt Onoran's SpecForce personnel, and concluded with asking again if Organa was running her own operation.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars_Book_XI:_Hope_Dies",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Special:Upload",
  "/wiki/Pendarr_III",
  "/wiki/45_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/1_ABY",
  "/wiki/Executor",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_Intelligence",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Intelligence_Service",
  "/wiki/Massassi_Group",
  "/wiki/Operation_Fracture_Oversight",
  "/wiki/General",
  "/wiki/Galactic_Civil_War",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/Jyn_Erso",
  "/wiki/Battle_of_Scarif",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Death_Star_plans",
  "/wiki/Mon_Mothma",
  "/wiki/Extraction_Team_Bravo",
  "/wiki/Liberation_of_Erso",
  "/wiki/Imperial_Detention_Center_%26_Labor_Camp_LEG-817",
  "/wiki/Planet",
  "/wiki/Wobani",
  "/wiki/Reproduction",
  "/wiki/Clone_Wars",
  "/wiki/Republic_Military",
  "/wiki/Time",
  "/wiki/Jedi_General",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Fleet",
  "/wiki/Commander",
  "/wiki/Officer",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Military",
  "/wiki/Unidentified_male_Rebel_admiral",
  "/wiki/Senator",
  "/wiki/Airen_Cracken",
  "/wiki/Case_officer",
  "/wiki/Agent",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Thief",
  "/wiki/Assassin",
  "/wiki/Alliance_High_Command",
  "/wiki/Spectres",
  "/wiki/Ahsoka_Tano",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Mining_Guild",
  "/wiki/Wecacoe",
  "/wiki/Kertas",
  "/wiki/Rismor",
  "/wiki/0_BBY",
  "/wiki/Operation_Fracture",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Project_Stardust",
  "/wiki/Superweapon",
  "/wiki/Death",
  "/wiki/Bodhi_Rook",
  "/wiki/Jedha",
  "/wiki/Unidentified_female_operative",
  "/wiki/Vulpter",
  "/wiki/Vulpter_data_raid",
  "/wiki/Arakyd_Industries",
  "/wiki/Arakyd_Industries_data_storehouse",
  "/wiki/Haxen_Delto",
  "/wiki/Geonosis",
  "/wiki/Harisha_Gulan",
  "/wiki/Security_droid",
  "/wiki/K-2SO",
  "/wiki/Ruescott_Melshi",
  "/wiki/Captain",
  "/wiki/Scientist",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Squadron",
  "/wiki/Starfighter",
  "/wiki/Eadu",
  "/wiki/Mission_to_Eadu",
  "/wiki/Rogue_One",
  "/wiki/Scarif",
  "/wiki/Battle_of_Yavin",
  "/wiki/Assault_on_Sunspot_Prison",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Hutt",
  "/wiki/Liberation_of_Grakkus",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/First_Mate",
  "/wiki/Chewbacca",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Grakkus%27_safe_house",
  "/wiki/Teth",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Lee-Char",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Anakin_Skywalker",
  "/wiki/The_Force",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Queen",
  "/wiki/Trios",
  "/wiki/Alistair_Petrie",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/April_7",
  "/wiki/2016",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Gareth_Edwards",
  "/wiki/Entertainment_Weekly",
  "/wiki/October_15",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars_(2015)_54",
  "/wiki/Matt_Martin",
  "/wiki/Star_Wars_(Marvel_Comics_2015)",
  "/wiki/Kieron_Gillen",
  "/wiki/Boba_Fett",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Tac-Comm",
  "/wiki/Musician",
  "/wiki/Ryst%C3%A1ll_Sant",
  "/wiki/Rappertunie",
  "/wiki/Ephant_Mon",
  "/wiki/Dune_Sea",
  "/wiki/Khetanna",
  "/wiki/Ebenn_Q3_Baobab",
  "/wiki/Easy_Ubese_Phrase_Book",
  "/wiki/Pitt_Onoran",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/Rebel_Rising",
  "/wiki/Rebel_Rising_(audiobook)",
  "/wiki/Rogue_One_-_Cassian_%26_K-2SO_Special_1",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_1",
  "/wiki/Rogue_One_Adaptation_3",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Star_Wars_Battlefront",
  "/wiki/Grounded",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Star_Wars_(2015)_35",
  "/wiki/Star_Wars_(2015)_50",
  "/wiki/Star_Wars_(2015)_51",
  "/wiki/Star_Wars_(2015)_53",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_56",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Databank_A-Z",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Heroes_of_Rogue_One",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_212",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_ABY",
  "/wiki/Secret_Cargo",
  "/wiki/October_11",
  "/wiki/2019",
  "/wiki/File:KieronGillen-Death-January-10-2019.png"
 ]
}