{
 "name": "Davik Kang",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3956 BBY",
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Exchange"
     ]
    }
   ]
  }
 ],
 "content": "Davik Kang was a male Human crime-lord and long-time member of the Exchange, an interstellar criminal syndicate that was active during the era of the Jedi Civil War. By the time of the war's height, he was the head of Exchange operations on the Outer Rim world of Taris, where he kept his estate. He was killed in his hangar by an amnesiac Revan as Darth Malak destroyed Taris in 3956 BBY.\nIt was implied by Zelka Forn's assistant that Kang originally grew up in the Lower City and lived in poverty along with the non-Humans, unlike most Humans of Taris. He had a large majority of non-Human bounty hunters, most notably Rodians. At some point he became the leader of the Exchange on Taris. After he came to power he became owner of the Ebon Hawk.\nKang employed dozens of mercenaries and enforcers to keep Taris under his unofficial control, most notably the former Mandalorian Canderous Ordo and the bounty hunter Calo Nord. Kang collected the stuffed heads of ferocious creatures hunted and killed by Nord, but his most prized possession was his smuggling vessel, the Ebon Hawk. Kang resented the Sith presence on Taris because their planet-wide blockade had halted his inter-galactic operations, but he knew well enough to avoid bothering them.\nAfter rescuing Bastila Shan from the Black Vulkars, the former Dark Lord of the Sith, Revan  was approached by Ordo, who offered Revan the chance to leave Taris, provided he could retrieve the necessary planetary launch codes from a nearby Sith military base. Revan agreed to steal the codes in return for Ordo convincing Kang to hire Revan as another mercenary. The situation was beneficial for both Revan and Ordo, and the two worked together to steal the Ebon Hawk. Revan and his companions made their escape while his former apprentice, Darth Malak, began bombarding the city into dust from orbit.\nOutraged at the treachery of both Canderous Ordo and Revan, Kang and Calo Nord attempted to stop Revan from stealing his ship; however, they underestimated the amnesiac Dark Lord and Kang was killed. Nord, realizing he was outgunned, pulled out a thermal detonator and hoped he would take Revan and his friends with him. When Kang's estate was again directly hit by Malak's laser blasts, the hangar nearly collapsed, trapping Nord under the wreckage. He escaped to attack Revan again later, but Davik's estate along with the rest of Taris was destroyed by the orbital bombardment.\nKang's powerful battle suit was a legend in itself. Rumor had it that it was so incredible, being light and flexible yet extremely durable, that Kang decided to kill the ingenious technician who constructed it, assuring that no one had a suit of a similar design. He also possessed a prototype visor that gave the wearer improved facility with blasters. The crime lord was eventually stripped of these items by Revan before the Ebon Hawk escaped from the collapsing city-planet.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/3956_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Exchange",
  "/wiki/Canderous_Ordo",
  "/wiki/Crime_lord/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Davik_Kang%27s_estate",
  "/wiki/Amnesia/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Destruction_of_Taris",
  "/wiki/Zelka_Forn",
  "/wiki/Gurney_(Human)",
  "/wiki/Lower_City",
  "/wiki/Non-huMan",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Ebon_Hawk",
  "/wiki/Mercenary/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Calo_Nord",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Bastila_Shan",
  "/wiki/Black_Vulkars/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Davik%27s_war_suit",
  "/wiki/Davik%27s_Visor",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/The_Old_Republic:_Revan",
  "/wiki/The_Old_Republic:_Revan_(audiobook)",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_Handbook",
  "/wiki/Star_Wars_Roleplaying_Game_Saga_Edition_Core_Rulebook",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/So_Uncivilized:_Great_Gunslingers_in_Star_Wars",
  "/wiki/Ahita_Othar"
 ]
}