{
 "name": "Davin_Fel",
 "display_name": "Davin Fel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant",
      "raised on Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 1 ABY–3 ABY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 20 ABY–23 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Empire of the Hand"
     ]
    }
   ]
  }
 ],
 "content": "Davin Fel was the eldest son of the Baron Soontir Fel and Syal Antilles Fel. Raised on Corellia, he moved with his parents to the Unknown Regions when his father decided to serve Grand Admiral Mitth'raw'nuruodo's Empire of the Hand. There, he grew up among the Chiss and was admitted to a Chiss military academy, in which he was criticized by his instructors for a willingness to disobey orders or depart from battle plans in order to save others. He graduated and served as a pilot in the Empire of the Hand's military, in which capacity he was killed at age twenty.\nDavin Fel was born to Baron Soontir Fel and Syal Antilles Fel on Coruscant early in their marriage. Soontir Fel was a prominent and skilled Imperial fighter pilot, while Syal was an Imperial actress under the stage name Wynssa Starflare. Relatively soon after Fel's birth, Syal took him and his younger brother Chak to Soontir's baronial estate on Corellia to live with Soontir's relatives. They were there in 4 ABY when Soontir went missing during the Battle of Brentaal IV; fearful of retribution from Soontir's enemy Director of Imperial Intelligence Ysanne Isard, Syal took the children and fled.\nThey spent months in hiding before Syal was reunited with Soontir, who had defected to the New Republic after being captured. They continued to remain in hiding, however, and Fel's very existence was apparently kept secret, with not even Syal's brother, Wedge Antilles, seeming to know of the children's existence. Not long afterward, Isard succeeded in capturing Soontir, turning him over to Grand Admiral Mitth'raw'nuruodo, known by his core name Thrawn. Thrawn convinced Soontir that he needed his aid in pacifying the myriad threats of the Unknown Regions. Soontir became a general in the Empire of the Hand, which Thrawn had set up to bring stability to the Unknown Regions. A few months later, Syal and the children joined him, their disappearance engineered by Thrawn, on the Empire of the Hand's headquarters on Nirauan.\nFel was reared in the Unknown Regions, where he and Chak were joined by two younger brothers—Jagged and Cem, with Cem being hidden from all others outside the family as a shadow child to preserve the line—and two younger sisters—Cherith and Wynssa. When Thrawn returned to the known regions of space to take command of the Empire, the Empire of the Hand was left in the hands of Admiral Voss Parck, with Soontir a senior officer. The Empire of the Hand remained secret, battling against the various threats found in the Unknown Regions. It consisted not only of Thrawn's Imperial forces but of members of Thrawn's species who rejected the ban their society, the Chiss Ascendancy, imposed on preemptive strikes.\nFel was raised by his father amidst the grim, duty-oriented Chiss culture. Chiss children matured early, and Fel correspondingly began his career early as well. Soontir used his Chiss subordinate Kres'ten'tarthi to secure Fel's acceptance into a Chiss military academy, where Fel served as a guarantee of his father's good faith toward the Chiss. There he was trained on the Nssis-class clawcraft, the Empire of the Hand's preferred fighter. While Fel graduated, the Chiss instructors regarded him as having been rash, undisciplined, and too quick to would-be heroic action rather than unquestioningly obeying authority, as the Chiss preferred. His younger brother Jagged, who idolized him, followed him into the academy after he had already graduated, where Jagged was offered much the same criticism and compared to his older brother.\nFel continued on into military service with the Empire of the Hand as a pilot, as his brother Chak did, waging war against the menaces of the Unknown Regions. He was killed in battle at age twenty in the course of the Yuuzhan Vong invasion, but was remembered fondly by his family. His father, who had been his military superior, felt the burden of Fel's death heavily, and Jagged was hurt by the loss of his hero.\nFel could be impulsive, seeking to take quick and risky action to save others against his instructors' will, a trait for which they reprimanded him. In Chiss society, there was little room for those who disobeyed orders or broke from battle plans from what they saw as misguided heroism.\nDavin Fel was first referenced indirectly in The New Jedi Order: Dark Tide II: Ruin, by Michael A. Stackpole, when Jagged Fel stated that both his older brother and younger sister had died in combat. Elaine Cunningham's Red Sky, Blue Flame then established that Jagged's older brother was Davin; The New Jedi Order: Dark Journey, by the same author, established that Davin had indeed been the brother who died. Fel's only further narrative mention was in Dark Nest I: The Joiner King. He has never actually appeared in any story, only being mentioned.\nIn both The Official Star Wars Fact File 122 and The Official Star Wars Fact File 140, Fel is incorrectly stated to have died in the Battle of Ithor. That battle took place after his death, as clearly established in the source which originated him, Dark Tide II: Ruin.\nThe Official Star Wars Fact File 122 established Soontir Fel as having multiple children before his defection; given the established chain of ages, these could only be Chak and Davin. While that issue of The Official Star Wars Fact File was riddled with errors regarding the Fel family, this piece of information does not actually conflict with any canon and so has been incorporated into this article. Therefore, Davin Fel must have existed during Soontir Fel's time in the New Republic, but no mention of him was ever made, while Soontir constantly fretted about his wife, and no one in the New Republic displayed any knowledge of any Fel children, only of Syal, suggesting very strongly that Davin's existence was kept secret.\nIn Red Sky, Blue Flame, Jagged Fel is said to be Soontir Fel's last living son, which would require Davin Fel to be dead at that point. This has been contradicted by the appearance of Chak Fel in Survivor's Quest, and by The Complete Star Wars Encyclopedia establishing that Davin Fel was twenty at the time of his death; he could not have been born before 1 ABY and therefore would have been no older than eighteen in 19 ABY.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Davin_(disambiguation)",
  "/wiki/Coruscant/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/20_ABY/Legends",
  "/wiki/23_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Empire_of_the_Hand",
  "/wiki/Baron_of_the_Empire/Legends",
  "/wiki/Soontir_Fel/Legends",
  "/wiki/Syal_Antilles_Fel",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Syndic_Mitth%27raw%27nuruodo_training_academy",
  "/wiki/Pilot/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Chak_Fel",
  "/wiki/Fel_estate",
  "/wiki/Fel_dynasty",
  "/wiki/4_ABY/Legends",
  "/wiki/Battle_of_Brentaal_IV_(Galactic_Civil_War)",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Ysanne_Isard",
  "/wiki/New_Republic/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Core_name/Legends",
  "/wiki/General/Legends",
  "/wiki/Nirauan/Legends",
  "/wiki/Jagged_Fel",
  "/wiki/Cem_Fel",
  "/wiki/Shadow_child",
  "/wiki/Cherith_Fel",
  "/wiki/Wynssa_Fel",
  "/wiki/Admiral/Legends",
  "/wiki/Voss_Parck/Legends",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Kres%27ten%27tarthi",
  "/wiki/Nssis-class_Clawcraft",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/Michael_A._Stackpole",
  "/wiki/Elaine_Cunningham",
  "/wiki/Red_Sky,_Blue_Flame",
  "/wiki/The_New_Jedi_Order:_Dark_Journey",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/The_Official_Star_Wars_Fact_File_122",
  "/wiki/The_Official_Star_Wars_Fact_File_140",
  "/wiki/Battle_of_Ithor",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/Survivor%27s_Quest",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars_Gamer_7",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2011_Topps_Star_Wars_Galaxy_Series_6",
  "/wiki/X-Wing:_Iron_Fist",
  "/wiki/Vision_of_the_Future",
  "/wiki/X-Wing_Rogue_Squadron_25"
 ]
}