{
 "name": "Davrel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dxun"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "MandaloriansMandalorian Neo-CrusadersFollowers of Canderous Ordo",
      "Mandalorian Neo-Crusaders",
      "Followers of Canderous Ordo"
     ]
    }
   ]
  }
 ],
 "content": "Davrel was a blue-armored Mandalorian recruit on the jungle world of Dxun during the Dark Wars, serving under Mandalore the Preserver.\nHaving missed the opportunity to fight in the Mandalorian Wars due to his young age at that time, Davrel felt unworthy and wanted to seek a way to prove himself a worthy Mandalorian.\nWhen he was challenged by Meetra Surik in the Battle Circle on Dxun, he gladly accepted the challenge, but lost, even though they fought unarmed and Surik was not using the Force. Enraged, Davrel waited for Surik outside the Mandalorian camp and challenged her to a fight without rules, asking to give him a warrior's death.\nInstead of killing him in a battle where he would not stand a chance, Surik suggested another way of improving his reputation of a warrior. Davrel agreed to help her defeat a zakkeg and by doing so, redeemed himself for his failure in the Battle Circle, and proving himself to be a good warrior.\nAn alternate ending includes Surik adhering to Davrel's wish and giving him an honorable death. In this case, Canderous Ordo, the Mandalore, would commend Surik for their understanding of the Mandalorian ways.\nDavrel can also fall in combat if the zakkeg is not killed fast enough.\nAnother alternative light-side option is too, when Davrel confronts Surik outside the Mandalorian camp, Surik can also turn down Davrel's request for an honorable death, therefore Davrel runs off into the jungle. His body is eventually found later, killed by permacrete detonators.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dxun/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Mandalorians_(Clan_Ordo)",
  "/wiki/Color/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Jungle/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dark_Wars",
  "/wiki/Mandalore_(title)",
  "/wiki/Canderous_Ordo",
  "/wiki/Mandalorian_Wars",
  "/wiki/Meetra_Surik",
  "/wiki/Battle_Circle",
  "/wiki/Unarmed_combat",
  "/wiki/The_Force/Legends",
  "/wiki/Mandalorian_Outpost_(Dxun)",
  "/wiki/Death/Legends",
  "/wiki/Zakkeg/Legends",
  "/wiki/Permacrete_detonator",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords"
 ]
}