{
 "name": "Dawson_(Tynnan)",
 "display_name": "Dawson  (Tynnan)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tynna"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tynnan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cecil Noone's crew"
     ]
    }
   ]
  }
 ],
 "content": "Dawson was a Tynnan male demolitions operative who partnered with thief Cecil Noone around 0 ABY. An expert in explosives who loved playing water-wall and creating and detonating bombs in his youth, Dawson fled the bureaucracy on his homeworld of Tynna after being chosen by lottery to fill a vacancy in the Tynnan government. Hiring himself out as a bomb maker to several underworld clients before meeting Noone, Dawson's talents became an asset to Noone's crew as they tangled with assassins and crime lords from Nar Shaddaa to Kabal.\nDawson formed an integral part of Noone's mission to the Ithorian Herdship Song of the Clouds to retrieve a mysterious box for Guttu the Hutt, and he risked his life to infiltrate a crime lord's yacht docked at the Herdship to find the treasure. Noone's gang stole the yacht and made off with the treasure from the box, revealed to be a Hapan Gun of Command. Dawson and the others accompanied Noone to the world of Kabal, where Noone tried to sell the Gun to Krish business magnate Tyro Viveca. While there, Dawson's odd mania for collecting quay novelty toys came in handy for Noone, who was in need of rescue from Viveca's estate when Viveca began hunting him. Dawson was able to fashion an improvised detonator from one of the novelties and set off a powerful bomb that killed Viveca. With Noone safe, Dawson treated the ailing thief as the group escaped the planet.\nA Tynnan male, Dawson was born on the Expansion Region world of Tynna. During the first eighteen years of his life, a coterie of wealthy uncles tried to interest Dawson in a career in the stock market, but he showed little interest; instead, Dawson preferred to play the game of water-wall and find creative ways to cause explosions.\nOne day, however, a communication to Dawson informed him that he had been selected by lottery to fill a vacancy in the Tynnan government. Horrified at the prospect of spending his life in community meetings and orbital platform control legislation, Dawson left his homeworld, never to return, and offered his services as a demolitions operative to various underworld clients. He eventually joined up with the Human thief Cecil Noone and his crew of professional criminals aboard the bulk freighter Borogove.\nFour years into Dawson's career with the group around 0 ABY, the crime lord Guttu the Hutt contacted them with a job—Noone's crew were to steal a valuable box from Guttu's rival, the Bimm Ritinki, at a meeting between Ritinki and Rodian kingpin Vop. The heist was to take place on the Ithorian herdship Song of the Clouds near the Outer Rim moon of Nar Shaddaa; Dawson was dismayed when he was apprised of the timeframe for the job—two days, while traffic to and from the herdship was restricted.\nThe meeting was being catered, so Noone's crew disguised themselves as staff from the foodservice providers Estimable Epicures to get aboard the herdship, with Dawson and Sluissi team member Hass Sonax stuffed into a metal handcart allegedly containing charbote root in gumbah pudding. With the infiltration complete, Dawson was tasked with cutting into the safe containing the prize. He succeeded with a combination of a fusion cutter and four pellets of Nergon-14 explosives, but was aghast to find the safe empty.\nDespite the setback, Dawson deduced that the box was likely aboard Ritinki's yacht, the Asaari Wind. Stuffing himself into an Ithorian vacsuit and helping Sonax into an equipment sled, the two broke into an airlock near where the Asaari Wind had docked and launched into space. Despite nearly losing control of the suit and sled, Dawson was able to cut through the hull and get aboard the yacht. The plan became complicated when the ship began to power up, but Dawson and Sonax took control of the vessel and crashed the meeting. Noone and the others were able to board the yacht and escape on their new ship with the box, the contents revealed to be a Hapan Gun of Command, in their possession.\nAfter the heist on the Song of the Clouds, Noone's posse traveled on the Asaari Wind—by then known as the Spiraling Shape—to the coastal community of Palisade on the Outer Rim world of Kabal. Noone had attempted to sell the Gun of Command to an agent of the Rebel Alliance. When the deal failed, the Krish business magnate Tyro Viveca expressed interest in the item. While in Palisade, Dawson squabbled with a Squib trader over a quay novelty toy, aiming to acquire it and add it to a small collection he had been amassing. When Human female group member Kels Turkhorn dismissed the toy and left it behind, Dawson was crestfallen and soothed himself with a bundle of maraffa twigs. He was eventually able to obtain the device in return for three blasting caps and a copper spindle.\nWhen the group traveled to Viveca's mansion to rescue Noone, who had been negotiating with the crime lord and was being hunted for sport by Viveca, Dawson's detonators were damaged by a security droid's blaster. Nevertheless, and despite sustaining an injury to his ribs in the chaos, Dawson was able to adapt his undamaged quay novelty toy to act as a detonator and kill Viveca with the associated bomb, and they were able to save Noone. Back aboard the Spiraling Shape, Dawson struggled with a medkit to treat Noone as the yacht made its escape from Kabal.\nDawson was impulsive, single-minded, and oblivious to his surroundings, but he was a skilled demolitions operative nonetheless. He was also fond of Sonax, despite their frequent clashes of personality.\nAn explosives expert, Dawson was adept at improvising bombs and traps from unusual items, including a \"pre-programmed prognosticator\" quay novelty toy. He was also physically strong and an exemplary swimmer.\nDawson carried timers, triggers, detonators, putty, raw baradium, thermite gel, shaped detonite, and vials of Nergon-14 along with other assorted gadgets in a satchel. Dawson also possessed a datapad and safe-cracking tools. To ameliorate his poor sight, Dawson wore an ocular enhancer over his eyes. He was also able to use an Ithorian vacsuit in a pinch.\nDawson first appeared in Daniel Wallace's short story \"The Great Herdship Heist,\" which was featured in Star Wars Adventure Journal 15 and published on November 1, 1997. The illustrations of Dawson in the issue were drawn by Will Warren.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dawson",
  "/wiki/Tynna/Legends",
  "/wiki/Tynnan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Cecil_Noone%27s_crew",
  "/wiki/Thief/Legends",
  "/wiki/Cecil_Noone",
  "/wiki/0_ABY/Legends",
  "/wiki/Water-wall",
  "/wiki/Detonator/Legends",
  "/wiki/Bomb/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Tynnan_government",
  "/wiki/Crime_lord/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Kabal/Legends",
  "/wiki/Heist_on_the_Song_of_the_Clouds",
  "/wiki/Ithorian_Herdship/Legends",
  "/wiki/Song_of_the_Clouds",
  "/wiki/Guttu",
  "/wiki/Hutt/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Yacht/Legends",
  "/wiki/Hapes/Legends",
  "/wiki/Gun_of_Command",
  "/wiki/Blaster/Legends",
  "/wiki/Krish_(species)/Legends",
  "/wiki/Tyro_Viveca/Legends",
  "/wiki/Quay_novelty_toy",
  "/wiki/Hunting/Legends",
  "/wiki/Death/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Expansion_Region/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Stock_market",
  "/wiki/Standard_day/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Human/Legends",
  "/wiki/Bulk_freighter/Legends",
  "/wiki/Borogove",
  "/wiki/Ritinki",
  "/wiki/Rodian/Legends",
  "/wiki/Vop",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Estimable_Epicures",
  "/wiki/Sluissi",
  "/wiki/Hass_Sonax",
  "/wiki/Charbote_root",
  "/wiki/Gumbah_pudding",
  "/wiki/Fusioncutter/Legends",
  "/wiki/Nergon-14/Legends",
  "/wiki/Asaari_Wind",
  "/wiki/Ithorian_vacsuit",
  "/wiki/Sled/Legends",
  "/wiki/Airlock/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Hull/Legends",
  "/wiki/Palisade",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Squib/Legends",
  "/wiki/Unidentified_Squib_trader_(Kabal)",
  "/wiki/Kels_Turkhorn",
  "/wiki/Maraffa_twig",
  "/wiki/Copper/Legends",
  "/wiki/Tyro_Viveca_estate",
  "/wiki/Security_droid/Legends",
  "/wiki/Bone/Legends",
  "/wiki/Medkit",
  "/wiki/Putty",
  "/wiki/Baradium/Legends",
  "/wiki/Thermite/Legends",
  "/wiki/Detonite/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Ocular_enhancer",
  "/wiki/Eye/Legends",
  "/wiki/Daniel_Wallace",
  "/wiki/The_Great_Herdship_Heist",
  "/wiki/Star_Wars_Adventure_Journal_15",
  "/wiki/November_1",
  "/wiki/1997",
  "/wiki/Will_Warren",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Fair_Prey",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/Category:Images_of_Dawson_(Tynnan)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Essential_Atlas",
  "/wiki/Kabal_system",
  "/wiki/StarWars.com"
 ]
}