{
 "name": "Daxar_Ies",
 "display_name": "Daxar Ies",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Sometime before 4 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Daxar Ies was one of Emperor Palpatine's private accountants. He embezzled two billion credits from Palpatine's personal funds, and stashed it into several accounts across the galaxy.\nPalpatine sent one of his Hands, Mara Jade, to eliminate him. Daxar made the mistake of making a withdrawal from one of these accounts, and Jade was able to locate him with this transaction.\nJade killed him in a shabby twilight level apartment on Coruscant. Daxar's wife Beda and daughter Eremay arrived at the apartment to find Daxar dead and Jade still there. Jade told them to flee and never return. Mara never recovered the list of accounts where the billion credits were stashed and she left witnesses leading her to believe that she had botched the job Palpatine had sent her to do.\nAccording to UnuThul, Beda and Eremay fled to the Unknown Regions and became Joiners with the Killiks, and that their hatred towards Jade was what created the Dark Nest. UnuThul's account was, however, untrue.\nIn an attempt to drive the Skywalkers apart, Alema Rar told Luke Skywalker that Ies had developed the Intellex IV droid brain, a complex device which held an R2-series memory bank. At the time Luke was attempting to discover what memories of the beginning of the Great Jedi Purge his droid R2-D2 could reveal. It was Rar's hope that Luke would assume his wife had killed his mother, Padmé Amidala.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/The_galaxy/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Beda_Ies",
  "/wiki/Eremay_Ies",
  "/wiki/Death/Legends",
  "/wiki/Raynar_Thul",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Joiner",
  "/wiki/Killik/Legends",
  "/wiki/Gorog",
  "/wiki/Alema_Rar",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/R2-series_astromech_droid",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Dark_Nest_II:_The_Unseen_Queen",
  "/wiki/Dark_Nest_III:_The_Swarm_War",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}