{
 "name": "Daxtorn_Lethos",
 "display_name": "Daxtorn Lethos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "various criminal organizations",
      "freelance"
     ]
    }
   ]
  }
 ],
 "content": "Daxtorn Lethos was a cunning bounty hunter who used an advanced holographic belt to capture his marks. He had combed-back black hair and sported a mustache and a goatee. He was the owner of the Gorgon.\nLethos attended an Imperial academy, where he acquired starship-operation skills. A year prior to graduation, he disappeared from the academy without a trace, leading his former instructors to think that he found the learning methods to be beneath his intelligence and capabilities.\nHaving left the academy, he took to smuggling and specialized in running illegal high technologies for various criminal and illegal organizations. He later made a career move and took up bounty hunting. He used his advanced holographic belt to create holographic disguises to trick his marks into allowing themselves to be captured. While using all sorts of humanoid forms, he preferred to disguise himself as handsome young Human males.\nHe once almost succeeded in capturing a group of adventurers in Echnos City, only to see them escape very narrowly. He would later clash with them several times.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Multispectrum_disguise_suite",
  "/wiki/Gorgon_(INT-66)",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Echnos_City",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Enemies_for_Life",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/Introductory_Adventure_Game",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}