{
 "name": "Dayla Kev",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Pre–0 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Scout Corps"
     ]
    }
   ]
  }
 ],
 "content": "Dayla Kev was a female Human mission commander with the Galactic Scout Corps in c. 40 BBY. She was believed to have been killed by a gasnit on an uncharted jungle planet, when a member of her team, Milac Troper returned with that report. The report stated that Kev and her lieutenant, Hereven, were killed, as Troper had fled, leaving them to die. Hereven had tried to rescue Kev and both scouts ended up hiding for more than six months in the caverns located beneath the planet's surface.\nDuring their confinement, the close quarters led to Kev and Hereven falling in love. However, Hereven was killed during a hunting mission. Later, Dayla discovered that she was pregnant with Hereven's child. After giving birth to the boy, Dayla named him \"Hereven,\" in honor of his father. They lived together in hiding for fifteen years, where they discovered that they had a connection to the Force.\nThe two were eventually rescued by a group of Wookiee explorers, who tried to sell them into slavery. Through using subtle manipulations of the Force, Dayla was able to convince the Wookiees to let them go free. She also convinced the Wookiees to join her in forming a safari-hosting business on the planet. She changed her name to \"Lady Ahrkan\", and made a small fortune in the height of the New Order.\nKev never forgot Milac Troper, or forgave him for leaving her. Eventually, though, she met up with Captain Roogak of the Ithorian herdship Galactic Horizon. She earned his trust, though it cost her almost everything she had. However, her desire to maintain the relationship paid off when her son, Hereven, discovered that Troper was going to be aboard the Galactic Horizon to negotiate a peace treaty. Kev called in favors owed to her by Captain Roogak and arranged to have several gasnits placed aboard the herdship's ecosystem. Her plans to exact revenge on Troper were thwarted when she encountered the team of freelance mercenaries Troper had hired to protect himself. Kev and Hereven were thus arrested.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Scout_Corps",
  "/wiki/40_BBY/Legends",
  "/wiki/Gasnit",
  "/wiki/Planet/Legends",
  "/wiki/Milac_Troper",
  "/wiki/Lieutenant/Legends",
  "/wiki/Hereven",
  "/wiki/Death/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Hereven_Kev",
  "/wiki/Standard_year/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Roogak",
  "/wiki/Ithorian/Legends",
  "/wiki/Ithorian_Herdship/Legends",
  "/wiki/Galactic_Horizon",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Welcome_to_the_Jungle",
  "/wiki/Star_Wars_Gamer_6",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}