{
 "name": "Daz_Crano",
 "display_name": "Daz Crano",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Resistance Starfighter Corps",
      "Resistance Starfighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "Daz Crano was a Nautolan female who served as a pilot in the Resistance. Crano assisted the Millennium Falcon in landing on Kashyyyk during First Order occupation of the planet.\nDuring the First Order-Resistance War, Daz accompanied the Millennium Falcon to Kashyyyk in her X-wing to assist in disrupting the First Order's operations on the planet. Daz's friend Beaumont Kin, who was on board the Falcon along with Chewbacca, Nien Nunb, and the porg Terbus, told her about the history of Kashyyyk as they fought through the First Order's blockade, with Daz interjecting that he ought to focus instead on not getting blasted. Daz and the Millennium Falcon successfully landed on the planet, although Daz's ship took some minor damage.\nShortly after they landed, another Wookiee told Chewbacca something that appeared to upset him, although neither Daz nor Beaumont knew enough Shyriiwook to understand what it was. Chewbacca then ran off into the forest with Terbus, leaving Daz and Beaumont behind.\nDaz, Beaumont, and Nien realized that with Resistance reinforcements being held back by the First Order's blockade, it was up to them to help Chewbacca, although Beaumont insisted that the Wookiee could take care of himself. Daz got back into her X-wing and flew over the forest to try to spot Chewbacca, while the other Resistance troops joined some Wookiees in searching on foot. Chewbacca spotted Daz's ship flying overhead and tried to get her attention, which unfortunately alerted some nearby stormtroopers to his presence.\nDaz didn't see Chewbacca, but a porg which had snuck onto her ship did, and managed to communicate to her that it had spotted something. Beaumont expressed doubt that the porg actually saw anything useful, but Daz decided to check again regardless. The Resistance fighters and Wookiees doubled back as well, and successfully aided Chewbacca in freeing some Wookiees who had been captured by the First Order. When talking to Beaumont after they regrouped, Daz said the experience reinforced her belief that everyone in the galaxy needed to work together to fight the First Order.\nA Nautolan female, Daz had green skin and large black eyes. The tendrils on her head were a darker shade of green. She believed strongly in the goals of the Resistance. While she had a sense of humor, she disapproved of joking around in serious situations.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Daz_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Nautolan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Resistance_Starfighter_Corps",
  "/wiki/Resistance_pilot",
  "/wiki/Millennium_Falcon",
  "/wiki/Kashyyyk",
  "/wiki/First_Order",
  "/wiki/Blockade_of_Kashyyyk",
  "/wiki/Planet",
  "/wiki/First_Order-Resistance_War",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Beaumont_Kin",
  "/wiki/Chewbacca",
  "/wiki/Nien_Nunb",
  "/wiki/Porg",
  "/wiki/Terbus",
  "/wiki/Blockade",
  "/wiki/Starship",
  "/wiki/Shyriiwook",
  "/wiki/Black_Forest",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Galaxy",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Ghosts_of_Kashyyyk,_Part_1",
  "/wiki/Star_Wars_Adventures_(2017)_27",
  "/wiki/Ghosts_of_Kashyyyk,_Part_2",
  "/wiki/Star_Wars_Adventures_(2017)_28",
  "/wiki/Ghosts_of_Kashyyyk,_Part_3",
  "/wiki/Star_Wars_Adventures_(2017)_29"
 ]
}