{
 "name": "Dazh_Ranos",
 "display_name": "Dazh Ranos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Eternal Alliance",
      "Force Enclave",
      "Force Enclave",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jedi Master Dazh Ranos was a female force-sensitive Chiss active during the war against Zakuul. Hoping to assist the fight against the Eternal Empire, Ranos joined the Commander's Alliance.\nThroughout her time within the Jedi Order, Jedi Master Dazh Ranos never felt like fitting in. From the very beginning, she disliked answering to the Jedi Council. The Chiss had a critical view of the Council's actions, considering them stubborn and too traditional. Ranos believed their use of the same tactics in any fight ultimately lead to their loss against the Eternal Empire.\nDespite warnings that her path could lead her to the dark side of the Force, Ranos broke ties with the Jedi Order and left Tython to walk her own path and follow the will of the Force. Dazh Ranos believed she would be better off on her own and set off for the far reaches of the known galaxy, away from the Core Worlds. She traveled the frontier and helped ordinary, everyday people with the intention of avoiding all the politics and bureaucracy.\nDuring and after the conflict with the Eternal Empire, Ranos had little contact with the Jedi Council, for they considered her to be a rogue agent and an embarrassment. By the time the news of the war reached her at the edges of space, the Council had already gone into hiding. She openly revealed her indifference regarding the fate of the Council, uncaring whether they kept holding secret meetings or were all dead already. By now, she considered the Eternal Alliance a lot more important than the Jedi Order ever was. She believed that the Alliance Commander's actions affected trillions of lives in the galaxy for better or for worse and that joining the Alliance would let her accomplish more than she ever could have done on her own.\nEventually, Ranos was accepted into the Alliance but wondered still what her former Master would have had to say about it. The Chiss remarked to the Alliance Commander that it would be an adjustment for her to take orders from someone else again.\nRanos was a very outspoken and critical person which made her quite unpopular within the Jedi Order. She disliked meditating in the Jedi Temple on Tython all day, and had no interest in the grand scheme of politics and bureaucracy, considering it more important to help the people who lived outside the Core Worlds. The Chiss considered herself quite independent and struggled with taking orders from anybody but herself. Master Ranos also believed that the dark side came from putting oneself before others and that true servants of the Force were automatically servants of the light. Dazh Ranos was also very proud of her skill with the lightsaber.\nRanos wielded two metallic vented Crossguard lightsabers powered by blue lightsaber crystals.\nMaster Ranos debuted in the 2016 expansion Knights of the Eternal Throne for the Star Wars: The Old Republic massively multiplayer online roleplaying video game. She was only available to players who achieved at least the \"Eternal\" tier during the \"Dark vs. Light\" event in the fall of 2016. Ranos has since been made made unlockable for all players as part of Galactic Season 1, following the release of Update 6.3 \"The Dark Descent\".\nIf the player is playing as Jedi Knight in Star Wars: The Old Republic, Ranos reveals that she also came across Kira Carsen during a guerrilla attack on a remote Zakuulian outpost but that the rebels were captured and killed by Arcann. The whereabouts of Kira were unknown to Ranos but she remarked that Kira speaking highly of the Alliance Commander was partly the reason why Ranos joined the Eternal Alliance. Ranos also revealed information regarding Scourge but deemed the entire story about him more a myth-enshrouded tale to teach morality.\nIf the player is playing as Sith Warrior, Ranos reveals information regarding Jaesa Willsaam, depending whether Jaesa is affiliated with the light or dark side of the Force.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Chiss/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Eternal_Alliance",
  "/wiki/Force_Enclave",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/War_against_Zakuul",
  "/wiki/Eternal_Empire",
  "/wiki/Alliance_Commander",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Tython/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Politics/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Meditation/Legends",
  "/wiki/Jedi_Temple_(Tython)/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Crossguard_lightsaber/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/2016",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Kira_Carsen",
  "/wiki/Zakuul",
  "/wiki/Arcann",
  "/wiki/Scourge",
  "/wiki/Sith_Warrior",
  "/wiki/Jaesa_Willsaam",
  "/wiki/Light_side_of_the_Force/Legends"
 ]
}