{
 "name": "Deacon",
 "display_name": "Deacon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 19 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Deacon  was a boyhood friend of Luke Skywalker who lived in Anchorhead on Tatooine.\nDeak was usually seen in the company of his friend Windy Starkiller, who he continually followed around Anchorhead. Another Tatooine acquaintance, Biggs Darklighter, once characterized Windy as \"a follower\" and called Deak \"a follower of a follower\".\nDeak and Windy were present when Luke was challenged to a speeder race by a local braggart, Gorm Maldorf, in The Cage. The boys warned Luke that Maldorf was dangerous, but he accepted the challenge. On the morning of the race, Gorm was found dead, strangled, in The Cage. After Deak and Windy helped him make his escape, Luke investigated the death and deduced that Gorm had been accidentally killed while trying to sabotage the race the night before.\nBy their late teens, the friends were part of a group of youths that included Biggs Darklighter, Janek \"Tank\" Sunber, Laze \"Fixer\" Loneozner, and his girlfriend Camie. The teens spent time hanging around at Tosche Station in Anchorhead. They flew their T-16 skyhoppers in mock aerial duels and raced through twisting canyons near their homes.\nWhen Biggs was accepted into the Academy, the friends and other locals threw him a party that was broken up by attacking Sand People. Some time later, just before the Tantive IV was captured by Darth Vader above Tatooine, Luke challenged Fixer to a dangerous skyhopper race. Deak thought Luke had no chance of winning, and flew along with Fixer during the race. Deak last saw Luke on the morning Biggs confided in Luke about his plans to join the Rebel Alliance.\nDeak was played by Jay Benedict in A New Hope, appearing only in the Anchorhead scene which didn't make it into the final cut of the film. It's not obvious which of the two men is Deak and which is Windy. The scene was later included in the Blu-Ray release. In the radio drama he was voiced by David Paymer. He has a single line in the script, although in the scene as shot, this seems to have been extended into a brief background conversation between himself and Windy. On the other hand, although Luke mentions mock-dogfights with Deak in the script, this line does not appear in the cut footage, which fades into the scene on the next line.\n\"Deak Starkiller\" first appeared in the rough draft of Star Wars as the younger brother of Annikin Starkiller and son of Kane Starkiller; he is killed by a Sith in one of the opening scenes. In the first draft he was renamed Bink Valor, which was probably the origin of Jar Jar Binks's last name. Bink suffered the same fate, however. His more heroic turn was as a Captain of a Rebel freighter and Aquillian Ranger in the second draft. He is the older brother of Luke Starkiller, Windy and Biggs. It is Deak who is imprisoned by the Galactic Empire and must be freed in this version, not Leia. He becomes one of Luke's friends at the power station in the third draft, with Windy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Deak_(Skywalker%27s_friend)",
  "/wiki/Deacon",
  "/wiki/Tatooine/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Biggs_Darklighter/Legends",
  "/wiki/Star_Wars_(radio)",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Anchorhead/Legends",
  "/wiki/Windy_Starkiller",
  "/wiki/Star_Wars_Tales",
  "/wiki/Star_Wars_Tales_1",
  "/wiki/Star_Wars_Tales_20",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Canon",
  "/wiki/File:Deak_and_Windy_LS_Detective.jpg",
  "/wiki/Gorm_Maldorf",
  "/wiki/The_Cage",
  "/wiki/File:Deak_Galaxy_2.jpg",
  "/wiki/Janek_Sunber",
  "/wiki/Laze_Loneozner/Legends",
  "/wiki/Camie_Loneozner",
  "/wiki/Tosche_Station/Legends",
  "/wiki/T-16_skyhopper/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Tantive_IV/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/File:Tosche_Station_-_TMOSW.jpg",
  "/wiki/Jay_Benedict",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/David_Paymer",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/Annikin_Starkiller",
  "/wiki/Kane_Starkiller",
  "/wiki/Sith/Legends",
  "/wiki/The_Star_Wars:_First_Draft",
  "/wiki/Jar_Jar_Binks/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Aquillian_Ranger/Legends",
  "/wiki/Adventures_of_the_Starkiller,_Episode_I:_The_Star_Wars",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/File:Deak_and_Windy_-_Empire_8.jpg",
  "/wiki/Luke_Skywalker:_Detective",
  "/wiki/Empire_8",
  "/wiki/Star_Wars_Journal:_The_Fight_for_Justice",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/Jedi%27s_Honor",
  "/wiki/Rebel_Force:_Renegade",
  "/wiki/Star_Wars_(1977)_17",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/A_New_Hope:_The_Life_of_Luke_Skywalker",
  "/wiki/A_Guide_to_the_Star_Wars_Universe",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Insider",
  "/wiki/Anchorhead:_The_Lost_Scenes",
  "/wiki/Star_Wars_Insider_35",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2007_Topps_Star_Wars_30th_Anniversary",
  "/wiki/Star_Wars_Insider_94",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_radio_drama"
 ]
}