{
 "name": "Deadeye",
 "display_name": "Deadeye",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Khorm"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grand Army of the Republic",
      "44th Special Operations Division",
      "Devil Dogs",
      "44th Special Operations Division",
      "Devil Dogs",
      "Devil Dogs"
     ]
    }
   ]
  }
 ],
 "content": "\"Deadeye\" was the nickname of a clone cold assault trooper who served in the Devil Dogs unit of the Grand Army of the Republic's 44th Special Operations Division during the Clone Wars. Around 22 BBY, Deadeye fought in the Battle of Khorm, in which he was killed during an engagement with the Dark Acolyte Asajj Ventress and several BX-series droid commandos while on a mission to destroy a Confederate weather-control station.\n\"Deadeye\" was the nickname of one of the numerous clones of the Mandalorian bounty hunter Jango Fett created on the planet Kamino to fight in the ranks of the Grand Army of the Republic. During the Clone Wars, Deadeye served as a cold assault trooper in the 44th Special Operations Division's Devil Dogs unit under the command of Major Kendal Ozzel. Around 22 BBY, Deadeye participated in the Battle of Khorm, in which the Galactic Republic battled the Confederacy of Independent Systems for control of the valuable agrocite ore on the frozen planet Khorm. As part of a Republic advance force led by Jedi Generals Plo Koon, Kit Fisto, and Tauht, Deadeye and the Devil Dogs were able to land on the surface of Khorm before a storm in the planet's atmosphere blocked the way for reinforcements.\nThe Republic ground forces soon captured an agrocite processing facility and received intelligence from Republic Admiral Wieler about a Confederate starship effortlessly passing through an opening in the storm. Realizing that the storm had been manifested by a local weather-control station constructed by the Confederacy, Koon and Fisto took the Devil Dogs, including Deadeye, and set off on CK-6 swoops to destroy the station and make way for the Republic reinforcements. After making a brief stop to bury the dead bodies of several native Khormai in a village devastated by the storm, the Republic strike team proceeded to scale the nearby mountains on foot. There, they were ambushed by the Confederate Dark Acolyte Asajj Ventress.\nVentress engaged the two Jedi in battle, while her BX-series droid commandos emerged from the snow and attacked the clone troopers. After a brief duel with the Jedi, Ventress used the Force to bring an avalanche down upon the Republic forces. She then searched for any survivors and personally slew those she found before leaving the scene. Deadeye was among the casualties sustained in the encounter with Ventress and the battle droids. However, the Jedi had managed to create a Force bubble that protected them and several clone troopers, including Devil Dogs Captain Sharp, from the avalanche. After Ventress left, the remaining members of the Republic strike team continued on their mission, destroying the weather-control facility and allowing the Republic to win the battle.\nLike all clone troopers, Deadeye stood 1.83 meters tall.\nDeadeye first appeared in The Clone Wars 8, a 2009 comic book written by Henry Gilroy and Steven Melching, and illustrated by Scott Hepburn. The comic does not specify which one of the clone troopers accompanying Fisto and Koon is Deadeye.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Deadeye_(disambiguation)",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Khorm/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/44th_Special_Operations_Division",
  "/wiki/Devil_Dogs",
  "/wiki/Clone_cold_assault_trooper/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Battle_of_Khorm/Legends",
  "/wiki/Death/Legends",
  "/wiki/Dark_Acolyte/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/BX-series_droid_commando/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Weather-control_station",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Major/Legends",
  "/wiki/Kendal_Ozzel/Legends",
  "/wiki/Agrocite/Legends",
  "/wiki/Ore/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Tauht",
  "/wiki/Atmosphere/Legends",
  "/wiki/Agrocite_processing_facility",
  "/wiki/Admiral/Legends",
  "/wiki/Wieler",
  "/wiki/Trident_(starship)/Legends",
  "/wiki/CK-6_swoop_bike/Legends",
  "/wiki/Khormai/Legends",
  "/wiki/Mountain/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Water/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Protection_bubble",
  "/wiki/Trooper/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/Sharp",
  "/wiki/The_Clone_Wars_8",
  "/wiki/2009",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Henry_Gilroy",
  "/wiki/Steven_Melching",
  "/wiki/Scott_Hepburn",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_8",
  "/wiki/Senate_Spy",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/StarWars.com",
  "/wiki/Holocron_Heist",
  "/wiki/Star_Wars:_The_Clone_Wars:_In_Service_of_the_Republic",
  "/wiki/The_Clone_Wars_7",
  "/wiki/The_Clone_Wars_9"
 ]
}