{
 "name": "Dean Lado",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shesharile 5"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Spiders"
     ]
    }
   ]
  }
 ],
 "content": "Dean Lado was the leader of the Spiders swoop gang, which terrorized his home city of Gallisport, on Shesharile 5, during the height of the Galactic Civil War.\nLado made several alliances with other swoop gangs, such as the Raging Banthas, in an effort to destroy the Rabid Mynocks and gain control of the city. He also wanted to possess the Star Slinger swoop prototype, and did everything in his power to take the vehicle from Chop Harlison. In order to achieve this, Lado once kidnapped Chop's daughter, Jardra, and challenged Quayce to a race. If he won, Lado would obtain the Star Slinger and gain control of the Mynocks. If he lost, Quayce remained in command of the Mynocks and recovered Jardra. Lado tried every dirty trick in the book to eliminate Quayce, but she managed to counter his every move. During the race, Lado tried to lure Quayce into a repulsor minefield, hoping that setting off the mines as he passed through them would kill Quayce. Instead, Quayce threw a mag-grenade onto Lado's swoop. As he veered wildly to shake the grenade, Quayce roared into the lead and set off the minefield. The resulting explosions engulfed Lado and killed him. Unknown to Lado at the time, the mag-grenade was actually a dud.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Shesharile_5",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Spiders",
  "/wiki/Swoop_gang/Legends",
  "/wiki/City/Legends",
  "/wiki/Gallisport",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Raging_Banthas",
  "/wiki/Rabid_Mynocks",
  "/wiki/Star_Slinger",
  "/wiki/Swoop/Legends",
  "/wiki/Chop_Harlison",
  "/wiki/Jardra",
  "/wiki/Quayce",
  "/wiki/Repulsor_mine",
  "/wiki/Mag-grenade",
  "/wiki/Grenade/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Swoop_Gangs",
  "/wiki/Star_Wars_Adventure_Journal_6"
 ]
}