{
 "name": "Deathstick",
 "display_name": "Deathstick",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic lower part of the face"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nightsisters",
      "Crimson Dawn",
      "Kouhun"
     ]
    }
   ]
  }
 ],
 "content": "Deathstick was a female Dathomirian assassin and daughter of the Nightsister Shelish, active during the reign of the Galactic Empire. She originally started out as a street criminal, but once she became known for her skills as an assassin for the Crimson Dawn and Kouhun, few later sought an audience with her.\nDeathstick was a contributer to the rise of Crimson Dawn years after the death of its leader, former Sith Lord Maul, under the instruction of new Lady Qi'ra. Deathstick and her Kouhun joined the Uprising and helped fight the Empire in the Anoat sector of the galaxy.\nThe mysterious woman known as Deathstick was the daughter of Shelish, a Nightsister witch who had left her homeworld of Dathomir long before her people were slaughtered. As a child, Deathstick carried the weight of knowing that she was once part of something larger than herself that was taken away from her.\nGrowing up in the Anoat sector of the galaxy's Outer Rim Territories, Deathstick began her criminal career as a hired assassin. Through a series of spectacularly public murders of gang leaders, she ended up moving into the drug trade. At some point, she had a run-in with the Galactic Empire that cost her a great deal of her face, causing her to have an entire proshetic lower face. This prompted her to wear a mask that only left her eyes visible.\nBy the time of the Galactic Civil War, Deathstick was the leader of the Kouhun, a highly secretive and structured order of assassins based on Mataou. Under her leadership, the Kouhun murdered several high profile individuals in the sector, including the wife of Governor Ubrik Adelhard.\nSometime between 3 ABY and 4 ABY, Deathstick was hired by Lady Qi'ra of Crimson Dawn to join her as an assassin. She told Deathstick that Emperor Palpatine was behind the death of her people, and that by joining her she could see the Empire fall. She was tasked to hunt down the bounty hunters Beilert Valance and Dengar on Nar Shaddaa. While Valance conversed with arms dealer, Devono Vix on his knowledge about Crimson Dawn, Deathstick shot Vix's head off, killing him. She then shot Valance in the arm, wounding him and damaging his core.\nValance and Dengar managed to escape in a ship. They then thought they saw Deathstick aboard the ship, but they played it off as being nothing. However, Deathstick quickly tracked them to the hideout of Mama Stammoch and her crew. Upon reaching the hideout, she overheard Stammoch warn Valance and Dengar that the assassin would kill them all. When Dengar suggested that she was overreacting, Deathstick blew up the entrance to the hideout and assured Dengar that she wasn't. Upon entering the hideout, Deathstick and her droids laid waste to most of Stammoch's crew, forcing her, Valance and Dengar to make an escape. Throwing a thermal detonator, they managed to blow a hole through the wall and flee from the hideout in a landspeeder. The three of them were chased by Deathstick's droids, but they jumped out of the speeder as it crashed, getting the droids off their trail. However, Deathstick had still not lost her targets and kept an eye on them as she contacted Qi'ra. When she insisted on killing them, Qi'ra told her that herding them in the right direction was an important part of her plan. She then assured the assassin that she would get to kill them soon enough.\nDeathstick then travelled to Coronet City on the planet Corellia where she entered the Unbroken Clan safe house. She helped herself to the spice wine while waiting for Unbroken Clan General Vukorah to enter the room she was in. When Vukorah and her Mimbanese underling entered the room, Vukorah shot the Mimbanese with suspicion that he either sold her out or was incompetent. Deathstick gave Vukorah an invitation from the Crimson Dawn to the Auction for Han Solo, an auction for various crime syndicates to bid for the carbonated body of smuggler Han Solo. She then travelled to the city of Canto Bight on the planet Cantonica. She attacked Dengar and Valance who were looking for someone to tell them the location of the Auction for Han Solo. Deathstick took an emergency contact device and left. However, Dengar swiped a device off of her with the location of the auction.\nHeading to the ice planet of Jekara where the Crimson Dawn starship, the Vermillion was landed, Deathstick saved Dengar from a zugorak that was about to attack him. In exchange for saving him, Dengar gave Deathstick a drive with the location of Cadeliah on it.\nDeathstick then boarded the Vermillion, where she hid and watched as Gallin Crae, Just Lucky, and Ariole Yu engaged in combat. While Lucky pointed a sniper rifle at Crae, Deathstick threw projectiles containing a Dathomirian poison at Lucky, one slicing off part of his blaster. Deathstick leaped from the ceiling, shooting Yu and Lucky with her blaster rifle. She then had the two locked up in a cell, however they escaped with help from Doctor Aphra and Sana Starros. When the four entered the art gallery of the ship, they found Qi'ra and Margo talking. When Qi'ra left however, Deathstick leaped from the ceiling ready to attack. Lucky, Yu, Starros, and Aphra hid behind display cases in the gallery, as Deathstick shot at them. Deathstick then leaped from the ceiling, throwing the projectiles in Aphra and Lucky's direction. Aphra ran as Deathstick leaped in her direction and threw more, pinning Aphra to the wall by her clothes. Deathstick then put her knife coated with Dathomiriran poison to Aphra's throat. However, Yu and Starros began shooting at Deathstick, causing her to run. Noticing a thought dowser in the gallery, Aphra used her electro-tattoos to activate it. The device caused Deathstick and several other Crimson Dawn guards to stab themselves, giving time for the four to escape. However, Aphra and Starros abandoned Lucky and Yu. Deathstick and Crae, both wounded, stumbled into the hangar. Deathstick still questioned why she still couldn't kill them, when Qi'ra walked in and invited Lucky and Yu for a chat. Surviving the poison, Qi'ra briefed Deathstick and other Crimson Dawn members on the upcoming \"Reign.\" Ready for her next mission by Lady Qi'ra, Deathstick meditated privately.\nDeathstick contacted a member of Crimson Dawn and continued their plot to capture Cadeliah. The transmission was intercepted by a group of bounty hunters. Deathstick was later notified about the interception of transmissions and told the Crimson Dawn member to assume the bounty hunters know everything.\nLater on Deathstick went to meet Qi'ra for an assignment aboard the Vermillion, where she met Ochi briefly on her way to the meeting. The two showed mistrust against each other during the tense banter and Deathstick noted to herself afterwards that Ochi was a crazy bastard.\nShe then entered the offices to meet Qi'ra, Margo and Trinia who briefed her about the current war between the criminal syndicates in the galaxy. Qi'ra gave Deathstick a datacard that had information about her next target, who would be Cadeliah, taking refuge and hiding with the Rebel Alliance from the Imperials. The target surprised Deathstick and prompted Qi'ra to ask Deathstick if there was some kind of a problem with it, in which she finally answered that there is none as long as she gets her credits.\nDeathstick left the Vermillion and camped alone in the woods on her way to Cadeliah, examining her hologram from the datacard in the gloom of the evening. Sometime later Deathstick managed to find the location of the rebel base within Panisia in The Outer Rim Territories. She scouted the base from a distance with binoculars, searching for any signs of Cadeliah, finally finding her sitting idle in the open. Noting the large amount of rebels bustling within the base, Deathstick resorted to contact the Imperial Anti-Terrorism Watchline and reveal the location of the rebel base to the Imperials to cause a distraction and opportunity to reach Cadeliah in the ensuing chaos. She would then successfully capture Cadeliah, who tried to defend herself with a knife to no avail.\nDeathstick returned to the Vermillion with captured Cadeliah and handed her over to Qi'ra. Deathstick inquired in curiosity from her about what she would do to Cadeliah, in which Qi'ra answered that her job was to only deliver the girl to her and now on Cadeliah's fate would belong to Qi'ra.\nSeveral months into the Iron Blockade between 4 ABY and 5 ABY, Deathstick was introduced at the Shadow Market on Bespin, to the Smuggler, a young scoundrel from Burnin Konn who had forged an alliance with the Ivax Syndicate and the Noble Court-in-exile. Shortly thereafter, the Smuggler underwent and passed the initiation rites of the Kouhun. Although Deathstick did not think the scoundrel could embrace the Kouhun's philosophy, she nonetheless agreed to join the anti-Empire alliance, which came to be known as the Uprising. As their first major joint operation, the Nobles, the Syndicate and the Kouhun made plans to abduct Commander Bragh, leader of the deadly Imperial Purge Troopers. It was Deathstick who outlined the plan and provided some of her assassins.\nHowever, the planned ambush went awry as the Smuggler's sister Riley and the Ivax Syndicate sold out the Uprising and exposed their plan to the Imperials in hopes of having their death marks removed. In the ensuing fight on Anoat between the Uprising and the Imperials, many members of the Kouhun and other allies were captured, while Deathstick managed to escape and go into hiding. Soon after the incident she contacted the Smuggler through a communicator. As the Smuggler began to explain the unfortunate turn of events, she told him that if she wanted him dead, he would already be painfully and possibly hilariously dead. Deathstick then asked him if it was the Ivax Syndicate who betrayed them, in which the Smuggler responded that it did not matter and told Deathstick to leave Riley alone. Getting a sufficient enough confirmation out of the Smuggler, Deathstick ended the call abruptly with a goodbye.\nDeathstick would later appear suddenly in a communicator call between the Smuggler and Loathe when they both were in the middle of rescuing the members of the Uprising from The Crypt. Taking part in the rescue operation herself, she assigned Loathe to delay the Imperial forces as the prisoners made their escape, stating that no Kouhun should live to be captured and that Loathe's sacrifice would redeem the rest. Deathstick would then admit she was too quick to dismiss the Smuggler earlier, expressing her gratitude for saving the members of the Kouhun from The Crypts. Once the Smuggler objected about sacrificing Loathe, she told him that he was not of Kouhun and it was not his business to involve in their internal matters.\nDeathstick then contacted Riley and told her that her Kouhun were causing chaos within The Crypts and transmitted the location Loathe had acquired of Her Majesty's prison cell to Riley and the Smuggler for their rescue mission.\nSoon after the Uprising were successful in the rescue mission and partially successful in their original objective in taking out Commander Bragh, Deathstick was present during the meeting in Paradise Atrium between the members of the Uprising, including the Rebel Alliance led by Tam Bastion, to discuss about the future of their allied resistance movement and the looming threat of Adelhard's Imperial remnant. While the accusations flew around and the tensions between the groups ran high, she would joke during the meeting about giving into her temptations and try killing all the others, especially Voras, whose Ivax Syndicate was accused of betrayal by many others of the various groups present. The Smuggler managed to reason with the groups and defuse the situation, and when he demanded acknowledgement from everyone for why their Uprising had been successful in the first place, Deathstick gave a hint that their mutual co-operation within the Uprising was a key to success, prompting Smuggler to successfully persuade others to the cause. Alongside all the other groups present, Deathstick would then accept the invitation from the Smuggler to keep continuing their Uprising with him acting as the leader, stating only mysteriously that she and her Kouhun had their reasons to be in with the alliance.\nDeathstick was interested in powerful and capable people who had the knack for survival, though she occasionally liked toying with and taunt such individuals in humorous fashion. Sometimes she offered such individuals an opportunity to challenge themselves to go through the initiation ritual of Kouhun, observing their capabilities and potential.\nDeathstick killed, because after the massacre of her people, she felt alone and wanted other people to feel that way as well.\nDeathstick was impatient at times. When she was hired by Crimson Dawn, Deathstick asked Qi'ra why she couldn't just kill Beilert Valance and Dengar when she had a clear shot, questioning the plan. Deathstick did not like when operations or plans took too long, and would take control in order to speed it up. Deathstick was also very self-assured and amoral, and occasionally had a clipped manner of speech.\nDeathstick loved physical conflicts and believed in acting because it was possible, not for family or money. She also loved collecting exotics.\nDeathstick was talented in combat, knowing how to using exotic weaponry. She was also adept in unarmed hand-to-hand combat, being able to take on multiple opponents at the same time, and had extraordinary agility that made her able to evade blaster fire directed at her and do daring leaps and vaults. She favored the usage of shadows and guile when confronting her opponents, and her skills also extended to the usage of various gadgets, like droids and explosives.\nDeathstick was also a skilled infiltrator and tracker, capable of breaking into safe-houses and following her targets throughout the galaxy. She also had skills in leadership roles and in strategy, devising elaborate assassination plans and directing the members of the Kouhun during and outside their missions.\nDespite being a daughter of a Force-sensitive Dathomirian Nightsister, it was unclear whether or not Deathstick herself possessed any Force powers, although when the young Smuggler from Burnin Konn wished to pursue and learn dark side powers from Shelish, he found out that Deathstick had risen to her current mysterious power stature through her mother during the events of Iron Blockade.\nDeathstick had an arsenal of weaponry like various bladed melee and throwing weapons coated in Dathomirian poison, and a scoped blaster that shot debilitating harpoons capable of stunning or killing the target.\nDeathstick first appeared the 2015 mobile game, Star Wars: Uprising, developed by Kabam. She was voiced by actress Sara Cravens. In early concept art by Brian Matyas, Deathstick had green eyes and the right side of her face was prosthetic as well. Ethan Sacks, writer of Star Wars: Bounty Hunters comic books series, decided to bring Deathstick back because he felt that she had a backstory fitting nicely into what was happening with Crimson Dawn.\nUprising portrays Deathstick as a Dathomirian Zabrak. Multiple comics set earlier in the timeline, however, depict Deathstick as a human. This article assumes the original depiction is accurate.\nIn Crimson Reign 2, Qi'ra states that Deathstick and Shelish escaped the Battle of Dathomir. However, this contradicts Uprising and Dawn of Rebellion, which both state that Shelish left years before the event even happened. This article assumes that the latter mentioned sources are accurate.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Assassin",
  "/wiki/Death_stick",
  "/wiki/Template:Expand",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/Bounty_Hunters_15",
  "/wiki/Doctor_Aphra_(2020)_13",
  "/wiki/Doctor_Aphra_(2020)_15",
  "/wiki/Doctor_Aphra_(2020)_21",
  "/wiki/Bounty_Hunters_20",
  "/wiki/Crimson_Reign_2",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Crimson_Reign_5",
  "/wiki/Bounty_Hunters_21",
  "/wiki/Bounty_Hunters_22",
  "/wiki/Talk:Deathstick",
  "/wiki/Zabrak",
  "/wiki/Dathomirian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Nightsisters",
  "/wiki/Crimson_Dawn",
  "/wiki/Kouhun_(order)",
  "/wiki/Shelish",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Standard_year",
  "/wiki/Death",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Lord",
  "/wiki/Qi%27ra",
  "/wiki/Uprising",
  "/wiki/Anoat_sector",
  "/wiki/The_galaxy",
  "/wiki/Witch",
  "/wiki/Homeworld",
  "/wiki/Dathomir",
  "/wiki/Battle_of_Dathomir",
  "/wiki/Youngling",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Eye",
  "/wiki/Galactic_Civil_War",
  "/wiki/Mataou",
  "/wiki/Ubrik_Adelhard%27s_wife",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Bounty_hunter",
  "/wiki/Beilert_Valance",
  "/wiki/Dengar",
  "/wiki/Nar_Shaddaa",
  "/wiki/Devono_Vix",
  "/wiki/Limb",
  "/wiki/Starship",
  "/wiki/Mama_Stammoch",
  "/wiki/Thermal_detonator",
  "/wiki/Landspeeder",
  "/wiki/Coronet_City",
  "/wiki/Planet",
  "/wiki/Corellia",
  "/wiki/Unbroken_Clan_safe_house",
  "/wiki/Spice_wine",
  "/wiki/Unbroken_Clan",
  "/wiki/General",
  "/wiki/Vukorah",
  "/wiki/Mimbanese",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/City",
  "/wiki/Canto_Bight",
  "/wiki/Cantonica",
  "/wiki/Water",
  "/wiki/Jekara",
  "/wiki/Vermillion_(Crimson_Dawn)",
  "/wiki/Zugorak",
  "/wiki/Cadeliah",
  "/wiki/Gallin_Crae",
  "/wiki/Just_Lucky",
  "/wiki/Ariole_Yu",
  "/wiki/Sniper_rifle",
  "/wiki/Dathomirian_poison",
  "/wiki/Blaster_rifle",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Sana_Starros",
  "/wiki/Margo",
  "/wiki/Knife",
  "/wiki/Poison",
  "/wiki/Thought_dowser",
  "/wiki/Electro-tattoo",
  "/wiki/T%27onga%27s_crew",
  "/wiki/Ochi",
  "/wiki/Trinia",
  "/wiki/Syndicate_War",
  "/wiki/Datacard",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Panisia",
  "/wiki/Binoculars",
  "/wiki/Imperial_Anti-Terrorism_Watchline",
  "/wiki/Standard_month",
  "/wiki/Iron_Blockade",
  "/wiki/5_ABY",
  "/wiki/Shadow_Market",
  "/wiki/Bespin",
  "/wiki/The_Smuggler",
  "/wiki/Burnin_Konn",
  "/wiki/Ivax_Syndicate",
  "/wiki/Noble_Court",
  "/wiki/Commander",
  "/wiki/Bragh",
  "/wiki/Purge_Trooper_(Anoat_sector)",
  "/wiki/Riley",
  "/wiki/Death_mark",
  "/wiki/Anoat",
  "/wiki/Comlink",
  "/wiki/Loathe",
  "/wiki/The_Crypt_(prison)",
  "/wiki/Her_Majesty",
  "/wiki/Paradise_Atrium",
  "/wiki/Tam_Bastion",
  "/wiki/Ubrik_Adelhard%27s_Imperial_remnant",
  "/wiki/Voras",
  "/wiki/Weapon",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Blaster",
  "/wiki/Droid",
  "/wiki/Force-sensitive",
  "/wiki/Force_power",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Scope",
  "/wiki/2015",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Kabam",
  "/wiki/Sara_Cravens",
  "/wiki/Brian_Matyas",
  "/wiki/Ethan_Sacks",
  "/wiki/Star_Wars:_Bounty_Hunters",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Human",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Category:Images_of_Deathstick",
  "/wiki/Bounty_Hunters_13",
  "/wiki/Bounty_Hunters_14",
  "/wiki/Bounty_Hunters_16",
  "/wiki/Doctor_Aphra_(2020)_14",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Crimson_Reign_1",
  "/wiki/Doctor_Aphra_(2020)_16",
  "/wiki/Doctor_Aphra_(2020)_22",
  "/wiki/Bounty_Hunters_25",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_160",
  "/wiki/On_the_Go!",
  "/wiki/Star_Wars_Insider_161",
  "/wiki/The_Art_of_Star_Wars:_Uprising",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/Star_Wars_Inside_Intel:_The_Ascendant",
  "/wiki/June_19",
  "/wiki/2016",
  "/wiki/June_24",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/War_of_the_Bounty_Hunters_2",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_(2020)_14",
  "/wiki/October_24"
 ]
}