{
 "name": "Death_Star_prisoner",
 "display_name": "Death Star prisoner",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Death Star I"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "The Death Star prisoner was a male Human Jedi who had served the Jedi Order and the Galactic Republic during the Clone Wars. Surviving the end of the war, the disbanding of the Order, and the rise of the Galactic Empire, the Jedi was imprisoned aboard the first Death Star as of 0 BBY.\nA Force-sensitive Human, he was educated in the ways of the Force by the Jedi Order during the waning days of the Galactic Republic. Surviving the violence of the Clone Wars and the disbanding of the Jedi Order by the traitorous Supreme Chancellor Palpatine, the Jedi went to ground as the Galactic Empire initiated the Great Jedi Purge. Remaining hidden for nearly two decades, the Jedi was imprisoned by the Empire on the secret battlestation, the Death Star.\nShortly before the Battle of Yavin the Jedi rallied various prisoners of Detention Block 2180 including those members of the Rebel Alliance who had been captured during an operation on Naboo. The uprising saw prisoners escape from their cells and raid one of the station's armories. As various prisoners scattered throughout the station, the Jedi led a large group to Hangar 85G where they attempted to board a Sentinel-class landing craft and almost succeeded with less than 2 minutes before take-off. Their Jedi leader at last exposed himself in a desperate sprint toward the shuttle, but a moment later Imperial shock troopers of the 501st Legion were able to destroy the craft.\nThe frenzied Jedi, who had managed to obtain two green-bladed lightsabers, cut through all of the troopers that stepped into his path. After a horrific firefight, he was gunned down. As a result of the break, the troopers of the 501st were re-assigned in the search for the stolen Death Star plans.\nWhile unsuccessful, the uprising was actually a \"blessing in disguise.\" Despite the Jedi's death, several rebels escaped the prison and were able to smuggle the plans off the station and deliver them into the hands of the Rebel Alliance leadership. Not long after, the space station was blown up by Luke Skywalker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Tenn_Graneet",
  "/wiki/Jedi/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Battlestation",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Detention_Block_2180",
  "/wiki/Battle_of_Naboo_(Imperial_Period)",
  "/wiki/Naboo/Legends",
  "/wiki/Death_Star_Uprising",
  "/wiki/Hangar_85G",
  "/wiki/Sentinel-class_landing_craft/Legends",
  "/wiki/Imperial_shock_trooper/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Star_Wars:_Battlefront_II",
  "/wiki/Death_Star_(novel)"
 ]
}