{
 "name": "Deck Master (New Hope)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "The Deck Master or DM was a human male who worked as Deck Master at the hangar of the Rebel Alliance flagship New Hope around 1 BBY.\nThis human male had joined the Rebel Alliance by the beginning of the Civil War. By 1 BBY he had joined the forces of the New Hope being responsible for the hangar of the flagship.\nAccording to his duties, he worked in a zone of the hangar that is marked with yellow-and-black stripes. He usually operated a tall exoskeleton with a voice amplifier and handled various operations, such as a crane. He was used in seeing mysterious civilians being assigned ships by his superiors, with disastrous results. Often worrying about his inventory and repair work, he often criticised them.\nOne day he served a Mon Calamari, a Wookiee and a human who mostly requested for maintainance droids when finally Kyle Katarn approached him. Thinking that he also came for a droid, he warned him that they were unavailable, and as Katarn shouted something to him, he gripped him with his mechanical arms and lifted him up to his face's level. Katarn repeated that he came to select a ship, and while the Deck Master pointed out that not anyone can come and choose a ship as if it was a store, Katarn provided the requested data card, which he took with his actual hands and checked it with his mounted computer terminal. He gave him a printout with three hull numbers of the ships available to him. He returned Kyle to the ground, warning him that the Alliance would deduct the damages form his salary, and since he wasn't paid, from his skin.\nKatarn eventually chose the Moldy Crow and while preparing for a mission to Danuta, he \"borrowed\" dozens of tools, parts, and components from storerooms and surrounding ships; this was tolerated by the Deck Master, at Jan Ors's request, who was monitoring him.\nThe Deck Master was a man that often forgot or was too busy to shave, even for days and could be seen with some beard. Perhaps because of the working conditions and nature of his duties he had red eyes, visible under his bushy eyebrows.\nUsually he would be seen in the cage of his exoskeleton suit, doing various operations, like giving orders to crane operators. The suit was ten meters tall and his position was known by the title \"Deck Master\" written on the chest plate. It had a voice amplifier  so that his orders were heard over the hangar's noise. His roll cage also had a mounted computer terminal, with which he could keep a toll of ship assignments.\nHe didn't appreciate much of his superior officers, or as he called them the \"metal heads on the bridge\" as their thoughless decisions apparently brought trouble to his work and inventory; especially he didn't think that allowing non-pilots, such as agents and other civilians, should be assigned ships, as in the best of cases they returned them heavily damaged.\nThe Deck Master appears in the Dark Forces: Soldier for the Empire and its audio drama. Whereas in the novel he appears busy and operating an exoskeleton, in the audio drama he is only operating a noisy welding torch which he turns off before talking to Katarn. Wheras in the novel he says that the hangar is not a shop, in the audio drama he says it is not \"a Hutt's trophy room\". Instead of a datacard, Katarn provides a paper from Mon Mothma, and then, instead of directing him to three ships to choose from, he directly points him to the ship at slot number three, ensuring him that she could take off the ground. Upon seeing the Crow, Katarn expresses his skepticism that it could fly; the Deck Master admitted that it didn't look much.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/New_Hope",
  "/wiki/1_BBY/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Exoskeleton",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Datacard/Legends",
  "/wiki/Paper/Legends",
  "/wiki/Moldy_Crow/Legends",
  "/wiki/Mission_to_Danuta",
  "/wiki/Jan_Ors",
  "/wiki/Hair/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Agent/Legends",
  "/wiki/File:MoldyCrowFirstLook-DFSftE.ogg",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire_audio_drama",
  "/wiki/Welding_torch",
  "/wiki/Hutt/Legends",
  "/wiki/Mon_Mothma/Legends"
 ]
}