{
 "name": "Dedra Meero",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Dedra Meero was a human female who served as a lieutenant and supervisor in the Imperial Security Bureau. Following the incident on Ferrix, Meero participated in a meeting of ISB supervisors chaired by Major Partagaz. Diligent and methodical, she collected and analyzed symptoms across the galaxy that indicated an ostensibly more organized rebel effort than that her superiors expected.\nDuring the reign of the Galactic Empire, the human female Dedra Meero served with the military rank of lieutenant in the Imperial Security Bureau. She was an ISB Supervisor in charge of two sectors, including the locations of Steergard and Sev Tok. In 5 BBY, Meero attended a meeting in the ISB Central Office building on Coruscant chaired by Major Partagaz, in which different supervisors delivered informative reports from their respective sectors.\nAt the meeting, after berating Captain Lagret for the captain's mistakes, Partagaz opened a question to the room about the nature of the Imperial Security Bureau, to which Meero responded with the verbatim portion of the organization's mission statement. Partagaz emphasized her response and dismissed it as wrong. When Supervisor Blevin reported the status of the Ferrix incident and mentioned the theft of an Imperial N-S9 Starpath Unit, Meero used her datapad to inquire about it.\nFollowing the briefing, Meero was in her office with attendant Heert searching for more details on the theft of the Starpath unit, in order to establish jurisdiction over what happened on Ferrix. As the device had been stolen from the Steergard Naval Yard which was under her jurisdiction, Meero asked Heert to send a request to Blevin's office to get involved in the situation.\nWhen the request was denied, Meero went to Blevin's office to discuss the matter in person while her colleague indicated that he had work to do and suggested that she book an appointment. After Meero insisted on her jurisdiction in the matter due to the device being stolen from Steergard, Blevin argued that Ferrix was in his sector and accused the supervisor of wanting to use the moment to rise through the ranks. Meero claimed that she did not need his career advice and after Blevin twice denied her request, finding herself stuck, she decided to take the matter up with Major Partagaz.\nMeero and Blevin met in the meeting room and took their differences on the matter to Partagaz. When Meero brought up the theft of the Starpath unit and her claims of jurisdiction over the Ferrix incident, Blevin accused her of wanting to increase her portfolio and recommended that she take care of her own bases. An instinctive Meero asserted to Partagaz that there were multiple indications of organized insurgency regarding the theft of Imperial artifacts and coordinated attacks in multiple sectors, with three previous case files on her desk indicating a pattern. However, Partagaz disproved this hypothesis by requesting Meero provide factual evidence, which she could not. Partagaz thus recommended that both of them confine their activities within the sectors that were assigned to them.\nAfter dispatching Blevin, the major told Meero that he knew that working with Blevin could be a challenge, but nonetheless, his quarterly reports were delivered unlike Meero's. Partagaz told Meero that a high performance was expected from her for an exceptionally promising career within the bureau, advising Meero to minimize trifles and suggesting more work like her impressive number of detainees at Sev Tok, going so far as to say he may be sending her more work of that sort. After Partagaz left the room, Meero breathed a sigh of relief.\nMeero was walking through the corridors of the ISB headquarters when she saw Blevin walk by with a group of attendees. After discussing a matter regarding Hosnian Prime and its military component, Meero ordered Heert to leave as she did not know the time and it was late. The attendant refused to leave when Meero told him that she didn't know what she was doing about anything. Heert told her that she was following clues, listing events in different locations such as Kessel, Fondor, Jakku, Base Cay, and Steergard. However, Meero agreed with Major Partagaz, who believed that it was too scattered to be organized.\nHeert again rebutted and said that Meero did not believe that. The supervisor was fully aware that if she were on the other side, she would disperse the activities and never climb the same fence twice. When the attendant told her that it was too random to be random, Meero asked if they could check two more files each, to which Heert nodded. The supervisor then took a pill with a beverage and resumed her work.\nShortly thereafter, a Rebel infiltration team successfully stole approximately 80 million credits that were part of an entire sector's quarterly payroll from an Imperial installation on the planet Aldhani. As a result of the robbery, Major Partagaz summoned all the supervisors and their staff to the meeting room. Meero stood with the rest of the staff as the major ordered every Star Sector and Planetary Emergency Retaliation plan to be ready for presentation by midnight, and told them to inform their staff and families that nobody would be leaving.\nMeero prepared the next day, changing out of uniform, to be present for a briefing in the ISB meeting room chaired by Colonel Wullf Yularen. The reason for Yularen's presence was to inform the Imperial staff of the bureau of the countermeasures that would be taken throughout the galaxy in the wake of the Aldhani heist, mentioning, among other things, that he had spoken with Emperor Palpatine to ensure permanent leadership of the ISB in the matter, providing full access to resources for both the Army and Navy. As well as calling an emergency session of the Imperial Senate to grant an amendment that would give full control over matters of surveillance, search and seizure.\nThe supervisor was not delighted with the new rules imposed by her superiors, as she considered that they were falling directly into the rebels' game by taking what happened in Aldhani as a simple robbery and not for what it really was: an announcement. Afterwards, Meero walked through the halls of the ISB to the datavault, at the time manned by attendant Felzonis to request a Multi-Sector Data Blend from two years earlier, which included a report of bases and repair facilities and missing item reports. When Felzonis asked the star system for which Meero wanted the report, she answered all star systems and that it be confidential exclusive to her and her office. Meero then left the datavault.\nLater, Meero was present at another meeting of ISB supervisors when Major Partagaz reprimanded Supervisor Lonni Jung for failing to keep pace with the neighboring sectors. Partagaz then proceeded to ask Supervisor Blevin if he was eager that morning. Blevin replied that he didn't have any good news to share either as he wanted to press charges against Meero. Hypothesizing that Meero's overreach on the matter at Ferrix compromised Imperial security, Partagaz asked Meero if she was okay with her integrity being questioned, to which Meero replied that she was interested in hearing what her fellow supervisor had to say about the matter.\nAfter a heated crossfire and Blevin's mention of unauthorized access to his sector records, Meero took pity on Partagaz and claimed that she used the Imperial Emergency Act to collect data on multiple sectors without official sanction. She then opened a question to the room as to whether they believed the Rebellion operated around the sector's boundaries, to which Lagret replied that those sectors were created by Partagaz. Meero countered that they were created simply as organizational principles and that the rebels didn't really care about those boundaries. When Partagaz questioned the relevance of his own work, Meero responded that systems change or die. The major requested that Meero elaborate her thesis and she replied that there was an organized rebel effort that was acquiring Imperial military components.\nMeero turned back to Blevin to point out that he knew that she had a report with the information ready to go and that his accusations were more self-preservation than a sense of urgency. Blevin then expressed that she was more urgent as a renegade intelligence with such a lax sense of rules. Partagaz highlighted his suggestion, mentioning Meero's dedication and reassigning the Morlana sector to her jurisdiction before ending the session. Meero walked past him to thank him, to which Partagaz replied to watch her back.\nSome time later, Meero sent her Attendants Heert and Corv to the Imperial Bureau of Standards to bring Syril Karn for interrogation at the ISB central office. When Karn revealed during interrogation that he was unable to read the Ferrix report before being dismissed from his job in the Morlana System, Meero and Heert had to leave to attend another meeting elsewhere in the building. As the pair left, Meero ordered Corv to give Karn a copy of the report to read.\nDuring this meeting, Meero requested additional resources to hunt down Cassian Jeron Andor, who had been identified as one of the two culprits of the Ferrix incident. Among the resources she was hoping to gain were a full planetary comnet, a full tech package fro the Ferrix garrison, Series Nine Spectrum surveillance, funding for local agents, and a Code Droid. Although Meero and her staff were unable to identify Luthen Rael, who they had codenamed \"Axis\" for his centrality in the plot, she was nonetheless determined to hunt him down. Later that day, the ISB officers returned to the interrogation room. Although the former Deputy Inspector believed he could identify Rael's voice if he heard it again, Meero determined that Karn's description of Rael was not of further use. As she turned to leave, Karn protested that he did well at his job and that he could be a valuable asset to her operations. However, she ordered him to forget that this had ever happened and left shortly thereafter, Heert falling in step behind her.\nAround a month later, Meero was present on Ferrix in the former hotel that had been converted into the headquarters for the Ferrix garrison. She was present for the torture of Salman Paak and Bix Caleen, alongside Prefect Vanis Tigo and an Doctor Gorst. Meero taunted Caleen during the interrogation, before the doctor forced her to listen to the harrowing cries of dying Dizonite children. After the torture, as she left the hotel, Meero ordered Captain Tigo to keep Caleen alive, due to her being a witness who could identify Axis. When asked about Salman Paak, Meero responded that she did not care what happened to him, to which Tigo replied that he wanted to hang the prisoner.\nUpon her return to Coruscant, Meero attended a meeting with Major Partagaz, bringing her ISB Attendants Heert and Corv to the meeting as well. She discussed the list of Imperial equipment that Caleen had given after interrogation, which contained a targeting unit that was recovered from a safehouse operated by a rebel cell associated with Maya Pei. Through Andor's return to Ferrix three days after the Aldhani heist, she was able to connect Axis to the events on Aldhani. When Heert presented statements from two soldiers at the Aldhani Garrison who believed Andor looked similar to one of the rebels. Partagaz responded that the amplified interest made the connection to Aldhani worth following up. Captain Lagret asked why Meero did not question Maarva Andor, to which she cunningly responded that she decided to wait and that she could be used as bait to lure Andor back to Ferrix.\nWhen arriving to work the next day, Meero was stopped on her way into the central officer building by Syril Karn, who thanked her, believing she had a role in his recent promotion. Meero responded dismissively, and then questioned why Syril was waiting outside of her workplace. Under the impression that Karn was stalking her, Meero threatened that if he continued to pursue this she would have him imprisoned on the Outer Rim. Upon entering her office, Supervisor Meero was met by Attendant Heert, who informed her that Imperial authorities had detained a rebel pilot using a stolen Imperial masking unit, and that Attendant Corv was checking if the unit was off of their list. Meero ordered her aide to send Doctor Gorst to interrogate the prisoner on the Destroyer above Steergard where he was being held. Heert responded that he had already sent out Gorst, and asked if she wanted to go as well. She replied that there was no time and dismissed her assistant from the room after congratulating him on his work.\nAfter having remotely interrogated the prisoner, Meero attended a small meeting with Partagaz, her attendant Heert, Lagret, and two of his attendants. During his interrogation, the prisoner claimed that he did not contact anyone during his escape attempt. Heert added that the masking unit had been stolen from the Imperial naval yard in Lozash the previous year. Supervisor Lonni Jung and his attendant entered the room, having arrived late due to being offsite. Partagaz informed them about the capture of the rebel pilot, who was part of Anto Kreegyr's rebel cell. The major informed Jung that he believed that Kreegyr was unaware of the pilot's capture, and that the prisoner had revealed a planned raid on the Spellhaus Imperial power station.\nWhen Jung warned that the pilot would be counted missing soon by not showing up on Kafrene, Lagret proposed destroying the ship and making it seem accidental. Meero proposed the idea of fouling the ship, damaging a mechanical component and planting the pilot's body in the cockpit. She suggested staging the accident quickly and allowing the ship to drift into traffic near Kafrene. Agreeing, Partagaz ordered her to make it top priority and to act carefully, leaving no trace. As Meero and Heert left the conference room, the major ordered the other Supervisors to schedule a meeting with Military Intelligence about the planned raid on Spellhaus.\nMeero was present in the conference room when Supervisor Lagret confirmed the trap set for Anto Kreegyr's men on Kafrene. Her assistant, Heert, then handed her a datapad where she read the situation report to Major Partagaz. Meero proceeded to mention the details of the supposed mechanical failure implanted. When Supervisor Lonni Jung suggested Partagaz go ahead with a routine inspection, assuming Kreegyr was watching their movements, Meero turned toward the exit with Heert following her.\nAt another time during that year, she was escorted by a pair of death troopers as she descended from a Lambda-class T-4a shuttle that had landed at an Imperial facility on a stormy night on an industrial world.\nAt another point, Meero surveyed a town on the planet Ferrix alongside other Imperial officers—Attendant Corv, Captain Vanis Tigo, and Lieutenant Keysax—in a rustic room. In the same room, she interrogated an individual caught in her schemes, questioning if they were her quarry or a saboteur. At yet another point, Meero led a pair of death troopers as she walked through a stormtrooper-occupied Ferrix town. The officer also walked through one of its alleyways, led by another individual and flanked by Imperial Army troopers.\nMeero was a human female with fair skin and blonde hair that she wore in a tight bun at the back of her head. Her face often displayed a measured but severe expression. An ambitious and relentless agent of the Imperial Security Bureau, Supervisor Meero was a devoted advocate for the organization who was determined to make her way up its male-dominated hierarchy. A ruthless and fiercely intelligent individual, she possessed an acute acumen regarding the rebellion, predicting their actions.\nMeero donned the signature white uniform of the Security Bureau along with black boots. She had three blue squares on her rank insignia plaque, as well as a pair of code cylinders. At times, Meero also fashioned a cream-white overcoat, a black kepi, and black gloves, in addition to her uniform. She traveled on an Lambda-class T-4a shuttle.\nPortrayed by Denise Gough, Dedra Meero was created as an antagonist for 2022 Andor television series. Gough found her character to be a sincerely devout believer in the Empire despite being a villain, portraying Meero as someone who felt her fellow Imperials were \"very mediocre.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Imperial_officer",
  "/wiki/Sith/Legends",
  "/wiki/Dedra",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Lieutenant",
  "/wiki/ISB_Supervisor",
  "/wiki/Ambush_on_Ferrix",
  "/wiki/Ferrix",
  "/wiki/Major",
  "/wiki/Partagaz",
  "/wiki/The_galaxy",
  "/wiki/File:ISBFullMeeting-Andor4.png",
  "/wiki/Imperial_Era",
  "/wiki/Military_rank",
  "/wiki/Sector",
  "/wiki/Steergard",
  "/wiki/Sev_Tok",
  "/wiki/5_BBY",
  "/wiki/ISB_Central_Office",
  "/wiki/Coruscant",
  "/wiki/Supervisor",
  "/wiki/File:SupervisorMeero-Andor4.png",
  "/wiki/Captain",
  "/wiki/Lagret",
  "/wiki/Blevin",
  "/wiki/Imperial_N-S9_Starpath_Unit",
  "/wiki/Datapad",
  "/wiki/File:MeeroHeert-Andor4.png",
  "/wiki/Dedra_Meero%27s_office",
  "/wiki/Aide",
  "/wiki/Heert",
  "/wiki/Steergard_Naval_Yard",
  "/wiki/Blevin%27s_office",
  "/wiki/File:ISBCrossfire-Andor4.png",
  "/wiki/File:DedraIsOnToSomething-Andor5.png",
  "/wiki/Hosnian_Prime",
  "/wiki/Kessel",
  "/wiki/Fondor",
  "/wiki/Jakku",
  "/wiki/Base_Cay",
  "/wiki/File:ISBEmergencyAssembly-Andor6.png",
  "/wiki/Aldhani_rebel_infiltration_team",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Credit",
  "/wiki/Aldhani_dam",
  "/wiki/Planet",
  "/wiki/Aldhani",
  "/wiki/File:MeeroYularen-Andor7.png",
  "/wiki/Colonel",
  "/wiki/Wullf_Yularen",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Imperial_Army",
  "/wiki/Imperial_Navy",
  "/wiki/Special_session_of_Congress",
  "/wiki/Imperial_Senate",
  "/wiki/File:Isb-datavault.png",
  "/wiki/ISB_datavault",
  "/wiki/Felzonis",
  "/wiki/Star_system",
  "/wiki/Lonni_Jung",
  "/wiki/File:RenegadeSupervisor-Andor7.png",
  "/wiki/Imperial_Emergency_Act",
  "/wiki/File:WellPlayed-Andor7.png",
  "/wiki/Free_Trade_sector",
  "/wiki/Corv",
  "/wiki/Imperial_Bureau_of_Standards",
  "/wiki/Syril_Karn",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Comnet",
  "/wiki/Ferrix_garrison",
  "/wiki/Luthen_Rael",
  "/wiki/Deputy_Inspector",
  "/wiki/Unidentified_hotel_(Ferrix)",
  "/wiki/Salman_Paak",
  "/wiki/Bix_Caleen",
  "/wiki/Prefect_(Galactic_Empire)",
  "/wiki/Vanis_Tigo",
  "/wiki/Doctor",
  "/wiki/Gorst",
  "/wiki/Death",
  "/wiki/Dizonite",
  "/wiki/File:HeertSpeaksUp-Andor9.png",
  "/wiki/Maya_Pei%27s_cell",
  "/wiki/Maya_Pei",
  "/wiki/Aldhani_Garrison",
  "/wiki/Maarva_Andor",
  "/wiki/File:NobodysListening-AndorS1E9.png",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Unidentified_rebel_pilot_(Anto_Kreegyr)",
  "/wiki/Destroyer",
  "/wiki/Anto_Kreegyr",
  "/wiki/Anto_Kreegyr%27s_group",
  "/wiki/Spellhaus",
  "/wiki/Ring_of_Kafrene",
  "/wiki/Imperial_Intelligence",
  "/wiki/File:ItsMajorPartagazWithNewCoat.png",
  "/wiki/Bodyguard",
  "/wiki/Death_trooper",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Local_day",
  "/wiki/City",
  "/wiki/Officer",
  "/wiki/Keysax",
  "/wiki/Stormtrooper",
  "/wiki/Imperial_Army_trooper",
  "/wiki/Hair",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Code_cylinder",
  "/wiki/Jacket",
  "/wiki/Imperial_kepi",
  "/wiki/Shuttle",
  "/wiki/File:Andor_Dedra_Meero_poster.png",
  "/wiki/Denise_Gough",
  "/wiki/2022",
  "/wiki/Category:Images_of_Dedra_Meero",
  "/wiki/Aldhani_(episode)",
  "/wiki/The_Axe_Forgets",
  "/wiki/The_Eye",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/One_Way_Out",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Databank_(website)",
  "/wiki/Kassa_(episode)",
  "/wiki/August_1",
  "/wiki/August_2",
  "/wiki/August_4"
 ]
}