{
 "name": "Dee%27Hars",
 "display_name": "Dee'Hars",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Dee'Hars was a male Bothan who made a living as a bounty hunter during the waning years of the Galactic Republic, working in conjunction with fellow bounty hunters Clargod, Kelyan and Kiimo. In about 21 BBY, the Dee'Hars and his team traveled to the city Gadrin on the planet Cularin, where they hoped to capture Mattenic and Kerkum, two former lieutenants of the deposed Oblee crime lord Nirama who had had a bounty placed on their heads by the Office of Peace and Security, a local law enforcement agency. However, the Heroes of Cularin, a group of freelance agents that operated in the Cularin system, were also looking for Mattenic and Kerkum, and the agents prevented Dee'Hars and the other bounty hunters from capturing the pair.\nA short time afterward, the Heroes of Cularin destroyed a spice mining operation that was ran by the Hutt Riboga on the planet Kemix, and the Hutt hired Dee'Hars, Clargod, Kelyan and Kiimo to bring the agents into a state of despair, then kill them. The bounty hunters placed explosives aboard a starship that the agents were traveling on and then detonated the devices, which brought the agent's vessel out of hyperspace and caused it to crash on the planet Holador. The bounty hunters then landed on the world and set up a number of traps, to sap the morale of the agents in preparation for Riboga's planned execution of the agents. However, Dee'Hars suspected that the agents would survive all of the traps set up by his fellow bounty hunters, so he set up an elaborate final trap for them, in which he planned to use energy shields to restrict their movements. However, despite Dee'Hars' efforts, the agents defeated and captured him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Clargod",
  "/wiki/Kelyan",
  "/wiki/Kiimo",
  "/wiki/21_BBY/Legends",
  "/wiki/City/Legends",
  "/wiki/Gadrin",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Mattenic",
  "/wiki/Kerkum",
  "/wiki/Lieutenant/Legends",
  "/wiki/Oblee",
  "/wiki/Crime_lord/Legends",
  "/wiki/Nirama",
  "/wiki/Office_of_Peace_and_Security",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Cularin_system",
  "/wiki/Spice/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Riboga",
  "/wiki/Kemix",
  "/wiki/Death/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Holador",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Preemptive_Strike",
  "/wiki/Counterstrike_(Living_Force)",
  "/wiki/Strike_III"
 ]
}