{
 "name": "Dee-Lynn_Cance",
 "display_name": "Dee-Lynn Cance",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Dee-Lynn Cance was a male Cerean Jedi Knight who served the Jedi Order and the Galactic Republic as a Consular. After leaving the Order, Cance retired to Cularin to live out the rest of his life as a philosopher. During his stay there, he founded the Blue Star Centre.\nA Force-sensitive, Dee-Lyn Cance was instructed in the ways of the Force by the Jedi Order. After passing his Trials of Knighthood and obtaining the rank of Jedi Knight, Cance study independently and pursued the path of the Jedi Consular. After some time though, Cance became tired of the always active lifestyle of the Jedi and found it incompatible with his philosophical views. Therefore, Cance opted to leave the Order voluntarily around 135 BBY, renouncing his rank and turning over his lightsaber to the Jedi High Council.\nRetiring to the planet Cularin, Cance took up residency in the city of Gadrin where he founded the Blue Star Centre. The Centre, effectively a meditative retreat, became a place of study open to philosophers from across the Cularin system. Erected on a series of islands in a vast lake, the Centre flourished and became a place of learning for Force-sensitives, Jedi, and non-Force users alike. Upon his death, Cance was laid to rest in a tomb within the Centre's library. Hand-written text recovered from Cance's study would go on to be regarded as the most precious documents in the Centre's collection of philosophy.\nOn page 13 of Operation Blue Star, Cance's name is misspelled as Dee-lyn Cance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Consular",
  "/wiki/Cularin/Legends",
  "/wiki/Blue_Star_Centre",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/135_BBY",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Gadrin",
  "/wiki/Cularin_system",
  "/wiki/Operation_Blue_Star"
 ]
}