{
 "name": "Deel_Draav",
 "display_name": "Deel Draav",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kor Vella"
     ]
    }
   ]
  }
 ],
 "content": "Deel Draav was a male Human politician on the planet Corellia during the Galactic Civil War. He was the mayor of Kor Vella until he was murdered by the Chirq Council in 1 ABY.\nBefore the Battle of Yavin, Draav became a politician and ran for the office of mayor of Kor Vella. His primary opponent during his last mayoral election was Hershel Sheridan. The election was marred by the foul tactics used by both sides. Draav won in the end, tough not by much.\nIn 1 ABY, the Chirq Council—a large Corellian criminal organization with big expansion plans—sent him a package with bribe money. A note promised future payments if the mayor did as he was told, but also threatened him if he disobeyed. The mayor never transferred the money into his account. In the following time, he received several messages that threatened him. The unknown sender insisted that Draav relinquished his office or suffer the consequences. Draav didn't give in.\nThe Chirq Vouncil finally decided to murder Draav. It was pure luck that he wasn't killed during this first attempt. The mayor had dropped his fork and bent over to retrieve it just as the first shot was fired. By the time the second shot rang out, the mayor was already safely under cover. CorSec immediately began investigating the incident. Lieutenant Lon Cope enlisted the services of an independent agent that had already helped CorSec solve several cases to find the assassin. The mayor told the agent about the threatening messages he had received at his office, but didn't mention the bribe money. The adventurer tracked the messages to an abandoned bunker where evidence was found that seemed to prove that his opponent Hershel Sheridan had been behind the assassination attempt. Sheridan's body was found soon after, he had apparently killed himself. The case seemed to be solved.\nA short time later, however, someone tried to kill the mayor again. And this time, they succeeded, Draav was found dead. The following investigations revealed that Draav had been killed by the Chirq Council that wanted to make it look like his opponent Sheridan was behind the crime.\nWhen Draav ran for the office of mayor of Kor Vella, he used foul tactics to beat his opponent. But when the Chirq Council tried to bribe him to do their bidding, Draav didn't take their money and refused to follow their orders.\nWhen the Chirq council tried to murder him, Draav only escaped death by pure chance. He had never experienced anything like that before, but stayed calm. He told the CorSec agent investigating the case that it wasn't worth getting all worked up over. Draav considered it to be part of the job as mayor of a big Corellian city.\nDeel Draav was a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies, prior to its closure on December 15, 2011. Deel Draav was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006. He could be found in the mayor's office in Kor Vella on Corellia, but his room was only accessible during this quest. The player was asked by Lon Cope to investigate the murder attempt, starting with a short conversation with Draav. A few short quests later, the player received a message from Cope that Draav has been murdered and to investigate the murder. This eventually leads to the discovery of the Chirq Council and CorSec operations to eliminate the organization. These quests were part of the Legacy quest, the longest quest line of the game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Kor_Vella/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Lon_Cope",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Politics",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Mayor/Legends",
  "/wiki/Chirq_Council",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Hershel_Sheridan",
  "/wiki/Corellian_Security_Force",
  "/wiki/Mayor%27s_Office",
  "/wiki/Abandoned_Bunker",
  "/wiki/Sony",
  "/wiki/December_15",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/Template:SWGTCG",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}