{
 "name": "Deenlark",
 "display_name": "Deenlark",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Royal Imperial Academy",
      "Royal Imperial Academy"
     ]
    }
   ]
  }
 ],
 "content": "Deenlark was a male Commandant and President of the Royal Imperial Academy on Coruscant during the Age of the Empire. As a human hailing from the Core Worlds, Deenlark despised aliens and regarded people from Wild Space as \"backward yokels.\" Deenlark had links to several prominent Coruscanti families that served as the Academy's benefactors. In the years leading up to the Galactic Civil War, Deenlark urged his Imperial cadets to put their allegiance to the Galactic Empire over their loyalties to their homeworlds and families. Several of Deenlark's students later went on to serve in the Imperial Navy including Grand Admiral Thrawn, Eli Vanto, Thane Kyrell, and Ciena Ree.\nDuring the early years of the reign of the Galactic Empire, Deenlark served as the Commandant and President of the prestigious Royal Imperial Academy on the Imperial capital Coruscant. The Academy supplied cadets to the Imperial Navy. He gave a hostile reception to the Chiss warrior Thrawn and the Wild Space cadet Eli Vanto, who served as Thrawn's translator. Deenlark asked if their assignment was Admiral Foss's idea of a joke. When Vanto replied that the Emperor Palpatine had sent them, Deenlark mocked the Wild Spacer about having complicated words like \"rhetorical.\"\nAfter deriding Thrawn for being an \"alien\", Deenlark told Thrawn that he was lucky that the Emperor had taken a fancy to him. Deenlark then informed Thrawn that Foss had assigned him to an orientation course to acquaint the Chiss officer with Imperial procedure, equipment, and terminology. While this course normally took six months, Vanto was due to graduate in three months before commissioning. He gave Thrawn three months to complete the course and warned him that failure would get him kicked out of the course. When Thrawn replied that the Emperor would disagree, Deenlark responded that the Emperor had charged the Imperial Academies with producing officers worthy of Imperial service.\nBefore dismissing the pair, Deenlark informed Thrawn that Foss had assigned him the rank of lieutenant and handed him a lieutenant's rank insignia plaque. Deenlark then assigned a mouse droid to lead Thrawn and Vanto to their quarters at Barracks Two. Despite the hostility and snobbishness of the predominantly Core Worlds student body, Thrawn and Vanto excelled in their Academy studies. After Thrawn bested Spenc Orbar and Rosita Turuy in a game of cards, the two cadets hired three of their mates to attack Thrawn and Vanto.\nThrawn and Vanto reported the incident to Deenlark. Despite Vanto and Thrawn presenting evidence that Orbar and Turuy had used comlinks to contact the assailants, Deenlark was reluctant to take disciplinary action against the ringleaders since Orbar's family dominated Coruscanti society. Realizing that Deenlark was not interested in justice, Thrawn instead proposed transferring the three assailants to the Skystrike Academy. Thrawn argued that the attackers displayed the aptitude and aura necessary for starfighter pilots. While the assailants would not see it as a punishment, Thrawn reasoned that their abrupt disappearance would startle Orbar and Turuy and convince them to behave. Since this would avoid antagonizing the cadets' parents or organizing a court-martial, Deenlark agreed to Thrawn's plan.\nAfter departing Deenlark's office, Thrawn recalled that he had seen a flatsculp on the left side wall of Deenlark's office. Vanto recalled that the flatsculp depicted a warship sailing on ocean waves. Thrawn concluded that the flatsculp was gift from a powerful Coruscanti family. Eli deduced that the Royal Imperial Academy was beholden to these families which meant that it was in Deenlark's interests to avoid a public confrontation. Despite Deenlark's disdain for Thrawn and Vanto, two cadets graduated from the Royal Imperial Academy second and third place. Thrawn would later become a Grand Admiral in the Imperial Navy while Eli became a Lieutenant Commander who served as the Empire's attache to the Chiss Ascendancy.\nAbout four years before the Battle of Yavin, Deenlark presided over a welcoming ceremony that was attended by 8,000 cadets from all over the galaxy. Among the cadets were the cadets Thane Kyrell and Ciena Ree, who had come from the Outer Rim world of Jelucan. During the ceremony, Deenlark delivered a speech urging the cadets to think of themselves as citizens and soldiers of the Empire. He also urged the cadets to put their loyalty to the Empire above their allegiances to their homeworlds. He also urged the cadets to put the Empire over their families and compatriots. Despite Deenlark's words, Ciena and Thane resolved to continue their friendship.\nEventually the Academy's Office of Student Outcomes grew concerned about the close relationship between Ciena and Thane. They sabotaged Thane's TIE fighter's laser cannon and planted evidence implicating Ciena. When Commander Harn sent Ciena to Deenlark's office, Deenlark disbelieved Ciena's protestations of innocence and claimed that Thane was her only competitor for the top rank in their class. Shortly later, Harn arrived in his office with the cadet Jude Edivon, who presented evidence that the data logs had been tampered with.\nDeenlark refused to believe Jude's theory and demanded evidence. Jude then suggested that Thane had staged the incident in order to tarnish Ciena. Deenlark then summoned Thane to his office and proceeded to give the two cadets a \"dressing down.\" Deenlark told the two cadets that the first layer of data suggested that Ciena was the culprit while the second layer implicated Thane. When Thane protested his innocence, Deenlark harshly responded that his specialists could not determine which was the falsified layer of data. Since he could not determine who was the culprit, Deenlark decided to punish the cadets by failing their laser cannon assignment.\nWhile such a violation would merit a disciplinary hearing and potential expulsions, Deenlark decided to instead show \"grace\" to the two aspiring pilots by giving them a second chance. He allowed them to continue as cadets but warned that any future incidents would lead to immediate and permanent expulsion. Thane and Ciena accepted Deenlark's chastisement but resolved to clear their names. Jude later uncovered evidence that the incident had been perpetrated by the Office of Student Outcomes. While Thane wanted to clear their names, Ciena refused to fight against their benefactors. This dispute strained their relationship for the next two and a half years. Thane and Ciena reconciled prior to their graduation.\nDeenlark was a male human who was very tall and had bushy eyebrows. He served as the Commandant and President of the Royal Imperial Academy. Hailing from the Core Worlds, Deenlark despised aliens like Thrawn and regarded people from Wild Space such as Eli Vanto as backwater yokels. Since the Royal Imperial Academy was beholden to several wealthy Coruscant families, he was unwilling to take disciplinary action against three Core World cadets who assaulted Thrawn. However, Thrawn managed to appeal to Deenlark's self-interest by convincing him to send the troublesome cadets to the Skystrike Academy. Deenlark was known to keep a flatsculp of a sailing ship in his office, which was a gift from a prominent Coruscanti family.\nHe believed that Imperial cadets should abandon local familial and planetary loyalties in favor of pledging their full allegiance to the Galactic Empire. Deenlark was unsympathetic to Thane and Ciena and suspected that one of them had perpetrated the \"laser cannon incident.\" While Deenlark recognized that the two were gifted pilots, he warned that further incidents would lead to expulsion.\nDeenlark first appeared as a supporting character in the novel Lost Stars, which was written by Claudia Gray and released in 2015. He later appeared as a supporting character in Timothy Zahn's 2017 novel Thrawn, which serves as a canon origins story of the eponymous character. While Deenlark's species is not identified in the Lost Stars, the Thrawn novel heavily implied that he was human, based on his disdain for aliens. Deenlark was confirmed to be human in the Lost Stars webcomic.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Royal_Imperial_Academy",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Commandant",
  "/wiki/Coruscant",
  "/wiki/Imperial_Era",
  "/wiki/Core_Worlds",
  "/wiki/Alien",
  "/wiki/Wild_Space",
  "/wiki/Coruscanti",
  "/wiki/Galactic_Civil_War",
  "/wiki/Imperial_cadet",
  "/wiki/Imperial_Navy",
  "/wiki/Grand_Admiral",
  "/wiki/Eli_N._Vanto",
  "/wiki/Thane_Kyrell",
  "/wiki/Ciena_Ree",
  "/wiki/Standard_year",
  "/wiki/Capital",
  "/wiki/Imperial_Academy",
  "/wiki/Chiss",
  "/wiki/Cadet",
  "/wiki/Translator",
  "/wiki/Admiral",
  "/wiki/Foss",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Xenophobia",
  "/wiki/Officer",
  "/wiki/Standard_month",
  "/wiki/Military_rank",
  "/wiki/Lieutenant",
  "/wiki/Rank_insignia_plaque",
  "/wiki/MSE-6_series_repair_droid",
  "/wiki/Barracks_Two",
  "/wiki/Spenc_Orbar",
  "/wiki/Rosita_Turuy",
  "/wiki/Comlink",
  "/wiki/Skystrike_Academy",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Parent",
  "/wiki/Court-martial",
  "/wiki/Deenlark%27s_office",
  "/wiki/Warship",
  "/wiki/Ocean",
  "/wiki/Lieutenant_Commander",
  "/wiki/Chiss_Ascendancy",
  "/wiki/4_BBY",
  "/wiki/Battle_of_Yavin",
  "/wiki/The_galaxy",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Jelucan",
  "/wiki/Soldier",
  "/wiki/Homeworld",
  "/wiki/Office_of_Student_Outcomes",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Laser_cannon",
  "/wiki/Commander",
  "/wiki/Harn_(Imperial)",
  "/wiki/Jude_Edivon",
  "/wiki/Laser",
  "/wiki/Cannon",
  "/wiki/Lost_Stars",
  "/wiki/Claudia_Gray",
  "/wiki/2015",
  "/wiki/Timothy_Zahn",
  "/wiki/2017",
  "/wiki/Thrawn_(novel)",
  "/wiki/Lost_Stars_(webcomic)",
  "/wiki/Thrawn_(audiobook)",
  "/wiki/Thrawn_1",
  "/wiki/Thrawn_2",
  "/wiki/Lost_Stars_(audiobook)",
  "/wiki/Dawn_of_Rebellion"
 ]
}