{
 "name": "Deeve",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Arporatal-Lanin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arpor-Lan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Task Force on Alliance Security",
      "Task Force on Alliance Security",
      "New Republic",
      "Bureau of Scouting and Exploration Services",
      "Bureau of Scouting and Exploration Services"
     ]
    }
   ]
  }
 ],
 "content": "Deeve was an Arpor-Lan scout who served the Rebel Alliance. Using skills he had learned on his native planet Arporatal-Lanin, Deeve became one of the most respected scouts in the Alliance after scouting Wild Space and the Unknown Regions, as well as exploring the planet Apliria—which later became a safe world. After being promoted to the rank of lieutenant, he helped to establish New Alderaan in 1 ABY, and he also became a member of the Task Force on Alliance Security.\nAfter the Battle of Endor, Deeve became a scout for the New Republic's Bureau of Scouting and Exploration Services. He traveled in the starship NRSS Founder along with fellow scouts Jarsa and Effcee on a mission to survey the planets of eight star systems, searching for a profitable mineral vein. The first four worlds they scouted lacked any interesting resources they could use, and Deeve found a tentacled being while on the fifth one.\nDeeve was a male Arpor-Lan native to the planet Arporatal-Lanin. As a child, Deeve suffered from several apprehensions, including acrophobia. While he was able to overcame his fear of heights, he still retained other phobias as an adult. Deeve learned scouting and tracking skills on Arporatal-Lanin and became a scout. He later joined the Alliance to Restore the Republic and helped to scout worlds in Wild Space and the Unknown Regions, looking for potential Alliance safe worlds. Deeve was a key part of the preliminary scouting of the planet Apliria, which became a safe world. The Arpor-Lan was considered to be one of the best scouts in the Alliance.\nIn 1 ABY, after being promoted to lieutenant, Deeve also helped Alliance Support Services establish New Alderaan. By 2 ABY, Deeve had become a member of the Task Force on Alliance Security. In that role, he wrote a report on the Shistavanen independent scout Yurdak Fav, mentioning that Fav was a potential threat to Rebel surveyors due to her penchant for following them during their reconnaissance missions. Deeve could not discover whether Fav had links with any enemy of the Alliance, but he knew she was not a member of the Alliance, and as a consequence she was compromising the Rebel safe worlds his colleagues were discovering. During his time in the Alliance, Deeve also worked with Lieutenant Commander Bakki Sourthol, Lieutenants Anson Blazer and Tura Raftican, and special agent Tay Vanis.\nAfter the Battle of Endor in 4 ABY, Deeve joined the Bureau of Scouting and Exploration Services, also known as the New Republic Scout Service. While doing so, he worked alongside the female Jarsa and the droid Effcee. Deeve disliked Effcee's warmhearted personality, and he vainly tried to reprogram this trait off of her. The three of them were assigned the starship NRSS Founder from the Outer Region Foxar Scout Base, and were sent to survey planets in eight different star systems, looking for valuable natural resources such as mineral veins. As long as they found at least one useful world, that discovery would cover their expenses and give them a profit on the mission. Once the survey was over, they intended to return to their starting point.\nThe crew of the Founder discovered no valuable resources in the first four planets they scouted. The fifth planet had a hostile but breathable atmosphere, and Deeve had to wear his protective gear before disembarking the ship to climb a mountain from which he could perform a more precise survey. After the climb, he contacted the crew of the ship and began the analysis with the help of his hovering droid REM-02. Cliffside, he encountered a giant, tentacled being. Having nowhere to retreat, Deeve reacted by firing near it and calling the crew of the ship again, asking for reinforcements.\nDeeve was a respected scout in the Rebel Alliance and was known for his tracking skills. He disliked talking with the droid Effcee, whom he found to be annoyingly affectionate, preferring instead to converse with the organic Jarsa. He then tried to reprogram Effcee to make her less friendly, but his programming skills were not sufficient: he believed he had succeeded in changing the droid's behavior, but to his chagrin, Effcee kept her fondness.\nDuring his childhood, Deeve suffered from several fears; he overcame his apprehension of heights, but he retained other frights. As an adult, he was not frozen with fear when facing alien creatures he did not know: on at least one occasion, he reacted by shooting in front of a potentially hostile being.\nWhen scouting for the New Republic, he carried specialized gear, including a blaster pistol, a comlink, a datapad attached to his waist with molecular hooks, a face breather with monitor pads that were activated with his tongue, a spectrameter, raddetects, a mineral spotter, and a temp monitor, as well as the droid REM-02 in his backpack. As REM-02 could not understand what it surveyed, Deeve made it contact an enviro-analyzer which could achieve conclusions.\nDeeve first appeared in \"A Typical Survey\", a two-page short story that served as an introduction to Galaxy Guide 8: Scouts. He was later mentioned in the book Alliance Intelligence Reports.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Arporatal-Lanin",
  "/wiki/Arpor-Lan",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/New_Republic/Legends",
  "/wiki/Bureau_of_Scouting_and_Exploration_Services",
  "/wiki/Scout/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Apliria",
  "/wiki/Safe_world/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/New_Alderaan/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Starship/Legends",
  "/wiki/NRSS_Founder",
  "/wiki/Jarsa",
  "/wiki/Effcee",
  "/wiki/Star_system/Legends",
  "/wiki/Mineral/Legends",
  "/wiki/Unidentified_tentacled_being",
  "/wiki/Unidentified_planet_(Deeve)",
  "/wiki/Support_Services/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Shistavanen/Legends",
  "/wiki/Yurdak_Fav",
  "/wiki/Time/Legends",
  "/wiki/Lieutenant_Commander/Legends",
  "/wiki/Bakki_Sourthol",
  "/wiki/Anson_Blazer",
  "/wiki/Tura_Raftican",
  "/wiki/Operative",
  "/wiki/Tay_Vanis",
  "/wiki/4_ABY/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Programmer/Legends",
  "/wiki/Outer_Region_Foxar_Scout_Base",
  "/wiki/Atmosphere/Legends",
  "/wiki/REM-02",
  "/wiki/Alien/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Molecular_hooks",
  "/wiki/Face_breather",
  "/wiki/Monitor_pad",
  "/wiki/Spectrameter",
  "/wiki/Raddetects",
  "/wiki/Mineral_spotter",
  "/wiki/Temp_monitor",
  "/wiki/Backpack/Legends",
  "/wiki/Enviro-analyzer",
  "/wiki/A_Typical_Survey",
  "/wiki/Galaxy_Guide_8:_Scouts",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/West_End_Games"
 ]
}