{
 "name": "Deila",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Melida/Daan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Young"
     ]
    }
   ]
  }
 ],
 "content": "Deila was a female Human and a member of the Young on Melida/Daan. A contemporary of Nield and Cerasi, she fought in the Young–Elders War. After the defeat of the Elders, Deila was named to the new government's Young Security Squad, serving as Jedi Obi-Wan Kenobi's second-in-command.\nWhen Nield exiled Jedi Kenobi, Deila was forced to allow Mawat to take the weapons from the Young's store house because Nield ordered it. However, upon learning from Joli that Mawat wanted to take control of the city of Zehava for himself, Joli and Deila hid before providing information to Jinn and Kenobi, telling the Jedi of Mawat's deception.\nLater, when Obi-Wan and Nield fought a battle against Mawat and his men, Delia, Joli and Roenni came to aid them in battle. They were called along with Nield's people to the fight against Mawat. But this fight was interrupted by the words Cerasi who came from a hologram that they had made before her death. All were touched by these words, and thus laid all their weapons to the ground.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Melida/Daan",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/The_Young",
  "/wiki/Nield",
  "/wiki/Cerasi",
  "/wiki/Young%E2%80%93Elders_War",
  "/wiki/The_Elders",
  "/wiki/Jedi/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Mawat",
  "/wiki/Joli",
  "/wiki/Zehava",
  "/wiki/Jedi_Apprentice:_The_Defenders_of_the_Dead",
  "/wiki/Jedi_Apprentice:_The_Uncertain_Path",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}