{
 "name": "Deja",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jawa"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  }
 ],
 "content": "Deja was an adventurous but lazy Jawa from Tatooine who made his living as a mechanic, but was troubled by prophetic dreams. He was unkempt and foul-smelling, rarely washing his robes, and spoke in disjointed Basic with incorrect verb tense.\nDeja napped frequently and sometimes experienced prophetic visions. His first such vision showed a sandcrawler being attacked by white skeletal warriors. He informed his shaman, but was ridiculed and punished. Two days later his tribe discovered the remains of a sandcrawler destroyed by stormtroopers. Terrified, Deja's tribe exiled him.\nDeja attempted to make a living as a mechanic in Mos Eisley, fixing and jury-rigging droids and ships on the cheap. While napping one day in a space transport he had been assigned to repair, a malfunction occurred in the hyperdrive, and the ship took off unexpectedly. Deja repaired and improved the hyperdrive motivator, but was stranded on board. He befriended the crew for a time, but they eventually tired of his cursing, napping, poor repair work, and stench, and dropped him off at the spaceport on Nubia, where he continued to live and work as a freelance mechanic and pass on his visions to anyone who would listen.\nDeja's game stats reveal he had the Jedi ability of Farsight, indicating he was Force-sensitive.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/Sandcrawler/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Hyperdrive_motivator/Legends",
  "/wiki/Nubia/Legends",
  "/wiki/Farsight/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant_and_the_Core_Worlds"
 ]
}