{
 "name": "Dekk%27lar",
 "display_name": "Dekk'lar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Dekk'lar was a Rutian Twi'lek male information broker who was active during the Galactic War between the Galactic Republic and the reconstituted Sith Empire. Dekk'lar had blue eyes and skin and was clothed in a black and white armored jacket, red pants, and a utility belt.\nIn the latter half of 3638 BBY, Dekk'lar was present near a hologame table inside a cantina when he was approached by a bounty hunter on contract with the Bounty Brokers Association. Dekk'lar was requested to provide information about a criminal that the hunter was searching for. For a moment, Dekk'lar flirted with the hunter before supplying the needed information.\nDekk'lar appears in Rise of the Hutt Cartel, an expansion to BioWare's 2011 massively multiplayer online role-playing game, Star Wars: The Old Republic, during the recurring Bounty Contract Week event introduced in Game Update 2.3 in 2013. The event is available to players aligned with either the Republic or the Empire and features Dekk'lar as one of several rotating characters that are randomly selected to appear during the event's Bounty Contract daily missions. The missions can take place on a variety of randomly selected worlds, including Alderaan, Coruscant, Dromund Kaas, Nal Hutta, Nar Shaddaa, Ord Mantell, Tatooine, and Voss. Dekk'lar has the potential to appear at any of these locations, but is always found in a cantina and can be summoned by the player by interacting with a hologame table.\nDekk'lar and his female counterpart, Kelia Freen, were created to be brief romance options with player characters of any gender as they progress through the Bounty Contract missions. Dekk'lar is known as \"charming_rogue\" in the game's files.\nThe cutscene in which Dekk'lar appears opens with him flirting with the player. The player is then presented with light side, dark side, and neutral response options. The player can choose to reason with or threaten Dekk'lar by selecting the light side and dark side options respectively. The neutral response option allows players to reciprocate Dekk'lar's advances. Regardless of the choice made, Dekk'lar provides the player with the information necessary to progress in the mission.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Rutian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/File:Dekklar.ogg",
  "/wiki/Information_broker/Legends",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Clothing/Legends",
  "/wiki/Utility_belt/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Canon",
  "/wiki/3638_BBY",
  "/wiki/Hologame_table",
  "/wiki/Cantina/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Bounty_Brokers_Association",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/2013",
  "/wiki/Alderaan/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Voss",
  "/wiki/Kelia_Freen",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/2014",
  "/wiki/3637_BBY",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/3636_BBY",
  "/wiki/Galactic_Standard_Calendar"
 ]
}