{
 "name": "Dekluun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Thustra"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Thustra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sephi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sephi",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Dekluun was a male Sephi commander who led troops when the planet Thustra was invaded by the Republic military after the Sephi had decided to leave the Republic in 21 BBY. While deploying his troops to prepare for an attack on the Republic units, Dekluun was killed when the enemy launched a surprise strike.\nDekluun was a male Sephi from the planet Thustra who lived during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. In 22 BBY. the Sephi under their King Alaric decided to secede from the Republic and join the Confederacy, an action that resulted in a Republic task force being sent to Thustra in order to make a show of force. Holding the rank of commander, Dekluun led troops in the ensuing battle, in which the first attacks by the Sephi inflicted heavy casualties on the Republic clone troopers.\nDekluun than began to deploy his troops just out of range of the Republic forces, preparing to attack the enemy and drive them from Thustra. However, the Sephi Senator, Navi, betrayed both his own people and the Republic in a power gamble and gave the Republic forces the coordinates of the Dekluun's forces as well as the location of a hidden pass that could be used to surprise the Sephi. While still preparing the troops for his own attack, Dekluun and his soldiers were caught off-guard by the Republic. LAAT/i gunships opened fire on the Sephi positions, killing Dekluun in the first seconds of the assault.\nDekluun was an able military commander and realized that for a victory over the superior weapons and numbers of the clone army he would have to employ every possible advantage. Despite this, the attack of the Republic forces caught him completely by surprise and led to his death. When his aide pointed out that the Sephi were the ones with an advantage as they fought to protect their families and their homeworld, he was happy about his subordinate's attitude. Dekluun had white hair, black eyes and pink skin.\nDuring the battle of Thustra, the commander wore whole-body armor.\nDekluun first appeared in the Jedi: Yoda comic written by Jeremy Barlow and illustrated by HOON. Jedi: Yoda was released by Dark Horse Comics and published in 2004. The commander later received an entry in The Complete Star Wars Encyclopedia .",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Thustra/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Sephi/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Thustra",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Unit",
  "/wiki/Death/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/King/Legends",
  "/wiki/Alaric_(Sephi)",
  "/wiki/Military_rank/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Navi",
  "/wiki/Soldier/Legends",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Gunship/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Standard_second",
  "/wiki/Cloning/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Jedi:_Yoda",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Jeremy_Barlow",
  "/wiki/HOON",
  "/wiki/Dark_Horse_Comics",
  "/wiki/2004",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides"
 ]
}