{
 "name": "Del Korrot",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Del Korrot was a Cerean freelance Jedi hunter that offered his services to Emperor Palpatine, promising to hunt down and destroy Jedi Knights and Force-sensitives who survived the Great Jedi Purge.\nKorrot emerged from the Clone Wars and presented himself to Emperor Palpatine as a Jedi hunter. Palpatine was amused by Del Korrot's audacity and agreed to support Korrot's efforts within the Empire. Palpatine allowed Korrot to freelance outside the Empire's borders, so long as his Imperial duties were completed. Using the starship Shadow I, Del Korrot traveled the galaxy looking for any Jedi Knights who might have survived the Jedi Purge. He wore a suit of cortosis-impregnated armor, and often killed innocent beings simply because he felt like it. He claimed these innocents were latent Force-sensitives, but Emperor Palpatine began to tire of his unnecessary killings.\nThe Emperor sent Darth Vader to eliminate Del Korrot, and the Cerean was unable to overcome all the methods of attack the Sith Lord could bring at him. Eventually, Vader was able to strike down Del Korrot and kill him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_hunter/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Shadow_I",
  "/wiki/The_galaxy/Legends",
  "/wiki/Cortosis/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}