{
 "name": "Del_Meeko",
 "display_name": "Del Meeko",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Ten years before Iden Versio"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 34 ABY",
      "Corvus",
      "Pillio"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Scarif Deployment",
      "Imperial Starfighter Corps",
      "Inferno Squad",
      "Scarif Deployment",
      "Imperial Starfighter Corps",
      "Inferno Squad",
      "Dreamers",
      "Alliance to Restore the Republic",
      "Danger Squadron",
      "Danger Squadron",
      "New Republic",
      "Inferno Squad",
      "Inferno Squad"
     ]
    }
   ]
  }
 ],
 "content": "Del Meeko was a human male native of Coruscant, the capital world of the Galactic Empire during the Imperial Era. During the reign of Emperor Sheev Palpatine, Meeko served in the Imperial Military as a stormtrooper, a shoretrooper with the military rank of sergeant, an Imperial Starfighter Pilot, and subsequently as the chief engineer of a Star Destroyer when holding the rank of Lieutenant Commander. Following the Rebel Alliance's theft of the plans to the Death Star in the year 0 BBY, Meeko became an agent of Inferno Squad, a special forces unit led by Captain Iden Versio.\nThe Emperor's death in 4 ABY resulted in the activation of Operation: Cinder; as part of the overall Contingency, its purpose was to ensure the annihilation of both the Empire and its enemies. Inferno Squad was dispatched to Fondor with orders to retrieve satellites that were critical to the execution of Operation: Cinder. After completing their mission, Meeko was ordered to destroy the Emperor's Observatory on Pillio. In the course of his mission, he encountered the Jedi Knight Luke Skywalker. Despite their different allegiances, Meeko and Skywalker worked together by fighting off many scritters—indigenous lifeforms that were hostile to the offworlders—in order to reach the observatory.\nAfter parting ways with Skywalker, Meeko rejoined Inferno Squad at Vardos where the team learned that Versio's homeworld was one of the targets under Operation: Cinder. Unwilling to participate in the ruin of a planet noted for its loyalty to the Empire, Meeko and Versio rebelled against the military in an effort to save civilians. Having severed their ties with the Empire, they surrendered to the Alliance, but were given a chance to fight alongside the Rebels at the Battle of Theed. By saving Naboo, another planet targeted by Operation: Cinder, Meeko and Versio were both welcomed into the ranks of the newly-formed New Republic by Princess Leia Organa.\nIn 5 ABY, approximately one year after the Battle of Endor, the new Inferno Squad was among the Republic forces that defeated the Imperial forces led by Counselor Gallius Rax at the Battle of Jakku. In the years that followed the Empire's defeat and the conclusion of the Galactic Civil War, Meeko and Versio raised a daughter named Zay Versio. Decades after the war, Meeko was captured by the First Order and interrogated by Kylo Ren, a dark side warrior tasked with hunting the last Jedi. With no further use for Meeko, Ren turned the veteran soldier over to Commander Gideon Hask—a First Order officer who once served with Meeko as an agent of Inferno Squad—who personally executed his former comrade.\nA native of Coruscant, Del Meeko grew up during the time of the Jedi Order, although the stories he heard about the Jedi caused him to fear them. He had two brothers. Meeko worked his way through the ranks of the Imperial Military, starting as a stormtrooper, then as a shoretrooper on Scarif with the military rank of sergeant, as a TIE fighter pilot, and finally as a chief engineer aboard a Star Destroyer with the rank of lieutenant commander.\nSometime after the Battle of Yavin, Meeko, along with Senior Lieutenant Iden Versio, Gideon Hask and Seyn Marana, was drafted into Inferno Squad, a Special Forces unit in the Imperial Military, by Admiral Garrick Versio. Meeko participated in Inferno's first mission: to infiltrate and destroy the Dreamers, which was successful, though Marana died.\nMeeko continued serving as an elite agent in Inferno Squad, conducting special operations for the Empire throughout the Galactic Civil War against the Rebel Alliance. He fought at the Battle of Endor in 4 ABY, which saw the death of Emperor Palpatine and destruction of the second Death Star. Meeko held the Corvus during the attack on Fondor, where Inferno fought against a Rebel attack on Moff Raythe's Star Destroyer Dauntless, which was transporting satellites to be used as part of Operation: Cinder.\nMeeko later took part in the mission to Pillio as the sole Inferno agent with orders to destroy the Emperor's Observatory. Despite being on opposite sides of the war and once fearing the Jedi, Meeko agreed to a temporary truce with new age Jedi Knight Luke Skywalker to find the Observatory while fighting off Pillio's native bugs, ultimately allowing the Jedi to keep a special compass from the facility.\nWhen the climate disruption arrays from the Dauntless targeted the Versio homeworld of Vardos, Meeko remained loyal to Iden as both went rogue. Hask however insisted that they remain loyal. After being unable to get Hask to join them, they helped a group of civilians and their crew escape aboard the Corvus, narrowly evading the Eviscerator and Admiral Versio. They decided to surrender to the Rebel Alliance, and provided key intelligence on Operation: Cinder to Danger Leader Shriv Suurgav and General Lando Calrissian. Meeko and Iden both fought at the Battle of Theed in an effort to combat Operation: Cinder, and ultimately defected to the New Republic as Princess Leia Organa welcomed them in.\nMeeko continued to serve in Inferno Squad as it was integrated into the New Republic under the command of Iden Versio, making attempts to capture Hask and Admiral Versio as they fought against the Imperial remnants in the final year of the Galactic Civil War. Meeko piloted the Corvus at the Battle of Jakku while Iden shot down Hask and attempted to rescue her father from the crashing Eviscerator. Iden narrowly escaped aboard an escape pod, and reunited with Meeko at the end of the battle, which saw a victory for the Republic and the final defeat of the Empire.\nDel and Iden went on to marry and have a daughter, Zay Versio. Del used the Corvus to haul cargo in his newfound life of peace, and found faith in the Force. However, about thirty years after the Battle of Jakku, Del and his crew were captured by Protectorate Gleb and Jinata Security on Pillio, where he was interrogated by Kylo Ren for information on where Lor San Tekka took the map to Skywalker. Afterwards, he was confronted by a living Hask, now an officer in the First Order. In his final words, he addressed Hask by his first name and implored him not to go after Iden, warning Hask it would not end well for him before being shot four times to death by his former squad mate. Hask then ordered Gleb to bury the corpses of Meeko and his crew in order to leave the Corvus alone with the intention of luring Iden into a trap.\nShortly afterwards, Iden, Zay and Shriv tracked down Hask to Vardos, where Hask told them about Del's fate. However, Iden, Shriv and Zay managed to sneak into the Retribution and during a struggle to kill Zay, Hask ended up losing his life when a fatally wounded Iden shot him to save her daughter, avenging her husband and demonstrating that Del's last words were right: going after Iden would not end well for Hask.\nAround 34 ABY and sometime after the Battle of Crait, Commander Poe Dameron gave a speech to the Resistance about how they all had a choice but struggled to explain what that choice was. Zay assured that it was the choice to be better, the same thing that Luke Skywalker, who had recently died on Crait, told her father when they met on Pillio.\nDespite his Imperial background and loyalty to Inferno Squad, Del Meeko was deeply conflicted, and often uncertain about the Empire's methods. Del was horrified after watching Hask kill all the dreamers. He was much more open minded then his squadmates which allowed him to work with Luke on Pillio despite being on opposite sides and believing him to be a terrorist. Growing up on Coruscant, he heard only frightening stories about the Jedi until being saved by Luke Skywalker, who encouraged him to follow his own path. He also liked wildlife and often studied a planets wildlife before visiting.\nDel Meeko was created for the 2017 video game Star Wars Battlefront II, where he was portrayed by TJ Ramini.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Del",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Del_Meeko",
  "/wiki/Coruscant",
  "/wiki/Standard_year",
  "/wiki/Iden_Versio",
  "/wiki/34_ABY",
  "/wiki/Corvus_(Raider_II-class)",
  "/wiki/Pillio",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Scarif_Deployment",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Inferno_Squad",
  "/wiki/Dreamers",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Danger_Squadron",
  "/wiki/New_Republic",
  "/wiki/Inferno_Squad_(Resistance)",
  "/wiki/Coruscanti",
  "/wiki/Capital",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Imperial_Military",
  "/wiki/Stormtrooper",
  "/wiki/Coastal_defender_stormtrooper",
  "/wiki/Military_rank",
  "/wiki/Sergeant",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Chief_engineer",
  "/wiki/Star_Destroyer",
  "/wiki/Lieutenant_Commander",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/0_BBY",
  "/wiki/Agent",
  "/wiki/Special_forces",
  "/wiki/Squad",
  "/wiki/Captain",
  "/wiki/Death",
  "/wiki/4_ABY",
  "/wiki/Operation:_Cinder",
  "/wiki/Contingency",
  "/wiki/Fondor",
  "/wiki/Satellite",
  "/wiki/Climate_disruption_array",
  "/wiki/Attack_on_Fondor",
  "/wiki/Emperor%27s_Observatory",
  "/wiki/Mission_to_Pillio",
  "/wiki/Jedi_Knight",
  "/wiki/Luke_Skywalker",
  "/wiki/Scritter",
  "/wiki/Species",
  "/wiki/Observatory",
  "/wiki/Vardos",
  "/wiki/Homeworld",
  "/wiki/Skirmish_on_Vardos",
  "/wiki/Battle_of_Theed",
  "/wiki/Naboo",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/5_ABY",
  "/wiki/Battle_of_Endor",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/Counselor_to_the_Empire",
  "/wiki/Gallius_Rax",
  "/wiki/Battle_of_Jakku",
  "/wiki/New_Republic_Era",
  "/wiki/Imperial_Instruments_of_Surrender",
  "/wiki/Galactic_Concordance",
  "/wiki/Galactic_Civil_War",
  "/wiki/Zay_Versio",
  "/wiki/Standard_decade",
  "/wiki/Mission_to_Pillio_(First_Order)",
  "/wiki/First_Order",
  "/wiki/Torture",
  "/wiki/Ben_Solo",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Knights_of_Ren",
  "/wiki/Jedi",
  "/wiki/Soldier",
  "/wiki/Commander",
  "/wiki/Gideon_Hask",
  "/wiki/First_Order_officer",
  "/wiki/Time",
  "/wiki/Jedi_Order",
  "/wiki/Scarif",
  "/wiki/Implacable_(Star_Destroyer)",
  "/wiki/Battle_of_Yavin",
  "/wiki/Senior_Lieutenant",
  "/wiki/Seyn_Marana",
  "/wiki/Imperial_Special_Forces",
  "/wiki/Admiral",
  "/wiki/Garrick_Versio",
  "/wiki/Infiltration_of_the_Dreamers",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Moff",
  "/wiki/Raythe",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Dauntless_(Imperial_II-class)",
  "/wiki/File:Inside_the_Pillio_Observatory.png",
  "/wiki/Jedi_star_compass",
  "/wiki/File:Iden_Del_Shriv_and_Leia_on_Naboo.png",
  "/wiki/Versio_family",
  "/wiki/Eviscerator",
  "/wiki/Danger_Leader",
  "/wiki/Shriv_Suurgav",
  "/wiki/General",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/File:Iden_and_Del_kiss.png",
  "/wiki/Escape_pod",
  "/wiki/File:GideonFO.png",
  "/wiki/The_Force",
  "/wiki/Protectorate_(title)",
  "/wiki/Gleb",
  "/wiki/Jinata_Security",
  "/wiki/Lor_San_Tekka",
  "/wiki/Map_to_Skywalker",
  "/wiki/Skirmish_on_the_Retribution",
  "/wiki/Retribution",
  "/wiki/File:Zay_cries_for_her_mother.png",
  "/wiki/Battle_of_Crait",
  "/wiki/Poe_Dameron",
  "/wiki/Resistance",
  "/wiki/Crait",
  "/wiki/File:Cloud_Cover_PotF.png",
  "/wiki/2017",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/TJ_Ramini",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/Revelations_1",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Resistance_Reborn",
  "/wiki/Resistance_Reborn_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Electronic_Arts",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Heading_into_Battle",
  "/wiki/Star_Wars_Insider_177",
  "/wiki/The_Fist_of_the_Empire",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Galactic_Empire_Conversion_Kit",
  "/wiki/TIE/ln_Fighter_Expansion_Pack",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_61",
  "/wiki/Creating_a_Starship_Fleet",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/Mission_to_Athulla",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_day",
  "/wiki/Athulla",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi"
 ]
}