{
 "name": "Delak_Krennel",
 "display_name": "Delak Krennel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corulag"
     ]
    },
    {
     "name": "Died",
     "values": [
      "9 ABY",
      "Reckoning"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic right arm"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpirePrefsbelt IV Naval AcademyImperial Navy",
      "Prefsbelt IV Naval Academy",
      "Imperial Navy",
      "Delak Krennel faction"
     ]
    }
   ]
  }
 ],
 "content": "Delak Krennel was a Human male native to Corulag. Krennel would eventually enroll within the Imperial Navy of the Galactic Empire. Krennel was an aggressive commander, and was extremely Humanocentric, displaying hatred towards Non-humans.\nKrennel would ascend to the rank of Admiral, and became the commanding officer of the Imperial II-class Star Destroyer Reckoning, and was assigned to serve Grand Admiral Thrawn's fleet based within the Unknown Regions. Krennel hated Thrawn, and disobeyed direct orders and carried out ruthless strikes against the enemy. This tempted Thrawn into removing his arm, and Krennel would replace it with a prosthetic arm. Krennel would be sent to Imperial Center to be punished, but with the Imperial loss at Endor, Krennel received none.\nKrennel went on to serve Director Ysanne Isard, current leader of the Empire. Isard dispatched Krennel to eliminate Grand Vizier Pestage, after leaving service. Krennel would kill Pestage, and become a warlord through the self-styled title \"Prince-Admiral\". He would financially support Thrawn when he returned from the Unknown Regions to fight the New Republic. Krennel would later desire peace and allow refugees to enter his territory. When the New Republic recovered plans that depicted Krennel supposedly building a Death Star-weapon, New Republic forces would deploy to end Krennel's fiefdom. Krennel would eventually die in battle aboard the Reckoning, ending his life and his faction.\nKrennel was born on Corulag. At a young age, he demonstrated the firm Humanocentrism as well as the sadism and penchant for brutality that would mark his later career when he helped his father burn down alien-owned farmlands so they could be seized by a Human agro-combine.\nHe began his Imperial service when he joined the Prefsbelt IV Naval Academy. His academy record was relatively undistinguished, except for several prizes as an intramural unarmed combat champion .\nUpon graduation, Krennel rose through the ranks and was eventually assigned to Thrawn's Unknown Regions armada, as a captain in command of the Reckoning. However, the assignment was in actuality exile imposed by his then-commanding officer, Grand Admiral Rufaan Tigellinus , due to Krennel's brutality being extreme even for the Empire. Krennel resented serving beneath a nonhuman officer, as well as his post at the Unknown Regions, but could not voice his frustrations to Thrawn, so he instead used his rage to escalate his brutal nature on the alien prisoners. Eventually, Krennel's anger towards Thrawn had him decide to use a vibropike against one of Thrawn's artworks, in mockery of his superior's tendency to utilize alien artwork to exploit an alien race's weakness during battle. This resulted in Thrawn ordering one of his Noghri Death Commandos to cut his arm off from the elbow down before he could damage it, leading to his gaining a prosthetic afterwards. This event gave him a new respect and fear of Thrawn, proceeding to rise to the rank of Admiral. Eventually, he chose to disobey an order to subjugate a world. Instead, Krennel chose to pacify it via bombardment, a choice that saw him recalled to Coruscant for a personal punishment from Palpatine. Before Palpatine could deliver his judgment, he perished at Endor - leaving Krennel, sure of vindication, feeling as if he had a stain on his record.\nEarly in the conflict, Krennel aligned with General Paltr Carvin, but accepted orders from the burgeoning authority of Ysanne Isard. On Isard's orders, Krennel attempted to capture Leia Organa on Axxila, but was stopped by an AT3 Directive issued by Soontir Fel at the behest of Sate Pestage. The interruption irked Krennel, causing him to offer his allegiance directly to Isard in exchange for aid in retrieving Pestage on Ciutric IV. When Pestage escaped the New Republic, he sought asylum with Krennel, unaware of his hatred for the Grand Vizier. Krennel strangled Pestage and seized his holdings in the Ciutric Hegemony, before coldly murdering Pestage's entire family. Krennel then styled himself as a warlord, with the title of \"Prince-Admiral\".\nDuring Thrawn's campaign, Krennel offered monetary support and pretended to pay heed to his former commander's call for unity. After the defeat of Thrawn at Bilbringi, Krennel was targeted to be an example to warlords of the New Republic's newly strengthened policy against them.\nWith the clone Isard, Krennel began a plot to sow chaos in the New Republic between Human and nonhuman species, waylay freight traffic to Coruscant at Liinade III, and conquer Coruscant. Rogue Squadron put their plans to a quick end, with the aid of the original Ysanne Isard. Wedge Antilles forwarded intelligence provided by Isard to the New Republic Defense Fleet, which dispatched a flotilla to Ciutric before Krennel's forces could launch their attack. The flotilla, under the command of Admiral Gial Ackbar crushed Krennel's forces in a Thrawn Pincer and seized the shield-stripped capital of the Hegemony. Krennel died aboard his flagship, Reckoning, when a concussion missile launched from either the Selonian Fire or Corusca Fire pierced the forward viewport, shattering the viewport and sending shards of transparisteel through Krennel's body. When the missile exploded, Krennel and the entire bridge were destroyed.\nKrennel was a competent tactician and strategist , but he was a brutal man by nature and had little tolerance for the subtler approaches espoused by two of his old superiors, Thrawn and Isard. His reflexive response to any obstacle was to crush it.\nHe was very sadistic, as well as masochistic, the latter trait being adopted shortly after he lost his arm to Thrawn when trying to damage one of his artworks.\nDuring his brief tutelage by Isard's clone as ruler of the Citruic Hegemony, he began to experiment with political propaganda and other means of manipulating opinion in his favor, presenting himself as a sympathetic ruler rather than a tyrant. He started to see the effectiveness of these methods and flattered himself that he was a quick learner and would soon be able to master them without \"Isard's\" help. His death in battle cut short any promise he might have shown.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire",
  "/wiki/Corulag/Legends",
  "/wiki/9_ABY/Legends",
  "/wiki/Reckoning_(Imperial_II-class)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Naval_Academy",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Humanocentrism",
  "/wiki/Non-huMan",
  "/wiki/Military_rank/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Empire_of_the_Hand",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Ysanne_Isard",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Undercover_operation_on_Axxila",
  "/wiki/Grand_Vizier/Legends",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Imperial_Ruling_Council/Legends",
  "/wiki/Death/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Prince-Admiral/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Thrawn_campaign",
  "/wiki/New_Republic/Legends",
  "/wiki/Battle_of_Distna",
  "/wiki/Superweapon/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Pulsar_Station",
  "/wiki/Battle_of_Ciutric",
  "/wiki/Alien/Legends",
  "/wiki/Agro-combine",
  "/wiki/Captain/Legends",
  "/wiki/Rufaan_Tigellinus",
  "/wiki/Vibropike",
  "/wiki/Planet/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/General/Legends",
  "/wiki/Paltr_Carvin",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Axxila/Legends",
  "/wiki/AT3_Directive",
  "/wiki/Soontir_Fel/Legends",
  "/wiki/Ciutric_IV",
  "/wiki/Ciutric_Hegemony",
  "/wiki/Pestage_family",
  "/wiki/Battle_of_Bilbringi_(9_ABY)",
  "/wiki/Ysanne_Isard_(clone)",
  "/wiki/Liinade_III",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/New_Republic_Defense_Fleet/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Thrawn_Pincer",
  "/wiki/Flagship/Legends",
  "/wiki/Concussion_missile/Legends",
  "/wiki/Selonian_Fire",
  "/wiki/Corusca_Fire",
  "/wiki/X-Wing_Rogue_Squadron_31",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Mandatory_Retirement",
  "/wiki/X-Wing:_Isard%27s_Revenge",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/StarWars.com"
 ]
}