{
 "name": "Delan Vook",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pantoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Delan Vook was a male Pantoran pilot and racer in the Dragon Void Run.\nVook was present at the party that marked the beginning of the Dragon Void Run. When he found out Han Solo was a smuggler, he called him a fool and explained the racers in the Dragon Void Run had the best tech and teams dedicated to maintaining each system on their starship. He questioned if Solo and the Millennium Falcon could be competitive. He was rebuked by Loo Re Anno, who said that Solo's heart and loyalty of his crew might be enough to win the race.\nVook was present at the first obstacle in the Dragon Void Run, where the racers were attacked by mines. Vook used the Falcon as a shield, and fired at the attacking probes, hitting Solo's starship. Incensed, Solo retaliated by clipping Vook's ship. Vook still managed to finish the stage and make it to the first refueling point. Solo confronted Vook about shooting at his ship, and Anno told Solo he could file a complaint against Vook for breaking the rules which would probably lead to Vook being disqualified. Solo declined to do so, but warned Vook not to come near the Falcon. Anno told Vook that he should learn from Solo that the race is more important than revenge. Later, Vook was arrested by Imperial forces. He complained to the Stormtroopers escorting them and was struck by one. Solo leapt to his defense but was also hit. The attack was stopped by Tomine.\nWhen the organizers of the race convinced the Imperials to allow the race to continue, Vook ran back to his ship to start the next stage of the race. He reached the start of the second part of the race, which required the racers to make it through a shifting debris field at a constant rate of speed. At the end of the stage, Solo clipped some debris and was in danger of slowing down and being disqualified until Vook attached a grappling hook to the Falcon, pulling it across the finish line. Solo thanked Vook and Vook declared they were even for Solo not disqualifying him earlier in the race.\nVook landed on the second planet in the race and waited there until the signal to continue was given. Upon jumping to the next stage of the race, he and the other racers were confronted by a large Imperial armada. Anno broadcast a message to him and the other racers that they should ignore the Imperials and continue the race.\nPowering up his ship, Vook headed toward the start of the stage, along with the other participants. The Imperials ordered them to stop, and sent TIE fighters after them. Solo inquired if any of the other racers had weapons, to which Vook stated that firing on Imperials would be a death sentence. When Chewbacca destroyed a pursuing TIE fighter, Vook panicked and stated he would surrender, assured that his sponsors would bail him out of any trouble. Before he could quit, Anno opened a rift between time and space, allowing an interdimensional creature to appear behind the racers. This caused the pursuing TIE fighters to veer off or be destroyed, allowing the racers to enter the Void. Vook raced for the gate that was the finish line for the race. However, he was passed by the Millennium Falcon. After Solo let Anno win the race, Vook was able to pass through the gate when Anno re-opened after rejoining her people. He ended up back at the space station that marked the beginning of the race with the other racers.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Delan_(disambiguation)",
  "/wiki/Pantoran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Pilot",
  "/wiki/Racer",
  "/wiki/Dragon_Void_Run",
  "/wiki/Han_Solo",
  "/wiki/Smuggler",
  "/wiki/Starship",
  "/wiki/Millennium_Falcon",
  "/wiki/Loo_Re_Anno",
  "/wiki/Heart",
  "/wiki/Mine",
  "/wiki/Unidentified_planet_(Dragon_Void_Run)",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Military",
  "/wiki/Stormtrooper",
  "/wiki/Tomine",
  "/wiki/Grappling_hook",
  "/wiki/Imperial_Navy",
  "/wiki/TIE_line",
  "/wiki/Death",
  "/wiki/Chewbacca",
  "/wiki/Time",
  "/wiki/Realspace",
  "/wiki/Loo_Re_Anno%27s_species",
  "/wiki/Dragon_Void_space_station",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Delan_Vook",
  "/wiki/Han_Solo_1",
  "/wiki/Han_Solo_2",
  "/wiki/Han_Solo_3",
  "/wiki/Han_Solo_4",
  "/wiki/Han_Solo_5",
  "/wiki/Star_Wars:_Squadrons"
 ]
}