{
 "name": "Dellocon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Ginger"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireDarth Baras' spy network",
      "Darth Baras' spy network"
     ]
    }
   ]
  }
 ],
 "content": "Dellocon was a Human male agent who served the resurgent Sith Empire during the Cold War. Darth Baras eventually had his apprentice kill him on Nar Shaddaa, as his true allegiance was in danger of being exposed.\nIn 3643 BBY, Agent Dellocon was one of the many spies within Darth Baras' intelligence network. He was active on Nar Shaddaa when Baras sent his apprentice to eliminate him, as he was in danger of being exposed due to the abilities of a mysterious jedi padawan. Suspecting his impending doom, Dellocon sought Baras' rival, Sith Lord Rathari, offering his knowledge for protection. Despite being initially well protected and hidden, Dellocon met his fate as Baras' apprentice was able to track him down and have him killed.\nDellocon was supposedly a loyal and efficient agent, though virtually nothing is known about his time as one of Baras' spies. His defection and alliance to Baras' rival Rathari seemed to be mostly due to his former master's ruthless decision to have him eliminated.\nDellocon appears as a NPC during the Sith Warrior storyline in Star Wars: The Old Republic. Although he makes only a brief appearance during the last mission on Nar Shaddaa, he's a relevant character to the plot, being the target of the manhunt that eventually puts the player against heavy resistance by many different groups of opponents throughout the planet.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Darth_Baras%27_spy_network",
  "/wiki/Agent/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Darth_Baras",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Imperial_Agent",
  "/wiki/Jaesa_Willsaam",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Rathari",
  "/wiki/Death/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith_Warrior"
 ]
}