{
 "name": "Delund",
 "display_name": "Delund",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic",
      "Ecliptic Evaders",
      "Ecliptic Evaders"
     ]
    }
   ]
  }
 ],
 "content": "Delund was a Human male Imperial pilot stationed on the Rand Ecliptic who later joined the Alliance to Restore the Republic.\nAn Imperial pilot aboard the Imperial II-class frigate Rand Ecliptic, Delund secretly harbored rebel sympathies, and was a member of a cell of like-minded individuals, including the starship's first mate Biggs Darklighter.\nDuring a meeting between four cell members, including Delund, Darklighter, and Peate Kurin, the cell was discovered by second mate Derek \"Hobbie\" Klivian, forcing the rebels to put their plan of defection into action. Sabotaging the Rand Ecliptic's systems and donning the life support suits of the frigate's TIE pilots, the four defectors escaped in TIE/LN starfighters, heading galactic north to regroup and search for a haven at which to resupply.\nAlthough Delund identified a potential base, it was discovered to be uninhabitable, merely a dead rock. Hours after their mutiny on the Rand Ecliptic, with dwindling life support and no sign of sanctuary, Darklighter ordered a return to the frigate to obtain replacement fuel and oxygen tanks. Surprised to find the starship non-hostile and lacking the rest of its TIE complement, the defectors discovered that the Rand Ecliptic had been commandeered by three other rebel cells present on the ship, including one led by Klivian, who had taken command of the vessel.\nThe mutineers would join the Rebel Alliance at the Massassi Base on Yavin 4, contributing ships and personnel to the cause. Delund, along with fellow mutineers Darklighter, Klivian, and Kurin, flew TIE Fighters modified with hyperdrives, astromech sockets, and Alliance Starbird insignia as the starfighter unit the Ecliptic Evaders. Sent by General Jan Dodonna to steal several X-wing starfighters from an Incom Corporation assembly facility, Delund and his unit perform a diversionary attack on an Imperial Security Bureau station overseeing the facility, drawing away the ISB's TIE squadron before ejecting and being shuttled to the facility in an Alliance transport. Although Kurin was killed and Klivian wounded in the process, the Delund and the other Rebel pilots sucessfully recovered the X-wings, flying them back to the Rand Ecliptic, awaiting them in orbit.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Ecliptic_Evaders",
  "/wiki/Pilot/Legends",
  "/wiki/Rand_Ecliptic/Legends",
  "/wiki/Imperial_II-class_frigate",
  "/wiki/Starship/Legends",
  "/wiki/First_Mate/Legends",
  "/wiki/Biggs_Darklighter/Legends",
  "/wiki/Peate_Kurin",
  "/wiki/Second_mate/Legends",
  "/wiki/Derek_Klivian/Legends",
  "/wiki/Mutiny_on_the_Rand_Ecliptic/Legends",
  "/wiki/Life_support/Legends",
  "/wiki/Flight_suit/Legends",
  "/wiki/Frigate/Legends",
  "/wiki/TIE_pilot",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Great_Temple/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Astromech_socket/Legends",
  "/wiki/Alliance_Starbird",
  "/wiki/Starfighter/Legends",
  "/wiki/General/Legends",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Strike_at_an_Incom_Corporation_facility",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Incom_Corporation/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/GR-75_medium_transport/Legends",
  "/wiki/Death/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Empire_9",
  "/wiki/Empire_12",
  "/wiki/Empire_15",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Empire_8"
 ]
}