{
 "name": "Dembaline",
 "display_name": "Dembaline",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    }
   ]
  }
 ],
 "content": "Dembaline was a Mon Calamari composer of some notability whose most recognizable work, \"Shwock Dubllon,\" was produced prior to the Clone Wars. By 22 BBY, the HoloNet News agency regarded \"Shwock Dubllon\" as a classic, and the song had been remixed by musician Gaeriel Capens. Dembaline and \"Shwock Dubllon\" retained their popularity across the span of several decades, and the piece was later used by a starfighter squadron, the Dozen-and-Two Avengers, as a theme song of sorts.\nDembaline was a member of the Mon Calamari species, amphibious humanoids native to the planet Dac. Dembaline became a composer at some point prior to the Clone Wars and produced a number of works that were notable in the galaxy, one of the more prominent being the song \"Shwock Dubllon,\" a timeless masterpiece that served as most species' first exposure to Mon Calamari diaspora and which was considered one of Dac's most significant contributions to galactic culture. Translated into Galactic Basic Standard, \"Shwock Dubllon\" meant \"Crested Wake,\" and it was known as a rousing, dramatic piece.\nAround 22 BBY, the musician Gaeriel Capens released to renewed acclaim a remix of \"Shwock Dubllon,\" which the HoloNet News agency later revealed to have been produced with the aid of RetSpan Audionics TribBot mimic droids. Dembaline's music remained popular following the Clone Wars and into the period of the Yuuzhan Vong War in 25 ABY. A starfighter squadron dedicated to tracking down pirates and smugglers in the Outer Rim Territories, known as the Dozen-and-Two Avengers and led by Jedi Master Kyp Durron, adopted \"Shwock Dubllon\" as its unofficial theme song.\nA musical composer of some renown, Dembaline's work retained its notability and popularity for many decades. One of Dembaline's best known songs, \"Shwock Dubllon,\" was regarded as a rousing and dramatic piece by some Humans.\nDembaline, a common name among female Mon Calamari, was also a type of homonymous gemstone.\nDembaline was first mentioned in the 1999 novel The New Jedi Order: Vector Prime, the first installment in The New Jedi Order series. While Dembaline's sex was not established, in the Galactic Campaign Guide, Dembaline is provided as a female Mon Calamari name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Musician/Legends",
  "/wiki/Dembaline_(gem)",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Shwock_Dubllon",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Music/Legends",
  "/wiki/Gaeriel_Capens",
  "/wiki/Standard_decade/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Kyp%27s_Dozen",
  "/wiki/Species/Legends",
  "/wiki/Amphibian/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dac",
  "/wiki/The_galaxy/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/RetSpan_Audionics",
  "/wiki/TribBot_mimic_series",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/25_ABY/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kyp_Durron",
  "/wiki/Human/Legends",
  "/wiki/1999",
  "/wiki/The_New_Jedi_Order:_Vector_Prime",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Campaign_Guide",
  "/wiki/HoloNet_News_Vol._531_56",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/Slugthrowers:_An_Overview_of_Popular_Music_and_Musicians_in_a_Galaxy_Far,_Far_Away",
  "/wiki/The_New_Essential_Guide_to_Alien_Species"
 ]
}