{
 "name": "Demitri Firewatcher",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Demitri Firewatcher was a Human male who lived on Naboo during the Galactic Civil War. After the Battle of Yavin, Firewatcher's master was kidnapped by pirates and brought to their bunker in the Gallo Mountains. Firewatcher stayed in Keren, hoping to find help for his master until he finally met a spacer who was willing to venture to the pirate's hideout and attempt a rescue operation. Demitri told him of treasures that were rumored to be found at this location. He then gave the spacer the approximate coordinates of the pirate bunker and waited for the spacer's return.\nDemitri Firewatcher was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Demitri Firewatcher was added to the game with the \"Publish 1\" update, released on August 3, 2003.\nFirewatcher was not part of a quest. He was one of the so-called Herald NPCs, which were added to the game to point players to dungeons and other points of interest. When talking to Firewatcher, the player could decide whether to help him or decline his plea. If the player agreed to go to the pirate bunker, only a new waypoint was added to the player's datapad and it was up to the player if he wanted to explore this location. None of the prisoners in the bunker could be identified as Firewatcher's master. If the player freed the prisoners by talking to them after killing the pirates, Firewatcher's dialogue did not change.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Naboo/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Naboo_pirates",
  "/wiki/Pirate_Bunker",
  "/wiki/Gallo_Mountains/Legends",
  "/wiki/Keren/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_3"
 ]
}