{
 "name": "Den Siva",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nagi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nagai"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nagai",
      "Alliance of Free Planets"
     ]
    }
   ]
  }
 ],
 "content": "Den Siva was a part of the Nagai invasion force that attempted to conquer the Galaxy shortly after the Battle of Endor. A romantic, enigmatic figure, Den fostered an obsessive fixation on the Zeltron Dani, which eventually led to him betraying his own people, in return for her life.\nAs an advance agent of the Nagai, he was attached to the Dark Lady Lumiya, and joined her on Kinooine when she captured Luke Skywalker and the Zeltron Dani. Intrigued by the Zeltron, Den asked Lumiya for the privilege of interrogating and examining Dani, in the hope that he could learn much about the Zeltrons from her—and that perhaps in turn, she might learn something from him.\nDen's examination of Dani proved to be cruel and unusual, as he constantly penetrated her with the painful laser beams of an analysis grid. As the torturous examination intensified, Den became more and more taken by Dani, even as he drove her into a quiet shell of her former self.\nDuring one occasion, while Dani was recovering from yet another examination, Den found a beautiful flower growing from out of a rock crevice. He was surprised to have found beauty in something so weak and ephemeral—as a Nagai, he respected strength, efficiency and elegance more than fragility and tranquillity.\nWhen the Iskalonian Kiro managed to free Dani, Den engaged him in a vicious duel, during which both combatants were knocked from the cliff side and into a deep river. Den escaped, however, and managed to free Lumiya, who had been captured by Luke Skywalker.\nBy this point, the main Nagai force had entered the Galaxy and captured Kinooine, giving Den the chance to reunite with his people. He continued his obsession with Dani throughout the war, often gazing upon holograms of the Zeltron, and letting his thoughts dwell upon her, her brave response to his tortures, and how much he wanted to capture her once again.\nWhen Commander Knife began planning the invasion of Zeltros, Den immediately volunteered to lead the mission. Shortly afterwards, Den witnessed the murder of Wing Leader Tai, killed by Knife for accepting mercy from Princess Leia Organa on Trenwyth. Deeply shocked by this brutal justice, Den and his forces set off for Zeltros.\nDen ambushed and captured Leia and Dani on Zeltros, and his Nagai and Maccabree troops ambushed a party and rounded up most of the Zeltros elite – including the visiting Han Solo, Lando Calrissian and Chewbacca. The attack was badly timed, however, and coincided with a Tof assault on the world. Den was captured by the Tof, who threatened to shoot Dani if he didn't agree to lead his squadron into an ambush. Although his Nagai force was wiped out, Den helped Han, Leia, Lando and Dani destroy the Tofs who had forced him into betraying his people.\nCut off from his people by his actions, Den allied himself with the Alliance of Free Planets. He and Dani formed an unlikely partnership, feeling that they understood each other, even if Dani still disliked Den. Den took part in the attack on Saijo, in which Prince Sereno was captured and forced to surrender, ending the threat of the Tofs. Den Siva's whereabouts as of then, and what became of his uneasy partnership with Dani, are both unknown.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nagai",
  "/wiki/The_galaxy/Legends",
  "/wiki/Den_(disambiguation)",
  "/wiki/Nagi",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Zeltron/Legends",
  "/wiki/Dani",
  "/wiki/Lumiya",
  "/wiki/Kinooine/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Analysis_grid",
  "/wiki/Iskalonian",
  "/wiki/Kiro",
  "/wiki/Hologram/Legends",
  "/wiki/Ozrei_N%27takkilomandrife",
  "/wiki/Zeltros/Legends",
  "/wiki/Taikotelai_Akikoma",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Trenwyth/Legends",
  "/wiki/Maccabree",
  "/wiki/Han_Solo/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Tof",
  "/wiki/Saijo/Legends",
  "/wiki/Sereno",
  "/wiki/Star_Wars_(1977)_95",
  "/wiki/Star_Wars_(1977)_96",
  "/wiki/Star_Wars_(1977)_97",
  "/wiki/Star_Wars_(1977)_99",
  "/wiki/Star_Wars_(1977)_102",
  "/wiki/Star_Wars_(1977)_103",
  "/wiki/Star_Wars_(1977)_104",
  "/wiki/Star_Wars_(1977)_105",
  "/wiki/Star_Wars_(1977)_106",
  "/wiki/Star_Wars_(1977)_107",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Marvel_Series",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/Wizards.com",
  "/wiki/Zeltros:_Pleasure_Planet",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/The_Forgotten_War:_The_Nagai_and_the_Tofs",
  "/wiki/StarWars.com"
 ]
}