{
 "name": "Dena Yus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "44 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human biot"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sarnus Refinery",
      "Galactic Exploitation Technologies"
     ]
    }
   ]
  }
 ],
 "content": "Dena Yus was a female Human biot engineered thanks to the funding of Marvid and Craitheus Qreph. She acted as an agent at Lando Calrissian's asteroid refinery on the world of Sarnus in the Chiloon Rift, where the Qrephs tried to swindle Calrissian of his refinery. When it was evident that Calrissian refused to do so, Yus was assigned to sabotage the factory and lead to its destruction. The sabotage was successful, but after Yus saw that it led to the deaths of nearly thirty thousand workers, along with that of her secret lover, rather than the few hundred she thought would be caught in the destruction, she felt guilty, even though that didn't affect her allegiance to the Qrephs much.\nAfter helping the Qrephs' hired Mandalorians capture Han Solo, the brothers left her to die aboard their mobile headquarters, the Ormni, by having her wither away from lack of feeding enzymes needed to sustain her. She was saved by Luke Skywalker and Leia Organa Solo, and despite admitting her heinous treachery to the refinery, she was still accepted as an ally against the Qrephs, if only so that she could get her feeding enzymes at Base Prime, where she was created.\nFollowing the deaths of the Qrephs and the destruction of Base Prime, Yus was fated to stand trial before the Jedi Council on the planet Shedu Maad for her crimes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/44_ABY",
  "/wiki/Human/Legends",
  "/wiki/Biot",
  "/wiki/Gender/Legends",
  "/wiki/Sarnus_Refinery",
  "/wiki/Galactic_Exploitation_Technologies",
  "/wiki/Marvid_Qreph",
  "/wiki/Craitheus_Qreph",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Sarnus",
  "/wiki/Chiloon_Rift",
  "/wiki/Mandalorian/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Ormni",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Masters%27_Council",
  "/wiki/Shedu_Maad",
  "/wiki/Crucible_(novel)",
  "/wiki/Crucible_(audiobook)"
 ]
}