{
 "name": "Denal",
 "display_name": "Denal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Devaron system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "501st Legion",
      "501st Legion"
     ]
    }
   ]
  }
 ],
 "content": "\"Denal\" was the nickname of a clone trooper who served the Galactic Republic as a soldier in the 501st Legion during the Clone Wars. Denal served under Jedi General Anakin Skywalker and Clone Captain CT-7567 \"Rex\" during the war, including the Battle of Mimban and the mission to Skytop Station. At the Battle of Devaron, he was killed by bounty hunter Cad Bane.\nIn the early months of the Clone Wars, Denal served in the 501st Legion under the command of Jedi General Anakin Skywalker and Clone Captain CT-7567 \"Rex.\" He fought in the Battle of Mimban alongside fellow clones \"Hardcase\" and \"Jesse.\"\nWhen Skywalker's personal astromech droid, R2-D2, was held captive by the scavenger Gha Nachkt and scheduled to be handed over to General Grievous at Skytop Station, Denal was assigned to be a part of the rescue squad on a mission to save the R2 unit and destroy the Separatist spy station. Traveling to the station in the G9 Rigger-class light freighter Twilight, Denal and the others donned jetpacks and jumped from the ship and onto the outside of the station. Upon landing, Denal and the other troopers laughed at their Captain, Rex, who clumsily tried to balance with their replacement astromech, R3-S6, strapped to his torso.\nDuring this mission, he, Commander Tano, and the rest of the squad were tasked with planting the detonators while Skywalker rescued R2. However, they were hampered significantly by R3, who was actually a Separatist double-agent. At one point, R3 closed several blast doors on the group and also sent a squad of B1 battle droids as well as super battle droids to their position. Surrounded, the group were pinned down until they used several EMP grenades to defeat the droids. Shortly after, the group were attacked by Grievous. After Grievous overpowered Tano, he set upon the clones, killing three of them and knocking Denal and Rex to the ground. Tano later saved Rex from being executed and led Grievous away. Denal awoke to being one of the only survivors of the attack. Rex contacted Ahsoka, who was hiding from Grievous, and she told the two clones to finish the mission and rendezvous at the landing bay as planned. Denal grabbed the backpack of charges and ran after Rex.\nAfter planting the bombs, Denal and Rex met up with Skywalker and R2 in the station's landing bay. When Rex told Skywalker that Tano was engaging Grievous, Skywalker was distressed. Rex offered to lead him to their last position, but as he, Skywalker, Denal, and the clone trooper who had landed the Twilight began to run, they were then trapped there by R3-S6, who revealed himself to be a Separatist spy. They then came under attack by super battle droids and vulture droids. After setting off the explosions, Denal and the other survivors were able to board the Twilight before the station was destroyed.\nDenal was sent with Skywalker, Tano, and Rex to Devaron to stop bounty hunter Cad Bane from acquiring the kyber memory crystal from Master Bolla Ropal on Devaron. He and the others then boarded Bane's command ship. Denal was part of the group that stormed the bridge and took control of the ship. Afterwards, Skywalker ordered Rex to lock down the escape pods so no one escaped, and Denal joined the group that went to carry out the orders. However, when one of the engines on the ship exploded, Skywalker changed the plan and instead lead their forces to locate Master Ropal. In the hangar, they encountered Bane and his battle droids. After fighting the battle droids to acquire a Sheathipede-class transport shuttle, Denal and another trooper, \"Koho,\" were then sent by Rex to find Skywalker and Tano. They then found Bane and held him up, threatening them. However, Bane overpowered them, killing both Koho and Denal.\nBane switched armor with Denal, and faked his death. At first, the clone troopers were impressed with Denal's apparent killing of Bane. However, Bane's disguise was uncovered by one of the clones who saw the Duros' green blood, and Ahsoka, who discovered that \"Denal\" was in fact Bane after following him from the shuttle. Bane then made his escape in a V-19 Torrent starfighter and jumped into hyperspace.\nDenal has standard Phase I clone trooper armor with customized blue markings on his helmet that were consistent with the 501st Legion. He used a DC-15A blaster carbine, which sometimes had an ascension cable attachment. He also sometimes had a red visor attached to his helmet.\nDenal first appeared in the Star Wars: The Clone Wars episode \"Duel of the Droids.\" Like all clones, he was voiced by Dee Bradley Baker. Although not named in the story itself, a clone wearing Denal's armor also appeared in the comic short \"501 Plus One,\" a story contained within Age of Republic Special 1. Lucasfilm Story Group member Matt Martin later clarified on Twitter that the clone in the comic was indeed Denal.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Denal",
  "/wiki/Denal/Legends",
  "/wiki/Kamino",
  "/wiki/21_BBY",
  "/wiki/Devaron_system",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/501st_Legion",
  "/wiki/Clone_trooper",
  "/wiki/Soldier",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Battle_of_Mimban",
  "/wiki/Mission_to_Skytop_Station",
  "/wiki/Battle_of_Devaron",
  "/wiki/Bounty_hunter",
  "/wiki/Cad_Bane",
  "/wiki/Standard_month",
  "/wiki/Hardcase",
  "/wiki/CT-5597",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Gha_Nachkt",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Skytop_Station",
  "/wiki/Squad",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/G9_Rigger-class_light_freighter",
  "/wiki/Twilight",
  "/wiki/R3-S6",
  "/wiki/Commander",
  "/wiki/Blast_door",
  "/wiki/B1-series_battle_droid",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Electromagnetic_pulse_grenade",
  "/wiki/Bomb",
  "/wiki/Unidentified_clone_trooper_pilot_(Twilight)",
  "/wiki/Spy",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Kyber_memory_crystal",
  "/wiki/Bolla_Ropal",
  "/wiki/Devaron",
  "/wiki/Cad_Bane%27s_Munificent-class_star_frigate",
  "/wiki/Munificent-class_star_frigate",
  "/wiki/Sheathipede-class_transport_shuttle",
  "/wiki/Koho",
  "/wiki/V-19_Torrent_starfighter",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Ascension_cable",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Duel_of_the_Droids",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Star_Wars_comic_books",
  "/wiki/501_Plus_One",
  "/wiki/Age_of_Republic_Special_1",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Matt_Martin",
  "/wiki/Category:Images_of_Denal",
  "/wiki/Cargo_of_Doom",
  "/wiki/Children_of_the_Force",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Bantha_Tracks_(newsletter)",
  "/wiki/Star_Wars_Insider_150",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Transformations",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Holocron_Heist",
  "/wiki/Death",
  "/wiki/Standard_year",
  "/wiki/File:MattTalksDenal.jpg",
  "/wiki/File:MattMartinSaysItsDenal.jpg"
 ]
}