{
 "name": "Denell_Kel%27Vannon",
 "display_name": "Denell Kel'Vannon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian Sector Force"
     ]
    }
   ]
  }
 ],
 "content": "Denell Kel'Vannon was a male Human private investigator located in Kor Vella on the planet Corellia during the Galactic Civil War. He was formerly part of Corellian Security Force and maintained a friendship with Shaedra Valouri who helped him track leads. He was hired to investigate missing persons on Starlyte Station.\nDenell Kel'Vannon had a career with Corellian Security Force but left CorSec to go into private business. He set up office in Kor Vella on the planet Corellia. As a private investigator he was called into all sorts of cases but he specialized in missing persons. Around 0 BBY he traveled to Starlyte Station to investigate a missing person. The person had been kidnapped by Dahz Thulaka with permission from station owner Talandro Starlyte. Both Starlyte and Thulaka tried to stop his investigation and it was unknown if they were successful or not. Kel'Vannon survived the ordeal as he later helped his friend Shaedra Valouri find evidence to help break a different case on Corellia.\nKel'Vannon was calm, laid back, and cool under pressure. He seldom lost his temper and preferred to let others get emotional so they would make mistakes he could exploit. He enjoyed his job and was willing to travel anywhere for a paying job. He had a strict code of honor and refused to take morally questionable jobs or work for parties with poor reputations. He was charming and had a good sense of humor however physically he blended into the crowd.\nAn outstanding investigator but a poor man to have in a fight, Kel'Vannon's was best in the field working a case rather than trying to strong arm information out of a suspect or sweet talk his way past a guard.\nKell'Vannon often wore a black trenchcoat and a blast vest. He carried a heavy blaster pistol for protection and a datapad for use in his investigations.\nDenell Kel'Vannon was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. He was illustrated by Joe Corroney. He also appeared as a non-player character in the video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony and published by LucasArts, prior to its closure on December 15, 2011. His appearance in Galaxies was very different from his illustrations in the West End sourcebook.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Corellian_Sector_Force",
  "/wiki/Private_investigator",
  "/wiki/Kor_Vella/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Shaedra_Valouri",
  "/wiki/Starlyte_Station",
  "/wiki/0_BBY/Legends",
  "/wiki/Dahz_Thulaka",
  "/wiki/Space_station/Legends",
  "/wiki/Talandro_Starlyte",
  "/wiki/Blast_vest",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Joe_Corroney",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/December_15",
  "/wiki/2011"
 ]
}