{
 "name": "Dennix_Graeber",
 "display_name": "Dennix Graeber",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ralltiir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Dennix Graeber was the Governor of Ralltiir during the Galactic Civil War.\nGraeber was a pudgy man and a protégé of Darpa sector's Moff, Jander Graffe. He was enthusiastic about oppressive public policies, and dealt with the population with harsh measures.\nGraeber also demonstrated a certain twisted cleverness. He grew quite wealthy smuggling weapons via proxies to the Rebel cells on Ralltiir, enjoying robbing them of funds while using the very weapons he was smuggling to justify further crackdowns on the populace.\nIn 2 ABY, Governor Graeber broke a Rebel spy ring in the largest crackdown on agitators since the Imperial occupation. It took three weeks of planning, and involved security forces from four of Ralltiir's counties and military units from the governor's Imperial garrison. In an early morning raid on a Rebel armory in Salibury, Graeber seized 300 tons of weaponry and authorities captured 35 Rebels on-site, leading to the capture of roughly another hundred through interrogations and examination of documents discovered in the raid.\nUnfortunately for Graeber, his rule of Ralltiir was not to last. Following the Battle of Endor, the New Republic made a push for Ralltiir, which was on the Perlemian Trade Route at the border with the Colonies region. After a New Republic strike team led by Spike disabled the planet's ion cannon, Graeber personally contacted Jerell, a leader in the planet's resistance force who blamed Graeber for the death of one of his daughters. He taunted Jerell, noting the New Republic had yet to take a Core World. In the midst of the conversation, Spike's strike team took out the planet's generators at the same time that a task force of six Mon Calamari Star Cruisers arrived in-system, and Jerell had the pleasure of informing Graeber that he would be the first governor of a Core World to welcome the New Republic to its surface.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ralltiir/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Darpa_sector",
  "/wiki/Moff/Legends",
  "/wiki/Jander_Graffe",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Crackdown_on_Ralltiir",
  "/wiki/Subjugation_of_Ralltiir",
  "/wiki/Garrison/Legends",
  "/wiki/Salibury",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Perlemian_Trade_Route/Legends",
  "/wiki/Colonies/Legends",
  "/wiki/Spike_(individual)",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Jerell",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Mon_Calamari_Star_Cruiser",
  "/wiki/Battle_of_Ralltiir_(4_ABY)",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Galaxywide_NewsNets",
  "/wiki/Star_Wars_Adventure_Journal_9",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/Into_the_Core_Worlds",
  "/wiki/Star_Wars_Adventure_Journal_7",
  "/wiki/Heroes_%26_Rogues",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}