{
 "name": "Denn Solo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tralus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian sector"
     ]
    }
   ]
  }
 ],
 "content": "Denn Solo was a Corellian who was believed to have been the paternal grandfather of Han Solo.\nDenn Solo lived on Tralus with his wife Tira Gama Solo and his young children, the twins Tiion Sal-Solo and Jonash Solo. However, he and his infant son Jonash disappeared in a pirate raid, leaving Tiion, and subsequently her son Thrackan Sal-Solo, as his only acknowledged heirs.\nHowever, Jonash Solo was believed to have survived to become Han Solo's father. True, Han's son Jacen would later dismiss Denn's grandson Thrackan—who by this analysis would have been his own first cousin once removed—as simply a \"distant\" cousin, but Han was always reluctant to discuss his origins, and Jacen's opinion may say more about attitudes within the House of Solo than the actual blood relationships involved.\nIf this identification is correct, then Denn Solo may in fact have been the public identity of Dalla the Black, a notorious pirate and kidnapper, and possible claimant to the Corellian throne, who was also identified as Han's paternal grandfather. Circumstantial support for the identification of the two men is provided by the role played by pirates in Denn's disappearance, and by Dalla's known use of false names to disguise his true identity, but categorical proof of whether the equation is correct or not is currently lacking.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Denn_Solo",
  "/wiki/House_of_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Den_(disambiguation)",
  "/wiki/Tralus/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Corellian_sector/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Tira_Gama_Solo",
  "/wiki/Tiion_Sal-Solo",
  "/wiki/Jonash_Solo",
  "/wiki/Thrackan_Sal-Solo",
  "/wiki/Darth_Caedus",
  "/wiki/Dalla_Solo",
  "/wiki/Millennium_Falcon_(novel)",
  "/wiki/Millennium_Falcon_(audiobook)",
  "/wiki/The_Paradise_Snare",
  "/wiki/The_Courtship_of_Princess_Leia",
  "/wiki/Star_Wars:_Union",
  "/wiki/The_New_Jedi_Order:_Ylesia",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}