{
 "name": "Denov",
 "display_name": "Denov",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Snivvian"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty Hunters' Guild"
     ]
    }
   ]
  }
 ],
 "content": "Denov was a Snivvian bounty hunter and a member of the Bounty Hunters' Guild during the Galactic Civil War. Denov worked secretly as a mole for the Mandalorian hunter Boba Fett, providing him with information on bounties from the Guild and aiding him in finding his targets. The Snivvian helped Fett locate the ancient luxury cruiser Reverie when the Mandalorian was searching for the Arachedron sculpture located onboard. When Fett reached the Reverie, the mole provided him with directions through the vessel until Fett was captured by the bounty hunting brothers Edo and Rolu Strom, who also claimed to have a mole in the Guild.\nDenov was a Snivvian who worked as a member of the Bounty Hunters' Guild during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. While serving the Guild, Denov also secretly worked for the Mandalorian bounty hunter Boba Fett as a mole, providing him with information on the Guild. In the year 2 ABY, Fett contacted Denov via comlink after ambushing the bounty hunting brothers Edo and Rolu Strom on the planet Dolva Prime. The Mandalorian had taken a fake copy of the artifact known as the Arachedron sculpture from the two and discovered a hologram inside showing the location of the true sculpture to be aboard a luxury liner starship named the Reverie, which he needed Denov to locate.\nFett later contacted Denov via hologram while piloting his ship, Slave I, and asked for an update on the missing Reverie. Denov claimed to have found it but then informed Fett of four new bounties that the Guild had yet to post, allowing the Mandalorian a head start on them. Uninterested, Fett asked for information on the Reverie, which Denov reluctantly provided, detailing the ship's history as a luxury cruiser followed by its destruction due to cut costs concerning engineering. The Snivvian then told Fett that the ship was currently located in a ship graveyard located at the edge of the galaxy, where it was unlikely he would find it without having to face off against junkers and scrap merchants, if at all. Unperturbed, Fett made his way to the graveyard after refusing to reveal to Denov what he was looking for in the ship.\nThe mole then used old concept designs of the ship to try and guide Fett through the Reverie to its vault; however, the Mandalorian was attacked by many small Arachedrons en route and then captured by the Strom brothers. The brothers tied Fett up and then explained they too had a mole in the Guild who had helped them find the Reverie, at which point Denov denied being the brothers' mole before they switched off Fett's communication device. Denov did not contact Fett again throughout the rest of his mission, which ended with the Mandalorian abandoning the sculpture, as it was too risky to escape with.\nDenov was willing to work for the infamous bounty hunter Boba Fett and betray the Bounty Hunters' Guild while he was a member of it. Despite the Mandalorian's reputation, the Snivvian doubted Fett would be able to find the Reverie and retrieve the prize he sought within, although the mole still directed Fett there when ordered. Denov cared in some form for Fett, or at least pretended to, claiming to hate thinking about Fett being all alone inside the ruined luxury cruiser. When the Strom brothers claimed to have a mole, Denov tried desperately to persuade Fett that it was a different Guild member.\nDenov first appeared as a hologram in Star Wars Adventures: Boba Fett and the Ship of Fear, a graphic novella written by Jeremy Barlow, penciled by Daxiong, and released in 2011 as part of the Star Wars Adventures series. The novella does not make clear the Snivvian's gender or if it was actually Denov who acted as the Stroms' mole.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Snivvian/Legends",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Luxury_liner/Legends",
  "/wiki/Reverie",
  "/wiki/Arachedron_sculpture",
  "/wiki/Starship/Legends",
  "/wiki/Edo_Strom",
  "/wiki/Rolu_Strom",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dolva_Prime",
  "/wiki/Hologram/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Firespray-31-class_patrol_and_attack_craft/Legends",
  "/wiki/Slave_I/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Ship_graveyard",
  "/wiki/The_galaxy/Legends",
  "/wiki/Scavenger/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Comm_unit/Legends",
  "/wiki/Star_Wars_Adventures:_Boba_Fett_and_the_Ship_of_Fear",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Jeremy_Barlow",
  "/wiki/Daxiong",
  "/wiki/2011",
  "/wiki/Star_Wars_Adventures"
 ]
}