{
 "name": "Densin Clord",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Densin Clord was a human male deck officer who worked at a spaceport on the planet Daiyu. In 9 BBY, he dismissed a traveler seeking help about a delayed transport when he was approached by the fugitive Jedi Obi-Wan Kenobi, who explained that he was tracking a starship. Clord clarified to Kenobi that all signatures at Daiyu were blocked and walked away.\nDuring the time of the Galactic Empire, Densin Clord worked as a deck officer and attendant of a spaceport on the planet Daiyu. In 9 BBY, he was approached by a traveler who had learned that their transport had been delayed due to weather on another world. The traveler sought help from Clord, but the deck officer denied that he could be of any assistance, clarifying that his datapad would only show the same case and that he could not change weather.\nClord waved off the traveler, only to be approached by another, the fugitive Jedi Obi-Wan Kenobi, who had arrived in search of the kidnapped Alderaanian Princess Leia Organa. Kenobi explained to Clord that he was looking for a starship that's signature had been tracked to Daiyu. Clord, though, replied that all signatures going in or out of Daiyu were blocked as people liked to keep there secrets there. After his explanation, the deck officer walked away from the Jedi.\nDensin Clord was a human male with light skin and brown hair. He was dismissive of any travelers he was unable to help, restarting his sentences as he explained the matter to them and considering their cases unworthy of his time.\nClord wore a gray shirt and trousers and a brown tunic, hat and boots. The deck officer also used an earpiece and a datapad.\nDensin Clord appeared in \"Part II\" of the Disney+ live-action television series Obi-Wan Kenobi, directed by Deborah Chow and released on May 27, 2022. Identified in the credits as \"Deck Officer Densin Clord,\" the character was portrayed by Dan Considine.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Deck_officer",
  "/wiki/Spaceport",
  "/wiki/Planet",
  "/wiki/Daiyu",
  "/wiki/9_BBY",
  "/wiki/Transport",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Starship",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Officer",
  "/wiki/Datapad",
  "/wiki/Mission_to_Daiyu",
  "/wiki/Kidnapping_of_Leia_Organa",
  "/wiki/Alderaanian",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Hair",
  "/wiki/Boot",
  "/wiki/Part_II",
  "/wiki/Disney%2B",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Deborah_Chow",
  "/wiki/May_27",
  "/wiki/2022",
  "/wiki/Dan_Considine",
  "/wiki/Part_I",
  "/wiki/Standard_year",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/StarWars.com"
 ]
}