{
 "name": "Denwade Banevans",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Carida"
     ]
    },
    {
     "name": "Died",
     "values": [
      "10 BBY",
      "Vandor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.80 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Vandor division",
      "Vandor division"
     ]
    }
   ]
  }
 ],
 "content": "Denwade Banevans was a human male who served the Galactic Empire as a range trooper captain on the planet Vandor. He led the security forces tasked with the protection of the conveyex train lines on Vandor, and was one of the toughest officers stationed on the world. In 10 BBY, he was traveling on the hovertrain ICC-5537 when a group of criminals attempted to steal the coaxium being carried on the vehicle. Banevans led his men in an attempt to prevent the theft, but was shot and killed by the criminal's leader, Tobias Beckett.\nDenwade Banevans was a human male from the planet Carida who served in the Stormtrooper Corps of the Galactic Empire during its reign across the galaxy. He was stationed as a range trooper with the rank of captain on the planet Vandor, where he was leader of the security forces for the Imperial 20-T Railcrawler conveyex transport lines. In 10 BBY, the captain traveled with a squad on board the hovertrain designated ICC-5537 in order to protect its cargo of coaxium fuel while it was transported to Crispin Imperial Depository.\nWhile ICC-5537 was headed toward the depository, a gang of criminals led by the outlaw Tobias Beckett boarded the train using a stolen Y-45 armored transport hauler. The hauler dropped Beckett and two of his accomplices, Han Solo and Chewbacca, on top of the train, where they made their way along to the car containing the coaxium. Once they had confirmed its location, the hauler returned so they could attach it to the car; however, Banevans and his men had realized something strange was going on and after detecting the threat the captain ordered his men to fan out and eliminate the intruders.\nThe Banevans and the other Imperials emerged onto the roof of the rearmost train car and opened fire on Beckett's gang, using their gription boot to stay securely on the train as it moved at 90 kilometers per hour. This prevented the criminals from making the attachments to the car carrying the coaxium, so Beckett returned fire while Solo and Chewbacca began climbing down the car they were on to detach it from the rearward cars. Banevans progressed furthest toward the criminals before being shot in the chest by Beckett and killed. The captain's corpse was held in place on the train by his boots while the rest of his squad kept progressing along the top and side of the train.\nSolo and Chewbacca severed the connection between and the cars carrying Banevans' body and his troopers were disconnected from the front half of the train and slowly ground to a halt, leaving the surviving range troopers unable to confront the criminal gang. Both the front portion of ICC-5537 and the coaxium were ultimately destroyed after the rival Cloud-Riders group attacked Beckett's men in order to steal the coaxium for themselves.\nDenwade Banevans was one of the toughest officers among all of the Imperial forces stationed on Vandor. He had no intention of letting anyone steal Imperial property without a fight, ultimately costing him his life. He stood 1.80 meters  tall.\nBanevans wore standard range trooper vambrace armor including magnetic gription boots and a synth-fur line kama. The captain carried a E-10R blaster rifle and waterproof stowage packs for survival gear.\nDenwade Banevans first appeared in the 2018 Anthology film, Solo: A Star Wars Story, and was first named in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo. Banevans' name was created as an homage to the 1957 film 3:10 to Yuma, being an amalgamation of the names of two characters from the film, Ben Wade and Dan Evans.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Carida",
  "/wiki/10_BBY",
  "/wiki/Vandor",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Galactic_Empire",
  "/wiki/Vandor_division",
  "/wiki/Range_trooper",
  "/wiki/Captain",
  "/wiki/Planet",
  "/wiki/20-T_Railcrawler_conveyex_transport",
  "/wiki/Train",
  "/wiki/Officer",
  "/wiki/Hovertrain",
  "/wiki/ICC-5537",
  "/wiki/Beckett%27s_gang",
  "/wiki/Heist_on_Vandor",
  "/wiki/Coaxium",
  "/wiki/Death",
  "/wiki/Tobias_Beckett",
  "/wiki/File:Beckett-HereTheyCome.ogg",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Imperial_Era",
  "/wiki/The_galaxy",
  "/wiki/Squad",
  "/wiki/Fuel",
  "/wiki/Crispin_Imperial_Depository",
  "/wiki/Y-45_armored_transport_hauler",
  "/wiki/Starship",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/File:Banevans-Death.ogg",
  "/wiki/Gription_boot",
  "/wiki/Kilometer_per_hour",
  "/wiki/Boot",
  "/wiki/Cloud-Riders",
  "/wiki/Imperial_Military",
  "/wiki/Vambrace_armor",
  "/wiki/Synth-fur",
  "/wiki/Kama",
  "/wiki/E-10R_blaster_rifle",
  "/wiki/Water",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/1950s#1957",
  "/wiki/Tuckerization",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_2",
  "/wiki/Solo:_A_Star_Wars_Story_Ultimate_Sticker_Collection",
  "/wiki/Solo:_A_Star_Wars_Story_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_45",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Star_Wars_Universe"
 ]
}