{
 "name": "Dequc",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Nezmi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jeodu"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.5 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun",
      "Black Nebula"
     ]
    }
   ]
  }
 ],
 "content": "Dequc was a Jeodu who sought to revive Black Sun. He called his organization Black Nebula which encouraged many crime lords and various species to join his cause. After fleeing Mara Jade at Svivren, he traveled to Nezmi where the assassin killed him in 4 ABY; resulting in Black Nebula's collapse soon afterward.\nDequc was a Jeodu with an iron fist and born to lead. His name meaning \"Whitehead\" in basic, is a common name for Jeodu having a crystal at the top of their head. Following Xizor's death, Dequc formed a splinter group, Black Nebula, in an attempt to gather Black Sun's remnants under himself. He rarely left his base of operations on Qiaax, which was hidden in the Bubble Cliffs of Nezmi. In an imitation of Xizor, he also began styling himself \"Lord Dequc\" or \"Prince Dequc.\"\nWhile on the planet Svivren, Dequc negotiated with small criminal cartels and arms dealers which coincidentally was during an annual event on the planet known as the Festival of Great Trade. However, Dequc was keen, and knew an assassin was to make an attempt to slay him and destroy Black Nebula. This information was provided by the secret agent Strok who was an under cover Imperial trying to make the Black Nebula prosper. Given this information, Dequc placed a decoy in his place to thwart the assassination.\nDequc then fled to the planet Nezmi where the Black Nebula was headquartered. The fortress was located in the mountain formation known as the Bubble Cliffs, which create an impossible maze to pass through before reaching it. The existence of the organization was in the protection of Lord Allic, the owner of a Casino/Hotel, providing credits for Dequc's organization. Dequc then came into awareness of Baroness Paltonae, whose actual identity was Mara Jade. He was impressed by her demonstrations of her \"devices\" that could decode any lock system in range. Truthfully, Mara Jade had used her Force techniques to have full knowledge of a nearby safe, tricking one of the Jeodu to open it blocking her vision. Her telepathy was invisible to Dequc and was a perfect cover to use this \"new technology\" in a demonstration in full view.\nLater, Mara Jade killed the Imperial spy Strok and a few Jeodu with a lightsaber she snuck-in, avoiding the weapon sensor with it's inability to recognize lightsabers. She then took the statue of Xizor and made a small hole to insert her lightsaber in the head of the statue with a trigger on the igniter. Captured, Mara Jade was sent to Dequc's private room to consult with him again, this time with a bad reputation from the Black Nebula. She then lied to Dequc that she was with an \"agency\" to steal the statue of Xizor's head. She explained to Dequc that it had an unknown treasure map that her \"agency\" and Dequc were both interested in. With Dequc distracted looking at the mantle of the figure's head up close, Mara activated the lightsaber inside the statue with a remote, stabbing Dequc through his eyes. Mara Jade escaped with Dequc's personal starship and left it in custody of Isard's Imperial force on Imperial Center, leaving all the information about the Black Nebula on a data pad.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Nezmi",
  "/wiki/Jeodu",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Black_Nebula_(organization)",
  "/wiki/K3",
  "/wiki/Star_Wars:_Mara_Jade_%E2%80%93_By_the_Emperor%27s_Hand",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Svivren/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Qiaxx",
  "/wiki/Bubble_Cliffs",
  "/wiki/Lord/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Festival_of_Great_Trade",
  "/wiki/Battle_of_Svivren",
  "/wiki/Strok_(Galactic_Empire)",
  "/wiki/Allic",
  "/wiki/Mission_to_Qiaxx",
  "/wiki/Baron/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Isard",
  "/wiki/Coruscant/Legends",
  "/wiki/Mara_Jade_%E2%80%93_By_the_Emperor%27s_Hand_1",
  "/wiki/Mara_Jade_%E2%80%93_By_the_Emperor%27s_Hand_2",
  "/wiki/Mara_Jade_%E2%80%93_By_the_Emperor%27s_Hand_4",
  "/wiki/Mara_Jade_%E2%80%93_By_the_Emperor%27s_Hand_5",
  "/wiki/Mara_Jade_%E2%80%93_By_the_Emperor%27s_Hand_6",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Collector_8",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_92",
  "/wiki/Sony",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}