{
 "name": "Derek_Klivian",
 "display_name": "Derek Klivian",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ralltiir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic",
      "Phoenix Squadron",
      "Red Squadron",
      "Rogue Squadron",
      "Phoenix Squadron",
      "Red Squadron",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Derek \"Hobbie\" Klivian was a male human from the planet Ralltiir who served as a pilot for the Alliance to Restore the Republic during the Galactic Civil War. He attended the Skystrike Academy with Wedge Antilles and Rake Gahree. He and Antilles defected to the rebellion after making contact with Sabine Wren. After the Battle of Yavin, Luke Skywalker invited Klivian to join Rogue Squadron. Klivian accepted and served the unit with distinction during the Battle of Hoth where he sacrificed himself by crashing his T-47 airspeeder into Maximilian Veers's All Terrain Armored Transport, Blizzard 1.\nDerek Klivian hailed from the planet Ralltiir and, since the time of his childhood, was a gifted pilot. At some point in his childhood he gained the nickname of \"Hobbie.\" Throughout his life, he introduced himself as Hobbie, asking people to address him by his nickname and saying that he hated the name Derek.\nKlivian honed his piloting skills Skystrike Academy, an elite flight academy on the planet Montross, training under Instructor Goran. He trained others in asteroid running and no-instrument navigation. One day Klivian met fellow pilot Wedge Antilles while playing several hands of Sabacc at their baracks. He also met Rake Gahree. However, Klivian, along with many of his peers, eventually wanted to contact the growing rebellion against the Empire and use his skills to fight.\nAntilles and Gahree were also discontent with the direction they felt the Empire was taking and made plans to defect to the rebellion. This information eventually made its way to one of the many Fulcrum agents, who became the link Klivian needed. Fulcrum passed the information to the Phoenix Cell.\nThe information also caught the attention of the Imperial Security Bureau, which dispatched Lothal sector's Governor Arihnda Pryce as well as agent Kallus to investigate the claims. Hobbie, Antilles and Gahree argued that they knew about their planned defection. However, fellow cadet Ria Talla, secretly undercover rebel Sabine Wren, overheard and told Antilles that she would help them defect.\nLater, Hobbie and his friends found an opportunity to escape when Goran ordered the cadets to take part in a mock combat exercise in space. Sabine arranged for her rebel comrades Ezra Bridger and Kanan Jarrus to rendezvous their CR90 corvette near the planet. At Sabine's signal, Hobbie and his comrades flew towards the rebel corvette. However, Pryce deactivated the TIEs' solar collector panels, leaving them derelict in space. Pryce also ordered Captain Vult Skerris to shoot one of the TIE pods as a warning; claiming the life of Rake. Hobbie, Sabine and Wedge were soon arrested by Imperial forces.\nFollowing their capture, Wedge and Hobbie were thrown into a holding cell by Kallus. Inside the two debated their escape plans with Wedge suggesting they surprise the guards. A demoralized Hobbie was dubious of their chances of success due to the lack of an escape plan. Fortunately for them, they were rescued by Sabine, who had managed to knock out Governor Pryce. The defectors and Sabine then fled down a corridor only to run into Agent Kallus. However, the ISB agent had a change of heart due to his previous encounter with Sabine's rebel cell and allowed them to escape.\nHeading to Hangar 24, Hobbie and his friends fled on a TIE bomber. They managed to flee into the atmosphere but were pursued by Captain Skerris. At the eleventh hour, they were rescued by Ezra's CR90 corvette and managed to flee aboard. Hobbie, Wedge, and their rebel rescuers then traveled to the Phoenix base on Atollon. There, Wedge and Hobbie were greeted by Commander Jun Sato who formally welcomed them into the rebellion. Eventually, the two distinguished themselves in their early engagements.\nA short while after his defection from the Empire, Hobbie, along with the rest of the Spectres and Phoenix Squadron were to take part in a training exercise. Shortly before they left, Hobbie and Wedge were conversing in the hanger despite the fact that they were behind schedule. They suddenly heard Hera Syndulla call for them, and in the shock to get ready, the two ran straight into each other. In their absence after they left, Chopper Base was infiltrated by the E-XD-series infiltrator droid EXD-9, who was searching the Outer Rim Territories for rebel bases. The Lasat Garazeb Orrelios, the inventory droid AP-5, and the astromech droid Chopper managed to capture and reprogram the droid as an improvised rigged bomb which destroyed an Imperial Star Destroyer.\nEventually, all of the individual rebel cells grouped together to reorganize into the Alliance to Restore the Republic. Just as Phoenix Squadron had been preparing to make an attack on the Imperial factory on Lothal, the Chiss Grand Admiral Thrawn managed to discover the location of Chopper Base, and subsequently launched an all-out attack in an attempt to finally thwart out their rebel actives, which had become a legitimate threat to the Empire. During the ground assault, Hobbie, Wedge and two other rebel pilots launched their A-wing starfighters in order to counter the AT-AT walkers that had been stationed on the planet's surface. With Wedge signaling Hobbie to follow him, the duo attempted to attack the walkers; however, Thrawn quickly took note of their excursion, and dispatched TIE fighters to repel them. The A-wings and the TIE-fighters consequently engaged in a dogfight. Towards the latter part of the battle, the two managed to escape, along with the remnants of Phoenix Squadron and General Jan Dodonna's Massassi Group to Yavin 4.\nAround this time, Klivian went undercover and attended the Prefsbelt Fleet Camp with Biggs Darklighter. Together they were posted to the Imperial starship Rand Ecliptic, aboard which Darklighter received the commission of first mate. In a similar manner to Sabine years before, Klivian helped Darklighter defect to the Alliance to Restore the Republic.\nBy 0 BBY, Klivian was a member of Red Squadron, stationed at Base One on Yavin 4. During the mission to steal the technical readouts of the secret Death Star superweapon, he served as the standby for Red Six, although the position was ultimately filled by Jek Tono Porkins. Klivian tried to comfort his friend Wedge after he'd been left off the duty roster for the battle.\nDays later, it was Klivian's turn to be comforted by Wedge, after learning that he would not be participating in the Battle of Yavin.\nMonths later, he and Antilles took part in a training run sponsored by Syndulla. There they met Zev Senesca. The trio became friends based on the meeting. As the rebellion recovered and gathered their forces at Mako-Ta Space Docks, the pilots met up with Red Squadron and would-be Jedi Luke Skywalker in Mess Hall IV. Shortly after, the Galactic Empire launched an assault on the Alliance's base. Klivian was stuck aboard the Star Cruiser Republic with other pilots such as Skywalker, Antilles and Senesca. Thanks to Han Solo, the Rebel starfighters were eventually able to launch into battle, with Klivian, serving as a member of Rogue Squadron, an adhoc unit formed by Skywalker during the battle in honor of the actions of Jyn Erso.\nAfter the Battle of Yavin, Skywalker invited Klivian to join Rogue Squadron. Klivian joined, and he and Antilles became core members of the elite group. Klivian and Antilles flew together at multiple engagements, including the Battle of Distilon, the Battle of Perimako Major, and at least a dozen other worlds.\nThe Rebel Alliance eventually came to be stationed at Echo Base on the planet Hoth. After the rebel presence on the planet was discovered by Darth Vader's Death Squadron, Hobbie and other starfighter pilots attended a briefing by Princess Leia Organa prior to the impending Battle of Hoth. Klivian and Rogue Squadron would fly T-47 snowspeeders, with the squadron's X-wing starfighters kept in reserve to escape Hoth, to delay the landing Imperial ground forces while the rest of the station evacuated. Once this task was completed, the pilots would escort each individual transport away from the base, past the Imperial blockade. Skeptical that two fighters would be able to fight their way past an Imperial Star Destroyer, Organa nevertheless assured him that the base's v-150 ion cannon would provide enough cover for the escape.\nDuring the battle against the Empire's AT-AT walkers, Hobbie served as Skywalker's wingman, and he remained in the air for longer than the majority of rebel pilots. In addition to a high casualty rate, however, the rebels also lost their base's deflector shield generator to General Maximilian Veers's walker, Blizzard 1. After a hit crippled his snowspeeder, Hobbie did not eject from his ship and instead crashed it into the head of Blizzard 1. With the walker now decapitated, Hobbie's maneuver had saved numerous rebels from its cannons and blunted the Imperial advance.\nKlivian was a human male who stood 1.75 meters tall. While he was initially under the Galactic Empire as part of Skystrike Academy, Klivian and many others were discontent with the regime. Thanks to agent Fulcrum, he quickly joined the rebel Starfighter Corps, ultimately serving as an X-wing starfighter jockey.\nA pilot since childhood, Hobbie was a skilled enough to be in Rogue Group, a unit of X-wing aces in the Alliance Fleet.\nDerek Klivian was portrayed by Richard Oldfield in Star Wars: Episode V The Empire Strikes Back, in which he was credited only as \"Hobbie .\" Hobbie appears as an Imperial cadet in Star Wars Rebels, voiced by Trevor Devall.\nKlivian was originally scripted to die in The Empire Strikes Back by crashing his T-47 airspeeder into the \"head\" of Blizzard 1, the All Terrain Armored Transport leading the assault on Echo Base. The scene was never finished, and thus never put in the final film. Preliminary footage of the unfinished scene was later released as part of the enhanced edition of The Making of The Empire Strikes Back book. Sources like the Databank on StarWars.com or the Star Wars: Card Trader say that Klivian managed to eject from the cockpit of his snowspeeder before it could crash, though the reference book Star Wars: On the Front Lines later contradicted that by saying Klivian died during the Battle of Hoth. The author Daniel Wallace, in an interview with Eleven Thirty-Eight, clarified that the Lucasfilm Story Group pointed him to the planned scene, so he could incorporate it in the book. He also speculated that the planned scene took precedence before Star Wars Legends, where Klivian survived the battle and lived long after.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Derek_Klivian",
  "/wiki/Derek_Klivian/Legends",
  "/wiki/Sons_of_the_Sky",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars_(2015)_51",
  "/wiki/Rendezvous_Point_(short_story)",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Ralltiir",
  "/wiki/3_ABY",
  "/wiki/Hoth",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Phoenix_Squadron",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Rogue_Squadron",
  "/wiki/File:Hobbie-ESB.ogg",
  "/wiki/Planet",
  "/wiki/Rebel_pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/Skystrike_Academy",
  "/wiki/Wedge_Antilles",
  "/wiki/Rake_Gahree",
  "/wiki/Escape_from_Skystrike_Academy",
  "/wiki/Sabine_Wren",
  "/wiki/Battle_of_Yavin",
  "/wiki/Luke_Skywalker",
  "/wiki/Battle_of_Hoth",
  "/wiki/Death",
  "/wiki/T-47_airspeeder",
  "/wiki/Maximilian_Veers",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Blizzard_1",
  "/wiki/Homeworld",
  "/wiki/Time",
  "/wiki/Youngling",
  "/wiki/Pilot",
  "/wiki/Imperial_Academy",
  "/wiki/Montross",
  "/wiki/Flight_instructor",
  "/wiki/Goran",
  "/wiki/Asteroid",
  "/wiki/Fulcrum",
  "/wiki/Agent",
  "/wiki/Phoenix_Cell",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Lothal_sector",
  "/wiki/Governor",
  "/wiki/Arihnda_Pryce",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Imperial_cadet",
  "/wiki/Spectres",
  "/wiki/Cadet",
  "/wiki/Realspace",
  "/wiki/Ezra_Bridger",
  "/wiki/Kanan_Jarrus",
  "/wiki/CR90_corvette",
  "/wiki/Corvette",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Solar_collector",
  "/wiki/Captain",
  "/wiki/Vult_Skerris",
  "/wiki/Hangar",
  "/wiki/TIE/sa_bomber",
  "/wiki/Standard_hour",
  "/wiki/Chopper_Base",
  "/wiki/Atollon",
  "/wiki/Commander",
  "/wiki/Jun_Sato",
  "/wiki/EXD-9%27s_infiltration_of_Chopper_Base",
  "/wiki/E-XD-series_infiltrator_droid",
  "/wiki/EXD-9",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Lasat",
  "/wiki/Garazeb_Orrelios",
  "/wiki/AP-5",
  "/wiki/Astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Massassi_Group",
  "/wiki/Yavin_4",
  "/wiki/Prefsbelt_Fleet_Camp",
  "/wiki/Biggs_Darklighter",
  "/wiki/Starship",
  "/wiki/Rand_Ecliptic",
  "/wiki/First_Mate",
  "/wiki/Standard_year",
  "/wiki/Mutiny_on_the_Rand_Ecliptic",
  "/wiki/0_BBY",
  "/wiki/Great_Temple",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Red_Six",
  "/wiki/Jek_Tono_Porkins",
  "/wiki/Zev_Senesca",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Mess_Hall_IV",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Star_Cruiser",
  "/wiki/Republic_(MC80A_Home_One_Type_Heavy_Star_Cruiser)",
  "/wiki/Han_Solo",
  "/wiki/Jyn_Erso",
  "/wiki/Yavin_Prime",
  "/wiki/Battle_of_Distilon",
  "/wiki/Battle_of_Perimako_Major",
  "/wiki/Echo_Base",
  "/wiki/Anakin_Skywalker",
  "/wiki/Death_Squadron",
  "/wiki/Starfighter",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/X-wing_starfighter",
  "/wiki/Imperial_Army",
  "/wiki/Imperial_Military",
  "/wiki/Transport",
  "/wiki/Blockade",
  "/wiki/V-150_Planet_Defender",
  "/wiki/Ion_cannon",
  "/wiki/Walker",
  "/wiki/Deflector_shield_generator",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Starfighter_Corps",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Richard_Oldfield",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Trevor_Devall",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/The_Making_of_The_Empire_Strikes_Back",
  "/wiki/Databank_(website)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Daniel_Wallace",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Images_of_Derek_Klivian",
  "/wiki/The_Antilles_Extraction",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/Star_Wars_Rebels_Magazine_33",
  "/wiki/Warhead_(episode)",
  "/wiki/Zero_Hour",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Rogue_Two_(short_story)",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Heroes_of_the_Rebellion_(short_story)",
  "/wiki/The_Truest_Duty",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_5",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_7",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_20",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Phoenix_Cell_Squadron_Pack",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back:_Special_40th_Anniversary_Collector%27s_Edition",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Secret_Cargo",
  "/wiki/Star_Wars_(2015)_55",
  "/wiki/July_24",
  "/wiki/2017",
  "/wiki/July_1",
  "/wiki/2019"
 ]
}