{
 "name": "Derembus Sitnalta",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Outdoor Survival School",
      "Twilight Class",
      "Twilight Class",
      "Alliance to Restore the Republic",
      "Alliance Army",
      "Midnight Squadron",
      "Alliance Army",
      "Midnight Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Commander Derembus Sitnalta was a Human member of the Rebel Alliance Army.\nA veteran soldier in the time of the Galactic Republic, Sitnalta served at Ruac Outpost, where he met Sergeant Clenna.\nA former scout, Sitnalta studied in the prestigious Twilight Class of the Galactic Outdoor School of Survival. He was essential to save classmate Xenon Nnaksta's life from a tripion attack during the final test.\nAfterward, like most of his classmates, he joined Eclipse Team, a special unit of the Rebel Alliance. He was the heavy weapons crewer for starfighter unit Midnight Squadron. An aged human during this time, he rejected command positions, being an \"elder statesman\" and a veteran non-officer; however, he accepted a job in the Rebel Alliance Task Force, and the unofficial designation of commander.\nAlongside former classmate Ma'w'shiye, Sitnalta trained Rebel recruits in the use of high-powered blasters.\nAn associate of Rebel Lieutenant Alton Lochner and Sasnak Toxis, Sitnalta visited Corulag and then noticed slavers Chordak and Talas Piran dealing with their stock. Sasnak noticed that one of the slaves was a person he knew, and he had disliked Chordak for a time. The event became a fight until the prefect arrived; the Rebels ran away and the slaves were freed. Due to this, Piran kept a grudge towards those three Rebels, or so Sitnalta thought.\nAs a member of the Task Force, Sitnalta wrote reports on different threats he was familiar with, including GOSS headmaster Barosa Warren's slugthrower and Warren's associate Clenna. He also wrote on Ploovo Two-For-One's droid HN-TR1, which he considered more dangerous than IG-88, and about Talas Piran — Sitnalta was surprised when, researching on Piran, he discovered that Piran had been a slave.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Outdoor_Survival_School/Legends",
  "/wiki/Twilight_Class",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Army/Legends",
  "/wiki/Midnight_Squadron",
  "/wiki/Commander/Legends",
  "/wiki/Talas_Piran",
  "/wiki/Soldier/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ruac_Outpost",
  "/wiki/Clenna",
  "/wiki/Scout/Legends",
  "/wiki/Xenon_Nnaksta",
  "/wiki/Tripion",
  "/wiki/Eclipse_Team",
  "/wiki/Starfighter/Legends",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/Ma%27w%27shiye",
  "/wiki/Alton_Lochner",
  "/wiki/Sasnak_Toxis",
  "/wiki/Corulag/Legends",
  "/wiki/Chordak",
  "/wiki/Barosa_Warren",
  "/wiki/Ploovo_Two-For-One/Legends",
  "/wiki/HN-TR1",
  "/wiki/IG-88B",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Atin_Attan",
  "/wiki/Buran_Borsil",
  "/wiki/Norrion_Glidamir",
  "/wiki/Adazian_Liebke",
  "/wiki/Maashan",
  "/wiki/Sisquoc",
  "/wiki/Larq_Thur",
  "/wiki/Kiras_Torla",
  "/wiki/Akul_Witig"
 ]
}