{
 "name": "Dern",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Czerka Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Dern was a male Human serving as a Czerka Corporation patrol officer on Kashyyyk in 3956 BBY.\nDern was Czerka Corporation officer on Kashyyyk who was poaching tach in the Shadowlands hoping to make a couple of years worth of profits. To poach the tach he would spray a person with a mist of tach essence, which caused the tach in the surrounding area to become enraged and attack them. He wanted the tach glands from near their brains to use in Tarisian ale. However, Jolee Bindo interfered with Dern's plans by sending Revan on a task to find a way to drive them away from their base near his home on Kashyyyk. He told Revan to find a peaceful solution so the Wookiees would not get in trouble with Czerka because of it. Revan managed to gloat out Dern's secret of how he managed to keep large predators from attacking his camp; by using sonic emitters. Revan then persuaded the guards of these emitters and was able to shut them down. This caused a terentatek to come, which drove Dern and his camp off. Whether or not they escaped is unknown.\nDern was a money driven person, a trait common in many Czerka employees. He didn't care if he would make the tach population extinct as long it would make him a rich man. He also didn't have much concern about his guards or fellow employees, in fact he was not afraid to make an example out of anyone who would attempt to leave, and was known to kill anyone who would disobey orders. He wasn't someone who would make deals or be persuaded easily.\nIn the game Knights of the Old Republic, the player can take an alternate option to do work for Dern by poaching the tach and earn credits, as well as dark side points.\nOther alternative options include threatening Dern to shut down his camp by killing everyone and manipulating the Czerka guards into abandoning their posts, after which Dern kills them.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/3956_BBY",
  "/wiki/Tach/Legends",
  "/wiki/Shadowlands/Legends",
  "/wiki/Tarisian_ale",
  "/wiki/Jolee_Bindo",
  "/wiki/Revan/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Terentatek",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}