{
 "name": "Derral%27s_friend",
 "display_name": "Derral's friend",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ahakista"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Ahakista"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ahakistan Council",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "This man was a councilman on the planet Ahakista and a friend of Councilman Derral.\nDerral's friend was not particularly given toward the idea of touring the poorer parts of the city since he felt that the things for sale there were not of the highest quality. Chief among his objections to Derral's tour was the fact that Ahakista's Imperial-backed government was not popular with the lower classes. The planet's poorer citizens had recently expressed their displeasure toward the government through protests and more violent means.\nWhen Derral complained about the quality of the wares that the street vendors were selling, his friend took the opportunity to remind him of his objections to the trip. As Derral tried to reassure him that his worries were unfounded, they encountered a young beggar who asked Derral for a token of his goodwill. Derral did so, but not in the way that the child had expected.\nThe two councilmen walked back to a waiting landspeeder and Derral's friend fell a distance behind him. As Derral was getting inside, his friend called for him to wait. Both of them were killed by Dunlan. The assassination of the two councilmen led to the Empire to take a more direct role in the affairs of Ahakista's government and consequently an escalation of the civil war.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ahakista/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Ahakistan_Council",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Council",
  "/wiki/Planet/Legends",
  "/wiki/Derral",
  "/wiki/Ahakistan_Civil_War",
  "/wiki/Landspeeder/Legends",
  "/wiki/Dunlan",
  "/wiki/Rebellion_6",
  "/wiki/Rebellion_7"
 ]
}