{
 "name": "Dersa_Welles",
 "display_name": "Dersa Welles",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Intarsa League"
     ]
    }
   ]
  }
 ],
 "content": "Dersa Welles was a female human Force Adept and scoundrel who led the Intarsa League criminal faction during the latter years of the Galactic Republic.\nDersa Welles was a female human Force Adept who was a member of the Intarsa League criminal faction. Welles ascended to become the leader of the League and in around 31 BBY she led the League during the relocation of their operations into the Cularin system. After briefly basing themselves within the Cularin system asteroid belt, Welles and the League settled in the crime-ridden city Tolea Biqua on the world Genarius, the star system's third planet, from where they ran a number of scams on platform city Bayonard, in the neighboring planet Cularin.\nAfter falling out with some of the other criminal groups that operated in Tolea Biqua, Welles and the Intarsa League were forced to flee Genarius. Taking haven on Cularin, Welles and the League seized the Blue Star Centre, a philosophical research center, and held the facility's occupants hostage. Welles demanded that in return for the safe release of the hostages that the criminals who attacked the Intarsa Legaue be apprehended and that the League be provided with a ransom of 10,000 and a starship so that they could leave the Cularin system. However, the Office of Peace and Security, a local law enforcement agency, and the Heroes of Cularin attacked Welles and the Intarsa League and freed the hostages from them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Intarsa_League",
  "/wiki/Force_Adept",
  "/wiki/Scoundrel",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Cularin_system",
  "/wiki/Cularin_system_asteroid_belt",
  "/wiki/City/Legends",
  "/wiki/Tolea_Biqua",
  "/wiki/Planet/Legends",
  "/wiki/Genarius",
  "/wiki/Star_system/Legends",
  "/wiki/Platform_city",
  "/wiki/Bayonard",
  "/wiki/Cularin/Legends",
  "/wiki/Blue_Star_Centre",
  "/wiki/Philosopher/Legends",
  "/wiki/Credit",
  "/wiki/Starship/Legends",
  "/wiki/Office_of_Peace_and_Security",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Skirmish_in_the_Blue_Star_Centre",
  "/wiki/Operation_Blue_Star"
 ]
}