{
 "name": "Desic_Malboan",
 "display_name": "Desic Malboan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Thaereian military",
      "Thaereian Intelligence",
      "Thaereian Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Desic Malboan, was a Sullustan male who served in the Thaereian system, an armed force from the Thaereian system, during the Clone Wars. Around 21 BBY, while on duty aboard the CR90 corvette Thaere Runner on customs duty in the Cularin system, Malboan attached a tracking beacon to a starship that the Thaereians had stopped for inspection.\nDesic Malboan was a Sullustan male scoundrel who served as a soldier in the Thaereian military, an armed force from the Thaereian system, during the Clone Wars. Malboan was a member of the military's Thaereian Intelligence information-gathering branch and he held the rank of corporal. Around 21 BBY, he was assigned to serve aboard the CR90 corvette Thaere Runner on customs duty in the Cularin system, a star system that the Thaereian miltary had been chartered by the Galactic Republic to defend. Malboan had orders to secretly attach tracking beacons to all starships that the customs corvette inspected, so that the Thaereians could track the vessels' movements.\nWhile Malboan was on duty, a starship bound for the planet Druckenwell was boarded by the Thaere Runner near to a comet cloud on the edge of the Cularin system. As the vessel's crew were questioned by the Bothan Thaereian officer Lieutenant Toric Bisilt, Malboan and two other soldiers were ordered by Bisilt to search the suspect ship for contraband. Amid the inspection, Malboan fitted a tracking beacon in a hidden spot near to the vessel's hyperdrive—a device that facilitated travel through hyperspace—where the tracker was concealed from sensor scans and visual inspection. The Thaereians then released the ship and allowed it to proceed to Druckenwell.\nMalboan was multi-lingual; he could read and write Basic and Sullustan and could also speak the languages Bothan and Rodian.\nWhile inspecting the starship boarded by the Thaere Runner near to the Cularin system comet cloud, Malboan wore a breath mask, blast vest and blast helmet. He was also armed with a blaster carbine.\nDesic Malboan appeared within Star Wars Legends continuity in Outward Bound, a 2002 roleplaying adventure by Morrie Mullins and Lee Pickler that formed part of the Looking In trilogy of RPGA's Living Force campaign. In the adventure, the players roleplay as the crew of the starship encountered by the Thaere Runner on the edge of the Cularin comet cloud. It is possible for the players' vessel to be boarded by the Thaere Runner, in which case Malboan attempts to attach a tracking beacon to the their ship. It is alternately possible for the players to engage in combat with Malboan and the other Thaereians when the crew of the Thaere Runner attempt to board the players' vessel. It is also possible for the player characters to destroy the Thaere Runner, in which case Malboan and the rest of the corvette's crew are killed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Thaereian_military",
  "/wiki/Thaereian_Intelligence",
  "/wiki/Thaereian_system",
  "/wiki/Army/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Thaere_Runner",
  "/wiki/Cularin_system",
  "/wiki/Homing_beacon/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Thaereian",
  "/wiki/Scoundrel",
  "/wiki/Soldier/Legends",
  "/wiki/Corporal/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Thaereian_Navy_charter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Corvette/Legends",
  "/wiki/Outward_Bound_(Living_Force_adventure)",
  "/wiki/Canon",
  "/wiki/Planet/Legends",
  "/wiki/Druckenwell/Legends",
  "/wiki/Cularin_comet_cloud",
  "/wiki/Cularin/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Bothan/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Toric_Bisilt",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Language/Legends",
  "/wiki/Writing_system",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Sullustese/Legends",
  "/wiki/Bothese",
  "/wiki/Rodese",
  "/wiki/Comet/Legends",
  "/wiki/Cloud",
  "/wiki/Breath_mask/Legends",
  "/wiki/Blast_vest",
  "/wiki/Blast_helmet/Legends",
  "/wiki/Blaster_carbine/Legends",
  "/wiki/2002",
  "/wiki/Roleplaying_game",
  "/wiki/Morrie_Mullins",
  "/wiki/Lee_Pickler",
  "/wiki/Looking_In_trilogy",
  "/wiki/RPGA",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Death/Legends",
  "/wiki/Wizards.com",
  "/wiki/Over_Thaere",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/Time/Legends"
 ]
}