{
 "name": "Dessicus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "GenoHaradan"
     ]
    }
   ]
  }
 ],
 "content": "Dessicus was the leader of the GenoHaradan faction on Nar Shaddaa.\nMeetra Surik tracked him down in an attempt to get the bounty on her and her companions lifted. Dessicus had studied her combat movements, and was confident that he could defeat her. He lost, however, and suffered mortal injuries. However, once his vital signs began to fail, the headquarters initiated a self-destruct program, and Surik barely escaped with her life. The explosion destroyed all evidence that the GenoHaradan were on the planet, in accordance with their secrecy policy.\nDessicus was originally supposed to be found in the underground citadel beneath the Jekk'Jekk Tarr. When the citadel self-destructed, Surik would have been rescued from a fiery death by Zez-Kai Ell, though her companions, as well as Darth Sion, would believe her to be dead for a short time. When the GenoHaradan were removed from Star Wars: Knights of the Old Republic II: The Sith Lords, presumably due to time constraints, the underground hideout was reassigned to Visquis.\nThe GenoHaradan, with Dessicus, was to be restored by The Sith Lords Restoration Project, taking place much later in the game than originally intended. The project was eventually abandoned, but the GenoHaradan has since been restored as a standalone mod.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/3951_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/GenoHaradan",
  "/wiki/Meetra_Surik",
  "/wiki/Jekk%27Jekk_Tarr",
  "/wiki/Zez-Kai_Ell",
  "/wiki/Darth_Sion",
  "/wiki/Cut_content_from_Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Visquis",
  "/wiki/The_Sith_Lords_Restoration_Project"
 ]
}