{
 "name": "Destha",
 "display_name": "Destha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Selonian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue and white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Murthil's den",
      "Elite Selonian Guard",
      "Elite Selonian Guard"
     ]
    }
   ]
  }
 ],
 "content": "Destha was a female Selonian who served her den mother Murthil in the latter's Elite Selonian Guard during the Galactic War.\nDuring the Sith Empire's invasion of Corellia in 3640 BBY, Destha and a handful of elite guards accompanied Murthil in the den mother's tunnels of the Selonian Tunnel Network in Coronet City's Labor Valley, where the Selonians of Murthil's den aided Corellian rebels who had fled underground. The Selonians' actions were discovered by the Empire, however, and the latter's invasion force leader, Darth Decimus, sent an Imperial task force to dispatch Murthil and thus quell the unrest.\nHunkered down in Murthil's bunker behind a force field, the Elite Selonian Guards readied to face Imperial forces. When an Imperial hero barged into the Selonian's room, Murthil called for the individual to lay down arms and surrender, although it was in vain. The two sides clashed, and the Imperial ultimately wiped out the Selonian Guard before defeating their den mother, putting an end to the uprising.\nA Selonian female, Destha had blue and white fur as well as dark eyes.\nUnlike the other Elite Selonian Guards, Destha was equipped with twin blaster pistols instead of either an electrostaff or a single blaster pistol.\nDestha appears in the video game Star Wars: The Old Republic. If the player chooses to lie about the Imperial forces' agreement to Murthil's call for surrender, the Imperial is instructed to remain still as Destha is commanded by the den mother to take the Imperial player's weapon. However, the player then either stabs or fire at the approaching Destha, killing the Guard and thus breaking a promise. Murthil is angered by the lying, and rallies her guards to down the Imperial. Whichever choice is taken by the player during this mission, the Selonian uprising is quelled by the Imperial strike team and all of Murthil's guards, including Destha, are killed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3640_BBY",
  "/wiki/Corellia/Legends",
  "/wiki/Selonian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Murthil%27s_den",
  "/wiki/Elite_Selonian_Guard",
  "/wiki/Force-field_generator",
  "/wiki/Den_mother",
  "/wiki/Murthil",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Battle_of_Corellia",
  "/wiki/Bodyguard/Legends",
  "/wiki/Selonian_Tunnels",
  "/wiki/Coronet_City/Legends",
  "/wiki/Labor_Valley",
  "/wiki/Corellian/Legends",
  "/wiki/Darth_Decimus",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Force_field/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Electrostaff/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Pistol/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Template:TOR_dates"
 ]
}