{
 "name": "Detorkro_Gaan",
 "display_name": "Detorkro Gaan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  }
 ],
 "content": "Detorkro Gaan was a male Zabrak who lived during the reign of the Galactic Empire. Over the years, Gaan made a living through various combat-related occupations: he had been a pit fighter, gladiator, professional fencer, and a champion of the Hutt arenas. By the time of the second Death Star's destruction, Gaan was living in the Anoat sector, where he found himself trapped behind the Imperial governor's Iron Blockade. The Zabrak veteran eventually found work with the crew of a talented young smuggler, carrying out a number of jobs on behalf of his new employer.\nTrained in warfare, Detorkro Gaan was a skilled fighter who preferred to take the offensive in combat, and favored the use of a sword. A muscular Zabrak, Gaan possessed red hair and yellow skin, upon which he tattooed distinctive black markings around his head and face.\nDetorkro Gaan first appeared in Star Wars canon in the multiplayer mobile game Star Wars: Uprising, created by the Kabam company and released on September 10, 2015 for iOS and Android platforms. Gaan acts as a potential crewmate for the player character, able to be tasked with carrying out timed quests to recover valuable loot.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Zabrak",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Tattoo",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Standard_year",
  "/wiki/Gladiator",
  "/wiki/Hutt",
  "/wiki/Time",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_of_Endor",
  "/wiki/Anoat_sector",
  "/wiki/Governor",
  "/wiki/Iron_Blockade",
  "/wiki/The_Smuggler",
  "/wiki/Sword",
  "/wiki/Hair",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Kabam",
  "/wiki/September_10",
  "/wiki/2015",
  "/wiki/IPhone",
  "/wiki/Android_(operating_system)"
 ]
}