{
 "name": "Deva Lompop",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Shani"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Multicolored"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nihil",
      "Kara Xoo's Tempest",
      "Kara Xoo's Tempest",
      "Jabba's criminal empire",
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "Deva Lompop was a Shani female bounty hunter, marauder, and mercenary who operated from the time of the High Republic into the Imperial Era.\nIn 230 BBY, during the High Republic Era, Lompop was a member of the marauders known as the Nihil and served under Tempest Runner Kara Xoo. She was placed in charge of handling the children kidnapped by Xoo's Tempest, including Avon Starros, and caught Starros when she first tried to escape, delivering her to Zadina Mkampa and threatening to eat the girl if she tried again. While with the Nihil, she helped the Nautolan girl Vroma stop bullies from taking a durga berry meant for the girl's mothers, and then launched an attack on Hon-Tallos.\nAt some point, Jabba the Hutt saved Lompop's life, leaving her in his debt. One of the first jobs that bounty hunter pair 4-LOM and Zuckuss took together was in Lompop's employ, hunting the Culisetto warlord Cribiriz Idollax.\nBy the time of the Imperial Era, Lompop had moved on from bounty hunting to other work as an information broker operating out of the Dalnan sector, but was frequently pulled away from this work by Jabba's request. On one occasion she was invited to Jabba's palace and coerced into joining Boba Fett in a hunt for Jarm Brock, a Zabrak mercenary with whom Lompop had previously been romantically involved and who Jabba believed was attacking his men under the orders of Bokku. Fett and Lompop tracked down Brock and engaged in a firefight, which ended with Fett cornering Brock and Lompop killing his men. However, Lompop betrayed Fett, stabbing him with a poisoned dagger and knocking him unconscious, though not before he burned her with his flamethrower. Lompop interrogated Brock, revealing that the Zabrak had in fact been hired by Crimson Dawn, rather than Bokku. Lompop proceeded to unhinge her jaw and eat Brock alive, leaving only his head which she delivered to Jabba. The Hutt refused to clear Lompop's debt as he had promised, citing the fact that Brock wasn't returned alive.\nSome time later, Jabba called Lompop in to aid in the hunt for the carbonite-frozen smuggler Han Solo, though she secretly had contacted Crimson Dawn with the hope of killing Jabba. Tracking Boba Fett to the moon of Nar Shaddaa, she learned from a bystander that someone with similar armor to Fett had contacted Doc Ragon. She found Ragon at a bar and seduced him into getting drunk and revealing that he had been paid to inspect the carbonite-frozen Solo by Fett. Lompop informed both Jabba and Crimson Dawn of Fett's location, for which she was paid, and Margo promised her a chance to kill the Hutt sometime in the future.\nThe bounty hunter Boushh encountered Deva Lompop on Ord Mantell after completing a bounty for Gyuti. Lompop warned Boushh that his bad blood with Black Sun would cost him, and that if he was unlucky she would be sent to deal with him. Lompop continued to work in the employ of Crimson Dawn, hiring RB-919 on their behalf to restore the destroyed assassin droid IG-88. After the rebuilt IG-88 killed RB-919, he contacted Lompop, who gave him a mission to pursue Boba Fett.\nDeva Lompop was a renowned bounty hunter, though some of her colleagues held her in contempt. Lompop was a capable combatant, able to match or even exceed the ability of Boba Fett while fighting Jarm Brock's men. Like other members of her species she had sharp, jagged teeth and the ability to unhinge her jaw. It was rumored that her species could swallow sentients whole, but she was unable to completely consume Jarm Brock due to his horns. She healed quickly, and despite having half of her face and body charred by Boba Fett's flamethrower she had no signs of her injuries by the time she was hired to track Fett down. Her information gathering enterprise had many employees and an elaborate headquarters.\nLompop's personality was sardonic and it was sometimes unclear whether she was joking or threatening others. She lived up to the reputation of her species as maneaters, remarking to Boba Fett that she usually ate her former romantic partners, threatening to eat Avon Starros and a young bully who had been tormenting Vroma, and once remarking that she'd look for someone to eat on Naboo after a job. She preferred her meals to be alive, remarking that she had a distaste for \"cold\" food, though she also enjoyed roast ghara bird served at Jabba's Palace. However, she was shown to have some moral standards, aiding Vroma without seeking any payment and frowning upon Jabba's use of slave pits.\nLompop carried a variety of weapons, including knives and blasters, and wore plated armor. Her gauntlets contained hidden blades, which on at least one occasion were coated with a nonfatal but incapacitating poison. When not on a job she wore an elaborate blue gown and a turban.\nDeva Lompop was created by writer Justina Ireland and artist Iban Coello for the Star Wars: War of the Bounty Hunters comic crossover event. She debuted in War of the Bounty Hunters – Jabba the Hutt 1. The character was revealed n an article published on StarWars.com on June 24, 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bounty_hunter",
  "/wiki/Deva",
  "/wiki/Lompop",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Deva_Lompop",
  "/wiki/Shani",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Nihil",
  "/wiki/Kara_Xoo%27s_Tempest",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Crimson_Dawn",
  "/wiki/Marauder",
  "/wiki/Mercenary",
  "/wiki/Time",
  "/wiki/High_Republic_Era",
  "/wiki/Imperial_Era",
  "/wiki/230_BBY",
  "/wiki/Tempest_Runner",
  "/wiki/Kara_Xoo",
  "/wiki/Tempest",
  "/wiki/Avon_Starros",
  "/wiki/Zadina_Mkampa",
  "/wiki/Nautolan",
  "/wiki/Youngling",
  "/wiki/Vroma",
  "/wiki/Durga_berry",
  "/wiki/Attack_on_Hon-Tallos",
  "/wiki/Hon-Tallos",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/4-LOM",
  "/wiki/Zuckuss",
  "/wiki/Culisetto",
  "/wiki/Cribiriz_Idollax",
  "/wiki/Dalnan_sector",
  "/wiki/Zabrak",
  "/wiki/Bokku",
  "/wiki/Flamethrower",
  "/wiki/Carbonite",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Nar_Shaddaa",
  "/wiki/Ragon",
  "/wiki/Margo",
  "/wiki/Boushh",
  "/wiki/Ord_Mantell",
  "/wiki/Gyuti",
  "/wiki/Black_Sun",
  "/wiki/RB-919",
  "/wiki/IG-88B",
  "/wiki/Naboo",
  "/wiki/Ghara_bird",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Slavery",
  "/wiki/Knife",
  "/wiki/Blaster",
  "/wiki/Armor",
  "/wiki/Poison",
  "/wiki/Justina_Ireland",
  "/wiki/Iban_Coello",
  "/wiki/Star_Wars:_War_of_the_Bounty_Hunters",
  "/wiki/Star_Wars_comic_books",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_Jabba_the_Hutt_1",
  "/wiki/StarWars.com",
  "/wiki/June_24",
  "/wiki/2021",
  "/wiki/Category:Images_of_Deva_Lompop",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_A_Very_Nihil_Interlude",
  "/wiki/Star_Wars_Adventures_(2020)_14",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/The_High_Republic:_Mission_to_Disaster_(audiobook)",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_4-LOM_%26_Zuckuss_1",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_Boushh_1",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_IG-88_1",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Destruction_of_Starlight_Beacon"
 ]
}