{
 "name": "Devi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Devi was a human female scavenger on Jakku around thirty years after the Battle of Endor. She and her partner Strunk helped Rey scavenge for a long-buried 690 light freighter. The two then absconded with it to escape the planet after Rey piloted it to Niima Outpost.\nBorn roughly a decade after the Battle of Endor, Devi spent most of her life scavenging on Jakku. She worked with Strunk, a scavenger known for his strength but not his intelligence. Both of them wanted to leave Jakku someday.\nAccording to Devi, she and Strunk once saw a Nightwatcher worm in the Sinking Fields, one so large it could have eaten Niima Outpost in one bite. They told this to fellow scavanger Rey, but she did not believe them, partially because the duo had made other dubious claims in the past.\nSome time before the Battle of Starkiller Base, Devi noticed that Rey was holding back valuable salvage for herself and spending time repairing relatively worthless parts. Assuming that their fellow scavenger was building something and curious what, Devi and Strunk confronted Rey at the cleaning stations in Niima Outpost. When Rey declined to share her plans, Devi seemingly backed off, but warned Rey if she was noticing the strange behavior, others would notice too.\nDevi and Strunk managed to trail Rey and discovered what the project was ten days later: Rey had found an almost completely intact Ghtroc 690 freighter. With the right parts, the ship would be able to fly again. Amazed at Rey's good fortune and aware of other useful parts, Devi and Strunk offered to help repair the Ghtroc in exchange for coming with when Rey used it to leave Jakku. When Rey explained that she was going to sell it to Unkar Plutt, Devi prevented Strunk from responding and brokered a deal. In exchange for helping repair the ship, she and Strunk would get half the profits from the sale .\nThe new-business partners began fixing the Ghtroc, with Devi and Strunk being able to quickly supply parts that Rey could not have found on her own. As work progressed, Devi and Strunk began secretly camping out near the ship to guard their investment.\nTwo weeks later, when the Ghtroc was repaired enough to fly , Devi was a passenger on the test flight. Much to her exuberation, the ship worked. That night, while guarding the ship, Devi and Strunk found Rey, who had returned to the site, fending off Teedo interlopers. The two joined in the defense of it, driving the Teedos away. Devi admitted that she and Strunk had been secretly guarding the wreck for two weeks.\nDevi also told Rey that she had she knew where to find a hyperdrive to complete the Ghtroc. Rey suggested that Devi guard the ship, while see and Strunk retrieve the hyperdrive. When Rey and Strunk returned with the drive the following evening, Rey had enough trust in Devi and Strunk to offer to let them sleep inside the Ghtroc, where it would be warmer.\nTwo days after collecting and installing the drive , the trio flew their ship into Niima Outpost, making a show of it. Rey left Devi and Strunk onboard while she went off to sell the ship to Unkar. Once their partner was gone, Devi and Strunk stole the ship, using it to leave Jakku, the only reason they had helped in the first place, leaving Rey with nothing.\nSome time later, Rey wrote about Devi in her journal, expressing her distrust for her fellow scavenger and calling her a \"swindler\" as well as alluding to the Ghtroc incident.\nAbout Rey's age and built small, Devi kept her hair cut short. The smarter one between her and her partner, she acted as the leader. She brokered the decision to split Rey's salvage of the freighter, taking advantage of the situation to make a deal that Rey felt was unfair but could not see a safe way to decline.\nDespite this, Devi presented a cheerful disposition during the salvage and managed to integrate herself with Rey to the extent of gaining her trust, all while planning to betray her. This was successful partially since Rey could not comprehend anyone wanting to leave Jakku and partially since Rey wanted to trust Devi.\nDevi had a reputation for making unbelievable claims. Her tendencies to talk a lot annoyed Rey.\nIn a fight, Devi was quick and, in Rey's estimation, more dangerous than Strunk. Devi carried a vibro-knife and a shortened shock stick. She also had a small blaster with an indeterminate number of shots.\nDevi first appeared in the 2015 canon novel Before the Awakening, written by Greg Rucka as a prelude to Star Wars: Episode VII The Force Awakens.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Scavenger",
  "/wiki/Jakku",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Strunk",
  "/wiki/Rey_Skywalker",
  "/wiki/690_light_freighter",
  "/wiki/Planet",
  "/wiki/Pilot",
  "/wiki/Niima_Outpost",
  "/wiki/Standard_decade",
  "/wiki/Nightwatcher_worm",
  "/wiki/Sinking_Fields",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Time",
  "/wiki/Standard_day",
  "/wiki/Freighter",
  "/wiki/Starship",
  "/wiki/Unkar_Plutt",
  "/wiki/Standard_week",
  "/wiki/Hyperdrive",
  "/wiki/Teedo",
  "/wiki/Sleep",
  "/wiki/Rey%27s_survival_guide",
  "/wiki/Hair",
  "/wiki/Vibro-knife",
  "/wiki/Electrostaff",
  "/wiki/Blaster",
  "/wiki/2015",
  "/wiki/Before_the_Awakening",
  "/wiki/Greg_Rucka",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Rey%27s_First_Flight",
  "/wiki/Galactic_Adventures_Storybook_Collection",
  "/wiki/Rey%27s_Survival_Guide",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}