{
 "name": "Devidia Vennsiol",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sacorria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White and red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  }
 ],
 "content": "Devidia Vennsiol was a Human woman from the planet Sacorria. The daughter of a powerful local official, she was spoiled as a child and began using her good looks and charisma to manipulate boys. Exasperated, her father sent her to military school, but it had little effect on her personality. Shortly after finishing school with an unimpressive record, Vennsiol and her boyfriend, Dorbus Kyrullus, broke into a Safidine Industries laboratory. Stealing several powerful prototype blaster pistols, the pair escaped, but Kyrullus was soon captured with much of the weaponry. This left Vennsiol alone on the run with only two of the prototypes. Safidine placed a bounty on her head, offering 5,000 for her return dead or alive and 70,000 for the return of the pistols.\nDevidia Vennsiol was born the daughter of a powerful local official on the planet Sacorria. As a child, she was spoiled by her father, who let her get away with whatever she pleased, and she quickly learned to get men to do what she wanted using her charisma and good looks. When Vennsiol was a teenager, her father placed her in a military school to try and counter the effects of her pampered childhood, but she continued to manipulate men at the school. Apart from learning to use a variety of weapons at the school, Vennsiol's time there was not overly productive, and she left with an unimpressive record.\nFollowing her time at military school, Vennsiol and a male named Dorbus Kyrullus, whom she had begun dating, broke into a laboratory belonging to Safidine Industries, a weapons contractor that worked with the Galactic Empire. The laboratory was working on a series of high-powered blaster pistol prototypes, with several finished items stored in the facility. Vennsiol and Kyrullus managed to get away with a large number of the prototypes, but Kyrullus was later captured, and many of the weapons were recovered with him. Vennsiol, however, evaded capture and escaped with two prototypes, prompting Safidine to place a bounty on her head. They offered 5,000 to any individual holding an Imperial Peace-Keeping Certificate who could bring the criminal in dead or alive, with an additional 70,000 available if the prototypes were also recovered. One month after the break in and a week after Vennsiol had been sighted in the Core Worlds, the bounty was posted on the Imperial Enforcement DataCore by the Imperial Office of Criminal Investigations.\nA Human female with white-and-red hair, pale skin, and blue eyes, Vennsiol chose to wear her hair partially braided into a plait, with a red dot tattoo on her forehead and another red tattoo on her left arm. She grew up being able to do as she pleased and with the looks and charisma to bend most men to her will. She was able to bluff, intimidate, and persuade others with greater ease than most individuals, and she was also skilled at disguising herself. Vennsiol was also a perceptive individual, especially at determining the motives of others and noticing sounds. Despite her father's displeasure at the route her life was taking by her teenage years, she continued her spoiled behavior, eventually taking it to the next level and actually committing a crime.\nVennsiol was a particularly dexterous individual. While at military school, the only skill to which she applied herself was learning how to use weapons—by the time Vennsiol left the school, she could wield blaster pistols, blaster rifles, vibroblades, and heavy weaponry. She was capable of operating starships and other vehicles, as she was able to pilot and astrogate with a reasonable level of skill. In addition, she was skilled in placing demolitions and using computers as well as repairing and disabling mechanical devices. Vennsiol could speak Galactic Basic Standard, Huttese, and Rodese, although the only language in which she was literate was Basic. She had considerable knowledge of galactic politics and organized crime as well as enough knowledge of trade to be able to appraise the value of many items.\nDuring her time on the run, Vennsiol carried the two prototype blaster pistols that remained from her and Kyrullus's robbery as well as a hold-out blaster and a deluxe security kit. She chose to wear a revealing piece of fine, black-colored clothing and platform boots, along with a utility belt that included dual holsters for the pistols.\nDevidia Vennsiol was created as part of the \"Bounties to Die For\" article in the sixth issue of Wizards of the Coast's Star Wars Gamer magazine series. The article was written by S. Mitch Ritchie and was illustrated by Ramón Pérez. The magazines were supplements for the Star Wars Roleplaying Game, and the bounties article provided roleplaying attributes for Vennsiol to allow for her to be used as an enemy or ally in the game. The article did not specify the era of play in which Vennsiol was active to allow for her use in multiple eras, although the bounty posting was made by the Empire and so must have taken place during its existence, after 19 BBY.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sacorria",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bounties_to_Die_For",
  "/wiki/Planet/Legends",
  "/wiki/Devidia_Vennsiol%27s_father",
  "/wiki/Youngling/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Unidentified_military_school",
  "/wiki/Dorbus_Kyrullus",
  "/wiki/Safidine_Industries",
  "/wiki/Unidentified_Safidine_Industries_laboratory",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Credit",
  "/wiki/Death/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Laboratory/Legends",
  "/wiki/Imperial_Peace-Keeping_Certificate/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Imperial_Enforcement_DataCore/Legends",
  "/wiki/Imperial_Office_of_Criminal_Investigations/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/Rodese",
  "/wiki/Language/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Security_kit/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Utility_belt/Legends",
  "/wiki/Holster/Legends",
  "/wiki/Star_Wars_Gamer_6",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Gamer",
  "/wiki/S._Mitch_Ritchie",
  "/wiki/Ram%C3%B3n_P%C3%A9rez",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Roleplaying_game",
  "/wiki/19_BBY/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}