{
 "name": "Devon Fuller",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Arkanis"
     ]
    },
    {
     "name": "Born",
     "values": [
      "40 BBY–36 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Devon Fuller was a Human male who worked as a smuggler before joining the Rebel Alliance during the Galactic Civil War. He helped the Rebels at their Ansarra Rebel base until it was raided by stormtroopers. Fuller made it out of the base alive and was compensated by the Rebels for the loss of his ship, the Freebooter.\nDevon Fuller posted on Cynabar's Droid Datalog on the K4 security droid and the AD armorer droid entries.\nDevon Fuller attended, and then was expelled from, the Vensenor Flight Academy. Afterwards he worked as a navigator on a Corellian Corvette, and later a gem-smuggler. Eventually Devon bought his own freighter, the Croc of Gold, and became a legitimate trader. His trading was successful due to the help of Owen Sareth, who brought him into the Alliance to Restore the Republic.\nFuller had an impressive Imperial criminal dossier, no less than five independent rewards for his capture, and lost two ships in service to the Alliance. The Croc of Gold was destroyed by Imperials over Tashtor Seneca. His second ship, the Freebooter, was wrecked during an attack on the Ansarra Rebel base. His third ship, The Solar Flair, was loaned to him by the Rebel Alliance.\nWhile working for the Alliance, Fuller met Corwin Shelvay, Jedi Knight and fugitive from the Empire. He introduced Shelvay to his Rebel contacts, bringing Shelvay into the Alliance. Shelvay, in turn, convinced Fuller to believe in the Force.\nFuller behaved as if money was his only motivation, and presented himself as an arrogant mercenary and con man, but his work for the Rebel Alliance revealed that he valued freedom more than money, and that he would go a long way to help his few close friends. He was a reckless pilot, and despite losing two ships he showed no sign of being more careful with the Solar Flair. High Inquisitor Antinnis Tremayne was aware of Fuller, and considered him \"strong in the Force\".\nHe often wore a battered Imperial Navy Captain's cap, a trophy from his career, along with a worn flight jacket and steelcloth heavy duty trousers, making him look more like a starfighter pilot than a freighter captain.\nAccording to an Imperial Criminal Dossier, Fuller was charged with the following crimes against the Galactic Empire:",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Arkanis/Legends",
  "/wiki/40_BBY/Legends",
  "/wiki/36_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Ansarra_Rebel_base",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Freebooter",
  "/wiki/Cynabar%27s_Droid_Datalog",
  "/wiki/K4_security_droid",
  "/wiki/AD_armorer_droid",
  "/wiki/Vensenor_Flight_Academy/Legends",
  "/wiki/Navigator/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Croc_of_Gold",
  "/wiki/Owen_Sareth",
  "/wiki/Tashtor_Seneca",
  "/wiki/The_Solar_Flair",
  "/wiki/Corwin_Shelvay/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/High_Inquisitor",
  "/wiki/Antinnis_Tremayne",
  "/wiki/Captain/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim",
  "/wiki/Cynabar%27s_Fantastic_Technology:_Droids",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Cynabar%27s_Droid_Datalog_(article_series)",
  "/wiki/Star_Wars_Adventure_Journal_14",
  "/wiki/Time/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Standard_year/Legends"
 ]
}