{
 "name": "Dexter_Jettster",
 "display_name": "Dexter Jettster",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ojom"
     ]
    },
    {
     "name": "Born",
     "values": [
      "By c. 382 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Besalisk"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.88 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown-black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Loegrib's crew",
      "Dex's Diner"
     ]
    }
   ]
  }
 ],
 "content": "Dexter \"Dex\" Jettster, nicknamed Dexi Jet, was a male Besalisk with a colorful background who lived on the planet Coruscant and was the owner of Dex's Diner. Serving mostly hard workers from the area, the diner offered home-style cooked meals and freshly brewed ardees . Jettster worked as the cook and employed two waitresses, Hermione Bagwa and her WA-7 waitress droid partner, FLO.\nIt was shortly before the Clone Wars that Jedi Knight Obi-Wan Kenobi came to Dex's Diner to see if his old friend, Jettster, could identify a poisoned dart. Though few even knew of the planet Kamino, Jettster did from his days as a prospector on Subterrel and was able to identify the dart as originating from Kamino. Furthermore, he knew of the native inhabitants, the Kaminoans, who were cloners of some repute and kept to themselves but were welcoming to those who brought credits. Jettster gently chided his old friend Kenobi who as a Jedi should have put more faith in another person's wisdom than the droids of the Analysis Rooms.\nDexter Jettster was a male Besalisk who once worked on the black market and as a prospector on Subterrel. While in the Unknown Regions of the galaxy, Jettster joined a crew led by a Mikkian named Loegrib. Their job was to mine a mysterious energy from the planet Lenahra. Once they arrived on the planet, they found a group of seven younglings; Audj Seedol, Casul, Shush, Trill, Amyt, Mem and Zae-Brii. The children were being protected by a Jedi Padawan named Obi-Wan Kenobi. At first, Loegrib expressed kindness towards the children and encouraged them to leave with him once they retrieved the energy. However, it soon became apparent that Leogrib was content with leaving the children to die in order to complete the job. With Kenobi's assistance, Jettster rallied the rest of the crew and helped the children defeat Leogrib, leaving him to die as they left the collapsing planet. Afterwards, Jettster helped relocate the children to a safer home and traveled with Kenobi to the Galactic Republic capital of Coruscant. While living there, he followed his love for food and opened a restaurant named Dex's Diner. He would also form a close bond with Kenobi and help him on various missions. Every night, he would have dessert as his dinner due to his Besalisk biology and as an excuse to eat the leftover sweets, rather than let them expire.\nPrior to the Clone Wars, Dex's Diner was known for having the best nerfburgers, with people from all over the galaxy traveling to eat there. Unfortunately, not all of Jettster's clientele were trustworthy as he was. As thieves sometimes stole nearby, Jettster would enlist the help of Kenobi. At one point, Kenobi and Jettster set up a sting in the diner itself to stop the robberies. When the thief Tri Tellon pickpocketed a trinket from Kenobi, he and Jettster tracked Tri to her hideout she shared with her partner, Magreda. Due to Kenobi's help, Jettster now owed the Jedi a favor; a favor that would soon be paid.\nFollowing an assassination attempt on Senator Padmé Amidala during the Separatist Crisis, Jettster was approached by Kenobi as part of an investigation into Amidala's aggressors. Kenobi wanted to know if Jettster could identify a poison dart. Jettster did so, determining that it was from the planet Kamino. He and Kenobi then exchanged friendly banter before Kenobi left the diner. Armed with Jettster's information about Kamino, Kenobi visited the Jedi Archives, though he was unable to locate the system.\nFollowing the outbreak of the Clone Wars, Jettster found himself struggling to obtain certain ingredients for his customers, forcing him to cut various items from the menu and affecting his restaurant's income. At one point, Sabé, one of the restaurant's regulars asked the waitress droid FLO about the missing menu items. FLO went on to explain the situation, which led to Jettster himself ranting about it from behind the counter. Sabé tried to assure Dex that the Republic would do something about it, to which Dex reminded her that whether they did or not, he would still be there trying to run the diner.\nDuring the reign of the Galactic Empire, Dexter looked through a box of reading material on the planet Pashvi. Jettster purchased the book that would become known as the Smuggler's Guide previously owned by Reginald Danfillo from the box for fifty credits, which had been tucked between The Biography of Master Thief Makuta and The Field Guide to Trammic Reptavians, because he saw Maz Kanata's name on the first page.\nAfter hearing rumours of illegal cyborg mods and bodies grown to fit buyer specifications in the stellar skirt of the Tingel Arm, Jettster arrived on Athus Klee in a star-streamer to investigate. After the starship made port in the morning, most passengers poured out quickly and headed directly into the Spacers' District, and by the time the older Jettster had made it off the vessel every inn had been fully booked out. Jettster instead headed out of the district into the underbrush and found a relatively dry rise then lay down under the stars. He discovered the Crimson Dawn was advertising for workers to mine ore in their ore hub.\nAfter six days of hacking through the jungle with a vibro-machete, Jettster had received bites from two vipers and countless gnats, but managed to find the ore hub. Sneaking around the hub's processing plant, the Besalisk spotted the chop shop and took a number of scans of the workers with his macrobinoculars. He then rescued a single Rodian worker from the hub and the pair headed back toward the spaceport.\nEn route, the pair spent hours one night starring up at the stars through the jungle canopy. Upon reaching the port, Jettster contacted a politician on the galactic capital, Coruscant, who he was friends with and informed him of the hub. The politician sent a ship to pick up the Rodian and Jettster's surveillance scans so that they could be taken before the Imperial Senate Council of Labor Abuses. Jettster wrote about his experiences on Athus Klee throughout his journey, with Evazan and the smuggler Han Solo annotating the pages with their own comments when the book later fell into their possession.\nWhile still on Athus Klee, Jettster then visited the Rasher's Rest cantina, where he met the hunter Tyro Viveca and left his possessions unattended while visiting the latrine. Viveca took the opportunity to steal the book that would become known as the Smuggler's Guide from Jettster and then left Athus Klee for the planet Kashyyyk.\nBy 4 ABY, Dex's Diner was defunct.\nJettster was 1.88 meters tall, with a brown-black mustache, yellow eyes, and tan-brown skin. Jettseter was a very friendly individual who greeted his friend Kenobi with a hug. He was even willing to help the Jedi Knight identify a poisoned dart that was used to kill the bounty hunter Zam Wesell and provide information on the isolated Kaminoan species.\nDexter Jettster was voiced by Ronald Falk in Attack of the Clones. He was originally written to be married to his waitress, Hermione Bagwa.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Dexter_Jettster",
  "/wiki/Dexter_Jettster/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Brotherhood",
  "/wiki/Galactic_Tales:_Inheritance",
  "/wiki/Padawan_(novel)",
  "/wiki/Ojom",
  "/wiki/382_BBY",
  "/wiki/Besalisk",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Dex%27s_Diner",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Ardees",
  "/wiki/Hermione_Bagwa",
  "/wiki/WA-7_waitress_droid",
  "/wiki/FLO",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Kamino",
  "/wiki/Subterrel",
  "/wiki/Kaminoan",
  "/wiki/Cloning",
  "/wiki/Credit",
  "/wiki/Analysis_Rooms",
  "/wiki/Prospector",
  "/wiki/Unknown_Regions",
  "/wiki/The_galaxy",
  "/wiki/Mikkian",
  "/wiki/Loegrib",
  "/wiki/Lenahra",
  "/wiki/Youngling",
  "/wiki/Audj_Seedol",
  "/wiki/Casul",
  "/wiki/Shush",
  "/wiki/Trill",
  "/wiki/Amyt",
  "/wiki/Mem",
  "/wiki/Zae-Brii",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Galactic_Republic",
  "/wiki/Capital",
  "/wiki/Foodstuff",
  "/wiki/Restaurant",
  "/wiki/Nerfburger",
  "/wiki/Thief",
  "/wiki/Tri_Tellon",
  "/wiki/Tri_Tellon%27s_home",
  "/wiki/Magreda",
  "/wiki/Assassin",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Separatist_Crisis",
  "/wiki/Kamino_saberdart",
  "/wiki/Jedi_Archives",
  "/wiki/Kamino_system",
  "/wiki/Sab%C3%A9",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Pashvi",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Reginald_Danfillo",
  "/wiki/The_Biography_of_Master_Thief_Makuta",
  "/wiki/The_Field_Guide_to_Trammic_Reptavians",
  "/wiki/Maz_Kanata",
  "/wiki/Cybernetics",
  "/wiki/Tingel_Arm",
  "/wiki/Athus_Klee",
  "/wiki/Star-streamer",
  "/wiki/Starship",
  "/wiki/Spacers%27_District",
  "/wiki/Time",
  "/wiki/Plant",
  "/wiki/Star",
  "/wiki/Crimson_Dawn",
  "/wiki/Mining",
  "/wiki/Ore",
  "/wiki/Crimson_Dawn_ore_hub",
  "/wiki/Standard_day",
  "/wiki/Jungle",
  "/wiki/Vibro-machete",
  "/wiki/Macrobinoculars",
  "/wiki/Rodian",
  "/wiki/Unidentified_Rodian_cyborg",
  "/wiki/Spaceport",
  "/wiki/Standard_hour",
  "/wiki/Unidentified_politician_(Dexter_Jettster)",
  "/wiki/Imperial_Senate",
  "/wiki/Council_of_Labor_Abuses",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Rasher%27s_Rest",
  "/wiki/Cantina",
  "/wiki/Big_game_hunter",
  "/wiki/Tyro_Viveca",
  "/wiki/Refresher",
  "/wiki/Book",
  "/wiki/Kashyyyk",
  "/wiki/4_ABY",
  "/wiki/Eye",
  "/wiki/Bounty_hunter",
  "/wiki/Zam_Wesell",
  "/wiki/Ronald_Falk",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/The_High_Republic_Adventures_(2022)_1",
  "/wiki/Padawan_(audiobook)",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Queen%27s_Hope",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Tales_from_Wild_Space:_Stop,_Thief!",
  "/wiki/Star_Wars_Adventures_(2017)_1",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_29",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Way_of_the_Force",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Coruscant_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Databank_(website)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/Template:PhaseIIDate",
  "/wiki/Standard_year",
  "/wiki/What_is_a_Wookiee%3F_(2015)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Temmin_Wexley",
  "/wiki/Norra_Wexley",
  "/wiki/Akiva",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/Databank_(original)"
 ]
}