{
 "name": "Dez Rydan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Golden"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jora Malli"
     ]
    }
   ]
  }
 ],
 "content": "Dez Rydan was a human male Jedi Knight of the Jedi Order during the High Republic Era. He had golden skin and black hair. Before becoming a Knight, he was the Padawan of Jedi Master Jora Malli. Rydan was one of several Jedi who traveled aboard the starship Vessel to the Starlight Beacon. Craving adventure, Rydan had resigned from the Zeitooine mission to request the assignment. However, the Vessel was waylaid by the Great Hyperspace Disaster and stranded at an ancient space station.\nWhile exploring the station's lower levels, Rydan was trapped behind a door and seemingly disintegrated by a set of helix rings, leading the other Jedi–Reath Silas, Cohmac Vitus, and Orla Jareni–to assume him dead. In reality, Rydan, who had sustained a head injury, had been transported via hyperspace relay to a planet inhabited by the Drengir, a species of sentient carnivorous plants inherently attuned to the dark side of the Force. Rydan was tortured by the Drengir for days on how to operate the relay, but he was insensible due to the head injury. When the three other Jedi returned to the station, Silas discovered the relay and was transported to the Drengir planet, where the creatures attempted to force Rydan to kill him. The Padawan was able to rescue Rydan and bring him back to the station. Subsequently, recovering from his injuries, Rydan feared that his connection to the Force had been severely damaged by his treatment at the hands of the Drengir, leading him to decide to swear the Barash Vow.\nDez Rydan was an energetic and outgoing Jedi. Rydan was highly regarded by younger members of the Jedi Order. He notably had a close relationship with Padawan Reath Silas due to the fact that Silas was the new Padawan of Rydan's former master, Jora Malli. The two would practice dueling with each other on occasion, a practice that Silas noted made other Padawans jealous of him. Rydan sought adventure during his service to the Order, which he admitted was a problem that caused him to take the Barash Vow, saying that he could not balance his own desire for adventure and a Jedi's need to constantly be in service to others.\nDez Rydan first appeared in the 2021 young adult novel The High Republic: Into the Dark. In the Characters of Star Wars: The High Republic video series, Dez is pictured as a generic silhouette, as well as Cohmac Vitus, Reath Silas, and Orla Jareni.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Dez_Rydan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jora_Malli",
  "/wiki/Jedi_Knight",
  "/wiki/High_Republic_Era",
  "/wiki/Padawan",
  "/wiki/Jedi_Master",
  "/wiki/Jedi",
  "/wiki/Starship",
  "/wiki/Vessel",
  "/wiki/Starlight_Beacon",
  "/wiki/Zeitooine_mission",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Amaxine_space_station",
  "/wiki/Space_station",
  "/wiki/Helix_ring",
  "/wiki/Reath_Silas",
  "/wiki/Cohmac_Vitus",
  "/wiki/Orla_Jareni",
  "/wiki/Death",
  "/wiki/Hyperspace",
  "/wiki/Amaxine_relay",
  "/wiki/Unidentified_planet_(Drengir)",
  "/wiki/Drengir",
  "/wiki/Species",
  "/wiki/Sentience",
  "/wiki/Carnivorous_plant",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Standard_day",
  "/wiki/Skirmish_on_the_Amaxine_station",
  "/wiki/The_Force",
  "/wiki/Barash_Vow",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/Characters_of_Star_Wars:_The_High_Republic",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/StarWars.com"
 ]
}