{
 "name": "Dezono Qua",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Esseles"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Esseles"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Dezono Qua was a Human male from Esseles. He was the sole heir of a wealthy family, and was not well-liked. He lived alone at his family villa with droids as his only companions. He had a small army of IG-series droids, an H2 pilot droid, and a protocol droid nicknamed \"E-10.\"\nQua, believing that his money allowed him to do anything he wished, had the habit of eating sentient beings. He purchased slaves, often young ones, of different species, only to have E-10 cook and serve them to him. He purchased a child slave from slave trader Orso Meeto on Orvax IV every ten days. Resa Greenbark was one of the unfortunate slaves bought for food. After Resa's father and the crew of the freighter Uhumele raided the Qua villa in search of her, Dass Jennir shot an unarmed Qua in the chest with a blaster upon learning of Resa's fate.\nFollowing his death, Qua's family hired bounty hunter Falco Sang to hunt down Jennir and his companions.\nDezono Qua was a solitary individual, who was able to cover his disturbing idiosyncrasies with wealth and power. As such, he had no conscientious individuals surrounding him in his home, and would only make use of droids with unwavering loyalty to him.\nIn addition to this, Qua possessed little to no empathy or sympathy for those whose relatives he had consumed, even when met face-to-face; his encounter with Bomo Greenbark and his companions reflected this. Even in the face of death at blasterpoint, Qua, in a most insensitive and blasé manner, expressed no remorse for his deeds, only showing true emotion when reflecting on consuming Resa.\nDezono Qua was first mentioned in the graphic novel installment Dark Times 4, and made an appearance in the subsequent installment, Dark Times 5. Since then, the character has received passing mentions as a footnote in successive issues.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Esseles/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dass_Jennir",
  "/wiki/Qua_family%27s_villa",
  "/wiki/Droid/Legends",
  "/wiki/IG-series/Legends",
  "/wiki/H2",
  "/wiki/E-10",
  "/wiki/Sentience/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Species/Legends",
  "/wiki/Orso_Meeto",
  "/wiki/Orvax_IV",
  "/wiki/Resa_Greenbark",
  "/wiki/Bomo_Greenbark",
  "/wiki/Uhumele",
  "/wiki/Assault_on_Dezono_Qua%27s_villa",
  "/wiki/Blaster/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Falco_Sang",
  "/wiki/Dark_Times_4",
  "/wiki/Dark_Times_5",
  "/wiki/Dark_Times:_Blue_Harvest,_Part_1",
  "/wiki/Dark_Times:_Blue_Harvest,_Part_2",
  "/wiki/Dark_Times_13",
  "/wiki/Dark_Times_14",
  "/wiki/Dark_Times_15",
  "/wiki/Dark_Times_16",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_1",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_5",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}