{
 "name": "Dhar Bullwin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "55 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "7 ABY",
      "Koda's World"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    }
   ]
  }
 ],
 "content": "Dhar Bullwin was a dark side magician who searched for the Eye of Koda.\nDhar Bullwin studied the dark side under a master of the dark arts for nearly 30 years as part of an ancient order of dark side magicians. Bullwin had been searching for the Eye of Koda for twenty-five years. When the amulet turned up in the Varno Market on the planet Vengler, he immediately sent six Scitrok Warriors after the amulet's owners in order to recover his prize.\nWhen the amulet's owners fled the planet, Bullwin sent both his Homonculous into their ship as well as following in his own ship, the Logrus. Although his ship was destroyed in the battle, Bullwin escaped in an escape pod and crash landed on Koda's World. While the amulet's owners fought past a garagon, Bullwin used the dark side to convince the local indigenous Tempestro that he was their ally and that they should attack the amulet's owners when they reached the Tempestro temple. While the owners fought the Tempestro, Bullwin climbed the side of the temple and entered through a tiny opening.\nInside the temple Bullwin stepped onto a raised platform that gave all the power and knowledge of the Tempestro to whomever stood there. Bullwin used the power to become invisible as he attacked the amulet's owners. The power he gained consumed him in the end and he died in the temple.\nDhar Bullwin was a schemer and wanted the amulet's owners to flee in front of him towards his ultimate prize. In the end he craved ultimate power and dominion over the galaxy and that ambition cost him his life. He was an old man with wild white hair and wearing dark robes.\nDhar Bullwin was the central antagonist created by West End Games for the Star Wars: The Roleplaying Game adventure \"The Prize: A Scout Adventure\" contained within Galaxy Guide 8: Scouts. He is behind most of the major conflicts the players experience and the players assume the role of amulet's owners. Bullwin's first name was misspelled throughout the Galaxy Guide adventure, alternating between \"Dhar\" and \"Dhal\".",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/55_BBY/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Koda%27s_World",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Dark_Side_Adept",
  "/wiki/Eye_of_Koda",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Varno_Market",
  "/wiki/Planet/Legends",
  "/wiki/Vengler",
  "/wiki/Scitrok_Warriors",
  "/wiki/Homonculous",
  "/wiki/Logrus",
  "/wiki/Escape_pod/Legends",
  "/wiki/Garagon",
  "/wiki/Tempestro",
  "/wiki/Tempestro_temple",
  "/wiki/The_galaxy/Legends",
  "/wiki/Robe/Legends",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/The_Prize:_A_Scout_Adventure",
  "/wiki/Galaxy_Guide_8:_Scouts",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Thrawn_campaign",
  "/wiki/New_Republic/Legends"
 ]
}