{
 "name": "Dhas Fenoep Vedij",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Vedij family",
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Dhas Fenoep Vedij was a Human male member of the Vedij family, and a naval officer who served the Galactic Empire until he led a mutiny aboard the Far Orbit, after which he became a privateer and commander to the Rebel Alliance. During the Galactic Civil War, he combined a somewhat remote and formal style of leadership with an aggressive, predatory warrior instinct, an attitude that may have been forged by the experiences of his Imperial career, but which might also represent his aristocratic Coruscanti upbringing and naval background, which might have engendered, if only unconsciously, a perception that his command role was something akin to a hereditary title.\nDhas Vedij was the elder son of Ronnan Tyla Vedij, an admiral and hereditary Baron from a long line of Navy officers. He entered the Imperial Navy himself, and rose to the rank of commander and the position of Operations Officer aboard the escort frigate Far Orbit, serving as second-in-command under Captain Vocis Kenit. Captain Kenit proved to be a capable strategist, hailed by the Empire as an effective commander in his role hunting pirates on the Outer Rim, but he was also a brutal disciplinarian and his promotion to command rank was owed primarily to his assiduous support of the New Order, souring Vedij's opinion of the Imperial regime.\nVedij's distaste towards the Empire was further sharpened shortly before the Battle of Yavin, when his father, a critic of the Empire's politically-motivated military reforms, was killed in suspicious circumstances. His younger brother, Elon, a TIE/LN starfighter pilot, was assigned aboard Far Orbit, in a move that both brothers suspected was designed to make it easier for the Empire to eliminate them.\nHowever, the threat of state terror seems to have been preempted by Captain Kenit's native brutality, when he squandered Far Orbit's entire TIE force in a needless, glory-hunting attack on the Silent Blades pirates. Elon and all his comrades in the TIE wing were killed—but this and other brutal actions by Kenit, coupled with the news of Alderaan's destruction, provided Commander Vedij with enough support among the crew to stage a successful mutiny.\nHaving taken command of the frigate, and dumped Kenit and the loyalist crew in escape pods, Vedij decided to move from the Rim into the Core Worlds, where he believed that a single Imperial frigate would be able to strike with devastating affect. After bringing his ship to StarForge Station to recruit a new crew, he contacted the Alliance to Restore the Republic, and the FarStar became a privateer operating under the Rebel aegis, as part of the experimental project created by Ral'Rai Muvunc.\nUnder Vedij's command, the Far Star roamed through the Darpa and Bormea sectors on a raiding cruise, capturing Imperial Advisor Coh Veshiv, taking part in several engagements with Imperial forces including a task force now commanded by Captain Kenit and charged with hunting the rogue ship down.\nAs a privateer, arguably Vedij's greatest achievement was the capture of the treasure-laden Star Galleon Emperor's Will.\nAfter the initial setup of the mutiny, the adventures of Dhas Vedij and his ship in The Far Orbit Project are designed to be open-ended, with several possibilities being suggested at key points. Accordingly, it is suggested that Captain Vedij might join the Alliance as a regular officer, remain a privateer, end his space-faring days and settle on a distant planet, or die saving his ship during the capture of the Emperor's Will. More extreme options include making the introverted, aggressive Captain a dangerous madman, or revealing him as an Imperial agent on a mission to infiltrate and undermine the Alliance.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Vedij_family",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Far_Orbit",
  "/wiki/Privateer/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Ronnan_Tyla_Vedij",
  "/wiki/Admiral/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Operations_Officer",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Vocis_Kenit",
  "/wiki/Pirate/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Elon_Vedij",
  "/wiki/TIE/LN_starfighter",
  "/wiki/TIE_pilot",
  "/wiki/Tarnished_Blades",
  "/wiki/Alderaan/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/StarForge_Station",
  "/wiki/Ral%27Rai_Muvunc",
  "/wiki/Darpa_sector",
  "/wiki/Bormea_sector/Legends",
  "/wiki/Advisor/Legends",
  "/wiki/Coh_Veshiv",
  "/wiki/Task_force/Legends",
  "/wiki/Star_Galleon-class_frigate",
  "/wiki/Emperor%27s_Will_(Star_Galleon-class)",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/West_End_Games",
  "/wiki/Preparing_for_War",
  "/wiki/The_Hijacking_of_Shipment_1037",
  "/wiki/The_Capture_of_Coh_Veshiv",
  "/wiki/The_Rival",
  "/wiki/The_Trap_(adventure_scenario)",
  "/wiki/Raid_on_Brentaal",
  "/wiki/Hunter/Hunted",
  "/wiki/The_Grand_Prize",
  "/wiki/The_Force_Unleashed_Campaign_Guide"
 ]
}