{
 "name": "Dheendo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "24 BBY–20 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Shroud Team",
      "Shroud Team"
     ]
    }
   ]
  }
 ],
 "content": "Dheendo was a male Rodian who served with the Alliance to Restore the Republic's Shroud Team during the Galactic Civil War. Originally a bounty hunter operating out of the planet Kazlin 5, Dheendo joined the Alliance after a less-than-stellar career. Selected by Lieutenant Dutra Zeneta to join Shroud Team, Dheendo served as the unit's primary Foster Agent based in Corint City on the planet Pirik in the Divis Arm. A Foster Agent was one of the most dangerous Alliance postings, acting as conduits for stranded field operatives to rejoin the Rebellion. Serving as the team's primary contact on Pirik, Dheendo was the individual best known to Alliance operatives in the field.\nBorn sometime between 24 BBY and 20 BBY, the Rodian male Dheendo initially found work as a bounty hunter in the employ of Tyu, a minor crime lord based on the planet Kazlin 5. Dheendo was regarded as a mediocre hunter at best, mainly because he was not driven to succeed in his profession. Eventually, the Rodian joined the insurgent Alliance to Restore the Republic and, sometime after 0 ABY, was selected by the Jin lieutenant Dutra Zeneta to join Shroud Team, a unit of all-alien Foster Agents operating out of Corint City on the planet Pirik in the Divis Arm. A posting as a Foster Agent was one of the most dangerous assignments in the Alliance; they were points of contact for operatives—known as \"orphans\"—who were stranded in the field and looking to return to the Alliance. Their names and locations were common knowledge to field operatives, and if the operatives were caught by agents of the Galactic Empire, the possibility of the Foster Agent being compromised by a broken operative was high. The team's all-alien composition was suited to the population of Corint City, as Humans made up only 5 percent of the settlement's 10 million inhabitants.\nDheendo served as Lieutenant Zeneta's first officer as well as Shroud Team's primary Foster Agent. He was the agent whom most orphaned operatives knew in Corint City, and the Rodian maintained a seemingly random but preplanned schedule of a number of establishments within the city's Lowtown District, where he met with operatives in need of relocation and redirection. Dheendo was fond of the social scene in Lowtown and spent much of his time in the district, with the local patrols regarding him as a highly sociable individual.\nDheendo had green skin and black eyes. He was fond of the Lowtown District social scene and idolized Lieutenant Dutra Zeneta, hoping to be as \"wise\" as him one day. As a front-line agent and former bounty hunter, Dheendo was skilled with the use of a blaster and carried a blaster pistol, and he was trained in both melee and unarmed combat. He was well-informed about the Corint City criminal scene and was connected in Lowtown. Dheendo was knowledgeable about alien species and schooled in survival techniques and stealth. The Rodian's technical skills allowed him to fly space transports,navigate them through hyperspace, and operate the weapons and deflector shield systems aboard them. He was also skilled in operating and subverting security systems and locks.\nDheendo generally carried a comlink and datapad in addition to his weapon, and he wore a protective vest for defense. He also carried several sets of fake identification and a security tool kit to assist him in his work.\nDheendo first appeared in an entry of \"Cracken's Rebel Operatives,\" a series of articles published in issues of West End Games' Star Wars Adventure Journal. Dheendo was featured in issue 10's article, which was released in 1996. It was written by C. Robert Carey and featured a black-and-white illustration of the Rodian by Kathy Burdette. In the following issue of the Star Wars Adventure Journal, the \"Featured Artist\" section included a colorized image of Dheendo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/24_BBY/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Shroud_Team",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kazlin_5",
  "/wiki/Lieutenant/Legends",
  "/wiki/Dutra_Zeneta",
  "/wiki/Foster_Agent",
  "/wiki/Corint_City",
  "/wiki/Pirik",
  "/wiki/Divis_Arm",
  "/wiki/Agent/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Tyu",
  "/wiki/Crime_lord/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Jin",
  "/wiki/Alien/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/City/Legends",
  "/wiki/Human/Legends",
  "/wiki/Executive_officer/Legends",
  "/wiki/Lowtown_District",
  "/wiki/Time/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Species/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Blast_vest",
  "/wiki/Security_Systems_Tool_Kit",
  "/wiki/Cracken%27s_Rebel_Operatives_(article)",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/1996",
  "/wiki/Craig_Robert_Carey",
  "/wiki/Kathy_Burdette",
  "/wiki/Star_Wars_Adventure_Journal_11",
  "/wiki/Featured_Artist:_Kathy_Burdette",
  "/wiki/4_ABY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim",
  "/wiki/Gondara",
  "/wiki/Tamo_Lan",
  "/wiki/Thilis-Brin"
 ]
}