{
 "name": "Dia_Passik",
 "display_name": "Dia Passik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New RepublicWraith Squadron",
      "Wraith Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Dia Passik , was a female Twi'lek who served as a member of Wraith Squadron during their campaign against the rogue Imperial warlord Zsinj.\nPassik was enslaved for most of her youth, deprived of her homeworld of Ryloth. Her \"owner\" operated a yacht known as the Violet Hem, where Passik spent a significant portion of her early years. Later, she would confide to squadron mates that she partially resented other Twi'leks for betraying her to slavers.\nFiercely intelligent and cunning, Passik was able to entice mercenary pilots to instruct her how to fly starfighters and other spacegoing craft. After sufficient practice, Passik stole a shuttlecraft and  shot down the Violet Hem—her first combat action.\nShe eventually made her way to New Republic space, joining Wraith Squadron in 7 ABY. She replaced Falynn Sandskimmer as the Wraiths' vehicle specialist, and was very knowledgeable of various criminal organizations. During the Wraith's infiltration of Zsinj's operations, Passik posed as the pirate Captain Seku of the Hawk-bat Independent Space Force, alongside Kell Tainer, Garik Loran, and Shalla Nelprin. As a test of loyalty, Zsinj requested the ersatz pirates execute Wraith Castin Donn, who had sneaked aboard. Passik shot Donn's already-deceased body with a blaster, allowing the group to complete their infiltration. She later flew into a rage of grief and self-loathing over the action, nearly killing herself before being talked down by Garik Loran, who convinced her she saved his life in doing so.\nPassik served honorably with the Wraiths and the Han Solo-led task force through the Zsinj campaign. During her time in the squadron, she had a romantic relationship with fellow member Garik \"Face\" Loran and helped him recover from the death of his close friend Ton Phanan.\nShe later fought in the Yuuzhan Vong War where she still remained in Wraith Squadron during the end of the war.\nIn 44 ABY, Passik was married to Loran and had even started a family with the human pilot with whom she raised their daughter. At this time, Passik worked as a pilot for a commercial air-and-space service where she was a partner.\nX-Wing: Solo Command author Aaron Allston states on his website that, following the conclusion of the Zsinj campaign, Passik would most likely have left the New Republic to combat slavers on Ryloth. However, as this does not appear in any canon source, whether or not this actually happens is unknown.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Human/Legends",
  "/wiki/Dia",
  "/wiki/Ryloth/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Wraith_Squadron",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/Slavery/Legends",
  "/wiki/Violet_Hem",
  "/wiki/Starfighter/Legends",
  "/wiki/File:Dia_Passik.jpg",
  "/wiki/7_ABY/Legends",
  "/wiki/Falynn_Sandskimmer",
  "/wiki/Hawk-bat_Independent_Space_Force",
  "/wiki/Kell_Tainer",
  "/wiki/Garik_Loran",
  "/wiki/Shalla_Nelprin",
  "/wiki/Castin_Donn",
  "/wiki/Han_Solo/Legends",
  "/wiki/Ton_Phanan",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/44_ABY",
  "/wiki/X-Wing:_Solo_Command",
  "/wiki/Aaron_Allston",
  "/wiki/Canon",
  "/wiki/X-Wing:_Iron_Fist",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Rogue_Squadron",
  "/wiki/Star_Wars_Insider_59",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Wraith_Squadron_(article)",
  "/wiki/Star_Wars_Gamer_9",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Wraith_Four",
  "/wiki/Eurrsk_Thri%27ag",
  "/wiki/Tyria_Sarkin_Tainer",
  "/wiki/Wraith_Seven_(callsign)",
  "/wiki/X-Wing:_Wraith_Squadron"
 ]
}