{
 "name": "Dias Athacorr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Arkania"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arkanian"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Navy",
      "Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "Dias Athacorr was an Arkanian officer of the Republic Navy. Following the surprise assaults against the Galactic Republic by Mandalorian forces in 3963 BBY, Athacorr was promoted to the rank of commander.\nDias Athacorr was a native of Arkania, a snowy world located in the Colonies. The Arkanian served the Galactic Republic as an officer in the Republic Navy during the Mandalorian Wars. This war, between the Republic and the resurgent forces of the Mandalorians, began in the Outer Rim Territories, where the Mandalorians made a three-pronged assault against the Republic in 3963 BBY. In the aftermath of this assault, known by the Republic media as the \"Onslaught,\" Athacorr received a promotion to the rank of commander. This promotion, reported in the Jimas Veltraa Memorial Edition of The Admiral's List, an official publication of the Republic Navy, occurred alongside that of notable officer Saul Karath to Rear Admiral.\nDias Athacorr was created by John Jackson Miller, the author of the Knights of the Old Republic comics, and was mentioned in The Admiral's List: Jimas Veltraa Memorial Edition, appended to Knights of the Old Republic 13. This in-universe news source is designed as \"an official communique for the Republic providing news from the 'regular navy' point of view,\" inspired by the \"Napoleonic-era Britain's Naval Chronicle.\" Some of the promotions presented here are said to be confirmations of ones received on the battlefield, but it is not specified which these are or which are regular promotions. While the original source only gave Athacorr a homeworld, The Complete Star Wars Encyclopedia specified the officer was of the Arkanian species.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Arkania/Legends",
  "/wiki/Arkanian/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Republic_officer/Legends",
  "/wiki/Mandalorian_Wars#The_Onslaught",
  "/wiki/Mandalorian/Legends",
  "/wiki/3963_BBY",
  "/wiki/Military_rank/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Colonies/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/The_Admiral%27s_List:_Jimas_Veltraa_Memorial_Edition",
  "/wiki/The_Admiral%27s_List",
  "/wiki/Saul_Karath",
  "/wiki/Rear_Admiral/Legends",
  "/wiki/John_Jackson_Miller",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_(comic_series)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Knights_of_the_Old_Republic_13",
  "/wiki/In-universe",
  "/wiki/Homeworld/Legends",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Species/Legends",
  "/wiki/Knights_of_the_Old_Republic_33",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/Dark_Horse_Comics",
  "/wiki/December_18",
  "/wiki/2006"
 ]
}