{
 "name": "Didi_Oddo",
 "display_name": "Didi Oddo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "During the Clone Wars"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Didi's Café"
     ]
    }
   ]
  }
 ],
 "content": "Didi Oddo was the adoptive father of Astri Oddo and onetime owner of Dex's Diner. He was a good friend to the Jedi, including Yoda, Tahl and Qui-Gon Jinn. When his daughter married Bog Divinian, he sold his café to Dexter Jettster. He owned a small retreat in the Cascardi Mountains.\nDidi Oddo was known as an informant on Coruscant and good friend of the Jedi Order, especially Qui-Gon Jinn. When Obi-Wan Kenobi met him, Didi had recently received a datapad from a thief called Fligh, who had stolen it from a senator, Uta S'orn. Then a bounty hunter, Ona Nobis, almost killed Didi trying to get the datapad; Obi-Wan Kenobi and Qui-Gon Jinn stopped her.\nAfter the attack, Didi and his daughter, Astri, hid in his home in the Cascardi Mountains, but Ona Nobis found them and poisoned Didi. So Astri had to steal the antidote in a lab from Jenna Zan Arbor to save her father.\nDidi Oddo was taking illegal bets during the Galactic Games on Euceron during 26 BBY. Obi-Wan Kenobi had to help Didi when Didi first said that he bought a swoop bike that broke and Uso Yso wouldn't give him his credits back. Obi-Wan Kenobi was asked to stand next to Didi to frighten Uso Yso, but it failed.\nObi-Wan Kenobi soon found out that Uso Yso was in charge of illegal bets for the Galactic Games and that Didi was taking illegal bets. Didi said he took credits from his daughter Astri and his son-in-law Bog Divinian because he wanted to place a bet when he got a sure tip. Didi soon stole Bog Divinian's speeder to sell it, and then he placed another bet with that money. Obi-Wan Kenobi asked him why he did that, and Didi said that an event was fixed and that it was a sure thing. Didi got the information from Fligh, whom Obi-Wan Kenobi did not trust at all.\nAfter talking with Fligh, Obi-Wan Kenobi, Anakin Skywalker, and Didi Oddo took an air taxi, but the pilot jumped off mid-flight. They made it and went to Stadium Five, where the Alderaan pilot won the race and Didi could have made a fortune. Later, Obi-Wan Kenobi needed Didi as a witness, but it turned out that he left Euceron. Astri Oddo said, \"...Didi wanted to help, but Bog said he would press charges for the theft of the speeder. So Didi thought it best to leave the planet. You know he has no moral courage...\"\nAfter the events of Stadium Five, Didi Oddo retreated to his home in the Cascardi Mountains.\nDidi died sometime during the Clone Wars.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Coruscant/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Dex%27s_Diner/Legends",
  "/wiki/Astri_Oddo",
  "/wiki/Jedi/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Tahl",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Bog_Divinian",
  "/wiki/Dexter_Jettster/Legends",
  "/wiki/Cascardi_Mountains",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Fligh",
  "/wiki/Uta_S%27orn",
  "/wiki/Ona_Nobis",
  "/wiki/Jenna_Zan_Arbor",
  "/wiki/Galactic_Games/Legends",
  "/wiki/Euceron",
  "/wiki/26_BBY/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Uso_Yso",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Speeder/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Jedi_Apprentice:_The_Deadly_Hunter",
  "/wiki/Jedi_Apprentice:_The_Evil_Experiment",
  "/wiki/Jedi_Apprentice:_The_Dangerous_Rescue",
  "/wiki/Jedi_Quest:_Path_to_Truth",
  "/wiki/Jedi_Quest_3",
  "/wiki/Jedi_Quest:_The_Trail_of_the_Jedi",
  "/wiki/Jedi_Quest:_The_Dangerous_Games",
  "/wiki/Jedi_Quest:_The_False_Peace",
  "/wiki/Legacy_of_the_Jedi",
  "/wiki/The_Last_of_the_Jedi:_A_Tangled_Web",
  "/wiki/The_Last_of_the_Jedi:_Secret_Weapon",
  "/wiki/The_Last_of_the_Jedi:_Against_the_Empire",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_54",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_4",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}