{
 "name": "Didina Lippinoss",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corporate Sector Authority"
     ]
    }
   ]
  }
 ],
 "content": "Didina Lippinoss was a criminal on Corellia during the Galactic Civil War. Operating from the city of Tyrena, she performed various unsavory tasks for Corporate Sector Authority Viceprex Karrek Flim, which eventually brought her into direct conflict with aspiring crime lord Crev Bombaasa.\nOperating from an office in a hotel in Tyrena, on Corellia, Didina Lippinoss was a small-time criminal who performed various services for Karrek Flim, a Viceprex of the Corporate Sector Authority, and was romantically linked with Flim. Under Flim's direction, she did \"work that he'd prefer not to be seen doing,\" as it was kindly phrased by crime lord Crev Bombaasa.\nAt some point between 1.5 ABY and 3 ABY, Lippinoss hired a spacer to recover some records that implicated Flim in the environmentally unfriendly business practice of leveling several old-growth forests in the Corellian system. She adamantly proclaimed to the spacer that these records were forged, and directed him to discreetly find Bin Huusir, the slicer who possessed the files, and return them to her. Huusir made no attempt to speak to the spacer, instead shooting at him on sight. After defeating Huusir, the spacer returned the data to Lippinoss, and received payment and her gratitude.\nLippinoss failed to realize, however, that the spacer was in no way loyal to her, and was willing to take a job from Crev Bombaasa to blackmail her. Bombaasa, in the service of Shalera the Hutt, wished to gather incriminating evidence against Viceprex Flim, and had Lippinoss followed. He then hired the spacer to convey the results of this surveillance from his Bothan informant, Sli'woon Biul, who was located outside Tyrena, back to Bombaasa in the Tyrena cantina.\nThe report, which Biul described as \"quite entertaining,\" was satisfactory to Bombaasa. He believed it would create interesting gossip in the community if he released it on Shalera's orders, which he would do if the Viceprex failed to satisfy the Hutt. In addition, Bombaasa believed that presenting a copy of the report to Lippinoss herself would compel her to give him secret data from the Corporate Sector Authority in order to prevent its release. Bombaasa directed the spacer to a clandestine meeting with Meeko, Lippinoss's servant, on the outskirts of Tyrena. Meeko received the document, but warned the spacer that her employer would not comply with any blackmail attempts.\nThe warning proved to be accurate, and Lippinoss did not cooperate with Bombaasa's demands. Instead, she hired a Trandoshan bounty hunter named Morrng to kill Bombaasa. Bombaasa paid the spacer to \"remove\" Morrng, which he accomplished just outside Tyrena. After Morrng was eliminated, Bombaasa expressed his frustration at Lippinoss's actions, and his expectation that only one of them would emerge from their conflict alive. Despite the threat posed by Lippinoss, Bombaasa continued to grow in power and survived until at least 29 ABY.\nDidina Lippinoss spoke very politely and warmly to people like the unidentified spacer, but to enemies like Crev Bombaasa she was \"frustrating\" and \"exasperating.\" Despite her nonthreatening appearance, she was pragmatic enough to order underlings to carry out her instructions by any means necessary and was sufficiently ruthless to pay for the murder of criminal rivals.\nDidina Lippinoss is a non-player character  in the massively multiplayer online role-playing game Star Wars Galaxies, where she serves as the catalyst for an assassination-type mission and as background material in several different types of missions given by NPC Crev Bombaasa. Galaxies was originally set in 1.5 ABY, but with the introduction of the Battle of Hoth the game timeframe has progressed to 3 ABY with no apparent changes to other content, making the timeframe of Lippinoss's activities unclear. Game guides available on the Internet indicate that her quest series went further at one point, but as she and Bombaasa were both introduced before the \"new game enhancements\" that revamped quest functionality, her part now seems to have been truncated.\nThe Lippinoss and Bombaasa quests in Star Wars Galaxies can be played in the opposite order to that listed in this article, and Lippinoss will still employ the spacer and make no mention of the spacer working against her. This article assumes the Lippinoss quest occurs before the Bombaasa quest for ease of summarization, but it is also possible that Lippinoss's informants simply fail to inform her of the unidentified spacer's treachery.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Corellia/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/City/Legends",
  "/wiki/Tyrena/Legends",
  "/wiki/Viceprex/Legends",
  "/wiki/Karrek_Flim",
  "/wiki/Crime_lord/Legends",
  "/wiki/Crev_Bombaasa/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Corellian_system",
  "/wiki/Bin_Huusir",
  "/wiki/Slicer/Legends",
  "/wiki/Shalera",
  "/wiki/Hutt/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Sli%27woon_Biul",
  "/wiki/Tyrena_cantina",
  "/wiki/Meeko",
  "/wiki/Trandoshan/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Morrng",
  "/wiki/29_ABY/Legends",
  "/wiki/Massively_multiplayer_online_role-playing_game",
  "/wiki/Assassin/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force"
 ]
}