{
 "name": "Diles_Anevi",
 "display_name": "Diles Anevi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "10 BBY; First Light",
      "Vandor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Diles Anevi was the human male governor of the Expansion Region during the reign of the Galactic Empire. In 10 BBY, he met with Dryden Vos, leader of the Crimson Dawn criminal organization, aboard Vos's yacht, the First Light.\nThe aim of the meeting was to strike a deal over waiving certain transit restrictions on Crimson Dawn starships traveling along the Great Gran Run trade route. In return, Anevi hoped to persuade Vos to make financial contributions to charitable causes, but Vos lost his temper during the meeting and stabbed Anevi with a Kyuzo petar, killing him.\nDiles Anevi was a human male who served as governor of the Expansion Region during the reign of the Galactic Empire. In 10 BBY, he met with the leader of the Crimson Dawn crime syndicate, Dryden Vos, aboard the crime lord's yacht, the First Light, while it was docked in Fort Ypso on the planet Vandor. The aim of the meeting was for a deal to be struck that would waive certain travel restrictions on Crimson Dawn starships moving along the Great Gran Run hyperspace route. Anevi hoped that in return he could secure from Vos financial contributions to charitable causes he cared deeply about.\nDuring the meeting, Vos lost his temper and stabbed Anevi in the chest with a Kyuzo petar, causing him to let out a cry of pain that could be heard by party guests on the yacht's observation deck. When Vos removed the blade, the governor dropped to the floor dead. His corpse was dragged away by one of the crime lord's Hylobon Enforcers as Vos cleaned the weapon and took a drink.\nThe governor had light skin, dark eyes, and graying-brown hair.\nAt the time of his death, Diles Anevi wore a gray gaberwool mantle of office over a black shirt and pants, along with black boots and a belt buckle that contained his transactional credit chip portfolio.\nDiles Anevi first appeared in the 2018 Anthology film, Solo: A Star Wars Story, and was first identified by name in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo. The credits for the film identify Miles Richardson as the actor portraying the \"Regional Governor,\" and the Official Guide also contains an image of Richardson in the role; however, in the film itself, the governor is clearly portrayed by a different bearded actor.\nDuring the filming of Solo, the production staff debated how exactly Dryden Vos would dispose of Anevi. Screenwriter Jon Kasdan and others wanted to have Vos decapitate Anevi, and a version in which Anevi's head rolls across the floor was filmed, but some felt that would be too graphic for a Star Wars film, so the decapitation version of the scene was ultimately cut.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/10_BBY",
  "/wiki/First_Light",
  "/wiki/Vandor",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Tobias_Beckett",
  "/wiki/Margo",
  "/wiki/File:Beckett_and_Margo.ogg",
  "/wiki/Governor",
  "/wiki/Expansion_Region",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Dryden_Vos",
  "/wiki/Crimson_Dawn",
  "/wiki/Nau%27ur-class_yacht",
  "/wiki/Starship",
  "/wiki/Great_Gran_Run",
  "/wiki/Hyperspace_route",
  "/wiki/Kyuzo_petar",
  "/wiki/Death",
  "/wiki/File:Dryden-Silly.ogg",
  "/wiki/Crime_lord",
  "/wiki/Fort_Ypso",
  "/wiki/Planet",
  "/wiki/Yacht",
  "/wiki/Lord",
  "/wiki/Hylobon_Enforcers",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Time",
  "/wiki/Gaberwool",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Credit_chip",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Miles_Richardson",
  "/wiki/Jon_Kasdan",
  "/wiki/Star_Wars",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_2",
  "/wiki/Solo:_A_Star_Wars_Story_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/Solo:_A_Star_Wars_Story_Ultimate_Guide",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/File:Kasdan_Solo_Trivia_2.png"
 ]
}