{
 "name": "Dillan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dantooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Khoonda",
      "Khoonda Militia"
     ]
    }
   ]
  }
 ],
 "content": "Dillan was a Human female who lived on Dantooine prior to and during the Jedi Civil War and in the years following. It was she who first greeted Meetra Surik and her companions upon their initial arrival on that world, informing the former Jedi of the planet's history since her departure for the Mandalorian Wars. She would later join the Khoonda Militia, defending the outpost there from the mercenaries working for the former Sith trooper, Azkul.\nThe Human female Dillan lived on Dantooine her entire life. She received firsthand experience with the planet's rocky history since the start of the Mandalorian Wars. Dillan had little regard for the Jedi Order that had once maintained an enclave not far from the Khoonda outpost, blaming them for the Sith Empire's invasion and occupation of her world as well as the problems with Mandalorian raiders prior to that conflict. In 3954 BBY, she greeted a Jedi Exile named Meetra Surik, who visited Dantooine with an entourage of companions. Curious at first as to who Surik and her companions were, Dillan eventually warned her that she would find little welcome within the Khoonda outpost that was the seat of government for the struggling colony, stating that many citizens also held the Jedi in a dim light. She went on to explain the general situation on Dantooine, informing Surik of the situation between the settlers of Khoonda, the salvagers who hoped to plunder the ruins of the Jedi Enclave, and the problems that both groups had with the Sith trooper Azkul's mercenaries.\nSometime later, Dillan joined the Khoonda Militia at the behest of Surik, reasoning that she would have had a far worse job than the one she currently held if the mercenaries took over Dantooine. When Azkul and his men finally attacked the Khoonda outpost, she fought alongside Surik, Jedi Master Vrook Lamar and the rest of the militia.\nDillan was a pragmatic woman who liked to greet the crew of incoming starships. Like most residents of Khoonda, she held a low opinion of the Jedi, citing their presence on Dantooine as the reason the Sith under Darth Malak invaded and sacked most of the communities of her homeworld in addition to bombarding the Jedi Enclave there into rubble. Like most survivors of the short but brutal occupation that followed, Dillan became jaded in her views not only of the Jedi, but of the Galactic Republic itself. Most residents, her included, knew that in the wake of the devastating Jedi Civil War, the Senate could ill afford to lend support to such a remote colony world despite its strategic value. She was, however, dedicated to her community, and unwilling to let it fall under mercenary rule if she could help prevent it.\nDillan's only appearance in Star Wars canon has been in the 2004 video game Star Wars: Knights of the Old Republic II: The Sith Lords. Her reaction to Surik's arrival depends on a number of factors, for example whether or not Surik is carrying a lightsaber when the two meet, or what conversation choices the player makes. Essentially, she serves as a greeter of sorts for the player's first visit.\nWhile the player does not have to recruit her into the militia in order to advance the plot, for 100% game completion in the game, Dillan is indeed recruited. If the player takes the dark path throughout the game, Dillan is not recruited into the militia, and the Exile sides with the mercenaries ordered to take over the planet. Curiously, when Dillan is seen during the fight within Khoonda, she is wearing the same clothing as a Czerka Corporation protocol officer from the prequel game, which is ironic considering they have the same head.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Dillan",
  "/wiki/Dantooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Khoonda",
  "/wiki/Khoonda_Militia",
  "/wiki/Jedi_Civil_War",
  "/wiki/Meetra_Surik",
  "/wiki/Planet/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/Mercenary/Legends",
  "/wiki/Sith_trooper_(Sith_Empire)",
  "/wiki/Azkul",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Attack_on_Dantooine_(Jedi_Civil_War)",
  "/wiki/Mandalorian/Legends",
  "/wiki/3954_BBY",
  "/wiki/Jedi/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Scavenger/Legends",
  "/wiki/Canon",
  "/wiki/Battle_of_Khoonda",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Vrook_Lamar",
  "/wiki/Starship/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Star_Wars",
  "/wiki/2004",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Lightsaber/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Unidentified_Czerka_Corporation_protocol_officer",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}