{
 "name": "Dimity",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Espos"
     ]
    }
   ]
  }
 ],
 "content": "Dimity was a male Human corporal who worked for the Espos at Mondder Spaceport on Etti IV.\nIn 3 BBY, he was with Sergeant Myrsk when they broke up a brawl between Jahan Cross, Han Solo, Chewbacca and a group of disgruntled cantina patrons. He loaded the criminals into a waiting JX40 Jailspeeder. Later, he was present when Cross was arrested for the murder of Dah'lis Stark..\nAfter Cross crashed a speeder during his escape from the Stark Compound, he suggested that it was possible that the Imperial agent's body was blown to bits by the explosion. His partner Myrsk didn't think this was likely and took Dimity as backup to the Millennium Falcon while he questioned Solo. When Myrsk punched Solo and was confronted by an angry Chewbacca, Dimity stood by and watched without intervening. After they departed the ship, Myrsk asked why he didn't help, and Dimity responded that it was \"above my pay grade.\"\nHe was with Myrsk as they staked out the landing bay where the Falcon was docked, since Myrsk was certain that Cross would eventually turn up. Dimity suggested that Cross might find other ways off the planet, but Myrsk dismissed this idea. When a shuttle was reported stolen from the Imperial embassy, Dimity was proven correct. He piloted the airspeeder designated Espo Ground One as Myrsk coordinated the attempt to prevent the stolen shuttle from escaping. When the shuttle crashed into a mag-lev train, causing massive damage, Dimity examined the crash site with Myrsk. Due to the extensive damage, Dimity stated that he was sure Myrsk would get into serious trouble. Myrsk agreed, but stated that he intended to take full responsibility for it but would then shift all the blame to Dimity.\nDimity was very tall and well-built, and could easily pick up an Aqualish with one arm. He also sported short blonde hair.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Security_Police",
  "/wiki/Corporal/Legends",
  "/wiki/Mondder_Spaceport",
  "/wiki/Etti_IV/Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Myrsk",
  "/wiki/Jahan_Cross",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/JX40_Jailspeeder",
  "/wiki/Dah%27lis_Stark",
  "/wiki/Stark_Compound",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Hovertrain/Legends",
  "/wiki/Aqualish/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_1",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_2",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_3"
 ]
}