{
 "name": "Ding",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Brighthome"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic",
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "\"Ding\" was a clone stormtrooper in service to the Galactic Empire after the Clone Wars. He was assigned to clearing out Jedi artifacts from the Jedi outpost Brighthome in the Mid Rim. When Darth Vader attacked the outpost, Ding tried to kill the Dark Lord of the Sith by throwing a grenade at him. However, Darth Vader blocked the grenade and then Force-choked him to death.\nDuring the early days of the Galactic Empire, Ding and a small contingent of clone stormtroopers were assigned to the Mid Rim Jedi space station Brighthome and tasked with taking inventory of the Jedi artifacts being held there. Bored with the assignment, Ding at one point wielded a green-bladed lightsaber and jokingly pretended to be a Jedi, but was reprimanded by his comrade, Kicker. When the space station was attacked by Darth Vader, Ding and the clone stormtroopers rushed to defend the site from the Sith Lord, but were ultimately overwhelmed. Ding attempted to kill Vader with a grenade, but the Sith blocked it and Force-choked the trooper to death.\nLike all other clone troopers, Ding, a clone of the bounty hunter Jango Fett, measured at 1.83 meters tall and was a human male. Ding considered his assignment on board the Brighthome as dull and thought that after one hundred missions, the assignment aboard the Brighthome would be the end of him. To lighten up the experience, he took a green-bladed lightsaber and jokingly pretended to be a Jedi.\nDing wore white Phase II clone trooper armor and had bandages on both of his arms. While archiving on the Brighthome, Ding played around with a green-bladed lightsaber, and later made use of a blaster rifle.\nDing debuted in Darth Vader  2, a 2017 canon comic written by Charles Soule and penciled by Giuseppe Camuncoli. In several sequences in the comic, the speech bubbles of Ding and Kicker are incorrectly switched.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ding_(disambiguation)",
  "/wiki/Kamino",
  "/wiki/19_BBY",
  "/wiki/Brighthome",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Clone_trooper",
  "/wiki/Stormtrooper",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_artifact",
  "/wiki/Jedi",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Anakin_Skywalker",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Grenade",
  "/wiki/Force_power",
  "/wiki/Death",
  "/wiki/Mid_Rim",
  "/wiki/Space_station",
  "/wiki/Lightsaber",
  "/wiki/Kicker",
  "/wiki/Sith_Lord",
  "/wiki/Sith",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Limb",
  "/wiki/Blaster_rifle",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Ding",
  "/wiki/Darth_Vader_(2017)_2",
  "/wiki/2017",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Databank_(website)"
 ]
}