{
 "name": "Dirk Harkness",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Salliche"
     ]
    },
    {
     "name": "Born",
     "values": [
      "20 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Colders Watch",
      "Alliance to Restore the Republic",
      "New Republic",
      "Black Curs"
     ]
    }
   ]
  }
 ],
 "content": "Dirk Harkness was an independent Rebel operative from Salliche. He wore an eye patch over his left eye.\nDirk Harkness was born on the planet Salliche in 20 BBY. After graduating from a technical school, he joined a private shipping corporation as an apprentice starship mechanic. In 0 ABY, at the age of twenty, he was Chief Engineer aboard the Colders Watch, a bulk freighter under the command of Captain Beezrul Granf. He was involved in a relationship with the ship's First Mate, Chessa Dohhenty; the two dreamed of settling down and sharing a peaceful life. Unbeknownst to Harkess, Dohhenty was also an agent of the Alliance to Restore the Republic. During a stop on the planet Kelada, a squad of stormtroopers confronted Dohhenty as she was unloading a smuggled cargo of blaster weaponry. Dohhenty opened fire on the stormtroopers, and they responded in kind, killing her. Harkness grabbed a blaster and began firing before fleeing the docking bay. He stumbled into Lorana's Labyrinth, where he met Dohhenty's Alliance contacts, General Halomar Corros and Captain Tony Franco. They recruited him in the Alliance.\nHarkness initially worked as a mechanic at Reginard Base, but he was restless and wanted revenge on the Galactic Empire. He soon left the base to kill Imperial officers and diplomats, but eventually rejoined the Alliance in Intelligence and commanded several intelligence missions. At the Battle of Endor, he was assigned as Chief Engineer on a capital ship in the Alliance Fleet. Following Endor, Harkness was assigned to the New Republic Intelligence Service with the commissioned rank of lieutenant. His tenure with the New Republic Intelligence Service lasted only a few weeks before he resigned. Harkness organized several associates—including Platt Okeefe, Tru'eb Cholakk, Jai Raventhorn, and Starter—formed the Black Curs, a mercenary group considered to be friendly to the New Republic. The unit carried out intelligence and commando missions against the retreating Empire; during a failed mission, Harkness was injured in an explosion which blinded him in his left eye and left him with scars on his chest and arm.\nAfter taking command of the Battle of Yavin, he and his men were rescued from Hensara III by Rogue Squadron.\nShortly after the Battle of Endor Harkness had been working with Platt Okeefe when he was captured by Imperial forces and imprisoned on Zelos II. Okeefe and Tru'eb Cholakk managed to rescue him.\nAt some point following after the Battle of Endor, Harkness and the Curs journeyed through the Core Worlds and wrote up an extensive report which they directed to Alliance High Command. It was generally well received though it was found to be lacking information on ground forces and army deployment on the worlds, though fleet deployment was well documented and comprehensive. The Bothan Borsk Fey'lya criticized the accuracy of Harkness' report.\nIn 7 ABY, Harkness was present in the Gorkin's Rest cantina on Wroona with other members of the Black Curs. He recounted the tale of how Dohhenty was killed and how he joined the Alliance.\nDirk Harkness was two meters tall with a brooding, cold stare. As a young man, he was optimistic and dreamed of a carefree life with someone he loved. His entire personality shifted with the death of his lover, Chessa Dohhenty, at the hands of the Empire. He was subdued and unfriendly, and only trusted a handful of close friends. Harkness had little tolerance for any kind of droid.\nHarkness was a skilled engineer, capable of serving as chief engineer on both a bulk freighter and a military-grade capital ship. After joining the Alliance, Harkness became skilled in many combat techniques.\nAs an engineer, Harkness only carried a datapad and a hydrospanner. As of 7 ABY, Harkness carried a heavy blaster pistol and knife.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Dirk_Harkness",
  "/wiki/Salliche/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Colders_Watch",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Black_Curs",
  "/wiki/Eye_patch",
  "/wiki/Eye/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Technician/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Chief_Engineer",
  "/wiki/Bulk_freighter/Legends",
  "/wiki/Captain",
  "/wiki/Beezrul_Granf",
  "/wiki/First_Mate/Legends",
  "/wiki/Chessa_Dohhenty",
  "/wiki/Kelada/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Death",
  "/wiki/Hangar",
  "/wiki/Lorana%27s_Labyrinth",
  "/wiki/General/Legends",
  "/wiki/Halomar_Corros",
  "/wiki/Captain/Legends",
  "/wiki/Tony_Franco",
  "/wiki/Reginard_Base",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Endor/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Military_rank/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Platt_Okeefe/Legends",
  "/wiki/Tru%27eb_Cholakk",
  "/wiki/Jai_Raventhorn",
  "/wiki/Starter",
  "/wiki/Mercenary/Legends",
  "/wiki/Battle_of_Yavin_(starship)",
  "/wiki/Rout_of_Hensara",
  "/wiki/Hensara_III",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Zelos_II",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Borsk_Fey%27lya",
  "/wiki/7_ABY/Legends",
  "/wiki/Gorkin%27s_Rest",
  "/wiki/Cantina/Legends",
  "/wiki/Wroona/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Hydrospanner/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Gathering_Shadows",
  "/wiki/Tales_from_the_New_Republic",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Black_Curs_Blues",
  "/wiki/Star_Wars_Adventure_Journal_8",
  "/wiki/X-Wing:_Rogue_Squadron",
  "/wiki/X-Wing:_Rogue_Squadron_(unabridged_audiobook)",
  "/wiki/Chessa%27s_Doom",
  "/wiki/Star_Wars_Adventure_Journal_1",
  "/wiki/Big_Quince_(short_story)",
  "/wiki/Star_Wars_Adventure_Journal_2",
  "/wiki/Explosive_Developments",
  "/wiki/Star_Wars_Adventure_Journal_3",
  "/wiki/Starter%27s_Tale",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/Vengeance_Strike",
  "/wiki/Star_Wars_Adventure_Journal_5",
  "/wiki/Recon_%26_Report:_The_Journey_to_Coruscant",
  "/wiki/The_Adventures_of_Rogue_Squadron",
  "/wiki/Star_Wars_Adventure_Journal_7",
  "/wiki/West_End_Games",
  "/wiki/The_Best_of_the_Star_Wars_Adventure_Journal,_Issues_1-4",
  "/wiki/Star_Wars:_The_Roleplaying_Game,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Introductory_Adventure_Game",
  "/wiki/Tales_from_the_Empire",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Standard_year/Legends"
 ]
}