{
 "name": "Diskio_Khzrry",
 "display_name": "Diskio Khzrry",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 40 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Xi'Dec"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Xi'Alpha"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Diskio Khzrry was a Xi'Dec burglar working with Alliance Intelligence. Diskio and K'lial Khzrry, were the only surviving members of the Khzrry family unit, which was once well respected in the Xi'Dec community. Diskio often worked for Alliance Intelligence retrieving captive Rebel personnel.\nDiskio Khzzry was one of the last surviving members of the Khzrry family unit. The rest of the family unit was vacationing onboard the Savage Pleasure when the Galactic Empire attempted to assassinate Senator Mael Sidras. Everyone onboard was killed and Diskio and K'lial shifted their allegiances to support the Rebel Alliance.\nUsing their unusual species as a cover, the two insectoids would retrieve captured Rebel operatives who had been apprehended by local authorities. They would usually accomplish this through a combination of stubbornness, speed, and K'lial's smooth and pacifying voice. When this was not sufficient they would rely on Diskio's ability to deactivate and disable all sorts of security measures.\nWhen Rebel agent Basal Moor was captured by TransGalMeg Industries, Incorporated guards on the planet Pako Ramoon, K'lial was able to approach and confuse the guards with a tirade about wanting to use Moor's genetic material as integration into the Khzzry family unit. While the guards were distracted, K'lial removed the codekeys for Moor's restraints from the pocket of the head security guard. When the guards protested K'lial became very indignant while he secretly unlocked Moor's restraints. When the guards then tried to arrest them for interferring with their prisoner, Diskio used a hidden remote to cause their landspeeder to crash through the lobby entrance and all three Rebel operatives were able to make their escape.\nDiskio was more quiet and reserved of the pair, letting K'lial do the talking while Diskio helped prepare their escape.\nHighly-dexterous, Diskio was relied upon for when K'lial could not fast talk its way past local authorities. Diskio was skilled in demolitions, repulsorlift and space transport repair, and disabling security systems.\nDiskio would carry lockpicking tools, a tool kit, and two blaster pistols concealed underneath its chitinous abdomen plates.\nDiskio Khzrry was designed by Chuck Truett for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Doug Shuler.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/40_BBY/Legends",
  "/wiki/Xi%27Dec/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/K%27lial_Khzrry",
  "/wiki/Khzrry_family_unit",
  "/wiki/Savage_Pleasure",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Mael_Sidras",
  "/wiki/Species/Legends",
  "/wiki/Insectoid/Legends",
  "/wiki/Basal_Moor",
  "/wiki/TransGalMeg_Industries,_Incorporated",
  "/wiki/Planet/Legends",
  "/wiki/Pako_Ramoon",
  "/wiki/Landspeeder/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Chitin/Legends",
  "/wiki/Chuck_Truett",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Doug_Shuler",
  "/wiki/Galaxy_Guide_4:_Alien_Races"
 ]
}