{
 "name": "Djas_Puhr",
 "display_name": "Djas Puhr",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sakiyan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Djas Puhr was a male Sakiyan bounty hunter active during the Age of the Empire.\nFew knew the past of Djas Puhr, a male Sakiyan who left his homeworld. It was rumored that he was an ex-slave, who had climbed out of the slave pits of Hutt Cartel gangster Jabba Desilijic Tiure; whatever the reason, Puhr harbored a hatred towards the crime lord that led to a refusal to take bounties from his organization.\nPuhr was an associate of the smuggler Han Solo and his first mate Chewbacca, and they had an agreement whereby Solo would deliver him gwayo bird eggs, a delicacy of Puhr's homeworld, along with his regular cargo of spice for Jabba. During one of these shipments, Solo was forced to drop his spice cargo to avoid arrest by the Galactic Empire, causing Jabba to place a 50,000-credit bounty on his head and throwing the standing of his agreement with Puhr into question.\nIn 0 BBY, Puhr was present in the spaceport of Mos Eisley on the planet Tatooine. He was known to frequent Chalmun's Spaceport Cantina, where he considered himself a regular. The bounty hunter often sat at a table with Myo, Muftak, and Kabe—a cohort which he enjoyed, for all of its foibles.\nAround this time, he was hired by Myo to retrieve a valuable kloo horn, which the Abyssin had won in a card game from Lirin Car'n the night before before becoming intoxicated and losing it himself. Car'n, a member of the Modal Nodes house band , desperately needed money to pay off a debt to Rodian bounty hunter Greedo. With this in mind, Lirin Car'n also hired Puhr for the same task, promising to pay two hundred credits to retrieve it.\nThe Sakiyan bounty hunter easily found the horn—which had been stolen by Muftak and Kabe and sold in order to pay their rent—and acquired it from the Scrapper. After a brief confrontation with Han Solo and Chewbacca , he returned to his regular table. In the course of the heated conversation between his companions, it became clear that the group's various problems stemmed from the smuggler Solo's failure to deliver his cargo of narcotics to Muftak. Knowing that Greedo was attempting to collect on Solo's bounty that same day, Puhr made a wager on the smuggler's life, promising to pay off the group's various debts himself should Solo live.\nAfter his henchmen, Cornelius Evazan and Ponda Baba, were incapacitated by a third party, Greedo's attempt failed, and he was killed by Solo. Puhr, content with the outcome of the situation and the justice of the universe, produced Car'n's kloo horn—in doing so defusing the situation and effectively paying off the \"debts\" of his friends.\nExploiting his species' keen senses and quick reflexes, Djas Puhr was a skilled tracker—effortlessly retrieving Lirin D'avi's kloo horn from a Scrapper for his friend Lirin Car'n. As a bounty hunter, Puhr considered himself a professional and carefully analyzed the situations he found himself in; when he wished to do so, he would even wager on the outcome, sometimes just to consider the philosophy behind it. He was reluctant to form attachments with others, even his drinking partners at Chalmun's Cantina and business associates such as Han Solo, though he retained some sentimentality when remembering his homeworld. In general, the concept of friendship was intriguing to Puhr, who considered Han Solo's gwayo egg smuggling as a foolhardy but admirable and thoughtful gesture.\nDespite his work on Tatooine, Puhr hated Jabba Desilijic Tiure with a passion and refused to take bounties from him, holding other hunters that did so, like Greedo, in contempt. He also disliked the Empire and likened the Imperial Navy to a \"refuse fleet.\"\nIn Star Wars: Episode IV A New Hope, Djas Puhr was portrayed by Kim Falkinburg, who also portrayed the character known as \"Terminal Man\" that would become Trinto Duaba. The name Djas Puhr, first revealed in the now-Star Wars Legends Star Wars Customizable Card Game, is a tuckerization of Jasper, the pet cat of Decipher game designer Jerry Darcy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Djas_Puhr",
  "/wiki/Djas_Puhr/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Djas_Puhr",
  "/wiki/Sakiyan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Imperial_Era",
  "/wiki/Homeworld",
  "/wiki/Slavery",
  "/wiki/Hutt_Clan",
  "/wiki/Gangster",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Crime_lord",
  "/wiki/Bounty",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/First_Mate",
  "/wiki/Chewbacca",
  "/wiki/Gwayo_bird",
  "/wiki/Egg",
  "/wiki/Spice",
  "/wiki/Galactic_Empire",
  "/wiki/0_BBY",
  "/wiki/Spaceport",
  "/wiki/Mos_Eisley",
  "/wiki/Tatooine",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Myo",
  "/wiki/Muftak",
  "/wiki/Kabe",
  "/wiki/Time",
  "/wiki/Kloo_horn",
  "/wiki/Abyssin",
  "/wiki/Gambling",
  "/wiki/Lirin_Car%27n",
  "/wiki/Figrin_D%27an_and_the_Modal_Nodes",
  "/wiki/Band",
  "/wiki/Lirin_D%27avi",
  "/wiki/Currency",
  "/wiki/Rodian",
  "/wiki/Greedo",
  "/wiki/Credit",
  "/wiki/The_Scrapper",
  "/wiki/Standard_day",
  "/wiki/Cornelius_Evazan",
  "/wiki/Ponda_Baba",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Universe",
  "/wiki/Imperial_Navy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Kim_Falkinburg",
  "/wiki/Trinto_Duaba",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Tuckerization",
  "/wiki/Decipher,_Inc.",
  "/wiki/Jerry_Darcy",
  "/wiki/The_Kloo_Horn_Cantina_Caper",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Nerf-Herders-Anonymous",
  "/wiki/September_5",
  "/wiki/2013",
  "/wiki/Premiere_Limited",
  "/wiki/August_15",
  "/wiki/2005",
  "/wiki/November_8",
  "/wiki/2022"
 ]
}