{
 "name": "Dobarn Tren",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Barbadelan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan and orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sacred Way"
     ]
    }
   ]
  }
 ],
 "content": "Dobarn Tren was a Barbadelan male priest of the Sacred Way. He traveled to the planet Corellia to try and aid the poorest citizens of Coronet City but chose to leave the planet after local law enforcement came to incorrectly suspect that he was involved in the black market. Tren was present in Coronet Spaceport when the criminals Han and Qi'ra triggered a security alert in the port in 13 BBY.\nThe Barbadelan male Dobarn Tren served as a priest of the Sacred Way. During the reign of the Galactic Empire, he traveled to Coronet City on the planet Corellia, hoping to alleviate the suffering of the city's poorest citizens. His work drew the attention of local law enforcement, which came to incorrectly suspect that he was buying and selling wares illegally on the black market. Rather than face deportation, Tren regretfully chose to voluntarily leave Corellia.\nIn 13 BBY, the Barbadelan was walking through Coronet Spaceport, where he joined a queue to pass through one of the spaceport's Imperial customs gates in order to leave the planet. However, before Tren could reach a gate, the criminals Han and Qi'ra—who were several places ahead of Tren in the queue—triggered a security alert in the port after Han breached the customs gate. The gate was then sealed while Tren still remained in the queue.\nTren had tan skin, orange tendrils, and black eyes.\nWhile in the spaceport, Tren wore black robes, boots, and gloves, as well as a cowl that attached to several satchels he was carrying.\nDobarn Tren was portrayed by creature performer Robert Nairne in the 2018 Anthology film, Solo: A Star Wars Story. The character was first identified by name in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Barbadelan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sacred_Way",
  "/wiki/Priest",
  "/wiki/Planet",
  "/wiki/Corellia",
  "/wiki/Coronet_City",
  "/wiki/Law_enforcement_agency",
  "/wiki/Black_market",
  "/wiki/Coronet_Spaceport",
  "/wiki/Han_Solo",
  "/wiki/Qi%27ra",
  "/wiki/Spaceport",
  "/wiki/13_BBY",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/City",
  "/wiki/Imperial_Office_of_Customs",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Glove",
  "/wiki/Robert_Nairne",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Solo:_A_Star_Wars_Story_Look_and_Find",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/File:Robert_Nairne_Dobarn_Tren.png"
 ]
}