{
 "name": "Doel Scherp",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Graying"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Darth Revan's Sith Empire",
      "Sith armada",
      "Sith armada"
     ]
    }
   ]
  }
 ],
 "content": "Doel Scherp was a Human male who served as a commander in the Sith fleet during the Jedi Civil War, a galactic conflict that was fought between the Galactic Republic and the Sith Empire. At some point during the war, Scherp was entrusted with a code cylinder that contained the command codes for the sensor systems of the fleet's starships. The Republic sought to obtain the codes, and, in c. 3957 BBY, it sent a team of agents to find Scherp on the planet Sernpidal, where he owned an estate. The agents confronted Scherp inside his estate and obtained the code cylinder from him.\nDoel Scherp was a Human male who lived during the time of the Old Sith Wars. By the outbreak of the Jedi Civil War, a galactic conflict that was fought between the Galactic Republic and the Sith Empire, Scherp was middle-aged. He entered service with the Sith and, through the use of bribery and underhand politics, was able to elevate himself to the position of commander within the Sith fleet. Scherp used his high-ranking position to live a luxurious lifestyle and acquired an estate on the planet Sernpidal, in the Outer Rim Territories. He also hired some personal bodyguards who accompanied him everywhere, whether he was at home on Sernpidal or serving with the Sith fleet.\nAt some point, Scherp was entrusted with a code cylinder that contained command codes for the sensor systems of the Sith fleet and the flagship of Darth Revan, the leader of the Sith Empire. In c. 3957 BBY, he took leave and returned to his estate on Sernpidal, taking the code cylinder with him. However, Republic Intelligence learned that a high-ranking Sith officer was taking shore leave on Sernpidal, so they dispatched a team of agents to the world to locate the officer and obtain the command codes.\nThe Republic agents learned the location of Scherp's estate and proceeded to infiltrate his residence. They confronted Scherp inside his office on the first floor of the building, where he was reading something off a datapad. He immediately began to negotiate with the agents, in an attempt to learn why they were there. However, the agents eventually obtained Scherp's code cylinder, and the Republic used the information contained inside to board Darth Revan's flagship and capture the Dark Lord of the Sith.\nDoel Scherp was a confident man, being able to remain calm and retain self-control even in difficult situations. However, Scherp was a coward and preferred not to take risks when in positions where he was clearly outnumbered. He took advantage of his status within the Sith Empire to enable himself to live a luxurious lifestyle and put great effort into ensuring that he didn't lose his high-ranking position. He also had a reputation as a sharpshooter, which gave him great pride, so he worked hard to maintain it.\nScherp had graying hair and was in good physical health. He spoke with a deep, baritone voice and was multilingual, being able to speak Basic, Durese, Feeorin, Kel Dor, Khilese, and Ryl. He wore a standard blue-colored Sith officer's uniform. Scherp kept the code cylinder containing the command codes in the inside pocket of his jacket and retained an additional three imitation cylinders inside his desk, none of which contained the correct codes.\nDoel Scherp was created by Patrick Stutzman and featured in the 2008 roleplaying scenario The Betrayal of Darth Revan.\nDuring the scenario, the player-characters, who roleplay as the team of Republic agents, can learn Scherp's location on Sernpidal through a number of means. They can bribe or intimidate Sernpidal's inhabitants into revealing the information, or alternately, they can follow a cargo speeder that travels to Scherp's estate with supplies. In addition, one of the players can pretend to be a fellow officer or relative of Scherp and spread corresponding rumors, in an attempt to gain the commander's attention. If the players pursue this method, then Scherp learns of the rumors and realizes that they are false. However, out of curiosity, he dispatches two troopers to escort the Republic agents to his estate.\nLater in the scenario, the agents' encounter with Scherp can go a number of different ways, depending upon the actions of the player-characters. If the players tell Scherp that they are looking for his code cylinder, he offers them a code cylinder containing fake information and claims that it is the one that the agents seek. The players can then obtain the genuine cylinder, either by stunning Scherp and taking it, or by through engaging him in combat. If they choose to fight Scherp, four Mark I assault droids and two of his personal guards come to his assistance. The commander then draws a blaster pistol and falls back behind the droids, then starts to fire at one of the player-characters. If all four of the droids are defeated and at least two of the player-characters are still standing, then Scherp drops his weapon and surrenders. If not, he fights on until either he or the player-characters are defeated. Even if he is defeated, Scherp refuses to hand over the code cylinder unless he is intimidated or rendered unconscious. If the players choose to leave him conscious, then Scherp becomes fearful for his life, and he doesn't trip any alarms or pursue the agents when they subsequently leave the office.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gray",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Sith_armada_(Jedi_Civil_War)",
  "/wiki/Commander/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Code_cylinder/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Starship/Legends",
  "/wiki/3957_BBY",
  "/wiki/Planet/Legends",
  "/wiki/Sernpidal/Legends",
  "/wiki/Scherp%27s_Estate",
  "/wiki/Time/Legends",
  "/wiki/Old_Sith_Wars",
  "/wiki/Politics/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Darth_Revan%27s_flagship",
  "/wiki/Darth/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/Sith_officer",
  "/wiki/Officer/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Capture_of_Darth_Revan",
  "/wiki/Flagship/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Durese/Legends",
  "/wiki/Feeorin_(language)",
  "/wiki/Kel_Dor_(language)/Legends",
  "/wiki/Khilese",
  "/wiki/Twi%27leki/Legends",
  "/wiki/Blue",
  "/wiki/Patrick_Stutzman",
  "/wiki/2008",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/The_Betrayal_of_Darth_Revan",
  "/wiki/Roleplaying_game",
  "/wiki/Cargo_speeder",
  "/wiki/Trooper/Legends",
  "/wiki/Mark_I_assault_droid",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/3956_BBY",
  "/wiki/Deesra_Luur_Jada"
 ]
}