{
 "name": "Dok-Ondar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ithor"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Prior to 206 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dok-Ondar's Den of Antiquities"
     ]
    }
   ]
  }
 ],
 "content": "Dok-Ondar was an Ithorian male collector who operated an antiquities shop in Black Spire Outpost on the planet Batuu on the edge of Wild Space in the Outer Rim. According to a rumor, he was willing to trade any treasure as long as the price was right.\nDok-Ondar was born into a family of gardeners and began his love of collecting discovering bones, unusual rocks and other unusual things while helping his parents in the garden. Supportive and encouraging of his hobbies, his parents allowed him to develop trading and business skills to turn his collecting into a career. However, they were murdered under mysterious circumstances after stumbling upon archaeological secrets related to the Jedi and Sith. Some time afterwards, Dok-Ondar would establish his shop on Batuu.\nIn 10 BBY, Dok-Ondar was present on First Light, the yacht operated by Crimson Dawn crime lord Dryden Vos, while Vos met with Tobias Beckett and Han Solo. Qi'ra, Vos' top lieutenant, wanted to ensure that Dok-Ondar was being well attended to.\nDok-Ondar then went to Tatooine, to Jabba the Hutt's Palace. There, he bought Ki-Adi-Mundi's lightsaber, in addition to a dianoga puppy at double the price.\nDuring the newly-established Galactic Empire's occupation of Jedha, Dok-Ondar hired and accompanied Captain Hondo Ohnaka to retrieve a Kyber crystal statue from the Temple of the Kyber. Dok-Ondar, Ohnaka, and his protege Quadoro went into the temple. Inside they were confronted by several Guardians of the Whills. Despite the Guardians, Dok-Ondar was able to grab one of the statues by using Mundi's lightsaber to cut it out. As they made their way out, they were confronted by Chirrut Îmwe. Dok-Ondar was able to convince Îmwe to let them leave with the statue. He and Ohnaka were able to board their shuttle and make their way past the Empire's blockade.\nAt one point before the Battle of Yavin, Dok-Ondar, dealer of ancient antiquities stationed on Batuu, hired Solo to retrieve some infant sarlaccs from a famous holo scientific sarlacc keeper, Genzhor, on the planet I'vorcia Prime. When Solo arrived at the reserve, he found that Dr. Genzhor had been slain by his assistant, Ooris, when he pushed him into a pit of sarlaccs, and he was trying to scam him and attempted to steal his ship, the Millennium Falcon. After the events on I'vorcia Prime, Dok-Ondar was met again by Solo, returning the infant sarlacc. Dok-Ondar was dissatisfied with the results, due to there only being one, but Han lied and told him the reserve only had one.\nDuring the Galactic Civil War, Dok-Ondar hired some men and accompanied Dr. Chelli Lona Aphra and her crew to Moraband using his ship. Dok-Ondar went to Moraband retrieve the Sword of Khashyun from a Sith Temple. Dok-Ondar watched as Aphra and his muscle, a group of Shistavanens, went into the temple. When 0-0-0 attempted to kill him, Dok-Ondar and his last man ripped 0-0-0 apart. He confronted Aphra after she and BT-1 retrieved the sword. Dok-Ondar fired a EMP pulse at BT-1 and refused to let the sword go to her. Aphra refused to give him the sword and had BT-1 take out the last of his muscle. Dok-Ondar shot at Aphra and split the sword in half. As he tried to reclaim the sword, which was now stuck in the ground, he noticed 0-0-0 rebooting and decided to take what he could, claiming one half and leaving Aphra the other half. Dok-Ondar left her and her droids stranded on Moraband. He deeply regretted splitting the sword in half.\nAt one point, Remex Io, a Clawdite reunited with his crew led by female human Kendoh Voss, spoke with Dok-Ondar on Batuu, at Black Spire Outpost. Dok-Ondar was disappointed with how late the crew was, due to the First Order's arrival and Io needing to take a longer route through an alley. While there, the other member of Voss' crew, Wooro, noticed an infant sarlacc. Dok-Ondar told him the story of Solo smuggling them in from a reserve on I'vorcia Prime, but Voss immediately got to showing Dok-Ondar what she wants to sell him. When Dok-Ondar saw what was on the screen, a lightsaber, he asked them to leave immediately. His assistant asked him how that weapon could have been retrieved, and Dok-Ondar wanted to make sure it did not fall into the wrong hands.\nLater, the First Order arrived at Dok-Ondar's place to investigate the lightsaber that he owned. A stormtrooper sergeant threatened Dok-Ondar, saying all of his items could be reclassified as contraband and destroyed and also noting that owning a lightsaber could once again be a crime. When the stormtroopers left, Dok-Ondar noted to his assistant and translator Tohago that he planned to move the hilt of the sword to a safe location to prevent the First Order from discovering it.\nLater, Dok-Ondar sent his Clawdite enforcer Varg to intercept Io. Varg incapacitated Io and impersonated him to get on the inside of the Kendooh Gang. Then, Dok-Ondar listened in on a conversation between Voss and Hondo Ohnaka, who he was in league with. Voss revealed part of her plan to Ohnaka, trying to hire him as a pilot, unaware of his ties with Dok-Ondar. However, when Voss showed Ohnaka what the cargo was, the Sword of Khashyun, Dok-Ondar was furious to see Ohnaka reveal his knowledge of the sword to Voss.\nOhnaka made his way to Dok-Ondar to inform him of what he knew, but when he began to babble loudly in the street, Dok-Ondar angrily silenced him, warning him of the amount of spies in the area. Bringing him inside, Ohnaka told him what he knew, unaware that they were being spied on by a cam droid operated by the Kendoh Gang. Dok-Ondar explained the mission he and Aphra undertook on Moraband to Ohnaka, and when Ohnaka asked for more details, Dok-Ondar told him that they could talk more at the safe house, expressing his desire to move the hilt to Ohnaka's ship before it could be stolen. Just then, Voss and Wooro entered the den to steal the hilt. However, Dok-Ondar activated his primary security droid BK-86, but at the same time, a group of stormtroopers formed outside.\nThe stormtroopers entered, aiming their blasters at Dok-Ondar, Tohago, BK-86, Voss, and Wooro. After the stormtroopers beat Wooro and hit Voss on the chin with a blaster, they questioned Voss about her intentions on Batuu, believing her to be with the Resistance. Then, Voss improvised, eventually passing off the hilt to Wooro, who would unknowingly give it to Varg, thinking he was Io. Varg returned the hilt to Dok-Ondar, who then contacted Voss via hologram to reveal he was the benefactor that had hired them. Dok-Ondar told them that he could not afford to let them sell the blade and instead tried to unite the two pieces. As he succeeded in doing so, he told the crew that their payment was leaving the planet safely, saying he gave the First Order an anonymous tip regarding their location that would give them enough time to escape.\nDok-Ondar was known for being a bit temperamental, yet he was willing to sell good stuff to his customers if they did the right deals with him. Dok's reputation on Batuu and beyond made him a respected and often feared figure within the black market and collecting community. Anyone who dared try and cheat on him would be put on his enemies list, referred to as the \"Doklist\" by locals, and find themselves the target of bounty hunters. Dok-Ondar also found himself in the position of an unofficial banker for Black Spire Outpost and worked with Oga Garra to keep track of debts owed to the both of them, with Oga's crew helping enforce these debts.\nThe Walt Disney Parks and Resorts panel at the D23 Expo on July 16, 2017 announced Dok-Ondar as a character that would make appearances in the upcoming theme-park land Star Wars: Galaxy's Edge. The themed lands were opened in 2019, first at Disneyland in Anaheim, California and then at Walt Disney World in Orlando, Florida.\nDok-Ondar takes the form of an animatronic that cast-member attendants can interact with, asking how much it will take to part with certain items. A bust of Dok-Ondar was later present during Celebration Chicago.\nWithin the Star Wars canon, Dok-Ondar was first mentioned in the 2018 Star Wars Anthology film Solo: A Star Wars Story.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Force_Collector",
  "/wiki/Galaxy%27s_Edge:_Black_Spire",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/Galaxy%27s_Edge_3",
  "/wiki/Galaxy%27s_Edge_4",
  "/wiki/Galaxy%27s_Edge_5",
  "/wiki/A_Crash_of_Fate",
  "/wiki/Buyer_Beware",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Ithor",
  "/wiki/Ithorian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Dok-Ondar%27s_Den_of_Antiquities",
  "/wiki/Collector",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Wild_Space",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Jedi",
  "/wiki/Sith",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/10_BBY",
  "/wiki/First_Light",
  "/wiki/Yacht",
  "/wiki/Crimson_Dawn",
  "/wiki/Crime_lord",
  "/wiki/Dryden_Vos",
  "/wiki/Tobias_Beckett",
  "/wiki/Han_Solo",
  "/wiki/Qi%27ra",
  "/wiki/Lieutenant",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Ki-Adi-Mundi%27s_lightsaber",
  "/wiki/Dianoga",
  "/wiki/Galactic_Empire",
  "/wiki/Jedha",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Kyber_crystal",
  "/wiki/Temple_of_the_Kyber",
  "/wiki/Quadoro",
  "/wiki/Guardians_of_the_Whills",
  "/wiki/Chirrut_%C3%8Emwe",
  "/wiki/Flarestar-class_attack_shuttle",
  "/wiki/Battle_of_Yavin",
  "/wiki/Sarlacc",
  "/wiki/Hologram",
  "/wiki/Genzhor",
  "/wiki/I%27vorcia_Prime",
  "/wiki/I%27vorcia_Prime_Preserve",
  "/wiki/Ooris",
  "/wiki/Millennium_Falcon",
  "/wiki/Galactic_Civil_War",
  "/wiki/Mission_to_Moraband_(Dok-Ondar)",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Chelli_Lona_Aphra%27s_crew",
  "/wiki/Moraband",
  "/wiki/Sword_of_Khashyun",
  "/wiki/Sith_temple_(Sword_of_Khashyun)",
  "/wiki/Shistavanen",
  "/wiki/0-0-0",
  "/wiki/BT-1",
  "/wiki/Remex_Io",
  "/wiki/Clawdite",
  "/wiki/Kendoh_Gang",
  "/wiki/Human",
  "/wiki/Kendoh_Voss",
  "/wiki/First_Order",
  "/wiki/Wooro",
  "/wiki/Smuggler",
  "/wiki/Unidentified_First_Order_stormtrooper_sergeant",
  "/wiki/Tohago",
  "/wiki/Varg",
  "/wiki/Cam_droid",
  "/wiki/BK-86",
  "/wiki/Resistance",
  "/wiki/Oga_Garra",
  "/wiki/July_16",
  "/wiki/2017",
  "/wiki/2019",
  "/wiki/Celebration_Chicago",
  "/wiki/Star_Wars",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Star_Wars_(2020)_18",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
  "/wiki/Galaxy%27s_Edge_1",
  "/wiki/A_Crash_of_Fate_(audiobook)",
  "/wiki/Dark_Legends",
  "/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge_%E2%80%93_Last_Call",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Black_Spire_Outpost_(Galaxy_of_Adventures)",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/Star_Wars:_Batuu_Bounty_Hunters",
  "/wiki/Category:Images_of_Dok-Ondar",
  "/wiki/Star_Wars:_Galaxy%27s_Edge_trading_cards",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Book_of_Lists",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Heroes_of_Rogue_One",
  "/wiki/The_Art_of_Star_Wars:_Galaxy%27s_Edge",
  "/wiki/General_Equipment_(I)",
  "/wiki/Databank_(website)",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide"
 ]
}