{
 "name": "Dokk_Strassi",
 "display_name": "Dokk Strassi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trandoshan family",
      "Jabba's criminal empire",
      "Fett gotra",
      "Pyke Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "Dokk Strassi was a Trandoshan male who was the leader of the Trandoshan family on the planet Tatooine, working under Jabba the Hutt's criminal empire. Following Jabba's death, the Trandoshans protected the city centre and business districts of Mos Espa. After Boba Fett, a bounty hunter who had once worked for Strassi, took the throne to the late Jabba's empire as the new Daimyo, Strassi went to the palace to pay tribute to him.\nWhen the Pyke Syndicate threatened Fett's rule, the Daimyo gathered Strassi and the other two family leaders of Mos Espa and proposed an alliance against the Pykes. Strassi sided with the don of the Klatooinian family, who wished not to get involved in Fett's feud. The Daimyo them promised to get rid of the Pyke Syndicate and asked that the families remained neutral during his war. Strassi and the other leaders agreed to Fett's terms.\nHowever, Strassi and the other dons had a deal with the Pyke Syndicate and helped the Pykes in their attempt to drive Fett from Mos Espa. While soldiers of the Trandoshan family took part in the battle, Strassi took refuge at the Pykes' headquarters at the Mos Eisley spaceport on Tatooine, alongside the other two family leaders and Mayor Mok Shaiz of Mos Espa. With Fett driving the Pykes out of the city, the Pyke boss on Tatooine decided that his people would abandon the planet, Strassi and the other leaders being displeased at the decision. However, they were interrupted by Fett's assassin, Fennec Shand, who killed everyone in the headquarters.\nThe Trandoshan Dokk Strassi was a crime boss and the leader of the Trandoshan family on the desert planet Tatooine, which operated as part of the crime empire of Jabba the Hutt. The crime boss was one of Jabba's captains, and made much money in his position. The famed bounty hunter Boba Fett, who had been employed by Jabba, worked for Strassi at one point.\nIn 4 ABY, Jabba was killed during a failed execution and Bib Fortuna, the Hutt's majordomo claimed to be heir to Jabba's throne. As a result, Strassi quickly split his family from the late Jabba's criminal empire, the Aqualish family and the Klatooinian family doing the same. Furthermore, the city of Mos Espa was split between the three, the Trandoshans protecting the city centre and business districts. Fortuna relied on an uneasy alliance with the families to maintain control of his territories, all while Strassi and the other family leaders made attempts to take the throne for themselves, only to be thwarted.\nAround 9 ABY, Fett, having given up his career as a bounty hunter, murdered Fortuna and took his place as the new Daimyo upon the throne. With Fett starting his new criminal empire from the ashes of Jabba's, the Trandoshan traveled to Boba's palace along with a number of other assets within the empire to pay tribute to the new Daimyo. Entering Boba's throne room, Strassi was introduced by the 8D-series smelter droid 8D8 and carried in the fur coat of a Wookiee, a species that were known to hate Trandoshans, as a gift. The Trandoshan paid tribute to Fett, who returned his own compliment. Strassi then handed the fur coat to 8D8 and gave more praise to Fett before leaving. The Daimyo jokingly remarked that the Trandoshan's compliment sounded like a threat.\nIn the meantime, the Pyke Syndicate, which had already begun spice trade on Tatooine, bribed Mok Shaiz, the mayor of Mos Espa, into promising Mos Espa to them. With his rule challenged, Fett gathered the leaders of the three ruling families of Mos Espa to have dinner at his palace, Strassi bringing several of his associates. During the meeting, Fennec Shand, Fett's master assassin, recounted the past power struggle involving Bib Fortuna and promised the family leaders could thrive once more under the Daimyo. Beginning his part, Fett promised to take no tribute or percentage from the families or provide any the other way. After the Daimyo claimed that the Pyke Syndicate's operations were draining Tatooine's wealth, Strassi insisted that the families benefited financially from spice trade.\nAs the don of the Klatooinian family questioned Fett's claim to the throne, Fett's rancor disturbed the meeting from below the floor, causing Strassi and the other attendees to promptly rise from their seats. Easing his beast, the Daimyo had his guests seated again, and proposed that they form an alliance against the Pykes. The Klatooinian don was skeptical about joining a feud that so far did not involve the families, Strassi agreeing with him. As a result, the Daimyo promised to get rid of the Pyke Syndicate himself, asking only for the families to remain neutral in the process. Conversing with one of his associates Strassi agreed with Fett's new terms, the Aqualish leader Garfalaquox and the Klatooinian don doing so as well. With the families in agreement, they raised a toast at the dinner table. The guests eventually went back to their speeders and departed from the palace grounds.\nStrassi's deal with Fett was short lived, as he and the other two family leaders had a deal with the Pyke Syndicate, requiring Tatooine to be hospitable for the syndicate to do business. While the leaders traveled to the Pykes' headquarters on Tatooine, the Desert Survey Office at the Mos Eisley spaceport, the forces under the Mos Espa families and the Pykes prepared to usurp Fett from his position of power over the city. As part of the attack, the families moved first, Strassi's soldiers attacking Fett's Wookiee enforcer Krrsantan while he stood watch in the city center. However, the Wookiee was able to evade defeat from his Trandoshan attackers, killing a number of them in the process. In addition, Fett and his assets managed to drive the Pyke forces out of the city, killing half of them in the battle.\nBack at the Desert Survey Office, Strassi and the other family dons were present with Mok Shaiz and the Pyke Syndicate's boss on Tatooine. The Pyke boss informed the other four that his forces were withdrawing to Mos Eisley in preparation to leave the planet. The leaders were displeased, Strassi—who held an SE-14r light repeating blaster in his hand—insisted that they and the Pykes had a deal. The boss, though, pointed out that Tatooine was no longer hospitable for his syndicate. As arguing continued, the group heard gunshots from outside. Strassi, the boss, and the family leaders raised their blasters when Shand, firing from above, shot down the three dons of Mos Espa in quick fashion. The assassin then proceeded to kill Shaiz and the Pykes before leaving.\nA Trandoshan male, Dokk Strassi had light brown skin and yellow eyes. When greeting the new Daimyo, Boba Fett, he bowed respectfully and extended a compliment to him. Strassi was reluctant to join Fett against the Pyke Syndicate, seeing profit in the Syndicate's spice exports and pretending to abide with the Daimyo's terms of neutrality. Acting in his own self interest, he was quick to betray Fett and make a deal with the Pykes to overthrow the Daimyo, and was displeased when the Syndicate's boss on Tatooine chose to pull his people offworld.\nStrassi wore blue, red and black clothing with a necklace. He traveled by speeder when attending a meeting with Fett and the other family leaders of Mos Espa. The Trandoshan also wielded an SE-14r light repeating blaster.\nDokk Strassi was first pictured in the official trailer for the Disney+ series The Book of Boba Fett, which was published on YouTube on November 1, 2021. He then made his debut in the first episode of the series, \"Chapter 1: Stranger in a Strange Land,\" which was directed by Robert Rodriguez and released on December 29 of that year. Strassi was voiced by Rodriguez himself for the series and physically portrayed by Stephen Oyoung in Chapter 1 and Rodriguez's \"Chapter 7: In the Name of Honor,\" released on February 9 2022. Andres Saenz Hudson, though, was the performance double for Strassi in \"Chapter 4: The Gathering Storm,\" directed by Kevin Tancharoen and released on January 19, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Trandoshan_family",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Fett_gotra",
  "/wiki/Pyke_Syndicate",
  "/wiki/Planet",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Death",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Boba_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Daimyo",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Pyke",
  "/wiki/Unidentified_Klatooinian_don",
  "/wiki/Tatooine_Klatooinian_family",
  "/wiki/Battle_for_Mos_Espa",
  "/wiki/Desert_Survey_Office",
  "/wiki/Mos_Eisley",
  "/wiki/Spaceport",
  "/wiki/Mayor",
  "/wiki/Mok_Shaiz",
  "/wiki/Mayor_of_Mos_Espa",
  "/wiki/Unidentified_Pyke_boss",
  "/wiki/Assassin",
  "/wiki/Fennec_Shand",
  "/wiki/Assassination_of_the_Pyke_Syndicate_leaders",
  "/wiki/Crime_lord",
  "/wiki/Desert",
  "/wiki/Captain",
  "/wiki/4_ABY",
  "/wiki/Bib_Fortuna",
  "/wiki/Hutt",
  "/wiki/Majordomo",
  "/wiki/Jabba_the_Hutt%27s_dais",
  "/wiki/Aqualish_crime_family",
  "/wiki/Mos_Espa_city_center",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/8D-series_smelter_droid",
  "/wiki/8D8",
  "/wiki/Wookiee",
  "/wiki/Species",
  "/wiki/Master_Assassin",
  "/wiki/Klatooinian",
  "/wiki/Boba_Fett%27s_rancor",
  "/wiki/Garfalaquox",
  "/wiki/Speeder",
  "/wiki/Krrsantan",
  "/wiki/SE-14r_light_repeating_blaster",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Necklace",
  "/wiki/Repeating_blaster",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/November_1",
  "/wiki/2021",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/Robert_Rodriguez",
  "/wiki/December_29",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/February_9",
  "/wiki/2022",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Kevin_Tancharoen",
  "/wiki/January_19",
  "/wiki/Category:Images_of_Dokk_Strassi",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa"
 ]
}