{
 "name": "Dol Heep",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Avon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Avoni"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Dol Heep was an ambassador to the planet Radnor from Avon who tried to convince the Radnoran brother-and-sister scientific team Galen and Curi to sell to the Avoni the new bio-weapon they were developing. When the two refused , Heep was furious.\nKnowing that it was Curi who was opposed to selling the weapon, Heep pretended to be stranded on Radnor due to the bioplague that resulted when Galen's bio-weapons facility experienced a toxic leak . When Heep met the Jedi who were tasked with evacuating the remaining survivors, Heep offered to send a fleet of Avoni ships to transport them to Coruscant. However the Avoni ships that arrived were instead prepared for a full-scale takeover of Radnor, as revenge for not selling Avon the toxin.\nAfter the Jedi managed to avert the invasion, Dol Heep pretended that it was never the Avoni's plan to take over Radnor. After restoring the planetary communications , Heep and the Avoni left Radnor. Due to the expected debating that would go on in the Senate if the Radnorans even attempted to file a report against the Avoni, Heep went free without paying for his planet's crimes.\nVain, greedy, selfish, duplicitous, and ill-tempered, Dol Heep―a tall being with a large, domed head and prominent eyes―accustomed himself to wearing, even over a bio-iso  suit that he wore, an ornate septsilk cloak, which gave him a slightly ridiculous air. His mode of speech was declamatory, loud, and bombastic, even in hushed settings.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Avon",
  "/wiki/Avoni",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Radnor/Legends",
  "/wiki/Radnoran",
  "/wiki/Galen_(Radnoran)",
  "/wiki/Curi",
  "/wiki/Jedi/Legends",
  "/wiki/Mission_to_Radnor",
  "/wiki/Coruscant/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Septsilk/Legends",
  "/wiki/Jedi_Quest:_The_Way_of_the_Apprentice",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}