{
 "name": "Dol Donar II",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 BBY",
      "Dol Donar's yacht"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Dol Donar II was a Human male who served as the Imperial governor of Derra IV during the Galactic Civil War. His wife was Rissa Donar, and his youngest son, Nathan Donar III, was a graduate of the Academy of Carida. He had a strong dislike of the Rebel Alliance.\nDol Donar II was the Governor of the planet Derra IV by the year 1 BBY. By this point, Donar was married to a woman named Rissa, and they had a son who was named Nathan Donar III whom Dol often advised that \"only suckers take chances\".\nOn the twentieth anniversary of their wedding, Madame Donar gave him a precious ring.\nIn 1 BBY the couple visited the Imperial Academy on the planet Carida to attend the graduation ceremony of Nathan's class. Following this, the family took a trip on the luxury starship Star of Empire. On board, Nathan met and invited fellow student Kyle Katarn to have dinner with the family, whom he introduced as his famous and heroic friend; Donar was interested in Kyle's background and was enraged hearing that his father was killed by Rebel terrorists, assuring him that the Emperor was preparing something against them. He ignored his wife's admonition to lower his voice, and ignored her as she nodded negatively when Lando Calrissian approached them for a game of sabacc.\nAfter dinner, father and son went to the Corellia Room to join Calrissian; while at first the businessman allowed him to win the first hands to keep him in the game, it eventually resulted in Donar placing, and losing several hefty bets, including his wife's anniversary ring. This brought some tense hours of silence in the family, and Donar pretended to stare at a blank computer screen, wishing to avoid his wife's anger, and hoping to fix the loss of the ring. He found the diversion he wished for when their droid brought a Rodian visitor, a bounty hunter named Slyder; the Donars showed annoyed by the alien's look, including his natural Rodian odor covered by cologne, and instead of greeting or welcoming him, the governor bluntly inquired his business. He was shocked to hear that Rebels were on the ship, rising up and letting his computer drop to the floor. To prove his claims, the Rodian showed a holo-recording of a seditious conversation between some Rebel agents and the female one interacting with Kyle Katarn. Furious, Donar ordered Slyder to hunt and arrest them.\nTo that end he recruited some Imperial military officers to accompany Slyder and his son, but the Rebels escaped, and a reason was that Nathan was nice enough to send a warning to his friend. They came back with their droid, A-Cee. The Governor offered to employ his own yacht for the pursuit, and for a reason that Slyder could not understand, he insisted on taking the droid's remains with them and had a technician to re-activate it. Slyder thought that the bulky presence of the Governor somehow disrupted the operation.\nWhile pursuing the Rebel Truly Sorry the bullied technician reactivated the droid. A-Cee spotted Nathan's Imperial uniform, and began to self-destruct. Slyder, who already was feeling that the humans were too incompetent to be tolerated, started shooting around before A-Cee killed everyone, destroying the yacht. Governor Donar found his end in that havoc, next to his son.\nDonar was a strong supporter of the Galactic Empire. In addition, he was an avid card player, and greatly enjoyed the game sabacc although he admitted he had poor skills.\nKyle Katarn noticed that in a single dinner the Governor ate what Kyle needed to sustain himself for a whole week. An extremely obese man with three chins and fleshy hands, he attempted to hide his shape by wearing flowing, expensive clothing in great folds; he could be seen wearing shimmering light-reflecting fabric that rustled as he moved. He sported a pinkie ring set with a five-karat Rol Stone. He also wore a monocle.\nHe had a nasal voice, a trait his son inherited. His eyes reminded Katarn of turbolasers\nIn the audio adaptation of Dark Forces: Soldier for the Empire, he was voiced by Gary Groomes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Dol_Donar%27s_yacht",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/File:OnlyGoodRebelDeadRebel-DFSftE.ogg",
  "/wiki/Governor/Legends",
  "/wiki/Derra_IV",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Rissa_Donar",
  "/wiki/Nathan_Donar_III",
  "/wiki/Academy_of_Carida",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Carida/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Star_of_Empire",
  "/wiki/Kyle_Katarn",
  "/wiki/Morgan_Katarn",
  "/wiki/Palpatine/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Corellia_Room",
  "/wiki/Donar_family_protocol_droid",
  "/wiki/Rodian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Slyder",
  "/wiki/Agent/Legends",
  "/wiki/Jan_Ors",
  "/wiki/Skirmish_on_the_Star_of_Empire",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Droid/Legends",
  "/wiki/A-Cee",
  "/wiki/Technician/Legends",
  "/wiki/Truly_Sorry",
  "/wiki/Clothing/Legends",
  "/wiki/Rol_Stone",
  "/wiki/Turbolaser/Legends",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire_audio_drama",
  "/wiki/Gary_Groomes",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}