{
 "name": "Dolac Legasi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Apprentices",
     "values": [
      "Roden Venthrall"
     ]
    }
   ]
  }
 ],
 "content": "Dolac Legasi was Human male assassin who lived during the Galactic Civil War.\nDolac Legasi was a master assassin who trained at some point a student named Roden Venthrall. Legasi was eventually captured by the Galactic Empire and sentenced him to life imprisonment in the Imperial Prison on the planet Dathomir. He was sent here by Emperor Palpatine himself, though it was not known why he was imprisoned. He thought that it may have been because the Emperor knew he could one day challenge him for control of the Empire.\nIn 1 ABY, Dolac Legasi helped Imperial officer Mozo Bondog uncover the mystery of the disappearing inmates by tasking a stranger to recover one of the inmates which had reappeared. Sometime after this, he tasked the spacer with recovering the shadow shard, which was in fact a piece of a Sith holocron, from a Dark Jedi so that the individual could find the place of shadows and recover the shadow stone. After he studied the shard, Dolac informed the individual that there was an ancient evil on the planet; a Sith who could enslave the minds of others. This Sith was the one responsible for the missing prisoners; they had taken control of the prisoners minds as well as the Imperial prison guards who would wipe the evidence away and none would remember their actions. Legasi pretended that he had been contacted by this Sith before who had wanted his allegiance, but he refused to give it. He was also too powerful to be controlled like the other prisoners so the Sith warrior had made arrangements to have him destroyed. Because of this, he arranged for the individual to take out the Sith, and he provided the individual coordinates of where to find them. The spacer fought and killed the Dark Jedi Master and three Nightsisters. After this was done, he awarded the individual 1,800 credits.\nDolac Legasi was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011.\nThough it was never said specifically, it was very likely that Dolac Legasi was in fact Force-sensitive; he was imprisoned on Dathomir by Emperor Palpatine, perhaps for being a threat to him. Also, he claimed he was too strong for the Sith to take control of his mind,and the Sith had wanted his allegiance after discovering this.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Roden_Venthrall",
  "/wiki/Assassin/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Ind",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dathomir_Imperial_Prison",
  "/wiki/Planet/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Mozo_Bondog",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}