{
 "name": "Doman_Beruss_(Corellian)",
 "display_name": "Doman Beruss  (Corellian)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance of Free Planets",
      "New Republic",
      "New Republic Provisional Council",
      "New Republic Ruling Council",
      "New Republic Provisional Council",
      "New Republic Ruling Council"
     ]
    }
   ]
  }
 ],
 "content": "Doman Beruss was a Corellian politician and a founder of the New Republic.\nDoman Beruss was a member of the Corellian branch of the well-known Beruss family of Illodia and, out of respect, was named after an older relative. She was an aunt of Senator Doman Beruss and a great-aunt of his son, Rogue Squadron pilot Avan Beruss. As a representative of Corellia, Beruss became one of the nine signatories of the Declaration of the Alliance of Free Planets. Four weeks later, Beruss signed the Declaration of a New Republic. She subsequently served as a representative of the Corellian exiles on the New Republic Provisional Council.\nApproximately one year after the Battle of Endor, General Airen Cracken informed Beruss and the rest of the Council of reports that Imperial leader Sate Pestage had been charged with treason and fled Imperial Center. Beruss advocated for a New Republic mission to rescue Pestage, arguing that successfully doing so would render other Imperials more willing to defect from the declining Empire. A New Republic team secured Pestage on Ciutric, only to be trapped there by Imperial forces. Although her great-nephew Avan was a participant in the endangered mission, Beruss recommended not sending reinforcements, believing any escalation of the situation would be detrimental to the\nRepublic. At the same time, Avan worried that his great-aunt was holding back reinforcements to avoid the appearance of favoritism toward him. Despite the lack of support, Avan survived the mission, which ultimately failed to keep Pestage in Republic custody.\nIn 6 ABY, as the New Republic was preparing for an attempt to seize Coruscant, Doman Beruss attended a meeting of the Provisional Council. There, she pointed out to the other councilors that whoever was able to claim Coruscant would be seen as the legitimate government of the galaxy, and that the warlord Zsinj had likely taken notice of the Republic's recent push toward the capital. Beruss was present at another meeting the following day, in which the debate over how to approach Coruscant continued. In response to Admiral Gial Ackbar's proposal to send a team of military specialists to Coruscant prior to the main attack, Beruss asked Airen Cracken, who specialized in such matters, if he felt prepared to handle the operation. She also expressed approval of Councilor Borsk Fey'lya's plan to distract Imperial forces by freeing Black Sun operatives from Kessel and releasing them on Coruscant.\nAfter the New Republic liberated Coruscant, Beruss and other members of the Provisional Council convened on the world in what had once been a Senatorial apartment area. There, Beruss sat beside Mon Mothma as she heard Commander Wedge Antilles argue in defense of Captain Tycho Celchu, who faced accusations of treason against the New Republic. While she claimed to respect Antilles' convictions, Beruss stated that the evidence against Celchu was sufficient to warrant a trial. At a later meeting on Coruscant, the Council debated how the Republic's bacta supply should be used to deal with an outbreak of the Krytos virus, and Beruss objected when Fey'lya accused Councilor Leia Organa of anti-alien bias for her opposition to Fey'lya's proposed strategy for bacta distribution.\nThe Council would be active until 7 ABY, to be replaced by the first New Republic Senate. In 10 ABY she was one of the signatories of Why Do We Fight the Empire?. Beruss retained her position until at least 11 ABY and the beginnings of the Daala crisis.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Doman_Beruss",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Provisional_Council",
  "/wiki/New_Republic_Ruling_Council",
  "/wiki/Clan_Beruss",
  "/wiki/Illodia",
  "/wiki/Doman_Beruss_(elder)",
  "/wiki/Senator/Legends",
  "/wiki/Doman_Beruss_(Illodian)",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Avan_Beruss",
  "/wiki/Declaration_of_the_Alliance_of_Free_Planets",
  "/wiki/Standard_week/Legends",
  "/wiki/Declaration_of_a_New_Republic/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Evacuation_of_Ciutric",
  "/wiki/Ciutric_IV",
  "/wiki/6_ABY/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Borsk_Fey%27lya",
  "/wiki/Black_Sun/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Liberation_of_Coruscant_(Galactic_Civil_War)",
  "/wiki/Imperial_Senate/Legends",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Trial_of_Tycho_Celchu",
  "/wiki/Bacta/Legends",
  "/wiki/Krytos_virus",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alien/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Why_Do_We_Fight_the_Empire%3F",
  "/wiki/11_ABY/Legends",
  "/wiki/Natasi_Daala",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_In_the_Empire%27s_Service",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Mandatory_Retirement",
  "/wiki/X-Wing:_Wedge%27s_Gamble",
  "/wiki/X-Wing:_The_Krytos_Trap",
  "/wiki/I,_Jedi",
  "/wiki/Category:Images_of_Doman_Beruss",
  "/wiki/Heir_to_the_Empire_Sourcebook",
  "/wiki/Dark_Empire_Sourcebook",
  "/wiki/The_Truce_at_Bakura_Sourcebook",
  "/wiki/The_Thrawn_Trilogy_Sourcebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Omnibus:_X-Wing_Rogue_Squadron_Volume_3",
  "/wiki/Council",
  "/wiki/Corellian_sector/Legends",
  "/wiki/Garm_Bel_Iblis/Legends",
  "/wiki/4_ABY/Legends"
 ]
}