{
 "name": "Domina_Tagge",
 "display_name": "Domina Tagge",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Tagge",
      "Tagge Corporation",
      "Tagge Corporation",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Domina Tagge was a human female member of the prominent Tagge family and the head of the Tagge Corporation. Tagge held the title of Lady and operated from Tagge Space aboard the starship Acquisitor. She was the aunt of Ronen Tagge, whom she often spoiled, allowing him to have whatever he wanted. Domina was the cousin of Adelaide Tagge and the sister of Ulric Tagge, Orman Tagge, and Silas Tagge.\nWhen Ronen sought to acquire the supposedly powerful artifacts known as the Rings of Vaale, the rogue archaeologist Doctor Chelli Aphra, who had attempted to acquire the Rings herself, destroyed his penthouse, nearly killing him in the process. After the near-death of her nephew, Tagge placed a bounty on Aphra. The archaeologist was captured by the sniper Just Lucky and the bounty hunter Kharrek and delivered to the Acquisitor, where Tagge ordered Aphra to undertake a task. Tagge would require Aphra to infiltrate the rival company De'Rruyet Industries, whose leader, Beol De'Rruyet, claimed to possess a Nihil Path engine that could provide a revolutionary method of lightspeed travel and thus financially ruin the Tagge dynasty.\nIn 3 or 4 ABY, Silas hired the Ubese bounty hunter Boushh to assassinate other members of the Board of Tagge Corporation so he could take control from Domina. Following a skirmish between Domina armed with a Tagge protoblade and Boushh's crew, Domina killed Silas aboard the Acquisitor.\nDomina Tagge was a human female of the powerful Tagge dynasty who lived during the age of the Galactic Empire. She had at least three older brothers: Ulric Tagge, Orman Tagge, and Silas Tagge. Adelaide Tagge was Domina's cousin. As a child, Domina survived at least two assassination attempts and resolved that she would never be a \"pawn\" thereafter. Instead, she saw herself as a player in a \"game\" that was hers to win.\nDomina had a nephew named Ronen Tagge whom she spoiled, often giving him anything he wanted.\nEventually, Domina rose to lead the Tagge Corporation. She commanded that company's flagship, the Acquisitor, from Tagge Space; a region of the galaxy ruled by her Tagge family. Domina claimed to have made TaggeCo stronger and more powerful under her leadership than it had ever been.\nDomina's brother Silas coveted her position, believing himself an underappreciated genius. In 3 or 4 ABY, Silas hired a group of exiled Ubese bounty hunters led by Boushh to assassinate the rest of TaggeCo's Executive Board, seeking to seize power in that coup. A skirmish ensued between the mercenaries and members of the Tagge Corporation.\nDomina wielded the Tagge protoblade against many of the attackers, besting several of them. Eventually, one of the bounty hunters targeted Silas, who unwittingly confessed to his treachery by proclaiming that he had hired the mercenaries for the attack. At that moment, Domina arrived, attacking both Silas and the Ubese who had confronted him. Domina felt vindicated at Silas' confession, but did not feel it was required for her to take action against him. Domina's Honor Guard eventually arrived, forcing an end to hostilities. Domina had most personnel evacuated from the Acquisitor before making a deal with Boushh's crew and killing Silas with the unpowered protoblade.\nDomina Tagge held a cynical view of her Tagge family, describing as a \"nest of vipers\" to her secretary Lapin. She had a Machiavellian sense of morality, evidenced by her lust for power and her remark to Silas that his only crime had been \"being caught\" as she killed him. Domina was willing to convert former enemies into assets. She hired the bounty hunters of Boushh's crew for her own purposes immediately after they attempted to assassinate her and others of her family at the commission of Silas Tagge.\nDomina Tagge wielded the Tagge protoblade with high proficiency in combat against her honor guard during testing, and later against the bounty hunters of Boushh's crew. She used the weapon to cut through walls and destroy enemies' weapons.\nAfter the protoblade's power supply failed, Domina continued to wield the unpowered weapon, which then functioned as a traditional melee weapon. After evacuating the Acquisitor and remaining aboard with only Silas, her honor guard, and the bounty hunters Silas had hired; Domina used the broken Tagge protoblade to kill her treacherous brother.\nDomina Tagge was first mentioned in the current Star Wars Canon in the first issue of the 2020 comic series Star Wars: Doctor Aphra. She first appeared in the fifth issue of the same comic.\nIn Star Wars Legends, Domina Tagge was Force-sensitive and the sister of Imperial General Cassio Tagge. She first appeared in the thirty-fifth issue of the 1977 Marvel Star Wars comic series, which was released in 1980.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Domina_Tagge",
  "/wiki/Domina_Tagge/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/House_of_Tagge",
  "/wiki/Tagge_Corporation",
  "/wiki/Galactic_Empire",
  "/wiki/Lord",
  "/wiki/Tagge_Space",
  "/wiki/Starship",
  "/wiki/Acquisitor",
  "/wiki/Ronen_Tagge",
  "/wiki/Adelaide_Tagge",
  "/wiki/Ulric_Tagge",
  "/wiki/Orman_Tagge",
  "/wiki/Silas_Tagge",
  "/wiki/Rings_of_Vaale",
  "/wiki/Archaeologist",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Ronen_Tagge%27s_Private_Penthouse",
  "/wiki/Death",
  "/wiki/Bounty",
  "/wiki/Sniper",
  "/wiki/Just_Lucky",
  "/wiki/Bounty_hunter",
  "/wiki/Kharrek",
  "/wiki/De%27Rruyet_Industries",
  "/wiki/Beol_De%27Rruyet",
  "/wiki/Nihil",
  "/wiki/Path_engine",
  "/wiki/Lightspeed",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Ubese",
  "/wiki/Boushh",
  "/wiki/Tagge_protoblade",
  "/wiki/Boushh%27s_crew",
  "/wiki/Imperial_Era",
  "/wiki/Flagship",
  "/wiki/The_galaxy",
  "/wiki/File:Shunk.jpg",
  "/wiki/Exile_(punishment)",
  "/wiki/Executive_Board",
  "/wiki/Skirmish_aboard_the_Acquisitor",
  "/wiki/Mercenary",
  "/wiki/Honor_Guard_(Domina_Tagge)",
  "/wiki/File:Domina_Tagge_protoblade_attacc.jpg",
  "/wiki/Lapin",
  "/wiki/File:Domina_Tagge_protoblade_on.jpg",
  "/wiki/File:TaggeCo-GOI.jpg",
  "/wiki/Doctor_Aphra_(2020)_1",
  "/wiki/2020",
  "/wiki/Star_Wars:_Doctor_Aphra_(2020)",
  "/wiki/Doctor_Aphra_(2020)_5",
  "/wiki/Star_Wars_Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/General/Legends",
  "/wiki/Cassio_Tagge/Legends",
  "/wiki/Star_Wars_(1977)_35",
  "/wiki/1977",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/1980",
  "/wiki/Category:Images_of_Domina_Tagge",
  "/wiki/Doctor_Aphra_(2020)_3",
  "/wiki/Doctor_Aphra_(2020)_6",
  "/wiki/Doctor_Aphra_(2020)_7",
  "/wiki/Doctor_Aphra_(2020)_8",
  "/wiki/Doctor_Aphra_(2020)_9",
  "/wiki/Doctor_Aphra_(2020)_10",
  "/wiki/Doctor_Aphra_(2020)_11",
  "/wiki/Doctor_Aphra_(2020)_12",
  "/wiki/Doctor_Aphra_(2020)_13",
  "/wiki/Doctor_Aphra_(2020)_14",
  "/wiki/Doctor_Aphra_(2020)_15",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_Boushh_1",
  "/wiki/Doctor_Aphra_(2020)_16",
  "/wiki/Doctor_Aphra_(2020)_17",
  "/wiki/Doctor_Aphra_(2020)_18",
  "/wiki/Doctor_Aphra_(2020)_19",
  "/wiki/Doctor_Aphra_(2020)_20",
  "/wiki/Doctor_Aphra_(2020)_21",
  "/wiki/Doctor_Aphra_(2020)_22",
  "/wiki/Doctor_Aphra_(2020)_23",
  "/wiki/Doctor_Aphra_(2020)_24",
  "/wiki/Doctor_Aphra_(2020)_25",
  "/wiki/Doctor_Aphra_(2020)_26",
  "/wiki/Doctor_Aphra_(2020)_28",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars:_War_of_the_Bounty_Hunters",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}