{
 "name": "Domthro Rus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Undervine"
     ]
    }
   ]
  }
 ],
 "content": "Domthro Rus was a male journalist for the Undervine during the Galactic Civil War.\nHe and his partner Dixnet Dat met with the Trandoshan slaver Noka where they learned the story of Krrsantan. He decided that he had to meet the Wookiee and report on his life.\nRus traveled with his partner to a world where they met Chelli Lona Aphra, who was posing as Sulan Do, an agent for Krrsantan. When seeing 0-0-0, Dat commented that they should get a protocol droid. Rus assured her that he spoke fluent Shyriiwook. The couple flirted as they walked to their interview with the bounty hunter. Once seated, he introduced himself and explained that he wanted to get his true story out into the galaxy. The Wookiee proceeded to tell his life story, and Dat asked if he regretted his decision to train with the Xonti Brothers and that was why he was looking for revenge. Krrsantan explained his reason for his search for the Xonti Brothers, and Rus and his partner returned to their ship. After they had departed the planet, Rus explained to her that Krrsantan wasn't seeking revenge, but trying to fulfill a life debt to the Xonti Brothers for changing his life so dramatically. As they flew away, Dat noticed their posting privileges for the Undervine had been revoked because of an advertisement that Aphra had posted using their account.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Undervine",
  "/wiki/Journalist",
  "/wiki/Galactic_Civil_War",
  "/wiki/Dixnet_Dat",
  "/wiki/Trandoshan",
  "/wiki/Slaver",
  "/wiki/Noka",
  "/wiki/Krrsantan",
  "/wiki/Wookiee",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/0-0-0",
  "/wiki/Protocol_droid",
  "/wiki/Shyriiwook",
  "/wiki/Bounty_hunter",
  "/wiki/The_galaxy",
  "/wiki/Xonti_Brothers",
  "/wiki/Unidentified_Xonti_brother_1",
  "/wiki/Unidentified_Xonti_brother_2",
  "/wiki/Starship",
  "/wiki/Planet",
  "/wiki/Life_debt",
  "/wiki/Doctor_Aphra_Annual_1"
 ]
}