{
 "name": "Don",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Order of Revan",
      "Corellian Run Scoundrels"
     ]
    }
   ]
  }
 ],
 "content": "Don, known as the Exiled Knight, was a Zabrak male Jedi Knight who lived in exile in a makeshift camp with a bonfire in the canyons of Ossus during the Invasion of Ossus.\nIn times of war on the Jedi-world Ilum, the Jedi Knight Don committed an action he had to explain himself for in front of the Jedi Council. According to his own words, the Jedi Council remained unswayed.\nSubsequently, Don was either exiled because of his actions on Ilum or he chose exile voluntarily, consequently having roamed the harsh galaxy alone. He eventually found sympathetic minds in the Order of Revan on Rishi, a planet Don considered a paradise by any standard.\nAfter the Battle of Rishi and the downfall off the Order of Revan, Don found himself stranded with his only path forward being among Rishi's scofflaw denizens. The Exiled Knight then joined the Corellian Run Scoundrels.\nAt some point in history, Don spent his time frozen in carbonite and was released years later.\nHe realized that he was left adrift in a galaxy he no longer understood and felt as if there was no place he would belong to. Don picked up on rumours that the Jedi were in hiding and contemplated whether to return to the Jedi Order and rebuild among them.\nHaving believed his actions were long forgotten, Don found the hidden ruins of an ancient order but was rejected once more. Don eventually continued to wander around aimlessly and settled down in the canyons of Ossus.\nDon the Exiled Knight wrote down his story and thoughts in seventeen or more journals. The first, fourth, twelfth and seventeenth book were scattered and found at different locations on Ossus.\nDuring his ventures across the galaxy, Don became a myth-enshrouded HoloNet sensation and achieved a literary fanbase throughout the galaxy seemingly overnight. This kickstarted an unprecedented search by journalists and investigators who hoped to find and learn the truth about his story from Don first-hand.\nDon was a corpulent Jedi Knight attired in dark-brown and light-brown robes. His head featured the prominent horns of the Zabrak-species. Don was equipped with a lightsaber projecting a red beam.\nDon the Exiled Knight appeared in the 2018 patch 5.10 \"Jedi Under Siege\" on Ossus.\nHe is featured in a secondary quest in which the player needs to discover his four journals in order to locate and eliminate the exiled Jedi. Upon being accomplished, the player receives Don the Exiled Knight as a Stronghold-decoration.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Order_of_Revan",
  "/wiki/Corellian_Run_Scoundrels",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Ossus/Legends",
  "/wiki/Invasion_of_Ossus",
  "/wiki/Battle_of_Ilum",
  "/wiki/Jedi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ilum/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Rishi/Legends",
  "/wiki/Battle_of_Rishi",
  "/wiki/HoloNet/Legends",
  "/wiki/Journalist/Legends",
  "/wiki/Species/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/2018",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne"
 ]
}