{
 "name": "Donko Jen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Northern Mustafarian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purplish-gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mensix Mining Company"
     ]
    }
   ]
  }
 ],
 "content": "Foreman Donko Jen was a male Mustafarian who was present at the Mensix Mining Facility on Mustafar during the Galactic Civil War in 1 ABY. He was one of the foremen of the facility, along with Chivos, and was a member of the taller, thinner subspecies of the Mustafarians.\nIn 1 ABY, Donko Jen was under employ by the Mensix Mining Company as foreman of the Mensix Mining Facility on Mustafar. During his tenure in this year, he hired a traveling spacer to destroy some kubaza beetle nests that had sprung up at a mining camp in an area of the planet known as The Burning Plains. He provided the spacer with a few explosive charges to hasten the job.\nThe spacer arrived at the camp to find it absolutely infested with the resilient beetle. He set to work immediately, planting the charges and blowing the nests sky high. This raised the ire of the beetles and they immediately attacked, but the spacer expertly killed every last one of them, ending the camps infestation once and for all. Returning to Donko, he was rewarded with 10,000 credits and a mounted kubaza beetle head as a trophy.\nDonko Jen was a non-playable character in the massively-multiplayer online roleplaying game Star Wars Galaxies prior to its closure on December 15, 2011. He, along with the planet Mustafar, were added to the game in November of 2005 in the expansion pack Star Wars Galaxies: Trials of Obi-Wan.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mustafar/Legends",
  "/wiki/Mustafarian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mensix_Mining_Company",
  "/wiki/Foreman/Legends",
  "/wiki/Mensix_Mining_Facility",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Chivos",
  "/wiki/Subspecies/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Kubaza_beetle/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Trials_of_Obi-Wan",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide"
 ]
}