{
 "name": "Dono_(Squib)",
 "display_name": "Dono  (Squib)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Squib"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Squib Reclamation Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Dono was a Squib who lived aboard the Imperial Armored Transport Elusive. In the eyes of the Squib Reclamation Fleet, Dono was a secret agent who transmitted the Elusive's coordinates to the fleet so they could follow behind the Imperial ship and snatch up the garbage it dumped before it jumped to hyperspace. To the Elusive's crew, however, the Squib was a mere slave. Sometime between 0 and 2 ABY, Dono transmitted the transport's jump coordinates to the Squib fleet after a battle with Rebel Alliance forces in the Dankayo system.\nAlthough the crew of the Imperial Armored Transport Elusive considered the Squib Dono to be a slave, the Squib Reclamation Fleet viewed Dono as a spy. Dono lived and worked aboard the Elusive, which afforded the Squib the opportunity to transmit the vessel's coordinates to the Thrifty, the Squib Momship and flagship of the fleet. This allowed the galactic scavengers to collect the Imperial ship's garbage, which it jettisoned prior to each hyperspace jump per Imperial procedure. Dono kept these transmissions secret by sending them via a pirate-band signal and by using a language known as Old High Squibbian.\nAt some point between 0 and 2 ABY, Dono was aboard the Elusive in the Dankayo system, where the ship's Imperial crew was attacked by a Lambda-class shuttle operated by a group of Rebel Alliance operatives. As the Elusive dumped its refuse into space and jumped to lightspeed, Dono dutifully transmitted the coordinates for its next destination to the Squib fleet so that they could reclaim its garbage there.\nLike the other members of the Squib fleet, Dono considered the post aboard the Elusive to be an undercover assignment. The Squib dutifully transmitted the armored transport's coordinates to allow the Squib Reclamation Fleet to shadow it and reclaim its rubbish dumps. Dono spoke at least two languages: Old High Squibbian and Basic, although the secret agent's command of the latter language was inflected as it was for other members of the Squib species.\nDono is mentioned in the roleplaying adventure Scavenger Hunt, written by Brad Freeman and published by West End Games in 1989 as part of Star Wars: The Roleplaying Game. Although Dono does not appear directly in the story, the Squib secret agent is mentioned in conjunction with the message the Squib sends to the spy's compatriots on the Thrifty. The adventure fails to identify Dono's gender and fails to note whether Dono is the Squib's given name or is a code name used solely for such communiques.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Dono",
  "/wiki/Squib/Legends",
  "/wiki/Squib_Reclamation_Fleet",
  "/wiki/Imperial_Armored_Transport",
  "/wiki/Elusive_(transport)",
  "/wiki/Eye/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Battle_of_Dankayo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Dankayo_system",
  "/wiki/Thrifty",
  "/wiki/Momship",
  "/wiki/Flagship/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Scavenger/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Language/Legends",
  "/wiki/Old_High_Squibbian",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Operative",
  "/wiki/Realspace/Legends",
  "/wiki/Lightspeed/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Species/Legends",
  "/wiki/Roleplaying_game",
  "/wiki/Scavenger_Hunt",
  "/wiki/Brad_Freeman",
  "/wiki/West_End_Games",
  "/wiki/1989",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Gender/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Carlist_Rieekan/Legends",
  "/wiki/Echo_Base/Legends"
 ]
}