{
 "name": "Doodnik Sharpelz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ojom"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jillsarian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Doodnik's Café"
     ]
    }
   ]
  }
 ],
 "content": "Doodnik Sharpelz was a male Jillsarian who worked as a bartender and chef on the planet Tyne's Horky. Originally from the planet Ojom, he left his homeworld before 19 BBY and found bartending work on Tyne's Horky alongside his old friend Dexter Jettster. By 15 BBY, he had opened Doodnik's Café in the world's eponymous mining town, where he worked in the kitchen and entertained such customers as the local crime lord Kleb Zellock. In that year, Sharpelz hired the droids C-3PO and R2-D2 to work for him as waiters, but the incompetence of the duo prompted a furious Sharpelz to fire them both on their first day.\nDoodnik Sharpelz was a male Jillsarian who was raised by adoptive natives on the planet Ojom. He was friends with the Besalisk Dexter Jettster, and, before the year 19 BBY, the two of them left their homeworld and found employment as bartenders on Tyne's Horky, a mining world located on the galactic frontier. Working together, Sharpelz and Jettster prepared such drinks as photon fizzles, giva jumbos, and circuit cider.\nBy 15 BBY, Sharpelz had made a deal with the Dirconite mercenary Kleb Zellock and become part-owner of a restaurant and tapcafe in a lawless mining town also called Tyne's Horky. Although the Jillsarian was the proprietor of Doodnik's Café, Zellock, as the leader of the planet's criminal underworld, used the establishment as his base of operations. Sharpelz worked as a chef in the kitchen, and in 15 BBY, he hired two waiters through the Intergalactic Droid Agency: the protocol droid C-3PO and the astromech droid R2-D2.\nWhen the droids arrived at the eatery one morning, Sharpelz immediately put them to work. He grew frustrated when the two had trouble remembering orders, repeatedly tripped over each other, and proved to be the worst waiters that the locals had ever seen. Late in the day, C-3PO spilled some powder on Sharpelz's face, and the chef angrily sent him to serve Zellock. When the crime lord's henchman Yorpo Mog tripped over R2-D2 and landed in Zellock's food, Mog threw the astromech across the café. R2-D2 crashed into both C-3PO and Sharpelz, and the chef responded by immediately firing his new waiters, tossing them out into the street, and telling them never to return.\nDoodnik Sharpelz was a gruff and greasy chef with orange skin, black pupils, and four brawny arms. He employed all of his upper limbs while preparing food, during which he was able to perform four different tasks simultaneously. Hardened by fringe life, Sharpelz was intolerant of incompetence in his kitchen and was quick to anger. He threatened to melt C-3PO shortly before furiously firing both the protocol droid and his astromech companion. Sharpelz took care to provide good service to Kleb Zellock, who owned a stake in the café, but he did not take care to keep the establishment clean.\nSharpelz came to Tyne's Horky full of gastronomic dreams. A skilled bartender, he mixed a photon fizzle that Dexter Jettster believed was unrivaled. Circuit cider was another of his signature drinks. Sharpelz always served giva jumbos in bowls, although Jettster could not figure out why. All in all, Jettster thought his comrade a fine fellow.\nThe character of Doodnik first appeared in \"The Lost Prince,\" the fifth episode of the Star Wars: Droids animated television series. Written by Peter Sauder and directed by Raymond Jafelice, the episode first aired on October 5, 1985.\nAuthor Tim Veekhoven has surmised that Doodnik and his café influenced the designs of Dexter Jettster and his diner, which were seen in the 2002 film Star Wars: Episode II Attack of the Clones. The short story \"Dining at Dex's,\" written by Gregory Walker and published online through StarWars.com's Hyperspace feature in 2009, describes Doodnik as an old friend of Jettster. Walker tied the two characters together due to what he believed were obvious similarities between them, and he originally considered making them brothers, thereby establishing Doodnik's species as Besalisk. He ultimately left their relationship vague and did not reveal Doodnik's species, although he did name the character's home planet as the Besalisk homeworld of Ojom. Despite striking visual differences between Doodnik and the Besalisks, Walker yet believed that Doodnik could plausibly have been a member of that species.\nDoodnik was finally established as being a member of the Jillsarian species in the 2013 article The Droids Re-Animated, written by Abel G. Peña and Rich Handley for the StarWars.com blog. The article also provided the character with a last name: Sharpelz. Peña and Handley had wanted to make the Jillsarian retcon for years, but with the release of Dining at Dex's, Peña was concerned that it would be difficult to disassociate Doodnik from the heavy implication that he was a Besalisk. As the Besalisk connection had not been airtight, however, he ultimately went with what he has described as a \"near-flawless\" connection and a \"perfect\" retcon. Peña also praised Walker's work and asserted that he would have made Doodnik a Besalisk if he had not known about Jillsarians.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ojom/Legends",
  "/wiki/Jillsarian",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Orange",
  "/wiki/Doodnik%27s_Caf%C3%A9",
  "/wiki/Bartender/Legends",
  "/wiki/Chef/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tyne%27s_Horky",
  "/wiki/Homeworld/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Dexter_Jettster/Legends",
  "/wiki/15_BBY/Legends",
  "/wiki/Tyne%27s_Horky_(town)",
  "/wiki/Crime_lord/Legends",
  "/wiki/Kleb_Zellock",
  "/wiki/Standard_year/Legends",
  "/wiki/Droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Waiter/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Besalisk/Legends",
  "/wiki/Mining/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Photon_fizzle",
  "/wiki/Giva_jumbo",
  "/wiki/Circuit_cider",
  "/wiki/Dirconite",
  "/wiki/Mercenary/Legends",
  "/wiki/Restaurant/Legends",
  "/wiki/Tapcafe/Legends",
  "/wiki/City/Legends",
  "/wiki/Kleb_Zellock%27s_criminal_empire",
  "/wiki/Intergalactic_Droid_Agency",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/Yorpo_Mog",
  "/wiki/R2-series_astromech_droid",
  "/wiki/Eye/Legends",
  "/wiki/Limb/Legends",
  "/wiki/3PO-series_protocol_droid/Legends",
  "/wiki/Cider/Legends",
  "/wiki/The_Lost_Prince",
  "/wiki/Star_Wars:_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/Peter_Sauder",
  "/wiki/Raymond_Jafelice",
  "/wiki/October_5",
  "/wiki/1985",
  "/wiki/Tim_Veekhoven",
  "/wiki/Dex%27s_Diner/Legends",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Dining_at_Dex%27s",
  "/wiki/Gregory_Walker",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/2009",
  "/wiki/2013",
  "/wiki/The_Droids_Re-Animated",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Rich_Handley",
  "/wiki/Retcon",
  "/wiki/The_Lost_Prince:_A_Droid_Adventure",
  "/wiki/Category:Images_of_Doodnik",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/C-3PO:_Tales_of_the_Golden_Droid",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Last_of_the_Jedi:_Underworld",
  "/wiki/Polyhedron",
  "/wiki/Star_Wars_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/Polyhedron_170",
  "/wiki/Jedi_Council_Forums",
  "/wiki/December_30",
  "/wiki/January_27",
  "/wiki/2012",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Star_Wars_CELibration",
  "/wiki/Star_Wars_Insider_27",
  "/wiki/July_11",
  "/wiki/July_12",
  "/wiki/Star_Wars:_Blogs"
 ]
}