{
 "name": "Doom",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Doom's unit",
      "Doom's unit"
     ]
    }
   ]
  }
 ],
 "content": "\"Doom\" was the nickname of a Clone Commander who served Jedi Generals Tiplee and her sister Tiplar in the Battle of Ringo Vinda during the Clone Wars. Aided by Anakin Skywalker and the 501st Legion, Doom and his unit engaged droid forces led by Separatist Admiral Trench aboard the space station orbiting Ringo Vinda. During the battle, 501st clone trooper Tup was seized by a premature activation of Clone Protocol 66 caused by a malfunction in his clone inhibitor chip, and murdered Doom's Jedi General Tiplar. Droid reinforcements capitalized on the disarray caused by Tup's betrayal, forcing Doom and his men to retreat under fire and investigate their general's murder.\nBorn on the planet Kamino and bred from the genes of the human male bounty hunter Jango Fett, the clone trooper commander that would eventually receive the nickname of \"Doom\" was specifically cloned to fight and die for the Galactic Republic as a part of a massive clone army. The army was first pressed into service when Republic Jedi engaged the droid forces of the Confederacy of Independent Systems on the planet Geonosis, which sparked the start of the intergalactic Clone Wars. Doom was eventually placed under the command of the Jedi Generals Tiplar and her sister Tiplee, and the troopers placed under his command adopted a green color motif for their armor, along with a yellow triangle to represent their unit.\nDuring the war, Doom, Tiplar, and Tiplee participated in a large-scale campaign to capture a massive space station held by Admiral Trench above the planet Ringo Vinda, which was currently under the command of Trench and his droid forces. Doom's unit was joined by the 501st Legion, led by Jedi General Anakin Skywalker, for the battle, which at some point reached a stalemate. During the intense fighting that took place aboard the station, much of Doom's forces were exhausted, but after several more encounters with Trench's droids, the Republic troops captured a communications center. Skywalker began to pen the next stage of the battle and ordered Tiplar and Doom to take the remainder of their company down one of two passageways that led to Trench's command post. Doom noted that his men were few, which prompted Skywalker to assign ARC trooper CT-5555,\"Fives,\" and clone trooper CT-5385,\"Tup,\" along with ten other 501st troopers, to accompany Doom and Tiplar. Tiplee would follow Skywalker and the rest of his troopers down another passageway.\nThe Republic resumed their assault and began closing in on Trench's command center. Tiplar and Doom fought side-by-side as they advanced, and faced minimal casualties during their trip down the passageway. Eventually, they reached Trench's command center and regrouped with Skywalker and Tiplee. However, as the fighting commenced, Tup, having entered a trance-like state, unexpectedly shot Tiplar in the back of the head. Doom witnessed the murder but was forced to continue fighting with the arrival of destroyer droids. Meanwhile, Tup was apprehended by Fives while Tiplar's body was retrieved by Tiplee. The entire attack lost its momentum in the wake of Tiplar's death and Skywalker ordered a retreat. The defeated Republic forces regrouped in the command center they had previously captured, and Doom and his men gathered around Tiplar's body to mourn her death. Tup had killed Tiplar due to a Sith-implanted behavioral modification biochip in his head, a device which was actually installed into every clone trooper's head. Tup's chip had malfunctioned, prematurely invoking Clone Protocol 66, which was a command that forced clone troopers to execute all Jedi for acts of treason.\nA skilled combatant, Doom was bred to be utterly loyal to the Galactic Republic and to obey orders unflinchingly. He knew the stakes that his job presented, and was wise enough to call for reinforcements when needed. He could also tell when the time to retreat was. Doom worked well with Master Tiplar, covering each other during the fighting. He, along with the other troopers of his company, mourned Tiplar's death, and expressed confusion at Tup's seemingly inexplicable murder.\nDoom, like all clones, was a genetic clone of bounty hunter Jango Fett, and stood at 1.83 meters.\nDoom utilized Phase II clone trooper armor, along with a kama around his waist and a visor, flashlight, and an antennae and his helmet. By the time of the Ringo Vinda battle, Doom's armor was heavily battle-scarred. His armor was predominantly green, including the upper parts of his leggings, his chest plate, and the majority of his helmet. His vambrace and greave plates, as well as his boots, were gray. His kama was green with yellow stripes, and both his helmet and chest plate bore the yellow triangle emblem that the rest of his company displayed on their armor. His left shoulder pad was also yellow in color.\nWhen it came to battlefield armament, Doom preferred using his two identical blaster pistols to cut down enemy forces. He used his handguns to great effect during the Ringo Vinda campaign.\nClone Commander Doom first appeared in previews for the sixth season of the TV series Star Wars: The Clone Wars. The episode he appeared in was The Unknown, which first aired on Netflix on February 15, 2014 for German audiences, and was later released in the United States and Canada on March 7, 2014. In the episode, Doom was not identified by name. He received his name in the episode's accompanying guide. Like all clone troopers in the series, Doom's voice was provided by Dee Bradley Baker. Doom's overall design is based on the Marvel Comics villain Doctor Doom.\nDuring the 2014 San Diego Comic Con, Hasbro Inc. unveiled a new Clone Commander Doom action figure to be released as a part of the Star Wars: The Black Series toy line. In the preview, Doom's accessories included the two pistols he was seen using in the TV show. The figure was later released during 2015.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Doom",
  "/wiki/Doom/Legends",
  "/wiki/Doom_(disambiguation)",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Doom%27s_unit",
  "/wiki/Clone_trooper",
  "/wiki/Clone_Commander",
  "/wiki/Jedi",
  "/wiki/Jedi_General",
  "/wiki/Tiplee",
  "/wiki/Tiplar",
  "/wiki/Battle_of_Ringo_Vinda",
  "/wiki/Clone_Wars",
  "/wiki/Anakin_Skywalker",
  "/wiki/501st_Legion",
  "/wiki/Admiral",
  "/wiki/Trench",
  "/wiki/CT-5385",
  "/wiki/Order_66",
  "/wiki/Planet",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Death",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Geonosis",
  "/wiki/The_galaxy",
  "/wiki/Color",
  "/wiki/Armor",
  "/wiki/File:Tiplar_and_Doom_marines.png",
  "/wiki/Space_station",
  "/wiki/Ringo_Vinda",
  "/wiki/Droid",
  "/wiki/Ringo_Vinda_space_station",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/CT-5555",
  "/wiki/Droideka",
  "/wiki/Sith",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Treason",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/File:CommanderDoom-TCW.png",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/DC-17_hand_blaster",
  "/wiki/Blaster_pistol",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Unknown",
  "/wiki/Netflix,_Inc.",
  "/wiki/February_15",
  "/wiki/2014",
  "/wiki/March_7",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Marvel_Comics",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/2015",
  "/wiki/Category:Images_of_Doom",
  "/wiki/Conspiracy",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/April_19",
  "/wiki/2019"
 ]
}