{
 "name": "Doom_of_Ulmarah",
 "display_name": "Doom of Ulmarah",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Taung"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "The Doom of Ulmarah was a Taung general who fought and died during the war against the Battalions of Zhell on the planet Notron. His life and death were recorded within the poem Dha Werda Verda, and he was remembered long after his demise.\nThe Taung male known as the Doom of Ulmarah served as a general amongst the warriors of his species during their war against the Battalions of Zhell on the planet Notron. He was killed during the war, and his body was burned on a funeral pyre as groups of Taung warriors mourned. This left the Taung unprotected, but under the leadership of another general known as Rexutu the Unconquerable, they managed to defeat the Zhell the day after the funeral due to a volcanic eruption destroying the Zhell city of Great Zhell. The Doom of Ulmarah's actions and untimely demise, along with the stories of others like Rexutu and Olhak the Reaver, were immortalized in the Taung epic poem Dha Werda Verda, with the general's funeral recorded in the ninth chapter within the section known as \"The Maker comes to Unmake.\"\nThousands of years after the general's death, his part in the Zhell-Taung War was still remembered, with the Dha Werda Verda verses including his funeral taught to every schoolchild on Notron, by then known as Coruscant or Imperial Center. The military historian Hu Jibwe considered the Doom of Ulmarah noble and mighty, mourning what he considered the warrior's inevitable downfall and mentioning him in an article in the publication Imperial Center Today in 2 ABY.\nThe Doom of Ulmarah was first mentioned in The Essential Guide to Warfare, a reference book released in 2012 and written by Jason Fry. A section of the book that included the general but had ultimately been cut was then published in 2013 in Star Wars: The Essential Guide to Warfare Author's Cut on the Star Wars Blog.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Taung/Legends",
  "/wiki/Gender/Legends",
  "/wiki/General/Legends",
  "/wiki/Death/Legends",
  "/wiki/Zhell%E2%80%93Taung_war",
  "/wiki/Battalions_of_Zhell",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Poet/Legends",
  "/wiki/Dha_Werda_Verda",
  "/wiki/Species/Legends",
  "/wiki/Cremation/Legends",
  "/wiki/Funeral/Legends",
  "/wiki/Fire/Legends",
  "/wiki/Rexutu_the_Unconquerable",
  "/wiki/Battle_of_Great_Zhell",
  "/wiki/Zhell/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Volcano/Legends",
  "/wiki/City/Legends",
  "/wiki/Great_Zhell",
  "/wiki/Olhak_the_Reaver",
  "/wiki/Standard_year/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Historian/Legends",
  "/wiki/Hu_Jibwe",
  "/wiki/Imperial_Center_Today",
  "/wiki/2_ABY/Legends",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/2012",
  "/wiki/Jason_Fry",
  "/wiki/2013",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut",
  "/wiki/Star_Wars_Blog",
  "/wiki/StarWars.com"
 ]
}