{
 "name": "Doorn",
 "display_name": "Doorn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Coruscant Security Force",
      "Coruscant Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Doorn was a Human male living on the planet Coruscant. He worked as a police officer for the Coruscant Security Force and was able to achieve the rank of lieutenant before the Great Galactic War between the Galactic Republic and Sith Empire. During the Cold War period that followed the war, Doorn was posted to the Black Sun territory. The assignment was difficult, with constant street warfare against the Black Sun crime syndicate. Like many veteran cops, Doorn became extremely cynical, frustrated, and burned out. At one point he was assigned the task of securing plans for Coruscant's secret tunnels. Working with Agent Fieler Dan of the Republic Strategic Information Service, Doorn tracked the plans to Coruscant's Justicar territory. When Dan failed to contact Doorn, he sent a Republic individual after her who was able to locate the plans.\nDoorn, a Human male, served on the planet Coruscant as a police officer with the Coruscant Security Force. He had attained the rank of lieutenant before the outbreak of war between the Galactic Republic and Sith Empire. During the subsequent Cold War, he was posted to the Black Sun territory which, due to the constant street warfare with the Black Sun crime syndicate, was a hard assignment.\nAround 3643 BBY, plans of secret tunnels underneath Coruscant were stolen by the vigilante Justicars' Brigade militia. Doorn was assigned the task of recovering the plans and sent a female agent of the Republic Strategic Information Service, Fieler Dan, to discover the location of the plans. However, Doorn lost communications with the SIS agent and requested the help of a Republic individual in locating her. The individual was able to infiltrate the Justicars' Sector and find the missing agent. Dan informed the individual where the plans were kept, but requested a copy of the plans so that she could give them to her daughter to help bring in food and supplies to the refugees. The individual was able to retrieve the plans and returned to Dan intending to give the schematics to Doorn. However, Dan pleaded with the individual to let her make a copy of the plans. The individual consented and then returned the plans to Doorn without telling him that copies had been made.\nDoorn was a Human male with light skin, black hair, and dark blue eyes. Though he had once been proud of both his job and his rank, he no longer felt so by the time of the Cold War. As with his fellow veteran cops, Doorn felt burned out and frustrated. The constant street warfare had taken its toll on living conditions, and cops suffered as much as civilians. To Doorn, police work no longer served to keep the peace, but was instead a difficult job with barely enough pay.\nDoorn appears as part of the \"Secret Passages\" Republic-sided mission in Star Wars: The Old Republic, a massively multiplayer online roleplaying game by BioWare released on December 20, 2011. The Republic character undertakes a mission for Doorn to secure plans of secret tunnels on Coruscant. The player can choose to not to let Dan make a copy as a dark side choice.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Planet/Legends",
  "/wiki/Police_officer/Legends",
  "/wiki/Police_rank",
  "/wiki/Lieutenant/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Black_Sun_territory",
  "/wiki/Black_Sun/Legends",
  "/wiki/Coruscant_secret_underground_tunnels",
  "/wiki/Agent/Legends",
  "/wiki/Fieler_Dan",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Justicar_territory",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3643_BBY",
  "/wiki/Justicars%27_Brigade",
  "/wiki/Fieler_Dan%27s_daughter",
  "/wiki/Time/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}