{
 "name": "Dor_Reder",
 "display_name": "Dor Reder",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pirralor"
     ]
    },
    {
     "name": "Born",
     "values": [
      "35 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Dor Reder was a Human male Imperial Navy officer from the planet Pirralor. A junior officer aboard the Star Destroyer Pulsar during the Battle of Endor, Reder was captured by the Alliance to Restore the Republic but managed to escape by stealing an Alliance transport. Reder joined the warlord forces of Admiral Gaen Drommel, gaining command of the Star Destroyer Krieger. Information about Alliance bases and safe worlds gleaned from the stolen transport's computer was used to devastating effect when Drommel and Reder launched a campaign against them which was responsible for thousands of deaths.\nDor Reder was born in 35 BBY and hailed from the planet Pirralor. Reder joined the Imperial Navy and was a junior officer holding the rank of commander, who served aboard the Star Destroyer Pulsar while it was stationed in the Endor system during the construction of the second Death Star. During the Battle of Endor, the Pulsar surrendered to Alliance to Restore the Republic forces. Reder avoided capture, and led a group of Imperial crewmen, including Niclara Varnillian, who stole an Alliance transport and escaped. Reder joined Admiral Gaen Drommel's forces, where he was raised to the rank of Captain and given command of the Star Destroyer Krieger. Around 5 ABY, Reder and Admiral Drommel used information in the stolen transport's computers to discover the location of several Alliance safe worlds and bases. A quick and effective campaign resulted in the deaths of thousands of individuals. By 7 ABY, the New Republic Intelligence Service recorded the Krieger's last known location as the Hanod system. Charged with treason, sedition, murder of New Republic personnel, and destruction of New Republic property, the New Republic offered a reward of 45,000 credits for his capture.\nDor Reder was a Human male who was 1.8 meters tall. He was a competent commander and naval tactician, with a speciality in maneuvering capital ships.\nReder was trained to use a blaster, and he was skilled in stealth techniques. He was knowledgeable about alien species, and was familiar with bureaucratic procedure. Reder was able to pilot capital ships, and was able to operate sensors, program and repair computers, and bypass security systems.\nCaptain Reder wore an Imperial officer's uniform, was armed with a blaster, and carried a comlink and datapad.\nDor Reder was profiled in Wanted by Cracken, a sourcebook published in 1993 for use with West End Games' Star Wars: The Roleplaying Game. Mike Jackson provided the illustration of Reder for the book.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Pirralor",
  "/wiki/35_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Junior_officer",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Pulsar_(Star_Destroyer)",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gaen_Drommel",
  "/wiki/Krieger",
  "/wiki/Safe_world/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Death/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Endor_system/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Niclara_Varnillian",
  "/wiki/Military_rank/Legends",
  "/wiki/Captain/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Hanod_system",
  "/wiki/Treason/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Capital_ship/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Imperial_officer%27s_uniform/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/1993",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Mike_Jackson",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_8"
 ]
}