{
 "name": "Dorai",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Captain Dorai was a male Duros starship pilot who worked for the Galactic Empire. He transported passengers in the Kuat system, and liked to talk about current events while in clubs and restaurants. While he was a good source for what was happening in the system, including the Kuat Drive Yards stardocks, Dorai did not sell the information, and was especially concerned about the Rebel Alliance.\nDorai was a Duros starship captain and pilot. He worked for the Galactic Empire, transporting passengers on secure shuttles in the Kuat system. He was not allowed to have living quarters in the Kuat system itself, since he was an alien, so he lived in a staff apartment on Kuat Central Plaza of the Kuat Passenger Port transit station, just outside the system. When he wasn't working, Dorai spent time in the clubs and restaurants talking about current events with other spacers, but was particularly worried about news of the Rebel Alliance.\nDorai worked long shifts, but he had long periods of downtime as well. Although Dorai enjoyed spending time with other Duros, he mingled with the various species on the Kuat Passenger Port. In his work piloting a secure transport in the Kuat system, Dorai was adept at navigating and operating space transports, was knowledgeable about government bureaucracy, law enforcement, and traffic in the system, as well as what was happening at the stardocks of Kuat Drive Yards. He never sold this information, however, as he preferred to trade it for news of the greater galaxy outside of Kuat.\nDorai wore a flight suit and helmet, and carried a comlink.\nDorai was created as one of the characters to be used on Kuat Passenger Port for the Star Wars: The Roleplaying Game expansion Platt's Starport Guide, which was written by Peter M. Schweighofer and published by West End Games in February 1995. Dorai's name was also listed in the Ultimate Alien Anthology as a common Duros name.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Kuat_system/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Kuat_Drive_Yards/Legends",
  "/wiki/Shipyard/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Kuat_Central_Plaza",
  "/wiki/Kuat_Passenger_Port",
  "/wiki/Space_station/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Species/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Kuat/Legends",
  "/wiki/Flight_suit/Legends",
  "/wiki/Flight_helmet/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Platt%27s_Starport_Guide",
  "/wiki/Peter_M._Schweighofer",
  "/wiki/West_End_Games",
  "/wiki/February",
  "/wiki/1995",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}