{
 "name": "Dorian_Janarus",
 "display_name": "Dorian Janarus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "the Founder",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicGalactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Dorian Janarus was a Human male who was elected as Supreme Chancellor of the Republic in order to replace Paran Am-Ris. General Elin Garza of the Republic Special Forces Division, Governor Leontyne Saresh of Taris, and the Mantellian Separatist Movement were among his political rivals.\nWhen the Galactic Republic was at war, Janarus had long served as a loyal leader to his people and the Republic as senator of Coruscant. However, the Sith Empire brutally ended the war with a surprise invasion that would later be known as the Sacking of Coruscant, with the Sith Lord Darth Angral killing the Supreme Chancellor Berooken during the commotion. When the Galactic Senate met sometime after the signing of the Treaty of Coruscant, Janarus was unanimously elected to take up the office of Supreme Chancellor Paran Am-Ris, who had been serving as Chancellor in the interim.\nIn the years since his inauguration, the unified support of his peers had steadily diminished as many system governments continued to chafe at the costs of rebuilding, and his military advisers grew increasingly frustrated with his refusal to take sterner action to stamp out sedition, but Janarus's stance had always been that the Republic's core values of freedom, justice, and the right to self-governance were much more important to protect when standing in the face of the brutally tyrannical Sith Empire. During his tenure, Janarus established the Republic Privateer Service Corps.\nDuring this period, Janarus also looked to the Jedi Council for help, such as when a series of vital and powerful worlds threatened to permanently sever all ties and relationships with the Republic known as the Rift Alliance emerged, Janarus called upon the Council to seek a likely candidate who was a skilled diplomat and would make an excellent representative and ambassador for convincing the Rift Alliance to stay with the Republic. The first name to be mentioned was that of a powerful and notable Jedi Consular, who had recently became the third Barsen'thor in galactic history. The Barsen'thor successfully convinced the Rift Alliance to join the Republic, but only after coming to their aid against from the Empire, particularly the Children of the Emperor, mysterious assassins and shadow hands of the Sith Emperor himself that were infused with the Emperor's thoughts and strength.\n\nAfter Janarus met with Jedi Master Jun Seros, he publicly condemned the actions of the bounty hunter for allegedly causing the deaths of a Jedi and Republic delegation on Nar Shaddaa, among a kilometer-long list of other charges falsified by Seros. A large bounty was placed on the Hunter's head, forcing the Hunter to go underground and the Empire to sever its ties with them.\nThe Hunter was summoned by Darth Tormen, who offered revenge against both Janarus and Seros. But as the two were on Coruscant, far beyond the Hunter's reach, Tormen devised a way to draw them out. By having the Hunter ensure Corellia's secession from the Republic into the Empire, Janarus would be forced to ratify the treaty and withdraw Republic forces. Seros managed to convince him that he could rally Corellia's Green Jedi to liberate the planet from Imperial rule. The Hunter killed Seros and took his effects, providing access to Janarus' flagship, the Founder. Confronted by the very bounty hunter he wronged, Janarus stated that he had already discovered the extent of Seros' actions and the significant resources the slain Jedi had expended to capture Kellian Jarro's murderer. He didn't condone the Hunter's actions, but understood that they were only doing their job. He explained that he had already disclosed Jun's actions to the public, effectively clearing the Hunter's name of the false crimes. The political fallout would be tremendous and regardless of what happened between them, Janarus would be removed from office. He even offered to grant immunity for the Hunter's true crimes in exchange for killing Tormen, whom he accused of being a mass murderer. The Hunter refused his offer and killed the Chancellor.\nAfter Janarus's death, an emergency session of the Senate was convened, and Janarus's political rival Governor Leontyne Saresh of Taris was elected as Chancellor.\nSupreme Chancellor Janarus was a dedicated servant of the Republic who stood up to uphold the Republic's ideals in a time of political upheaval. He demonstrated a great capacity for leadership after the Sacking of Coruscant by uniting the people and restoring stability. Nevertheless, he had a number of political rivals.\nJanarus is identified in an entry on The Old Republic website's Holonet databank which features Aurebesh phrases such as \"Key to Corellia\" and \"Dangerous Friends.\" He is voiced by Robert Clotworthy, who also voiced Senator Evran.\nJanarus is the focus of Chapter III of the Bounty Hunter storyline. For light-side points, the Bounty Hunter has the option of sparing his life and forcing him to \"face the music.\" Following the light-side path, the Hunter can agree to kill Darth Tormen in exchange for immunity. After the task is done, Janarus upholds his end of the bargain and states that even if his successor questions the justification, overturning the Hunter's exoneration will be more difficult. He then announces that he's retiring from politics, considering that arranging assassinations have caused him to fall far from his principles. The Hunter can optionally encourage Janarus to maintain his honor, wherever he goes.\nIf spared, Janarus later pulls favors with his old staff and the SIS to send a message to the Hunter, explaining the election of his successor, Leontyne Saresh. Though he wouldn't want the Hunter to get mixed up in the Second Great Galactic War, he requests that the Hunter stop the madness if they choose to get involved.\nAlternatively, the Hunter has the option of freezing Janarus and bringing him to Darth Tormen .",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Dorian_Janarus",
  "/wiki/Coruscant/Legends",
  "/wiki/3640_BBY",
  "/wiki/Founder_(Valor-class)",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Paran_Am-Ris",
  "/wiki/General/Legends",
  "/wiki/Elin_Garza",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Governor/Legends",
  "/wiki/Leontyne_Saresh",
  "/wiki/Taris/Legends",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Senator/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Great_Galactic_War",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Darth_Angral",
  "/wiki/Berooken",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Republic_Privateer_Service_Corps",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Rift_Alliance",
  "/wiki/The_Barsen%27thor",
  "/wiki/Barsen%27thor",
  "/wiki/Children_of_the_Emperor",
  "/wiki/Tenebrae",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jun_Seros_(Jedi)",
  "/wiki/Hunter_(individual)",
  "/wiki/Death/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Darth_Tormen",
  "/wiki/Corellian_Jedi",
  "/wiki/Kellian_Jarro",
  "/wiki/Aurebesh/Legends",
  "/wiki/Robert_Clotworthy",
  "/wiki/Evran",
  "/wiki/The_Old_Republic:_Fatal_Alliance",
  "/wiki/The_Old_Republic:_Fatal_Alliance_(audiobook)",
  "/wiki/The_Sixth_Line",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/The_Old_Republic:_Annihilation_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_137",
  "/wiki/StarWars.com",
  "/wiki/Sports_in_the_Star_Wars_Galaxy",
  "/wiki/Coruscant_sector",
  "/wiki/3653_BBY",
  "/wiki/Vanara_Kayl",
  "/wiki/3643_BBY",
  "/wiki/3632_BBY",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_2:_New_Galactic_Order",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_1:_Treaty_of_Coruscant",
  "/wiki/Standard_year/Legends",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound",
  "/wiki/Battle_of_Ilum",
  "/wiki/In-universe",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Video_game",
  "/wiki/2011",
  "/wiki/Lana_Beniko",
  "/wiki/3631_BBY"
 ]
}