{
 "name": "Dorotsech",
 "display_name": "Dorotsech",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Dromund Kaas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Dorotsech was a Human male scientist who worked for the Sith Empire during the Cold War around 3643 BBY. He developed a weapon called the cyber neutralizer that could kill or weaken beings whose bodies were composed of at least fifty percent cybernetics. Dorotsech was held captive by Lord Grathan in the latter's estate until Lord Zash's apprentice came to steal the scientist's creation. However, that was all for which the apprentice came, and Dorotsech was slain to eliminate any witnesses.\nDorotsech was a Human male working as a scientist for the Sith on the capital world of Dromund Kaas. By the time of the Cold War, which was fought between the Sith Empire and the Galactic Republic, he had a wife and children, and owned an astromech droid. Around the year 3643 BBY, Dorotsech was taken captive by a rogue Sith named Lord Grathan and held in his estate. There, Dorotsech was commissioned by Lord Zash to develop a weapon called the cyber neutralizer that could kill or weaken beings whose bodies were composed of at least fifty percent cybernetics, though Dorotsech preferred to remain ignorant of the reasons behind the creation of such a weapon. Zash intended to use the weapon to help defeat her rival, Darth Skotia, so she sent her apprentice to retrieve it and erase any traces that connected the theft of the weapon to them.\nDorotsech was eventually found by Zash's apprentice during the latter's infiltration of Grathan's estate, searching for Dorotsech's creation. The scientist revealed the weapon's location and in turn was killed, instead of being set free with the condition of remaining silent about who had stolen the weapon.\nA Human male with brown eyes and a mustache, Dorotsech was partially bald with brown hair on the sides and fair skin. He was a brilliant scientist who was capable of developing a highly effective weapon against droids all by himself. Although a skilled scientist, Dorotsech was not very brave, as he demonstrated to Lord Zash's apprentice during their encounter in which he continuously begged for his life. However, his pleading was ineffective in saving him from the apprentice's lack of compassion, and the scientist was killed right where he stood.\nDorotsech appears in the \"Dismantling the Machine\" mission for the Sith Inquisitor class in Star Wars: The Old Republic, a massively multiplayer online roleplaying game developed by BioWare and released on December 20, 2011. The player can also choose to warn the scientist to remain silent and let him live, thereby receiving light side points. If spared he will later send a message to the player about Skotia's death, will also send credits with the message.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Dromund_Kaas",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Scientist/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Cyber_neutralizer",
  "/wiki/Death/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Grathan",
  "/wiki/Lord_Grathan%27s_estate",
  "/wiki/Lord/Legends",
  "/wiki/Darth_Zash",
  "/wiki/Darth_Nox",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Mission_to_Lord_Grathan%27s_estate",
  "/wiki/Sith/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dorotsech%27s_wife",
  "/wiki/Dorotsech%27s_astromech_droid",
  "/wiki/Standard_year/Legends",
  "/wiki/Darth_Skotia",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/February_3",
  "/wiki/July_16",
  "/wiki/Daniel_Erickson",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/The_Essential_Atlas",
  "/wiki/3653_BBY"
 ]
}