{
 "name": "Dorosii",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Dorosii the Hutt served as the Appointed Intermediate of the Periphery region to the Galactic Senate during the waning years of the Republic. In 22 BBY, the Cult of M'dweshuu—a Nikto death-worshiping cult—launched a string of murders along the Sisar Run, a hyperlane in the Periphery. Dorosii tried to reassure the Republic that Hutt authorities would end the cult's brutality without Republic interference; however, the Jedi Council reportedly launched an investigation into the situation.\nAn Appointed Intermediate to the Senate of the Galactic Republic during the last years of the Republic regime, Dorosii the Hutt represented the Periphery, a region of space that bordered Hutt territory. In 22 BBY, during the Separatist Crisis, the Cult of M'dweshuu—a Nikto death-worshiping cult from the planet Kintan—launched a string of scattered murders along the Sisar Run hyperlane in the Periphery, and killed at least twenty-seven beings. Following the outbreak of occult violence, Dorosii attempted to convince Republic officials that intervention in the situation was unnecessary, as local Hutt authorities would deal with the M'dweshuu attacks. Despite Dorosii's reassurances, the Jedi Council reportedly began to investigate the murders and allegedly intended to send a task force into the Periphery. The Republic's HoloNet News later reported on both the M'dweshuu cult murders and Dorosii's exchanges with Republic officials.\nDorosii believed that it was not necessary for the Republic to get involved in ending the M'dweshuu murders. The Hutt's views were not shared by the Jedi Council, however, which reportedly responded with an investigation.\nDorosii the Hutt was first mentioned in the in-universe HoloNet News Vol. 531 45 article Nikto Cultists Plague Sisar Run, released on February 28, 2002. Dorosii later received a small entry in The Complete Star Wars Encyclopedia, released on December 9, 2008.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Hutt/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Appointed_Intermediate",
  "/wiki/Periphery/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Cult_of_M%27dweshuu",
  "/wiki/Nikto/Legends",
  "/wiki/Death/Legends",
  "/wiki/Cult_of_M%27dweshuu_Sisar_Run_murders",
  "/wiki/Sisar_Run/Legends",
  "/wiki/Hyperlane",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Hutt_Space/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kintan/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/In-universe",
  "/wiki/HoloNet_News_Vol._531_45",
  "/wiki/February_28",
  "/wiki/2002",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/December_9",
  "/wiki/2008",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_New_Essential_Chronology"
 ]
}