{
 "name": "Dorss",
 "display_name": "Dorss",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dorin government"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Dorss was a male Kel Dor customs officer stationed at the spaceport in Dor'shan, the capital city of the planet Dorin, in 43 ABY. When recently exiled Jedi Grand Master Luke Skywalker and his son, Jedi Knight Ben Skywalker, traveled to Dorin to speak with Master Koro Ziil of the Baran Do—an order of Force-users who lived on the planet—in hopes of finding out more about former Jedi Knight Jacen Solo's fall to the dark side of the Force and transformation into Darth Caedus, Dorss, along with Sergeant Vult, inspected the Jedi's starship, the Jade Shadow.\nDorss was a male Kel Dor who lived on the Expansion Region planet Dorin in the time after the Second Galactic Civil War. In 43 ABY, Dorss served the government of Dorin as a customs officer with the rank of lieutenant. During that year, the recently exiled Jedi Grand Master Luke Skywalker, together with his son, Jedi Knight Ben Skywalker, visited Dorin to speak with Koro Ziil, the Master of the Baran Do order of Force-users, to find out why former Jedi Knight Jacen Solo had fallen to the dark side of the Force and transformed into the Sith Lord Darth Caedus.\nAfter the Skywalkers landed their starship, the Jade Shadow, at the spaceport in Dorin's capital city, Dor'shan, Dorss—together with his partner, Sergeant Vult—greeted the Jedi and informed them that Vult would perform a short inspection of their ship. In the meantime, Dorss questioned Luke Skywalker on the purpose of the Jedi's visit, concluding that they came as \"tourists.\" After Vult had completed the inspection of the Shadow, he reported to Dorss that all items on the ship corresponded with the categorical limits. The Lieutenant then allowed the Skywalkers to visit the Baran Do.\nDorss served as a customs officer with his partner, Sergeant Vult; together, they inspected vessels that landed at the spaceport in Dor'shan. To do so, Dorss used a card reader for the identicards of the people he checked. During his talk with Luke Skywalker, Dorss behaved like he was completely unaware of the high profile of the Jedi Master.\nThe Kel Dor was rather thin and had eyes that were intelligent and Human-like in appearance. He wore a black robe with sky-blue and black patterns on it. Additionally, Dorss used a breath mask to protect him from carbon dioxide, nitrogen, and oxygen, which were fatal to a Kel Dor. Dorss was able to speak his native Kel Dor, as well as Galactic Basic Standard without any accent.\nDorss appeared in Fate of the Jedi: Outcast, a novel written by Aaron Allston and published in 2009.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Dorin/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Customs_official/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Dor%27shan",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Planet/Legends",
  "/wiki/43_ABY",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Master_of_the_Order_(Baran_Do)",
  "/wiki/Koro_Ziil",
  "/wiki/Baran_Do/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Vult",
  "/wiki/Starship/Legends",
  "/wiki/Jade_Shadow",
  "/wiki/Expansion_Region/Legends",
  "/wiki/Time/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Military_rank/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Skywalker_family/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Identicard/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Human/Legends",
  "/wiki/Color/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Antiox_breath_mask",
  "/wiki/Carbon_dioxide/Legends",
  "/wiki/Nitrogen/Legends",
  "/wiki/Oxygen/Legends",
  "/wiki/Language/Legends",
  "/wiki/Kel_Dor_(language)/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Aaron_Allston",
  "/wiki/2009",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}