{
 "name": "Dorsk 81",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Khomm"
     ]
    },
    {
     "name": "Died",
     "values": [
      "12 ABY",
      "Yavin 4"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Khommite"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.5 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order",
      "New Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Luke Skywalker"
     ]
    }
   ]
  }
 ],
 "content": "Dorsk 81 was a Jedi Knight of the New Jedi Order, and one of the 83 clones from the Dorsk lineage. He was also a member of the inaugural class of Luke Skywalker's Jedi Praxeum. Dorsk died in 12 ABY after giving himself completely to the Force in an effort to stop Admiral Daala from destroying the Jedi Praxeum.\nHe came from the planet of Khomm where, circa a thousand years before Dorsk 81 was created, the Khommites had believed that their genetic structure was perfect and had frozen evolution by creating clones. Dorsk 81, however, was slightly different from his ancestors, in his mind and spirit and his ability to allow the Force to flow through him. Because of this difference, Dorsk 81 felt that he was a failure to his race, until he heard that the New Republic was rebuilding the Jedi Order.\nWhen Luke Skywalker set up his Jedi Praxeum on Yavin 4, Dorsk 81 went to see him to seek guidance. Dorsk decided to stay and became one of the first twelve trainees that Luke taught. The diversity of the jungle world was bewildering for the sheltered man, but he slowly learned to cope with it, forming friendships with the other trainees such as Dathomiri witch Kirana Ti and the young Kyp Durron. Dorsk struggled somewhat with the Force and was nearly injured one evening in an underground cavern. While floating in a mineral spring with the other Jedi, he panicked when a bubble of super-heated vapor began to rise towards the trainees. Only the intervention of Gantoris enabled Dorsk to divert the heat. Dorsk again saw this strength of Gantoris' used in a more sinister way during a duel between Gantoris and Luke Skywalker. It was also Dorsk who fetched Master Skywalker when the charred body of Gantoris was found.\nAt one point, he journeyed into the jungle with Kyp to the Temple of Exar Kun. There, Kyp put him to sleep while he learned from the Sith Lord. Kun wanted to kill the clone but Kyp prevented this. Durron later betrayed the Jedi and fled the Academy in Mara Jade's Z-95 Headhunter. Dorsk 81 worked with the other students to defeat Exar Kun and later forgave Kyp, realizing he had been under the sway of the Sith Lord. After he was knighted, he left the Academy to become a Jedi Watchman of Khomm.\nKhomm, however, was not open to this role, expecting Dorsk to slot back in to his old roles. Unable to accept this, or to integrate his new knowledge and experience, Dorsk left soon after with Kyp to investigate the Deep Core. There, they stumbled upon a resurgent Imperial faction. At a hyped-up rally, they discovered this group was led by none other than Admiral Daala—against whom Kyp had gone on a personal crusade and believed to be dead. In a loud outburst, their presence was discovered at the rally and they had to flee quickly.\nHaving identified Dorsk 81 as a Khommite, Gilad Pellaeon and Daala decided to add Khomm to their list of targeted worlds. Dorsk tried to warn his people and predecessors, but they refused to believe him. Many clones were destroyed in the assault on Khomm.\nFleeing back to the Jedi Academy in a stolen Imperial shuttle, Dorsk 81 and Kyp Durron arrived just in time to warn a group of thirty gathered students of an impending attack. Daala and Pellaeon were determined to wipe out the Jedi as a symbolic victory.\nFortunately, the students were not at the Great Temple, but rather at the Temple of the Blueleaf Cluster, which confused the Imperials into designating this as their primary target. Fighting against the first wave of TIE fighters, Dorsk 81 hurled giant rocks at the ships using the Force and caused them to crash. The other students did likewise, repelling the first wave of TIE fighters and bombers.\nRecognizing their vulnerability in the jungle, Kyp called a retreat to the main temple. There they fought off a ground assault force, Dorsk again using the Force to good effect and knocking an AT-ST into a jungle tree. In the short reprieve between assault waves, the Jedi gathered for a planning session in the War Room. Aware of the seventeen Imperial I-class Star Destroyers in orbit, Dorsk suggested using the Force to thrust them away, based on Yoda's axiom \"Size matters not\", used by Luke Skywalker as one of the most important teachings in his New Jedi Order.\nArranging the Jedi on the outside points of the Grand Temple, Dorsk stood alone on the observation deck, atop a Force apex. All the Jedi channeled their power through him, and surrendering fully to the Force, Dorsk shoved the Star Destroyers end-over-end out of the star system in what possibly is the most powerful use of Force Push in recorded history. The enormous Force power flowing through him overpowered his body, burning through it and killing him. As Kyp raced up the temple to catch Dorsk, he uttered his final words: \"They're gone, my friend\".\nThe removal of the Star Destroyers left only the ground forces to mop up. The Jedi did this easily, aided by the return of Luke Skywalker and Han Solo. Admiral Daala arrived in her Knight Hammer, but shortly after, Admiral Ackbar arrived with a New Republic fleet that defeated her.\nDorsk 81 was later buried in a grove in the Yavin jungle, with a gray plinth marking his grave. His was the second plinth placed there, Gantoris was the first, but in time it would be joined by many others.\nThe destruction of the Khommite society and the heroic sacrifice of Dorsk 81 shocked the Khommite people out of their complacency and into a reform of their ways. Dorsk 81 was deified by them, and his successor, Dorsk 82 would go on to study at the Jedi Praxeum. Dorsk 82 struggled with coming to terms with the legacy of Dorsk 81 when Kyp Durron gave him Dorsk 81's lightsaber, but eventually, he too gave his life as a sacrifice to protect civilians during the Yuuzhan Vong War.\nDorsk 81 was a kind being. He was selfless, as shown by his sacrifice to save the Jedi Praxeum. Dorsk was friends with Kyp Durron, who was much more reckless than Dorsk. When he traveled back to his homeworld after becoming a Jedi Knight, Dorsk 81 was surprised by the complacency of the Khommite people. He desired to change things for them, and to make them willing to fight for a cause. Ultimately, Dorsk 81 was able to come to peace with the Force and himself, and was willing to give his life to save others.\nIn The New Essential Chronology Dorsk 81 is mistakenly said to have been killed twice, on Yavin 4 and then again on Ando. The Dorsk who died on Ando was actually Dorsk 82, his clone.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Khomm/Legends",
  "/wiki/12_ABY/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Khommite/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Dorsk",
  "/wiki/Jedi_Praxeum",
  "/wiki/The_Force/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Natasi_Daala",
  "/wiki/1000_BBY",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Gantoris",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Kirana_Ti",
  "/wiki/Kyp_Durron",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Temple_of_Exar_Kun",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Knighting_ceremony/Legends",
  "/wiki/Jedi_Watchman/Legends",
  "/wiki/Deep_Core/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/United_Warlord_Fleets",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Assault_on_Yavin_4",
  "/wiki/Jedi/Legends",
  "/wiki/Tionne_Solusar",
  "/wiki/The_Ballad_of_Nomi_Sunrider",
  "/wiki/Double_viol",
  "/wiki/Great_Temple/Legends",
  "/wiki/Temple_of_the_Blueleaf_Cluster",
  "/wiki/TIE/LN_starfighter",
  "/wiki/TIE/sa_bomber/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Strategy_Center",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Yavin_system/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Knight_Hammer",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Burial/Legends",
  "/wiki/Dorsk_82",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Category:Images_of_Dorsk_81",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Champions_of_the_Force",
  "/wiki/I,_Jedi",
  "/wiki/Darksaber_(novel)",
  "/wiki/Jedi_Academy:_Leviathan",
  "/wiki/Planet_of_Twilight",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_I:_Conquest",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Star_Wars_101",
  "/wiki/Star_Wars_Galaxy_Magazine_5",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Jedi",
  "/wiki/Star_Wars_Galaxy_Magazine_13",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_135",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Kam_Solusar",
  "/wiki/Brakiss",
  "/wiki/Corran_Horn",
  "/wiki/Streen",
  "/wiki/Kyle_Katarn"
 ]
}