{
 "name": "Doshao",
 "display_name": "Doshao",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Caste",
     "values": [
      "Warrior caste"
     ]
    }
   ]
  }
 ],
 "content": "Doshao was a Yuuzhan Vong male of the warrior caste who distinguished himself in 25 ABY as a subaltern during the Battle of Dantooine as part of the Yuuzhan Vong War. For his actions on the planet Dantooine, Doshao was escalated to the rank of sector chief aboard the warship Yammka while it was in Hutt Space and was given all of the privileges and responsibilities that rank entitled.\nA Yuuzhan Vong of the warrior caste, Doshao participated in his species' extra-galactic invasion of the galaxy of the New Republic during the Yuuzhan Vong War. In 25 ABY, Doshao held the rank of subaltern and was present on the planet Dantooine, where he committed brave deeds during the Battle of Dantooine between the Yuuzhan Vong and New Republic. Later, the subaltern was present aboard the Yuuzhan Vong miid ro'ik warship Yammka while it was near the planet Runaway Prince in Hutt Space. On the Yammka, Doshao was assembled along with a multitude of other warriors to greet the arrival of Warmaster Nas Choka, whose subordinate commander shortly called Doshao to come forward to the dais at the front of the assembly, alongside three other subalterns.\nFor his actions on Dantooine, Doshao was escalated before the audience alongside the three other subalterns. A modified implanter proceeded to climb up Doshao's back and slice open his shoulders to insert a hooked horn onto either shoulder. With each subaltern given a command cloak to hang off their newly added spikes, Choka personally promoted Doshao and the others to the rank of sector chief, granted them each their own starship, and finally tasked them with overseeing and managing the populations that made up their new domains.\nDuring Doshao's time on Dantooine, he committed actions considered brave by his fellows, which led to his escalation. Although he sweated and trembled during the painful implanting process of his escalation ceremony, Doshao did not cry out in pain, much to the satisfaction of Warmaster Nas Choka.\nDoshao first appeared in James Luceno's Agents of Chaos II: Jedi Eclipse, a 2000 installment of The New Jedi Order series. The warrior was later mentioned in The Complete Star Wars Encyclopedia, released in 2008.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Warrior_caste",
  "/wiki/25_ABY/Legends",
  "/wiki/Subaltern",
  "/wiki/Battle_of_Dantooine_(Yuuzhan_Vong_War)",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Planet/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Escalation",
  "/wiki/Military_rank/Legends",
  "/wiki/Sector_chief",
  "/wiki/Warship/Legends",
  "/wiki/Yammka",
  "/wiki/Hutt_Space/Legends",
  "/wiki/Species/Legends",
  "/wiki/Extra-galactic",
  "/wiki/The_galaxy/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Miid_ro%27ik",
  "/wiki/Runaway_Prince",
  "/wiki/Warmaster",
  "/wiki/Nas_Choka",
  "/wiki/Choka%27s_subordinate_commander",
  "/wiki/Sata%27ak",
  "/wiki/Harmae",
  "/wiki/Tugorn",
  "/wiki/Implanter",
  "/wiki/Command_cloak",
  "/wiki/Starship/Legends",
  "/wiki/Time/Legends",
  "/wiki/James_Luceno",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/2000",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught"
 ]
}