{
 "name": "Doshanalawook",
 "display_name": "Doshanalawook",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Trandosha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow-green"
     ]
    }
   ]
  }
 ],
 "content": "The female Trandoshan Doshanalawook, later also known as \"Chainbreaker,\" was a famous Wookiee liberator active during the Galactic Empire's Occupation of Kashyyyk. Chainbreaker's identity was kept secret and it was assumed by most that she was a Wookiee. She was captain of the gunship Liswarr and operated it with many Wookiee clans. In 3 ABY, the bounty hunter Bossk tracked down Liswarr and boarded the ship. Bossk made his way to the bridge, intending to capture Chainbreaker. During their confrontation, she revealed that they were clutchmates and she convinced him to stop hunting Wookiees.\nThe female Trandoshan who came to be known as Chainbreaker was from the same clutch as her clutchmate Bossk. After hatching, Bossk ate his unborn siblings' eggs, including Chainbreaker's. Their father Cradossk always told Bossk he had consumed all the eggs, but Chainbreaker secretly survived, albeit crippled. Cradossk exchanged her cracked egg to Liswarr'arindoo for a bottle of Kowakian rum. The Wookiee named the hatchling Doshanalawook and raised her as a Wookiee in her clan.\nAfter the rise of the Galactic Empire and its subsequent occupation of Kashyyyk, Doshanalawook captained Liswarr, a Wookiee gunship with the Chyakk, Koom, and Gkrur clans, and helped fight against Imperial rule and freed enslaved Wookiees. She became famous among the Wookiees as a liberator and was given the name Chainbreaker. As Chainbreaker, her identity as a Trandoshan was hidden from most, including the many bounty hunters who pursued her. She was assumed to be some enigmatic and skilled Wookiee outlaw.\nIn 3 ABY, Bossk, now a bounty hunter, tracked Liswarr to the Rycep Belt. He entered the ship through its airlock and made his way to the bridge. Rutallaroo and other Wookiees on board tried to stop Bossk but were all defeated. Bossk entered the bridge and confronted Chainbreaker, sitting in the dark in a mechno-chair. Bossk soon realized that Chainbreaker was not a Wookiee but in fact a female Trandoshan. She revealed that she and Bossk were clutchmates and when Bossk devoured her egg, he failed to kill his sister. She also told Bossk how she was given to Liswarr'arindoo and raised as a Wookiee named Doshanalawook. Bossk tried to escape the bridge but became trapped. In exchange for his freedom, and a private message to him from Lieutenant Masil Veit, Bossk reluctantly agreed to stop hunting Wookiees.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Trandosha",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Wookiee",
  "/wiki/Galactic_Empire",
  "/wiki/Occupation_of_Kashyyyk",
  "/wiki/Captain",
  "/wiki/Gunship",
  "/wiki/Liswarr",
  "/wiki/3_ABY",
  "/wiki/Bounty_hunter",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Bridge_(starship)",
  "/wiki/Clutchmate",
  "/wiki/File:KowakianrumTC.ogg",
  "/wiki/Clutch",
  "/wiki/Cradossk",
  "/wiki/Liswarr%27arindoo",
  "/wiki/Kowakian_rum",
  "/wiki/Chyakk_clan",
  "/wiki/Koom_clan",
  "/wiki/Gkrur_clan",
  "/wiki/Airlock",
  "/wiki/Bridge",
  "/wiki/Rutallaroo",
  "/wiki/Mechno-chair",
  "/wiki/Lieutenant",
  "/wiki/Masil_Veit",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Tooth_and_Claw",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back"
 ]
}