{
 "name": "Dossa",
 "display_name": "Dossa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3996 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Brotherhood of the Sith",
      "Exar Kun's Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Dossa was a female Nautolan smuggler. She was a long time assignment of Haazen during his time as a Padawan on Arkania. After several of his failures to capture her, Dossa once again humiliated him by stealing his lightsaber from him and this time Haazen was only saved from death by the timely arrival of his friend Barrison Draay.\nTen years later, Dossa eventually became a tattooed Sith servant under Exar Kun, Dark Lord of the Sith, and fought in the Great Sith War. She met Haazen again after the Battle of Toprawa. Sensing his jealousy of Barrison, she concocted a trap that to Haazen was meant for the Jedi, but in actuality was meant for Haazen as well. She had Haazen lead Barrison into the Ansharii Caverns on the pretense that a Sith base was hidden there. She then detonated a bomb that resulted in the death of Barrison Draay and Haazen's ultimate fall to the dark side.\nWhen Haazen awoke after the blast, he screamed in agony as he saw how disfigured he was. Dossa told him that he had been pulled from the rubble by Doctor Uburluh and \"fixed up good\". However, Haazen wanted revenge for what she had done to him, and he killed her in his anger.\nMillennia later, Darth Plagueis would remember learning about her when considering taking another Nautolan, Naat Lare, as an apprentice.\nDossa possessed a highly advanced level of fighting-skills like hand-to-hand-combat. She used blasters and even a disruptor-pistol, whose plasma-emanations could cause serious damages in buildings and to people—the reason such a weapon's use was prohibited on various planets or restricted to an elevated circle of users.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3996_BBY",
  "/wiki/Nautolan/Legends",
  "/wiki/Color/Legends",
  "/wiki/Brotherhood_of_the_Sith",
  "/wiki/Sith_Empire_(Great_Sith_War)",
  "/wiki/Gender/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Haazen",
  "/wiki/Padawan/Legends",
  "/wiki/Arkania/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Barrison_Draay",
  "/wiki/Sith_tattoo",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Minion",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Battle_of_Toprawa_(Great_Sith_War)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Uburluh",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Naat_Lare",
  "/wiki/Knights_of_the_Old_Republic_33",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)"
 ]
}