{
 "name": "Dotyk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "26 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human mutant"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.72 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Dotyk was a Human female from Corellia. She was born a mutant and somehow acquired the ability to paralyze and strike fear in those at whom she looked.\nDotyk was born on the planet Corellia to a family known for their dark dealings. As a young child, her very presence brought fear in those around her. This ability occurred as a natural defense mechanism, causing people to feel sick in her presence. Due to this ability, she made few friends and eventually ran from her home. She continued to flee across the galaxy in order to avoid others. However, during her travels she began to gain control over her abilities and, with her newfound powers, Dotyk could attack others and ward off potential threats. While continuing to develop her powers, she was able to paralyze or cripple those that confronted her, causing at least one individual to bleed from her nose. Despite gaining control over her powers, Dotyk continued to attack those around her, believing that it was her destiny to continue her family's evil.\nDotyk weighed 58 kg and was quite hostile towards those that approached her. She was not hesitant to unleash her powers on anyone who came into contact with her, which was a result of her terrible childhood.\nDotyk appeared in dossier BXLH: Les mutants dans Star Wars , a roleplaying article in the French magazine Graal 23. Published in 1990, the article was written under the pseudonym \"Haufe the ugly little Ewok.\" The roleplaying statistics provided were compatible with the roleplaying game created by West End Games.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Corellia/Legends",
  "/wiki/26_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Mutant",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Dossier_BXLH:_Les_mutants_dans_Star_Wars",
  "/wiki/Graal_23",
  "/wiki/1990",
  "/wiki/Haufe_the_ugly_little_Ewok",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/Graal_(magazine)"
 ]
}