{
 "name": "Dov_Paploush",
 "display_name": "Dov Paploush",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Biituian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Wheel"
     ]
    }
   ]
  }
 ],
 "content": "Dov Paploush was a female Biituian industrialist, who became the tenth Administrator of the Wheel space station following the death of its ninth administrator, a Human known as \"Old Silver Eyes\". Purchasing the station shortly after the man's death, Paploush arrived at the station to find its Master Communication System unplugged and indifferently had it replaced with newer technology as part of a large amount of expensive changes she made to the station. Despite investing a large sum of credits in to the station's overhaul, Paploush showed poor business acumen while running the station and while she controlled the Wheel it made huge financial loses. Her incompetence eventually lead to her death at the hands of several mercenaries who had sworn the Bloody Bones oath, an oath of loyalty. She was replaced as administrator by Pol Temm, a Kel Dor who was working as head of the Wheel Security Force at the time of her death.\nDov Paploush was first mentioned in the second entry of Viva Space Vegas! The History of the Marvelous Wheel, a pair of articles released on the StarWars.com blog in 2013 and written by Abel G. Peña and Rich Handley.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Biituian",
  "/wiki/Gender/Legends",
  "/wiki/The_Wheel/Legends",
  "/wiki/Administrator/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Death/Legends",
  "/wiki/Human/Legends",
  "/wiki/Old_Silver_Eyes",
  "/wiki/Master_Communication_System",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Mercenary/Legends",
  "/wiki/Bloody_Bones_oath",
  "/wiki/Pol_Temm",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Wheel_Security_Force",
  "/wiki/Viva_Space_Vegas!_The_History_of_the_Marvelous_Wheel",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Blog",
  "/wiki/2013",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Rich_Handley",
  "/wiki/104_ABY",
  "/wiki/130_ABY"
 ]
}