{
 "name": "Draahg",
 "display_name": "Draahg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "Later none"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Eyes and much of face"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireSphere of Military OffenseDarth Baras' spy network",
      "Sphere of Military Offense",
      "Darth Baras' spy network"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Baras",
      "Darth Vengean"
     ]
    }
   ]
  }
 ],
 "content": "Draahg was a Human male Sith Lord of the reconstituted Sith Empire during the Cold War and Galactic War who claimed he was invincible.\nAs a young Sith apprentice, Draahg's talent for fading into the background served him well on Korriban, where he survived an especially brutal overseer's training by ensuring that all the other acolytes attracted more attention. It was this very quality that helped him secure Darth Baras's approval and a position as his apprentice. Manipulating events so that he might gain an advantage over his own master Darth Vengean, Darth Baras placed Lord Draahg as his own secret apprentice in Vengean's service. As Baras's spy, Lord Draahg reported on Darth Vengean's private meetings and shifting alliances - information Vengean had deliberately prevented Baras from learning. Draahg had carefully cultivated a facade of a blindly obedient menace, always careful to please Vengean but never betraying a hint of his true loyalties.\nBut Draahg was not to be underestimated. As the chosen apprentice of both Baras and Vengean, he possessed a breadth of knowledge and a depth of power few others could claim. When another apprentice of Baras moved in to kill Vengean as the last act of Baras' version of Plan Zero, Baras ordered Draahg to hold back, to keep the true extent of his strength secret from both the Apprentice and Vengean alike. Thus Draahg allowed himself to be restrained by Vengean, only for the Warrior to free him. In the end Draahg helped the Warrior kill Vengean and Baras was able to ascend to his seat on the Dark Council.\nShortly afterwards, Darth Baras sent Draahg to kill the Sith Warrior on Quesh out of fear that the Warrior one day would become strong enough to challenge him. Using one of his Republic moles, Baras sent Captain Trey-yen a detonator that was not wired to an explosive meant to destroy an Imperial base. Draahg himself had the real detonator and attempted to bury the Warrior in a mine, but failed. Unknown to Draahg, the Warrior was saved by the Emperor's Hands and granted the title of the Emperor's Wrath.\nAfter the death of Darth Ekkage, Baras became aware that his former apprentice lived and sent Draahg to finish the job. Draahg tracked his target to the Adamas Space Station in orbit over Hoth, where the Warrior was on a mission by the Emperor's Hand to redeploy Armageddon Battalion to Corellia. Draahg had subdued four of the Warrior's five-man crew, intending to subject them to Baras' service, before attempting to finish the job he started. In turn, the Wrath promised to exact revenge on both him and Baras for their betrayal. Unfazed, Draahg boasted that while Baras held back on the Wrath's training, Draahg himself wielded the combined teachings of both Baras and Vengean and stated that he was invincible. The two Sith engaged each other in a lightsaber duel. After three sallies Draahg admitted defeat, but promised that Baras would be victorious in the end. The Wrath simply laughed at him, provoking Draahg into charging, only for the Wrath to leap over him and Force-push him over a railing into a fire.\nDraahg survived using the pain from his burns before drinking of anguish as Baras retrieved and rebuilt him into a cyborg. Draahg continued to chase the Warrior and caught up with him at the lair of the Entity on Corellia. Fully believing himself to be immortal, Draahg placed Dark Councilor Darth Vowrawn into a death field and battled with the Sith Warrior to ensure the continued bondage of the Entity to Darth Baras' service. But he was no match for the Emperor's Wrath and finally died, releasing Darth Vowrawn before the elder Sith came to any harm.\nDraahg had short, brown hair, brown eyes, a muscular build and red tattoos on his forehead and chin which extended to his cheeks. After becoming a cyborg, he had a shaved head and cybernetic implants where his eyes were.\nDraahg displayed utmost loyalty to Baras, who was grooming him to be his general. He followed his Master's orders without question. He was loyal to the point where he blindly believed that Baras was truly the Voice of the Emperor. After his defeat at the hands of the Emperor's Wrath, Draahg nursed complete hatred for his rival. As he was rebuilt into a cyborg, he was more than eager to get his revenge, but his overconfidence led to his undoing.\nLord Draahg could utilize telekinesis and Force drain. He boasted that he was invincible, and indeed demonstrated the ability to suffer incredible injury and continue fighting at full strength. During his battles, multiple lightsaber cuts failed to fell him, and even being burned alive only stopped him for a short while. He was also resistant to many Force abilities, shrugging them off easily. Eventually the Emperor's Wrath was forced to cut off his head, an injury not even he could survive.\nLord Draahg was also a master of the lightsaber, an equal to even some on the Dark Council. He supplemented his physical skills with many advanced Force techniques, taking on both the Emperor's Wrath and Darth Vowrawn together and providing a significant challenge.\nLord Draahg was also capable of the Jar'Kai lightsaber move when he was fighting Darth Vengean and the Emperor's Wrath.\nDraahg was voiced by Nicholas Boulton.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Draahg",
  "/wiki/3640_BBY",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sphere_of_Military_Offense",
  "/wiki/Darth_Baras%27_spy_network",
  "/wiki/Darth_Baras",
  "/wiki/Darth_Vengean",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Korriban",
  "/wiki/Overseer_(Sith)",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Plan_Zero",
  "/wiki/Dark_Council",
  "/wiki/Quesh",
  "/wiki/Trey-yen",
  "/wiki/Hand_of_the_Empire",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Darth_Ekkage",
  "/wiki/Adamas_Space_Station",
  "/wiki/Hoth/Legends",
  "/wiki/Armageddon_Battalion",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/The_Entity",
  "/wiki/Darth_Vowrawn",
  "/wiki/Mission_to_Corellia_(Emperor%27s_Wrath)",
  "/wiki/Sith_Warrior",
  "/wiki/Emperor%27s_Voice_(Sith_Empire)",
  "/wiki/Force_drain",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Nicholas_Boulton",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}