{
 "name": "Draa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "41st Elite Corps",
      "41st Elite Corps"
     ]
    }
   ]
  }
 ],
 "content": "\"Draa\" was the nickname of a clone trooper who served in the 41st Elite Corps during the Clone Wars. He took part in the Second Battle of Geonosis, under the command of Jedi Master Luminara Unduli and Clone Commander CC-1004, after the native Geonosians broke free from the Republic control that had been established on Geonosis since the beginning of the Clone Wars. Draa took part in the attack on a primary droid foundry and, along with most of the Republic forces there, distracted the Separatist droids as two Jedi Padawans infiltrated the foundry to destroy the main reactor. Although Draa and the troops faced heavy opposition from enemy battle droids and ray shielded super tanks, the foundry was destroyed and the Republic later won the battle.\nDraa was the nickname of a clone trooper made from the bounty hunter Jango Fett on the planet Kamino who served the Galactic Republic during the Clone Wars against the Separatist Alliance. Draa was part of the Grand Army of the Republic's 41st Elite Corps, serving under Jedi General Luminara Unduli, Jedi Commander Barriss Offee, and Clone Commander CC-1004 \"Gree.\" Early in the Clone Wars, Draa and his fellow soldiers participated in the Second Battle of Geonosis. After the initial assault by Jedi Generals Ki-Adi-Mundi, Obi-Wan Kenobi, Anakin Skywalker, and their forces destroyed the ray shield generator, Draa and the 41st Elite Corps were dispatched to aid General Skywalker and the 501st Legion in destroying the primary droid foundry. Draa accompanied Buzz, Commander Offee, Commander Gree, General Unduli, and other clone troopers in an LAAT/i gunship.\nAs a clone of Jango Fett, Draa stood 1.83 meters tall. Draa was an eager trooper, and when called forward by Clone Captain CT-7567 \"Rex\" to destroy the droidekas, he readily obeyed. Draa had a symbol of a flaming asteroid on his helmet.\nDraa was an expert shot with his RPS-6 rocket launcher.\nDraa utilized a RPS-6 rocket launcher, as well as a DC-15A blaster carbine and DC-15A blaster rifle. Draa was equipped with standard phase I clone trooper armor that was personalized in the green markings of the 41st Elite Corps. and an stylized asteroid on his helmet. He also made use of a backpack.\nDraa debuted in \"Weapons Factory,\" the sixth episode of the second season of the animated TV series Star Wars: The Clone Wars, although Draa was identified in the episode's accompanying episode guide on StarWars.com. According to the episode guide, the script had Draa state the line, \"Buckle your belts and check your cells, soldiers. We're going in.\" Though the line was actually spoken by \"Buzz\" in the episode.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Draa",
  "/wiki/Draa/Legends",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/41st_Elite_Corps",
  "/wiki/Clone_trooper",
  "/wiki/Clone_Wars",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/Jedi_Master",
  "/wiki/Luminara_Unduli",
  "/wiki/Clone_Commander",
  "/wiki/CC-1004",
  "/wiki/Geonosian",
  "/wiki/Geonosis",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Geonosis_primary_droid_foundry",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Reactor",
  "/wiki/Battle_droid",
  "/wiki/Ray_shield",
  "/wiki/Super_tank",
  "/wiki/File:Draa-Dooku_boot.png",
  "/wiki/Dooku_Boot",
  "/wiki/Reproduction",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Planet",
  "/wiki/Jedi_General",
  "/wiki/Jedi_Commander",
  "/wiki/Barriss_Offee",
  "/wiki/Soldier",
  "/wiki/General",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/501st_Legion",
  "/wiki/Buzz",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Droideka",
  "/wiki/Fire",
  "/wiki/Asteroid",
  "/wiki/Helmet",
  "/wiki/RPS-6_rocket_launcher",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/DC-15A_blaster_rifle",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Color",
  "/wiki/Backpack",
  "/wiki/Weapons_Factory",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Draa",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Databank_(website)"
 ]
}