{
 "name": "Dracen",
 "display_name": "Dracen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Dracen was a male Human Imperial Moff stationed on Quesh during the Cold War.\nDracen was a Moff of the Sith Empire's military during the Cold War. He is known for his assignment to the toxic planet Quesh.\nQuesh was one of many worlds during the Cold War that was a site of undeclared war between the Sith Empire and the Galactic Republic. Republic operations there involved the creation and processing of powerful adrenals which threatened to unbalance Republic and Imperial forces.\nMoff Dracen's assignment on Quesh involved sabotaging Republic operations there. To this end, Drace was aligned with the local Hutts and eventually came to work with a Sith Lord affiliated with Darth Baras.\nDracen eventually led the Hutt Cartel to an invasion of Broga Masrii's Palace on Quesh, eventually General Korvan of the Galactic Republic saw an opportunity to capture or eliminate Moff Dracen camped out in Broga's Palace. Dracen's barricade was hit by a Republic SpecForces Squad and an unidentified affiliate with the Republic, Dracen was taken in to Republic prison for questioning.\nBecause of the option to kill Moff Dracen, the missions given by General Korvan on Quesh take place after Dracen's missions.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Moff/Legends",
  "/wiki/Quesh",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Adrenal",
  "/wiki/Hutt/Legends",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Darth_Baras",
  "/wiki/Hutt_Cartel",
  "/wiki/Broga_Masrii",
  "/wiki/Broga%27s_Palace",
  "/wiki/Korvan",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Dracen",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}