{
 "name": "Drash",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Left arm"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fett gotra",
      "Mods",
      "Mods"
     ]
    }
   ]
  }
 ],
 "content": "Drash was a human female member of a street gang within the Worker's District of the city Mos Espa on Tatooine.\nDrash grew up in a neighborhood of Mos Espa a \"womp hop\" away from an alley where she would later clash with Pyke Syndicate forces. At some point she joined the Mods street gang.\nAfter the street gang's thefts were reported to the new Daimyo, Boba Fett, by the water-monger Lortha Peel, Fett confronted the criminals. Drash informed him that the gang was stealing because there was no work for them to earn money from, and Fett subsequently recruited them to work for him.\nThe street gang later assisted Fett in fending off the Wookiee gladiator Krrsantan, who was sent to kill him by the Hutts known as the Twins, and later pursued the majordomo of Mayor Mok Shaiz in a chase through the streets of Mos Espa.\nDrash was present for a meeting about the rising threat of the Pyke Syndicate as the crime syndicate gathered troops in Mos Espa. Fennec Shand summarized the Pyke's culmination of forces and mentioned Mok Shaiz fleeing off world as a sign war was about to break out.\nDuring an ambush in the Worker's District of Mos Espa, Drash, and other Mods, were rescued by Shand. She was the only one to say \"thank you,\" a gesture that impressed Shand.\nShe fought alongside the Freetown garrison against the Scorpenek droids during the Battle for Mos Espa. She eventually traded her blaster pistol for Taanti's Cycler rifle before taking to the rooftops to snipe Pykes, alongside Jo.\nDrash had pale skin, blue eyes, and brown hair. Her body modifications appeared to be limited to a cybernetic replacement of her left arm. It had a distinctive red color that matched other pieces of her attire.\nDrash carried a retractible vibro-stiletto and hold-out blaster pistol. She once exchanged the pistol for a Cycler rifle during the Battle for Mos Espa.\nShe rode a blue speeder bike with two sets of shiny mirrors flaring from the sides.\nDrash was introduced in \"Chapter 3: The Streets of Mos Espa,\" the third episode of the television series The Book of Boba Fett, which was released on Disney+ on January 12, 2022. She was portrayed by Sophie Thatcher, with Callie Croughwell and Crystal Hooks acting as stunt doubles. Though not named in the episode, Drash was identified in the stunt performers' credits. She was first referred to by name in \"Chapter 7: In the Name of Honor.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Tatooine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Limb",
  "/wiki/Fett_gotra",
  "/wiki/Mods",
  "/wiki/Worker%27s_District",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Womp_rat",
  "/wiki/Pyke_Syndicate",
  "/wiki/Daimyo",
  "/wiki/Boba_Fett",
  "/wiki/Water-monger",
  "/wiki/Lortha_Peel",
  "/wiki/Wookiee",
  "/wiki/Gladiator",
  "/wiki/Krrsantan",
  "/wiki/Assassination_attempt_on_Boba_Fett",
  "/wiki/Hutt",
  "/wiki/The_Twins_(Hutts)",
  "/wiki/Chase_through_Mos_Espa",
  "/wiki/Unidentified_Twi%27lek_majordomo",
  "/wiki/Mayor_of_Mos_Espa",
  "/wiki/Mok_Shaiz",
  "/wiki/Fennec_Shand",
  "/wiki/Freetown_garrison",
  "/wiki/Scorpenek_droid",
  "/wiki/Battle_for_Mos_Espa",
  "/wiki/Taanti",
  "/wiki/Cycler_rifle",
  "/wiki/Pyke",
  "/wiki/Jo",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Vibro-stiletto",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Disney%2B",
  "/wiki/January_12",
  "/wiki/2022",
  "/wiki/Sophie_Thatcher",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/The_Book_of_Boba_Fett_Junior_Novel",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Drash"
 ]
}