{
 "name": "Dreanna_Conunda",
 "display_name": "Dreanna Conunda",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "New Academy",
      "New Academy",
      "Corellian Engineering Corporation",
      "Resistance",
      "Exegol landing team",
      "Exegol landing team"
     ]
    }
   ]
  }
 ],
 "content": "Dreanna Conunda was a human female pilot. She worked as a flight instructor at the New Republic academy on the planet Chandrila, also acting as a test pilot for the Corellian Engineering Corporation. By 35 ABY, she had joined the Resistance in its war against the First Order, serving as a pilot at the Resistance base on the moon Ajan Kloss. Conunda flew as captain of the YC-123B transport hauler Fortitude, with Lieutenant Gandris Dyun as her co-pilot. The pair shared compatibility and chemistry, and there were rumors that their relationship went beyond professional.\nWhen the Resistance mounted its attack on the Sith Eternal's forces on the planet Exegol, Conunda transported the Resistance's Exegol landing team on board the Fortitude through the Galactic Barrier that separated Exegol from the rest of the galaxy. After reaching Exegol, she spotted the navigation tower that the landing team were tasked with destroying, but it was deactivated before the transport could reach it.\nGeneral Finn then had Conunda land the Fortitude on the surface of the Resurgent-class Star Destroyer Steadfast, the new source of the signal that had been transmitted from the tower. The landing team charged from the transport and successfully stopped the signal, after which Conunda evacuated the survivors from the Star Destroyer's surface and eventually returned them to Ajan Kloss after the Resistance claimed victory.\nCaptain Dreanna Conunda was a human female who, during the reign of the New Republic, served as one of the youngest flight instructors at the Republic's training academy on the planet Chandrila. As well as teaching, Conunda flew as a test pilot for the Corellian Engineering Corporation, splitting her time between the roles as the school year permitted. However, during the war between the First Order and the Resistance, she worked instead as the Resistance pilot of the YC-123B transport hauler Fortitude, which earned the nickname of \"lucky lander\" among the troops for its successful track record of dropping off or picking up soldiers from combat zones. Based at the Resistance base on the moon Ajan Kloss, Conunda flew with Lieutenant Gandris Dyun as her co-pilot on the Fortitude.\nIn 35 ABY, the Resistance planned an attack on the forces of the Sith Eternal that were preparing to launch from the Unknown Regions planet Exegol. The droid D-O had provided information on the surface of the planet that revealed that the Sith Eternal's fleet, the Final Order, was dependent on a navigation tower to launch, so the Resistance's plan was to deploy their Exegol landing team to destroy the tower. The team, including a large number of orbak riders from Company 77, a group of First Order deserters, was loaded onto the Fortitude, which would serve as the sole insertion vehicle for the ground forces. Conunda and the rest of the Resistance's forces then used a route provided by the Jedi Rey to fly through the Galactic Barrier, a hard-to-navigate region of hyperspace anomalies that separated Exegol from most of the known galaxy.\nDuring the journey, General Finn, one of the new leaders of the Resistance, took Dyun's place in the cockpit and was sat with Conunda when they first arrived above Exegol and witnessed the many Xyston-class Star Destroyers of the Sith fleet, which immediately opened fire on the Resistance vessels. Resistance General Poe Dameron ordered his forces to get level with the Sith Star Destroyers so that the enemy craft could no longer fire without hitting each other, and Conunda dodged incoming fire as she took the Fortitude down toward the navigation tower, which she pointed out to Finn.\nRealizing the Resistance's plan, First Order Allegiant General Enric Pryde had Admiral Frantis Griss transfer the navigation signal to the Resurgent-class Star Destroyer Steadfast. Seeing the navigation tower power down, Dameron initially called off the ground invasion, but sensing the signal's new origin point through the Force, Finn directed Conunda to land the Fortitude on the surface of the Steadfast. Finn then left the cockpit to join the landing team in the rear, and Dyun moved up to take his place beside Conunda, who shouted back to the rest of the ship that the new landing would be rough.\nWhile the Resistance's starfighters focused on providing them cover, the captain and her co-pilot successfully evaded fire from TIE/dg starfighters and landed on the Steadfast's surface before opening the drop-down loading doors of the Fortitude. Led by the charging orbak riders, the Resistance ground forces deployed onto the command ship and engaged the Sith troopers that arrived to stop them. The Fortitude remained landed on the ship as Finn and his forces successfully managed to disable the Steadfast's navigation tower, after which the surviving ground forces retreated back into the Fortitude.\nWith the insertion complete, Conunda launched from the ship, although Finn and his ally Jannah remained behind in order to destroy the Steadfast completely and prevent it from restarting the signal. Ultimately, the arrival of the Citizens' Fleet in support of the Resistance and Rey's defeat of Dark Lord of the Sith Darth Sidious on the surface below allowed the Resistance to claim victory at Exegol and wipe out the remaining Sith forces. The Fortitude then left Exegol with the rest of the fleet and returned to Ajan Kloss, where it landed at the base so the Resistance and its allies could celebrate.\nAlthough her own instructors had assumed that she would be more interested in small, agile craft, Dreanna Conunda was drawn to flying large haulers due to the sense of power their thrusters generated and the inherent challenge of piloting the bulky vessels in and out of spacedocks. The light touch that this required was what was called for when she landed on the Steadfast, which was an ideal mission for the former flight instructor.\nWhen flying with Dyun, Conunda narrowed her focus to the safest path to and from the landing zone while undertaking dangerous insertion or extraction missions. The co-pilot would then keep the transport's defenses active and maintain a wider situational awareness to warn her of encroaching threats or unforeseen hazards. This working relationship mostly consisted of unspoken communication, which Conunda and Dyun had the compatibility and chemistry to pull off, with some Resistance staffers even whispering that the pair's relationship went beyond professional. Conunda had light skin and dark eyes.\nDreanna Conunda wore a yellow flight suit with a white vest, harness, and life support system. She also wore gray gloves and a white flight helmet that bore both a blue and yellow Rebel Alliance starbird and a black and red bulls eye that was a nod to her ability to stick a landing.\nDreanna Conunda was portrayed by Andreea Diac in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker. In the film's credits, the character is listed only as \"Lander Pilot\" and the character's name, which is a tuckerization of Diac's name, was provided by the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/New_Republic",
  "/wiki/New_Academy",
  "/wiki/Corellian_Engineering_Corporation",
  "/wiki/Resistance",
  "/wiki/Exegol_landing_team",
  "/wiki/File:Conunda-Rough-TROSJr.ogg",
  "/wiki/Pilot",
  "/wiki/Flight_instructor",
  "/wiki/Planet",
  "/wiki/Chandrila",
  "/wiki/35_ABY",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance_pilot",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/Captain",
  "/wiki/YC-123B_transport_hauler",
  "/wiki/Fortitude_(transport)",
  "/wiki/Lieutenant",
  "/wiki/Gandris_Dyun",
  "/wiki/Battle_of_Exegol",
  "/wiki/Sith_Eternal",
  "/wiki/Sith_Eternal_military",
  "/wiki/Exegol",
  "/wiki/Galactic_Barrier",
  "/wiki/The_galaxy",
  "/wiki/Navigation_tower",
  "/wiki/Transport",
  "/wiki/General",
  "/wiki/Finn",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Star_Destroyer",
  "/wiki/File:Dameron-GalacticBarrier-TROS.ogg",
  "/wiki/New_Republic_Era",
  "/wiki/Teacher",
  "/wiki/Time",
  "/wiki/Standard_year",
  "/wiki/Trooper",
  "/wiki/Soldier",
  "/wiki/Unknown_Regions",
  "/wiki/Droid",
  "/wiki/D-O",
  "/wiki/Fleet",
  "/wiki/Final_Order",
  "/wiki/Orbak",
  "/wiki/Company_77",
  "/wiki/Resistance_navy",
  "/wiki/Jedi",
  "/wiki/Rey_Skywalker",
  "/wiki/Hyperspace",
  "/wiki/File:Conunda-Finn-TROSEE.ogg",
  "/wiki/Cockpit",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Sith",
  "/wiki/Starship",
  "/wiki/Poe_Dameron",
  "/wiki/Allegiant_General",
  "/wiki/Enric_Pryde",
  "/wiki/Admiral",
  "/wiki/Frantis_Griss",
  "/wiki/The_Force",
  "/wiki/File:Griss-TroopCarrier-TROS.ogg",
  "/wiki/Starfighter",
  "/wiki/TIE/dg_starfighter",
  "/wiki/Command_ship",
  "/wiki/Sith_trooper",
  "/wiki/Jannah",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Sidious",
  "/wiki/Engine",
  "/wiki/Spaceport",
  "/wiki/Eye",
  "/wiki/Color",
  "/wiki/Flight_suit",
  "/wiki/Harness",
  "/wiki/Life_support",
  "/wiki/Glove",
  "/wiki/Flight_helmet",
  "/wiki/Rebel_Alliance_starbird",
  "/wiki/Andreea_Diac",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Tuckerization",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Category:Audio_files_of_Dreanna_Conunda",
  "/wiki/Category:Images_of_Dreanna_Conunda",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_(Screen_Comix)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_3",
  "/wiki/Ships_and_Vehicles",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ships_of_the_First_Order_and_the_Resistance",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY",
  "/wiki/December_20"
 ]
}