{
 "name": "Dred Priest",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "18 BBY",
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Cuy'val Dar",
      "Death Watch"
     ]
    }
   ]
  }
 ],
 "content": "Dred Priest was a Human male Mandalorian warrior who was accepted into Jango Fett's invitation to train clone commandos on the planet Kamino as part of the Cuy'val Dar. During his time on Kamino, Priest earned the ire of some of his fellow Mandalorian Cuy'val Dars. Kal Skirata and Walon Vau abhorred his Death Watch leanings, believing wholeheartedly that Mandalorians ought to restore their old glory by conquering the galaxy. Another Mandalorian training sergeant, Mij Gilamar, loathed Priest because of his formation of a Battle Circle, where his clone trainees engaged in deadly fights. Gilamar, who also served as a doctor, had to treat Priest's injured trainees and saw many that were beyond treatment and later died.\nA few months after the formation of the Galactic Empire, Priest, along with his girlfriend Isabet Reau, were part of the resurgent Death Watch. The pair were stationed on Mandalore and were actively working with the Imperial garrison. When Gilamar and Kal's adopted son Ordo Skirata encountered Priest in the city of Keldabe, Priest tried to recruit Gilamar into joining the Death Watch. Upon confirming his belief that Priest was still intent in having the Mandalorians rebuild their old empire, Gilamar stabbed Priest with a knife above his thigh, slashing through Priest's femoral artery and causing massive blood loss. Priest died quickly and his body was disposed of by Gilamar and Ordo who threw his body into the Kelita River.\nDred Priest was a male Human Mandalorian and part of the one hundred training sergeants, known as the Cuy'val Dar, that bounty hunter Jango Fett selected to help train clone commandos on the planet of Kamino. Priest accepted the invitation and relished the challenge that creating elite soldiers offered. During his stay at Kamino, he secretly formed a Battle Circle with Isabet Reau—a female Cuy'val Dar whom he soon started a relationship with—where they forced their trainees to fight each other in brutal competitions. Due to the injuries suffered by the clone trainees, Mij Gilamar—another Cuy'val Dar and the doctor who treated the injured clones— informed Fett of the situation, who put a violent end to Priest's fight club. Despite that incident and their Death Watch leanings, Fett allowed them to stay as he was more concerned of their training results.\nThe Ba'jurne Kyr'tsad Mando'ad, a manifesto of the Death Watch Mandalorian splinter group, was supposedly written by the movement's leader, Tor Vizsla—although in one of his notes the Death Watch's opponent Jango Fett doubted its authenticity and suggested that Dred Priest or Isabet Reau wrote the manifesto—and was eventually included in the book The Bounty Hunter Code by Jango's son, the bounty hunter Boba Fett.\nIn 18 BBY, a year after the end of the Clone Wars and the formation of the Galactic Empire, Priest and Reau were on the planet Mandalore working with the local Imperial garrison and recruiting for the revived Death Watch. Priest ran into Gilamar and Null-ARC Ordo Skirata, and tried to convince them to join the Death Watch. They led him down into an underground chasm where they talked further. Upon realizing that Priest had not changed and was still firm in his belief of establishing a Mandalorian empire with the Death Watch, Gilamar stabbed him in the leg with his knife, severing his femoral artery and swiftly killing Priest from severe blood loss. Gilamar and Skirata tossed his corpse into the churning Kelita River to both delay Reau from discovering his fate and to hide who really killed him.\nDred Priest was a firm believer in the Mandalorians ruling the galaxy like their forebears of old. Mij Gilamar described Priest as a merciless butcher, making his trainees fight each other on the battle circle for his amusement.\nPriest had a thin face with a lopsided mouth, the sort of face one could punch all day, according to Kal Skirata.\nThis figure uses parts from 2004's Vintage Original Trilogy Collection Boba Fett's arms and legs, along with a new head, belt, and torso.\nLike the Rav Bralor figure in the set, Dred Priest appears to be loosely based on artwork done by Tom Hodges for the Star Wars Insider 86 article The Mandalorians: People and Culture. In this picture you can see that the waist and shoulder ammo belts, cod piece, and upper torso armor are identical. However, the helmet on the action figure is not as intricately painted as the one in the artwork, nor does the action figure have any thigh and shin armor. The legs are taken from a Boba Fett action figure.\nThe head under the helmet is loosely based on Hasbro employee Derryl Depriest, whose name also served as a basis for the figure.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Priest_(disambiguation)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Dred_Priest",
  "/wiki/18_BBY/Legends",
  "/wiki/Mandalore/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Blue",
  "/wiki/Mandalorian/Legends",
  "/wiki/Cuy%27val_Dar",
  "/wiki/Death_Watch/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Clone_commando/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Kal_Skirata",
  "/wiki/Walon_Vau",
  "/wiki/Mandalorian_Wars",
  "/wiki/The_galaxy/Legends",
  "/wiki/Mij_Gilamar",
  "/wiki/Battle_Circle",
  "/wiki/Doctor/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Isabet_Reau",
  "/wiki/Ordo_Skirata",
  "/wiki/Keldabe/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Kelita_River",
  "/wiki/Sergeant/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Ba%27jurne_Kyr%27tsad_Mando%27ad",
  "/wiki/Author/Legends",
  "/wiki/Secret_Mandalore",
  "/wiki/Tor_Vizsla",
  "/wiki/Book/Legends",
  "/wiki/The_Bounty_Hunter_Code",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Null-class_Advanced_Recon_Commando",
  "/wiki/Rav_Bralor",
  "/wiki/Tom_Hodges",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/The_Mandalorians:_People_and_Culture",
  "/wiki/File:Mandalorian_wedding.jpg",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Bounty_Hunter_Code:_From_the_Files_of_Boba_Fett"
 ]
}