{
 "name": "Drell",
 "display_name": "Drell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Warbird gang",
      "First Order"
     ]
    }
   ]
  }
 ],
 "content": "Drell was a male Weequay pirate who was part of the Warbird gang. He was contacted by one of their spies, Synara San when she wished to speak with their leader, Kragan Gorr. San later helped smuggle Drell and fellow pirate Valik onto the Colossus to kidnap Torra Doza.\nBy the year 34 ABY, the Weequay Drell was a high-ranking member of the Warbird gang, a pirate gang led by the Quarren Kragan Gorr.\nDuring that year, Synara San, a member of the gang operating as a spy on the Colossus platform, reached Drell when she contacted the rest of the gang. He mockingly asked her how she was enjoying her new home, and she demanded to speak to Gorr immediately. Gorr was soon able to reach her and was given the go-ahead to lead the pirates into an attack on the Colossus.\nLater, Drell and the Palliduvan Valik were sent to the Colossus to kidnap Torra Doza, the daughter of the refueling stations captain, Imanuel Doza. The pair were smuggled into the Colossus loading docks in a container and San led them to Doza Tower, where the Doza's lived. After San let them in, Drell and Valik then left her.\nWhen Synara learned about the true nature of their mission, she warned her friend Kazuda Xiono and Captain Doza. After Drell took out the security droids with an Electro Magnetic Pulse grenade, he and Valik managed to capture Torra and bring her back to their ship, where Vonreg later betrayed them and shot Drell and the Trandoshan Skreek.\nDrell was a male Weequay with brown skin, black hair, and gray eyes. He had an attitude problem and had sense of joy from wreaking havoc in the galaxy and shooting down enemies. Gorr trusted him with important missions. Drell had no scruples about kidnapping Torra Doza for the financial benefit of the Warbird gang, who worked as proxies for the First Order.\nDrell usually wore stormtrooper armor and was armed with thermal detonators.\nDrell first appeared in the Star Wars Resistance episode \"Synara's Score.\" He is voiced by David Shaughnessy. At the end of the episode \"The Doza Dilemma,\" a character who looks and sounds the same as him is holding Torra Doza hostage with Valik on Kragan Gorr's pirate ship. However, this was not Drell, as Drell appears in later episodes of the show, and this Weequay at the end of \"The Doza Dilemma\" was shot in the torso and later had their corpse blown up by a First Order shuttle.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Drell_(disambiguation)",
  "/wiki/The_First_Order_Occupation",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/Weequay",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Warbird_gang",
  "/wiki/First_Order",
  "/wiki/Pirate",
  "/wiki/Synara_San",
  "/wiki/Kragan_Gorr",
  "/wiki/Valik",
  "/wiki/Colossus",
  "/wiki/Torra_Doza",
  "/wiki/Standard_year",
  "/wiki/34_ABY",
  "/wiki/Quarren",
  "/wiki/Spy",
  "/wiki/Second_raid_on_the_Colossus",
  "/wiki/Palliduvan",
  "/wiki/Kidnapping_of_Torra_Doza",
  "/wiki/Refueling_station",
  "/wiki/Captain",
  "/wiki/Imanuel_Doza",
  "/wiki/Colossus_loading_docks",
  "/wiki/Doza_Tower",
  "/wiki/Kazuda_Xiono",
  "/wiki/Electro_Magnetic_Pulse_grenade",
  "/wiki/Trandoshan",
  "/wiki/Skreek",
  "/wiki/Hair",
  "/wiki/Stormtrooper",
  "/wiki/Thermal_detonator",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Synara%27s_Score",
  "/wiki/David_Shaughnessy",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/The_Doza_Dilemma",
  "/wiki/Descent_(episode)",
  "/wiki/Kaz%27s_Curse",
  "/wiki/The_Mutiny",
  "/wiki/Databank_(website)",
  "/wiki/The_Triple_Dark",
  "/wiki/StarWars.com"
 ]
}