{
 "name": "Dren_Nord",
 "display_name": "Dren Nord",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Fleet",
      "Alliance Special Operations",
      "Alliance Fleet",
      "Alliance Special Operations"
     ]
    }
   ]
  }
 ],
 "content": "Dren Nord was a male Human who served the Alliance Fleet as a surgeon during the Galactic Civil War. He requested a transfer to Alliance Special Operations, and was placed under the command of Major T'Charek Haathi.\nThe youngest of four children, Nord grew up in a family of politicians. He used his connections to get into one of the best medical schools in the Inner Rim and prestigious intern positions. After the destruction of Alderaan, he was recruited by the Rebel Alliance to head up a surgery team on a medical frigate. While attending to an attractive patient, he learned that she was more impressed by Alliance Special Operations than by medical personnel. This caused Nord to request to be transferred. He used his connections to get assigned to Haathi's team despite his lack of combat skills.\nNord was on Zelos II with the rest of his team to steal a ship. While Ivhin Jayme and Morgan Q. Raventhorn hacked the security systems, he kept an eye on guards patrolling the starport. Being new at field work, he questioned Haathi about her plan to steal the light freighter The Maker. He was nervous about her fixation on the freighter even though it was more closely guarded than other ships in the starport. After Jayme was able to get into the docking bay, he let Nord and the rest of the team in so they could bypass the freighter's security systems and steal it. Nord took cover by a crate and watched the guards to make sure they didn't notice the team. He was concerned that Haathi was taking too many risks and attempted to get Jayme to talk some sense into her. After Haathi was knocked out by the stun steps on the boarding ramp to the freighter, Nord came out of cover to see if she needed medical assistance. This led him to being spotted by the guards who opened fire on the team. During the blaster fight, Nord panicked and changed his blaster settings from stun to kill. Haathi ordered him to change it back and told Jayme to stun the medic if he didn't comply. Nord went back to non-lethal fire, and quickly ran onto the freighter when Haathi ordered her team to get onboard. He went and hid in the back storage bay of the freighter.\nDren Nord was an attractive male and used this to his advantage when making political connections. He was not good at giving or receiving order outside of the operating room and was not particularly adept at combat.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Alliance_Special_Operations",
  "/wiki/Doctor/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Major/Legends",
  "/wiki/T%27Charek_Haathi",
  "/wiki/Inner_Rim",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Hospital_ship/Legends",
  "/wiki/T%27Charek_Haathi%27s_Special_Ops_team",
  "/wiki/Zelos_II",
  "/wiki/Starship/Legends",
  "/wiki/Ivhin_Jayme",
  "/wiki/Morgan_Q._Raventhorn",
  "/wiki/Spaceport/Legends",
  "/wiki/Light_freighter/Legends",
  "/wiki/The_Maker_(YT-1300)",
  "/wiki/Ramp_Entry_Security_System",
  "/wiki/Lightfight",
  "/wiki/Stun/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Dren_Nord",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Special_Ops:_Ship_Jackers",
  "/wiki/Star_Wars_Adventure_Journal_13",
  "/wiki/Special_Ops:_Drop_Points",
  "/wiki/Star_Wars_Adventure_Journal_14"
 ]
}