{
 "name": "Dren_Jamer",
 "display_name": "Dren Jamer",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Dren Jamer was a Human male officer who served in the Imperial Navy during the Galactic Civil War. In 4 ABY when the planet Bakura on the Outer Rim was attacked by the alien Ssi-ruuk, he was second-in-command of the Galactic Empire's military presence in the system, and the captain of the one sizeable capital ship assigned there, the Carrack-class light cruiser Dominant.\nThe most important available source for Jamer's biography is a report on the Bakura incident compiled by Voren Na'al for the Alliance. This was based on Imperial records from the garrison at Bakura, and presented Jamer a meticulous but rather lackluster officer, somewhat dismissvely noting that he had only shown occasional moments of brilliance in a largely unremarkable career. However, the emphases in this account have been filtered through Na'al's prejudices and interpretation, and there is also evidence of factual errors in the piece: Na'al claimed that Captain Jamer was a young man of about thirty, but by his own account, Jamer had been a contemporary of Gilad Pellaeon at the Raithal Academy, which would imply that he was in his fifties or early sixties at this point.\nThe Alliance account states that early in his career, as a young Lieutenant Commander aboard the Star Destroyer Stormclaw, Jamer's meticulous analysis of sensor readings was responsible for detecting and defeating a pirate attack at Jjannex II, which might otherwise have wrecked the ship. He was promoted to join the ship's bridge crew, where he remained for some time without attracting similar attention again, and Na'al says that this set the pattern for his subsequent career.\nReading between the lines, the short and somewhat thickset Jamer was a capable technical specialist, a man whose character was built around an intensely methodical approach to his duty, rather than to initiative or ambition. Aside from the incident aboard Stormclaw, little detail is known of his career until he was transferred to the outpost at Bakura under Commander Pter Thanas, some time after 0 ABY.\nThanas recognized Jamer's abilities, and promoted him to serve as captain of the Dominant under his command. He also picked up on Jamer's enthusiasm for in technical projects and particular the study of deep space, and assigned him the duty of mapping the Bakura system and preparing the system's picket defenses.\nDuring the opetning phase of the Invasion of Bakura, Captain Jamer's picket systems were overwhelmed, though Voren Na'al's dismissal of their performance seems somewhat arch when considering the overwhelming strength of the Ssi-ruuvi attack force compared with the defending Imperial squadron; likewise, Na'al's statement that Jamer was scheduled for disciplining after failing two physicals in succession must be read in a different light when considering that he was not in his thirties, but rather a man of around sixty.\nNevertheless, it is noteworthy that Thanas commanded the defense from the bridge of the Dominant, reducing Jamer to essentially the role of executive officer. When Thanas surrendered the Dominant to the Rebel Alliance, Jamer was one of the majority of Imperial personnel at Bakura who opted to return to Imperial space rather than remain on the planet or join the Alliance. At this point, he disappeared from the Bakuran records available to Na'al, and what little is known of his subsequent movements comes from a personal memorandum written by Jamer himself, preserved along with Na'al's report, but presumably originating independently.\nAfter a debriefing by COMPNOR operatives, in which he indignantly rejected their accusations that he and the other Bakura survivors were Rebel infiltrators, Captain Jamer was appointed to command the Strike-class cruiser Shrike, a larger and more powerful ship than Dominant, apparently part of the fleet regrouping at Annaj. Jamer recorded his dismay at the confusion that Palpatine's death and the Battle of Endor had thrown the Empire into, and also his concerns about the Ssi-ruuk and his fear that the Alliance would adopt their entechment technology and turn it against the Empire.\nHe considered taking his ship—and any others he could persuade to join him—on a rogue strike into Ssi-ruuvi space, but he also expressed his intention to track down his old friend Captain Pellaeon, now commanding the Star Destroyer Chimaera.\nThe seemingly inevitable correction of Captain Jamer's age raises chronological questions about his biography as presented in The Truce at Bakura Sourcebook. The Stormclaw is called an \"Imperial Star Destroyer\", implying that she was an Imperial-class ship and certainly indicating that the incident at Jjannex II took place under the New Order. If this really was early in Jamer's career, however it is likely to have taken place under the Galactic Republic, though the designation \"Star Destroyer\" would hardly be used before the Clone Wars, by which time his contemporary Gilad Pellaeon was already an officer with decades of service behind him. Alternatively, is possible that the incident took place soon after the Declaration of a New Order, early in Jamer's Imperial service, having previously served in the Navy of the Old Republic under Judicial Department authority, or else a local Sector Fleet.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Bakura/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Invasion_of_Bakura",
  "/wiki/Ssi-ruu",
  "/wiki/Captain/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Carrack-class_light_cruiser/Legends",
  "/wiki/Dominant",
  "/wiki/The_Truce_at_Bakura_Sourcebook",
  "/wiki/Voren_Na%27al/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Raithal_Academy/Legends",
  "/wiki/Lieutenant_Commander/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Stormclaw",
  "/wiki/Sensor/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Jjannex_II",
  "/wiki/Commander/Legends",
  "/wiki/Pter_Thanas",
  "/wiki/0_ABY/Legends",
  "/wiki/Bakura_system",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/Strike-class_medium_cruiser",
  "/wiki/Shrike_(Strike-class)",
  "/wiki/Annaj/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Entechment",
  "/wiki/Chimaera/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Judicial_Department/Legends",
  "/wiki/Sector_Fleet",
  "/wiki/The_Truce_at_Bakura",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}