{
 "name": "Dren_Melne%27s_mother",
 "display_name": "Dren Melne's mother",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Melne family"
     ]
    }
   ]
  }
 ],
 "content": "The unnamed woman was Dren Melne's and his younger brother's mother. Both she and her husband were around at the time of Melne's death.\nWhen Dren Melne decided to leave Naboo to become a mercenary and fighter pilot against his family's wishes, she, like the rest of the family developed a strong amount of contempt for him, especially when he returned with a black Flight suit and a Blaster pistol instead of a Hunting rifle as her husband put it. Both she and her spouse blamed Ars Veruna's off-world dealings as part of his influence.\nAt 33 BBY Dren Melne betrayed Essara Till, who was his lover, when he attempted to collaborate with the Governor of Agamar Challep, to steal N-1 fighters for their technology and was killed by his own contractors. When Essara Till relayed this to the family, his mother wasn't surprised to know this but she was hostile to her inquiries and expressed her anger to Till who came in her own flight suit. She would soon watch with pride when her younger son chased Till down the streets of Naboo. Essara Till believed that Melne's family influenced his decision to betray Naboo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Melne_family",
  "/wiki/Dren_Melne",
  "/wiki/Dren_Melne%27s_brother",
  "/wiki/Dren_Melne%27s_father",
  "/wiki/Death/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Flight_suit",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Hunting_rifle",
  "/wiki/Ars_Veruna/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Essara_Till/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Agamar/Legends",
  "/wiki/Challep",
  "/wiki/N-1_starfighter/Legends",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Starfighter_Trap",
  "/wiki/Star_Wars_Gamer_1"
 ]
}