{
 "name": "Dresdema",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human or Dathomirian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Nightsisters"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Nightsisters"
     ]
    }
   ]
  }
 ],
 "content": "Dresdema was a female Nightsister who lived on the planet Dathomir. She was tall and broad-shouldered with gray hair, and her skin was dotted with the blotches characteristic of Dathomiri users of the dark arts.\nThroughout her life, she participated in hundreds of raids and duels, collecting precious gems from them and attaching them to her dyed-black lizard-hide garments. She belonged to a Nightsister clan before it was hunted unto extermination by the Nightsisters' enemies; afterward she led a core group of her clanless sistren. In 43 ABY, her fellow sister Halliava Vurse made contact with Vestara Khai, a member of the Lost Tribe of Sith who had come to Dathomir fleeing the Jedi Luke and Ben Skywalker. Vurse was a double agent who had infiltrated the Raining Leaves Clan of the Witches of Dathomir, and brought Khai into the protection of that tribe after striking a deal with her: The Sith would provide the Nightsisters with a Sith Saber and various weapons in return for a Nightsister. Each group would benefit from new knowledge, and the Sith would aid the Nightsisters in destroying the Raining Leaves Clan and their allies, the Broken Columns Clan.\nDresdema's Nightsisters attacked the two tribes with Rancors using a Control web, but were repelled by a united front that included both Skywalkers. Shortly afterward, she brought seventeen other Nightsisters and twenty-four Rancors to a meadow where the Sith had landed several shuttles. Dresdema intended to kill their Sith allies if any sign of weakness or treachery was shown, and anticipated that only female Sith would arrive. When they were greeted by the Sith Lord Viun Gaalan, she ordered her sisters to attack, and began weaving a spell of flame to use against the male Sith Lord. However, the Sith had been planning to betray the Nightsisters, and were ready for a fight. One of Gaalan's allies used Force lightning against Dresdema before knocking her nearly unconscious with her own spear. Gaalan's Sith quickly killed every Rancor and knocked every Nightsister unconscious; Dresdema was knocked so by a final blast of Force lightning from her attacker. The Nightsisters were then shackled and brought aboard the Sith shuttles, to be taken back to the Sith's homeworld of Kesh.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Human/Legends",
  "/wiki/Dathomirian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Time/Legends",
  "/wiki/Lizard/Legends",
  "/wiki/43_ABY",
  "/wiki/Halliava_Vurse",
  "/wiki/Vestara_Khai",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Jedi/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Skywalker_family/Legends",
  "/wiki/Raining_Leaves_Clan",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Saber",
  "/wiki/Broken_Columns_Clan",
  "/wiki/Rancor/Legends",
  "/wiki/Control_web",
  "/wiki/Shuttle/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Viun_Gaalan",
  "/wiki/Skirmish_in_the_Dathomir_landing_meadow",
  "/wiki/Pyrokinesis",
  "/wiki/Force_lightning/Legends",
  "/wiki/Spear/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Kesh",
  "/wiki/Fate_of_the_Jedi:_Backlash",
  "/wiki/Fate_of_the_Jedi:_Backlash_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Everything_You_Always_Wanted_to_Know_about_the_Nightsisters_but_Were_Afraid_to_Ask",
  "/wiki/Star_Wars_Insider_122"
 ]
}