{
 "name": "Drev_Hassin",
 "display_name": "Drev Hassin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5000 BBY",
      "Phaegon system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Askajian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Relin Druur"
     ]
    }
   ]
  }
 ],
 "content": "Drev Hassin was a male Askajian Padawan who served the Jedi Order and the Galactic Republic during the Great Hyperspace War.\nA Force-sensitive Askajian, Drev Hassin was well-versed in the teachings of his culture despite leaving his homeworld to train in the ways of the Force with the Jedi Order. Selected for one-on-one training by Jedi Master Relin Druur, Hassin became his Padawan and served loyally during the Great Hyperspace War. In 5000 BBY he embarked with Druur on a mission to locate Druur's former Padawan Saes Rrogon, who had fallen to the dark side of the Force. They found him with the Sith Empire and reported their findings back to Coruscant, before tracking him to the Phaegon system. There, Rrogon, in command of the Sith dreadnaught Harbinger, was mining for the powerful Lignan ore on a moon of Phaegon III. Hassin and Druur, piloting an Infiltrator starfighter, ambushed the Sith; Druur infiltrated the Harbinger and attempted to destroy the ship's hyperdrive so that it would not be able to deliver its valuable ore to Sith Lord Naga Sadow while Hassin was assaulted by several Blade-class starfighters deployed by the Harbinger and its sister ship, Omen.\nHassin held off against the enemy fighters for a time while Druur sabotaged the Harbinger's hyperdrive and engaged in a duel with Rrogon. However, Hassin was unable to last, and decided to ram the Infiltrator into the bridge of the Harbinger. The dreadnaught was unable to avoid his suicidal tactic, and Hassin's final act caused the Harbinger to crash into the Omen just as the ships attempted to flee into hyperspace. This caused the Omen to crash-land on the remote world of Kesh, where its survivors remained stranded for thousands of years, while the Harbinger entered an unstable hyperlane which launched them 5,000 years into the future, to 41 ABY. There, Druur, disheartened by Hassin's death, fell to the dark side before confronting Rrogon a second time in a duel which led to both their deaths and the destruction of the Harbinger.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/5000_BBY/Legends",
  "/wiki/Phaegon_system",
  "/wiki/Askajian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Relin_Druur",
  "/wiki/Padawan/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Saes_Rrogon",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Sith_dreadnaught",
  "/wiki/Harbinger_(Sith_dreadnaught)",
  "/wiki/Mining/Legends",
  "/wiki/Lignan",
  "/wiki/Ore/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Phaegon_III",
  "/wiki/Pilot/Legends",
  "/wiki/Infiltrator/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Skirmish_over_Phaegon_III",
  "/wiki/Sith/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Blade-class_starfighter",
  "/wiki/Omen",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Suicide/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kesh",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Hyperlane",
  "/wiki/41_ABY",
  "/wiki/Second_Duel_on_the_Harbinger",
  "/wiki/Lost_Tribe_of_the_Sith:_Precipice",
  "/wiki/Crosscurrent",
  "/wiki/Riptide_(novel)"
 ]
}