{
 "name": "Drewen",
 "display_name": "Drewen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Segredo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light gray"
     ]
    }
   ]
  }
 ],
 "content": "Drewen was a Segredo male who resided during the High Republic Era. While at Kul Kenada Spaceport on the Outer Rim astronomical object Blarrum, Drewen overheard about the monster hunter Ty Yorrick, who had been hired to capture an escaped gundark. Drewen ventured out into the forest to watch Yorrick in action, surprising the hunter as she fought the beast. Despite almost being attacked by the gundark before being saved by Yorrick, Drewen did not mind, amazed by her skill. Yorrick scolded the Segredo for putting himself at risk, leaving on her speeder, but Drewen followed her back to her starship at the spaceport.\nThe Segredo male Drewen lived during the time of the High Republic Era. Between 232 BBY and 231 BBY, Drewen was present at the Kul Kenada Spaceport on Blarrum, an astronomical object in the Outer Rim Territories. While at the spaceport, he heard about the saber-for-hire and monster hunter Ty Yorrick, who had been hired by the beast-trader Triv Blago to capture an escaped prize gundark. Hearing of Yorrick's skill, the Segredo wished to see her in action, following her out into the forest. As Drewen watched Yorrick attempt to wrangle the gundark, the monster hunter was thrown to the ground in front of him. Surprised, Drewen greeted Yorrick, who in turn questioned who he was.\nWith the gundark approaching, however, Yorrick disregarded her question, instructing Drewen to avoid being caught by the creature. The Segredo ran from the gundark, screaming as the beast pursued him. With Drewen in danger, Yorrick—a former Jedi—brought out her lightsaber, cutting off the gundark's head and killing the creature as it closed in on the Segredo. Drewen thanked Yorrick for saving his life, in awe at both her skill and her lightsaber. When Yorrick asked him why he had been there, Drewen told her that he had wanted to watch her at work. Yorrick scolded the Segredo for putting himself at risk as she left on her speeder, but Drewen did not mind, believing his near-death experience was worth it to see Yorrick's skills.\nAfter Yorrick returned to Kul Kenada Spaceport, Drewen followed her. When the monster hunter arrived back at her starship after a brief altercation with Blago, Drewen was hiding behind a stack of crates near the entry ramp. Yorrick subsequently departed aboard her starship, heading for a new job on Loreth.\nDrewen was a Segredo male individual who was referred to by Yorrick as a \"kid.\" He possessed light gray skin on his face, purple hair, and blue eyes. The Segredo was willing to put his life at risk to watch Yorrick capture a gundark, unconcerned by the danger and not minding that the creature nearly killed him. After being saved by Yorrick, Drewen was amazed at her abilities and the use of her lightsaber.\nDrewen wore a light tan shirt with a wide black collar and a plate on the left shoulder, as well as brown pants and a dark gray belt.\nCreated for the Star Wars: The High Republic Adventures — The Monster of Temple Peak comic series, written by Cavan Scott and illustrated by Rachael Stott, Drewen was introduced, albeit unnamed, in the first issue, published by IDW Publishing on August 11, 2021. He was subsequently identified by name in the second issue, published on September 15, 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_3",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_4",
  "/wiki/Segredo",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/High_Republic_Era",
  "/wiki/Kul_Kenada_Spaceport",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Blarrum",
  "/wiki/Species",
  "/wiki/Hunting",
  "/wiki/Ty_Yorrick",
  "/wiki/Gundark",
  "/wiki/Forest",
  "/wiki/Speeder",
  "/wiki/Ty_Yorrick%27s_starship",
  "/wiki/Spaceport",
  "/wiki/Time",
  "/wiki/232_BBY",
  "/wiki/231_BBY",
  "/wiki/Mercenary",
  "/wiki/Merchant",
  "/wiki/Triv_Blago",
  "/wiki/Jedi",
  "/wiki/Ty%27s_lightsaber",
  "/wiki/Death",
  "/wiki/Lightsaber",
  "/wiki/Entry_ramp",
  "/wiki/Starship",
  "/wiki/Loreth",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Star_Wars:_The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Cavan_Scott",
  "/wiki/Rachael_Stott",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_1",
  "/wiki/IDW_Publishing",
  "/wiki/August_11",
  "/wiki/2021",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_2",
  "/wiki/September_15",
  "/wiki/Category:Images_of_Drewen",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Attack_on_Valo",
  "/wiki/Battle_of_Grizal",
  "/wiki/StarWars.com",
  "/wiki/Standard_month"
 ]
}