{
 "name": "Drexl Roosh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "2 BBY",
      "Raxus Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Rodian Salvager's Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Drexl Roosh was a Rodian scavenger leader.\nDrexl was the founder and leader of a group of scavengers that operated on Raxus Prime. He was a vicious Rodian that was motivated by greed. Once allied to the Galactic Empire, he was wanted for at least thirty-eight counts of fraud, selling faulty material and illegal slave trading. To avoid imprisonment, he retreated to Raxus Prime where he oversaw a Rodian salvage operation.\nHe held a deep hatred towards Jawas, even though he employed many as part of his Raxus Prime operation. Despite his bluster, he secretly feared Kazdan Paratus, a mad Jedi that was hiding on the junk world. Drexl preferred to let his troops do his fighting for him. However, if pressed into battle, he often donned heavy armor and wielded a large vibrosword.\nHe and his scavengers fought Darth Vader's secret apprentice, Starkiller during the latter's mission on the scavenger world. When Roosh attempted to demand payment from Marek in exchange for providing Paratus' location, Galen Force choked him into speaking. Drexl vowed revenge, and later he and his men cornered and attacked Marek, also revealing that he recognized Marek as being wanted by the Empire, and also cited his intention of turning him in for a bounty. However, he was defeated in the ensuing duel. Knocked to the ground, he began to laugh maniacally, hoping to distract the Force-user long enough to allow one of his cartel's LAAT gunships to get a fix on him. However, the Sith apprentice attacked the gunship and sent it crashing down on top of Drexl, supposedly killing him.\nOn Starkiller's second visit to Raxus Prime, he fought Drexl and his henchmen in a tunnel leading to his hideout. Drexl was furious that Starkiller had defeated Kazdan Paratus, whose droids kept the Empire away; with him gone, the Empire had stripped Raxus of its metals, leaving little to scavenge. Drexl found a jetpack and tried to escape certain death. Starkiller picked up Drexl and his jetpack with the Force and lifted him far into the air. The Rodian started his jetpack and put it on full throttle to attempt to escape. The young Sith apprentice released his grip and Drexl went speeding to the ground because of the jetpack's force. He hit the ground and the jetpack exploded, finally killing him.\nDrexl's battle differs between the novel and the game. In the game, Drexl is killed when Starkiller throws a gunship on top of him. However, in the novel, he is killed in Starkiller's fight with the Rodian in the tunnels leading to his hideout.\nIn the video game, if the player enter DREXLROOSH as a cheat code, they can play as Drexl.\nHe is possibly named after the drexl beast of Onderon.\nDrexl does not appear in the PC, Xbox 360 or PlayStation3 versions of the game. He only appears in the Playstation 2, Wii and PSP versions, as well as in the novel.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Raxus_Prime/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Rodian_Salvager%27s_Cartel",
  "/wiki/Galen_Marek",
  "/wiki/Scavenger/Legends",
  "/wiki/Drexl_Roosh%27s_gang",
  "/wiki/Slavery/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Kazdan_Paratus",
  "/wiki/Jedi/Legends",
  "/wiki/Vibrosword/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Low_Altitude_Assault_Transport/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Death/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Drexl",
  "/wiki/Onderon/Legends",
  "/wiki/The_Force_Unleashed_(novel)",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/Star_Wars:_The_Force_Unleashed:_Prima_Official_Game_Guide",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}