{
 "name": "Drolen_Antig",
 "display_name": "Drolen Antig",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Celanon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nalroni"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  }
 ],
 "content": "Drolen Antig was a Nalroni male smuggler and thief. The goods he smuggled included jellied canron and spice, and the criminal operated along routes such as the Kessel Run. After the Galactic Empire's defeat at the Battle of Endor in 4 ABY, Antig was involved in the theft and sale of stolen starship and weapons technology to Kuat Drive Yards. With his crew and a trio of hired Advosze thieves, the smuggler stole the technology from Slayn \u0026 Korpil's facility in the Roche asteroid field, following which he murdered the Advoszec and dumped their bodies, thereby receiving the whole payout for the job. Antig's crimes put him on the radar of New Republic General Airen Cracken, who was concerned that Kuat Drive Yards would use the technology to benefit the Empire, and he profiled the Nalroni in the datafile Wanted by Cracken.\nA Nalroni male, Drolen Antig hailed from the Outer Rim world of Celanon. He became a smuggler and con artist in his adult life, working smuggling routes such as the Kessel Run, the Sisar Run, and the Sanrafsix Corridor. By the age of thirty-two, Antig had smuggled a diverse variety of goods, which included spice and jellied canron, as well as ferried weapons to a Rebel Alliance cell in Corint City on the Outer Rim planet Pirik.\nAntig ran with a crew of approximately thirty lowlifes and criminals who were loud and crude but worked well together—however, none of them entirely trusted the Nalroni. At one point, Antig also worked with a group of at least three Advosze thieves during a job on the Core World of Fresia. On another occasion, Antig stole a pair of trousers from a Corellian.\nFollowing the Galactic Empire's defeat at the Battle of Endor in 4 ABY, Antig returned to his homeworld of Celanon, relaxing for a while prior to resuming his smuggling. Before long, Antig was contracted by starship and walker manufacturer Kuat Drive Yards. The corporation was stepping up production and improving the effectiveness of its products, and it hired Antig to acquire new technology to optimize their output as the Empire lost—and therefore needed—more ships.\nAccording to rumors circulating around the bar scene, three of the Advosze thieves with whom Antig had collaborated with on Fresia were planning a heist on the Mid Rim Roche asteroid field, which had allied itself with the ascendant New Republic. The criminals needed a transport, so Antig offered them passage on his own ship, the Etti Lighter Trustworthy.\nAntig arranged a deal with his old accomplices: they would infiltrate the hives of the manufacturer Slayn \u0026 Korpil, steal valuable items, and sell them to Kuat Drive Yards for a substantial remuneration. The heist was a success, with the Advoszec acquiring valuable items—namely, various prototype weapons systems and four gyroscopic stabilizers, which were used in the B-wing starfighter and were a highly guarded technological secret. However, Antig and his crew killed the Advoszec aboard the Trustworthy minutes before reaching the shipyards at the Core World of Kuat, later jettisoning their bodies in the nearby Relarr system in the Core. Having done away with the thieves, Antig stood to receive the full payment from Kuat Drive Yards for delivering the technology.\nNew Republic forces attempted to locate and detain Antig, who had been spotted without his ship and crew in the Ethav Regions in Wild Space following the heist. Furthermore, the New Republic resolved to retrieve the stolen components before Kuat Drive Yards could use the technology in designs for the Empire; efforts were made to organize a SpecForce infiltration mission into Kuat Drive Yards to recover the equipment, but such a dangerous endeavor would take time to prepare.\nThe situation was fueled by the New Republic's fears that Kuat Drive Yards would use the technology to develop a new Imperial assault starfighter using the materials sold to them by Antig. His actions and the threat they posed were detailed by New Republic General Airen Cracken in an entry dedicated to Antig within an update to the datafile Wanted by Cracken, which was compiled in 7 ABY. The entry also detailed Antig's crimes, which included smuggling, being an accessory to smuggling stolen goods, murder, treason, theft of New Republic military property, and aiding Imperial forces. Cracken also offered a reward of twenty thousand credits for Antig's capture, describing his actions as despicable.\nStreetwise and sneaky, Antig was a highly dangerous and self-interested being. Not above the act of murder to get what he wanted, he killed three of his accomplices so as to receive the entire reward amount from the heist at Roche. In his middle age, Antig stood at 1.6 meters, had gray fur, and was missing several teeth by the time he was spotted in the Ethav Regions; those were believed by Cracken to have been lost in a struggle with one of the Advoszec he murdered during the Roche operation.\nAntig was a cunning haggler and a seasoned gambler. In addition, he possessed reasonable engineering and piloting skills—his main specialty was operating the Etti Lighter—as well as knowledge of languages and star systems. Brawling and slicing were also in his skillset, along with astrogation and capital ship shield and gunnery proficiency.\nArmed with a long blaster carbine and pistol, Antig also possessed a comlink and datapad along with seven hundred credits, and wore a green jacket over a webbed string vest. Completing Antig's ensemble was a pair of trousers stolen from a Corellian; the trousers featured the broken gold streak of the Second Class Corellian Bloodstripe. Several rings adorned the fingers of his right paw.\nAntig also piloted the Etti Lighter Trustworthy, which was believed by Cracken to have been stolen from the Corporate Sector Authority some time before Antig came to the New Republic's attention. The ship had served Antig well in the brief period he had owned it due to its large cargo capacity and ample weaponry.\nDrolen Antig was introduced in the \"Wanted by Cracken\" segment of the Star Wars Adventure Journal magazine's tenth issue, published by West End Games and released in May 1996. An expansion of the original Wanted by Cracken reference book, the segment was written by Craig Robert Carey and illustrated by Kathy Burdette.\nOriginally pictured in monochrome, Antig was fully colored in the \"Featured Artist: Kathy Burdette\" featurette of the Star Wars Adventure Journal's eleventh issue, released in November 1996. However, he was depicted with gray fur there, contradicting the \"orange-red\" color described by Cracken's dossier in the tenth issue. This article assumes that the featurette's illustration depicts Antig's correct fur color.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Celanon/Legends",
  "/wiki/Nalroni/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Jellied_canron",
  "/wiki/Spice/Legends",
  "/wiki/Hyperlane",
  "/wiki/Kessel_Run/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Heist_at_the_Roche_asteroid_field",
  "/wiki/Starship/Legends",
  "/wiki/Weapon/Legends",
  "/wiki/Kuat_Drive_Yards/Legends",
  "/wiki/Advozse/Legends",
  "/wiki/Slayn_%26_Korpil/Legends",
  "/wiki/Roche_asteroid_field",
  "/wiki/Death/Legends",
  "/wiki/Currency/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Datafile/Legends",
  "/wiki/Wanted_by_Cracken",
  "/wiki/Homeworld/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Con_artist/Legends",
  "/wiki/Sisar_Run/Legends",
  "/wiki/Sanrafsix_Corridor",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Corint_City",
  "/wiki/Pirik",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Fresia/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Transport/Legends",
  "/wiki/Etti_Lighter",
  "/wiki/Trustworthy_(Etti-class)",
  "/wiki/Gyroscopic_stabilizer",
  "/wiki/A/SF-01_B-wing_starfighter/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Shipyard/Legends",
  "/wiki/Kuat/Legends",
  "/wiki/Relarr_system",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/Ethav_Regions",
  "/wiki/Wild_Space/Legends",
  "/wiki/New_Republic_Special_Forces",
  "/wiki/Time/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Hair/Legends",
  "/wiki/Tooth/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Language/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Slicer/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Gunner/Legends",
  "/wiki/Blaster_carbine/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Credit_chip/Legends",
  "/wiki/Jacket/Legends",
  "/wiki/Corellian_Bloodstripe",
  "/wiki/Ring/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Corporate_Sector_Authority",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/West_End_Games",
  "/wiki/May",
  "/wiki/1996",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/Craig_Robert_Carey",
  "/wiki/Kathy_Burdette",
  "/wiki/Featured_Artist:_Kathy_Burdette",
  "/wiki/Star_Wars_Adventure_Journal_11",
  "/wiki/November",
  "/wiki/The_Essential_Atlas",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Star_Wars_Adventure_Journal_1",
  "/wiki/Standard_year/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}