{
 "name": "Dron_Ryall",
 "display_name": "Dron Ryall",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Sienar Fleet Systems"
     ]
    }
   ]
  }
 ],
 "content": "Dron Ryall was a male human. He was one of the leading designers of Sienar Fleet Systems, a manufacturing company affiliated with the Galactic Empire. At some point following the Siege of Lothal, he worked at Sienar's factory on Absanz. One day, Ryall stumbled upon Kanan Jarrus and Garazeb Orrelios, two notorious enemies of the Empire, who were searching the facility for intelligence on Sienar's most recent prototypes. In spite of Ryall's claim that he was \"just a humble employee,\" the intruders realized who he really was, and they decided to capture him. Although the factory was full of stormtroopers, Jarrus and Orrelios did manage to steal a Sentinel-class landing craft and take the designer on board. The craft was barely in the air when an Imperial Gozanti-class cruiser attacked, causing Ryall to fall through the boarding hatch, but Orrelios caught his hand just in time. The designer, however, convinced the rebel to let him go, arguing that many lives would be lost in the Empire's pursuit of him. Against the instructions of Jarrus, Orrelios finally let go of Ryall, who crashed safely on a railing below.\nDron Ryall was named after Chris Ryall, Chief Creative Officer and Editor-in-Chief of IDW Publishing.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Sienar_Fleet_Systems",
  "/wiki/Siege_of_Lothal",
  "/wiki/Sienar_Fleet_Systems_factory",
  "/wiki/Absanz",
  "/wiki/Kanan_Jarrus",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Spectres",
  "/wiki/Stormtrooper",
  "/wiki/Sentinel-class_landing_craft",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/IDW_Publishing",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/Secrets_of_Sienar",
  "/wiki/Star_Wars_Rebels_Magazine_13",
  "/wiki/Martin_Fisher"
 ]
}