{
 "name": "Drooga",
 "display_name": "Drooga",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Maroon"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Drooga, nicknamed \"The Great Feastmaster,\" was a rich Hutt with notoriously extravagant tastes who lived on Nar Shaddaa at the time of the Cold War.\nNot content to remain in one place, Drooga—who often wore a computer interface lens over one eye—flitted about the moon in his luxurious pleasure barge, pursuing whatever whim amused him most at the moment. In keeping with his namesake, he threw enormous feasts, sometimes consisting of twenty-seven courses or more.\nThe origins of Drooga's immense wealth remain a mystery, but his lavish spending was legendary on Nar Shaddaa, as was his insatiable appetite for new and unusual entertainment. It was said a person's ability to amuse Drooga was the only barrier to entry onto his pleasure barge. However, as quick as he was to allow anyone into his presence for his own entertainment, Drooga was just as quick to grow tired of people, even the most freakish and outrageous members of his retinue.\nAt one time, the Devaronian con artist Tyresius Lokai crossed Drooga. After faking his death, Lokai, now Gault Rennow, had his dead duplicate held at an auction for his former enemies. Among the bidders, Drooga was one of six Hutts to attend there.\nDrooga made a bargain with a Human smuggler named Risha to provide a prototype starship engine in exchange for an extremely rare creature called a shanjaru. Risha acquired what was purported to be the last male shanjaru in the galaxy. A notable smuggler captain met with Drooga on his pleasure barge, only to find him unwilling to make the trade because Drooga's female shanjaru had been stolen, and Drooga wanted a matching set of the creatures or nothing. The smuggler worked out a deal with Drooga's assistant Ga'ram by which he would retrieve the female and complete the set, compelling Drooga to honor his deal. Inevitably, it turned out that the rapacious Hutt had no intention of repopulating the species, but merely feasting on them, in what he considered to be the most unique meal he could ever have.\nDrooga kept Bowdaar the Wookiee as his pet gladiator to work off the debts of a gambler. He kept Bowdaar in a cage between matches and used him cruelly and pettily. Drooga was annoyed that Bowdaar slew all his opponents too quickly, depriving him of the full entertainment value of the fights. He took many steps to keep Bowdaar at a disadvantage, such as depriving him of any weapons and draining half his blood to keep him weak, and even poisoning him outright. Finally, Drooga decided to do away with the Wookiee in one last magnificent fight to the death with his pet gundark, which he had kept starving for the occasion.\nThe smuggler captain assisted Bowdaar in his fight with the gundark, with simultaneously infuriated Drooga while also providing him with suitable entertainment for the evening. Once the gundark was dead, Drooga decided that the Wookiee was no longer worth the costs to maintain him and simply turned him loose.\nOne of the greatest feats of sterilization in the galaxy was achieved during Drooga's 600th birthday party. A single vibromop successfully cleaned up after the celebration, despite being designed only for smaller household tasks. To celebrate the vibromop, which did not survive the ordeal, Drooga's janitors held a private ceremony to honor the tool's service.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Computer/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Drooga%27s_pleasure_barge",
  "/wiki/Devaronian/Legends",
  "/wiki/Con_artist/Legends",
  "/wiki/Gault_Rennow",
  "/wiki/Human/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Risha_Drayen",
  "/wiki/Starship/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Shanjaru",
  "/wiki/Gender/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Voidhound",
  "/wiki/Ga%27ram",
  "/wiki/Species/Legends",
  "/wiki/Bowdaar",
  "/wiki/Wookiee/Legends",
  "/wiki/Gladiator/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Death/Legends",
  "/wiki/Gundark/Legends",
  "/wiki/Vibromop",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}