{
 "name": "Drua",
 "display_name": "Drua",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "14 BBY",
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Drua was a female Twi'lek who lived on Ryloth in a remote village settlement, along with her grandfather. Some five years following the end of the galactic conflict known as the Clone Wars, Drua came upon the Emperor Darth Sidious and his Sith apprentice Darth Vader as they escaped from the lylek caves of Ryloth. Unaware of their identities or of the ongoing skirmish on Ryloth, Drua welcomed the two Sith Lords and the Royal Guard Erstin Deez to her village, where the Free Ryloth Movement later attacked the Imperial trio. Although Drua, her grandfather, and the rest of her village fled into the nearby mining shelter for safety during the attack, the Emperor—seeing them all as living witnesses—had Vader kill the Twi'lek villagers, including Drua, once the Free Ryloth movement had been neutralized.\nDrua was native to the planet Ryloth, homeworld of the Twi'leks. Drua never knew her father, and her mother died some three years following the end of the galactic conflict known as the Clone Wars. Drua lived with her grandfather in a remote village settlement, which had been formed in the wilderness by Twi'leks that had once been escaped mining slaves and may have been refugees of the Clone Wars.\nAround five years after the end of the Clone Wars, which had seen the rise of the Galactic Empire, Drua was in the forests near her village checking on hunting traps when she heard an explosion come from the nearby caves. She explored the incident and witnessed the Galactic Emperor Darth Sidious, his Sith apprentice Darth Vader, and the Royal Guard Erstin Deez exiting a cavern's tunnel. However, the trio, whom had just destroyed a lylek hive in the caves, were unknown to Drua, as she and the rest of her village were unaware of the events of the world outside of their settlement. Instead, Drua believed the trio had either crashed in a starship or was simply lost and needed assistance.\nIn an attempt to eliminate Drua, the Emperor used a mind trick with the Force to compel Drua to come to him, as he planned to strike her down with his lightsaber. Vader, however, intervened, and acted preemptively against his Sith Master, stopping the Emperor's blade from striking the Twi'lek down. Vader suggested—while Drua was still absent-minded due to the Emperor's mind trick—that her village could be of use to them, as the trio had been traversing the caves to avoid their hunters, the members of the Free Ryloth Movement who sought to assassinate them. The Emperor agreed and compelled Drua to lead the Imperial trio to her village.\nDrua discussed some of her personal life with the Emperor as they made their way through the forest, after which they traversed through hills and a quarry on the way to the village. At the foot of the quarry, Drua introduced the trio to Narmn, who guarded the outskirts of the village. The Emperor introduced himself and Vader as \"Krataa\" and \"Irluuk,\" in reality meaning \"death\" and \"fate\" in old Sith tongue, as Deez was introduced as Sergeant, his officer rank. Narmn, like Drua, welcomed the three into their village, as deemed by customary traditions.\nIn the village, Drua introduced the Emperor, Vader, and Deez to the rest of the villagers—which included her grandfather, Mala, and the pregnant Naria—before her people celebrated their guests with music and food. As the Twi'leks gathered with the Imperials, the Emperor had Drua bring Vader the village's broken communicator to have the Sith repair it, which Vader promptly did, impressing Drua. As communications had returned for the Empire, having previously been knocked out by the Free Ryloth rebels, Deez hailed the Ryloth Moff Delian Mors on the comlink to rendezvous with the Moff's forces.\nIn the midst of the village celebrations, Drua and the others were alarmed by the sudden barrage of blaster bolts grazing their buildings and setting some of them on fire. These were warning shots from Cham Syndulla and his Free Ryloth movement, as the group had finally caught up with the Emperor's company and sought to bring no harm to the villagers. As the villagers fled into the nearby mining tunnels, the village's fortified hideout, Drua tried to bring the trio with her by tugging at Vader's cape. The Emperor refused, however, and instead commanded Vader to eliminate the rebels while Deez stayed by his side. Vader pushed Drua away, which angered her, just before the Twi'lek girl joined her village in the tunnels.\nIn the brief skirmish that followed, Drua and her fellow villagers witnessed Vader strike down countless members of the Free Ryloth movement before ultimately defeating them in battle. Once the battle ended, Vader executed one of the movement's leaders, a Twi'lek named Isval, before the Emperor told his apprentice that Drua and her people were living witnesses to what had transpired and that they had to be eliminated. Vader obeyed his Master and entered the tunnels alone, where he slaughtered all of the villagers, including Drua.\nDrua was a curious Twi'lek, as she actively sought the source of the explosion near the lylek caves before she encountered Darth Vader and the Emperor. Drua also followed her Twi'lek customs when she welcomed the Imperial strangers to her village, having no knowledge on any of their identities whatsoever, which displayed her own naïvety. This was, however, due to her village's remoteness and lack of communication with the world outside of it. Similarly, Drua was unable to resist the persuasive Force powers of the Emperor when he compelled her mind to obey him, remaining without thought even as he and Vader dueled before her.\nPhysically, Drua had the distinctive lekku of a Twi'lek and green-colored skin. At the time of her death, Drua appeared to be of an adolescent age and had a discernible accent when speaking in Galactic Basic Standard. She also spoke and understood her native tongue, Ryl.\nDrua wore a parka to shield herself from the constant rain or wind of Ryloth, and carried a backpack for her gear and a lylek tube, which was a wooden sound instrument used to keep lyleks away. She also kept a holstered blaster pistol from the bygone Clone Wars.\nDrua made her first appearance in the new canon Star Wars novel Lords of the Sith, released in 2015 and written by Paul S. Kemp.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ryloth",
  "/wiki/14_BBY",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Drua%27s_Village",
  "/wiki/Drua%27s_grandfather",
  "/wiki/Standard_year",
  "/wiki/The_galaxy",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_apprentice",
  "/wiki/Anakin_Skywalker",
  "/wiki/Lylek",
  "/wiki/Cave",
  "/wiki/Mission_to_Ryloth",
  "/wiki/Sith_Lord",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Erstin_Deez",
  "/wiki/Free_Ryloth_Movement",
  "/wiki/Galactic_Empire",
  "/wiki/Mining",
  "/wiki/Death",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Parent",
  "/wiki/Drua%27s_mother",
  "/wiki/Slavery",
  "/wiki/Refugee",
  "/wiki/Imperial_Era",
  "/wiki/Starship",
  "/wiki/Mind_trick",
  "/wiki/The_Force",
  "/wiki/Lightsaber",
  "/wiki/Sith_Master",
  "/wiki/Narmn",
  "/wiki/Sith_tongue",
  "/wiki/Sergeant",
  "/wiki/Officer",
  "/wiki/Mala_(Twi%27lek)",
  "/wiki/Reproduction",
  "/wiki/Naria",
  "/wiki/Foodstuff",
  "/wiki/Comlink",
  "/wiki/Sith",
  "/wiki/Moff",
  "/wiki/Delian_Mors",
  "/wiki/Blaster",
  "/wiki/Fire",
  "/wiki/Cham_Syndulla",
  "/wiki/Isval",
  "/wiki/Force_power",
  "/wiki/Lightsaber_combat",
  "/wiki/Lekku",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Twi%27leki",
  "/wiki/Lylek_tube",
  "/wiki/Blaster_pistol",
  "/wiki/Star_Wars",
  "/wiki/Lords_of_the_Sith",
  "/wiki/2015",
  "/wiki/Paul_S._Kemp",
  "/wiki/Lords_of_the_Sith_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/StarWars.com"
 ]
}