{
 "name": "Druno_Kener",
 "display_name": "Druno Kener",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Druno Kener was a Human male CorSec officer who lived on Corellia during the time of the Galactic Civil War.\nBy the time following the Battle of Yavin, Druno Kener was a technical officer in the Corellian Security Force and was based in the city of Coronet on Corellia.\nIn 1 ABY, the CorSec received reports of hostile Clone Wars-era battle droids active in the Bindreg Hills. A group led by Lieutenant Varias, including Druno Kener, Officers Hirka, Mener and Savas, and several CorSec troopers, was dispatched from Coronet to investigate. The unit discovered an old and fully automated droid factory, presumably built in secret by the Separatists during the Clone Wars. The CorSec ignored that the factory had been reactivated by IG-88 for his project of Droid Revolution.\nAs the technical officer of Lieutenant Varias's unit, the primary mission of Druno Kener was to find a way to shut down the facility. Nevertheless, the man was first tasked to re-establish communication with the CorSec Headquarters in Coronet. The old machinery in the factory was interfering with communications and the CorSec transmitter was not strong enough to pass through. Druno Kener therefore tasked a spacer to reactivate the emergency power generator of the factory and an old antenna relay for the use of CorSec forces. Upon the communications were restored, Kener focused on shutting down the factory. He ordered a spacer to access the manual override terminals throughout the facility. Once the terminals were activated, Druno Kener was able to directly access the factory's security systems. Unfortunately, the officer was not able to shut down the facility but only disable its backup systems, preventing re-activation of the factory once it would be shut down. Druno Kener and Lieutenant Varias finally dispatched spacers to access the control override terminal in the depths of the facility. The spacer finally reached the terminal in the command center and effectively shut down the Corellia Droid Factory.\nDruno Kener was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Druno Kener was added to the game as part of the \"Corellian Droid Factory\" arc with the release of the \"Game Update 12\", on August 10, 2009.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Corellia/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Varias",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Technical_officer",
  "/wiki/Coronet_City/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Bindreg_Hills",
  "/wiki/Officer/Legends",
  "/wiki/Hirka",
  "/wiki/Mener",
  "/wiki/Jornel_Savas",
  "/wiki/Corellia_Droid_Factory",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/IG-88A/Legends",
  "/wiki/Droid_Revolution",
  "/wiki/One_CorSec_Plaza",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_10",
  "/wiki/2009",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}