{
 "name": "Dryden_Vos",
 "display_name": "Dryden Vos",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "10 BBY",
      "First Light",
      "Savareen"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.92 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Crimson Dawn",
      "Shadow Collective"
     ]
    }
   ]
  }
 ],
 "content": "Dryden Vos was a male near-human who served as the public face of the crime syndicate Crimson Dawn during the reign of the Galactic Empire. He owned the First Light, and possessed a large quantity of wealth as Crimson Dawn's figurehead leader. He recruited the Corellian Qi'ra to be his Lieutenant, and hired Beckett's gang to steal coaxium for him. When he tried to kill Han Solo, he was betrayed by Qi'ra, and the two engaged in a quick duel which resulted in Dryden Vos being stabbed and killed.\nDryden Vos was the public face of the crime syndicate Crimson Dawn, one of the most ruthless criminal syndicates in the galaxy during the Clone Wars and the reign of the Galactic Empire. However, he secretly answered to the Zabrak crime lord known as Maul, the true leader of Crimson Dawn. To communicate with Maul, Vos used a ring to activate the hologram panel. Vos owned a Kalevalan yacht known as the First Light, where he had a study filled with several relics, including a slab of an obsidian stone he plundered from a Sith temple. During the Clone Wars, he was a rising star in the criminal underworld of the galaxy, becoming a key leader for Crimson Dawn and a lieutenant in Maul's Shadow Collective alliance.\nIn 19 BBY, during the final days of the Clone Wars, Vos was contacted by Maul via hologram, alongside Marg Krim of the Pyke Syndicate and Ziton Moj of the Black Sun. All leaders in the Shadow Collective, they were instructed by their master to go into hiding, as Maul had foreseen the imminent end of the war, and the chaos that would follow, leading to the creation of the Galactic Empire.\nDuring his tenure as crime lord, sometime after 13 BBY, Dryden Vos bought the Corellian Qi'ra from Sarkin Enneb, who in turn bought her from Lady Proxima, the ruthless Grindalid crime boss of the White Worms gang, who sold Qi'ra after her attempted escape from Corellia. As such, Vos demanded in return her lifelong loyalty to Crimson Dawn, branding her forearm and her neck with his organization's symbol. Qi'ra became his top lieutenant. He even trained her in martial arts, including Teräs Käsi. After Qi'ra became skilled in such arts, she killed Enneb. At some point, Vos additionally made an uneasy alliance with the Pyke Syndicate. On one occasion too, Vos had raided a warehouse of the Razzi Syndicate and seized low-grade andris spice, leading him to consider \"squeezing\" the Hutt Zorba to find what he knew about the spice's provenance.\nTen years before the Battle of Yavin, the scoundrel Tobias Beckett became indebted to Vos, promising him a good amount of coaxium as payment. Prior to his indebtedness, Beckett killed the bounty hunter Aurra Sing under Vos' orders, something which pleased Vos enough to give Beckett a bonus. Beckett and his crew attempted to steal a container full of coaxium that belonged to the Empire from a conveyex transport. Unfortunately for Beckett, the heist ultimately failed due to the intervention of Enfys Nest and her swoop pirate gang, the Cloud-Riders, costing him the cargo and two of his teammates, his lover Val and the Ardennian pilot Rio Durant. However, his recruit, the young Han Solo, insisted that he meet Vos to talk with him about what had happened.\nUpon arriving at Vos' yacht, as Han reunited with Qi'ra, Vos received Beckett and expressed his condolences for the loss of Val, revealing that he knew what happened with the conveyex heist. In his office, Vos told Beckett that he needed to face his wrath for having failed him once more, but Solo attempted to convince Vos to give Beckett another opportunity by sending them to the spice mines of Kessel to steal the coaxium stored there. At first, Vos rejected the plan because he didn't want to anger the Pykes, but Qi'ra ultimately convinced him that it was a good idea.\nIn order to attack the spice mines of Kessel, Beckett's crew enlisted the help of the smuggler and sabacc player Lando Calrissian and his droid L3-37, who brought them to Kessel aboard the Millennium Falcon. There, Beckett's crew infiltrated Kessel's spice mines, took down Quay Tolsite and his guards and managed to steal the coaxium, at the cost of L3-37's destruction. After escaping from the Empire's clutches once more in the Maw Cluster, making the Kessel Run in just twelve parsecs, the crew arrived at Savareen to refine the coaxium. After Lando departed with the Falcon and the crew encountered Nest, learning of her intentions to help the rebellion with the coaxium, Solo decided to deceive Vos and give the coaxium to the Cloud-Riders. He and Qi'ra took the coaxium to Vos, telling him that Beckett did not survive the mission.\nTo their surprise, Vos revealed that he knew the coaxium aboard his yacht was fake, and that he was warned by his \"inside man\" about Han's betrayal. Though Han initially believed that Qi'ra betrayed them, Vos revealed that his \"inside man\" was in fact Beckett, who decided to betray his crew so that Vos spared his life. However, as they anticipated Beckett's betrayal, Solo had presented the true shipment of coaxium to Vos, and had only told Beckett it was fake. Nevertheless, Beckett resolved to take Chewie hostage and escape with the real coaxium, leaving Vos to face Qi'ra and Han, leading to a fight in which Vos accidentally destroyed several artifacts in his study, including the masthead of Xim the Despot. In the midst of Han and Vos' attempts to kill each other, Qi'ra came to Han's defense by attacking Vos with a vibrocutlass retrieved from the corpse of Toht Ra, one of the Hylobon Enforcers. In the fierce scuffle between the two, Vos cut the blade of his opponent's sword in half, which resulted in his own weapon getting stuck in it. Unarmed and defenseless, Vos was finally impaled by Qi'ra and dropped to the floor, dead. After promising Han that she would take valuables from the yacht and meet him outside, Qi'ra instead sealed the room after Han's departure and used Vos' ring to falsely tell Maul that Tobias Beckett had been responsible for Vos' death, and was ordered to take the yacht to Dathomir.\nA near-human male crime lord, Dryden Vos was a pitiless enforcer and known as a gangster of taste and wealth. Vos socialized with the galaxy's elite aboard his yacht the First Light, surrounding himself with opulence. In addition, Vos enjoyed showing off his superb collection of antiquities. His wealth and status was also displayed in the food he enjoyed, including delicacies such as colo claw fish eggs. Being near-human, Dryden had a number of alien attributes such as a claw that extended from his thumb and many intricate striations ran along his face that were connected to the activity in his circulatory system and adrenaline levels. In moments of stress and rage, Dryden's scar-like marks would become more pronounced and bright and his eyes would appear bloodshot.\nThough Vos was known for being ruthless, albeit not a cutthroat, he displayed good manners with his guests, as he showed when he met Han Solo. However, his manners weren't to be mistaken for weakness, as he could change from a generous host to merciless killer in a moment. Beyond that, however, Vos was simply one more lackey of the crime lord Maul, the true leader of Crimson Dawn behind the shadows.\nDryden Vos was portrayed by Paul Bettany in the 2018 Star Wars Anthology film Solo: A Star Wars Story. The character was originally going to be played by Michael Kenneth Williams as a motion-captured alien character resembling a mountain lion, but when the original directors Phil Lord and Christopher Miller were fired from the project and replaced by Ron Howard, Williams wasn't available for extended reshoots due to scheduling conflicts with The Red Sea Diving Resort, and the part was recast. Though he has the same last name as Jedi Master Quinlan Vos, Lucasfilm Ltd. has confirmed that this is merely a coincidence.\nOne of the inspirations for Dryden Vos was the character Leo from Michael Mann's 1981 film Thief. Coincidentally, Leo's portrayer Robert Prosky collaborated along Solo director Ron Howard in the 1992 film Far and Away. Another of the character's influences was Don Draper, the protagonist of AMC's drama series Mad Men. The first draft of the film's script described Vos like a sort of Tom Hagen, one of the main characters of The Godfather film series. Interestingly, the original Star Wars films inspired Bettany to become an actor in the first place. The film's crew wanted Vos to be, physically, the antithesis of Jabba Desilijic Tiure, the Hutt crime lord of 1983's Star Wars: Episode VI Return of the Jedi.\nEarly concept art for Vos depicted him as an avian alien, then a reptilian alien, and finally a Lasat, which was possibly the version depicted originally by Williams. In the original draft of the film's script, Vos was going to be based on Taanab. According to Paul Bettany, Vos' facial marks were done by CGI and that he just discovered it when Howard sent him a photograph. The facial marks, which turn red when Dryden gets angry, are similar to those possesed by Naare, a character from LEGO Star Wars: The Freemaker Adventures, a Star Wars TV series which began in 2016, two years prior to Solo: A Star Wars Story. The similarity was noted by Leland Chee, a member of the Lucasfilm Story Group, but he made sure to mention this did not make the two canonically related.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Vos",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Bounty_Hunters_14",
  "/wiki/Doctor_Aphra_(2020)_21",
  "/wiki/Crimson_Reign_3",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/10_BBY",
  "/wiki/First_Light",
  "/wiki/Savareen",
  "/wiki/Near-human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Crimson_Dawn",
  "/wiki/Shadow_Collective",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Corellia",
  "/wiki/Qi%27ra",
  "/wiki/Lieutenant_(criminal)",
  "/wiki/Beckett%27s_gang",
  "/wiki/Coaxium",
  "/wiki/Han_Solo",
  "/wiki/Rook_Kast",
  "/wiki/The_galaxy",
  "/wiki/Clone_Wars",
  "/wiki/Zabrak",
  "/wiki/Crime_lord",
  "/wiki/Maul",
  "/wiki/Dryden_Vos%27_signet_ring",
  "/wiki/Hologram",
  "/wiki/Kalevala",
  "/wiki/Yacht",
  "/wiki/Obsidian",
  "/wiki/Unidentified_Sith_temple",
  "/wiki/19_BBY",
  "/wiki/Standard_day",
  "/wiki/Cloning",
  "/wiki/Marg_Krim",
  "/wiki/Pyke_Syndicate",
  "/wiki/Ziton_Moj",
  "/wiki/Black_Sun",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/13_BBY",
  "/wiki/Corellian",
  "/wiki/Sarkin_Enneb",
  "/wiki/Lord",
  "/wiki/Proxima",
  "/wiki/Grindalid",
  "/wiki/White_Worms",
  "/wiki/Ter%C3%A4s_K%C3%A4si",
  "/wiki/Razzi_warehouse_raid",
  "/wiki/Razzi_Syndicate",
  "/wiki/Andris",
  "/wiki/Spice",
  "/wiki/Hutt",
  "/wiki/Zorba",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Tobias_Beckett",
  "/wiki/Bounty_hunter",
  "/wiki/Aurra_Sing",
  "/wiki/Heist_on_Vandor",
  "/wiki/ICC-5537",
  "/wiki/20-T_Railcrawler_conveyex_transport",
  "/wiki/Enfys_Nest",
  "/wiki/Swoop",
  "/wiki/Pirate",
  "/wiki/Cloud-Riders",
  "/wiki/Val",
  "/wiki/Ardennian",
  "/wiki/Rio_Durant",
  "/wiki/Spice_mines_of_Kessel",
  "/wiki/Kessel",
  "/wiki/Pyke",
  "/wiki/Smuggler",
  "/wiki/Sabacc",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Droid",
  "/wiki/L3-37",
  "/wiki/Millennium_Falcon",
  "/wiki/Raid_on_Kessel",
  "/wiki/Quay_Tolsite",
  "/wiki/Pyke_sentinel",
  "/wiki/Maw_Cluster",
  "/wiki/Kessel_Run",
  "/wiki/Parsec",
  "/wiki/Showdown_on_Savareen",
  "/wiki/Masthead_of_Xim_the_Despot",
  "/wiki/Vibrocutlass",
  "/wiki/Toht_Ra",
  "/wiki/Hylobon_Enforcers",
  "/wiki/Death",
  "/wiki/Dathomir",
  "/wiki/Diles_Anevi",
  "/wiki/Gangster",
  "/wiki/Colo_claw_fish",
  "/wiki/Paul_Bettany",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Michael_Kenneth_Williams",
  "/wiki/Phil_Lord",
  "/wiki/Christopher_Miller",
  "/wiki/Ron_Howard",
  "/wiki/Jedi_Master",
  "/wiki/Quinlan_Vos",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/1981",
  "/wiki/1992",
  "/wiki/Star_Wars",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Alien",
  "/wiki/Lasat",
  "/wiki/Taanab",
  "/wiki/Naare",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/2016",
  "/wiki/Leland_Chee",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Category:Images_of_Dryden_Vos",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Phantom_Apprentice",
  "/wiki/Beckett_1",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_Meet_the_Crew",
  "/wiki/Solo:_A_Star_Wars_Story_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars:_Solo_Graphic_Novel_Adaptation",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_1",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_2",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_3",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_5",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_6",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_7",
  "/wiki/Choose_Your_Destiny:_A_Han_%26_Chewie_Adventure",
  "/wiki/Star_Wars_(2020)_14",
  "/wiki/Doctor_Aphra_(2020)_13",
  "/wiki/Crimson_Reign_1",
  "/wiki/Crimson_Reign_5",
  "/wiki/StarWars.com",
  "/wiki/The_Art_of_Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2020",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Gadgets_and_Gear",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Han_Solo_(Star_Wars_Encyclopedia)",
  "/wiki/Explosives,_Heavy_Weapons_and_Unstable_Elements",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Melee_and_Ranged_Weapons",
  "/wiki/Tobias_Beckett_and_Other_Characters_From_the_Underworld",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Accessories_and_Structures",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Battle_of_Utapau",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/February_7",
  "/wiki/July_13",
  "/wiki/2020",
  "/wiki/March_8",
  "/wiki/November_21",
  "/wiki/2019",
  "/wiki/February_12",
  "/wiki/March_16",
  "/wiki/February_9",
  "/wiki/May_27",
  "/wiki/Jon_Kasdan",
  "/wiki/File:Kasdan_Solo_Trivia_2.png"
 ]
}