{
 "name": "DT-L21",
 "display_name": "DT-L21",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Intelligence",
      "Imperial Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "DT-L21 was a male Death trooper, who was stationed on the planet Lothal. After the Spectres of the Rebel Alliance embarked on a mission to gather intelligence on a new prototype variant of the TIE/d \"Defender\" Multi-Role Starfighter, they accidentally made their presence known in Old Jho's Pit Stop. In response, DT-L21 and Baron Valen Rudor sought to capture the rebel group. DT-L21 and a group of stormtroopers chased the Spectres in the sewers beneath Jhothal. However, the Spectres managed to rendezvous with Lothal resistance group leader Ryder Azadi.\nDT-L21 was a human male who was formally a Stormtrooper within the Galactic Empire during the Galactic Civil War. Sometime during his service, he was selected to join the Death trooper. Program, where he was sent to Scarif to undergo additional training. He was stationed on the city of Jhothal on the Outer Rim world of Lothal. In the year 1 BBY he was present along with several stormtroopers under the command of Baron Valen Rudor at Jhotal, when a rebel cell known as the Spectres infiltrated the planet in order to meet up with resistance leader Ryder Azadi. During their mission, the rebels attracted the attention of Rudor when the speeder they were planning to escape with was destroyed by Imperial TX-225 GAVw \"Occupier\" combat assault tanks, forcing them into the cantina DT-L21 was stationed at. As he, a group of stormtroopers and Rudor ran to investigate, the Jedi Ezra Bridger managed to trick the group into believing that the rebels were still outside.\nEventually, DT-L21 realized Ezra was lying and led his forces to a sewer access point. The trooper questioned Rudor on whether he knew it was sealed, to which the pilot retorted that he had no idea. The death trooper assured Valen that there were only so many places they could hide, as he deployed Viper probe droids and stormtroopers into the sewers.\nDespite his efforts, the rebels succeeded in destroying the probes. Upon hearing the news, DT-L21 ordered all troops to converge on the rebels' last confirmed location and for a squad to be sent to the Outer Town Junction to prevent their escape as he entered the tunnels personally. Despite this, the rebels managed to escape Jhotal and were able to meet up with Azadi outside the town.\nDT-L21 was a human male with a mechanical voice. He showed skill during his stormtrooper training and was promoted to become a death trooper. He apparently has very little respect for the citizens of Lothal, as shown by the way he shoved Bridger to the side on his way to battle. He was determined in stopping the rebels from escaping Jhothal, although despite his efforts, he was unsuccessful in preventing their escape.\nAs a death trooper, DT-L21 wore standard Death trooper armor and was armed with an E-11D blaster carbine. While his voice is not scrambled, it should be assumed he did have a scrambler implemented in his armor, as was the standard for death troopers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Cleanup",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Intelligence",
  "/wiki/Death_trooper",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Spectres",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Theft_of_the_TIE_Defender_Elite",
  "/wiki/TIE/D_Defender_Elite",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Old_Jho%27s_Pit_Stop",
  "/wiki/Baron_of_the_Empire",
  "/wiki/Valen_Rudor",
  "/wiki/Stormtrooper",
  "/wiki/Jhothal",
  "/wiki/Lothal_resistance_group",
  "/wiki/Ryder_Azadi",
  "/wiki/Galactic_Civil_War",
  "/wiki/1_BBY",
  "/wiki/Ezra_Bridger",
  "/wiki/Death_trooper_armor",
  "/wiki/E-11D_blaster_carbine",
  "/wiki/Star_Wars_Rebels",
  "/wiki/The_Occupation",
  "/wiki/2016",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide"
 ]
}