{
 "name": "Du_Mahn",
 "display_name": "Du Mahn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Bogden 3"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Du Mahn was a Human female Jedi Master who served the Jedi Order and the Galactic Republic during the final decades of the Republic Classic era. Assigned to the Order's training facility on Bogden 3 during the Clone Wars, Mahn looked after the group of Jedi younglings known as the Soaring Hawkbat Clan there. When fellow Jedi K'Kruhk and Sian Jeisel landed on the moon along with their clone troopers, Mahn offered them food and shelter at the training facility. Those same clone troopers killed Mahn in front of her students during the initial execution of Contingency Order 66.\nA Force-sensitive Human female, Du Mahn was trained in the ways of the Force and eventually attained the rank of Jedi Master amongst the Jedi Order. Wielding a green-bladed lightsaber, she was appointed as a Jedi instructor at the Jedi Temple on the galactic capital planet of Coruscant and oversaw the rearing of the Order's youngest Initiates. When the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, Mahn was assigned to protect the Soaring Hawkbat Clan. By 19 BBY, Mahn and her charges, along with a Padawan named Chase Piru, had been stationed on the moon Bogden 3, where they lived in the training facility built there.\nPrior to the Battle of Coruscant, Mahn was informed that she and the clan would soon be transported back to the Jedi Temple on the galactic capital. The conflict there delayed their return, however, and Grand Master Yoda asked that they remain on Bogden 3 until he was certain it was safe for them to return. Several days after the clan was due at the temple, Mahn and her charges graciously welcomed Masters K'Kruhk and Sian Jeisel when they arrived on Bogden 3 to make repairs to their ship. Entertaining the Jedi Generals and their clone troopers, Mahn and the Hawkbats threw a large feast in welcome of their comrades. As the feast concluded, however, the clone troopers who had accompanied the generals to the world received Contingency Order 66 from the Office of the Supreme Chancellor.\nThe order instructed the clones to open fire on all Jedi, stating that they had betrayed the Republic. As the clones dutifully took aim at the younglings, the Jedi Masters sprang into action. Mahn urged her students to flee, deflecting all incoming fire as K'kruhk, Jeisel, and Piru defended the younglings. Mahn Force-pushed several troopers away as she attempted to cover the Initiates but was shot in the back by a trooper she had knocked down, dying amidst the Hawkbats. Despite her death and that of Jeisel, K'Kruhk and Piru successfully evacuated nine students, flying them offworld.\nMaster Du Mahn was fair-skinned with blue eyes. She believed that to conquer fear one must first be aware of it, a lesson she would often repeat to her colleague Chase Piru. Isolated on Bogden 3 during the Clone Wars, she worried about what was happening elsewhere in the galaxy but offered meals and rest to any other Jedi who visited, telling her students, whom she described as soaring, to throw a feast when K'Kruhk and Jeisel arrived at the end of the war. During Order 66 she defended the younglings to the best of her ability, giving her life in the process and urging the clan to flee with her dying breath.\nWhilst working in the training facility, Mahn wore Jedi robes of a pale brown color, which included a veil over her head that revealed only her face. Over the robes she wore a utility belt, on which she kept her lightsaber, which was built with a green blade.\nDu Mahn first appeared in the Star Wars: Dark Times comic book series in the first issue of the Parallels story arc. The issue was released in 2007 and written by Randy Stradley under the name Mike Harrison, with illustrations done by Dave Ross. She later received an entry in the 2008 reference book The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/19_BBY/Legends",
  "/wiki/Bogden_3",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Bogden_Jedi_chapter_house",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Soaring_Hawkbat_Clan",
  "/wiki/K%27Kruhk",
  "/wiki/Sian_Jeisel",
  "/wiki/Moon/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Massacre_on_Bogden_3",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Order_66/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_instructor",
  "/wiki/Jedi_Temple",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Chase_Piru",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/General/Legends",
  "/wiki/Office_of_the_Supreme_Chancellor",
  "/wiki/Telekinesis/Legends",
  "/wiki/Death/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Jedi_utility_belt",
  "/wiki/Star_Wars:_Dark_Times",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Dark_Times_6",
  "/wiki/Star_Wars:_Dark_Times:_Parallels",
  "/wiki/2007",
  "/wiki/Randy_Stradley",
  "/wiki/Dave_Ross",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Dark_Times_10"
 ]
}