{
 "name": "Dud Bolt",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vulpter"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vulptereen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue-gray",
      "yellow",
      "white"
     ]
    }
   ]
  }
 ],
 "content": "Dud Bolt was a Vulptereen male from the planet Vulpter who worked as a podracer pilot and hitman. He flew a Vulptereen 327 and served as a mid-air bodyguard for the Dug podracer Sebulba. In 32 BBY, he participated in the Boonta Eve Classic race on the planet Tatooine.\nBolt was one of the favorites to win the race but ended up crashing after a collision with fellow racer Ark Roose during the third lap. He survived the crash and was taken to a medcenter in Mos Espa spaceport. He continued racing and in 22 BBY took part in a race on the planet Ando Prime, which was broadcast live to the Outlander Club on the planet Coruscant.\nDud Bolt was a Vulptereen male hitman from the planet Vulpter who flew as a podracer pilot during the final decades of the Galactic Republic. He used a Vulptereen 327 racer from his homeworld and worked as the mid-air bodyguard of Sebulba, a vicious Dug podracer. By 32 BBY, Bolt had participated in the Boonta Eve Classic podrace that took place annually in the spaceport of Mos Espa on the planet Tatooine. In that year, he and Sebulba both entered as one of the eighteen competitors, with both the Vulptereen and Dug being among the favorites to win.\nBolt's vehicle was placed in the second row of the race's starting grid at the Mos Espa Grand Arena, behind Sebulba, and prior to the start of the race, the Vulptereen sat in the cockpit of his vehicle while the mechanic Mat Rags worked on it. After the Troig commentators Fodesinbeed Annodue announced the racer as \"the mighty Dud Bolt,\" members of the audience stood and cheered. Annodue also nicknamed the racer \"the Great Dud Bolt.\" Following the introduction of the participants, each of their flags was carried in procession across the front of the racing grid, including Bolt's flag, which consisted of a thin blue triangular flag above a thin dark gray triangular flag and then a large red rectangular flag below that.\nOnce the crime lord Jabba Desilijic Tiure signaled for the race to begin, Bolt left the starting grid but quickly fell toward the back of the pack. He was managing to stay ahead of at least two other vehicles and was close behind the Nosaurian Clegg Holdfast when they were both overtaken prior to entering the Notch in the first lap by the human racer Anakin Skywalker, who had stalled on the starting line. Bolt made it as far as the third lap but then crashed into the pilot Ark Roose in the Coil portion of the track shortly before Sebulba crashed on the Hutt Flats. Skywalker ultimately won the race while Bolt ended up in a Mos Espa medcenter following his crash.\nDespite the loss, Bolt continued to compete in races across the galaxy and in 22 BBY participated in a race on the planet Ando Prime using his Vulptereen 327. Footage of the race was playing live via the HoloNet in the Outlander Club on the planet Coruscant when Skywalker, who had since become a Jedi, and his master, Obi-Wan Kenobi, entered the club.\nDud Bolt was a short alien with the fast reflexes one needed in order to be successful in a sport such as podracing. He was a predatory pilot and had bluish-gray skin and yellow eyes.\nDud Bolt piloted a celebrated Vulptereen 327 podracer, a vehicle that Fodesinbeed Annodue described as an \"incredible racing machine.\" Bolt's podracer engines were predominantly red, with the front of the engines being silver and the back ends being blue. Bolt's cockpit was blue with red glyphs painted on the side. While racing, he wore brown leather armor with goggles built into the helmet.\nDud Bolt was created for the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. Artist Terryl Whitlatch drew anatomical concept art of the character on May 30, 1996, and two costume concepts were then drawn with one labeled September 12, 1996. A full maquette of the character was also produced. All of the podracing aliens were designed to have some sort of evolutionary advantage in high speed racing, with Bolt's being the sensitive antenna on his snout.\nBolt's name is a play on the word \"deadbolt.\" In the revised rough draft of the film, he was instead named \"Dud Cullindaros of Chuba,\" and the names \"Bozzie Barada\" and \"Bozzie Baranta\" were also used for the character at one point in production. The name Bozzie Barada was still erroneously used for a podracer in the film's 1999 novelization by Terry Brooks, while Bozzie Baranta was developed into a separate character in the 1999 Star Wars Legends video game Star Wars Episode I: Racer.\nModel maker Danny Wagner produced a hand puppet of Bolt consisting of only the character's torso, head, and arms. It was molded and cast in latex, likely with elements of foam latex, and then had cheesecloth added for strength. Once it was cured, polyfilla was added and then the costume, which was made of vaccu-formed pieces covered in dyed leather and greebles. Green sticks protruding from the back of the puppet's elbows were used as puppeteering rods to control it during filming.\nA Model Build/Shoot Gantt chart for the film dated February 27, 1998, listed a full puppet of Bolt as needed for shooting between April 12 and May 10 of that year, with a note that the shoot might take place in the United Kingdom. Wagner and Mark Siegel controlled the puppet on set and spent about a day shooting with visual effects supervisor John Knoll, although only a few seconds of footage made it into the film. Bolt was one of only two podracers rendered as a physical puppet rather than only computer graphics, although for distant shots of his vehicle he was also digitally rendered. The puppet is included in the touring Star Wars Identities exhibition.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Dud_Bolt",
  "/wiki/Dud_Bolt/Legends",
  "/wiki/Vulpter",
  "/wiki/Vulptereen",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/File:Fode-DudBolt-TPM.ogg",
  "/wiki/Planet",
  "/wiki/Podracer",
  "/wiki/Podracer_(profession)",
  "/wiki/Assassin",
  "/wiki/Pilot",
  "/wiki/Vulptereen_327",
  "/wiki/Bodyguard",
  "/wiki/Dug",
  "/wiki/Racer",
  "/wiki/Sebulba",
  "/wiki/32_BBY",
  "/wiki/Podracing",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Tatooine",
  "/wiki/Ark_Roose",
  "/wiki/Mos_Espa_medcenter",
  "/wiki/Mos_Espa",
  "/wiki/Spaceport",
  "/wiki/22_BBY",
  "/wiki/Ando_Prime",
  "/wiki/Outlander_Club",
  "/wiki/Coruscant",
  "/wiki/File:Fode-StartingGrid.ogg",
  "/wiki/Standard_decade",
  "/wiki/Galactic_Republic",
  "/wiki/Homeworld",
  "/wiki/Standard_year",
  "/wiki/Mos_Espa_Grand_Arena",
  "/wiki/Cockpit",
  "/wiki/Technician",
  "/wiki/Mat_Rags",
  "/wiki/Troig",
  "/wiki/Fodesinbeed_Annodue",
  "/wiki/File:Jabba-BeginRace.ogg",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Nosaurian",
  "/wiki/Clegg_Holdfast",
  "/wiki/The_Notch",
  "/wiki/Human",
  "/wiki/Anakin_Skywalker",
  "/wiki/The_Coil",
  "/wiki/Mos_Espa_podrace_circuit",
  "/wiki/Hutt_Flats",
  "/wiki/The_galaxy",
  "/wiki/HoloNet",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Species",
  "/wiki/Eye",
  "/wiki/Engine",
  "/wiki/Leather",
  "/wiki/Armor",
  "/wiki/Goggles",
  "/wiki/Helmet",
  "/wiki/1999",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Terryl_Whitlatch",
  "/wiki/May_30",
  "/wiki/1996",
  "/wiki/September_12",
  "/wiki/Antenna",
  "/wiki/Bozzie_Barada",
  "/wiki/Bozzie_Baranta",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Terry_Brooks",
  "/wiki/Star_Wars_Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Episode_I:_Racer",
  "/wiki/File:Wagner-DudBolt.ogg",
  "/wiki/Danny_Wagner",
  "/wiki/Limb",
  "/wiki/February_27",
  "/wiki/1998",
  "/wiki/April_12",
  "/wiki/May_10",
  "/wiki/Mark_Siegel",
  "/wiki/John_Knoll",
  "/wiki/Star_Wars_Identities:_The_Exhibition",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_The_Complete_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_36",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition",
  "/wiki/The_Star_Wars_Archives:_Episodes_I%E2%80%93III,_1999%E2%80%932005",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Holidays_of_the_Galaxy",
  "/wiki/Star_Wars_Inside_Intel:_Podracing",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Dud_Bolt",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide",
  "/wiki/Star_Wars_Chronicles:_The_Prequels",
  "/wiki/Databank_(original)"
 ]
}