{
 "name": "Duff_Caros",
 "display_name": "Duff Caros",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Repulsorlift platform"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sleeping Rancor"
     ]
    }
   ]
  }
 ],
 "content": "Duff Caros, also known as Stumpy was a male Human cyborg who ran the Sleeping Rancor cantina in Nuba City on the planet Nubia during the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire. By the War, Caros used a repulsorlift platform to move around as he lacked legs. His cantina was operated mostly by droids and served water-down drinks to its customers. At one stage during the war, while Caros was working at the cantina a pair of patrons working for the droid manufacturer Cybot Galactica attempted to plant a datacard belonging to their employer's rival, Industrial Automaton, onto another patron at the bar. A pair of Industrial Automaton security personnel then arrived looking for the card and a fight ensued. During the fight one of the Cybot Galactica employees, Brom, shot a sleeping Ronto outside the cantina, which then when on rampage, causing significant damage to Caros's building.\nDuff Caros first appeared in \"A Quick Stopover\" an adventure module in the 2014 Suns of Fortune sourcebook for the Fantasy Flight Games Star Wars: Edge of the Empire roleplaying system. The module gives a number of options as to how the fight in the cantina proceeds, favoring no one outcome, and so this article makes no assumptions as to how it plays out.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Sleeping_Rancor",
  "/wiki/Cyborg/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Nuba_City",
  "/wiki/Planet/Legends",
  "/wiki/Nubia/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Cybot_Galactica/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Industrial_Automaton/Legends",
  "/wiki/Brom_(thug)",
  "/wiki/Ronto/Legends",
  "/wiki/A_Quick_Stopover",
  "/wiki/2014",
  "/wiki/Suns_of_Fortune",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Edge_of_the_Empire"
 ]
}