{
 "name": "Dume  (Loth-wolf)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Loth-wolf"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray",
      "white marking on forehead"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Force"
     ]
    }
   ]
  }
 ],
 "content": "Dume was a mysterious and abnormally large male Loth-wolf who shared the birth name of Jedi Knight Kanan Jarrus—Dume. Following the death of Kanan during a mission to rescue Hera Syndulla, \"Dume\" became the continuation of Jarrus' will, communing with Jarrus' apprentice Ezra Bridger. The wolf tasked Ezra with stopping the Galactic Empire from uncovering the secrets of the Lothal Jedi Temple.\nFollowing the death of Jedi Knight Kanan Jarrus, Dume communed with Kanan's Jedi Padawan Ezra Bridger in a dream. Ezra had earlier been taken to the loth-wolves' camp by the White Loth-wolf and two smaller black wolves. In the dream, he approached Bridger and produced a key stone, an artifact from the Lothal Jedi Temple. Dume told Bridger that the Jedi temple had knowledge and destruction, and that Bridger would need to go there to \"restore past, redeem future.\" After that, Dume seemingly devoured Bridger, only for Bridger to reawaken from his dream, yet discovering that the Lothal key stone was by his feet.\nLater, Ezra related his encounter with Dume with his fellow members of the Spectres rebel cell prior to the mission to the Lothal Jedi Temple. Ezra also related his encounter to his friend Ahsoka Tano, a former Jedi Padawan and survivor of the Clone Wars and Great Jedi Purge. Dume was a Force manifestation of Kanan Jarrus' will and upon learning of the wolf, and that it had identified itself as \"Dume\" from his real name Caleb Dume, Tano speculated that it may have manifested as a result of the Cosmic Force.\nDume had a white marking on his forehead, the same marking that Jarrus once had on his shoulder pad. Unlike the other loth-wolves, Dume was larger than his counterparts and was able to speak several words in Galactic Basic Standard, a language spoken by the late Kanan and his apprentice Ezra. While Ezra was mourning for Kanan's death, Dume acted callous and accused him of \"running\"; nonetheless, he gave the grieving Padawan a listening ear and encouraged him that he was not alone, as was seen by his saying \"fight together.\" Dume was concerned with safeguarding the Lothal Jedi Temple from the Empire and tasked Ezra with stopping the Imperials from plundering the temple's secrets.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Dume_(disambiguation)",
  "/wiki/Loth-wolf",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/The_Force",
  "/wiki/Reproduction",
  "/wiki/Jedi_Knight",
  "/wiki/Kanan_Jarrus",
  "/wiki/Death",
  "/wiki/Rescue_of_Hera_Syndulla_(Lothal)",
  "/wiki/Hera_Syndulla",
  "/wiki/Ezra_Bridger",
  "/wiki/Galactic_Empire",
  "/wiki/Lothal_Jedi_Temple",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Dream",
  "/wiki/White_Loth-wolf",
  "/wiki/Lothal_Jedi_Temple_key_stone",
  "/wiki/Jedi_temple",
  "/wiki/Limb",
  "/wiki/Spectres",
  "/wiki/Mission_to_the_Lothal_Jedi_Temple",
  "/wiki/Ahsoka_Tano",
  "/wiki/Clone_Wars",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Cosmic_Force",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Star_Wars_Rebels",
  "/wiki/DUME",
  "/wiki/Wolves_and_a_Door",
  "/wiki/A_World_Between_Worlds",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/February_25",
  "/wiki/2018"
 ]
}