{
 "name": "Dunc_T%27racen",
 "display_name": "Dunc T'racen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mistryl Shadow Guard"
     ]
    }
   ]
  }
 ],
 "content": "Dunc T'racen was a Mistryl Shadow Guard warrior. In 8 ABY, she was teamed as junior partner to Shada D'ukal, serving alongside her as co-pilot and gunner of The Fury.\nDunc shared Shada's air of professional competence and carried a similar arsenal of personal weaponry, including several vibroblades and blasters, but she seemed less battle-hardened, and still believed that the Shadow Guard were more than mercenaries, although her air of youthful idealism was perhaps emphasized by her fair complexion and delicate features.\nAt around the time that Han Solo abducted Princess Leia Organa to Dathomir, The Fury was contracted for 20,000 credits to transport Fenig Nabon and Ghitsa Dogder with a cargo from Leb'Reen on Ryloth to Nal Hutta. Dunc expected the cargo to be ryll kor for medical use, and was horrified to discover that it was actually a troupe of Twi'lek dancers indentured to the Shak clan, being sold into virtual slavery to Durga the Hutt.\nThroughout the voyage, Dunc was continually baited by Ghitsa, and the situation was not improved when the Karazak Slavers Cooperative ship Indenture tried to attack The Fury and appropriate their living cargo. Shada and Dunc decided to liberate the slaves, and unceremoniously offloaded Fenig and Ghitsa in an escape pod—only to discover that that had been the plan all along, and they had been unwittingly manipulated into aiding their passengers in a complex con.\nThe character of Dunc T'racen is based on noted fan Tracy Duncan, whom authors Tish Pahl and Chris Cassidy knew as the web administrator of Club Jade.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tracy_Duncan",
  "/wiki/TheForce.net",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mistryl_Shadow_Guard",
  "/wiki/8_ABY/Legends",
  "/wiki/Shada_D%27ukal",
  "/wiki/The_Fury",
  "/wiki/Vibroblade/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Dathomir/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Fenig_Nabon",
  "/wiki/Ghitsa_Dogder",
  "/wiki/Leb%27Reen",
  "/wiki/Ryloth/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Ryll_kor",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Clan_Shak",
  "/wiki/Durga_Besadii_Tai",
  "/wiki/Hutt/Legends",
  "/wiki/Karazak_Slavers_Cooperative",
  "/wiki/Indenture",
  "/wiki/Escape_pod/Legends",
  "/wiki/Tish_Eggleston_Pahl",
  "/wiki/Chris_Cassidy",
  "/wiki/Hutt_and_Seek",
  "/wiki/Tales_from_the_New_Republic",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}