{
 "name": "Dunstal_Noft",
 "display_name": "Dunstal Noft",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Shistavanen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.81 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Albino"
     ]
    }
   ]
  }
 ],
 "content": "Dunstal Noft was a male Shistavanen and smuggler. He eventually became a pilot for the Damarind Corporation, captaining a trawler that searched Yavin Prime for Corusca gems.\nDunstal Noft was a male Shistavanen who turned to smuggling and piracy in his youth, alongside a large band of fellow Shistavanens. They operated in the Outer Rim Territories, and were generally successful; they acquired a bounty on their heads, but Noft saw little of the profit and saw the risk factor grow every time their reputation increased. As part of a job, Noft was inserted into Damarind Fishing Station in the Yavin system in order to case the installation for a raid on the stored Corusca gems. Noft established himself as an independent trawler captain, and found that he could earn more money by legitimate work that he could smuggling with his gang. He also enjoyed the independence of captaining his own ship.\nShortly after 0 ABY, Noft was due to report back to his gang but was considering leaving the smuggling life behind. He had also concluded that, due to the security measures in place on the station, raiding the station would be suicide. Noft also felt that his advice would be ignored, and the raid would take place anyway.\nDunstal Noft was 1.81 meters tall, and was considered to be tall for his species. He was also an albino. Reserved, workmanlike, and self-assured, Noft was also a being of honor despite his roguish nature. If one of his skiff pilots were in trouble, he would not hesitate to place his own life on the line to rescue them. There were times that Noft was sure that smuggling was the safer profession.\nNoft was skilled in the use of a blaster and unarmed combat, and was an effective pilot and astrogator.\nNoft wore a high-g suit, armed himself with a blaster pistol, and carried a datapad and comlink.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Shistavanen/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Albino",
  "/wiki/Smuggler/Legends",
  "/wiki/Damarind_Corporation",
  "/wiki/Trawler",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/Corusca_gem/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Damarind_Fishing_Station",
  "/wiki/Yavin_system/Legends",
  "/wiki/Corusca_gem",
  "/wiki/Captain/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Species/Legends",
  "/wiki/Skiff/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Astrogation/Legends",
  "/wiki/High-g_suit",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin_(Second_Edition)"
 ]
}