{
 "name": "Dunstig_Pterro",
 "display_name": "Dunstig Pterro",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Military",
      "Imperial Officer Corps",
      "Imperial Military",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Dunstig Pterro was a human male captain in the Galactic Empire, who served as Director Orson Callan Krennic's personal aide in 0 BBY. This position had him piloting ST 149, a Delta-class T-3c shuttle that was used as a transport for the Director and his death trooper unit. Whilst Krennic viewed the craft as a tool, Pterro held a secret affection for the ship, even nicknaming it Pteradon.\nPterro accompanied Krennic and the death troopers when the former went aboard Grand Moff Wilhuff Tarkin's Star Destroyer, Executrix, glancing around disinterestedly as the group went onto the bridge to talk to Tarkin. He later accompanied them to the overbridge of the Death Star and gave the order to prepare the battle station's superlaser at single reactor ignition. When told that they were prepared, Krennic snapped at him angrily to fire, and a bored Pterro relayed the order to Ansin Thobel who in turn relayed it to the station's gunners. He then watched as Jedha City was destroyed on the planet's surface below.\nFollowing this, Pterro flew Krennic and the death troopers to Eadu, landing the ship on the narrow landing platform jutting over a chasm. Donning a raincoat, he accompanied Krennic and the troopers to greet Galen Walton Erso and stood by impassively as the Tarkin Initiative scientists were gunned down as punishment for Erso's betrayal. He survived the ensuing attack by Rebel starfighters, and yelled to Krennic that they needed to escape, before the two men and the surviving death troopers scurried aboard the shuttle, and Pterro flew them to safety, informing his superior officer that they'd been instructed to fly to Mustafar. At Mustafar, Pterro remained aboard the ship with the death troopers when Krennic went inside Fortress Vader to meet with Darth Vader.\nAt some point, Pterro returned to the Death Star and did not accompany Krennic or the shuttle to Scarif, as he was on the Death Star's overbridge with Tarkin and General Hurst Romodi throughout the Battle of Scarif.\nDunstig Pterro is played by actor Tony Pitts.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Military",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Captain",
  "/wiki/Director",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/0_BBY",
  "/wiki/Pilot",
  "/wiki/ST_149",
  "/wiki/Delta-class_T-3c_shuttle",
  "/wiki/Transport",
  "/wiki/Death_trooper",
  "/wiki/Starship",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Star_Destroyer",
  "/wiki/Executrix",
  "/wiki/Overbridge",
  "/wiki/Death_Star",
  "/wiki/Superlaser",
  "/wiki/Ansin_Thobel",
  "/wiki/Jedha_City",
  "/wiki/Jedha",
  "/wiki/Eadu",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Tarkin_Initiative",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Mustafar",
  "/wiki/Fortress_Vader",
  "/wiki/Anakin_Skywalker",
  "/wiki/Scarif",
  "/wiki/Hurst_Romodi",
  "/wiki/Battle_of_Scarif",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Dunstig_Pterro",
  "/wiki/Tony_Pitts",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition"
 ]
}