{
 "name": "Dunwell",
 "display_name": "Dunwell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Mon Calamari"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Trioculus' Empire"
     ]
    }
   ]
  }
 ],
 "content": "Captain Dunwell was in charge of the Whaladon Processing Center and had a crew of Aqualish on Mon Calamari following the Battle of Endor. He assisted the warlord Trioculus in his search for the Glove of Darth Vader. Dunwell was killed after his submarine exploded.\nThe male Human called Dunwell worked as a sailor during the Galactic Civil War, holding the title of Captain and commanding a crew of Aqualish on the planet of Dac. Although the Whaladons of Dac were a noble and sentient species, their flesh was considered a delicacy by the elite of the Galactic Empire. By supplying the Central Committee of Grand Moffs with Whaladon meat, Dunwell made himself a trusted friend of the Empire's most important men.\nDuring a trip to the Valley of the Giant Oysters, Dunwell discovered debris from an explosion. Intriguided by his discovery, Dunwell went back to his Whaladon Processing Center with a few scraps of metal so he could analyze them and determine the origins of the debris. The captain's engineer reported that the metal scraps came from the Second Death Star, which had exploded in the Endor system, millions of miles away from Dac. Dunwell theorized that some of the Death Star's debris had tumbled into a black hole before being deposited elsewhere. Upon inspecting a much bigger piece of metal on site, Dunwell figured out it was hollow, which prompted him to use a portable X-ray scanner to find out what was inside. The X-ray negatives revealed that a five-fingered object was contained within the mass of melted metal. Concluding that object could be the reputedly indestructible right glove of Darth Vader, Dunwell decided to contact the Central Committee of Grand Moffs. In the aftermath of Sate Pestage's brief reign, the Supreme Prophet Kadann had issued a prophecy claiming that only the man who could locate and wear the glove of Darth Vader would rule the Empire. Even though the so-called Supreme Prophet was nothing but an impostor, a Bimm agent named Rajah Ubooki, his prophecy had become very influential, and the Grand Moffs sought to acquire the glove so they could give an advantage to their protégé, the three-eyed mutant Trioculus.\nAs soon as he contacted the Grand Moffs, Dunwell to contact Trioculus directly about the matter of his discovery. The captain then invited the wannabe-Emperor to the Whaladon Processing Center, where he would explain the nature of his find. Trioculus was satisfied with Dunwell's gesture of loyalty, and the captain offered to take him to the Valley of the Giant Oysters in his brand new Whaladon-hunting submarine. Once the glove was retrieved, Trioculus insisted on having a private conversation with his advisor, Grand Moff Bertroff Hissa, and his medical droid MD-5. Dunwell agreed to let them use his private quarters, which he had deliberately bugged with hidden microphones beforehand. In his haste to find a private place to talk, Trioculus had neglected to have the cabin checked for listening devices. Thanks to his microphones, Dunwell discovered that the famed glove of Darth Vader had no intrinsic powers, and that Trioculus would have to use concealed sonic devices to simulate the Dark Lord's use of the Force.\nWhile staring at the tank where Leviathor—leader of all Whaladons—was imprisoned, Dunwell wondered what he should do with the dangerous information he now possessed. After pondering for a moment, he noticed the presence of three intruders aboard the submarine, one man and two droids. Pulling out his blaster, the captain fired two short blasts, one of which struck the shorter droid and sent it spinning around. Dunwell had no occasion to shoot again, since he was then quickly disarmed by the blade of a lightsaber wielded by the mysterious Human intruder. That man, who was in fact the rebel hero Luke Skywalker, ordered Dunwell to give him access to a computer terminal so he and his droids could hook up with the submarine's master control system. The captain refused to collaborate, but Skywalker resorted to a Jedi mind power, forcing Dunwell to do as he said. When Dunwell recovered his senses, he realized that Skywalker's droid was trying to crack Dunwell's ccommunication code so he could open the doors to the Whaladon storage chambers and let the noble creatures free. While Dunwell doubted the droid's ability to achieve that feat, R2-D2 did open the gates to the storage chambers and even managed to engage the submarine's self-destruct process. At that very moment, Trioculus returned from the captain's quarters. When the mutant saw Skywalker, he pointed his tricked glove at the Rebel. However, Skywalker ducked, and the deadly vibration hit Dunwell instead.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/5_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Trioculus%27_Empire",
  "/wiki/Captain/Legends",
  "/wiki/Whaladon_Processing_Center",
  "/wiki/Aqualish/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Trioculus",
  "/wiki/Glove_of_Darth_Vader",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sailor",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Whaladon/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Species/Legends",
  "/wiki/Central_Committee_of_Grand_Moffs",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Valley_of_the_Giant_Oysters",
  "/wiki/Engineer/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Endor_system/Legends",
  "/wiki/Black_hole/Legends",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Supreme_Prophet",
  "/wiki/Kadann",
  "/wiki/Bimm_(Near-Human)",
  "/wiki/Rajah_Ubooki",
  "/wiki/Eye/Legends",
  "/wiki/Mutant",
  "/wiki/Whaladon-hunting_submarine",
  "/wiki/Advisor/Legends",
  "/wiki/Bertroff_Hissa",
  "/wiki/Medical_droid/Legends",
  "/wiki/MD-5",
  "/wiki/Force_power/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leviathor",
  "/wiki/Prison/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/The_Glove_of_Darth_Vader",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Kids_(1997)",
  "/wiki/Yoda%27s_Puzzle_Pages",
  "/wiki/Star_Wars_Kids_19",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}