{
 "name": "Durne",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cantros 7"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cantrosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nagai"
     ]
    }
   ]
  }
 ],
 "content": "Durne was a Cantrosian in the Rebellion. However, he was bought off by the Nagai Commander Knife and worked to destroy the Rebel presence on Cantros 7.\nDurne was born on Cantros 7 where he eventually worked with the Rebel Alliance to oppose the Galactic Empire. However, following the Battle of Endor, he was approached by the Nagai operative, Knife. The Nagai enlisted Durne to help in a plot to destroy the stability of the Rebellion on the world. In this capacity, Durne was able to infiltrate two Rebel organizations on opposite sides of Cantros 7. After gaining their trust, he was able to take the position of head of intelligence for both groups. He controlled all the information that reached both Rebel groups, and used it against them. He even kept the information that Emperor Palpatine had died at Endor away from the Cantrosians, keeping their fear of the Empire at its peak.\nWith control over the information, Durne was able to convince each side that the other was working for the Empire. Fights soon broke out between the opposing sides, with many casualties taking place. Durne's plan had worked perfectly, and soon both sides were threatening to wipe each other out. Unfortunately for Durne, the Rebel heroes Leia Organa, Luke Skywalker, and Han Solo eventually arrived on Cantros 7 to investigate the mysterious strength of the Empire in a location where they had never even formed a base. Durne tried to throw the group off of the trail, but they were persistent, and determined to investigate both sides of the situation.\nAs the Rebel group decided to search out the other opposing group, Durne was able to get there ahead of them, warning the other Rebels of a possible attack. When the group finally arrived in the Millennium Falcon, the opposing group captured them and brought them back to the base. Durne encouraged the opposition to torture their prisoners, but they were hesitant to do such a thing. As Durne continued to argue the point, he was spotted by Han and Luke, who tried to signal the other group of the double agent in their midst. Trying to save the situation, Durne prepared to execute the group, declaring them spies. However, Leia, having evaded capture, was able to shoot the blaster out of his hand.\nWith the first shot being fired a fight broke out between the opposing Rebel groups, and Durne was able to escape temporarily. Durne was afraid that he was about to be found out, so he devised another plan. The opposing group's leader, Niru, had constantly been a source of reason to her fellow Cantrosians, and Durne surmised that if he could secretly kill her, the rest of the group would look to him for guidance, bringing the situation back under his control. Unfortunately for Durne, as he tried to use the cover of battle to kill Niru, Skywalker witnessed the potential execution and stopped it, deflecting the blasterfire back into Durne's arm with his lightsaber. Witnessing the attempted murder, the Cantrosians were appalled at Durne, and he tried to make a break for it but was immediately stopped.\nDurne was taken hostage and interrogated by the Cantrosian rebels for creating the massive catastrophe and large loss of life. He eventually admitted to working for Commander Knife, showing another sign of the imminent Nagai invasion that was about to take place. Durne was likely kept in Alliance custody for the rest of the conflict.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cantros_7",
  "/wiki/Cantrosian",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nagai",
  "/wiki/Sami_(Cantrosian)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Ozrei_N%27takkilomandrife",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Skirmish_on_Cantros_7",
  "/wiki/Niru",
  "/wiki/Lightsaber/Legends",
  "/wiki/Star_Wars_(1977)_93",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Marvel_Series",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/The_Forgotten_War:_The_Nagai_and_the_Tofs",
  "/wiki/StarWars.com"
 ]
}