{
 "name": "Duron_Veertag",
 "display_name": "Duron Veertag",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Duron Veertag was a Human male who served as a major in the Alliance to Restore the Republic by 0 BBY. That year, after the Alliance destroyed the Galactic Empire's DS-1 Orbital Battle Station superweapon during the Battle of Yavin, Veertag was present during a ceremony honoring Luke Skywalker and other heroes of the battle. In 3 ABY, Veertag, by then a general, was stationed in the Alliance's Haven Base on the planet Arbra. Following a battle in which Commander Skywalker shot down Captain Shira Brie, Veertag joined Princess Leia Organa and General Carlist Rieekan in the Triad of Judgement presiding over Skywalker's trial. During the trial, evidence proving Brie's Imperial loyalties was retroactively discovered, and Skywalker was acquitted and reinstated as Commander. In 5 ABY, Veertag landed New Republic forces on the planet Milagro for a three-month conflict with the goal of overtaking the planet's manufacturing facilities. The battle resulted in an Imperial retreat and bombardment of the planet's surface to prevent the Republic forces from using Milagro's facilities.\nThe Human male Duron Veertag served in the Alliance to Restore the Republic during the Galactic Civil War, a conflict between the Alliance and the Galactic Empire. He attained the rank of major by 0 BBY. That year, the Battle of Yavin occurred, during which the Alliance destroyed the Imperial DS-1 Orbital Battle Station superweapon over the moon Yavin 4. Following the battle, a ceremony was held in the Grand Audience Chamber of the Great Temple, the Alliance's headquarters on Yavin 4. Veertag was present in the ceremony, which honored the Heroes of Yavin: pilots Luke Skywalker, Han Solo, and Chewbacca.\nBy 3 ABY, Veertag had become a general and was stationed on Haven Base, the Alliance's headquarters on the planet Arbra. That year, now-Commander Skywalker inadvertently shot down one of his comrades, Captain Shira Brie, who steered her own TIE/LN starfighter directly into his line of fire in a battle against an Imperial fleet commanded by Admiral Mils Giel. As a result, the Commander was convicted for her murder and stripped of his rank.\nDays later, General Veertag, alongside Princess Leia Organa and General Carlist Rieekan, formed a Triad of Judgement presiding over Skywalker's subsequent trial regarding the incident of Brie's apparent death. Haven Base tuned into a broadcast of the trial, which presented evidence collected by Skywalker that retrospectively proved Brie was an Imperial operative. For the final verdict, Veertag and the rest of the Triad all proceeded to activate pressure-sensitive discs set into the armrests of their chairs, and found Skywalker not guilty. The Triad reinstated Skywalker to the commander rank, and Veertag shook hands with Skywalker, congratulating him for the reinstatement.\nIn 5 ABY, Veertag landed New Republic troops on the planet Milagro with the hope of taking the planet's manufacturing facilities. The subsequent three-month-long conflict saw open combat between Imperial All Terrain Armored Transports and New Republic hovertanks and airspeeders in addition to subterranean conflicts between sappers and miners on both sides. Eventually, the Imperial forces withdrew from the planet, bombarding Milagro's surface to deny the Republic forces' usage of the planet's facilities.\nDuron Veertag advocated Luke Skywalker's innocence during the latter's trial over allegedly shooting down Captain Brie, and reinstated him to the rank of Commander. Veertag was glad to have Skywalker back, and shook the Commander's hand while congratulating him after the trial. Veertag had black hair and fair skin.\nThe character of General Veertag was created for Marvel Comics' Star Wars  65, published in November 1982. Veertag did not appear or get mentioned in any other Star Wars media until The Essential Guide to Warfare's release in April 2012, which also gave him the first name of \"Duron.\" Warfare author Jason Fry worked with Leland Chee and Pablo Hidalgo to retcon as Veertag one of the unnamed Rebel extras seen during the award ceremony at the end of the film Star Wars: Episode IV A New Hope, originally released in May of 1977. The fruits of their labor appeared two months later in the Rogues Gallery feature of Star Wars Insider's Issue 133.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Veertag",
  "/wiki/Duron_Veertag",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Star_Wars_(1977)_65",
  "/wiki/Major/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Royal_Award_Ceremony/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/General/Legends",
  "/wiki/Haven_Base",
  "/wiki/Planet/Legends",
  "/wiki/Arbra/Legends",
  "/wiki/Battle_of_the_secret_armada",
  "/wiki/Commander/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Lumiya",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Carlist_Rieekan/Legends",
  "/wiki/Triad_of_Judgement",
  "/wiki/5_ABY/Legends",
  "/wiki/Milagro/Legends",
  "/wiki/Milagro_campaign",
  "/wiki/Base_Delta_Zero/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Grand_Audience_Chamber",
  "/wiki/Great_Temple/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Secret_armada",
  "/wiki/Admiral/Legends",
  "/wiki/Mils_Giel",
  "/wiki/Death/Legends",
  "/wiki/Krake_Data_Vault",
  "/wiki/Troop/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Ground_warfare",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Hovertank/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Marvel_Comics",
  "/wiki/November",
  "/wiki/1982",
  "/wiki/Star_Wars",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/April",
  "/wiki/2012",
  "/wiki/Jason_Fry",
  "/wiki/Leland_Chee",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Retcon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/May",
  "/wiki/1977",
  "/wiki/June",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_133",
  "/wiki/The_Star_Wars_Storybook",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(PhotoComic)",
  "/wiki/Star_Wars_Manga:_A_New_Hope_4",
  "/wiki/Empire_15",
  "/wiki/The_Star_Wars_Sourcebook",
  "/wiki/The_Rebel_Alliance_Sourcebook",
  "/wiki/The_Rebel_Alliance_Sourcebook_(Second_Edition)",
  "/wiki/Star_Wars_Sourcebook_(Second_Edition)",
  "/wiki/The_Rebel_Alliance_Scrapbook",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_1",
  "/wiki/Empire_of_Dreams:_The_Story_of_the_Star_Wars_Trilogy",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_(1977)_62",
  "/wiki/Star_Wars_(1977)_61"
 ]
}