{
 "name": "Durr_Roddack",
 "display_name": "Durr Roddack",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire",
      "White Thranta Shipping Company"
     ]
    }
   ]
  }
 ],
 "content": "Durr Roddack was a Human male who lived on Tatooine during the Galactic Civil War. He was a manager in the White Thranta Shipping Company, a front for the illegal activities of Jabba the Hutt's criminal organization.\nAfter the Battle of Yavin, Durr Roddack was a manager in the White Thranta Shipping Company, a front for the illegal activities of Jabba the Hutt's criminal organization. Director of Operations Brok Ziam was his immediate superior.\nIn 1 ABY, Durr Roddack stole plans for a military prototype speeder, without Jabba being aware of it. The spymaster Kaesii DuPree then dispatched a spy to infiltrate the White Thranta Shipping base to recover the plans. After the spy succeeded in the mission, Kaesii DuPre contacted one of Roddack's rivals to announce that she could sell him the plans. Durr Roddack learnt about the offer and started panicking, thereby convincing DuPre and her buyer that the plans were authentic. Finally, Kaesii DuPree threatened Roddack to reveal the theft of the plans to Jabba and\nblackmailed him to get extra money.\nAround the same time, a spacer working for Reimos Taligg, one of Jabba's employees, infiltrated the White Thranta base in order to find evidence that the company was conspiring against Jabba. After going through the company's security files, incriminating evidence linking Durr to creepy medical experiments was found, and so Reimos ordered the spacer to kill Durr. It was only after Durr's death, however, that Reimos discovered that Durr was not in charge of the experiments. Upon reading his personal logs, it became clear that Durr was a lazy employee working under Brok Ziam. Durr had diverted funds from the company into his own private account, and was actually planning to flee the company in the days before his death.\nDurr Roddack was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Durr Roddack was added to the game as part of the \"Legacy Quest\" with the release of the \"Publish 25,\" a.k.a. the \"New Game Enhancements,\" on November 15, 2005. In the game, Durr Roddack was originally named Dren Riddick, yet for unknown reasons the developers changed his name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/White_Thranta_Shipping_Company",
  "/wiki/Reimos_Taligg",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Brok_Ziam",
  "/wiki/Speeder/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Kaesii_DuPree",
  "/wiki/White_Thranta_Shipping_offices",
  "/wiki/Spacer/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}