{
 "name": "Dutra_Zeneta",
 "display_name": "Dutra Zeneta",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Between 74 BBY–70 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Scandium Team",
      "Shroud Team",
      "Scandium Team",
      "Shroud Team"
     ]
    }
   ]
  }
 ],
 "content": "Dutra Zeneta was a male Jin from the Zchtek worlds who joined the growing resistance that became the Alliance to Restore the Republic shortly after the Galactic Empire subjugated his homeworld. A decorated and highly skilled commando and infiltrator, Zeneta participated in some of the Alliance's most perilous missions, including the Vidicx and Loac Campaigns, and was a member of the elite Scandium Team, leading Unit Theta. One of only six Scandium Team survivors from the Wellte-ir Massacre, Zeneta suffered from recurring nightmares and depression as a result of the battle, which resulted in the deaths of fifteen operatives out of the twenty-one deployed.\nAfter completing his twentieth assignment for Alliance Intelligence, Lieutenant Zeneta faced retirement or a desk job, as was standard procedure. Instead, he petitioned Alliance High Command to grant him a posting as a Foster Agent responsible for assisting stranded Alliance operatives to return to the Alliance and to give him command of a whole team of Foster Agents, a previously unheard of concept. High Command agreed to his request, and the all-alien Shroud Team was formed. Zeneta and his unit were inserted into Corint City on the planet Pirik in the Divis Arm, where they successfully returned sixteen agents to the Alliance in the space of seven standard months.\nDutra Zeneta was a male Jin who was born sometime between 74 BBY and 70 BBY. When the Galactic Empire subjugated the Zchtek worlds—home of the Jin species—in the early days of Emperor Palpatine's reign, Zeneta left his homeworld and, along with many of his fellow Jin, joined the fledgling resistance that eventually became the Alliance to Restore the Republic.\nTrained as an infiltrator under the auspices of Alliance Intelligence, Zeneta was assigned to Scandium Team, an elite unit that at its peak consisted of twenty-eight operatives divided into four teams. The unit was based in the Tharin sector but was deployed across the galaxy as required. In command of Unit Theta, a squad of crack commandos with both a high success and mortality rate, Zeneta fought in and survived some of the most perilous combat missions that the Alliance undertook during the Galactic Civil War. He participated in both the Vidicx and Loac Campaigns as well as the Wellte-ir Massacre, the mission that proved to be Scandium Team's final assignment.\nDuring the mission to the Wellte-ir system in the Trax sector, Scandium Team was engaged by two units of elite Imperial armor, one of which was later suspected to be a contingent of the Emperor's Royal Guard on field exercises. Heavily outnumbered, Scandium Team fought a four-day battle on the plains of Bresnan. Out of twenty-one deployed operatives, fifteen of them died by the time the team was extracted from along the Umber Banks. Zeneta was one of only six survivors, along with team leader Harovan Toth, infiltrator Korgath, heavy weapons specialist Opit-Wenbruh, pilot Aven Cholus, and desert Wilderness Fighter Rith Tar'ak. Scandium Team was disbanded, and the loss of so many of his friends traumatized the Jin, leading him to suffer from recurring nightmares and bouts of depression. Despite the psychological trauma incurred, Zeneta continued to serve the Alliance, wholly believing in its goals.\nSometime after 0 ABY, Zeneta completed his twentieth mission for Alliance Intelligence and was faced with retirement or a desk job, as was standard procedure for agents who had survived twenty missions. Instead, he requested a posting as a Foster Agent, one of the most dangerous field assignments in the Alliance. Foster Agents were used as points of contact for operatives who had been stranded in the field or who had been exposed, giving them a means of returning to the Alliance. Foster Agents ran the risk of being uncovered themselves, as Alliance operatives who had been supplied their name could have divulged it to Imperial forces if captured. Zeneta not only convinced Alliance High Command to accede to his request but to grant him command of an entire team of Agents as well—a concept of which had previously been unheard, as Foster Agents usually worked alone. Due to the dangerous nature of the work, General Vernan, then-Chief of Alliance Intelligence, suspected that Zeneta had a death wish.\nZeneta, holding the rank of lieutenant, formed Shroud Team, which was composed entirely of non-Humans. The Rodian Dheendo served as the unit's primary contact Foster Agent and Zeneta's second-in-command. Thilis-Brin, an Ishi Tib, functioned as the team's technician, while Tamo Lan, a Carosite, provided medical services. Gondara, an Aqualish teenager, served as Lan's assistant. Shroud Team was inserted into Corint City, the capital of the planet Pirik in the Divis Arm. Corint City was a fertile recruiting ground for new Alliance operatives and sympathizers and was often used by Alliance operatives seeking refuge. In addition, the population of Corint City was largely alien, with Humans only representing around 5 percent of the settlement's 10 million residents. This allowed the all-alien Shroud Team to blend in with the local population more easily. In the first seven standard months of its deployment—equating to eleven local months—Shroud Team successfully returned sixteen agents, including Togorian Agent Tynan Ryln Mei, to the Alliance. Shroud Team's success rate earned it a great deal of respect from other Foster Agents. In addition to its primary mission, Shroud Team also acquired provisions and equipment for the Alliance. Some the team kept for its own operations, others were for the use of the operatives whom they returned to active duty, and the rest was distributed to other Alliance units operating in the Divis Arm.\nZeneta often conversed with an espionage droid fitted with a modified TranLang III communications module who used certain predetermined code phrases and words to relay information to a receiving agent. The information passed to Zeneta in this fashion led to the Alliance capturing two command frigates along the Sisar Run.\nDutra Zeneta had green skin and large, black eyes that, like all Jin, could see in the infrared spectrum. He had long, black hair that reached his shoulders and a beard that ran along his jaw line and ended in a pointed tuft beneath his chin. At the age of seventy-four, he was considered to be middle-aged for a Jin. A combat veteran, Zeneta's body was covered in scars from near-fatal wounds. He considered himself to be a Rebel above everything else and truly believed in the Alliance's eventual victory over the Galactic Empire. A skilled tactician and leader, Zeneta was well respected by those under his command and his superiors, and he was a highly decorated operative.\nA survivor of the Wellte-ir Massacre, Zeneta experienced recurring nightmares about the event and suffered from bouts of depression that affected his abilities if he let them overwhelm him. Like all other Scandium Team survivors, he often displayed a cynical attitude and developed a short temper. Zeneta rarely worked with other Scandium Team survivors due to the shared sense of loss and pain they all felt, and he preferred to spend his free time alone. Despite this, Zeneta was generally regarded to be a warm individual who treated those under his command well, a trait that extended to those operatives he was tasked with returning to the Alliance.\nZeneta had a wealth of experience from his years of service and often related the lessons he learned from his previous adventures to Shroud Team when its members encountered situations similar to those faced by Scandium Team. He had a policy of openly sharing advice, as he knew he had a lot of knowledge to impart. General Airen Cracken, head of Alliance Intelligence, was pleased that Zeneta was able to put aside his personal grief and assist in the training of new Alliance operatives, giving them the benefit of his experiences.\nA skilled and physically fit commando, Dutra Zeneta was trained in both melee and unarmed combat, and he was proficient with the use of blasters, with a specialty in wielding heavy blaster rifles. He was also skilled in the use of grenades and explosives for demolition purposes, and he could operate weapons mounted on vehicles, capital ships, and space transports. Zeneta was trained in astrogation and could pilot transports and starfighters, most notably the Z-95 Headhunter. He could drive repulsorlift vehicles and swoop bikes; operate walkers, including All Terrain Scout Transports; and ride animals, such as the Cracian thumper. Zeneta was also trained in the use of powersuits.\nTechnically adept, Zeneta could operate sensor, security, and communications equipment as well as the deflector shield systems aboard space transports. He was also adept at repairing and programming both droids and computers. In addition, he could repair repulsorlift vehicles, transports, and ship-mounted weapons. The Jin was knowledgeable about alien species, cultures, and languages and about the way bureaucracies were run. He was well versed in law enforcement protocols and was well informed about Corint City's inner workings.\nAn able commanding officer, Zeneta was respected by both his subordinates and superiors. He was a skilled forger, and his combat training allowed him to be stealthy when the need arose. Trained in first-aid, Zeneta was also adept at surviving in inhospitable conditions, and he specialized in urban environment survival.\nDuring his deployment to Corint City, Zeneta generally wore civilian clothing—which included a blue padded vest with furred collar, white shirt, and fingerless black gloves—and a headset comlink, and he armed himself with a modified heavy blaster rifle and a pair of grenades. Despite his trauma over the sundering of Scandium Team, he kept a holo of its members.\nDutra Zeneta first appeared in \"Cracken's Rebel Operatives,\" an article series that appeared in issues of the Star Wars Adventure Journal, published by West End Games. Zeneta was featured in the article published in the tenth issue, released in 1996, which was written by C. Robert Carey. A black-and-white illustration of Zeneta by Kathy Burdette accompanied his biography. A second article in the issue, \"Cracken's Rebel Field Guide: Slicing Aids,\" namechecked Zeneta in its entry for a modified TranLang III communications module. The article was also written by Carey. In the following issue, a colorized version of Burdette's image was included in the \"Featured Artist\" section.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/74_BBY",
  "/wiki/70_BBY",
  "/wiki/Jin",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Scandium_Team",
  "/wiki/Shroud_Team",
  "/wiki/Cracken%27s_Rebel_Operatives_(article)",
  "/wiki/Zchtek_worlds",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Subjugation_of_the_Zchtek_worlds",
  "/wiki/Homeworld/Legends",
  "/wiki/Commando/Legends",
  "/wiki/Infiltrators/Legends",
  "/wiki/Vidicx_Campaign",
  "/wiki/Loac_Campaign",
  "/wiki/Unit_Theta",
  "/wiki/Wellte-ir_Massacre",
  "/wiki/Sleep/Legends",
  "/wiki/Ground_warfare",
  "/wiki/Death/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Lieutenant/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Foster_Agent",
  "/wiki/Agent/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Corint_City",
  "/wiki/Planet/Legends",
  "/wiki/Pirik",
  "/wiki/Divis_Arm",
  "/wiki/Standard_month/Legends",
  "/wiki/Cracken%27s_Rebel_Field_Guide:_Slicing_Aids",
  "/wiki/Reproduction/Legends",
  "/wiki/Species/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Tharin_sector",
  "/wiki/The_galaxy/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Wellte-ir_system",
  "/wiki/Trax_sector",
  "/wiki/Armor/Legends",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Bresnan",
  "/wiki/Time/Legends",
  "/wiki/Umber_Banks",
  "/wiki/Harovan_Toth",
  "/wiki/Korgath",
  "/wiki/Opit-Wenbruh",
  "/wiki/Pilot/Legends",
  "/wiki/Aven_Cholus",
  "/wiki/Wilderness_Fighters",
  "/wiki/Rith_Tar%27ak",
  "/wiki/0_ABY/Legends",
  "/wiki/General/Legends",
  "/wiki/Vernan_(general)",
  "/wiki/Chief_of_Intelligence/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Dheendo",
  "/wiki/Executive_officer/Legends",
  "/wiki/Thilis-Brin",
  "/wiki/Ishi_Tib/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Tamo_Lan",
  "/wiki/Carosite",
  "/wiki/Medic/Legends",
  "/wiki/Gondara",
  "/wiki/Aqualish/Legends",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Human/Legends",
  "/wiki/Togorian/Legends",
  "/wiki/Tynan_Ryln_Mei",
  "/wiki/Espionage_droid",
  "/wiki/TranLang_III_communications_module",
  "/wiki/Frigate/Legends",
  "/wiki/Sisar_Run/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Infrared/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Walker/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Cracian_thumper",
  "/wiki/Powersuit",
  "/wiki/Sensor/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Language/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Shirt",
  "/wiki/Limb/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Rifle/Legends",
  "/wiki/Holopic/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/1996",
  "/wiki/Craig_Robert_Carey",
  "/wiki/Kathy_Burdette",
  "/wiki/Star_Wars_Adventure_Journal_11",
  "/wiki/Featured_Artist:_Kathy_Burdette",
  "/wiki/4_ABY/Legends",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/The_Rebel_Alliance_Sourcebook_(Second_Edition)",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim"
 ]
}