{
 "name": "Dwitzel",
 "display_name": "Dwitzel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Republic Army",
      "Dwitzel's Rats"
     ]
    }
   ]
  }
 ],
 "content": "Dwitzel was a female Twi'lek mercenary who operated during the Galactic Civil War.\nAt a very young age, Dwitzel was sold into slavery. She spent several years in a brothel on Waliar, before killing four people with a broken bottle and escaping. She then enlisted herself in the Republic Army and quickly became the first female officer of the spaceborne commandos.\nAfter Palpatine became Emperor, Dwitzel was expelled from the army because of the new humanocentric policy. She came to Tatooine, and lived from agricultural material reparations.\nHowever, she did not forget her military past and, at the same time, founded a mercenary unit known as the Dwitzel's Rats. Her operatives showed her a fanatical devotion, as she was an excellent soldier, competent with both ranged and melee weapons as well as a fantastic leader.\n\nA female Twi'lek, Dwitzel acted as a cold professional in all circumstances. She never smiled and, when extremely concentrated, she sported a deep melancholy.\nShe was smart and cunning, and disliked the Galactic Empire.\nDwitzel was created by Jean Balczesak for an ambiguously canon roleplaying Gamemaster help which appeared in the French magazine Casus Belli 67. She was illustrated by Fred Blanchard.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Republic_Army",
  "/wiki/Dwitzel%27s_Rats",
  "/wiki/Mercenary/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Brothel/Legends",
  "/wiki/Waliar",
  "/wiki/Officer/Legends",
  "/wiki/Commando/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Humanocentrism",
  "/wiki/Tatooine/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Jean_Balczesak",
  "/wiki/Canon",
  "/wiki/Roleplaying_game",
  "/wiki/Casus_Belli_67",
  "/wiki/Fred_Blanchard",
  "/wiki/Casus_Belli"
 ]
}