{
 "name": "Dy%27lothe",
 "display_name": "Dy'lothe",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Chiss Defense Force",
      "Chiss Defense Force"
     ]
    }
   ]
  }
 ],
 "content": "Admiral Dy'lothe of the Chiss Ascendancy's Defense Force was a Chiss male who commanded the Groundlion man-of-war Venturous. Around 18 BBY, during a crisis in the Ascendancy, the Kilji war cruiser Whetstone traveled to the planets of Avidich and Rhigar, with the Venturous journeying to those planets to protect the Ascendancy's people from the alien warship.\nAfter the Chiss Senior Captain Mitth'raw'nuruodo's Nikardun blockade frigate Aelos arrived over the planet of Sposia, the Venturous confronted the blockade frigate, with Dy'lothe attempting to detain the senior captain on orders of the Chiss Syndicure. However, the Aelos escaped after partially disabling the admiral's warship with a conner net. Shortly after, Dy'lothe assessed the aftermath of the destruction of a fleet of warships of the Grysk warlike species over the planet Sunrise.\nDy'lothe was a male Chiss who, around 18 BBY, was serving as an admiral in the Chiss Ascendancy nation's Chiss Defense Force, commanding, the Groundlion man-of-war Venturous. After the Kilji war cruiser Whetstone of the Kilji Illumine government arrived over the Ascendancy's planet Avidich, the Venturous was sent to protect the planet from the alien warship. However, the war cruiser was already gone before the Groundlion arrived. Shortly after, the Whetstone traveled to the planet Rhigar, and Captain Clarr'os'culry core name \"Roscu\" met its commanders—Generalirius Nakirre and the Grysk agent Jixtus—to get the war vessel away before Dy'lothe's flagship arrived in three hours.\nLater, during a crisis in the Ascendancy, the Venturous was assigned to the Chiss world of Sposia, which housed the Universal Analysis Group \"UAG\", tasked with safekeeping and studying alien devices such as a Vagaari gravity well projector. Before Dy'lothe's arrival, Defense Force Supreme Admiral Ja'fosk sent Admiral Ar'alani and her Nightdragon man-of-war Vigilant to Sposia, as the supreme admiral did not want to leave the UAG unguarded. Moments after the Vigilant arrived, Dy'lothe reported the presence of a Nikardun blockade frigate, the Aelos, which was crewed by several members of the Paccosh species and the Chiss Senior Captain Mitth'raw'nuruodo \"Thrawn.\" Tasked with detaining the senior captain by the Chiss Syndicure ruling body after contacting the Chiss capital planet of Csilla, the admiral commanded the Aelos to surrender.\nAr'alani desired to speak with the senior captain, however, and fired at the Venturous to get Dy'lothe's attention. The admiral, who the other believed did not want to carry out his orders, told the Vigilant's commander of the Syndicure's order, and engaged in a conversation regarding Thrawn's motives for being at Sposia, which Dy'lothe claimed he did not care about. Meanwhile, the Aelos moved, sending a crippler net—a electronic equipment–disabling weapon—to the Venturous's bow spectrum laser and tractor beam emplacements. While the blockade frigate fled, Ar'alani's first officer, Senior Captain Kiwu'tro'owmis \"Wutroow\" commented that although it would be useless, Dy'lothe would shoot a plasma sphere or breacher missile at the Aelos, with her commander stating that he would not. Ar'alani then contacted the other admiral, who informed the Vigilant's captain that he was leaving for the UAG, where he would drop debris of an asteroid missile platform that exploded in the Ornfra system some time previously.\nDays after Sposia, Dy'lothe arrived in the aftermath of Senior Captain Thrawn's last stand over the planet Sunrise, where Thrawn's fleet of Chiss vessels had destroyed Jixtus's. The admiral inquired Ar'alani, who had participated in the conflict, on what he had missed. Some time afterward, Dy'lothe, along with Ja'fosk, Admiral Ers'ikaro, and two other Defense Force admirals, were present in a tribunal where Thrawn was exiled for destroying Jixtus's fleet, with Dy'lothe removing the honor chains from Thrawn's chest.\nDy'lothe was a male Chiss rumored to have no sympathy.\nDy'lothe was first indirectly mentioned in the 2017 novel Thrawn, the first volume in the Star Wars: Thrawn novel series written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Chiss_Defense_Force",
  "/wiki/Admiral",
  "/wiki/Commanding_officer",
  "/wiki/Groundlion_man-of-war",
  "/wiki/Venturous",
  "/wiki/18_BBY",
  "/wiki/Chiss_Ascendancy_crisis",
  "/wiki/Kilji_war_cruiser",
  "/wiki/Whetstone",
  "/wiki/Planet",
  "/wiki/Avidich",
  "/wiki/Rhigar",
  "/wiki/Alien",
  "/wiki/Warship",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Nikardun_blockade_frigate",
  "/wiki/Aelos",
  "/wiki/Sposia",
  "/wiki/Blockade_frigate",
  "/wiki/Chiss_Syndicure",
  "/wiki/Conner_net",
  "/wiki/Senior_Captain_Thrawn%27s_last_stand",
  "/wiki/Jixtus%27s_fleet",
  "/wiki/Grysk",
  "/wiki/Sunrise",
  "/wiki/Kilji_Illumine",
  "/wiki/War_cruiser",
  "/wiki/Captain",
  "/wiki/Clarr%27os%27culry",
  "/wiki/Core_name",
  "/wiki/Generalirius",
  "/wiki/Nakirre",
  "/wiki/Jixtus",
  "/wiki/Starship",
  "/wiki/Standard_hour",
  "/wiki/Universal_Analysis_Group",
  "/wiki/Vagaari",
  "/wiki/Gravity_well_projector",
  "/wiki/Supreme_Admiral",
  "/wiki/Ja%27fosk",
  "/wiki/Ar%27alani",
  "/wiki/Nightdragon_man-of-war",
  "/wiki/Vigilant_(Nightdragon_man-of-war)",
  "/wiki/Paccosh",
  "/wiki/Species",
  "/wiki/Capital",
  "/wiki/Csilla",
  "/wiki/Confrontation_between_the_Aelos_and_the_Venturous",
  "/wiki/Crippler_net",
  "/wiki/Weapon",
  "/wiki/Spectrum_laser",
  "/wiki/Tractor_beam",
  "/wiki/Executive_officer",
  "/wiki/Kiwu%27tro%27owmis",
  "/wiki/Plasma_sphere",
  "/wiki/Breacher",
  "/wiki/Missile",
  "/wiki/Asteroid_missile_platform",
  "/wiki/Skirmish_between_the_Grayshrike_and_the_Orisson",
  "/wiki/Ornfra_system",
  "/wiki/Time",
  "/wiki/Standard_day",
  "/wiki/Thrawn%27s_fleet",
  "/wiki/Ers%27ikaro",
  "/wiki/Exile_(punishment)",
  "/wiki/2017",
  "/wiki/Thrawn_(novel)",
  "/wiki/Star_Wars:_Thrawn_(novel_series)",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Thrawn_(audiobook)"
 ]
}