{
 "name": "Dyne",
 "display_name": "Dyne",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicJudicial ForcesRepublic Intelligence",
      "Judicial Forces",
      "Republic Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Dyne was a Human male officer who served as a captain in the Judicial Forces. He was transferred to Republic Intelligence about the time that the Clone Wars began.\nIn 19 BBY, near the end of the Clone Wars, Captain Dyne aided the Jedi in the investigation of the Neimoidian mechno-chair which provided a lead as to the identity of Darth Sidious. Upon finding Sidious' hideout in the sector of Coruscant known as the Works, Dyne and his squad accompanied Mace Windu and several other Jedi in their investigation of the Works, which eventually led to the sub-levels of 500 Republica. The investigation was halted by 500 Republica's security, who held the team up for hours as they were cleared, but eventually they were allowed in. However, Sidious' trail disappeared in the middle of an unremarkable ferrocrete floor, and numerous other footprints covering the floor masked where it might have picked up again. Dyne wanted to requisition more probe droids to help scan for the Sith Lord's whereabouts and begin scans of the walls and partitions of the basement, a process he estimated would take weeks.\nWhen Count Dooku and General Grievous started the Battle of Coruscant, Dyne and the Jedi were interrupted by the first shocks of 500 Republica shaking as destroyed ships plummeted to the ground, only to be joined moments later by the building's own plasma weapons opening fire. Dyne opted to continue the search while the Jedi left to aid in the planet's defense.\nMeanwhile, having learned of the attack, Dyne briefly considered leaving to help in the battle, but Valiant convinced him that the search for Sidious was as important as the battle. As he waited for the additional droids to arrive, Dyne began a superficial scan of the basement with what he had on hand. Realizing that transmissions on regular frequencies were jammed, the intelligence officer set the droids to search for more unusual frequencies; they found one, emanating from the very spot Sidious' trail had disappeared. After having the shaft of the turbolift scanned to get an idea of its depth, Dyne tried to contact Windu, but since the communications were still down, he and Valiant made the decision to continue without the Jedi. The team loaded themselves onto the platform, the droids activated it, and they descended into the depths of 500 Republica. In the dark corridors below, the team discovered a large metal doorway, behind which, the probe droids said, was one organic and several droids. The team moved to advance on the door, but upon hearing someone speaking Geonosian, they turned around to find a pair of Geonosian soldier drones aiming at them with sonic blasters. The Geonosians opened fire instantly, and their blasts sent Dyne, Valiant and his soldiers' mangled bodies flying into the door. As Dyne lay badly injured from the blast, the door opened and Sidious stepped through with two unidentified assassin droids, observing the scene. In his dying moment, Dyne was shocked to learn the true identity of Sidious: Supreme Chancellor Palpatine, but he would die before telling anyone what he had learned.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Judicial_Forces/Legends",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Mechno-chair/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Sector_943",
  "/wiki/Mace_Windu/Legends",
  "/wiki/500_Republica/Legends",
  "/wiki/Ferrocrete/Legends",
  "/wiki/Probe_droid/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Valiant_(clone_trooper)",
  "/wiki/Droid/Legends",
  "/wiki/Geonosian_(language)",
  "/wiki/Geonosian/Legends",
  "/wiki/Warrior_caste_(Geonosian)/Legends",
  "/wiki/Sonic_blaster/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Labyrinth_of_Evil",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}