{
 "name": "Dznori Xam",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kallidahin"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple and white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Archaeological Research Council"
     ]
    }
   ]
  }
 ],
 "content": "Dznori Xam was a Kallidahin technician who worked on a dig site run by the Archaeological Research Council in the Polis Massa asteroid belt. At the end of the Clone Wars in 19 BBY, Xam was part of a team that aided the heavily injured human senator Padmé Amidala in giving birth after she was brought to the dig site. The team successfully delivered the twins Luke and Leia, but ultimately could not save Amidala's life.\nThe Kallidahin Dznori Xam worked as an Archaeological Research Council technician at an archaeological dig site on one of the asteroids of the Polis Massa asteroid field. The dig site was run by the council and was established in order to try and ascertain what had caused the destruction of the planet of Polis Massa and to search for traces of the Eellayin, an extinct species that the Kallidahins believed to be their ancestors. Dznori Xam shared a surname with Selif Xam, another technician at the base.\nAt the end of the Clone Wars in 19 BBY, the heavily pregnant human Senator Padmé Amidala was brought to the dig site by her allies Senator Bail Organa, Jedi Master Obi-Wan Kenobi, Grand Master Yoda after sustaining heavy injuries. Dznori was part of a team consisting of two trained physicians and several xenobiologists who then began attending to Amidala in order to aid her in delivering the twins she was carrying. The team did not even have time to change out of their caving jumpsuits due to the severity of Amidala's condition.\nAmidala was placed in one of the site's medical facilities, although it was designed for treating investigators rather than childbirth. While she lay in labor on a table in the center of the room, Dznori and Osh Scal, another technician, stood together by one of the room's monitors while studying and gesturing at the readout. The pair then left the room prior to the actual birth, leaving only Kenobi, a GH-7 medical droid, and a midwife droid to watch over the expectant mother. Amidala successfully gave birth to the twins and named them Luke and Leia, but persihed soon after, having lost the will to live following the betrayal of her husband, Anakin Skywalker.\nDznori Xam and the other Kallidahin technicians at Polis Massa showed discretion when interacting with those accompanying the pregnant Amidala and asked few questions. Due to their limited contact with humans, the Kallidahins knew little about the species' parturition, but were still baffled when they could not save Amidala's life. Dznori had purple-and-white skin and deep-focus black eyes.\nWhile treating Amidala, Dznori Xam wore a form-fitting caving jumpsuit that was blue-and-brown in color and had warming lines down the legs. The outfit also included a surgical hood seal and a caver's harness. The Kallidahin was also equipped with a head-mounted signal light, a droid summoner and shoulder light mounted on the right shoulder, a utility belt, a voice-activated comlink, and leg warmers.\nDznori Xam appeared in the prequel trilogy film Star Wars: Episode III Revenge of the Sith, which was released on May 19, 2005. In the current Star Wars canon, the character was first identified in the 2017 reference book Star Wars: The Visual Encyclopedia. The name originated from the Star Wars Legends continuity, where it was first used in the reference book Star Wars: Revenge of the Sith: The Visual Dictionary, which was written by James Luceno and released on April 2, 2005.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Dznori_Xam",
  "/wiki/Dznori_Xam/Legends",
  "/wiki/Kallidahin",
  "/wiki/Color",
  "/wiki/Archaeological_Research_Council",
  "/wiki/Technician",
  "/wiki/Polis_Massa_Base",
  "/wiki/Polis_Massa",
  "/wiki/Asteroid_field",
  "/wiki/Clone_Wars",
  "/wiki/19_BBY",
  "/wiki/Human",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Reproduction",
  "/wiki/Gender",
  "/wiki/Twin",
  "/wiki/Luke_Skywalker",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Archaeologist",
  "/wiki/Asteroid",
  "/wiki/Planet",
  "/wiki/Eellayin",
  "/wiki/Species",
  "/wiki/Selif_Xam",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Doctor",
  "/wiki/Xenobiologist",
  "/wiki/Time",
  "/wiki/Clothing",
  "/wiki/Osh_Scal",
  "/wiki/GH-7_series_medical_assistance_droid",
  "/wiki/Midwife_droid",
  "/wiki/Parent",
  "/wiki/Death",
  "/wiki/Marriage",
  "/wiki/Anakin_Skywalker",
  "/wiki/Eye",
  "/wiki/Limb",
  "/wiki/Caller",
  "/wiki/Utility_belt",
  "/wiki/Comlink",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/May_19",
  "/wiki/2005",
  "/wiki/Star_Wars",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Revenge_of_the_Sith:_The_Visual_Dictionary",
  "/wiki/James_Luceno",
  "/wiki/April_2",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_22",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Mustafar_and_Other_Outer_Rim_Planets",
  "/wiki/Category:Images_of_Dznori_Xam",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition"
 ]
}