{
 "name": "E'thinaa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yuuzhan Vong empire",
      "Praetorite Vong",
      "Praetorite Vong"
     ]
    }
   ]
  }
 ],
 "content": "E'thinaa was a male Yuuzhan Vong agent during the years of the Yuuzhan Vong War. He was active in the Ssi-ruuvi Imperium, the government of the Ssi-ruu species, disguised as a Ssi-ruu. He attained the rank of general and helped manipulate the Ssi-ruuk for the benefit of the Yuuzhan Vong. He also helped to arrange for the Ssi-ruuk to attack the planet Bakura, weakening both the Ssi-ruuk and the galactic government, the Galactic Alliance. He dealt with Prime Minister Molierre Cundertol of Bakura and killed him after the Ssi-ruuk were repelled.\nThe male Yuuzhan Vong known as E'thinaa was an operative of the Praetorite Vong, an advance force of Yuuzhan Vong designed to create chaos in the galaxy in preparation for the species' invasion. Though the Praetorite Vong suffered a serious military defeat in 25 ABY at Helska IV, E'thinaa continued to work to soften potential enemies. By 28 ABY, he held the rank of general in the Ssi-ruuvi Imperium, the government of the war-like Ssi-ruuk. Carefully disguised in an ooglith masquer, E'thinaa helped engineer the rise of the Keeramak, a Ssi-ruu of prophecy. The Yuuzhan Vong hoped to create a conflict between the Ssi-ruuk and the Galactic Federation of Free Alliances, knowing that such a war would weaken both sides.\nHe also made a deal with Molierre Cundertol, Prime Minister of the planet Bakura. Keeping his true origins secret, he promised to supply Cundertol with a new droid body—enabling him to live forever—if the Prime Minister would surrender Bakura. E'thinaa also agreed to provide him with half the money Cundertol had paid for the droid body. The Yuuzhan Vong then enabled him to transfer his essence into the droid through a Ssi-ruuk process known as entechment. The process went as planned, and soon after, the Ssi-ruuk launched an attack on Bakura. As E'thinaa had expected, the Keeramak was killed. The Ssi-ruuk were forced to flee, and Cundertol, now in a droid body, met up with E'thinaa in a space station at the edge of Ssi-ruu space.\nThere, E'thinaa chastised Cundertol for wanting to know why the General wanted the Keeramak dead and refused to pay the man the money he had promised him, claiming that Cundertol had not fulfilled the bargain. When an irate Cundertol protested, E'thinaa offered the former Prime Minister the chance to fight for it. Cundertol accepted, only to have E'thinaa activate a restraining bolt that froze Cundertol's droid body. The General then revealed his true origins to his horror-stricken foe. Other Yuuzhan Vong flooded into the room and began beating Cundertol with amphistaffs until he died.\nE'thinaa served his species, working to weaken potential foes and enable the Yuuzhan Vong's conquest of the galaxy. He kept his true identity a secret and manipulated Molierre Cundertol into surrendering Bakura. When Cundertol protested that he was being treated unfairly, E'thinaa mocked him, and was amused when the man agreed to fight him. Like all his people, E'thinaa considered Humans to be a lesser species and their droids to be abominations. He felt that Cundertol, in a droid body, was unworthy of slavery or an honorable death in a sacrifice.\nThe Yuuzhan Vong E'thinaa was created for the novel The New Jedi Order: Force Heretic II: Refugee. He later received mentions in The Complete Star Wars Encyclopedia and Galaxy of Intrigue.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Yuuzhan_Vong_empire",
  "/wiki/Praetorite_Vong",
  "/wiki/Operative",
  "/wiki/Standard_year/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Ssi-ruuvi_Imperium",
  "/wiki/Ssi-ruu",
  "/wiki/Species/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/General/Legends",
  "/wiki/Battle_of_Bakura_(28_ABY)",
  "/wiki/Planet/Legends",
  "/wiki/Bakura/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Prime_Minister/Legends",
  "/wiki/Molierre_Cundertol",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Helska_IV",
  "/wiki/25_ABY/Legends",
  "/wiki/Helska_IV",
  "/wiki/28_ABY/Legends",
  "/wiki/Cloaker",
  "/wiki/Keeramak",
  "/wiki/Droid/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Human_replica_droid",
  "/wiki/Entechment",
  "/wiki/Space_station/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Restraining_bolt/Legends",
  "/wiki/Amphistaff",
  "/wiki/Human/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_II:_Refugee",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/The_New_Jedi_Order:_Vector_Prime"
 ]
}