{
 "name": "Eagle",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Amber"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Eagle's network"
     ]
    }
   ]
  }
 ],
 "content": "The Eagle was a male Human terrorist leader who lead a terrorist force against the Sith Empire during the Cold War. He sought to change the Empire through force after being dissatisfied with the Treaty of Coruscant. Originally an Imperial starfighter pilot who fought at Coruscant and Druckenwell, after losing his squad-mates to Republic troopers and others being \"erased\" by Imperial Intelligence, he, with assistance from Darth Jadus, developed plans to return the Empire to its former isolationist ways using the Eradicators superweapon Satellites. He was killed during a confrontation with Cipher Nine after the latter tracked him to Nal Hutta.\nBefore taking the moniker \"The Eagle,\" this male individual was a starfighter pilot who flew with the Imperial squadrons during several battle leading up to the signing of the Treaty of Coruscant. He was decorated for missions flown during the Battle of Druckenwell and the Sacking of Coruscant, but was extremely concerned for his career with the Empire after several of his squadmates were killed in action or disappeared as a result of Imperial Intelligence's meddling. He eventually dropped out of the service after the news broke about the signing of the Treaty, becoming furious with the Empire's ways.\nHe eventually joined forces with Sith Lord Darth Jadus due to the two's wish to change the outlook of the Empire; Jadus to become it's ultimate master and remake it in his image, the Eagle to return it to its isolationist methods so as to conquer the Galactic Republic when the time came. Taking on his new moniker, he spent years during the Cold War developing and stringing together a network of terrorists, spies and leaders capable of wreaking havoc upon the Empire from within and outside it's borders.\nAs a diversion, the Eagle sent a terrorist team to assault a network of piping and power conduits the fed the Empire's capital of Kaas City. Intended to fail, the team of saboteurs was defeated by Imperial Intelligence before the sabotage could be finished. Finally, with enough of a push from Jadus upon Imperial Intelligence, the Eagle launched their offensive and destroyed Jadus' battle cruiser, the Dominator, above Dromund Kaas. He later made contact with the planet and transmitted a planet-wide communication, stating their intention to change the Empire by any means necessary.\nWith the Empire in chaos, the Eagle's network began construction of the Eradicator superweapons - lasers with the capability to wipe out populations with the correct access codes and targeting methods. However, a lone Imperial Intelligence operative slowed down the project's completion by shutting down several operations and contacts across the galaxy, including a VerveGen Corporation factory on Nar Shaddaa and a Ghost cell operation led by the Old Man on Tatooine. The Eagle's location was finally traced through several communications to the central Eradicator construction facility on Hutta. Cipher Nine confronted the Eagle and defeated him in combat, but before his death, he revealed that he was not the leader of the organization and the Empire had been betrayed by someone from within, right before Cipher Nine shot him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/3643_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Eagle%27s_network",
  "/wiki/Cipher_Nine",
  "/wiki/Terrorist/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Coruscant/Legends",
  "/wiki/Battle_of_Druckenwell",
  "/wiki/Druckenwell/Legends",
  "/wiki/Republic_trooper",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Eradicator_(weapon)",
  "/wiki/Superweapon/Legends",
  "/wiki/Satellite/Legends",
  "/wiki/Operation:_Silverplate",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Kaas_City",
  "/wiki/Dominator_(Harrower-class)",
  "/wiki/Dromund_Kaas",
  "/wiki/VerveGen_Corporation",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Ghost_cell",
  "/wiki/Old_Man_(Ghost_cell)",
  "/wiki/Tatooine/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}