{
 "name": "Eater Of Fire Creepers",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nirauan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Qom Jha"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Qom Jha"
     ]
    }
   ]
  }
 ],
 "content": "Eater Of Fire Creepers was the Bargainer of the Qom Jha. He received his name must likely because he ate a dangerous insect called fire creepers. He had a distrust for the Qom Qae because they did not deliver a message to Luke Skywalker about the Chiss \"Threateners\" who had taken up residence on their planet of Nirauan as was the agreement between the two peoples. Because of this, when the young son of the Qom Qae Bargainer Child Of Winds led Skywalker to Qom Jha territory in an attempt to find his \"captured\" friend Mara Jade, Eater Of Fire Creepers distrusted Child Of Winds and blamed him for his people's failure.\nDespite his animosity for the Qom Qae, Skywalker and Jade successfully negotiated with Eater Of Fire Creepers for the Qom Jha's aid in entering the \"Threatener\" base. He sent along three guides, Builder With Vines, Splitter Of Stones and Keeper Of Promises to help them. After the two Humans and Child Of Winds had aided them in their struggle with the Chiss, they relieved the debt that was owed to them; Eater Of Fire Creepers later met with Hunter Of Winds, who both agreed that Luke and Mara should leave and that there should be peace between the two Nirauan native groups.\nEater Of Fire Creepers first appeared in the 1998 novel Vision of the Future written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nirauan/Legends",
  "/wiki/Qom_Jha_and_Qom_Qae",
  "/wiki/Gender/Legends",
  "/wiki/Bargainer",
  "/wiki/Fire_creeper",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Child_Of_Winds",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Builder_With_Vines",
  "/wiki/Splitter_Of_Stones",
  "/wiki/Keeper_Of_Promises",
  "/wiki/Human/Legends",
  "/wiki/Mission_to_Nirauan",
  "/wiki/Hunter_Of_Winds",
  "/wiki/1998",
  "/wiki/Vision_of_the_Future",
  "/wiki/Timothy_Zahn",
  "/wiki/Vision_of_the_Future_(unabridged_audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}