{
 "name": "Ebab",
 "display_name": "Ebab",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Taupe",
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree Village tribe"
     ]
    }
   ]
  }
 ],
 "content": "Ebab was an Ewok male who lived on the Forest Moon of Endor. In 3 ABY, he was tasked with guarding an Ewok artifact known as the bridge crystal, but he fell asleep on the job and the crystal was stolen. The next day, he ran over to Chief Chirpa in order to inform him of the proceedings and apologize for allowing the crystal to be unguarded.\nEbab was an Ewok male member of the Bright Tree Village tribe in Bright Tree Village on the Forest Moon of Endor. In 3 ABY, Ebab was tasked with guarding the bridge crystal, a powerful artifact that could be used to produce the Rainbow Bridge and was stored in the Council Hut. One night, the young Ewok scouts Wicket Warrick and Teebo attempted to steal the crystal in order to use it to find a cure for their ailing friend, Kneesaa a Jari Kintaka.\nThe pair entered the hut through a trapdoor in the roof by lowering themselves with a rope, where they found Ebab snoring in his sleep, mumbling about how no one was permitted to enter during his guard. Warrick and Teebo successfully retrieved the crystal and left the hut.\nThe next morning, Ebab rushed to the home of Chief Chirpa to alert him of the theft. He prefaced the warning by asking Chirpa for forgiveness for his blunder, explaining that he had dozed off. Chirpa asked him to speak up, and Ebab stammered that the rainbow crystal had been stolen, which shocked the Ewok chief.\nEbab was old by 3 ABY and fell asleep when he was required to guard the bridge crystal. Once he realized what he had done, he asked for Chirpa's forgiveness. Ebab had taupe-colored fur and black eyes. He also sported a white mustache.\nEbab wore green clothing and utilized a spear.\nEbab appeared in the first issue of the Ewoks comic series, which was written by David Manak, illustrated by Warren Kremer, and published by Marvel Comics on January 29, 1985.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ewok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Bright_Tree_Village_tribe",
  "/wiki/Endor/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Bridge_crystal",
  "/wiki/Sleep/Legends",
  "/wiki/Crystal/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Chief/Legends",
  "/wiki/Chirpa/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Rainbow_Bridge",
  "/wiki/Council_Hut",
  "/wiki/Youngling/Legends",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Teebo/Legends",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Royal_Hut",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Spear/Legends",
  "/wiki/Ewoks_1",
  "/wiki/Ewoks_(Marvel)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/David_Manak",
  "/wiki/Warren_Kremer",
  "/wiki/Marvel_Comics",
  "/wiki/January_29",
  "/wiki/1985",
  "/wiki/Category:Images_of_Ebab",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Publications_Timeline",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Marvel_Age",
  "/wiki/April"
 ]
}