{
 "name": "Ebya T'dell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 4992 BBY",
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Florid"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith"
     ]
    }
   ]
  }
 ],
 "content": "Ebya T'dell was a Human female born on the planet Kesh around 4992 BBY. She was the daughter of Sith Nafjan and Kanika T'dell, who were crewmembers of the Sith dreadnaught Omen when it crashed on Kesh in 5000 BBY. In 4985 BBY, when just seven years old, T'dell was examined by prominent Sith Seelah Korsin, to determine whether she would be able to have a family in the stringent Sith society.\nBorn around 4992 BBY, Ebya T'dell was a Human female native of the planet Kesh. She was the daughter of Sith crewmembers of the starship Omen—Nafjan and Kanika T'dell—who had survived the Sith dreadnaught's crash on Kesh eight years earlier. In 4985 BBY, T'dell was sent to be examined by Lady Seelah Korsin, who was to determine whether she would be allowed to reproduce in the new Keshiri Sith society. T'dell was closely examined by Korsin, an acquaintance of her parents, who noted her high cheekbones and expressed concern at the child's \"florid\" coloring. Ultimately, Korsin determined that T'dell might be allowed to have a family, if the proper partner was found. Momentarily safe in the knowledge that she might not be a genetic dead-end, T'dell left to play outdoors.\nEbya T'dell was a stern-faced child in good physical health, who was respectful and obedient toward the leaders of the Sith on Kesh, such as Seelah Korsin. Although only seven years old in 4,985 BBY, T'dell knew that she wanted to have a family, and was relieved when it was not ruled out for her when she was examined by Korsin. She believed that her duty as a Sith was to be like Korsin, a point T'dell's examiner did not want to argue.\nEbya T'dell made her only appearance in Star Wars canon in John Jackson Miller's 2010 eBook Lost Tribe of the Sith: Paragon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kesh",
  "/wiki/4992_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Nafjan_T%27dell",
  "/wiki/Kanika_T%27dell",
  "/wiki/Sith_dreadnaught",
  "/wiki/Omen",
  "/wiki/5000_BBY/Legends",
  "/wiki/4985_BBY",
  "/wiki/Standard_year/Legends",
  "/wiki/Seelah_Korsin",
  "/wiki/Orlenda",
  "/wiki/Starship/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Bone/Legends",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/John_Jackson_Miller",
  "/wiki/2010",
  "/wiki/EBook",
  "/wiki/Lost_Tribe_of_the_Sith:_Paragon",
  "/wiki/Crosscurrent"
 ]
}