{
 "name": "Ech-Char",
 "display_name": "Ech-Char",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue-green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Calamari monarchy"
     ]
    }
   ]
  }
 ],
 "content": "Ech-Char was the king of the planet Mon Cala at the time of the conflict between the First Order and the Resistance. Like his predecessor King Lee-Char during the last days of his life, Ech-Char was maintained on life support. The monarch was reluctant at first to commit Mon Cala to the Resistance despite Leia Organa's pleas.\nEch-Char was a Mon Calamari male and the king of the ocean planet Mon Cala. During or prior to 34 ABY, Ech-Char was on life support, like his ancestor King Lee-Char, decades earlier.\nAfter the Battle of Crait in 34 ABY, the depleted Resistance forces continued to rage war against the First Order military regime so they looked to find allies in order to rebuild their fleet. Turning to an old ally, General Leia Organa lead a Resistance party on a mission to Mon Cala convince the inhabitants to join their fight and rebuild the Resistance navy. After touching down on the planet, Organa expected to be welcomed by the Quarren and the Mon Calamari but was instead threatened by Quarren General, Nossor Ri's advisor Chadkol Gee. Ri told Gee to relax and leave it up to Ech-Char to decide to gut. But Gee still wanted to kill the Resistance operatives and save the king the trouble.\nShortly after, General Organa prepared to meet King Ech-Char with Aftab Ackbar, the son of the late Admiral Gial Ackbar. Ackbar warned Organa that Ech-Char might not have the fortitude to provide the ships the Resistance desperately needed but she did not see this as a problem.\nOrgana then joined Ackbar in meeting the king in a large room accompanied by many Quarren and Mon Calamari. Organa thanked Ech-Char for providing an audience for their meeting, believing it to be an honor. The king, told Organa from his life support to get straight to the point as he had much business to attend to. The Resistance general warned Ech-Char that the war would come to Mon Cala and swamp any business he wished to get done. She then reminded him of the sacrifice his ancestor, Lee-Char made against the Galactic Empire. Organa asked Ech-Char to trust in her again and give the Resistance the ships needed to fight back against the First Order. But King Ech-Char argued that his people were still nursing decades old wounds and then adjourned the meeting until the next day.\nBut General Organa would meet again with the king sooner then expected because her fellow Resistance operatives, Chewbacca, Rose Tico, and Rey were put on trial for starting a brawl with Quarren mob. In the Royal Throne Chamber of the Court Of Justice, Organa warned Tico that an apology might not be enough to satisfy him. Ri then announced that Ech-Char would be the judge of the Resistance operative's fate.\nKing Ech-Char told Organa that Mon Cala had welcomed her politely because of the history between her and his people, but this time she had gone too far. Ri then interuppted Ech-Char and told his liege to not be blinded by nostalgia. Arguments broke out throughout the chamber until Organa attempted to persuade the king to her side by telling him that only with the Mon Calamari at the Resistance's side the galaxy could be free. Gee took the chance to spin Organa's statement and offered to Ech-Char that the debate could be settle in the Ancient Rite of Challenge. But the king objected, believing that it was a barbaric custom that had not been invoked in centuries. But Rey agreed to fight Gee's AQ-series battle droid, Arkay-Nine in the Ancient Rite of Challenge as long as her friends were freed.\nAfterwards, King Ech-Char and other Quarren watched Rey duel Arkay-Nine in the Sacred Arena of Salka'a. During the fight, Arkay-Nine gained the upperhand and was about to kill Rey when Tico shot the droid's head off. But Tico acted as an outside force in the duel and violated the laws of the Challenge. Gee called for the Resistance members to be exiled from Mon Cala. Ech-Char agreed and reluctantly banished Organa and her band of freedom fighters from the planet.\nAs Organa's Resistance was preparing to leave Mon Cala, the First Order navy arrived above the planet. General Organa then immediately went to meet with King Ech-Char and refused to leave Mon Cala without the required vessels. At the Royal Throne Chamber, the king was angry about the arrival of the First Order but also a failed assassination attempted on General Organa by Gee's personal attendant. Organa then came forward with evidence that Gee had personally contacted the First Order that the Resistance was on Mon Cala. Ech-Char stated that Gee had committed treason and assured to Organa the he would not go unpunished.\nOrgana then once again attempted to convince the king to give her the ships she needed. She told Ech-Char that it was now the time for Mon Cala and the Resistance to join together. She believed that it was time to rekindle an old alliance that fought back against Imperial agression. It was only with the Mon Calamari ships, the Resistance had a chance and only by resisting, Mon Cala could remain free. Organa knew she would be asking a lot of the king and his people but called for everyone on Mon Cala to fight against the First Order. The speech reminded King Ech-Char of what Mon Cala stood for and agreed to doante the vessels to her cause. But the king feared it would be too late to get the ships through a First Order blockade. Ri decided he would be the one to break the blockade.\nGeneral Ri would sacrificed his life to give the fleet of Mon Cala a window of escape. Led by Aftab, the fleet escaped the grip of the First Order through hyperspace and would go on to be a major component in rebuilding the Resistance navy. Meanwhile, the First Order arrived on Mon Cala to make an example to the galaxy of the consequences of housing Resistance operatives.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Mon_Calamari_monarchy",
  "/wiki/King",
  "/wiki/Planet",
  "/wiki/Mon_Cala",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Lee-Char",
  "/wiki/Standard_day",
  "/wiki/Life_support",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Ocean",
  "/wiki/34_ABY",
  "/wiki/Standard_decade",
  "/wiki/Battle_of_Crait",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/General",
  "/wiki/Mission_to_Mon_Cala",
  "/wiki/Resistance_navy",
  "/wiki/Quarren",
  "/wiki/Nossor_Ri",
  "/wiki/Chadkol_Gee",
  "/wiki/Death",
  "/wiki/Aftab_Ackbar",
  "/wiki/Youngling",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Galactic_Empire",
  "/wiki/Chewbacca",
  "/wiki/Rose_Tico",
  "/wiki/Rey_Skywalker",
  "/wiki/Court_Of_Justice",
  "/wiki/Ancient_Rite_of_Challenge",
  "/wiki/Standard_century",
  "/wiki/AQ-series_battle_droid",
  "/wiki/Arkay-Nine",
  "/wiki/Sacred_Arena_of_Salka%27a",
  "/wiki/Droid",
  "/wiki/Exile_(punishment)",
  "/wiki/First_Order_Navy",
  "/wiki/Assassin",
  "/wiki/Unidentified_Quarren_saboteur",
  "/wiki/Treason",
  "/wiki/Time",
  "/wiki/Blockade",
  "/wiki/Mon_Cala_fleet",
  "/wiki/Viewport",
  "/wiki/Hyperspace",
  "/wiki/The_galaxy",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Ech-Char",
  "/wiki/Allegiance_2",
  "/wiki/Allegiance_3",
  "/wiki/Allegiance_4",
  "/wiki/20_BBY",
  "/wiki/1_ABY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Star_Wars:_Allegiance",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Battle_of_Batuu",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_(2015)_47",
  "/wiki/Star_Wars_(2015)_44",
  "/wiki/Standard_year",
  "/wiki/19_BBY",
  "/wiki/Star_Wars_(2015)_48",
  "/wiki/Allegiance_1"
 ]
}