{
 "name": "Echari_Di%27San",
 "display_name": "Echari Di'San",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vultan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cularin Trade Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Echari Di'San was a Vultan who was President of the Cularin Trade Alliance during the time of the Clone Wars.\nWhen Di'San was a child, his father would regularly beat him and his mother. This made him want to kill his father and he developed a hatred of all men who beat women.\nDuring the Clone Wars, Di'San went for a vacation on Dorumaa and while there, he met the young woman Kalani. She pretended to be interested him, but this was actually part of a scam engineered by Thon Larimhor. One evening, Kalani and Di'San dined in the Cantina Oceana in Dorumaa City, when Di'San was approached by Rysko Barnt, who had been hired by Larimhor to pose as Kalani's ex-boyfriend. Barnt was then generally unpleasant to Kalani and deliberately provoked Di'San, by hitting Kalani. Because of his childhood experiences, Di'San lost his composure and pinned Barnt against against a pillar and hit his head against it. Di'San then realized that he was about to cause serious injury to Barnt, so he stopped hitting him and let the other customers restrain him.\nBarnt was killed shortly afterward by Larinhor and when his body was found, Di'San was the main suspect and was arrested by the Cularin Office of Public Safety. He was taken to the Gadrin Judicial Center on Cularin, where he was held, awaiting a trial. Larimhor planned to help Barnt's family sue the CTA, which would harm its reputation, so Cyreno Taegon, the Vice President of the Trade Alliance, hired the Heroes of Cularin to find some evidence to have Di'San freed. Di'San was tried by judges from the Cularin Judicial Branch.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Vultan",
  "/wiki/Gender/Legends",
  "/wiki/Cularin_Trade_Alliance",
  "/wiki/President/Legends",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Dorumaa",
  "/wiki/Kalani_(person)",
  "/wiki/Thon_Larimhor",
  "/wiki/Cantina_Oceana",
  "/wiki/Dorumaa_City",
  "/wiki/Rysko_Barnt",
  "/wiki/Cularin_Office_of_Public_Safety",
  "/wiki/Gadrin_Judicial_Center",
  "/wiki/Cularin/Legends",
  "/wiki/Cyreno_Taegon",
  "/wiki/Vice_President/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Cularin_Judicial_Branch",
  "/wiki/Plea_Bargain"
 ]
}