{
 "name": "Echuu_Shen-Jon",
 "display_name": "Echuu Shen-Jon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0.5 ABY",
      "Geddes"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Mace Windu"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Stam Reath",
      "Naat Reath"
     ]
    }
   ]
  }
 ],
 "content": "Echuu Shen-Jon was a male human Jedi Master in the waning years of the Galactic Republic until its fall, and served as a Jedi General in the Clone Wars. During the war, he went into hiding and eventually re-emerged to fight for the Rebel Alliance.\nA Force-sensitive Human, Echuu Shen-Jon was educated in the ways of the Force by the Jedi Order at the Coruscant Jedi Temple. Upon graduating from the Temple academy, Shen-Jon was selected as a Padawan by Jedi Master Mace Windu. Successfully constructing a green-bladed lightsaber and passing his Trials of Knighthood, Padawan Shen Jon ascended to the rank of Jedi Knight.\nLater, as a Jedi Master, Shen-Jon took a Padawan of his own, Stam Reath, during the time that the Separatist Crisis plagued the Galactic Senate. The master and apprentice team joined Master Windu's task force formed to rescue Jedi Obi-Wan Kenobi, Anakin Skywalker, and Senator Padmé Amidala from Geonosis. Landing on the planet with over two hundred Jedi, Master Shen-Jon and Padawan Reath did not enter the Petranaki arena with the others; instead they were were assigned the task of destroying several Trade Federation core ships. They succeeded, and were then ordered to pursue Separatist leader Count Dooku as he attempted to reach his escape craft. Along the way they were intercepted by the Confederacy of Independent Systems General Sev'rance Tann, who quickly slew Padawan Reath before Master Shen-Jon's eyes.\nEscaping the battle, Master Shen-Jon slipped into depression. When General Tann reappeared from the shadows, taking the planet Sarapin in a shocking move with the help of stolen Decimator technology, the Jedi High Council hurriedly assigned Shen-Jon a new Padawan—Naat Reath, Stam Reath's sister.\nTogether, Shen-Jon and Reath led a series of successful campaigns against Tann and quickly took back Sarapin. As the weight of war increased, Master Shen-Jon and his new apprentice sank deeper into the lull of the dark side of the Force, each wanting revenge for the death of Stam Reath. Shen-Jon tracked Tann across the galaxy to the planet Krant, but along the way, Reath was captured by the Chiss general. Master Shen-Jon did not heed the warnings of Master Windu as he slipped into the dark side and went after Tann.\nAfter weeks of pursuit, Master Shen-Jon confronted Tann alone in the heart of a Confederate fortress on Krant. Besting her after calling upon the dark side of the Force, Shen-Jon carried out his revenge for his fallen Padawan and slew Tann. Contacting his current Padawan, Shen-Jon admitted he could not return to the Order until he had meditated on his crimes against the Jedi Code. He told Reath that she would make a fine Jedi Knight one day, and bade her return to the Temple for reassignment. This she did, but she never revealed Shen-Jon's location.\nMaster Shen-Jon survived in hiding for over two decades through the Galactic Empire's Great Jedi Purge and the disbanding of the Order. His exile spared his life from the Empire's forces. During this time period, he had lost his green lightsaber, but acquired a blue one, which from then on was his weapon of choice.\nIn 0.5 ABY, sometime after the destruction of the first Death Star, Shen-Jon reemerged from his exile when Princess Leia Organa crash-landed on the world of Krant. There he aided her in her struggle against the Empire, defending the cities of Krant with his lightsaber.\nLater, when Organa met with Utric Sandov, Shen-Jon was surprised to hear that the Imperials had found the ancient Jedi artifact Vor'Na'Tu. He accompanied her to Geddes, and together they obtained the artifact, but upon returning to their shuttle they found Darth Vader awaiting them. Vader demanded that they hand over the relic to him, but Shen-Jon refused to surrender and destroyed it instead. Shen-Jon engaged the Dark Lord in a duel, but his skills were no match for the Sith Lord's, and eventually Echuu Shen-Jon was killed. In dueling Vader, he gave Princess Organa enough time to escape.\nAfter his death, Echuu Shen Jon transcended the physical plane and lived on as a Force spirit. Years after his death and the defeat of the Empire at Endor, Master Echuu Shen-Jon's spirit warned the Princess and Luke Skywalker about the Vor'Na'Tu and urged them to return to Geddes, since terraformed and renamed Hanoon, to secure the relic once and for all. Organa and Skywalker liberated the world and destroyed the Vor'Na'Tu's shards. Shen-Jon was never known to contact them again.\nEchuu Shen-Jon was first mentioned in the strategy guide for the 2001 video game Star Wars: Galactic Battlegrounds. He appeared in the game's Rebel campaign, where he was voiced by Roger Jackson. His backstory was revealed in the expansion pack Clone Campaigns.\nDuring the Clone Wars, Echuu Shen-Jon had a green lightsaber. However, by the time of Leia Organa's visit, it had changed to blue. This may have been due to the fact that the model used to represent Shen-Jon was recycled from that of the game's Jedi Master class, which carries a blue lightsaber.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/0_ABY/Legends",
  "/wiki/Hanoon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Stam_Reath",
  "/wiki/Naat_Reath",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Jedi_academy",
  "/wiki/Padawan/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Geonosis_strike_team",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Petranaki_arena",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Core_ship/Legends",
  "/wiki/Count_of_Serenno/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/General/Legends",
  "/wiki/Sev%27rance_Tann",
  "/wiki/First_Battle_of_Sarapin",
  "/wiki/Sarapin/Legends",
  "/wiki/Decimator_(war_machine)",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Second_Battle_of_Sarapin",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Krant",
  "/wiki/Chiss/Legends",
  "/wiki/Battle_of_Krant",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Skirmish_in_the_Krant_system",
  "/wiki/Krantian_Civil_War",
  "/wiki/Battle_of_Krant_(Galactic_Civil_War)",
  "/wiki/Utric_Sandov",
  "/wiki/Jedi_artifact/Legends",
  "/wiki/Vor%27Na%27Tu",
  "/wiki/Battle_of_Geddes",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Force_ghost",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Terraforming/Legends",
  "/wiki/Battle_of_Hanoon",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Prima%27s_Official_Strategy_Guide",
  "/wiki/2001",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Roger_Jackson",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/Category:Audio_files_of_Echuu_Shen-Jon",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_59",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/Databank_(original)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_8"
 ]
}