{
 "name": "Edda_Gast",
 "display_name": "Edda Gast",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Saffalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Zsinj's Empire"
     ]
    }
   ]
  }
 ],
 "content": "Edda Gast was the scientist behind the mutating and \"Humanizing\" of alien species in an attempt to expand their minds allowing them to think and feel like Humans. Some of the main species that were used in Dr. Gast's experiments included Gamorreans such as Voort saBinring, Ewoks, and Talz.\nThe chief of the Project Chubar was her uncle, Dr. Tuzin Gast, but he began to love his creations and committed suicide with the more violent specimens. Edda then became the main scientist of the project.\nGast was captured by Wraith Squadron after their raid of the Binring facilities failed, and promised immunity from prosecution by Nawara Ven of Rogue Squadron after giving all information on Warlord Zsinj to the New Republic.\nAn assassination attempt was made on her by one of Zsinj's own Project Minefield subjects, but thwarted by Piggy. She was believed dead, but in reality was saved by Nawara Ven, making her new identity seem even more secure.\nShe was arrogant, and speciesist, but believed she would get away without punishment. Nawara offered her a chance to do good with her life, but she took the money. Her reward of half a million Imperial credits, which she picked over New Republic credits, was confiscated on Coruscant and she was arrested on the charge of smuggling. Then Nawara pointed out that under New Republic law, the smuggling of large sums of Imperial credits brought with it the charge of sedition. Her last action was to spit on Nawara Ven, when she thought he set her up.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Saffalore",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Zsinj%27s_Empire",
  "/wiki/Scientist/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Voort_saBinring",
  "/wiki/Ewok/Legends",
  "/wiki/Talz/Legends",
  "/wiki/Project_Chubar",
  "/wiki/Tuzin_Gast",
  "/wiki/Binring_Biomedical_Product",
  "/wiki/Nawara_Ven",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/New_Republic/Legends",
  "/wiki/Project_Minefield",
  "/wiki/Speciesist",
  "/wiki/X-Wing:_Solo_Command",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}