{
 "name": "Ederlathh_Pallopides",
 "display_name": "Ederlathh Pallopides",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "4 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ederlathh Pallopides was a Human female and the remote great-niece of Emperor Palpatine, ruler of the Galactic Empire. During the power struggle that ensued after Palpatine's death in 4 ABY, a faction of the Imperial Navy backed Pallopides's hereditary rights to her great-uncle's throne. In reality, she was a political pawn in Admiral Betl Oxtroe's plan to reunite the fractured Empire by using Pallopides as a figurehead Empress.\nEderlath Pallopides was born in 4 BBY, roughly four years before the Battle of Yavin. At the age of eleven, Pallopides was presented to the New Republic Provisional Council as the great-niece of the late Emperor Palpatine in 7 ABY by Admiral Betl Oxtroe, a high-ranking officer in the Imperial Navy. By this time, the Galactic Civil War had been going badly for the Galactic Empire since the loss of its leader in 4 ABY.\nWith the Empire in decline and the New Republic—the successor state of the Rebel Alliance—in the ascent, Admiral Oxtroe attempted to end the war through diplomacy before the Empire lost what remained of its ability to negotiate an outcome other than unconditional surrender. Hence, Oxtroe made overtures to the New Republic Provisional Council and proposed to reform the Empire into a constitutional monarchy.\nThus, she intended to install Pallopides on the vacant Imperial throne as the first Empress of the Galactic Empire. As a child, however, Pallopides could only rule as a symbolic figurehead while actual governmental authority was wielded by more experienced officials. As such, Admiral Oxtroe offered the position of Imperial Advisor to the members of the Provisional Council. This arrangement would then place the Empire under joint Imperial-Republic rule, although actual leadership of the new government would be controlled by the Council in its advisory role to Empress Pallopides.\nUltimately, the Admiral's vision for the New Galactic Empire was never realized. Before her negotiations could be taken any further with the Council, she was killed by unidentified assassins, although later New Republic accounts implicated the Noghri for the assassination of Betl Oxtroe. As a result, Pallopides did not succeed her alleged great-uncle as the next ruler of the galaxy. The Empire itself continued to decline at an accelerated rate, dwindling into a small remnant of its former glory. By 19 ABY, the Empire—what little remained of it—effectively surrendered to the New Republic, thus concluding the civil war that engulfed the galaxy for roughly two decades.\nEderlathh Pallopides was one of the select few females of note in the highly male-dominated Human-centric Galactic Empire, although her position was primarily owed to her alleged blood connection to Emperor Palpatine. Despite the fact that the Empire lacked an official policy regarding hereditary succession, especially given how the Emperor secretly intended to rule indefinitely through cloned versions of himself, Pallopides's status as Palpatine's great-niece made her a natural candidate for the Imperial throne in Admiral Betl Oxtroe's opinion.\nEderlathh Pallopides was first mentioned in the Dark Empire Sourcebook, authored by Michael Allen Horne and published in 1993. Although Pallopides was identified as the great-niece of Emperor Palpatine, the novel Darth Plagueis revealed that Palpatine murdered the members of his immediate family, including his younger siblings. However, the same novel also mentioned that Palpatine's father, Cosinga Palpatine, also had an extramarital affair with a mistress, leaving open the possibility of her lineage to Palpatine being valid.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Death/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Imperial_throne",
  "/wiki/Admiral/Legends",
  "/wiki/Betl_Oxtroe",
  "/wiki/Imperial_Civil_War",
  "/wiki/Emperor/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/New_Republic_Provisional_Council",
  "/wiki/7_ABY/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/King/Legends",
  "/wiki/Imperial_Advisor",
  "/wiki/Council",
  "/wiki/Advisor/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Noghri/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/19_ABY/Legends",
  "/wiki/Pellaeon%E2%80%93Gavrisom_Treaty",
  "/wiki/Civil_war",
  "/wiki/Humanocentrism",
  "/wiki/DNA/Legends",
  "/wiki/Imperial_family",
  "/wiki/Cloning/Legends",
  "/wiki/Prime_clone",
  "/wiki/Dark_Empire_Sourcebook",
  "/wiki/Michael_Allen_Horne",
  "/wiki/1993",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Palpatine%27s_siblings",
  "/wiki/Cosinga_Palpatine",
  "/wiki/Cosinga_Palpatine%27s_mistress",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Star_Wars:_Dark_Empire"
 ]
}