{
 "name": "Edmo_Ectacle",
 "display_name": "Edmo Ectacle",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lespectus"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Moldwarp"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "6 feet"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "180 pounds"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Edmo Ectacle was a Moldwarp male with gray hair and brown skin. In 34 ABY, Ectacle was in the Canto Casino in the city of Canto Bight and watched other patrons play at the game tables before speaking with Derla Pidys on one of the casino's balconies. Ectacle later hid in Black Spire Outpost on the planet Batuu while the was an oustanding bounty on him. At around this time, the pirate Hondo Ohnaka used Ectacle's stolen identity profile to test potential employees of Ohnaka Transport Solutions.\nEdmo Ectacle was a Moldwarp male who was born on the planet Lespectus around 22 BBY. In 34 ABY, he was present in the Canto Casino within the city of Canto Bight on the planet Cantonica. While in the casino, Ectacle spent time at the game tables and watched the Suerton Thodibin playing at one. The Moldwarp then moved out onto one of the casino's balconies, which overlooked a fathier race taking place on the Canto Bight racetrack. While on the balcony, Ectacle spoke with the liquor trader Derla Pidys while the Resistance agents Finn and Rose Tico watched the race nearby.\nDuring the First Order occupation of the planet Batuu in 34 ABY, there was an outstanding bounty of 875 credits on Ectacle for gambling debts, racketeering, and theft of a gold-plated ark from the local antiques dealer Dok-Ondar. Ectacle was hiding in one of the buildings of Black Spire Outpost on Batuu when the bounty was assigned to an individual visiting the outpost by the Bounty Hunters' Guild. The visitor then used a thermal scanner to uncover Ectacle's location, which they reported to the local Guildmaster's Hideout in order to collect the bounty. During this time frame, the pirate Hondo Ohnaka had obtained a stolen identity profile of Ectacle, who was fifty-six years old at the time. Ohnaka sent the profile, along with several others, to the datapad of individuals interested in joining a potential flight crew that he was putting together for a job with Ohnaka Transport Solutions. The pirate had the individuals memorize details from the profile and then quizzed them on the information.\nEdmo Ectacle had black eyes, gray hair, and brown skin. He stood six feet tall and weighed 180 pounds.\nEctacle wore a black jacket, robes, and belt over a white shirt. He used a medicated aerosol inhaler and wore white goggles.\nEdmo Ectacle first appeared in the 2018 sequel trilogy film, Star Wars: Episode VIII The Last Jedi, and he was first named in the reference book Star Wars: The Last Jedi: The Visual Dictionary, which was written by Pablo Hidalgo and released alongside the film. The character was portrayed by creature and droid performer Tom Wilton, who described the costume as easy to see out of and breathe in. Finishing touches were added to the costume by Kati Hood, and concept art of Ectacle, titled \"Cantina Aliens 37A,\" was produced by creature concept designer Jake Lunt Davies for the film.\nIn the film's deleted scenes, Ectacle can be seen cheering at one of the gaming tables. Wilton has said that director of photography Steve Yedlin selected Ectacle out of a lineup to appear in another shot that ultimately did not make it into the film. In that shot, Ectacle climbs out from under a table after Canto Casino was wrecked by escaped fathiers. He then walks to the center of the room and surveys the damage before shaking his head.\nEdmo Ectacle's surname is misspelt as \"Ectaclee\" in Star Wars: Batuu Bounty Hunters, an augmented reality video game launched at Walt Disney World on July 27, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Lespectus",
  "/wiki/22_BBY",
  "/wiki/Moldwarp",
  "/wiki/Gender",
  "/wiki/Foot",
  "/wiki/Pound",
  "/wiki/Color",
  "/wiki/Hair",
  "/wiki/34_ABY",
  "/wiki/Canto_Casino_and_Racetrack",
  "/wiki/City",
  "/wiki/Canto_Bight",
  "/wiki/Gambling",
  "/wiki/Derla_Pidys",
  "/wiki/Casino",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Bounty",
  "/wiki/Time",
  "/wiki/Pirate",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Thief",
  "/wiki/Ohnaka_Transport_Solutions",
  "/wiki/Reproduction",
  "/wiki/Cantonica",
  "/wiki/Suerton",
  "/wiki/Thodibin",
  "/wiki/Fathier",
  "/wiki/Racetrack",
  "/wiki/Liquor",
  "/wiki/Merchant",
  "/wiki/Resistance",
  "/wiki/Finn",
  "/wiki/Rose_Tico",
  "/wiki/First_Order",
  "/wiki/Battle_of_Batuu",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Credit",
  "/wiki/Gold",
  "/wiki/Antiques_dealer",
  "/wiki/Dok-Ondar",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Thermal_scanner",
  "/wiki/Guildmaster%27s_Hideout",
  "/wiki/Standard_year",
  "/wiki/Datapad",
  "/wiki/Heist_on_a_First_Order_train",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Robe",
  "/wiki/Belt",
  "/wiki/Aerosol_inhaler",
  "/wiki/Goggles",
  "/wiki/2018",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Droid",
  "/wiki/Tom_Wilton",
  "/wiki/Kati_Hood",
  "/wiki/Jake_Lunt_Davies",
  "/wiki/Steve_Yedlin",
  "/wiki/Star_Wars:_Batuu_Bounty_Hunters",
  "/wiki/Video_game",
  "/wiki/July_27",
  "/wiki/2022",
  "/wiki/Category:Images_of_Edmo_Ectacle",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/File:FlightCrewsWanted-IDIntro.png",
  "/wiki/File:EdmoEctacle-GEDatapad.jpg",
  "/wiki/File:BatuuBountyHunters-EdmoEctaclee.png",
  "/wiki/Star_Wars:_The_Last_Jedi_Activity_Book_with_Stickers",
  "/wiki/The_Art_of_Star_Wars:_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Star_Wars:_Rise_of_the_Resistance",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Battle_of_Starkiller_Base"
 ]
}