{
 "name": "Edmos_Khurgee",
 "display_name": "Edmos Khurgee",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Edmos Khurgee was a male human who served the Galactic Empire as a security officer with the military rank of captain during the Galactic Civil War against the Alliance to Restore the Republic. During the war he served on board the Death Star, and was in charge of having the Millennium Falcon searched when it was brought on board by the station's tractor beams.\nA male human, Edmos Khurgee came to serve as an officer in the military of the Galactic Empire, a fascist regime led by Emperor Sheev Palpatine. As such, he participated in the Galactic Civil War, in which the Empire fought the Alliance to Restore the Republic, a resistance movement that sought to overthrow Palpatine and restore democracy to the galaxy.\nAt some point, Khurgee served as the model for the male officer appearing on the propaganda poster COMPNOR Recruitment, which incited citizens to join the Commission for the Preservation of the New Order , an agency responsible for the propagation of the Empire's underlying ideology. While it hinted that the captain might have enjoyed a privileged relationship with COMPNOR officials, as cronyism was the norm at the time, it also started unfounded rumors that Khurgee and the artist, Dasita Lyros, were lovers.\nIn 0 BBY, Khurgee was a security officer with the rank of captain, and he was stationed aboard the Death Star, the Empire's brand new sphere-shaped deep space mobile battle station. One day, the Death Star's tractor beams captured a Corellian freighter entering the area of space containing the remains of the planet Alderaan, which had just been destroyed by the battle station. When the captured craft, the Millennium Falcon, was deposited in Docking Bay 327, Captain Khurgee led the initial inspection in person, searching the premises and checking the ship's log. Because there did not seem to be anyone on board, and because the log recorded that the crew abandoned ship immediately after takeoff, the captain concluded the Falcon might have been merely a decoy. Khurgee then reported his observations and conclusions to Darth Vader, the Emperor's black-armored enforcer, who nevertheless ordered him to send a scanning crew aboard to perform a more thorough search.\nWhile on duty aboard the Death Star, Edmos wore a gray Imperial officer's uniform made of gaberwool, including a cap with an identity disk. He wore two code cylinders and a rank insignia plaque on his breast. The plaque showed a single row of six amber squares.\nCaptain Khurgee first appeared in Star Wars: Episode IV A New Hope in 1977. Although not credited in the film, he was played by Chicago native and actor Christopher Muncke. The first name \"Edmos\" was created by Pablo Hidalgo for the 2016 reference book Star Wars Propaganda: A History of Persuasive Art in the Galaxy.\nMuncke's scenes were shot in one day at Elstree Studios near London, England. The actor recalled that, while he expected the make up crew to cut his hair because he was going to play a military officer, they told him they only needed to trim it a little, because the movie takes place in a totally different time altogether.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Edmos_Khurgee",
  "/wiki/Khurgee",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Stormtrooper",
  "/wiki/Security_officer",
  "/wiki/Military_rank",
  "/wiki/Captain",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Millennium_Falcon",
  "/wiki/Space_station",
  "/wiki/Tractor_beam",
  "/wiki/Imperial_officer",
  "/wiki/Imperial_Military",
  "/wiki/Fascism",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Democracy",
  "/wiki/The_galaxy",
  "/wiki/Propaganda",
  "/wiki/Painting",
  "/wiki/COMPNOR_Recruitment",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order",
  "/wiki/New_Order",
  "/wiki/Artist",
  "/wiki/Dasita_Lyros",
  "/wiki/0_BBY",
  "/wiki/Realspace",
  "/wiki/Battle_station",
  "/wiki/Standard_day",
  "/wiki/Corellia",
  "/wiki/Freighter",
  "/wiki/Alderaanian_Graveyard",
  "/wiki/Planet",
  "/wiki/Alderaan",
  "/wiki/The_Disaster",
  "/wiki/Docking_Bay_327",
  "/wiki/Anakin_Skywalker",
  "/wiki/Armor",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Gaberwool",
  "/wiki/Hat",
  "/wiki/Officer%27s_disk",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/1977",
  "/wiki/Christopher_Muncke",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2016",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Elstree_Studios",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/End_of_Watch",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/The_Rise_of_the_Rebellion_and_the_Battle_of_Yavin",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/March_19",
  "/wiki/2020"
 ]
}