{
 "name": "Edouard_Fenel",
 "display_name": "Edouard Fenel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fel Empire",
      "Empire-in-exileImperial NavyBastion Second Fleet",
      "Imperial NavyBastion Second Fleet",
      "Bastion Second Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Edouard Fenel was a Human male Imperial admiral who was loyal to Roan Fel's Empire-in-exile during the Second Imperial Civil War. Fenel was placed in command of the Bastion Second Fleet.\nThe Human male Edouard Fenel served the Fel Empire during the Sith–Imperial War. He commanded the starship Resolute during the Battle of Caamas, where he was responsible for, in Gar Stazi's words, \"picking off cruisers too heavily damaged to put up a fair fight.\"\nWhen the Sith seized control of the Empire, Fenel ultimately decided to support Emperor Fel. He was commander of the Bastion Second Fleet when the Galactic Alliance Remnant and Empire-in-exile agreed to work together against the Sith. When the first joint operation was decided on, Fel chose Fenel to lead the forces loyal to his empire in the battle alongside Stazi. Stazi suspected that Fel assigned Fenel to test him and the Remnant.\nDuring the Battle of Ralltiir, Fenel and Stazi pitted their fleets against the Sith's Coruscant Third Fleet. There were two objectives to this battle: capture the Sith fleet and force the Sith to extend their forces thinner. During the battle, Fenel told Admiral Kelsan to surrender his fleet or be destroyed, and even encouraged mutiny if the ship's officers refused to do so. Kelsan agreed to surrender.\nBut the plan fell apart when Vaclen Tor, captain of the Steadfast, refused to do so and called on the rest of the Third Fleet to self-destruct their ships and escape. Fenel ordered all Imperial ships, including the surrendering Imperial fleet, to destroy the Steadfast; however this encouraged Kelsan to order his fleet to self-destruct instead of surrender. Fenel ordered his forces to destroy the escape pods and destroy the remaining ship, but Stazi had had enough of Fenel's ruthless tactics. Stazi placed his fleet between Fenel and Kelsan's fleets and ordered his fleet to obliterate Fenel's forces if any of them shot at their forces. Stazi allowed Kelsan's crews to evacuate their ships and detonate them.\nHowever, the Steadfast had been damaged by Fenel's barrage—their escape pods and self-destruct systems were disabled. Fenel, after finding this out, ordered his forces to destroy Tor's vessel. He advised Stazi to pull his own forces away from the Steadfast, but Stazi refused to back down. He ordered his fleet to fire a barrage of blocking fire between Fenel's fleet and Tor's vessels, prompting Fenel to call off the attack.\nRoan Fel later apologized to Stazi for Fenel's tactics, saying he thought Fenel understood the situation better than he really did.\nEdouard Fenel believed that Roan Fel was the rightful Emperor, and therefore supported him when the Sith seized control of the Empire. However, Fenel was a ruthless man when it came to dealing with his emperor's enemies, even willing to use the Sith's own brutal tactics against them.\nFenel was also very critical of the Galactic Alliance, particularly Gar Stazi, as he insulted him regularly when they were working together.\nEdouard Fenel was introduced in the 36th issue of Star Wars: Legacy, Renegade, published by Dark Horse Comics. Created by series writer John Ostrander for the issue, the character of Edouard Fenel was drawn by established Legacy penciler Omar Francia. Fenel was colored by Brad Anderson, who had worked on every comic in the series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fel_Empire",
  "/wiki/Empire-in-exile",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Bastion_Second_Fleet",
  "/wiki/Admiral/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Resolute_(Fel_Empire)",
  "/wiki/Battle_of_Caamas",
  "/wiki/Gar_Stazi",
  "/wiki/One_Sith",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Battle_of_Ralltiir_(Second_Imperial_Civil_War)",
  "/wiki/Coruscant_Third_Fleet",
  "/wiki/Peto_Kelsan",
  "/wiki/Vaclen_Tor",
  "/wiki/Captain/Legends",
  "/wiki/Steadfast_(Ardent-class)",
  "/wiki/Jhoram_Bey",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Legacy_(2006)_36",
  "/wiki/Dark_Horse_Comics",
  "/wiki/John_Ostrander",
  "/wiki/Omar_Francia",
  "/wiki/Brad_Anderson"
 ]
}