{
 "name": "Edvar_Vang",
 "display_name": "Edvar Vang",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Doctor Edvar Vang was a Human male medic who lived on Rori during the Galactic Civil War.\nEdvar Vang resided in the city of Narmle and practiced in the local medical center. He was a cousin of Tyla Jinn, a woman living on Naboo. During his career, Doctor Vang had worked for the Galactic Empire as well as for the Rebel Alliance. He had ties with both Imperial and Rebel officers Jevan Monsul and Veega Madish\nAfter the Battle of Yavin, Doctor Vang and a friend by the name of Moxxar Krieg discovered the existence of a new kind of spice. This spice was trafficked by the Rebel Alliance but was also sought by the powerful criminal organization Black Sun. After they were detected and threatened, Vang considered that the situation had become too dangerous while Krieg decided to continue to investigate the source of this spice. The latter was finally assassinated in his house on Tatooine. In 1 ABY, a group of spacers discovered a sample of the new spice while looking for a missing pilot, Cal Handro. They brought it to Doctor Vang but the latter exhorted them to interrogate Krieg instead of him, ignoring that his fried was already dead. The spacers traveled to Tatooine but only found the corpse of Moxxar Krieg in his house in Mos Eisley.\nEdvar Vang was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Edvar Vang was added to the game with the first chapter of the \"Secrets of the Syren\" questline, released with the \"Publish 14\", on March 9, 2005. The \"Secrets of the Syren\" story arc was removed from the game with the \"Chapter 1\", published on June 8, 2006, due to the major changes planed for Rori with the introduction of the Battle of Restuss.\nEdvar Vang's appearance would fluctuate after each server reset, but he consistently appeared as a Human male under the template \"scientist_human_male\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tyla_Jinn",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Doctor/Legends",
  "/wiki/Medic/Legends",
  "/wiki/Rori/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Narmle_(city)",
  "/wiki/Naboo/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Jevan_Monsul",
  "/wiki/Veega_Madish",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Moxxar_Krieg",
  "/wiki/Syren_spice",
  "/wiki/Black_Sun/Legends",
  "/wiki/Moxxar_Krieg%27s_house",
  "/wiki/Tatooine/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Cal_Handro",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/March_9",
  "/wiki/2005",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Battle_of_Restuss",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}