{
 "name": "Eelien Kirat",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nalmar crime family"
     ]
    }
   ]
  }
 ],
 "content": "Eelien Kirat was a tall, muscled near-Human who was distinguished by his silver eyes, white hair, and dark gray skin. A stubborn man, Kirat had been abandoned by his parents on Genesia, and he grew up in the streets. Kirat was eventually taken in by Ral Nalmar, and worked hard to learn everything he could about Nalmar's criminal organization. Kirat moved up through the ranks very quickly, and was named as Nalmar's second in command, shortly before the Nalmar estate was attacked and destroyed by the forces of Qual'om Soach. In the wake of Ral's death, Kirat assumed command of the Nalmar organization, a move supported by the majority of its members. This move came as a surprise to Elana Nalmar, Ral's only surviving child, whom Kirat was obliged to name as his own second-in-command. After assuming command, Kirat expanded the Nalmar organization beyond its smuggling roots, branching into extortion and fraud. He also worked to maintain an uneasy truce with Soach, despite their mutual goal of controlling Genesia's criminal underground.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nalmar_crime_family",
  "/wiki/Genesia",
  "/wiki/Ral_Nalmar",
  "/wiki/Qual%27om_Soach",
  "/wiki/Elana_Nalmar",
  "/wiki/Flashpoint!_Brak_Sector",
  "/wiki/Pirates_%26_Privateers"
 ]
}