{
 "name": "Eelo Begraas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bothawui"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Navy of Thaere"
     ]
    }
   ]
  }
 ],
 "content": "Eelo Begraas was a Bothan male from the planet Bothawui. Working initially as a Podracer, Begraas later trained as a fighter pilot, going on to become a legend throughout the Mid Rim. The scrawny Bothan worked for seven years for the Navy of Thaere, although he was often loaned out to other organizations, including several Hutts. Begraas flew a customized Z-95 Headhunter, the Dicer; with a distinctive red-and-black appearance, its presence often caused opposing pilots to disengage and flee battles rather than face the Bothan.\nA Bothan male, Eelo Bregraas hailed from the Bothan homeworld of Bothawui. While he was gifted in classic Bothan arts, he was driven to seek an alternate lifestyle by his flair for the dramatic and an addiction to adrenaline. As such, Begraas raced Podracers at an early age and left his home system upon reaching adulthood to enlist in various military organizations. Moving from militia to militia, Begraas became an elite pilot, earning a fearsome reputation that frequently preceded him. Begraas also customized his own Z-95 Headhunter to make it more maneuverable, eventually naming the ship the Dicer. Begraas was rumored to have acquired prototype technology during one job for the Hutts, which he installed in his starfighter.\nBegraas was eventually recruited by the Navy of Thaere, from the Mid Rim Thaereian system, where he became the top-ranked pilot and was employed as chief flight instructor and overall naval tactical adviser. He worked in this capacity for seven years, during which time the Navy of Thaere rented his services to a number of other planetary militaries. This arrangement worked well for the Navy, both for the high price it could charge for the Bothan's services and because it kept Begraas—known for his short attention span—sufficiently entertained in his role that he remained working for the Navy.\nBegraas occasionally got into fights while planetside. However, he was often accompanied by his astromech droid, R6-S1, which he equipped with two mounted blaster pistols. Begraas nicknamed the droid \"Shootfirst\" and used the droid to cover his escape from such fights. On two separate occasions, Begraas performed a strafing run over settlements where he was attacked. These incidents added to his reputation. In 31 BBY, Begraas was sighted leading training missions near Morjakar, a planet within the Cularin system, for which the Thaereian military was the Senate-appointed protector.\nBegraas was a scrawny Bothan with an almost comical physical appearance that made him appear unimposing, in stark contrast to his piloting persona. He had a permanent sniffle, forcing him to constantly wipe his nose. Begraas wore faded fatigues, rather than any specific military uniform.\nBegraas had a short attention span and was quick to anger. The Bothan thrived on adrenaline, which led to his pursuits of dangerous careers—first as a podracer, then as a starfighter pilot. He developed a fearsome reputation, which meant many opposing pilots went into hysterics when facing him and tried to flee into hyperspace. This reputation was aided by his distinctive starfighter, which he painted black so as to blend in with the stars. To this he added blood red highlights and his personal insignia of a closed fist.\nBegraas could speak Basic, Bothese, Caarite and Huttese.\nEelo Begraas was created by Morrie Mullins in the article Troop Movements, published on the Wizards of the Coast website. The article was a supplement for the Living Force RPG campaign.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Bothawui/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Thaereian_military",
  "/wiki/Planet/Legends",
  "/wiki/Podracer/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Standard_year/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Dicer_(starfighter)",
  "/wiki/Color/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Both_system",
  "/wiki/Starship/Legends",
  "/wiki/Thaereian_system",
  "/wiki/Time/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/R6-S1",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Droid/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Morjakar",
  "/wiki/Cularin_system",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Star/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Bothese",
  "/wiki/Caarimala",
  "/wiki/Huttese/Legends",
  "/wiki/Morrie_Mullins_(person)",
  "/wiki/Troop_Movements",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Roleplaying_game",
  "/wiki/Wizards.com",
  "/wiki/Long_Live_the_Republic"
 ]
}