{
 "name": "Eeth Koth",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Iridonia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 14 BBY",
      "on an unidentified planet"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.87 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eeth Koth's family",
      "Jedi Order",
      "Jedi High Council",
      "Jedi assault team",
      "Jedi High Council",
      "Jedi assault team",
      "Galactic Republic",
      "Eeth Koth's fleet",
      "Grand Army of the Republic",
      "Eeth Koth's fleet",
      "Grand Army of the Republic",
      "Church of the Ganthic Enlightenment"
     ]
    }
   ]
  }
 ],
 "content": "Eeth Koth was a Force-sensitive Iridonian Zabrak male native to the planet Iridonia, who also held the title of Jedi Master within the Jedi Order, serving on the Jedi High Council in the final years of the Galactic Republic. Alongside his fellow Jedi, Koth participated as a Jedi General for the Grand Army of the Republic during the Clone Wars against the Confederacy of Independent Systems. Following his survival of the war's opening battle on the planet Geonosis, in 21 BBY, Koth was assaulted and captured by Separatist General Grievous, who later used the captive Jedi to lure others into a trap. There, the Jedi Master narrowly evaded his death, after being rescued by Republic forces in a battle over the planet Saleucami, led by Jedi Generals Obi-Wan Kenobi, Adi Gallia and Anakin Skywalker.\nSometime following his rescue, Koth was eventually relinquished of his seat on the High Council, where it was subsequently presented to Jedi Master Agen Kolar, leading to the Iridonian's dismissal of the Jedi Order. Later, by the time of the Galactic Empire—the successor state to the Republic—the former Jedi devoted to being a priest in the Church of the Ganthic Enlightenment on a desert planet. Koth's retirement gave way to marriage to his wife Mira, who eventually gave birth to the former Jedi's infant daughter. However, shortly after her birth, the Sith Lord Darth Vader—formerly the Jedi Knight Anakin Skywalker—located Koth on the desert planet during his eradication of the remaining Jedi. In their duel, Koth was killed by the Sith Lord, who then abducted his child, having selected her as a candidate for the Imperial Project Harvester.\nHailing from the Mid Rim planet of Iridonia, Eeth Koth was discovered to be Force-sensitive and was brought to the Jedi Temple to be trained as a Jedi at the age of four. He soon became a Jedi Master and was appointed to the Jedi High Council by 40 BBY.\nKoth was on the Council when the outcome of a mission on Nameel was stated to the Council. Cere Junda explained how she was provoked during the mission and attacked some of the Trandoshans, and the Council decided to send them to Ontotho to oversee the excavation of an Ontothon temple.\nSometime later, Koth was present at a Council debate over the dispute between the Czerka Arms and the Pijali monarchy.\nKoth, a male Zabrak, served as a member of the Jedi High Council around the time of the Battle of Naboo in 32 BBY and the revelation of the new Sith presence of Darth Sidious and his apprentice Darth Maul. Koth was present when a nine-year-old Anakin Skywalker was presented to the council and tested by Mace Windu for his force abilities and midi-chlorian count. Because Koth had started his own training at an unusually late age, he was more receptive than his fellow councilors to Jinn's appeal to train Skywalker. After Jinn's death, his last words were for Skywalker to be trained so Koth and the rest of the Council consented. Later, he went to Jinn's funeral.\nMaster Koth continued to sit on the Jedi Council during the Separatist Crisis, in 22 BBY. When Padmé Amidala had several attempts on her life, Koth approved Obi Wan Kenobi to investigate and Skywalker to serve as her bodyguard.\nTo rescue Kenobi, Skywalker and Amidala, Koth followed Master Windu and his assault team to the planet Geonosis. During the battle, Koth was believed to have been killed when his gunship took a direct hit. However, Koth survived and soon returned to active duty.\nShortly after the battle, Master Windu was sent on a team of other Jedi, Kit Fisto, Prosset Dibs, and Rissa Mano, to the Outer Rim Territories planet Hissrich to discern the threat level of a Separatist occupation. Koth was present on the Council meeting in which the outcome of the mission was reported and treasonous charges were placed against Dibs. Windu convinced the other Masters to show mercy and Dibs was confined in the library.\nWhile on a mission to find those who had launched attacks on hyperspace routes with his fleet, Koth's flagship, the Steadfast, was engaged near the planet Arda in the Outer Rim by Separatist forces under the command of General Grievous. Clone Captain Lock and the clone troopers of General Koth's unit held off the super battle droids for as long as possible, until Master Koth ordered them to get to the escape pods. As the droid General boarded Koth's ship, the Zabrak Jedi was forced to confront the cyborg inside the bridge. Though he managed to be a worthy opponent for Grievous and\npossibly could have beat him, he was eventually overpowered by Grievous's IG-100 MagnaGuards. But instead of being killed, as Grievous normally would have done, Koth was taken hostage after Grievous claimed his lightsaber. Grievous, having bested the Jedi Master, intended to torture him to death. Grievous sent a transmission to the Jedi Temple, gloating over the Jedi's capture and torturing him with his MagnaGuards. However, Koth was able to communicate with his fingers via a secret message his location, allowing a Jedi task force to be sent to rescue him.\nRecognizing the coordinates as those of the Saleucami system, the council dispatched Anakin Skywalker, Obi-Wan Kenobi, and Adi Gallia to rescue Koth. Boarding Grievous's ship secretly, Gallia and Skywalker rescued the Jedi Master while Kenobi engaged Grievous in battle. Fighting their way through numerous droids, they managed to get Koth to safety. After Grievous' escaped via escape pod to Saleucami below, Skywalker and Kenobi followed him while Gallia brought an injured Koth to a medical frigate. Although the Jedi were relieved that they had saved Eeth Koth, they were displeasure at not having won a significant victory.\nMaster Koth continued to serve as a member of the Jedi council throughout the early years of the Clone Wars following the First Battle of Geonosis. Shortly after the Senate hostage crisis, Koth was present in which Skywalker and Senator Amidala reported to the Council that Risha Synata had turned to the Separatists. After stating their report, Synata was found guilty of treason and put into custody.\nIn 20 BBY, he was present through holographic form in the Jedi High Council when they discussed about an ancient Jedi Code that was sent to them. They decided to send Kenobi, Skywalker and Skywalker's Padawan, Ahsoka Tano, to see what was going on.\nLater that year, the Festival of Light, a festival that celebrated Naboo's 847th anniversary for joining the Galactic Republic, he was present at the Jedi Temple communication center when the Council discussed about Supreme Chancellor Sheev Palpatine's safety. Jedi Masters Windu and Yoda told everyone that Kenobi , was still alive and undercover as Hardeen. Skywalker, determined, said that he wanted the mission completed.\nKoth was present at the Jedi High Council when they were contacted by the Onderon rebels who asks them to help them defeat the Confederacy of Independent Systems. The Council began deliberating about whether or not they should send help, but after listening to Skywalker's argument in favor of sending a team to help train the rebels, they agreed to send Skywalker, Tano, Kenobi, and Captain Rex to help them.\nIn 19 BBY, the Jedi Temple hangar was bombed and Letta Turmond was put into custody for the incident. She asked to bring Tano in for her to tell something to her, but before she could, she was Force-choked to death. Tano was arrested as she was the only one in the room with Turmond, but she soon escaped.\nKoth and the Council discussed about how they should catch Tano. Everyone present believed that she was guilty except for Skywalker, Kenobi, and Plo Koon. Because of this, Yoda decided to send them to catch Tano, though with some resistance from Mace Windu, who worried that Skywalker's emotional connection to Tano would further complicate the situation. Tano was ultimately captured.\nKoth was later present when Wilhuff Tarkin told the Council that he and the Galactic Senate wanted the Council to expel Tano and bring her to a military trial, even though the Council wanted for her to have a standard Jedi trial. After a brief debate, the Council agreed, believing that if they stood by Tano, it would appear that they were defying the Senate. Tano was expelled from the Order after her trial at the Chamber of Judgment. However, during her trial, it was revealed that Tano was innocent and the actual traitor was fellow Padawan Barriss Offee, who believed that the Order had lost their way from the light side of the Force.\nLater, clone trooper Tup shot a Jedi General, Tiplar, and killed her and was sent for examination. Jedi Master Shaak Ti went to the Jedi High Council to talk about a tumor while Nala Se wanting to terminate him went with Prime Minister Lama Su. Koth was present while Ti was reporting the situation. Later, Tup's fellow clone trooper, Fives, secretly treated him and found a chip in his brain for Order 66, with Tup dying shortly afterward. Fives stuck with his beliefs, resulting in his death. Koth and his fellow Jedi had no idea that Fives' beliefs were the truth.\nQueen Julia of Bardotta contacted the Senate and told them of the disappearance of the Dagoyan Masters. Palpatine was about to send Senators Amidala and Organa, but she specifically requested Junior Representative Jar Jar Binks, a request that confused everyone. He was present when Palpatine reported this to the Council. The Council agreed to send Windu to supervise Binks.\nKoth was with the Jedi Council when Koon said he found the lightsaber of Sifo-Dyas during on the Oba Diah moon. Yoda confirmed this and decided to investigate. Later, Koth was present when it was revealed that Dooku was responsible for the purchase of the clones and were forced to keep it a secret so that the citizens would not lose faith in the Republic.\nKoth was there when Yoda became distracted and said that he kept hearing the voice of the deceased Jinn. The Council decided to test if this was true, but Yoda didn't hear it. He decided to go to the hospital, but nothing was wrong with him. The voice of Jinn told him to go to Dagobah to find the secrets of immortality. On Dagobah, Yoda had a vision in which the Clone Wars never happened. However, he realized it was a vision when he saw Gallia and Jinn. After this, the vision of Koth vanished. Yoda left Dagobah, succeeding his task.\nAt some point, Kenobi and Skywalker were sent to Utapau after the death of Jedi Master Tu-Anh. Koth was present when Kenobi reported that the Sugi arm dealers were about to sell a giant kyber crystal. He later reported back when the crystal was destroyed, causing Yoda to talk about stories where the Jedi and Sith fought each other with weapons made of kyber crystals.\nNear the end of the Clone Wars, Koth was forced to step down from the Jedi Council and decided to leave the Order. He was replaced by Jedi Master Agen Kolar. Eventually, Supreme Chancellor Sheev Palpatine, the public persona of Darth Sidious, destroyed the Jedi Order by issuing the execution of Order 66, forcing the clone troopers to kill the Jedi due to a behavioral modification biochip implanted in their heads. Aided by Anakin Skywalker, who became the Sith Lord Darth Vader, Palpatine established the Galactic Empire of which he became its Emperor. By the Emperor's order, the Jedi were hunted down and killed by Darth Vader and the Inquisitorius.\nBy around 14 BBY, Koth had no allegiance to the Jedi Order, and was a priest in the Church of the Ganthic Enlightenment. He eventually married a fellow Zabrak, a woman named Mira, had a child with her. Like himself, Koth's daughter was force-sensitive, and so had the ability to connect to the Force. Mere minutes after his child's birth, however, Darth Vader arrived at their home with three Inquisitors, and confronted Koth. He pleaded with Vader to allow him and his family to remain in peace, and told Vader that he was no longer a Jedi and had no loyalty to his former Order. He then attempted to bargain with Vader, offering him ways to find other survivors of the Purge. Vader ignored him, and a lightsaber duel ensued.\nKoth quickly flung a medical droid at Vader and blasted a hole in the wall of the room in order to facilitate the escape of his child and wife. He then engaged Vader, who sensed emotions in Koth that had not been present when the Zabrak had been a Jedi; fear, anger, and resentment. He told Koth that these emotions gave him more power than he could have ever had as a Jedi, and Koth quipped that it was either his Zabrak nature shining through, or the fact that he now had something to lose. Vader replied that it was too late regardless and blasted Koth away with the Force.\nVader ordered the three Inquisitors to steal the baby, but remarked that the mother's fate was irrelevant to him. Koth regained his feet and attacked again, rebuffing Vader's label of Jedi with the remark that he was now a husband and a father, willing to kill Vader in order to protect his family. In an intense swordfight, Vader was able to grab Koth with the Force at one point, but Koth in turn scored several successful strikes with his lightsaber. While Koth and Vader battled one another, the Inquisitors overtook Koth's wife, ultimately capturing the infant, though her despairing mother escaped. Returning to their master, the Inquisitors found Vader and Koth battered from the fighting. Unaware of what had transpired, Koth reiterated that he would save his family, and Vader pointed out the child in the grasp of one of the Inquisitors. The sight of his child distracted Koth, and Vader ruthlessly used the opportunity to impale the Zabrak through the back, killing him. The Jedi's lightsaber fell out of his hand as he died, and his child was brought to Coruscant and given to the Nursemaids to be used for Project Harvester.\nTwo of the three Inquisitors on that mission toasted to Koth's death and each drank a shot of Dust Juice, the best drink the planet had to offer back at the Inquisitorius Headquarters. Shortly afterwards, Vader came and reprimanded them for sensing a connection between them, something he believed as a weakness, assuring that Koth's death should have served as a lesson about attachments.\nFollowing the deaths of the two Inquisitors, after Vader reported of the Inquisitors' actions and was reprimanded by the Emperor due the death of a Gran senator, Vader's master congratulated him for Koth's death, stating that as a former member of the Jedi Council, he could have caused trouble for them. The Emperor then laughed at hearing Koth became a priest, stating that Koth was a fool who couldn't help himself and for such reason the Jedi deserved extinction.\nShortly after the Battle of Fortress Vader, Vader entered a portal constructed by Darth Momin to resurrect his wife Padmé Amidala. While walking through visions, he encountered Koth along with many Jedi with their lightsabers ready to battle him. However, Vader killed all the illusions, impaling Koth through the chest along with Ferren Barr as the words \"Let the past die\" resounded in his mind.\nA Zabrak male, Koth had black hair, brown eyes, and tan skin, and stood at 1.87 meters, or 6 feet, 2 inches. He wore Iridonian facial tattoos. Eeth Koth served as a Jedi Master in the Jedi Order. When he sat on the High Jedi Council, Koth supported Qui-Gon Jinn's petition to train the young Anakin Skywalker as a Jedi despite being too old for training, as he felt identified with Skywalker given that he started his training at an unusually late age.\nAs a Jedi, Eeth Koth maintained a firm control over his emotions. His feelings were sufficiently tempered for him to sit for many years upon the Jedi High Council, the Order's governing body. At some point after his removal from the Council, Koth became disillusioned with the Jedi Order and turned his back on it. After his marriage, his priorities shifted to his family. Koth resolved to settle into a quiet life as a priest, officiating weddings and funerals for the Church of the Ganthic Enlightenment.\nFollowing the Clone Wars, Koth became less concerned with controlling his feelings. During their confrontation, Vader recognized Koth's strong emotions - most notably, his fear, anger, and resentment. Koth insinuated that this was because he had \"something to lose.\" In desperation, Koth even attempted to leverage the locations of his former comrades in exchange his family's safety, demonstrating a complete lack of any partiality toward the Jedi Order and its teachings.\nKoth's newfound attachment to his family ultimately proved to be his downfall. Vader used the abduction of Koth's newborn daughter to divert his attention, allowing Vader to impale the distracted Zabrak with no resistance. Even before that, Koth showed Vader that he was willing to do whatever he need to save his family, even launching the very same medical droid who brought his daughter to the world against Vader to save her and his wife.\nEeth Koth was one of the most skilled lightsaber duelists within the Jedi Order. He was able to defend himself against General Grievous despite having been shot in the arm moments before, and though he overpowered the General through the use of the Force rather than through swordplay, defeating him required the intervention of Grievous's Magnaguards. He had also effectively held his own against Darth Vader, appearing to be only somewhat battered from Force based attacks at the conclusion of the duel proper. His power in the Force was also quite substantial, as he was able to blast a large hole in a thick stone wall while simultaneously hurling a medical droid at Vader. He was also able to blast Grievous into a window with enough power to stun the General. However, Koth was able to fight armed or unarmed and had exceptional agility.\nEeth Koth wielded a green lightsaber and used to wear Jedi robes. During the Imperial Era, he wore priest attire.\nEeth Koth first appeared in the 1999 film Star Wars: Episode I The Phantom Menace, where he was originally intended to serve as the leader of the Jedi Council. Concept Artist Iain McCaig based early sketches of the character on Doug Chiang, the leader of the Art Department.\nKoth was portrayed by actor Hassani Shapi in Episode I, and archival footage of Shapi was reused for the Jedi Council scenes in Star Wars: Episode II Attack of the Clones. In his appearances during the mission to Geonosis, he was played by local performer Tux Akindoyeni, as the scenes were shot in Australia. Visual differences between the two portrayals eventually prompted Lucasfilm Ltd. to establish Akindoyeni's character as Agen Kolar, a new Jedi Master, although production paperwork such as scripts and call sheets continued to refer to both of them as Eeth Koth.\nWhen \"Grievous Intrigue,\" a 2010 episode of Star Wars: The Clone Wars was being written, series supervising director Dave Filoni wanted to use Koth, but was told by both Leland Chee, keeper of the Holocron continuity database, and Pablo Hidalgo, Internet Content Manager for Lucas Online, that the character was dead. Filoni then received permission from George Lucas to resurrect the character. Koth had been slated to die at the beginning of \"Grievous Intrigue,\" but Filoni decided that he was an interesting enough character to use in future episodes of the series. In the episode, Koth was voiced by actor Chris Edgerly, who gave the character a soft Indian accent that he identified as tricky to do, yet gracious and noble.\nAlthough Ultimate Star Wars gave Koth's homeworld as the moon of Nar Shaddaa, the same as his homeworld in Star Wars Legends, Ultimate Star Wars, New Edition, Star Wars Character Encyclopedia: Updated and Expanded , and Star Wars Character Encyclopedia, New Edition later gave it as Iridonia, making the information from Ultimate Star Wars obsolete. In addition to this, the Star Wars Encyclopedia, Star Wars: The Clone Wars: Character Encyclopedia - Join the Battle!, and the Databank say that Eeth Koth's height is 1.87 meters, while Star Wars Character Encyclopedia: Updated and Expanded says that his height is 1.71 meters.\nStar Wars Helmet Collection 33 stated that Koth was killed during Order 66. Koth was later established in Darth Vader  19 to have survived Order 66 before being killed by Darth Vader in a duel.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Eeth_Koth",
  "/wiki/Eeth_Koth/Legends",
  "/wiki/Koth",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Practice_Makes_Perfect_(episode)",
  "/wiki/Iridonia",
  "/wiki/14_BBY",
  "/wiki/Unidentified_planet_(Eeth_Koth)",
  "/wiki/Zabrak",
  "/wiki/Iridonian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Eeth_Koth%27s_family",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Jedi_assault_team",
  "/wiki/Galactic_Republic",
  "/wiki/Eeth_Koth%27s_fleet",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Church_of_the_Ganthic_Enlightenment",
  "/wiki/Force-sensitive",
  "/wiki/Planet",
  "/wiki/Jedi_Master",
  "/wiki/Republic_Era",
  "/wiki/Jedi",
  "/wiki/Jedi_General",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Geonosis",
  "/wiki/21_BBY",
  "/wiki/Capture_of_Eeth_Koth",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Death",
  "/wiki/Battle_of_Saleucami",
  "/wiki/Saleucami",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Adi_Gallia",
  "/wiki/Anakin_Skywalker",
  "/wiki/Agen_Kolar",
  "/wiki/Time",
  "/wiki/Galactic_Empire",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Desert",
  "/wiki/Marriage",
  "/wiki/Mira",
  "/wiki/Reproduction",
  "/wiki/Eeth_Koth%27s_daughter",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/Jedi_Knight",
  "/wiki/Hunt_for_Eeth_Koth",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Youngling",
  "/wiki/Project_Harvester",
  "/wiki/Mid_Rim_Territories",
  "/wiki/40_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Nameel",
  "/wiki/Cere_Junda",
  "/wiki/Trandoshans",
  "/wiki/Ontotho",
  "/wiki/Czerka_Arms",
  "/wiki/Pijali_monarchy",
  "/wiki/Battle_of_Naboo",
  "/wiki/Sith",
  "/wiki/Darth_Sidious",
  "/wiki/Maul",
  "/wiki/Mace_Windu",
  "/wiki/Midi-chlorian",
  "/wiki/Funeral_of_Qui-Gon_Jinn",
  "/wiki/Separatist_Crisis",
  "/wiki/22_BBY",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Bodyguard",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Kit_Fisto",
  "/wiki/Tenth_Brother",
  "/wiki/Rissa_Mano",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Hissrich",
  "/wiki/Attacks_on_hyperspace_routes",
  "/wiki/Flagship",
  "/wiki/Steadfast_(Venator-class)",
  "/wiki/Arda",
  "/wiki/Clone_Captain",
  "/wiki/Lock_(Clone_Captain)",
  "/wiki/Clone_trooper",
  "/wiki/Eeth_Koth%27s_unit",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Lightsaber_combat",
  "/wiki/Cyborg",
  "/wiki/Bridge_(starship)",
  "/wiki/IG-100_MagnaGuard",
  "/wiki/Sign_language",
  "/wiki/Senate_hostage_crisis",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Festival_of_Light",
  "/wiki/Naboo",
  "/wiki/Jedi_Temple_communication_center",
  "/wiki/Supreme_Chancellor",
  "/wiki/Bounty_hunter",
  "/wiki/Rako_Hardeen",
  "/wiki/Onderon",
  "/wiki/Onderonian_resistance",
  "/wiki/Rex",
  "/wiki/19_BBY",
  "/wiki/Jedi_Temple",
  "/wiki/Hangar",
  "/wiki/Letta_Turmond",
  "/wiki/Plo_Koon",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Galactic_Senate",
  "/wiki/Chamber_of_Judgment",
  "/wiki/Barriss_Offee",
  "/wiki/Trooper",
  "/wiki/CT-5385",
  "/wiki/Tiplar",
  "/wiki/Shaak_Ti",
  "/wiki/Nala_Se",
  "/wiki/Lama_Su",
  "/wiki/Queen",
  "/wiki/Julia",
  "/wiki/Bardotta",
  "/wiki/Dagoyan_Masters",
  "/wiki/Junior_Representative",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Sifo-Dyas",
  "/wiki/Oba_Diah_moon",
  "/wiki/Utapau",
  "/wiki/Tu-Anh",
  "/wiki/Sugi",
  "/wiki/Kyber_crystal",
  "/wiki/Order_66",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Galactic_Emperor",
  "/wiki/Inquisitorius",
  "/wiki/Priest",
  "/wiki/Mira_(Zabrak)",
  "/wiki/Lightsaber_duel",
  "/wiki/Iskat",
  "/wiki/Eeth_Koth%27s_lightsaber",
  "/wiki/Nursemaids",
  "/wiki/Unidentified_Twi%27lek_Inquisitor",
  "/wiki/Dust_Juice",
  "/wiki/Inquisitorius_Headquarters",
  "/wiki/Rogue_Inquisitor_chase",
  "/wiki/Unidentified_Gran_senator",
  "/wiki/Battle_of_Fortress_Vader",
  "/wiki/Portal",
  "/wiki/Darth_Momin",
  "/wiki/Force_vision",
  "/wiki/Ferren_Barr",
  "/wiki/Ben_Solo",
  "/wiki/Tattoo",
  "/wiki/Funeral",
  "/wiki/Jedi_robes",
  "/wiki/Imperial_Era",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Iain_McCaig",
  "/wiki/Doug_Chiang",
  "/wiki/Hassani_Shapi",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Grievous_Intrigue",
  "/wiki/2010",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Dave_Filoni",
  "/wiki/Leland_Chee",
  "/wiki/Holocron_continuity_database",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Lucas_Online",
  "/wiki/Chris_Edgerly",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Moon",
  "/wiki/Nar_Shaddaa",
  "/wiki/Homeworld/Legends",
  "/wiki/Star_Wars_Legends",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/Master_%26_Apprentice_(audiobook)",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_Attack_of_the_Clones_Graphic_Novel_Adaptation",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_5",
  "/wiki/Brotherhood",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(television_series)",
  "/wiki/The_Deserter",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Intermission,_Part_II",
  "/wiki/Star_Wars_Adventures_(2017)_13",
  "/wiki/Overlords",
  "/wiki/Hologram",
  "/wiki/Crisis_on_Naboo",
  "/wiki/A_War_on_Two_Fronts",
  "/wiki/Sabotage_(episode)",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/To_Catch_a_Jedi",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Conspiracy",
  "/wiki/The_Disappeared,_Part_I",
  "/wiki/The_Lost_One",
  "/wiki/Voices",
  "/wiki/Destiny_(episode)",
  "/wiki/Yoda",
  "/wiki/The_Big_Bang",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_1",
  "/wiki/Darth_Vader_(2017)_20",
  "/wiki/Darth_Vader_(2017)_25",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Two",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Journey_Through_Space_(2015)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_64",
  "/wiki/Starship_Fact_File",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Across_the_Galaxy",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_57",
  "/wiki/Droid_Directory",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Clone_Wars_Begin",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Invisible_Hand_Expansion_Pack",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/The_Separatists",
  "/wiki/Ezra_Bridger_and_Other_Force_Users",
  "/wiki/Star_Wars_Inside_Intel:_The_Inquisitorius",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Ultimate_Factivity_Collection:_Star_Wars",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_1",
  "/wiki/Star_Wars_Lightsabers:_A_Guide_to_Weapons_of_the_Force",
  "/wiki/Intermission,_Part_I",
  "/wiki/Star_Wars_Adventures_(2017)_12",
  "/wiki/Orders",
  "/wiki/Sacrifice",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Databank_(original)",
  "/wiki/32_BBY",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Saesee_Tiin",
  "/wiki/Even_Piell",
  "/wiki/Yarael_Poof",
  "/wiki/Oppo_Rancisis",
  "/wiki/Yaddle",
  "/wiki/Depa_Billaba",
  "/wiki/Coleman_Trebor",
  "/wiki/20_BBY",
  "/wiki/Coleman_Kcaj"
 ]
}