{
 "name": "Egoreg",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Super-vaporator project"
     ]
    }
   ]
  }
 ],
 "content": "Egoreg was the leader of Tatooine's super-vaporator project.\nEgoreg was in charge of a venture to aid Tatooine as it suffered an unusually severe moisture drought. His project included the construction of a \"super-vaporator\", which can only be assumed to be a more powerful model of Tatooine's common moisture vaporators used to pull water from the dry desert air.\nEgoreg's assignment was plagued by mysterious mechanical failures, contaminated oil supplies and malfunctioning droids. While attending a meeting on his plans with several key players of the project, the conference room they were in suffered a minor explosion. No one was hurt, but just to be safe Egoreg ordered the project to stop. C-3PO went down to Maintenance for repairs, where he and R2-D2 discovered that the project's oil supply had been tampered with. The two went immediately to tell Egoreg, but were surprised en route by a group of Jawas. Rushing to their aid, Han Solo and Chewbacca ran into the Jawas as well, who were caught red-handed by C-3PO and R2-D2 sabotaging the machines and spoiling the oil supply, which had been the cause of the malfunctioning droid problem.\nThe Jawas were punished, and Chewbacca was awarded a medal for capturing them.\nEgoreg appeared in The Mystery of the Rebellious Robot, a 1979 children's book written by Eleanor Ehrhardt, who is uncredited, and illustrated by Mark Corcoran. Egoreg's name is a slight respelling of George backwards – a nod to the creator of Star Wars. It is unknown if Captain Egoreg is somehow related to Egroeg Sacul, a character mentioned in the ride Star Tours.\nThe two men pictured above are never positively identified. One is Captain Egoreg, while the other is an unnamed scientist at the conference.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Super-vaporator",
  "/wiki/Tatooine/Legends",
  "/wiki/Moisture_vaporator/Legends",
  "/wiki/Droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/The_Mystery_of_the_Rebellious_Robot",
  "/wiki/1979",
  "/wiki/Eleanor_Ehrhardt",
  "/wiki/Mark_Corcoran",
  "/wiki/Star_Wars",
  "/wiki/Egroeg_Sacul",
  "/wiki/Star_Tours_(real-world)",
  "/wiki/StarWars.com"
 ]
}