{
 "name": "Eighth_Brother",
 "display_name": "Eighth Brother",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Terrelia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Malachor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Terrelian Jango Jumper"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue-gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Sidious",
      "Darth Vader"
     ]
    }
   ]
  }
 ],
 "content": "The Eighth Brother was a Force-sensitive Terrelian Jango Jumper male member of the Inquisitorius. During the Imperial Era, Eighth Brother frequently participated in the hunt for the growing Rebellion, specifically the rebel group known as the Spectres. During the mission on the planet Malachor to kill the former Sith apprentice Maul, he met his demise.\nThe individual who became known as the Eighth Brother originally occupied a position within the Jedi Order. At some point after the Galactic Republic was reorganized into the Galactic Empire, he was inducted into an Imperial agency of Force-sensitive assassins called the Inquisitorius, which was tasked with hunting down and eliminating any Jedi who survived Order 66. To accomplish this, he and his colleagues were trained by The Grand Inquisitor in the Inquisitorius Headquarters in The Works, but soon fell under the command of Darth Vader when Darth Sidious first demonstrated the Inquisitorius to Vader, who continued their training in the ways of the dark side of the Force. The Grand Inquisitor informed Eighth Brother and his colleagues that they had two masters, Eighth Brother in response proclaimed that they only served Sidious, but was soon countered by the Grand Inquisitor who stated that times had changed.\nEighth Brother celebrated with all the other Inquisitors after Darth Vader, Fifth Brother, Iskat, and a Twi'lek Inquisitor successfully killed Eeth Koth.\nFollowing the Grand Inquisitor's death at the hands of the Jedi Kanan Jarrus and his padawan, Ezra Bridger, the Brother and the other Inquisitors saw \"new opportunities\" to take his place by hunting down the two Jedi and their crew on their VCX-100, called the Ghost. However, while the Fifth Brother and Seventh Sister were given the chance to do so when Darth Vader dispatched them on the Emperor's orders, the Eighth Brother was given the task of hunting down Maul, the former Sith apprentice, whom he knew only as \"the Shadow.\"\nAfter eventually tracking Maul to the Sith temple on Malachor, the Brother unexpectedly found Jarrus, Bridger, and Ahsoka Tano. After stalking them for a short time, the Eighth Brother attacked the three and was surprised to see that they all had lightsabers, making him think he was facing three Jedi, but in smaller numbers, he decided to retreat. After the trio was split up, Tano and Jarrus tracked down and captured the Eighth Brother, who was unable to escape due to Chopper commandeering his TIE Advanced v1. Captured, the Eighth Brother was interrogated by Tano and Jarrus, who asked how many Inquisitors there are and what he was doing in Malachor. However, the Eighth Brother gave only vague answers, not revealing the exact number of Inquisitors and saying that he was in Malachor hunting a shadow. When Tano and Jarrus were not looking, the Eighth Brother managed to send a covert signal, which was answered by the Fifth Brother and Seventh Sister, with all three attacking Tano and Jarrus. However, the tables were turned on them when Bridger arrived with Maul in tow, the pair of them joining Tano and Jarrus and driving the Inquisitors off.\nFearing that Maul had claimed a Sith holocron sought by Darth Vader, the Eighth Brother impulsively set out to hunt down the enemy and reclaim it. He attacked Jarrus and Bridger, knocking out the Jedi Knight before turning his attention to the apprentice, only to be driven off by Tano and Maul. Teaming up with the Fifth Brother, he then went after Tano and Jarrus while the Seventh Sister went after Bridger and Maul, only for Maul to arrive and kill the Fifth Brother whilst Jarrus damaged the Eighth Brother's lightsaber. Over-matched and outnumbered, the Eighth Brother attempted to flee using his lightsaber's spinning blades to slow his descent as he leaped from the temple, only for the weapon to break and caused him to fall to his death.\nLike the other Inquisitors, the Eighth Brother was fiercely dedicated to the service of the Empire and Darth Vader. He was aggressive to the point that he often charged into action while his fellows hung back to allow him to weaken the enemy. He was also ruthless and cruel, demonstrating a willingness to drag out the terror of an enemy before killing them. However, his impulsive streak proved to be his undoing, as he chose to rely on his damaged lightsaber to escape when faced with battling three skilled enemies at once.\nLike most Inquisitors, the Eighth Brother was Force-sensitive and possessed skill in the art of wielding a double-bladed spinning lightsaber. He also possessed a TIE Advanced v1, the same TIE Fighter design as his fellows. The Eighth Brother typically employed both of his lightsaber's blades in battle, and also employed them in order to propel away from enemies when outmatched. Additionally, his lightsaber had the unique ability to convert into a buzz-saw-like weapon that employed the handle while the blades were deactivated. In doing so, this allowed the emitters to be visibly seen. Other equipment the Brother used were a multitude of S-Mine Detonators he kept on a bandolier. Within easy reach, the Eighth Brother would throw these small explosives toward his enemies. He also wore a suit of black and gray combat armor which bore the insignia of the Galactic Empire.\nHis fighting style was somewhat similar to the Seventh Sister's, given his slim and acrobatic build. However, he appeared to have been no more skilled than his fellow Inquisitors in battle, as illustrated by his losses on Malachor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Eighth_Brother",
  "/wiki/Terrelia",
  "/wiki/3_BBY",
  "/wiki/Malachor",
  "/wiki/Terrelian_Jango_Jumper",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Inquisitorius",
  "/wiki/Darth_Sidious",
  "/wiki/Anakin_Skywalker",
  "/wiki/Force-sensitive",
  "/wiki/Brother/Sister",
  "/wiki/Imperial_Era",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Spectres",
  "/wiki/Mission_to_Malachor",
  "/wiki/Planet",
  "/wiki/Sith_apprentice",
  "/wiki/Maul",
  "/wiki/Galactic_Republic",
  "/wiki/The_Force",
  "/wiki/Jedi",
  "/wiki/Order_66",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Inquisitorius_Headquarters",
  "/wiki/The_Works",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Grand_Inquisitor",
  "/wiki/Fifth_Brother",
  "/wiki/Iskat",
  "/wiki/Unidentified_Twi%27lek_Inquisitor",
  "/wiki/Eeth_Koth",
  "/wiki/Action_at_Mustafar",
  "/wiki/Kanan_Jarrus",
  "/wiki/Padawan",
  "/wiki/Ezra_Bridger",
  "/wiki/VCX-100_light_freighter",
  "/wiki/Ghost",
  "/wiki/Seventh_Sister",
  "/wiki/Darth",
  "/wiki/Galactic_Emperor",
  "/wiki/Sith",
  "/wiki/Malachor_Sith_Temple",
  "/wiki/Ahsoka_Tano",
  "/wiki/Time",
  "/wiki/C1-10P",
  "/wiki/TIE_Advanced_v1",
  "/wiki/Sith_holocron_(Malachor)",
  "/wiki/Sith_holocron",
  "/wiki/Jedi_Knight",
  "/wiki/Death",
  "/wiki/Lightsaber",
  "/wiki/Double-bladed_spinning_lightsaber",
  "/wiki/Sith_temple",
  "/wiki/TIE_line",
  "/wiki/S-Mine_Detonator",
  "/wiki/Armor",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Darth_Vader_(2017)_6",
  "/wiki/Darth_Vader_(2017)_7",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/Darth_Vader_(2017)_20",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Twilight_of_the_Apprentice",
  "/wiki/Maul:_A_Star_Wars_Rebels_Cinestory_Comic",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_96",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Databank_A-Z",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_28",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/Promise_of_Power",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Way_of_the_Force",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/Star_Wars_Helmet_Collection_69",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Art_of_Star_Wars_Rebels",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_214",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_the_Eighth_Brother",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/22_BBY",
  "/wiki/Phoenix_Cell",
  "/wiki/Chopper_Base",
  "/wiki/Atollon",
  "/wiki/Battle_of_Yavin",
  "/wiki/Always_Two_There_Are",
  "/wiki/Star_Wars_Rebels:_The_Siege_of_Lothal"
 ]
}