{
 "name": "Eirtaé",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Between 51 BBY and 45 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo",
      "Naboo Royal Handmaidens",
      "Naboo Royal Handmaidens",
      "Galactic Republic",
      "Amidalans"
     ]
    }
   ]
  }
 ],
 "content": "Eirtaé, born Eirtama Ballory, was a female human scientist, engineer, and artist. After the election of Queen Padmé Amidala, Eirtama was recruited by Captain Quarsh Panaka to serve in the queen's retinue of handmaidens, renaming herself as Eirtaé.\nDuring the Invasion of Naboo, Eirtaé stayed beside the queen as they fled the planet with the Jedi Qui-Gon Jinn and his apprentice Obi-Wan Kenobi. At the end of her service, she moved to Otoh Gunga to pursue her career as an artist and engineer.\nEirtama Ballory was born on Naboo prior to the Invasion of Naboo. In 32 BBY, she was part of an acting workshop, working as a set designer. After Padmé Amidala was elected as the Queen of Naboo, Quarsh Panaka, who served as the Head of Security, came to the workshop in search of girls who could serve as the queen's Royal Handmaidens. Despite investigating mostly girls who somewhat resembled the queen physically, he was advised by Sashah Adova, a girl who had not been assigned a job at the workshop, to recruit Ballory.\nPanaka took Adova's advice and came to the auditorium to witness a show, but more specifically, Ballory's skill set. Ballory had designed a hoverpod that the sopranos would stand on in the performance. With a limited budget, Ballory had created the hoverpod herself, basing it off of one that the former Queen Réillata had used in her first opera after her service as queen. Despite being clear about the weight that the pod's repulsor could handle, the performance involved too many sopranos standing on it, and as Ballory watched helplessly from the stands, the pod failed and crashed onto the stage. Panaka leapt up from the stands to assist the injured performers, and Ballory also came up to the stage. When Panaka asked why she was there, Ballory said that she had designed the pod and would not be blamed for the incident. The next morning, Panaka formally approached Ballory and offered her the position, which she accepted.\nAfter swearing their loyalty and life to Amidala, she and the other handmaidens changed their names to reflect Amidala's and bind themselves to one another, as well as for privacy and a bit of prestige. Eirtaé was somewhat reluctant about the change, but chose to do so after Rabé reminded her she could make her name famous after her service as a handmaiden was over, and volunteered herself as the Queen's communications expert.\nEirtaé was also skilled with design, helping Amidala redesign her headpieces to be lighter and more comfortable and working with Yané to make some of the queen's dresses and gowns more comfortable and functional.\nIn 32 BBY, Eirtaé was on Naboo when the planet was invaded by the Trade Federation. After queen Padmé Amidala was captured, Viceroy Nute Gunray told Amidala that he was going to force her to sign a treaty to make the Federation's invasion legal. After Amidala refused to cooperate, Amidala, Governor Sio Bibble, the Naboo Security Forces and the handmaidens were to be taken by B1-series battle droids to Camp Four. As they made their way to the camp, Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi rushed in and saved the group and they fled to the transports so that they could go to Coruscant and Amidala could plea her case to the Senate. After a brief stop on Coruscant, Amidala decided to go to Naboo and free her people herself. She went to the Gungans and begged for their help. The Gungan leader, Boss Nass, agreed to help. Later, after planning the liberation, they made their way into the Theed palace. Inside, they ran into Darth Maul and they agreed to let Jinn deal with them while they fight the Federation droids. After the battle, Eirtaé attended the funeral for Jinn, who had been killed by Maul during the battle. Eirtaé also attended the celebration of the liberation of Naboo shortly after.\nEirtaé left Amidala's service following the Queen's last term as monarch, and moved to Otoh Gunga to pursue her love of art. There she planned to study the way that Gungans grow vacuums as a way to experiment with her art and to possibly expand Nabooian agriculture. She hoped to put paint in bubbles and use the pattern analysis to improve growth of blue-algae, a fertilizer that had vastly improved Naboo's growing season.\nIn contrast to all the other handmaidens and to the Queen herself, she had blond hair and blue eyes. She also had fair skin. Eirtaé was reluctant about changing her name, having harbored hopes of achieving fame under her birth name, but did so after being reminded that the position of handmaiden was not one in which fame was likely to be achieved, and that she could always change her name back after her service was over. When her service was over, however, she chose to keep the name Eirtaé instead of returning to being Eirtama Ballory.\nUpon first meeting her, Padmé Amidala immediately noticed that Eirtaé was the type who liked doing things with her hands. Eirtaé was very skilled with electronics, tinkering with them in her spare time, and was also adept enough to slice into a database. She also had a talent for painting. Eirtaé was composed emotionally and generally non-confrontational, but on at least one occasion, became very irritable with her fellow handmaidens.\nEirtaé was portrayed by Friday \"Liz\" Wilson in The Phantom Menace.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Eirta%C3%A9",
  "/wiki/Eirta%C3%A9/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Eirta%C3%A9",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Hope",
  "/wiki/Darth_Vader_(2020)_3",
  "/wiki/Darth_Vader_(2020)_4",
  "/wiki/Darth_Vader_(2020)_28",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Naboo",
  "/wiki/51_BBY",
  "/wiki/45_BBY",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Galactic_Republic",
  "/wiki/Amidalans",
  "/wiki/Scientist",
  "/wiki/Engineer",
  "/wiki/Artist",
  "/wiki/Queen",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Captain",
  "/wiki/Quarsh_Panaka",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Jedi",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Otoh_Gunga",
  "/wiki/32_BBY",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Head_of_Security",
  "/wiki/Sach%C3%A9",
  "/wiki/R%C3%A9illata",
  "/wiki/Rab%C3%A9_Tonsort",
  "/wiki/Yan%C3%A9",
  "/wiki/Planet",
  "/wiki/Trade_Federation",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Nute_Gunray",
  "/wiki/Governor",
  "/wiki/Sio_Bibble",
  "/wiki/Royal_Naboo_Security_Forces",
  "/wiki/B1-series_battle_droid",
  "/wiki/Camp_Four",
  "/wiki/Jedi_Master",
  "/wiki/Transport",
  "/wiki/Coruscant",
  "/wiki/Galactic_Senate",
  "/wiki/Gungan",
  "/wiki/Boss",
  "/wiki/Rugor_Nass",
  "/wiki/Battle_of_Naboo",
  "/wiki/Theed_Royal_Palace",
  "/wiki/Maul",
  "/wiki/Droid",
  "/wiki/Funeral_of_Qui-Gon_Jinn",
  "/wiki/Death",
  "/wiki/Blue-algae",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Slicer",
  "/wiki/Painting",
  "/wiki/Liz_Wilson",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/The_Prequel_Trilogy_Read-Along_Storybook_and_CD_Collection",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/The_Phantom_Menace_(Golden_Book)",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/Darth_Vader_(2020)_5",
  "/wiki/Darth_Vader_(2020)_30",
  "/wiki/Revelations_1",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Inside_Intel:_Padm%C3%A9%27s_Real_Last_Name",
  "/wiki/Databank_(website)",
  "/wiki/Template:QueensPerilDate",
  "/wiki/44_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}