{
 "name": "Eison_Gynt",
 "display_name": "Eison Gynt",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Several years after 3756 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Old Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Barel Ovair",
      "Naga Sadow"
     ]
    }
   ]
  }
 ],
 "content": "Eison Gynt was a Nautolan male Jedi Padawan of the Old Republic, born to a family line of Jedi. In his youth, he was considered the most talented Padawan in the Jedi Order, and was taken as an apprentice by Master Barel Ovair, a spy for the Sith Empire. During a mission to Yavin 4 to explore the tomb of the Sith Lord Naga Sadow, Ovair abandoned Gynt. Ovair reported Gynt's death to the Senate on Coruscant, but Gynt was still alive, possessed by the spirit of Sadow. Under Sadow's control, Gynt resurfaced on Coruscant several years later and was slain by Ovair in open combat. Ovair's Imperial allegiance and complicity in Gynt's death were not revealed until years later, when Jedi historian Gnost-Dural researched the events of the mission to Yavin 4 and Gynt's reappearance.\nEison Gynt was a male Nautolan Padawan of the Old Republic's Jedi Order who hailed from a family line of Jedi Knights going back three generations. He was considered the most talented student in the Order when he was selected by Master Barel Ovair—who was a Sith spy for the Sith Empire—as his Jedi apprentice. As fellow Jedi scholars, Ovair and Gynt traveled the galaxy, studying the Force and taking on increasingly daring tasks for the Order. In 3756 BBY, the pair undertook a dangerous mission to Yavin 4 to explore the tomb of the Sith Lord Naga Sadow. This mission was carried out in the name of the Jedi Order, but Ovair was actually under orders from the Sith Emperor to eliminate any lingering traces of Sadow that might threaten the Empire during their impending invasion of the Galactic Republic. While on Yavin 4, Gynt and Ovair were attacked by Massassi warriors and forced into the depths of Sadow's tomb, where the Sith Lord's dark energies still survived.\nOvair returned alone and injured to Coruscant several weeks later, and when he made his report to the Galactic Senate he revealed that Gynt had been killed. In truth, Gynt had survived and had been possessed by Sadow's spirit. Gynt resurfaced on Coruscant several years after the failed mission to Yavin 4, garbed as a Massassi warrior and intent on killing his former Master. Gynt attacked Ovair publicly, but Ovair defeated Gynt in the ensuing duel and killed him. Ovair was hailed as a hero by the Republic for his actions.\nOver a century later, Jedi historian Gnost-Dural researched the events surrounding Gynt's death. He questioned why the spirit of Sadow, having taken possession of Gynt, would have sought vengeance against Ovair specifically. Gnost-Dural concluded that Ovair and his Jedi ancestors were in fact spies working on behalf of the Sith Emperor, and that Ovair had manipulated Gynt into participating in the mission to Yavin 4 so that he could destroy Sadow's spirit. The Emperor had viewed the old Sith Lords as potential threats, and Sadow's defeat—despite Gynt's death—eliminated one of those threats, which made the invasion of the Republic easier during the Great Galactic War.\nGynt was a talented Force user, and was believed to be the most gifted Padawan in the Jedi Order at his time of selection. However, his talents did not prevent him from being possessed by the spirit of Sith Lord Naga Sadow. When possessed by Sadow, the dark-side abilities granted by the dark spirit were formidable, but were not sufficient to defeat Ovair. When Gynt resurfaced on Coruscant, the Nautolan was wearing the robes of a Massassi warrior. Gynt wielded a green-bladed lightsaber.\nEison Gynt was introduced in Timeline 7: Peace for the Republic?, a video released on April 16, 2010 as part of the Galactic Timeline series of lore videos published on the official site for the BioWare video game Star Wars: The Old Republic. In the timeline transcript, Gynt's name is misspelled once as \"Eeson Gynt.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Standard_year/Legends",
  "/wiki/3756_BBY",
  "/wiki/Coruscant/Legends",
  "/wiki/Nautolan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Barel_Ovair",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Mission_to_Yavin_4",
  "/wiki/Yavin_4/Legends",
  "/wiki/Naga_Sadow%27s_tomb",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Force_ghost",
  "/wiki/Duel_on_Coruscant_(Inter%E2%80%93Sith_Wars_Period)",
  "/wiki/Jedi_historian",
  "/wiki/Gnost-Dural",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Sith/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Tenebrae",
  "/wiki/Great_Galactic_War",
  "/wiki/Massassi/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_apparel",
  "/wiki/Lightsaber/Legends",
  "/wiki/Timeline_7:_Peace_for_the_Republic%3F",
  "/wiki/April_16",
  "/wiki/2010",
  "/wiki/Galactic_Timeline",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Timeline_8:_The_Jedi_Civil_War",
  "/wiki/Timeline_10:_The_Exar_Kun_War",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Category:Images_of_Eison_Gynt",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/3653_BBY"
 ]
}