{
 "name": "Ekelarc_Yong",
 "display_name": "Ekelarc Yong",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Gray Squadron",
      "Gray Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Ekelarc Yong was a human male who served as a lieutenant and starfighter pilot in the Alliance to Restore the Republic during the Galactic Civil War. He flew a BTL-A4 Y-wing assault starfighter/bomber under the callsign Gray Three as a member of Gray Squadron and participated in the Battle of Endor, in which the Alliance aimed to destroy the Galactic Empire's Death Star II superweapon.\nAfter realizing they had fallen into a trap, the rebels engaged with an Imperial fleet at point blank range in order to avoid being targeted by the Death Star's superlaser. During the fighting, Yong's bomber was shot down by two TIE/ln space superiority starfighters, although the pilot managed to crash the vehicle into the bridge of an Imperial Star Destroyer as he died.\nLieutenant Ekelarc Yong was a human male who served in the Alliance to Restore the Republic during the Galactic Civil War, flying as a BTL-A4 Y-wing assault starfighter/bomber pilot in the Starfighter Corps of the Alliance Fleet. When the fleet jumped from the Sullust system to the Endor system in order to attack the Galactic Empire's Death Star II superweapon in 4 ABY, Yong flew with them under the callsign Gray Three in Gray Squadron, a mixed starfighter squadron of Y-wings, A/SF-01 B-wing starfighters, and RZ-1 A-wing interceptors commanded by Gray Leader Horton Salm.\nThe Alliance believed that the Empire was unaware of its attack plans and that the unfinished Death Star's shields would be down; however, upon arriving in the Endor system, General Lando Calrissian quickly realized they had walked into a trap and called off the first attack run. An Imperial fleet then engaged the Alliance, with hundreds of TIE/ln space superiority starfighters and TIE/IN interceptors swarming the rebel starfighters. The fleet then held out against the Imperial forces while waiting for a strike team they had sent to the moon of Endor to disabled the Death Star's shield generator.\nWhen the Death Star revealed that its superlaser was functional by destroying the MC80 Liberty Type Heavy Star Cruiser Liberty, Calrissian ordered the Alliance's forces to engaged the Imperial Star Destroyers they were facing at point blank range so that the Death Star could not fire upon them. Yong then flew in tight along the side of one of the Imperial-class Star Destroyers with two TIE fighters on his tail, but his bomber was struck by fire from the pursuers and began to spin out of control. Making the most of a bad situation, Yong managed to crash his vehicle into the bridge of another Star Destroyer, perishing in the blast.\nYong had dark hair, dark eyes, and light skin.\nEkelarc Yong first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The Y-wing cockpit scenes for Return of the Jedi were filmed on Stage 9 at Elstree Studios between March 2 and March 11, 1982. The character's chest pack featured the joke inscription \"HELP HELD CAPTIVE AT ILM.\"\nIn the new Star Wars canon, the character was first identified in 2014 in the StarWars.com Databank, although the website erroneously uses an image of Gureni Telsij, another Y-wing pilot, instead of Yong. A card released in 2021 on the Star Wars: Card Trader app also makes this error. The character's name originated in the Star Wars Legends continuity, where it was first used on a \"Battle Over Endor\" action figure set produced by Hasbro Inc. in 2010.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ekelarc_Yong",
  "/wiki/Ekelarc_Yong/Legends",
  "/wiki/4_ABY",
  "/wiki/Endor",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Gray_Squadron_(Rebel_Alliance)",
  "/wiki/Lieutenant",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Callsign",
  "/wiki/Gray_Three",
  "/wiki/Battle_of_Endor",
  "/wiki/Galactic_Empire",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Imperial_Navy",
  "/wiki/Death_Star",
  "/wiki/Superlaser",
  "/wiki/Bomber",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Bridge_(starship)",
  "/wiki/Star_Destroyer",
  "/wiki/Death",
  "/wiki/Rebel_pilot",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Alliance_Fleet",
  "/wiki/Fleet",
  "/wiki/Sullust_system",
  "/wiki/Endor_system",
  "/wiki/Squadron",
  "/wiki/BTL_Y-wing_starfighter",
  "/wiki/A/SF-01_B-wing_starfighter",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Gray_Leader",
  "/wiki/Horton_Salm",
  "/wiki/Deflector_shield",
  "/wiki/Star_system",
  "/wiki/General",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/TIE/IN_interceptor",
  "/wiki/Imperial_Military",
  "/wiki/Endor_strike_team",
  "/wiki/Moon",
  "/wiki/Death_Star%27s_shield_generator",
  "/wiki/MC80_Liberty_Type_Heavy_Star_Cruiser",
  "/wiki/Liberty",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Flight_helmet",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Elstree_Studios",
  "/wiki/March_2",
  "/wiki/March_11",
  "/wiki/1982",
  "/wiki/Star_Wars",
  "/wiki/2014",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Gureni_Telsij",
  "/wiki/2021",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Legends",
  "/wiki/Hasbro_Inc.",
  "/wiki/2010",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Helmets",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Rebel_Starfighters_Owners%27_Workshop_Manual",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/Star_Wars:_Shadows_of_the_Dark_Side"
 ]
}