{
 "name": "Ekim Ryelli",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Nicht Ka"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order",
      "Exploration Corps",
      "Exploration Corps"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Lumas Etima"
     ]
    }
   ]
  }
 ],
 "content": "Ekim Ryelli was a male Human Jedi Master who served the Jedi Order and the Galactic Republic during the Clone Wars. He died in 19 BBY on Nicht Ka, killed by Malleus, a failed Jedi who had been corrupted by the dark side of the Force.\nIn 22 BBY, he and his apprentice Lumas Etima were present in the Petranaki arena during the First Battle of Geonosis. While Ryelli lost three fingers during the combat, Etima was overpowered by the sheer number of enemy battle droids and died in the arena. Maimed physically and mentally, Ryelli lost the will to fight. He retired from combat and requested to be reassigned as a Jedi archaeologist instead.\nFour years later, in the final days of the Clone Wars, the Jedi Master was sent to Nicht Ka, a forgotten planet located on the border of the late Sith Empire, where a mysterious structure had been discovered. When he arrived there with two members of the Exploration Corps, a Givin astrogator Staguu Itincoovar and the Human pilot Telloti Cillmam'n, the archaeologist started examining a few carving on the walls. He allowed Cillmam'n to look around the place while Itincoovar was searching their starship's database. A bit later, Ryelli found the pilot in another room, wearing an ancient suit of armor which he felt was infested with the dark side of the Force. Cillmam'n then confronted Ryelli, blaming him for giving up the fight after what happened on Geonosis. The two men engaged in a fierce lightsaber duel, and although Ryelli seemed to get the upper hand, the other took the high ground by using a secondary blade from his lightsaber's butt. Ekim Ryelli was then beheaded at the very moment Itincoovar tried to contact him via comlink to announce that the Clone Wars had been won by the Republic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Nicht_Ka",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Exploration_Corps/Legends",
  "/wiki/Lumas_Etima",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Death/Legends",
  "/wiki/Malleus",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Petranaki_arena",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Jedi_archaeologist",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Staguu_Itincoovar",
  "/wiki/Pilot/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Duel_on_Nicht_Ka",
  "/wiki/Sai_cha/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars_Insider",
  "/wiki/Hammer_(short_story)",
  "/wiki/Star_Wars_Insider_147",
  "/wiki/Category:Images_of_Ekim_Ryelli"
 ]
}