{
 "name": "Elan",
 "display_name": "Elan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Koros-Strohna"
     ]
    },
    {
     "name": "Died",
     "values": [
      "25 ABY",
      "Millennium Falcon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Deception sect"
     ]
    },
    {
     "name": "Caste",
     "values": [
      "Priest caste"
     ]
    },
    {
     "name": "Domain",
     "values": [
      "Unidentified domain"
     ]
    }
   ]
  }
 ],
 "content": "Elan was a Yuuzhan Vong Priestess. Young at the start of the invasion, by Yuuzhan Vong standards she was devastatingly beautiful, with ice-blue eyes and intricately patterned lavender and maroon markings on her face.\nThe youngest daughter of High Priest Jakan, Elan was a member of the Deception sect, the followers of Yun-Harla. After the Yuuzhan Vong's victory at Obroa-skai, Elan was asked by Harrar and Nom Anor to undertake a mission to infiltrate the New Republic and assassinate as many of the Jedi as possible.\nElan observed a demonstration of the bo'tous bioweapon, an airborne blood agent carried in an assassin's lungs, in which an apprentice assassin used it to kill a number of captives before succumbing to it himself. Hoping to bring glory upon herself and her domain, Elan accepted the mission. She and her familiar, Vergere, would pose as defectors seeking political asylum, request a meeting with the Jedi, and then Elan would unleash the bioweapon. Elan even hoped her actions could result in her father being promoted to the rank of Mosthigh priest.\nThe Yuuzhan Vong staged a small defeat close to Exodo II in which Elan and Vergere jettisoned from a ship in a small escape pod and were subsequently apprehended by the light cruiser Soothfast, where they requested political asylum.\nThe defectors were transferred to Bagsho on Nim Drovis where they were taken into custody by Major Showolter of New Republic Intelligence. Although Showolter believed their defection was highly likely to be a ruse, they were nonetheless transported to Wayland for debriefing by NRI operatives. Elan was able to relay their destination to Harrar using a villip.\nOn Wayland, Elan was questioned by Belindi Kalenda, Joi Eicroth and Doctor Yintal. Elan claimed that as her sect worked closely with the warrior caste by reading auguries and advising which tactics to employ, she would be able to provide valuable information to the New Republic. The interrogation was interrupted however when a Yuuzhan Vong assassin burst into the safehouse and attempted to kill Elan before being shot down by Major Showolter. Elan sustained minor injuries but was otherwise unharmed, and Vergere later used her tears to help heal her wounds.\nThe assassination attempt having increased their plausibility, Elan and Vergere were transferred to Myrkr with a view to eventually bringing them to Coruscant. Showolter arranged to take them on to Bilbringi posing as refugees aboard the Queen of Empire, and helped her pass for Human.\nUnfortunately, the Peace Brigade, mercenaries working for the Yuuzhan Vong who were unaware of Elan's true objective, learned of their defection and hatched a plot to retrieve them before their ship reached Bilbringi. They attacked the Queen of Empire and Showolter was injured. He was forced to hand Elan and Vergere over into the custody of Han Solo, whom he begged to help hide them.\nElan was apprehended by the Peace Brigade with the help of a Yuuzhan Vong unmasker handler. She was taken aboard their shuttle, and they attempted to return her to a nearby Yuuzhan Vong ship. In desperation to prevent the failure of her mission, Elan used the bo'tous to kill everyone in the shuttle, while she and Vergere took refuge in a cabin at the rear. Han boarded the shuttle to find everyone but the two of them dead. Elan suggested the Peace Brigade must have accidentally released the bioweapon themselves. Han grew progressively more suspicious as they escaped in the Millennium Falcon, and decided to load them into an escape pod and return them to their own people. Knowing her deception had failed, Elan attempted to use the bo'tous on him, but inadvertently became trapped in the escape pod with him. Han survived thanks to a portable breathing apparatus given to him by his youngest son, Anakin Solo, and Elan herself was killed by the toxin.\nAfter her death, Nom Anor blamed the mission's failure on Elan and Harrar's inability to improvise.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Elan_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Elan",
  "/wiki/Koros-Strohna",
  "/wiki/25_ABY/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Deception_sect",
  "/wiki/Priest_caste",
  "/wiki/Unidentified_domain",
  "/wiki/Priest/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/High_Priest/Legends",
  "/wiki/Jakan",
  "/wiki/Yun-Harla",
  "/wiki/Obroa-skai/Legends",
  "/wiki/Harrar",
  "/wiki/Nom_Anor",
  "/wiki/New_Republic/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Bo%27tous",
  "/wiki/Bioweapon/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Lung/Legends",
  "/wiki/Domain",
  "/wiki/Vergere",
  "/wiki/Mosthigh_priest",
  "/wiki/Battle_near_Exodo_II",
  "/wiki/Exodo_II",
  "/wiki/Escape_pod/Legends",
  "/wiki/Soothfast",
  "/wiki/Politics/Legends",
  "/wiki/Bagsho",
  "/wiki/Nim_Drovis",
  "/wiki/Showolter",
  "/wiki/Wayland",
  "/wiki/Villip",
  "/wiki/Belindi_Kalenda",
  "/wiki/Joi_Eicroth",
  "/wiki/Yintal",
  "/wiki/Raid_on_Wayland_(25_ABY)",
  "/wiki/Myrkr/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Bilbringi_system",
  "/wiki/Queen_of_Empire",
  "/wiki/Human/Legends",
  "/wiki/Peace_Brigade",
  "/wiki/Han_Solo/Legends",
  "/wiki/Unmasker",
  "/wiki/Survival_tool",
  "/wiki/Anakin_Solo",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_Dark_Journey",
  "/wiki/The_New_Jedi_Order:_Traitor",
  "/wiki/The_New_Jedi_Order:_Destiny%27s_Way",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Rogues_Gallery",
  "/wiki/Star_Wars_Gamer_8",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Databank_(original)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}