{
 "name": "Elarec_Yovet",
 "display_name": "Elarec Yovet",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shili"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Togruta government"
     ]
    }
   ]
  }
 ],
 "content": "Elarec Yovet was a Togruta female queen who served as the Regasa of Shili during the High Republic Era. Regasa Yovet additionally had the titles of Supreme Huntress of the United Tribes and Ruler of Togrutas. As a gesture of friendship, she was invited to the Republic Fair on Valo by Supreme Chancellor Lina Soh, who hoped to build stronger bonds between the Togrutas and the Galactic Republic. Yovet was also a longtime friend of the Jedi Master Jora Malli.\nBefore the events of the Valo Republic Fair, Republic relations with the Togruta were tense. Jedi Master Stellan Gios described the Togruta homeworld of Shili as one of the biggest stumbling blocks in Republic affairs. Though the Togruta and Republic knew of each other for centuries, it wasn't until around 380 BBY that the Republic ventured into Togruta territory. These explorations by the Republic were seen as unwelcome by the Togruta and led to sporadic clashes and lines drawn between the two that remained for decades.\nPrior to her death in 232 BBY, Elarec Yovet and Jedi Master Jora Malli became friends—one of the first steps in repairing Republic-Togruta relations. Yovet was deeply saddened when the Jedi Master perished in the Battle of Kur. In an effort to further improve Republic-Togruta relations, Supreme Chancellor Lina Soh announced that she would formally invite Yovet to the fair as the Chancellor's distinguished guest. Yovet agreed, much to the delight of Soh.\nShortly before the Valo Republic Fair opening, Yovet traveled from her homeworld of Shili to Lonisa City on Valo. The regasa arrived on an unidentified shuttle, constructed with long tapered wings and a hull that gleamed like polished bronzium. Yovet was joined in her travels by members of the Togruta Guard, headed by Captain Maramis. Each guard member was equipped with a kiavene, a long-barbed pike with disintegration capabilities, and dressed in long tunics and face masks. Gios noted that Yovet was dressed in a long, flowing robe. Her montrals were adorned with golden metalwork and a heavy chain that marked her position as queen. Absent from Yovet's attire was any form of shoes, as the Togruta viewed the ground beneath their feet as sacred.\nUpon her arrival, Yovet was greeted by Soh and her welcome committee. Yovet took the time to personally greet every welcome committee member, including Jedi Master Gios and Elzar Mann. While speaking with Gios, Yovet mentioned her friendship with Malli and how saddened she was by the Jedi's death. She said she had hoped to visit Malli aboard the Starlight Beacon one day, which Malli was set to lead prior to her death. Mann quickly interrupted the conversation, explaining to Yovet that he was certain Jedi Master Avar Kriss would happily welcome Yovet aboard the Starlight Beacon. Yovet stated she loved the idea and would happily visit the space station with the Chancellor's permission. Soh, beaming with excitement, stated that it would be her absolute pleasure to bring Yovet aboard the Starlight Beacon.\nAs the final preparations for the fair commenced, Yovet remained by Soh's side, enjoying all the fair had to offer. In particular, Yovet thoroughly enjoyed the airshow performed by Jedi Vectors before the opening ceremony. During Soh's speech at the opening ceremony, the Chancellor specifically acknowledged Yovet and the rest of the Togruta as friends of the Republic, an effort visually appreciated by Yovet. As the fair went on, Yovet became an attraction in it herself. Almost every fairgoer attempted to speak with her or, at the very least, get a glimpse of her.\nWhen the Nihil marauders began their attack on the Valo Republic Fair, Yovet and her guards were with Soh, Norel Quo, Matari, Voru, Madam Conserra, and Master Gios at the opera house. Shortly after the attack commenced, a repulsor tier carrying over 50 people collapsed outside the opera house, injuring dozens of fairgoers. Despite the immense danger, Yovet ordered all of her guards—except Maramis—to aid the injured. Gios stated to the group that they needed to head to the Valo Jedi Temple. Even though the temple itself was not complete, Gios explained that the vaults underneath the temple were. If the group was able to enter the vaults, they would be safe from any Nihil attack.\nAs the group began making their way to the Jedi temple, the Nihil dispersed their war cloud on Lonisa City. The war cloud consisted of toxic gas that impaired the vision and breathing of anyone caught in it without a respirator mask. To keep the group safe, Gios ordered them all to huddle so he could use the Force to keep the air around them clear of the toxic gas. As the huddled group continued shuffling their way to the temple, Maramis pointed out an experimental walker that had been on display at the fair. The walker and its platform seemed to be higher than the war cloud, which would enable the group to head to the temple safely. Though Quo questioned if Gios would get the group to the walker safely, Yovet insisted that she had complete faith in the Jedi.\nWhile making their way to the walker, a Krantian female and her child ran straight into the huddled group. Quo was angry at the pair, demanding they leave the group immediately. Yovet, however, immediately accepted them and insisted they be brought to safety. Yovet asked the pair the names, the mother stating her name was Lerahel and the child's name was Sarry. Though Quo was still insistent on removing the pair from the group, Soh agreed with Yovet and promised the pair that they would keep them as safe as they could.\nOnce the group finally arrived at the walker, Gios instructed them to take the stairway up and enter the walker. Yovet insisted that Lerahel and Sarry head up the stairway first, adamant on ensuring their safety before anyone else's. While the group hurried up the stairway, a group of Nihil attackers ambushed them. Gios, Maramis, Matari and Voru prepared to defend the group. Maramis and the targons initiated their attack while Gios—insistent that Jedi should only defend, not attack—stayed behind at the walker. A Trandoshan member of the Nihil soon ambushed him. Gios, in an effort to incapacitate the Trandoshan, Force pushed the marauder into the stairway. While this effort did incapacitate the attacker, it caused the stairway to come crashing down.\nThough Yovet, Conserra, Lerahel, and Sarry had already made it into the walker, Soh and Quo were not as lucky. Quo fell to the ground, gravely injured. Soh was clinging to the ledge of the walker, struggling to hold on. Yovet immediately lunged for Soh, attempting to grab her hand before the Chancellor fell. She was a split second too late, and Soh began to fall. However, Gios kept the Chancellor in the air with the Force long enough for Yovet to grab her. The rest of the group inside the walker immediately rushed over to help Yovet and Soh, doing everything they could to pull Soh to safety.\nAfter much effort, the group finally pulled Soh aboard the walker, Yovet letting Gios know they were all safe. Maramis, Matari, and Voru soon returned to the walker, having successfully defended the group for the time being. Using the shield from the Trandoshan, Gios and Maramis crafted a makeshift gurney, which Gios lifted to the walker using the Force. Yovet, Soh, and the rest of the group worked together to get Quo aboard.\nOnce everyone had made it safely on board the walker, Gios and Maramis began their ascent. Picking up the fallen stairway, the two began heading up when another group of Nihil attacked. Gios and Maramis rushed up the stairway, helped by Yovet, as they reached the top. Once the entire group was aboard the walker, Gios used the Force to push the stairway away from the walker, ensuring no Nihil could board. Soh began to operate the walker, setting a path for the Jedi temple. While Soh operated the walker, Yovet remained with the rest of the group, trying to keep everyone calm and attending to any injuries she could.\nThe group aboard the walker eventually made it out of Fair Park and arrived at the Unity Arc. Just as they reached the arch, Jedi Master Mikkel Sutmani's Vector crashed into a café on the streets below, brought down by a Nihil marauder. The café had been sheltering dozens of civilians attempting to shelter themselves from the Nihil attackers, none of whom had time to evacuate the building before it came crashing down. Yovet immediately insisted the group help the survivors and tend to their wounds. Soh agreed and lowered their walker to the ground. The second the walker touched the ground, Yovet and Soh rushed to the collapsed building, searching for survivors.\nWhile the rest of the group joined the regasa and Chancellor, Nihil Tempest Runner Pan Eyta initiated the final phase of the Nihil attack as hundreds of bombs were dropped on the city. Even with bombs raining around her, Yovet insisted the group stay and help the victims. Gios, however, knew he could not protect Yovet or Soh from the bombs while they were on the ground and ordered the group to return to the walker. The group members carried any survivors they could, but Yovet was devastated they had to leave so many behind.\nAs the group began boarding the walker, Gios senses another Nihil attack heading their way. Gios left the group under the protection of Maramis while the Jedi stayed behind to protect the wounded. Tempest Runner Lourna Dee, along with three other Nihil marauders, attacked Gios. Dee eventually pushed past him and headed for the walker, intent on killing Soh. Using a grappling hook, Dee began to repel up towards the walker. However, Jedi Mann arrived at the walker and severed Dee's ascension cable, dropping her to the ground. A bomb was then dropped between the walker and Gios, downing the walker and injuring Soh along with dozens of other survivors. As the battle ended, Yovet, the Togruta Guard, and the Togruta reinforcements aided as many wounded as possible.\nThe battle soon finished with Nihil forces driven from the system. The Togruta fleet, alerted to the attack on Valo by reporter Rhil Dairo's distress call, quickly recovered Yovet and returned her to Shili. During this time, the Togruta fleet and government severed all communications with the Republic. However, while Soh was recovering in the medical bay of the Valo Jedi temple, Yovet reached out to her personally.\nYovet assured Soh that she felt no animosity towards the Republic and reassured Soh that the attack on the fair was not the Chancellor's fault. Yovet also took the time to praise Gios, who was visiting Soh in the infirmary, and the other Jedi for defending the people of Lonisa City. Yovet then explained to Soh that the Nihil attack had changed her mind about a Togruta alliance with the Republic. Through the events that unfolded, Yovet realized that both parties stood a better chance at surviving another attack by standing together. Yovet officially offered a Togruta alliance with the Republic, which Soh eagerly accepted.\nYovet explained that it would take some time for the coalition to go into effect, as she could foresee harsh criticisms coming from her government officials. However, Yovet was determined to make the alliance happen. Finally, Yovet provided Soh with a data package Togruta Intelligence officials had intercepted from the Nihil. The package contained information that allowed Gios and the Republic fleet to lure the Nihil into a trap and expose their base.\nElarec Yovet was extremely beautiful, with many who met her being stunned simply by her appearance alone. She was also very traditional, referring to Jedi as 'Lords' and possessed a wealth of knowledge. Yovet instantly recognized the raiment Gios was wearing when she met him, realizing it signified his ranking within the Jedi. She also knew about the Force and how much will and effort it took for the Jedi to wield it. Above all, Yovet was compassionate and selfless. She placed the health and safety of others above her own, much to the dismay of her Togruta guard. Throughout the Valo Republic Fair attack, Yovet actively put herself in dangerous situations to help any wounded she could find.\nElarec Yovet appeared in the novel The High Republic: The Rising Storm, which was written by Cavan Scott and published in 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Shili",
  "/wiki/Togruta",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Togruta_government",
  "/wiki/Queen",
  "/wiki/Regasa",
  "/wiki/High_Republic_Era",
  "/wiki/Supreme_Huntress_of_the_United_Tribes",
  "/wiki/Ruler_of_Togrutas",
  "/wiki/Republic_Fair",
  "/wiki/Valo",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Master",
  "/wiki/Jora_Malli",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Stellan_Gios",
  "/wiki/Death",
  "/wiki/232_BBY",
  "/wiki/Battle_of_Kur",
  "/wiki/Lonisa_City",
  "/wiki/Hull",
  "/wiki/Bronzium",
  "/wiki/Captain",
  "/wiki/Maramis",
  "/wiki/Kiavene",
  "/wiki/Pike",
  "/wiki/Montral",
  "/wiki/Elzar_Mann",
  "/wiki/Starlight_Beacon",
  "/wiki/Avar_Kriss",
  "/wiki/Jedi_Vector",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Norel_Quo",
  "/wiki/Matari_(targon)",
  "/wiki/Voru_(targon)",
  "/wiki/Trangess_Conserra",
  "/wiki/Jedi_Temple",
  "/wiki/Gas",
  "/wiki/Breath_mask",
  "/wiki/The_Force",
  "/wiki/Walker",
  "/wiki/Krantian",
  "/wiki/Lerahel",
  "/wiki/Sarry",
  "/wiki/Targon",
  "/wiki/Trandoshan",
  "/wiki/Force_push",
  "/wiki/Shield_(physical_armor)",
  "/wiki/Gurney",
  "/wiki/Mikkel_Sutmani",
  "/wiki/Cafe",
  "/wiki/Tempest",
  "/wiki/Tempest_Runner",
  "/wiki/Pan_Eyta",
  "/wiki/Lourna_Dee",
  "/wiki/Grappling_hook",
  "/wiki/Ascension_cable",
  "/wiki/Journalist",
  "/wiki/Rhil_Dairo",
  "/wiki/Distress_signal",
  "/wiki/Medical_bay",
  "/wiki/Togruta_intelligence",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Cavan_Scott",
  "/wiki/2021",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Showdown_at_the_Fair",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}