{
 "name": "Eldon_Ax",
 "display_name": "Eldon Ax",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "3660 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Chratis",
      "Darth Howl"
     ]
    }
   ]
  }
 ],
 "content": "Eldon Ax, born Cinzia Xandret, was a Human female Sith living around the time of the Great Galactic War and the Cold War. Born the daughter of technician Lema Xandret, she was separated from her family and trained in the Sith Academy under Darth Chratis. At the age of 17, she was confronted with her past, as evidence of her family's whereabouts, now considered a traitor to the Sith Empire. Ax herself took over the search for the planet, which eventually led both the Sith Empire and the Galactic Republic to the planet Sebaddon. The two parties formed an alliance to destroy the hex droids made by Lema Xandret, who had the potential to depopulate the entire galaxy. As one of the leaders of the Empire, Ax encountered a clone of her own, taking control of the droids that could kill their master and eventually disable them.\nCinzia Xandret was stolen from her mother, a droid maker named Lema Xandret, by Darth Chratis while she was still a child. Because Lema Xandrent refused to willingly give up her child to the Sith, she was sentenced to death. Lema Xandret escaped the imposed death sentence by fleeing with some of her fellow droid makers. Darth Chratis imposed a Force powered mental block in Cinzia's mind to prevent her from recalling memories of her past, and renamed her Eldon Ax.\nAfter losing a battle against a Mandalorian named Dao Stryver, Ax was interrogated by her, who looking for information on Lema Xandret and a ship named Cinzia. It was later found that the remnants of the ship named Cinzia were found and were being auctioned off by a Hutt named Tassaa Bareesh. Prior to giving this information to the Sith Dark Council, Darth Chratis removed the memory block he imposed on Eldon Ax and told her the true story of her existence. Chratis and Ax were dispatched by the Dark Council to steal the remains of the Cinzia and execute Lema Xandret if she was found. During the attempt to steal the remnants of the Cinzia, mysterious and deadly hex droids appeared and thwarted the theft. Although the attempt to steal the artifacts was unsuccessful, Ax was able to use the remains of a hex to trace their origin back to a planet called Sebaddon. The Jedi were also able to do the same. Ax then traveled with her master to claim the planet for the Empire.\nUpon arriving at Sebaddon, the hexes launched a deadly defense of the planet which severely damaged both the Republic and Imperial Fleets. The two fleets brokered a truce and a temporary alliance to defeat the hex threat. To seal the deal, Chratis insisted that Ax accompany Jedi Grand Master Satele Shan, while he himself would take Shan's Padawan Shigar Konshi. During the battle, Ax found a clone of herself that was being kept alive in a tank filled with amnioid fluid. Ax also found that her mother had been killed by her own Hex Droid creations, but continued to exist and speak to her clone through the amnioid fluid. Ax learned from her clone that the Hex Droids were created to protect her. Upon release from the amnioid tank, the clone immediately died, but not before instructing Ax to feed her DNA into the hex computer. The hexes recognized Ax as Cinzia and followed her commands. Eldon Ax eventually killed her master Darth Chratis when she ordered hex droids to attack him during the battle on Sebaddon. She then ordered them to destroy themselves. Later, she became the apprentice of Darth Howl, a member of the Dark Council.\nA cunning young woman, Ax managed to kill her own master and cover it up. Recognized by the Dark Council, she eventually became a full apprentice to Darth Howl, no small feat in the merciless ranks of the Sith Empire.\nWhen she had learned of her origins, Ax, with her loyalties to the Sith, wanted to see her mother dead for her betrayal and wasn't afraid to admit that to anyone, even the Jedi.\nAx possessed a small ability for Force lightning and was a capable lightsaber duelist. Despite her age, when concentrating her rage, Ax was also quite adept at using Force barrier to prevent herself from getting seriously damaged, though she could still be outnumbered and overwhelmed when numbers were against her or when she was distracted, like in her battles with the Mandalorian Dao Stryver.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Eldon_Ax",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Cinzia_Xandret",
  "/wiki/3660_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Darth_Chratis",
  "/wiki/Darth_Howl",
  "/wiki/Sith/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Lema_Xandret",
  "/wiki/Sith_Academy",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sebaddon",
  "/wiki/Fastbreeder",
  "/wiki/Droid/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Dao_Stryver",
  "/wiki/Cinzia",
  "/wiki/Hutt/Legends",
  "/wiki/Tassaa_Bareesh",
  "/wiki/Dark_Council",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Shigar_Konshi",
  "/wiki/DNA/Legends",
  "/wiki/Death/Legends",
  "/wiki/Independent_Operation_Sebaddon",
  "/wiki/Force_lightning/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Force_barrier/Legends",
  "/wiki/The_Old_Republic:_Fatal_Alliance",
  "/wiki/The_Old_Republic:_Fatal_Alliance_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}