{
 "name": "Elea Poista",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 35 BBY—32 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bespin Motors",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Elea Poista was a female Human and senior Exex of Bespin Motors' shipping department. Under the alias \"Kel,\" Poista sold weapons on the black market during the Galactic Civil War.\nElea Poista was a Human female. Originally working for a shipping company on the planet Ralltiir, she transferred to Bespin Motors on Cloud City, becoming a top Exex in the company's shipping department. The move was purely financial; for years, Poista had been operating as an arms dealer named \"Kel,\" and the move to Bespin Motors was to secure shipping resources to serve her clients. The Kel identity was painstakingly created by Poista; Kel had birth records indicating a homeworld of Galltine, job history in the Hammo job corp, docking passes to multiple spaceports, and a presence in both Imperial and Cloud City records.\nWhile working for Bespin Motors, Poista was in charge of contracting Molly's Merchants to stage a buyout of Bespin Motors from their parent company, Incom Corporation. Molly's Merchants transferred funds from Incom to Bespin Motors, allowing them to buy themselves out as an independent company. However, while tracking down Molly's Merchants, Poista learned just how much crime the Empire created. Her realization led her to shift her business dealings to favor the Alliance to Restore the Republic. Poista's new goal was to hurt the Empire and aid the Rebellion in any way possible, and she used her connections to secure weapons to sell to the Alliance. Although rumored to sell to highest bidder, Poista maintained Imperial and criminal connections solely to funnel new Imperial technology to the Rebellion.\nFollowing the evacuation of Cloud City in 3 ABY, Poista led a Rebel cell in the metropolis, and sought to protect Lando Calrissian's secrets contained in the central computer. She was assisted by a protocol droid, Dee Fourpio, and the smuggler captain Tristos Arctura.\nElea Poista stood 1.7 meters tall, and had long,red hair which she wore in bun.\nPoista was skilled with a blaster, and was well-versed in bureaucratic procedure and business practices, especially relating to Bespin Motors.\nPoista carried a comlink and datapad. In her Kel persona, Poista wore a black wig and dressed in a black jumpsuit and cape.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/35_BBY/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Bespin_Motors/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Exex",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ralltiir/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Galltine",
  "/wiki/Hammo_job_corp",
  "/wiki/Spaceport/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Molly%27s_Merchants",
  "/wiki/Incom_Corporation/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Dee_Fourpio",
  "/wiki/Smuggler/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Tristos_Arctura",
  "/wiki/Blaster/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Jumpsuit/Legends",
  "/wiki/Cape/Legends",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin_(Second_Edition)",
  "/wiki/Gamemaster_Toolkit:_Live-Action_Adventures",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/0_ABY/Legends"
 ]
}