{
 "name": "Elecia_Zeveron",
 "display_name": "Elecia Zeveron",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Path of the Open Hand"
     ]
    }
   ]
  }
 ],
 "content": "Elecia Zeveron, also known as \"The Mother\", was a human female from the Core Worlds who was the spiritual leader of the Path of the Open Hand cult around 382 BBY. The Mother shared her last name with Jedi Knight Oliviah Zeveron.\nZeveron came to the Path's headquarters on the planet Dalna as a refugee and rose to prominence after joining the religion due to her Force visions, which led the members of the Path to view her as a prophet. She quickly replaced Werth, the Herald, as the leader of the cult, and began expanding the group's operations. Zeveron encouraged the Path's pre-existing belief that the Force needed to be freed from those individuals capable of using it, such as the Jedi Order, which the Mother had a particular distaste for. Zeveron founded a team, the Children, to \"liberate\" Force artifacts from other worlds and bring them to her. She also sought out wealthy benefactors for the cult, and began the construction of the Gaze Electric, a starship intended to become the Path's new headquarters so they could spread their word throughout the galaxy.\nOriginally a refugee from the Core Worlds, Elecia Zeveron came to the Outer Rim world of Dalna along with waves of others, as the Galactic Republic expanded towards new worlds in the Galactic Frontier. Many of the new colonists were faced with challenging circumstances as communications were still unreliable due to the time it required them to reach their destination, and many were forced to flee conflicts such as the Forever War between Eiram and E'ronoh. On Dalna, such refugees were welcomed and helped by a missionary group called the Path of the Open Hand. The Path was a cult which worshipped living in harmony with the Force, including the principle of giving gifts to others who would then extend gifts in return. Their philosophy also included complete abstinence from using the Force, believing that such use could have dramatic consequences in distant places for away.\nElecia joined the Path and revealed herself to be a prophet, receiving visions from the Force seemingly confirming the rightfulness of the Path's views. The Path's members were taken by these claims and quickly elevated Elecia as their spiritual leader, granting her the title of \"Mother\". Although the Path had an existing leadership in the form of a Council of Elders and a Nautolan named Werth, who led the group under the title of \"Herald\", the newly-titled Mother supplanted them in the hierarchy of the Path, become the cult's de facto leader. With her newfound authority, she expanded on the Path's ideology, giving it a more active role than the initial passive and missionary focus that she had found it under. Elecia preached that the focus should not simply be to resist interacting with the Force, as other groups such as the Jedi Order did, but to \"free\" the Force in all manners. Only this \"freedom\" would help the Force achieve true balance.\nIn order to achieve this goal, the Mother created a new group within the Path: the Children. Composed of Werth's daughter Kor Plouth, the human Cincey, a Mikkian thief named Treze, and Plouth's girlfriend Yana Ro, one of the cult's two Evereni members, the Children's official mandate was proselytizing, expanding the Path's beliefs to other planets along the Frontier. However, secretly, the Children's mission was to steal artifacts imbued with the Force and then returning them to Path's complex on Dalna. Such artifacts were then either destroyed or stored to prevent use, in line with the group's doctrine about freeing the Force.\nThe Mother was also instrumental in gaining donors for the Path, generous benefactors who funded some of their enterprises. One such project was the construction of a massive, hyperspace-capable starship called the Gaze Electric. The ship would allow the Path to become mobile, leaving Dalna to expand their presence beyond a single world.\nAround 382 BBY, Zeveron recruited the smuggler Radicaz Dobbs to help her locate parts of a set of three rods, Force artifacts which she particularly desired for her plans. She also accepted from Dobbs a jewel-like egg he had found on a Wild Space planet, sensing great potential within.\nThe Path became the subject of a Jedi investigation after the Children stole the Rod of Seasons artifact from Hynestia Prime. Jedi Master Zallah Macri and Padawan Kevmo Zink introduced themselves to the cult while looking into them as likely suspects. Zink in particular developed a mutual attraction with Marda Ro, Yana's cousin and the other Evereni member of the Path, who was a devoted and obsessive follower of the Mother.\nAfter avoiding the Jedi visitors, the Mother confronted the duo after they broke into the Path compound to retrieve stolen Force artifacts. She hatched the egg to reveal a bizarre and unsettling creature she named the Leveler, which overwhelmed and destroyed Macri and Zink. Zeveron used the event to further spur the Path into fanaticism, claiming the Leveler was a gift from the Force, before leading the cult to flee Dalna on the Gaze Electric.\nElecia shared her last name with Oliviah Zeveron, a Jedi Knight stationed on the moon Jedha during the same time period.\nThe Mother was a human female with brown skin and darker brown hair. She gained silver streaks in her hair after the birth of the Leveler. Zeveron strongly disliked the Jedi Order, and plotted to use the Path of the Open Hand to carry out operations against them.\nElecia Zeveron's Force visions led the Path of the Open Hand to venerate her as a prophet, as they saw the visions as a gift. Zeveron also had an unusually compelling presence, with the smuggler Radicaz Dobbs being particularly strongly affected. After meeting the Mother, Dobbs became quickly devoted to her service, despite having originally intended to con her, and felt deprivation whenever he was not around her.\nThe Mother wore silver robes in a similar style to those worn by the other members of the Path of the Open Hand, but made of finer material.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mother_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Path_of_the_Open_Hand",
  "/wiki/Core_Worlds",
  "/wiki/Religion",
  "/wiki/382_BBY",
  "/wiki/Jedi_Knight",
  "/wiki/Oliviah_Zeveron",
  "/wiki/Path_compound",
  "/wiki/Planet",
  "/wiki/Dalna",
  "/wiki/Refugee",
  "/wiki/Force_vision",
  "/wiki/Werth",
  "/wiki/The_Force",
  "/wiki/Jedi_Order",
  "/wiki/Children",
  "/wiki/Force_artifact",
  "/wiki/Gaze_Electric",
  "/wiki/Starship",
  "/wiki/The_galaxy",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Frontier",
  "/wiki/Eiram_and_E%27ronoh_War",
  "/wiki/Eiram",
  "/wiki/E%27ronoh",
  "/wiki/Mother_(title)",
  "/wiki/Nautolan",
  "/wiki/Kor_Plouth",
  "/wiki/Cincey",
  "/wiki/Mikkian",
  "/wiki/Treze",
  "/wiki/Yana_Ro",
  "/wiki/Evereni",
  "/wiki/Hyperspace",
  "/wiki/Smuggler",
  "/wiki/Radicaz_Dobbs",
  "/wiki/Nameless_control_rods",
  "/wiki/Egg",
  "/wiki/Unidentified_planet_(Nameless)",
  "/wiki/Jedi",
  "/wiki/Mission_to_Dalna_(Macri_and_Zink)",
  "/wiki/Theft_of_the_Rod_of_Seasons",
  "/wiki/Rod_of_Seasons",
  "/wiki/Hynestia_Prime",
  "/wiki/Jedi_Master",
  "/wiki/Zallah_Macri",
  "/wiki/Padawan",
  "/wiki/Kevmo_Zink",
  "/wiki/Marda_Ro",
  "/wiki/Nameless",
  "/wiki/Great_Leveler",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/Time",
  "/wiki/Hair",
  "/wiki/The_High_Republic:_Path_of_Deceit",
  "/wiki/The_High_Republic:_Path_of_Deceit_(audiobook)",
  "/wiki/The_High_Republic_(2022)_2",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/232_BBY",
  "/wiki/Template:LightOfTheJediDate",
  "/wiki/Standard_year",
  "/wiki/Peace_and_Unity",
  "/wiki/The_High_Republic_(2022)_1"
 ]
}