{
 "name": "Eleni_Syndulla",
 "display_name": "Eleni Syndulla",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 19–12 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Syndulla clan"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Twi'lek Resistance",
      "Free Ryloth Movement"
     ]
    }
   ]
  }
 ],
 "content": "Eleni Syndulla was a female Twi'lek from Ryloth. The wife of the freedom fighter Cham Syndulla, she had a daughter, Hera, with him. During the Clone Wars, Eleni hid herself and her daughter underground to stay safe amidst the battle between the Grand Army of the Republic and the Separatist Droid Army, but she also joined her husband's resistance movement and fought in the battle. Later, she was killed in Cham's new resistance against the Galactic Empire, a loss which drove her husband to become obsessed with protecting Ryloth and created a rift between him and their daughter.\nIn 2 BBY, when Grand Admiral Thrawn's forces set up headquarters in the Syndulla residence as part of the Imperial occupation of Tann Province, Hera attempted to recover her mother's Kalikori, a precious Twi'lek heirloom, from her home. Although she was unsuccessful and the Kalikori was taken by Thrawn, Hera accepted that she did not need it to keep her mother's memory alive as long as she held onto her father and the members of her crew who had become like family.\nEleni Syndulla was a female Twi'lek who was a native of the planet Ryloth and married freedom fighter Cham Syndulla. Together the two had a daughter, Hera, who she gave birth to in 29 BBY. Their family also included a son who died young. During the Battle of Ryloth, when she was eight, Hera and her mother fled underground while the Grand Army of the Republic battled the Separatist Droid Army. Despite her mother's attempt to hide her family, the young Hera would peek out when Republic ships flew overhead to liberate Ryloth. Seeing the ships inspired Hera to become a pilot. Eleni joined the Twi'lek Resistance, fighting alongside her husband to ensure their world became free.\nAfter the Clone Wars had ended, Eleni and Cham initially cooperated with the new Galactic Empire, as Cham was tired of war and did not want the same life for his daughter. Eleni, however, quickly grew suspicious of the Empire's motives, noticing that they were taking away control of Ryloth from the Twi'leks and putting it in the hands of their own people. Shortly after the formation of the Empire in 19 BBY, Eleni, Cham, and Senator Orn Free Taa were present in the capital city of Lessu, where an uneasy crowd waited to hear the unpopular senator speak. Vice Admiral Rampart noted that the Empire was displeased by the Twi'leks being troubled by the Imperial presence, as their new refinery would bring jobs to the citizens. Taa claimed that the people welcomed the partnership, asking Eleni if she agreed. Eleni responded that she would support whatever helped Ryloth.\nTaa was booed by the crowd when he spoke about cooperation with the Empire, as the people demanded to hear Cham. The General moved to speak, with Eleni and Clone Captain Howzer standing nearby. Cham said that he trusted the clone army and asked his people to lay down their weapons so they could look to Ryloth's future, receiving cheers from most of the crowd, to the distress of Senator Taa. After the crowd began dispersing, Admiral Rampart told Eleni that it was a shame her eleven year old daughter had not been there to share in the event. Unnerved, Eleni stated that Hera had other interests, looking uncomfortable as the Imperial officer walked away.\nLater, at the Syndulla residence, Eleni and Gobi Glie watched while Cham oversaw Twi'leks turning in their weapons. Glie, a long-time lieutenant of Cham's, was disturbed that he was okay with letting clones protect Ryloth. Eleni noted that her husband knew the people were tired of fighting and that they could not go on as they had been. Disagreeing, Glie argued that the disarmament had made them defenseless, and he had already reached out to his contact to acquire more weapons. Just then, Howzer arrived with his squad of clones, escorting Hera and her astromech droid Chopper. Howzer told Cham the two had been caught trespassing in a restricted area, and that he would not report them but that such an incident could not happen again. Glie admitted to Cham that he had sent Hera, and as the two men argued, Eleni escorted Hera and Chopper inside the house. Eleni told her daughter that she was aware she had been at the Imperial refinery, responding to the girl's surprise by explaining that she had her ways and telling her to report and leave nothing out.\nLater, Eleni and Cham were given a tour of the refinery by Rampart, who insisted that the doonium mine would only benefit their planet. Noting the facility's turbolasers, Eleni pointed out that, contrary to the Empire's claims, it appeared to be a military facility, as there were also soldiers stationed there. Rampart countered that Ryloth had been vulnerable under the Republic, but it would not be under the Empire. After the Admiral excused himself, Eleni argued with Cham about whether they were truly getting the peace they wanted. After her and Cham found out that Hera, along with Gobi Glie and Serin had been captured by the Empire, they launched a rescue attempt, which had short lived success, as they did free the prisoners, however Eleni, along with the rest of the rebels besides Hera were captured by the Empire.\nEleni and the other rebels were brought back to Lessu and placed in prison cells. After Hera managed to escape the Empire, she began spying on Lessu. She then overheard that the Empire was sending an Elite Squad to hunt her down. With this realization, she made contact with Clone Force 99 and requested their help. While they were hesitant, Omega convinced them to help. After causing a distraction at the refinery, Hunter and Echo were able to break into the prison and rescue the Syndullas and their supporters and are able to escape the planet with the help of Howzer. Once back at their ship Eleni offered the Batch credits. However, they refused, saying that they will need them to continue their fight against the Empire.\nEleni joined her husband in resisting against the Empire that entrenched themselves on Ryloth after the fall of the Galactic Republic. During this resistance movement, she was killed by the Imperial forces that invaded their homeworld.\nAfter Eleni's death, Cham completely dedicated himself to his fight against the Empire, which caused strain with Hera. The distance between father and daughter was one of the reasons that Hera left Ryloth with Chopper in 12 BBY when she was seventeen years old, ultimately becaming a leading member of the fledgling rebellion against the Empire. When Cham reunited with Hera during a mission for the rebellion to steal a Quasar-class cruiser stationed over Ryloth, Cham let his bitterness at the loss of Eleni at the hands of the Empire and his obsession with protecting Ryloth fall into wanting to instead destroy the ship. In the end, Hera and Cham reconciled and they carried through with the original intent of the mission.\nIn 2 BBY, during the Imperial Military's occupation of Ryloth's Tann Province by forces under the command of the Chiss Grand Admiral Thrawn a portrait of Eleni with her husband and daughter was still on display in Cham Syndulla's office in the family home along with the Syndulla clan's Kalikori, a priceless family heirloom that once belonged to her. After learning from her father that Thrawn made the Syndulla home his headquarters and that he had not managed to escape with the Kalikori, Hera vowed to recover it. She embarked with Ezra Bridger to the Syndulla residence and successfully found the Kalikori. However, the pair was captured before they could escape. Using his vast knowledge of art, Thrawn determined the captured Twi'lek woman was Hera Syndulla because of her interest in the family heirloom. While ultimately she managed to escape, Thrawn took Eleni's Kalikori, which he kept in his collection of art on Lothal along with two holoimages of the portrait of Eleni herself. Despite the painful loss, Hera accepted that she did not need the Kalikori to keep her mother's memory alive and as long as she held onto her father, Kanan Jarrus and the rest of her chosen family, Eleni would live on. The Kalikori was later returned to Hera's possession when she was rescued from the Lothal Imperial Complex by her fellow Spectres.\nA female Twi'lek, Eleni had green skin and green eyes. Eleni was a dreamer and had a similar personality to her daughter. When the Empire came to Ryloth, Eleni initially cooperated, but quickly became suspicious of their motives, realizing that they were seizing control of the planet from its residents and that her husband was being willfully blind out of a desire for peace. She was a generally curious person.\nEleni was a selfless parent, fighting to free Ryloth during the Clone Wars in hopes that her daughter Hera would reap the benefits of liberation. During the Imperial Era, she tried to balance keeping Hera safe but also not allowing the new regime to take away what they had fought for.\nIn a mosaic illustration of her family kept in the Cham Syndulla's office in their home on Ryloth, she wore a light green head covering and an auburn colored shirt.\nEleni Syndulla was first mentioned in the 2015 Star Wars Rebels episode \"Wings of the Master.\" She first appeared the 2016 episode \"Hera's Heroes\" in an illustration of the family in the Syndulla residence. A StarWars.com blog post recapping the episode initially erroneously identified the character as \"Tislera,\" but this name was later removed. Her actual name was revealed in her first proper appearance in the Star Wars: The Bad Batch episode \"Devil's Deal,\" where she was voiced by Ferelith Young. According to Lucasfilm Story Group's Pablo Hidalgo, they made the Kalikori storyline in \"Hera's Heroes\" connected to Hera's mother because the show had already emphasized Hera's relationship with her father Cham.\nAlthough other sources established that Eleni was killed by Imperial forces, Star Wars: Women of the Galaxy mistakenly stated that she died during the Separatist invasion of Ryloth.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Eleni_Syndulla",
  "/wiki/Special:Upload",
  "/wiki/Ryloth",
  "/wiki/19_BBY",
  "/wiki/12_BBY",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Syndulla_clan",
  "/wiki/Twi%27lek_Resistance",
  "/wiki/Free_Ryloth_Movement",
  "/wiki/Marriage",
  "/wiki/Cham_Syndulla",
  "/wiki/Hera_Syndulla",
  "/wiki/Clone_Wars",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Death",
  "/wiki/Galactic_Empire",
  "/wiki/2_BBY",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Syndulla_residence",
  "/wiki/Ryloth_Insurgency#The_rebellion",
  "/wiki/Tann_Province",
  "/wiki/Kalikori",
  "/wiki/Parent",
  "/wiki/Spectres",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Reproduction",
  "/wiki/29_BBY",
  "/wiki/Hera_Syndulla%27s_brother",
  "/wiki/Galactic_Republic",
  "/wiki/Starship",
  "/wiki/Pilot",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Senator",
  "/wiki/Orn_Free_Taa",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Lessu",
  "/wiki/Vice_Admiral",
  "/wiki/Rampart",
  "/wiki/Imperial_doonium_refinery",
  "/wiki/Clone_Captain",
  "/wiki/Howzer",
  "/wiki/Admiral",
  "/wiki/Imperial_officer",
  "/wiki/Gobi_Glie",
  "/wiki/Lieutenant",
  "/wiki/Cid",
  "/wiki/Squad",
  "/wiki/Astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Refinery",
  "/wiki/Doonium",
  "/wiki/Mining",
  "/wiki/Turbolaser",
  "/wiki/Soldier",
  "/wiki/Serin",
  "/wiki/CT-9904%27s_Elite_Squad",
  "/wiki/Clone_Force_99",
  "/wiki/Omega",
  "/wiki/Hunter",
  "/wiki/Echo",
  "/wiki/Standard_year",
  "/wiki/Mission_to_Ryloth_(Phoenix_Squadron)",
  "/wiki/Quasar_Fire-class_cruiser-carrier",
  "/wiki/Imperial_Military",
  "/wiki/Chiss",
  "/wiki/Second_mission_to_Ryloth",
  "/wiki/Ezra_Bridger",
  "/wiki/Lothal",
  "/wiki/Hologram",
  "/wiki/Kanan_Jarrus",
  "/wiki/Rescue_of_Hera_Syndulla_(Lothal)",
  "/wiki/Imperial_Complex_(Lothal)",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/2015",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Wings_of_the_Master",
  "/wiki/2016",
  "/wiki/Hera%27s_Heroes",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Devil%27s_Deal",
  "/wiki/Ferelith_Young",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Category:Images_of_Eleni_Syndulla",
  "/wiki/Rescue_on_Ryloth",
  "/wiki/Homecoming",
  "/wiki/An_Inside_Man",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Databank_A-Z",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/Timothy_Zahn:_Heir_of_an_Empire",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/5_BBY",
  "/wiki/Jedi_Night",
  "/wiki/Star_Wars_Rebels:_Steps_Into_Shadow",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Mon_Mothma",
  "/wiki/Declaration_of_the_Rebel_Alliance",
  "/wiki/Battle_of_Yavin"
 ]
}