{
 "name": "Elga_Arbo",
 "display_name": "Elga Arbo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Elga Arbo was a Corellian woman and the captain of the modified Starfeld Industries Z-10 Seeker Redshift Runner. She specialized in fast deliveries.\nA pilot specialized in high-speed deliveries and courier work, Elga Arbo bought a modified Starfeld Industries Z-10 Seeker, the Redshift Runner, from an independent scout. She intended to convert it into the fastest possible ship, and to do so she had the help of Maceb Joodsen, a co-pilot and starship mechanic from Demar, and of Gydio Lucone, a usurer who lend Arbo some money to improve the ship's hyperdrive.\nLucone had purposefully signed strict conditions so that, should Arbo did not pay monthly, Lucone would then impound the ship. Lucone did hoped this situation would happen, as it would give Lucone the chance to blackmail Arbo and make her smuggle for Lucone. However, Arbo systematically paid in time and at the same time she got a reputation as a legal pilot.\nOne day, the Galactic Empire ordered a shutdown in a stopover starport, which delayed Arbo for three days in her next pay. Lucone moved in to claim the ship, which Arbo attempted to stop and violence ensued. Arbo was seriously injured during the fight, but she eventually escaped on the Runner, with Joodsen piloting.\nLucone then issued a 20000 credit bounty for the ship. Three months later, the bounty had not been claimed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Starfeld_Industries/Legends",
  "/wiki/Z-10_Seeker-class_scout_ship",
  "/wiki/Redshift_Runner",
  "/wiki/Pilot/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Maceb_Joodsen",
  "/wiki/Starship/Legends",
  "/wiki/Demar",
  "/wiki/Gydio_Lucone",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Bounty/Legends",
  "/wiki/Stock_Ships"
 ]
}