{
 "name": "Elglih",
 "display_name": "Elglih",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Serphidi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Serp"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Elglih was an aging male Serp who lived on the planet Serphidi with his wife during the Galactic Civil War. A committed opponent of the Serp King S'Shah, Elglih began training for a deadly Doom-Joust in an effort to seize the throne, despite his advanced age. However, Rebel pilot Luke Skywalker agreed to serve as his squire and fight in his stead, resulting in Elglih being crowned the new King and swearing allegiance to the Rebel Alliance.\nA male Serp, Elglih lived with his wife in a meager hut in a forested region of Serphidi known as Harmony Glade. Once, he was a proud and able-bodied member of his species, but like many others, he was forced to watch his society fall into decline under the rule of a monarch known as King S'Shah. Three years after the Battle of Yavin, Elglih was hunting through the marshlands near his home when a vicious carnivorous plant attacked him. Elglih would have been consumed had it not been for the timely arrival of a Rebel Alliance officer named Luke Skywalker, who had set out to rescue a fellow Rebel pilot S'Shah's forces had captured. Skywalker saved the old Serp from the creature and safely returned him to his home.\nOver dinner, Elglih told Skywalker the history of his people and how they came to be under S'Shah's rule. He further announced that he was going to challenge the monarch to face him in an event known as a Doom-Joust, which served as he only way that S'Shah could be replaced as king. Knowing that he was too old and infirm to actually prevail against S'Shah, Elglih got the youthful Skywalker to serve as his squire, which allowed Skywalker to serve as his champion and fight in his place—a gambit that paid off when Skywalker defeated the King. Although Skywalker had a claim to the throne as S'Shah's slayer, he allowed Elglih to take the throne, crowning him as the new monarch. Elglih pledged his loyalty to the Rebel Alliance and vowed to do everything within his power to keep Imperial influences off Serphidi.\nElderly and white-bearded by the time of the Galactic Civil War, Elglih was possessed of a strong sense of duty towards his people and his homeworld, and came to saw putting himself on the line in a Doom-Joust as the only way he could help Serphidi—even though he knew he had little chance of coming out alive. S'Shah had previously altered the tradition of the Doom-Joust to make them contests to the death, which Elglih saw as a barbarous practice, but necessary for him to participate in. However, Elglih was also cunning, and impressed by Luke Skywalker's strength, saw the young Human as his ticket to success.\nElglih appeared in Star Wars  64, written by David Michelinie and Michael Fleisher, illustrated by Joe Brozowski and released in 1982.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Serphidi/Legends",
  "/wiki/Serp",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/King/Legends",
  "/wiki/S%27Shah",
  "/wiki/Doom-Joust/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Harmony_Glade",
  "/wiki/Species/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Unidentified_carnivorous_Serphidian_plant",
  "/wiki/Cinda_Tarheel",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Star_Wars_(1977)_64",
  "/wiki/David_Michelinie",
  "/wiki/Michael_Fleisher",
  "/wiki/Joe_Brozowski",
  "/wiki/1982"
 ]
}