{
 "name": "Eliya",
 "display_name": "Eliya",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "44 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fallanassi"
     ]
    }
   ]
  }
 ],
 "content": "Eliya was a female Human Fallanassi around the time following the Second Galactic Civil War. In 44 ABY, the entity Abeloth arrived on Pydyr and hid with the Fallanassi there. They were soon discovered by a group of Jedi and Sith led by Luke Skywalker and Sarasu Taalon. Eliya thought that Skywalker had betrayed them by bringing the Sith there, but Skywalker responded that the danger they faced was greater than the Sith. Taalon questioned whether Abeloth was there, and Eliya replied that she had left. Suddenly, the Fallanassi Akanah Norand Goss Pell—in actuality, Abeloth in Pell's body—arrived.\nTaalon began to question her, and when she was not forthcoming, the Sith Saber Gavar Khai took Eliya hostage and held his lightsaber to her thigh. Eliya told Pell not to answer their questions, but Pell told Skywalker that Abeloth had returned to the Fallanassi because she was a Fallanassi. However, when Skywalker questioned whether that meant that she had always been a Fallanassi, or whether she had only recently joined, Pell declined to answer. Taalon nodded to Khai, who activated his lightsaber. Eliya screamed in pain and fell onto the Sith Saber's chest. He stepped backward, and she fell onto his blade, to her death. Pell responded that she was not intimdated, however, and in retaliation attacked the Sith with visions via the White Current, causing them to go insane. It was this action that led Skywalker to be certain that Pell was in actuality Abeloth—the real Pell would not have done such a thing.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/44_ABY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Fallanassi/Legends",
  "/wiki/Time/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Abeloth",
  "/wiki/Pydyr",
  "/wiki/Jedi/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Sarasu_Taalon",
  "/wiki/Sith/Legends",
  "/wiki/Akanah_Norand_Goss_Pell",
  "/wiki/Sith_Saber",
  "/wiki/Gavar_Khai",
  "/wiki/Lightsaber/Legends",
  "/wiki/Death/Legends",
  "/wiki/White_Current",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)"
 ]
}