{
 "name": "Ellian_Zahra",
 "display_name": "Ellian Zahra",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Hunter Fleet",
      "Imperial Navy's officer corps",
      "Hunter Fleet"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Wilhuff Tarkin"
     ]
    }
   ]
  }
 ],
 "content": "Ellian Zahra was a human female who held the rank of Commander in the Galactic Empire during the Galactic Civil War against the Rebel Alliance. Both cunning and vengeful, Zahra served at the helm of the Star Destroyer Tarkin's Will. Zahra rose through the Empire as the protégé of Governor Wilhuff Tarkin. After she failed Tarkin during a mission, Zahra's mentor dismissed her, though Zahra attempted to regain his favor. However, Tarkin perished aboard the Death Star battle station when it was destroyed by the Rebel Alliance during the Battle of Yavin. Zahra held a personal grudge against Princess Leia Organa of the Rebellion for Tarkin's death.\nFollowing the Battle of Hoth, Zahra was assigned to lead attacks on the divisions of the scattered Alliance Fleet. She failed to prevent the rebel Fourth Division from escaping due to the intervention of the rebels aboard the freighter Millennium Falcon, including Organa. Zahra continued to hunt down other divisions, but desired to destroy the Fourth Division and Organa along with it. During a battle against the Fourth and Seventh Divisions at Elessia, Zahra confronted Organa personally, wounding the rebel leader with her blade—an act Zahra believed would demoralize Organa.\nEllian Zahra was born to parents who were eventually killed, along with the rest of her family, in a rebel terrorist attack when she was still young. Forced to survive on her own for some time, Zahra entered into the Imperial Academy during the reign of the Galactic Empire. Due to her lack of familial or other ties, Zahra was one of several students selected by the Governor of the Outer Rim Territories, Wilhuff Tarkin, who provided instruction and influence. Rising through the Academy, Zahra scored at the highest level in the Empire's selection exams, entering into Imperial service.\nEventually, Tarkin brought Zahra, along with two other similar officers, Beldin and Hannevik, to his homeworld of Eriadu. In order to test them and determine the one who would be his protégé, Tarkin sent them to hunt down an albino veermok on the Carrion Plateau. Managing to catch the veermok in the forest, Zahra successfully killed the creature. She additionally determined that Tarkin intended for the candidates to hunt each other, and as such defeated her fellow colleagues. She returned to Tarkin with the veermok's head, having passed the test set by her mentor. Zahra continued to rise through the Empire under Tarkin's mentorship, accompanying him on Imperial business and combating efforts of rebellion. After several years of working alongside Tarkin, Zahra had attained the rank of Lieutenant Commander in the Imperial Navy.\nAround 0 BBY, Tarkin sent Zahra from the Death Star battle station on a mission to eliminate the warlord Burnium Ro on the Mid Rim planet Ikkrukk, citing Ro's use of imagery associated with the obsolete Nihil criminal organization. Zahra took a strike force that included Tarkin's flagship, the Carrion Spike, tracking Ro down using a network of probe droids. On the cloaked Carrion Spike, Zahra followed Ro to his stronghold, destroying the stronghold and Ro's forces.\nHowever, upon Zahra's return to the Death Star, Tarkin informed her that she had instead killed one of Ro's decoys, and the real warlord had used her failure to elevate himself. Tarkin was disappointed by Zahra's failure, believing he had been wrong in choosing her as a protégé. Zahra was ordered to report to the personnel office for reassignment, but instead continued to search for Ro. Having tracked Ro down, Zahra returned to Tarkin a week later, amidst an attack on the Death Star caused by the Rebel Alliance, the Battle of Yavin. However, Zahra's efforts to meet with Tarkin were denied.\nZahra resolved to hunt Ro herself, demanding the use of a shuttle from a Death Star hangar. The stormtrooper guarding the shuttle refused, having been assigned to hold the shuttle for the potential evacuation of high-ranking Imperial officers. Believing that the rebel attack was futile, Zahra knocked the trooper unconscious and commandeered the shuttle, setting a message to be transmitted to Tarkin, informing her mentor of her mission. However, as Zahra departed the Death Star, the space station was destroyed by the rebels, killing those aboard, including Governor Tarkin. Holding Princess Leia Organa responsible for her mentor's death, Zahra vowed to kill her to avenge Tarkin as she considered it as compensation as to redeeming herself in his eyes. As per orders from Tarkin before his death, Zahra was indefinitely assigned non-essential duties. She was eventually placed in command of Mining Facility 81-B on the spice mining world Kessel.\nZahra, holding the rank of Commander, was still stationed on Kessel by the time of the Battle of Hoth in 3 ABY, in which the Rebel Alliance's fleet was forced to scatter into numerous divisions. With orders from Governor Tarkin's mentor Emperor Palpatine to have the remnants of the fleet hunted down and destroyed, his apprentice Sith Lord Darth Vader, having known about Zahra's record when Tarkin introduced her to his old friend, assigned her to the task. Vader allowed Zahra to be given any resources that were necessary, but warned her not to fail both him and the Emperor.\nGiven the opportunity to choose any vessel in the Imperial Navy as her flagship from Lord Vader, Zahra took command of the Fortitude, an Imperial II-class Star Destroyer that had been damaged in the Battle of Yavin, and rechristened it as the Tarkin's Will. As a memorial to the loss of the Death Star, Zahra chose other Imperials who had lost close individuals in the station's destruction as her crew. Lieutenant Gorr was assigned to the Tarkin's Will as Zahra's second in command.\nUsing a signal analysis protocol she had developed some time prior, Zahra tracked down two divisions that attempted to communicate—the Fourth and Eighth Divisions. As she planned to Zahra split her battle group, sending her secondary strike force to attack the Eighth Division near Malastare while she led an attack on the Fourth Division, which was attempting to regroup at Rendezvous Point Delta-Three. Zahra utilized a tactic she had previously devised, blockading the rebel fleet with a turbolaser cordon and trapping them against a star. Unable to escape, the Fourth Division suffered heavy losses.\nWhen one rebel X-wing starfighter escaped the blockade, Zahra requested that she take manual control of a turbolaser. An Imperial technician was hesitant to do so, but gave control to Zahra upon the insistence of Lieutenant Gorr. Manually controlling the turbolaser, Zahra managed to hit and destroy the starfighter. The arrival of the freighter Millennium Falcon, carrying several prominent members of the Rebel Alliance including Organa, interfered with Zahra's plans. The Falcon managed to destroy one of the Imperial light cruisers, allowing the survivors of the Fourth Division to escape to hyperspace.\nHaving failed to eliminate the Fourth Division, Zahra contacted Lord Vader to give him a status report, who reprimanded her, both for her lack of success and attempting to destroy the Millennium Falcon, which, unknown to Zahra, carried Governor Tarkin's killer and the Rebel pilot who destroyed the Death Star, Jedi Commander Luke Skywalker, the son of Vader, who the Sith Lord wanted alive to be an ally of the Empire and the Sith. Ordering Zahra to destroy what remained of the rebel fleet, Vader dismissed her with a warning against further failure.\nAfter locating the Alliance's Sixth Division, Zahra led the Tarkin's Will in an attack on the rebel vessels. Although her forces were able to eliminate all targets within the system, they had no leads as to the locations of the remaining cells, though Zahra was certain that the rebels would be found due to her numerous plans. When Lieutenant Gorr, unaware of the Star Destroyer's history, requested that repairs be made to the ship, Zahra chastised Lieutenant Gorr, informing him that the Tarkin's Will served as a memorial to those who died aboard the Death Star, and that the damage it sustained in the battle was a reminder of all who they had lost.\nZahra later intercepted transmissions from a group of rebels who she believed were the Alliance Fleet's Seventh Division. Her forces continued to track the division's movements, waiting for it to contact, and subsequently reveal the location of, another cell. Zahra contacted Lord Vader, reporting her plan. Vader was pleased at her progress, but became distracted by the activation of a trap he had set at a Jedi outpost on the astronomical object Tempes. When Vader ordered his pilot to set a course for Tempes, Zahra offered to bring the Tarkin's Will to assist, but Lord Vader insisted that he would handle it himself.\nWhen the Fourth Division responded to the Seventh Division's transmission, Zahra intended to send her second strike force after the Seventh Division while attacking the Fourth Division herself in order to eliminate Organa and finally get her revenge. However, after Lieutenant Gorr noted that their fleet was closer to the Seventh Division, Zahra relented, allowing the other force to pursue the Fourth. While Zahra's attack on the Seventh Division at Elessia appeared to be overwhelming their targets, her secondary strike force arrived at the Fourth Division's coordinates to find the rebels had already left. Zahra was about to reprimand Gorr when the vessels of the Fourth Division emerged from hyperspace behind the Imperial fleet.\nZahra intended to lead a boarding party against the rebel fleet, ordering Gorr to prepare her shuttle. Gorr questioned if it was wise for Zahra to lead a boarding party amidst the battle, but Zahra insisted that it was necessary to complete the mission herself. Instructing Gorr to take command of the battle and follow her own methods, Zahra and her team of stormtroopers boarded the EF76 Nebulon-B escort frigate that served as the Fourth Division's flagship, cutting down the rebel troopers that attempted to stop them. Zahra made her way to the vessel's engine room, disabling its safety systems. Contacting the frigate's commanders, Zahra informed them of the vessel's imminent destruction, vowing to reactivate the systems and save the ship if Organa came alone to the engine room and she was allowed to bring any weapons she wanted.\nOrgana did as she had been asked, and Zahra trapped her in the engine room once she entered. Zahra promised Organa that she would not use her blaster and that she would let Organa go if she reached the exit on the opposite side of the room alive. Hidden from Organa's view, Zahra told her about her life, including the death of her family and becoming Governor Tarkin's protégé. As she spoke, Zahra struck Organa two times with her blade. Before Zahra could take her revenge, she was contacted by the Tarkin's Will—which intended to flee under the fire of both rebel divisions—and was then confronted by Commander Skywalker.\nAfter warning Organa that she would return, Zahra distracted Skywalker by throwing her blade past his head, subsequently leaping over the Jedi and kicking him in the back. Zahra broke through a viewport to escape the rebel ship and flew aboard the Tarkin's Will with her jetpack, boarding the Star Destroyer before it departed. Despite failing to kill Organa, Zahra was satisfied with having injured her, believing that her threat would cause her nemesis to lose hope.\nOne of the plans Zahra had developed to locate the other divisions of the rebel fleet was leaving viper probe droids at the rendezvous points of the naval groups she wiped out. Organa and Commander Grek had developed a mission called Operation Starlight which was to reassemble the Alliance by having a starfighter group called Starlight Squadron travel to the other rally points and give the surviving naval divisions a new transmission security code based on the indecipherable language of Trawak so their mission can succeed in banding the Rebellion together once again without it being broken by Zahra's signal analysis protocol. When the squadron had traveled to the Sixth Division's location near Felucia the probe droids alerted Zahra of the intruders but they were destroyed when Starlight Leader Lieutenant Shara Bey ordered the X-wings to activate their astromech droids self destruct so the commander wouldn't get the other rendezvous point coordinates. When she arrived, Gorr was told they had to capture the starfighters since their insignia was unique and she wanted to learn what they were up to before the A-wing starfighters could share their nav data with the X-wings so they could return to their home. When the tractor beams activated, they were damaged by Starlight Squadron pulling off an untested maneuver created by Rogue Squadron however it did cause the A-wings' navigational memory banks to be fried so they were forced to destroy any forces in the hangar bay and land to find a new one. When Lieutenant Gorr informed Zahra of the situation she gave orders for him to take it back. Bey and Freyta Smyth managed to slice into one of Zahra's Imperial astromechs and hooked it onto Commander Wedge Antilles' x-wing to run the hyperspace calculations needed to escape back to their fleet. Almost all of the starfighters got away except for Lieutenant Bey since her A-wing was destroyed but she managed to slip away by the time stormtroopers arrived in the hangar and she managed to carve a little hiding place to live in so she could gather intel for General Organa until a rescue party comes to get her. Thanks to Starlight Squadron hijacking one of her astromech droids the rebels now had nav data that they could not only use for their operation but to trace the Tarkin's Will as well, Organa who was feeling hopeless after all because of the ominous warning in the Redemption and started to think with her head instead of her heart decided that because there were two full divisions at their disposal, an uncrackable code, and useful navigation data she decided their next course of action should be to hunt down Commander Zahra before anyone else would be killed in the mayhem she was causing because of the evil Imperial officer's desire to wreak her terrifying vengeance on the Princess of Alderaan.\nAnother plan the young commander set into motion to find the missing cells of the rebel fleet was having her staff officers like Admiral Kalaxo take their ships such as the Ultima II on patrols across the galaxy to find them. He did succeed in locating the Eleventh Division on Ab Dalis, however Starlight Squadron arrived with Padawan Skywalker. He decided to let Zahra know about it after he got back to her assault group even though his scone in command Lieutenant Bonnard didn't think it was a wise choice as it was against Imperial protocol and thought they were outnumbered. He went through with his orders. She was proven right as they lost their lives when the elite rebel pilots reignited a dormant volcano below the ship and the Alliance Fleet had gotten stronger by fifty percent and regained two of it's leaders, Chancellor Mon Mothma and Admiral Gial Ackbar. This caused Commander Zahra's assignment to be at it's climax because she destroyed all of the other divisions except for the Second Division. However she now had to deal with a combination of three entire divisions, a good portion of top rebel leadership, and inform Lord Vader about this big news since she knows that he will tell her that she's starting to let him and Emperor Palpatine see why Governor Tarkin chose her to be his student.\nSometime after Admiral Kalaxo's death, Commander Zahra was told by Lieutenant Gorr on how Warrant Officer Kronauer reported on how a stromtrooper designated as TK-510 had worn damaged armor and was in the data hub and they had no trooper with that designation on the Tarkin's Will. This caused her to piece together on how they detected unsanctioned transmissions on her ship and realize that the pilot from the A-Wing starfighter they destroyed was still alive and most likely hiding in the damaged part of the ship since internal scanners can't work there. Zahra armored up and stopped Bey from having a Lambda-class T-4a shuttle moved to maintenance so she could repair and steal it to escape back to her friends. The Commander then complemented Lieutenant Bey on her ability to survive and escape her notice for so long and injured her with her blade and said that they had a lot to talk about. Bey's failure to show up caused her husband and the father of her son, Pathfinder Sergeant Kes Dameron to take some of his friends and Starlight Squadron on an unauthorized mission to rescue his wife before it was too late.\nCommander Zahra got what intel Bey stole from the ship, how she survived, and what was stolen even though she knew that, and then demanded to be given what she didn't know such as the new Rebel communication code, where the fleet planned to strike, and who her collaborators and the survivors of the Battle of Hoth are or else she would go after her son and father. What the Commander also had know idea was that Lady Qi'ra, leader of the criminal syndicate Crimson Dawn, had agents planted in every level of the Empire and hatched a plan to allow Leia to finally kill her and locate the Second Divison before Zahra did so she can gain a partnership with the Rebel Alliance as part of a plan the young Corellian woman had hatched years ago to destroy the Sith and the Empire by killing Emperor Palpatine and Lord Vader so the galaxy would be an equal playing field for those who wanted to have power. Then Starlight Squadron and the Pathfinders showed up which caused the Tarkin's Will to launch it's fighters and engage the enemy. Commander Zahra realized the battle was off and the adversaries were trying to extend the battle instead of finish it causing her to figure out it was an attempt to rescue Lieutenant Bey so she gave orders to triple the guards on the detention level and have her armor brought up to hunt down the infiltrators herself. But just as Lieutenant Gorr was about to go through with his commanding officer's orders, an officer got a report from the Imperial Security Bureau on how they located the final division of the Rebel Fleet on Panisia since Qi'ra sent her agent Deathstick to cause a distraction so she could go after a little girl named Cadeliah who was the heir to the criminal syndicates known as the Mourner's Wail Syndicate and the Unbroken Clan as well as set the trap she promised to create for Leia. Zahra changed her plans and ordered her ship to jump into hyperspace and travel to Panisia but ordered the tie fighters to be left behind so they can prevent Starlight Squadron from escaping again and since there was no time for a recall. She claims they will be fine cause they'll be picked up after the last division of the Rebel Fleet is destroyed. Plus she hasn't forgotten on how Governor Tarkin taught her that the Empire does not tolerate the weak and claimed if they're defeated by the small starfighter squadron then her fleet is better off without them. However as it turns out Sergeant Dameron and his team were left behind when the Tarkin's Will made the jump to hyperspace and they just needed to find a new way to evacuate from the battle damaged Star Destroyer because their mission didn't change. Commander Zahra then gave her orders on how she wanted the Second Divison to burn and received a warning on how the rest of the Rebel Fleet was coming out of hyperspace. The Commander then realized this was a once in a lifetime opportunity to kill two birds with one stone by completing her mission and finally avenging Governor Tarkin's death at the hands of Commander Skywalker by getting her long awaited revenge on General Organa.\nFinal Rebel Battle\nDuring the Battle of Panisia, Zahra gave a speech of inspiration to her crew about how they were gonna destroy the Rebel Alliance by themselves to avenge everyone they lost on the Death Star without the rest of their fleet and gave everyone their assignments. Her first order was to dive to get the rebels to chase them and so she could blast the pursing ships with the Tarkin's Will's ion cannons to make the rebels either fire on their own ships or let the Second Division be destroyed. Then she ordered her crew to bring the engines to fill power to incinerate the ships on the surface that didn't have a Han e to evacuate from the base. Once they got back into space, Zahra wanted to destroy the rebels' flagship Home One and kill most of their leaders before jumping to lightspeed and heading to the nearest Imperial garrison to get their ship refitted. However unbeknownst to Zahra, Sergeant Dameron's team succeeded in rescuing Lieutenant Bey and by using her knowledge of the Tarkin's Will, she instructed her husband's men to plant explosives on the primary reactor to take down the ship's power. They did just that and sacrificed themselves in the process upon realizing there was no time to escape. When Lieutenant Gorr and her crew told her what happened to their power and shields, Commander Zahra realized too late that there were infiltrators aboard her Star Destroyer and the rebel fleet launched their firepower on the Tarkin's Will. After Lieutenant Gorr told Commander Zahra the crew was attempting to repair the hyperdrive and they called for reinforcements, she ordered for everyone aboard to abandon ship. Once she crashed landed on the surface, Commander Zahra contacted General Organa and told the Princess of Alderaan to come after her.\nAfter her parents were killed in a terrorist attack, Zahra had a jaded view on life, refusing to believe in hope and instead seeing things as they were. Zahra signed up to the Imperial Academy in order to prevent others from suffering as she had. In serving the Empire, Zahra believed that the regime stood for order and subsequently brought peace. She saw everything as a resource, considering ways of utilizing her resources in the best way possible. A vengeful and cunning Commander, Ellian Zahra was devoted to serving the Empire, despite her previous failures.\nZahra was initially unable to accept Tarkin's dismissal of her despite understanding it, attempting to make up for her failure to regain her mentor's faith. Zahra felt that the Death Star superweapon was the Emperor's greatest effort to maintain peace, and saw its destruction as a tragic massacre of loyal Imperial subjects. After losing Tarkin in the destruction of the Death Star, Zahra was angered that he had died before she could redeem herself to him, and blamed Leia Organa for the act, wishing to slit Organa's throat in revenge. She assumed Tarkin had intended her to learn from her dismissal and subsequent assignment of non-essential duties and that she would have received an opportunity to reconcile with her mentor if Tarkin had lived. Zahra became cynical during her time stationed on Kessel, not expecting anyone to call for her and being surprised when she was contacted by Vader.\nAfter being chosen to lead the hunt for the rebel fleet, Zahra honored those lost on the Death Star by taking command of a Star Destroyer that was damaged in its destruction, recruiting a crew that consisted of others who had lost someone on the station. She despised the Rebel Alliance, viewing the destruction of their fleet with enjoyment. When Zahra failed to prevent the survivors of the Fourth Division from escaping her attack, she grew angry at Lieutenant Gorr, who stated the self-evident details of the situation. A human female, Zahra had black hair, blue eyes, and light skin.\nUnder Tarkin's instruction, Zahra was a skilled tactician and Commander, developing tactics that she could use in battle. She devised a method of using probe droids as a surveillance network, utilizing the approach against Burnium Ro. Zahra also created a tactic in which an enemy fleet was trapped against a celestial body by a cordon of turbolasers. While attacking the Fourth Division of the Alliance Fleet, Zahra took control of one of her fleet's lasers, manually targeting and destroying an escaped rebel starfighter. Zahra was a skilled fighter with her blade, striking at Organa from the darkness without being seen in her confrontation aboard the rebel flagship.\nZahra commanded the Tarkin's Will, an Imperial II-class Star Destroyer formerly known as the Fortitude, which had been severely damaged in the destruction of the Death Star. She did not wish to repair the damage the Star Destroyer had sustained, keeping it as a reminder of the attack. Zahra kept an office aboard the Tarkin's Will, where she displayed numerous trophies that included weapons and mounted creature heads.\nZahra wore the uniform of the Imperial Military. She owned a set of armor that she utilized in battle, which included a helmet with goggles, a jetpack, and a rebreather mask and pack. Zahra possessed a blade, intending to use the weapon when killing Organa. She wielded the blade alongside a blaster when boarding the rebel vessel to face Organa for the first time.\nEllian Zahra was introduced in Star Wars  1, a comic written by Charles Soule, illustrated by Jesús Saiz, and published by Marvel Comics on January 1, 2020. Her forename was provided in the eighth issue of the series, also written by Soule and published on November 4, 2020.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Cleanup",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Template:Update",
  "/wiki/Star_Wars:_Operation_Starlight",
  "/wiki/Star_Wars_(2020)_15",
  "/wiki/Star_Wars_(2020)_21",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Star_Wars_(2020)_23",
  "/wiki/Star_Wars_(2020)_24",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Hunter_Fleet",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Military_rank",
  "/wiki/Commander",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Star_Destroyer",
  "/wiki/Tarkin%27s_Will",
  "/wiki/Governor",
  "/wiki/Death",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Battle_of_Hoth",
  "/wiki/Division",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Fourth_Division",
  "/wiki/Battle_at_Rendezvous_Point_Delta-Three",
  "/wiki/Freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Battle_at_Elessia",
  "/wiki/Seventh_Division",
  "/wiki/Elessia",
  "/wiki/Reproduction",
  "/wiki/Parent",
  "/wiki/Terrorist",
  "/wiki/Time",
  "/wiki/Imperial_Academy",
  "/wiki/Imperial_Era",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Beldin",
  "/wiki/Hannevik",
  "/wiki/Homeworld",
  "/wiki/Eriadu",
  "/wiki/Hunting",
  "/wiki/Albinism",
  "/wiki/Eriadu_veermok",
  "/wiki/Carrion_Plateau",
  "/wiki/Veermok",
  "/wiki/Forest",
  "/wiki/Species",
  "/wiki/Standard_year",
  "/wiki/Lieutenant_Commander",
  "/wiki/Imperial_Navy",
  "/wiki/0_BBY",
  "/wiki/Assassination_attempt_on_Burnium_Ro",
  "/wiki/Warlord",
  "/wiki/Burnium_Ro",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Ikkrukk",
  "/wiki/Nihil",
  "/wiki/Flagship",
  "/wiki/Carrion_Spike",
  "/wiki/Probe_droid",
  "/wiki/Cloaking_device",
  "/wiki/Burnium_Ro%27s_stronghold",
  "/wiki/Death_Star",
  "/wiki/Shuttle",
  "/wiki/Hangar",
  "/wiki/Stormtrooper",
  "/wiki/Imperial_officer",
  "/wiki/Trooper",
  "/wiki/Space_station",
  "/wiki/Mining_Facility_81-B",
  "/wiki/Spice",
  "/wiki/Mining",
  "/wiki/Kessel",
  "/wiki/3_ABY",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Fleet",
  "/wiki/Sith_apprentice",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Lieutenant",
  "/wiki/Gorr",
  "/wiki/Eighth_Division",
  "/wiki/Hunter_Fleet%27s_secondary_strike_force",
  "/wiki/Battle_near_Malastare",
  "/wiki/Malastare",
  "/wiki/Rendezvous_Point_Delta-Three",
  "/wiki/Blockade",
  "/wiki/Turbolaser",
  "/wiki/Unidentified_Mid_Rim_star",
  "/wiki/X-wing_starfighter",
  "/wiki/Technician",
  "/wiki/Starfighter",
  "/wiki/Arquitens-class_command_cruiser",
  "/wiki/Hyperspace",
  "/wiki/Rebel_pilot",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Skywalker_family",
  "/wiki/Sith",
  "/wiki/Sixth_Division",
  "/wiki/Destruction_of_the_Sixth_Division",
  "/wiki/Star_system",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Jedi_outpost_(Tempes)",
  "/wiki/Tempes",
  "/wiki/Pilot",
  "/wiki/EF76_Nebulon-B_escort_frigate",
  "/wiki/Engine",
  "/wiki/Frigate",
  "/wiki/Blaster",
  "/wiki/Viewport",
  "/wiki/Jetpack",
  "/wiki/Viper_probe_droid",
  "/wiki/Grek_(commodore)",
  "/wiki/Operation_Starlight",
  "/wiki/Starlight_Squadron",
  "/wiki/Trawak",
  "/wiki/Felucia",
  "/wiki/Ambush_near_Felucia",
  "/wiki/Starlight_Leader",
  "/wiki/Shara_Bey",
  "/wiki/Astromech_droid",
  "/wiki/A-wing_starfighter",
  "/wiki/Tractor_beam",
  "/wiki/Rogue_Squadron",
  "/wiki/Freyta_Smyth",
  "/wiki/Wedge_Antilles",
  "/wiki/Shara_Bey%27s_A-wing",
  "/wiki/Redemption",
  "/wiki/Alderaan",
  "/wiki/Admiral",
  "/wiki/Kalaxo",
  "/wiki/Ultima_II",
  "/wiki/Galaxy",
  "/wiki/Battle_on_Ab_Dalis",
  "/wiki/Eleventh_Division",
  "/wiki/Ab_Dalis",
  "/wiki/Padawan",
  "/wiki/Bonnard",
  "/wiki/Chancellor_(Rebel_Alliance)",
  "/wiki/Mon_Mothma",
  "/wiki/Gial_Ackbar",
  "/wiki/Second_Division",
  "/wiki/Warrant_Officer",
  "/wiki/Kronauer",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Poe_Dameron",
  "/wiki/Pathfinder",
  "/wiki/Sergeant",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey%27s_father",
  "/wiki/Lady",
  "/wiki/Qi%27ra",
  "/wiki/Crimson_Dawn",
  "/wiki/Corellian",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Panisia",
  "/wiki/Deathstick",
  "/wiki/Cadeliah",
  "/wiki/Mourner%27s_Wail_Syndicate",
  "/wiki/Unbroken_Clan",
  "/wiki/Battle_of_Panisia",
  "/wiki/Ion_cannon",
  "/wiki/Home_One",
  "/wiki/Hyperdrive",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Imperial_Military",
  "/wiki/Armor",
  "/wiki/Helmet",
  "/wiki/Goggles",
  "/wiki/Rebreather",
  "/wiki/Rebreather_pack",
  "/wiki/Star_Wars_(2020)_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Charles_Soule",
  "/wiki/Jes%C3%BAs_Saiz",
  "/wiki/Marvel_Comics",
  "/wiki/January_1",
  "/wiki/2020",
  "/wiki/Star_Wars_(2020)_8",
  "/wiki/Star_Wars_(Marvel_Comics_2020)",
  "/wiki/November_4",
  "/wiki/Category:Images_of_Ellian_Zahra",
  "/wiki/Star_Wars_(2020)_3",
  "/wiki/Star_Wars_(2020)_6",
  "/wiki/Star_Wars_(2020)_7",
  "/wiki/Star_Wars_(2020)_9",
  "/wiki/Star_Wars_(2020)_10",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/Star_Wars_(2020)_12",
  "/wiki/Star_Wars_(2020)_14",
  "/wiki/Star_Wars_(2020)_18",
  "/wiki/Star_Wars_(2020)_19",
  "/wiki/Crimson_Reign_5",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider_212",
  "/wiki/Standard_week",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)"
 ]
}