{
 "name": "Ello_Asty",
 "display_name": "Ello Asty",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Abednedo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Starkiller Base"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Abednedo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.88 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Precision air team",
      "Precision air team",
      "Resistance",
      "Cobalt Squadron",
      "Blue Squadron",
      "Red Squadron",
      "Cobalt Squadron",
      "Blue Squadron",
      "Red Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Ello Asty was a talented but reckless and singular male Abednedo T-70 X-wing starfighter ace pilot who worked for the New Republic's precision air team. When Senator Leia Organa founded the Resistance years after the Battle of Endor, the pilot was recruited into it as he felt it was important work. Asty, who came from the planet Abednedo, went on to fly with Red Squadron in 34 ABY during the Battle of Takodana and the Battle of Starkiller Base, but was shot down trying to destroy the superweapon, although the battle was ultimately a victory for the Resistance. During his final battle, he flew under the callsign Red Six.\nEllo Asty was an extremely skilled, though occasionally reckless, Abednedo T-70 X-wing starfighter pilot approximately twenty four years following the Battle of Endor. The male pilot was known for his superb abilities in the cockpit—and for his trouble remembering that a squadron relies on teamwork. He came from the planet Abednedo.\nDuring that time, Ello Asty was a member of the New Republic Defense Fleet's precision air team alongside pilots Joph Seastriker, Zari Bangel, Ledaney and \"Snap\" Wexley, which flew mostly patrol missions and air shows. Stationed in the New Republic Senate complex's main hangar on the capital planet Hosnian Prime, Asty and the others grew bored with the assignment. When it became clear that Seastriker was involved in a greater cause, Asty and the other pilots expressed a desire to become part of it as well.\nMonths later, when Senator Leia Organa organized the burgeoning Resistance movement after foreseeing the secession of many Centrists systems, Asty became one of the founding members, when he and other precision air team pilots were in attendance at the movement's first meeting in Organa's newly-leased hangar on Hosnian Prime.\nAsty flew with the Resistance's Cobalt Squadron during the Cold War. During that time, he managed to log the highest ratio of combat hours to total flight time. The pilot succeeded in recruiting Nimi Chireen from Jaymir into the cause. At one point, Asty was keeping in contact with all of Poe Dameron's spies while the latter was on a mission, when he was contacted by Kazuda Xiono from the Colossus supertanker fuel depot. Xiono had been sent to spy by Commander Dameron. Xiono called to report in and was received by Asty. Xiono then reported that he had found two children that witnessed Kylo Ren and the First Order's destruction of a village on the planet Tehar. When the spy mentioned the massacre was led by Kylo Ren, Asty mentioned that the head of the Resistance General Organa would want to hear about it, and then went on to congratulate Xiono for the intelligence, and the spy signed off.\nFollowing his time with Cobalt Squadron, Asty transferred to Blue Squadron and participated at the Battle of Takodana alongside 10 other X-wings. Asty later joined Red Squadron.\nThe Resistance's fight came to a head thirty years after the Battle of Endor when the First Order revealed their new Starkiller Base superweapon by destroying the Republic capital in the Hosnian system in 34 ABY. Asty's astromech droid was XA-LX.\nAfter the destruction, Asty joined in the briefing about Starkiller Base with the other pilots and General Leia Organa's handpicked staff at their D'Qar headquarters. During the battle against the superweapon before it could fire at the Resistance base, Asty flew under the callsign Red Six. At one point, he saved Blue Nine from a pair of seekers by redirecting the missiles. Asty then joined in the final run against the superweapon's thermal oscillator led by Black Leader Poe Dameron and escorted the lead craft through the trench, firing at weapons emplacements and base defense walkers. Asty's craft was subsequently shot down during the run by ground fire, causing it to explode, killing the talented pilot instantly. Although he was killed, the Resistance succeeded in destroying Starkiller Base.\nDuring a ceremony held at the Resistance base on D'Qar for Han Solo after his death on Starkiller Base, Organa read out the names of the pilots who'd never returned from Starkiller Base. The evacuation of the Resistance headquarters proceeded at the same time.\nThe astromech droid BB-8 recounted the Starkiller base assault later to R2-D2 while aboard the Millennium Falcon, and mentioned the loss of Asty and XA-LX along with other Red and Blue Squadron pilots.\nHis fellow Abednedo pilot Threnalli continued to fight for the Resistance after Asty's death, as did his recruit Nimi Chireen.\nAs a pilot, Asty was skilled at the controls, but acted recklessly and without the support of his teammates, since he preferred to fly by himself, and was also an ace. When his fellow precision air team pilots commented on how Seastriker appeared to be doing important work, Asty added that whatever it was, it was more important than the team flying air shows. During his time with the Resistance, he assisted his wingman in understanding fellow Abednedo pilot C'ai Threnalli, who repeatedly misplaced his translator fob. Asty also gave a nickname to his astromech, Exalex.\nThe starfighter pilot zealously attacked First Order patrols during the leadup to the First Order conflict, earning a reputation as someone who \"shoots first and questions second.\" At the time of his death, he had the highest ratio of combat encounters to total flying time among the Resistance as a result of this aggression, and was seen as a loose cannon.\nDespite Asty's preference for flying solo, during the attack on Starkiller Base, he responded promptly to Black Leader Dameron's orders to form up alongside Red Four, Bastian. Following their initial bombing run on the oscillator, Asty commented that their barrage had produced no effect.\nHe stood 1.88 meters tall, and spoke with a low and sonorous voice. As an Abednedo, he was a member of a gregarious and creative species, and had brown fur lining the sides of his face.\nAsty wore the standard Resistance pilot flightsuit, with flight vest, Guidenhauser ejection harness, boots, and FreiTek life support unit, and gauntlets. The letters on the Resistance's flight harness read \"pull to inflate.\" His specially-modified helmet sported the Resistance symbol, yellow-and-black checkerboard pattern, and Abednedish lettering. The checkerboard pattern was part of the Resistance's practices of honoring the heroes of the Rebel Alliance. The phrase \"Born to ill\" was written on the side in Aurebesh alongside an older Cobalt Squadron insignia. He also carried a Glie-44 blaster pistol.\nEllo Asty appears in the 2015 Star Wars saga film Star Wars: Episode VII The Force Awakens. The character was performed physically by Paul Kasey and voiced by veteran Star Wars voice actor and technician Matthew Wood. For his portrayal, Kasey, also a member of the motion capture section, wore an animatronic mask and costume. The masks used in the film helped, in Neal Scanlan's words, to help the performers \"...tell a thousand words.\" The pilot was created based off concept art entitled \"Bullhead Pilot.\" The actor can also be seen in costume during the Resistance briefing scene during a behind the scenes look at the making of documentary Secrets of The Force Awakens: A Cinematic Journey.\nAsty is one of the pilots to appear in the \"X-wings Prepare for Lightspeed\" deleted scene, which features the Resistance pilots taking off for the Starkiller Base battle.\nAlthough an Abednedo identical to Asty appears in the episode \"The Recruit\" in the 2018 animated series Star Wars Resistance, it was not confirmed to be him. Asty however later appeared briefly in the episode \"The Children from Tehar\" voiced once more by Matthew Wood who had voiced the character for the film. His design for the series was developed by Lucasfilm Animation artist Jim Moore.\nAsty also features in the 2016 video game LEGO Star Wars: The Force Awakens. He is present at the Resistance base during an incident that started \"a small fire\" and led to the closing of the blast doors. Unlike his canon appearance, he survives the battle of Starkiller Base and has additional lines, including informing the player of damage. His figure can be bought at the D'Qar base.\nThe character was first revealed in his StarWars.com Databank entry, released in advance of the film. The action figure for the character was also released beforehand. His name is a reference to the album Hello Nasty by the hip hop group Beastie Boys, and the inscription on Asty's helmet, \"Born to Ill,\" references their debut album Licensed to Ill. The decals on his helmet were designed by costume designer and concept artist Glyn Dillon. Knowing that director J.J. Abrams liked to use Beastie Boys songs in his films, he added the Aurebesh inscriptions \"Hello Nasty\" on one side and \"Born to Ill\" on the other side. During the breakdown process where the helmet was made to look old, the H and N in \"Hello Nasty\" were rubbed off, resulting in the character being named Ello Asty.\nThe film's director J.J. Abrams said the name was a suggestion from the creature department, which he approved for both the Beastie Boys reference, having previously featured their song \"Sabotage\" in Star Trek and \"Body Movin'\" in Star Trek Into Darkness, and the fact it served as a phonetic reference to his television show Lost.\nAsty's costume was re-used for another Abednedo pilot, who was seen at the Resistance base during the celebration scene after the Battle of Starkiller Base. The pilot was later identified as C'ai Threnalli in the \"Escape from Starkiller Base\" DLC expansion for LEGO Star Wars: The Force Awakens video game.\nIn initial sources such as the character's Databank entry, it says the pilot is part of Blue Squadron, but in the film Star Wars: Episode VII The Force Awakens his call sign is Red Six. Later sources including Poe Dameron: Flight Log clarify that he is part of Red Squadron. The incongruity with Blue Squadron was also repeated in Star Wars Helmet Collection 31.\nStar Wars: On the Front Lines, a 2017 canon reference book by Daniel Wallace, expands his backstory in a Tales of Valor profile. It introduces a minor continuity error when it says that Asty was shot down by a missile and not turbolaser fire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Resistance_pilot",
  "/wiki/Protocol_droid",
  "/wiki/T-2L0",
  "/wiki/Abednedo_(planet)",
  "/wiki/34_ABY",
  "/wiki/Starkiller_Base",
  "/wiki/Abednedo",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/New_Republic",
  "/wiki/Precision_air_team",
  "/wiki/Resistance",
  "/wiki/Cobalt_Squadron",
  "/wiki/Blue_Squadron_(Resistance)",
  "/wiki/Red_Squadron_(Resistance)",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Ace",
  "/wiki/Pilot",
  "/wiki/Senator",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Planet",
  "/wiki/Battle_of_Takodana",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Superweapon",
  "/wiki/Callsign",
  "/wiki/Red_Six",
  "/wiki/Cockpit",
  "/wiki/Squadron",
  "/wiki/Time",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/New_Republic_pilot",
  "/wiki/Joph_Seastriker",
  "/wiki/Zari_Bangel",
  "/wiki/Ledaney",
  "/wiki/Temmin_Wexley",
  "/wiki/Air_show",
  "/wiki/New_Republic_Senate",
  "/wiki/New_Republic_senatorial_complex",
  "/wiki/Senate_hangar",
  "/wiki/Capital",
  "/wiki/Hosnian_Prime",
  "/wiki/Amaxine_warrior_crisis",
  "/wiki/Standard_month",
  "/wiki/Centrists",
  "/wiki/Star_system",
  "/wiki/Hangar",
  "/wiki/Cold_War",
  "/wiki/Standard_hour",
  "/wiki/Nimi_Chireen",
  "/wiki/Jaymir",
  "/wiki/Poe_Dameron",
  "/wiki/Spy",
  "/wiki/Kazuda_Xiono",
  "/wiki/Colossus",
  "/wiki/Supertanker_fuel_depot",
  "/wiki/Mission_on_the_Colossus_platform",
  "/wiki/Ben_Solo",
  "/wiki/First_Order",
  "/wiki/Massacre_on_Tehar",
  "/wiki/Tehar",
  "/wiki/Endor",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Hosnian_system",
  "/wiki/XA-LX",
  "/wiki/General",
  "/wiki/D%27Qar",
  "/wiki/Resistance_base",
  "/wiki/Blue_Nine_(Resistance)",
  "/wiki/Seeker_(missile)",
  "/wiki/Missile",
  "/wiki/Thermal_oscillator",
  "/wiki/Black_Leader",
  "/wiki/All_Terrain_Mobile_Artillery",
  "/wiki/Death",
  "/wiki/Funeral_of_Han_Solo",
  "/wiki/Han_Solo",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/BB-8",
  "/wiki/R2-D2",
  "/wiki/Millennium_Falcon",
  "/wiki/C%27ai_Threnalli",
  "/wiki/Starfighter",
  "/wiki/Red_Four",
  "/wiki/Bastian",
  "/wiki/Species",
  "/wiki/Hair",
  "/wiki/Flight_suit",
  "/wiki/Guidenhauser",
  "/wiki/Boot",
  "/wiki/FreiTek_Incorporated",
  "/wiki/Life_support",
  "/wiki/Gauntlet",
  "/wiki/Flight_harness",
  "/wiki/Flight_helmet",
  "/wiki/Rebel_Alliance_starbird",
  "/wiki/Abednedish",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Aurebesh",
  "/wiki/Glie-44_blaster_pistol",
  "/wiki/2015",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Paul_Kasey",
  "/wiki/Matthew_Wood",
  "/wiki/Neal_Scanlan",
  "/wiki/X-wing_starfighter",
  "/wiki/Lightspeed",
  "/wiki/The_Recruit",
  "/wiki/2018",
  "/wiki/Star_Wars_Resistance",
  "/wiki/The_Children_from_Tehar",
  "/wiki/Lucasfilm_Animation",
  "/wiki/Jim_Moore",
  "/wiki/2016",
  "/wiki/Video_game",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/Fire",
  "/wiki/Blast_door",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Glyn_Dillon",
  "/wiki/J.J._Abrams",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/2017",
  "/wiki/Daniel_Wallace",
  "/wiki/Turbolaser",
  "/wiki/Category:Images_of_Ello_Asty",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/The_Chewbacca_Story",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens:_Rey%27s_Story",
  "/wiki/The_Force_Awakens:_Rey%27s_Story_(audiobook)",
  "/wiki/The_Force_Awakens:_Finn%27s_Story",
  "/wiki/The_Force_Awakens_(storybook)",
  "/wiki/The_Force_Awakens_Read-Along_Storybook_and_CD",
  "/wiki/Join_the_Resistance:_Attack_on_Starkiller_Base",
  "/wiki/Join_the_Resistance:_Books_1-3",
  "/wiki/The_Fight_in_the_Forest",
  "/wiki/The_Force_Awakens_Adaptation_6",
  "/wiki/Captain_Phasma_1",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Poe_Dameron_28",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens_(DK_Readers)",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens_(Scholastic)",
  "/wiki/William_Shakespeare%27s_The_Force_Doth_Awaken:_Star_Wars_Part_the_Seventh",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Force_Awakens_(toy_line)",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/T-70_X-wing_Expansion_Pack",
  "/wiki/The_Art_of_Star_Wars:_The_Force_Awakens",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Ultimate_Sticker_Collection:_Star_Wars:_The_Force_Awakens",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Insider",
  "/wiki/50_Things_to_Notice_in_Star_Wars:_The_Force_Awakens",
  "/wiki/Star_Wars_Insider_165",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2016_Topps_Star_Wars:_The_Force_Awakens_Chrome",
  "/wiki/2015_Topps_Star_Wars_High_Tek",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/The_Force_Awakens:_Movie_Theater_Storybook_%26_BB-8_Projector",
  "/wiki/Star_Wars:_Aliens_and_Ships_of_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Rebel_Heroes",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Master_Models:_Scenes",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/The_Last_Jedi:_Rose_Tico:_Resistance_Fighter",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Aliens,_Creatures_%26_Beasts",
  "/wiki/Star_Wars_Build_Your_Own:_X-Wing_Book_and_Model",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Resistance_Conversion_Kit",
  "/wiki/T-70_X-Wing_Expansion_Pack",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Insider_Special_Edition_2020",
  "/wiki/Path_of_Resistance",
  "/wiki/Star_Wars_Annual_2020",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_34",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Book_of_Lists",
  "/wiki/A_Galaxy_for_Everyone",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/September_29",
  "/wiki/December_10",
  "/wiki/Pablo_Hidalgo",
  "/wiki/February_28",
  "/wiki/File:Other_costume_tweet.png",
  "/wiki/Leland_Chee",
  "/wiki/April_25",
  "/wiki/File:Cai_Threnalli_tweet.png"
 ]
}