{
 "name": "Elmyo",
 "display_name": "Elmyo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "over Atzerri"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Atzerri Air Traffic Control"
     ]
    }
   ]
  }
 ],
 "content": "Elmyo was a Human male who worked as a new recruit for the planet Atzerri's Air Traffic Control in the waning years of the Galactic Republic. In 22 BBY, he and his Gotal associate intercepted the Mandalorian bounty hunter Jango Fett's ship after he entered Atzerri's atmosphere. Elmyo suggested that Fett begin negotiations for the landing fee, and the Gotal traffic controller immediately apologized for the man's patronization of Fett. Rather than accepting the Gotal's apology, the Mandalorian launched two rockets at the traffic control ship, killing Elmyo and the Gotal.\nElmyo, a Human male, lived during the final decades of the Galactic Republic. By the year 22 BBY, he had joined the Air Traffic Control forces of the planet Atzerri and was being trained by a Gotal traffic controller.\nDuring that same year, Elmyo and his Gotal trainer were out on patrol, and they intercepted the starship Slave I, which belonged to the Mandalorian bounty hunter Jango Fett, after it entered the atmosphere of Atzerri. After the Gotal spoke with Fett over the patrol ship's comlink, Elmyo suggested that the landing fee negotiations begin, but he was interrupted when Fett revealed his identity. Elmyo, who was unaware of Fett's reputation as a bounty hunter, patronized the Mandalorian, and the Gotal took the comlink from Elmyo and apologized to Fett for Elmyo's cynical behavior. The Gotal asked Fett to provide proof of his identity; however, the bounty hunter instead launched two rockets at the traffic control ship, killing Elmyo and the Gotal.\nThe Human male Elmyo was oblivious to Jango Fett's reputation as a bounty hunter and acted in a cynical manner toward the Mandalorian.\nElmyo was created by Tom Taylor for the first issue of the comic miniseries Star Wars: Blood Ties. In the issue, he was drawn by Chris Scalf.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/22_BBY/Legends",
  "/wiki/Atzerri/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Atzerri_Air_Traffic_Control",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Unidentified_Gotal_traffic_controller",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Slave_I/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Missile/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Death/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Time/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Tom_Taylor",
  "/wiki/Blood_Ties:_A_Tale_of_Jango_and_Boba_Fett_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Blood_Ties",
  "/wiki/Chris_Scalf"
 ]
}