{
 "name": "Elrik Vonreg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Castilon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "Elrik Vonreg's squadron",
      "First Order Special Forces",
      "Elrik Vonreg's squadron",
      "First Order Special Forces"
     ]
    }
   ]
  }
 ],
 "content": "Baron Elrik Vonreg was a human male First Order TIE Fighter Pilot. During the era of the New Republic, Vonreg held the military rank of major in the armed forces of the First Order. A skilled starfighter pilot, he fought a New Republic squadron of T-85 X-wing starfighters led by Kazuda Xiono as well as a Resistance T-70 X-wing starfighter piloted by Commander Poe Dameron.\nDespite his efforts, however, Major Vonreg was forced to break off his attack and return to Starkiller Base where he reported to Captain Phasma. As a result, the New Republic managed to transfer intelligence to the Resistance, and as such discovered that the First Order was operating in secret on the Outer Rim planet of Castilon. The Resistance dispatched a spy, the newly recruited Kazuda Xiono, to investigate. Vonreg was killed by Xiono during the Battle of Castilon when he was shot down.\nSharing his last name with Galactic Empire pilot Havina Vonreg and the Vonreg family, an aristocratic family, Major Baron Elrik Vonreg became a ranking officer and TIE fighter pilot in the armed forces of the First Order, where he served under Captain Phasma. Utilizing his own personal TIE/ba Baron Space Superiority Interceptor, Vonreg engaged a squadron of New Republic T-85 X-wing starfighters at one point in the waning months of the Cold War. The New Republic pilots had acquired critical information pertaining to the First Order's operations in the galaxy's Outer Rim Territories, and had been instructed by New Republic Command to deliver the intelligence to the Resistance. Vonreg, attempting to thwart their mission, drove off two of the pilots, Mia Gabon and Hugh Sion, although Kazuda Xiono remained behind to await the Resistance's arrival at the rendezvous point.\nWith the arrival of Resistance Commander Poe Dameron, Vonreg was forced to break off his attack on Xiono and engage the Resistance pilot in a dogfight. However, he was ultimately outmaneuvered by the teamwork of Dameron and Xiono, resulting in damage to his starfighter. As a result, the major retreated into hyperspace, eventually returning to Starkiller Base in the Unknown Regions. In failing to prevent Xiono from completing his mission, the Resistance learned of the First Order's interest in the Colossus, an aircraft refueling station located on the ocean planet Castilon. The Resistance, therefore, recruited Xiono to serve as their spy on the Colossus, hoping to gather more intelligence on the First Order.\nVonreg and Commander Pyre presented the idea that pirates be hired to attack the Colossus, in order to force Captain Imanuel Doza, the platform's owner, to invite the First Order in as security. However, after an attack by Kragan Gorr and his gang failed, Vonreg, along with Captain Phasma, expressed his disappointment in the outcome when the pirates reported in afterwards.\nSometime after the attack, Vonreg visited the Colossus on a freighter delivering a much-needed shipment of fuel to the platform, in order to speak with Captain Doza. Vonreg insisted to Doza that the Colossus was vulnerable to pirate attack, and made several veiled threats to him. Doza did not take the First Order's offer, noting that they would have to do better than one shipment of fuel to buy him. Shortly after leaving Doza's office, Vonreg became aware that someone had been spying on the meeting using a pair of matched comlinks, as when the two comlinks were brought too close together and both active they produced feedback. Vonreg hear this and spotted the spy, Xiono, but unknown to Vonreg this was the same pilot who he had fought against in space. Vonreg ordered his stormtroopers to capture Xiono, who fled. After Xiono managed to evade the troopers, Vonreg confronted Doza, who was incredulous about the thought of there being a spy on his platform. After Doza's daughter Torra claimed the intruder had merely been a friend of hers, who had gotten lost on his way out of Doza Tower, Doza ordered Vonreg to leave with his troopers.\nSometime later, Marnia Un'la'na, an informant of the First Order, was on the Colossus prior to the All Aces Battle Royale. She was contacted by an Ugnaught associate who stated that they had an urgent message, and met with them in a hangar. After conversing on Un'la'na transmitting the data, she told the Ugnaught that it would be a covered transmission and that they could tell Vonreg that he'd get his information.\nAfter an intruder alert at the abandoned First Order dedlanite mine Station Theta Black, Major Vonreg accompanied a First Order demolition team led by Captain Phasma. The First Order's demolition mission was complicated by the presence of two Resistance pilots Commander Dameron and Xiono, who were investigating First Order activities in the Unknown Regions.\nPoe's BB-series astromech droid CB-23 managed to hide Poe and Kazuda's T-70 X-wing starfighters within the asteroid field. Captain Phasma and her troops subsequently encountered the Resistance pilots but failed to capture or eliminate them. CB-23 managed to remotely pilot the two Resistance pilots' X-wings to the station, helping them to escape into space.\nFlying his TIE Interceptor, Major Vonreg led his TIE squadron in pursuit of the Resistance pilots. Poe managed to shoot one of Vonreg's wingmates but was unable to shake off the pursuing First Order fighters. Before Major Vonreg could eliminate Poe and Xiono, Captain Phasma ordered Vonreg to break off the pursuit. Vonreg protested that he almost had his opponents but complied with Phasma's orders after she warned that he would die when she blew up the station.\nVonreg and his surviving pilots accompanied Phasma's shuttle out of the system. Though the destruction of Station Theta Black generated a massive explosive wave, Poe and Xiono survived the explosion and were able to warn General Leia Organa that the First Order was building many weapons.\nAfter Commander Pyre hired the Warbirds gang to kidnap Torra, Major Vonreg was dispatched to meet with the pirates under the pretext of parleying with them. However, he and his stormtroopers instead opened fire on the pirates Drell and Skreek. Vonreg then rescued Torra and returned her to her father. He convinced a relieved Captain Doza to accept First Order protection, which led to a military occupation of the Colossus.\nAfter a spider probe droid alerted the First Order to the presence of intruders in the Dassal system, Major Vonreg and his squadron pursued the Resistance pilots Poe and Xiono through the cored-out planet Najra-Va's core. The Resistance pilots managed to escape by flying through a gravity well, which claimed the lives of two of Vonreg's fellow pilots. Though Poe and Xiono managed to escape, Vonreg managed to obtain footage of Xiono's starfighter Fireball, which led the First Order to discover Xiono's identity.\nAfter Xiono and his Resistance group submerged the Colossus to contact the Resistance, Major Vonreg flew his TIE Interceptor over the station.\nAfter Kaz's Resistance retook control of the Colossus, Pyre and First Order Security Bureau Agent Tierny fled with Tamara Ryvora, who had decided to join the First Order due to her bitterness towards Kaz and Jarek Yeager for keeping secrets. Following the launch of the Colossus's engines, Vonreg participated in the Battle of Castilon. However, multiple TIEs were destroyed, and, as he was about to shoot down Yeager, a surprise maneuver from Xiono led to Vonreg being killed in action.\nSome time after Vonreg's death on Castilon, Xiono's friend Sion, who had also joined the Resistance, asked Xiono about their last encounter with Major Vonreg during a mission to rendezvous with the Resistance. Xiono claimed that he had taken care of the First Order ace, but fellow Resistance pilot Norath Kev responded that Commander Dameron had a different account. The trio then turned their conversation to the topic of evacuating Resistance recruits from First Order-occupied Dantooine.\nElrik Vonreg was a human male. As a military pilot, he was willing to engage multiple adversaries on his own. While Vonreg was willing to eliminate opponents like Poe Dameron and Kazuda Xiono, he still complied with his superior officer Captain Phasma's orders to break off the pursuit since she had activated the explosives to destroy Station Theta Black.\nServing with the First Order Navy, Major Vonreg was a skilled pilot whose abilities were acknowledged by Mia Gabon and Poe Dameron. The major could engage multiple opponents, such as a squadron of starfighters, without the support of wingmates. He was also capable of engaging Dameron in a dogfight for a time.\nHe proved himself to be a capable shot with a blaster in a melee with pirates whom the First Order had double-crossed. Vonreg additionally possessed some political ability being able to negotiate with Captain Doza of the Colossus, allowing a First Order security force to be stationed on the Colossus at Commander Pyre's recommendation.\nDespite his skills as a starfighter pilot, Major Vonreg was bested by Xiono, who managed to shoot down his fighter, claiming his life.\nMajor Vonreg wore a modified crimson version of the uniform and equipment utilized by First Order TIE fighter pilots. He also wielded a custom RK-3 blaster pistol.\nElrik Vonreg was created and developed for Star Wars Resistance. He is voiced by Lex Lang. His unique armor was designed so that he could stand out from other First Order pilots, as an indication of his superior rank and skills. His helmet mix inspiration from First Order TIE Fighters pilots, clone trooper pilots and Imperial Guards helmets. His character was developed with the famous World War I German ace Red Baron in mind, from which he inherited the red color and the title of baron.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Elrik_Vonreg",
  "/wiki/34_ABY",
  "/wiki/Castilon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/First_Order",
  "/wiki/Elrik_Vonreg%27s_squadron",
  "/wiki/First_Order_Special_Forces",
  "/wiki/Baron",
  "/wiki/First_Order_TIE_Fighter_Pilot",
  "/wiki/New_Republic_era",
  "/wiki/New_Republic",
  "/wiki/Military_rank",
  "/wiki/Major",
  "/wiki/First_Order_military",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Mission_to_rendezvous_with_the_Resistance",
  "/wiki/Kazuda_Xiono%27s_team",
  "/wiki/T-85_X-wing_starfighter",
  "/wiki/X-wing_starfighter",
  "/wiki/Kazuda_Xiono",
  "/wiki/Resistance",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Commander",
  "/wiki/Poe_Dameron",
  "/wiki/Starkiller_Base",
  "/wiki/Captain",
  "/wiki/Phasma",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Spy",
  "/wiki/Mission_on_the_Colossus_platform",
  "/wiki/Death",
  "/wiki/Battle_of_Castilon",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Havina_Vonreg",
  "/wiki/Vonreg_family",
  "/wiki/Noble",
  "/wiki/Officer",
  "/wiki/Vonreg%27s_TIE",
  "/wiki/TIE/ba_Baron_Space_Superiority_Interceptor",
  "/wiki/T-85_X-wing",
  "/wiki/Standard_month",
  "/wiki/Cold_War",
  "/wiki/New_Republic_pilot",
  "/wiki/The_galaxy",
  "/wiki/New_Republic_High_Command",
  "/wiki/Mia_Gabon",
  "/wiki/Hugh_Sion",
  "/wiki/Resistance_pilot",
  "/wiki/Hyperspace",
  "/wiki/Unknown_Regions",
  "/wiki/Colossus",
  "/wiki/Starship",
  "/wiki/Fuel",
  "/wiki/Ocean",
  "/wiki/Pyre",
  "/wiki/Pirate",
  "/wiki/Imanuel_Doza",
  "/wiki/Raid_on_the_Colossus",
  "/wiki/Kragan_Gorr",
  "/wiki/Warbird_gang",
  "/wiki/Mission_to_Doza_Tower",
  "/wiki/Doza%27s_office",
  "/wiki/Comlink",
  "/wiki/Realspace",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Torra_Doza",
  "/wiki/Doza_Tower",
  "/wiki/Marnia_Un%27la%27na",
  "/wiki/All_Aces_Battle_Royale",
  "/wiki/Ugnaught",
  "/wiki/Hangar",
  "/wiki/Dedlanite",
  "/wiki/Station_Theta_Black",
  "/wiki/Mission_to_Station_Theta_Black",
  "/wiki/BB-series_astromech_droid",
  "/wiki/CB-23",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Kidnapping_of_Torra_Doza",
  "/wiki/Drell",
  "/wiki/Skreek",
  "/wiki/Occupation_of_the_Colossus",
  "/wiki/Spider_probe_droid",
  "/wiki/Dassal_system",
  "/wiki/Najra-Va",
  "/wiki/Gravity_well",
  "/wiki/Fireball",
  "/wiki/Team_Colossus",
  "/wiki/Mission_to_contact_the_Resistance",
  "/wiki/First_Order_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Tierny",
  "/wiki/Tamara_Ryvora",
  "/wiki/Jarek_Yeager",
  "/wiki/Norath_Kev",
  "/wiki/Blockade_of_Dantooine",
  "/wiki/Dantooine",
  "/wiki/First_Order_Navy",
  "/wiki/Squadron",
  "/wiki/Wingmate",
  "/wiki/Time",
  "/wiki/Color",
  "/wiki/Clothing",
  "/wiki/Armor",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/RK-3_blaster",
  "/wiki/Blaster_pistol",
  "/wiki/Dave_Filoni",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Lex_Lang",
  "/wiki/Clone_trooper_pilot",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/The_Recruit",
  "/wiki/The_Triple_Dark",
  "/wiki/The_High_Tower",
  "/wiki/Station_Theta_Black_(episode)",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/All_Aces_Battle_Royale_(comic)",
  "/wiki/Star_Wars_Adventures_(2017)_16",
  "/wiki/The_Doza_Dilemma",
  "/wiki/The_Core_Problem",
  "/wiki/No_Escape:_Part_1",
  "/wiki/No_Escape:_Part_2",
  "/wiki/Rebuilding_the_Resistance",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars_Resistance_(toy_line)",
  "/wiki/Star_Wars_Resistance:_Meet_the_Pilots",
  "/wiki/2019_Topps_Star_Wars_Resistance_Surprise_Packs",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_Resistance",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_61",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Major_Vonreg%27s_TIE_Expansion_Pack",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Covert_Missions",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/TIE_Fighters",
  "/wiki/The_First_Order",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/The_First_Order_Occupation",
  "/wiki/The_Disappeared",
  "/wiki/September_15",
  "/wiki/2018",
  "/wiki/December_11",
  "/wiki/2019",
  "/wiki/September_27",
  "/wiki/February_2",
  "/wiki/2020"
 ]
}