{
 "name": "Elyas Caran",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dyed jet-black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Elyas Caran was a Human male emissary serving the Galactic Alliance. In 43.5 ABY, Caran was sent to the planet Mon Calamari to escort ex-Admiral Cha Niathal to Coruscant to stand trial for dereliction of duty during the Second Galactic Civil War. However, upon his arrival, it was discovered that Niathal had committed suicide. Caran reported Niathal's death to Galactic Alliance Chief of State Natasi Daala, who instructed him to bring Niathal to Coruscant for a funeral.\nThe Human male Elyas Caran served the Galactic Federation of Free Alliances as a diplomat during the time following the Second Galactic Civil War. In 43.5 ABY, Galactic Alliance Chief of State Natasi Daala decided to have the retired Admiral Cha Niathal put on trial for dereliction of duty during the Second Galactic Civil War, to prove to the public that the Galactic Alliance government was treating military officials the same way that they had treated the Jedi Luke Skywalker, whom they had put on trial for the same reason. As such, Daala sent Caran to the planet Mon Calamari to bring Niathal to the galactic capital of Coruscant to stand trial.\nWhen Caran arrived on Mon Calamari to speak with Niathal and escort her to Coruscant, he was greeted by Niathal's assistant. The assistant went to inform Niathal of Caran's presence, only to find that the ex-Admiral was dead, having committed suicide. Caran then contacted Daala's aide—Wynn Dorvan—via a holocomm message, reporting that he had a priority message for Daala. After Dorvan brought the Chief of State to the Senate Building's comm center to view the transmission, Caran informed Daala of Niathal's suicide, reporting that the Mon Calamari had run a gas line of carbon monoxide into her water tank, killing herself painlessly. Caran revealed that she had left a suicide note, and Daala ordered that the emissary read it. He quoted the note by memory, and Daala then instructed Caran to bring Niathal's body to Coruscant for a funeral.\nElyas Caran was regretful of Niathal's suicide, and he showed sympathy to Daala when he reported Niathal's death to her. When ordered to read Niathal's suicide note, Caran was able to quote it from memory, after which he became rather reflective. Caran was slender and elegant in appearance, with refined features and hair that he dyed jet-black.\nElyas Caran first appeared briefly in Aaron Allston's Fate of the Jedi: Backlash, the fourth of nine novels in the Fate of the Jedi series, released March 9, 2010.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Hair_dye",
  "/wiki/Black",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Diplomat/Legends",
  "/wiki/43_ABY",
  "/wiki/Planet/Legends",
  "/wiki/Dac",
  "/wiki/Admiral/Legends",
  "/wiki/Cha_Niathal",
  "/wiki/Coruscant/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Suicide/Legends",
  "/wiki/Death/Legends",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Funeral_of_Cha_Niathal",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Alliance_Defense_Force",
  "/wiki/Jedi/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/The_Galactic_Federation_of_Free_Alliances_versus_Luke_Skywalker",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Cha_Niathal%27s_assistant",
  "/wiki/Wynn_Dorvan",
  "/wiki/Holocomm/Legends",
  "/wiki/Senate_Building",
  "/wiki/Senate_Communications_Center",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Carbon_monoxide",
  "/wiki/Water_tank_(habitat)",
  "/wiki/Aaron_Allston",
  "/wiki/Fate_of_the_Jedi:_Backlash",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/March_9",
  "/wiki/2010",
  "/wiki/Fate_of_the_Jedi:_Backlash_(audiobook)"
 ]
}