{
 "name": "Elzian",
 "display_name": "Elzian",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ishi Tib"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "New Republic Defense Fleet",
      "New Republic Defense Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Elzian was an Ishi Tib who served in the New Republic Defense Fleet as a colonel. Around 13 ABY, Colonel Elzian participated in a battle against the Imperial Remnant over the planet Pallaxides. During the battle, the officer was stationed aboard a New Republic MC80 Liberty type Star Cruiser, under the command of General Han Solo.\nElzian reported with confidence that the battle would result in a definite New Republic victory, and later expressed concern for General Solo's wellbeing, as the latter had stood watch over the fighting for nearly forty-eight hours without sleep. The colonel successfully persuaded Solo to rest, although circumstances soon turned to prevent the general from having his much-needed break.\nHolding the rank of colonel in the New Republic Defense Fleet, Elzian was aboard General Han Solo's MC80 Liberty type Star Cruiser during the New Republic's battle against Imperial Remnant forces over the planet Pallaxides around 13 ABY. As Solo, who had stood watch over the battle for nearly forty-eight hours, remained fixated on the contested world through a viewport on his Star Cruiser's bridge, Colonel Elzian reported to the commanding officer of their apparent victory, giving a brief assessment of the battle; Elzian was certain of their opponent's defeat, remarking that their forces were evidently and decisively trapped. Han Solo agreed, although he was unsatisfied of the Imperials' intent of fighting to their deaths, stating his aversion to creating unnecessary casualties.\nTurning to the colonel, Han Solo ordered the retreat of naval forces and the deployment of ground forces. Colonel Elzian then began to remind General Solo of his lack of rest, though Solo interrupted to acknowledge his subordinate's concern. The general thus relinquished command of the Republic's forces to Elzian and proceeded to his own living quarters for sleep. Before Solo could rest, however, he was contacted via viewscreen by a Republic officer who exclaimed that the general was needed in the ship's command center, eliminating Solo's chance for rest. Nevertheless, the battle over Pallaxides was won by the New Republic as enemy forces eventually capitulated.\nAn Ishi Tib, Elzian had green skin and a pair of yellow eyes. During the battle of Pallaxides, the colonel expressed concern for the New Republic forces' commanding officer, General Han Solo, after the Human had stood watch over the battle for nearly forty-eight hours.\nAlong with a pair of dark blue-gray footwear, Elzian wore a dark blue robe with a gold trim. The garb was visually similar to the decorated light blue outfits of bridge personnel serving aboard Han Solo's MC80 Liberty type Star Cruiser.\nElzian appears in the third issue of Empire Lost, the third mini-series of the Star Wars: Crimson Empire comic-book series. Published by Dark Horse Comics on December 28, 2011, Empire Lost 3 was written by Mike Richardson, penciled by Paul Gulacy, and colored by Michael Bartolo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ishi_Tib/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Defense_Fleet/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/13_ABY/Legends",
  "/wiki/Battle_of_Pallaxides",
  "/wiki/Imperial_Remnant",
  "/wiki/Planet/Legends",
  "/wiki/Pallaxides",
  "/wiki/Officer/Legends",
  "/wiki/Unidentified_MC80_Liberty_type_Star_Cruiser_(Pallaxides)",
  "/wiki/Commanding_officer/Legends",
  "/wiki/General/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/Viewport/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Cruiser/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Death/Legends",
  "/wiki/Viewscreen/Legends",
  "/wiki/Unidentified_New_Republic_officer_(Pallaxides)",
  "/wiki/Starship/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Human/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/MC80_Liberty_type_Star_Cruiser",
  "/wiki/Crimson_Empire_III:_Empire_Lost_3",
  "/wiki/Star_Wars:_Crimson_Empire_III%E2%80%94Empire_Lost",
  "/wiki/Star_Wars:_Crimson_Empire_(comic_series)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Dark_Horse_Comics",
  "/wiki/December_28",
  "/wiki/2011",
  "/wiki/Mike_Richardson",
  "/wiki/Paul_Gulacy",
  "/wiki/Michael_Bartolo",
  "/wiki/Category:Images_of_Elzian",
  "/wiki/Star_Wars:_Age_of_Rebellion_Core_Rulebook",
  "/wiki/Crimson_Empire_III:_Empire_Lost_4",
  "/wiki/Marvel_Comics"
 ]
}