{
 "name": "Embo",
 "display_name": "Embo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Phatrong"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kyuzo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.99 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sugi's bounty hunters",
      "Cad Bane's group",
      "Hutt Clan",
      "Krayt's Claw",
      "Jas Emari's crew"
     ]
    }
   ]
  }
 ],
 "content": "Embo was a Kyuzo male bounty hunter who lived during the era of the Clone Wars. He was renowned as one of the most skilled bounty hunters of his time. Embo carried a bowcaster and wore a large-rimmed circular hat, which he used as a weapon or a shield. Even as a capable solo hunter, he worked with several different groups throughout the Clone Wars. Embo was known to work as part of Sugi's band of bounty hunters in particular. On Felucia, Embo worked with Sugi's crew to defend a group of Felucian farmers from the Ohnaka Gang. On another occasion, he worked for the Hutt Clans, battling against the former Sith Lord Maul and his Shadow Collective. He was a member of Boba Fett's Krayt's Claw, working alongside hunters such as Bossk, C-21 Highsinger, and Latts Razzi. At one point, the group were hired by Asajj Ventress to help her break out her lover Quinlan Vos from Count Dooku's castle on Serenno. On Scipio, he managed to match the legendary Jedi Knight Anakin Skywalker in combat. He also owned a pet anooba named Marrok and a saucer-shaped starship called the Guillotine.\nDuring the Imperial Era, Embo was hired by Mercurial Swift to capture Sugi's niece, Jas Emari. He worked alongside Dengar and Jeeta to accomplish this, but later joined Emari's crew. After the battle of Jakku, Embo received funding from the New Republic, but when it ran out, he lived as a farmer on Felucia.\nEmbo was born on the planet Phatrong. During the Clone Wars, Embo was working as a bounty hunter. Embo was often a part of Sugi's band of Sugi's bounty hunters, alongside Rumi Paramita and Seripas. Embo and Sugi came to be relatively close, and Sugi often relied on Embo as a favored mercenary.\nDuring the Clone Wars, the crew was employed by Casiss Midagatis, the leader of a farming village on the planet Felucia, to protect the villagers and their harvest of Nysillin from a gang of pirates led by Hondo Ohnaka. Shortly after they had been hired, Obi-Wan Kenobi, Anakin Skywalker and Ahsoka Tano crash-landed on Felucia and discovered the village. A brief standoff between the Jedi and the hunters took place before Casiss intervened, begging the two groups to work together against the pirates.\nThe Jedi were initially reluctant to help the villagers, but were swayed after a brief encounter with Ohnaka, the leader of the gang, whom the Jedi had met once before. Refusing to be bought off by the pirates, the bounty hunters, along with the Jedi, began teaching the villagers to defend themselves. Embo, watching Skywalker train the villagers how to use a simple farming tool as a weapon, chuckled at their lack of experience. While the villagers were preparing to fight, Sugi spotted a lone pirate watching from a nearby ridge. Embo was sent to deal with the scout and the Kyuzo quickly took him out, disabling his Starhawk speeder bike with his bowcaster and blocking the pirate's shots using his metallic hat, before snapping the Weequay's neck with his bare hands. Skywalker commended Embo for his actions, but the fact that the scout would no longer check back in with Hondo meant the villagers didn't have any time to waste.\nSoon afterwards, the pirates attacked the village. Dozens of pirates on speeder bikes swept into the village, firing at the defenders. Embo dispatched one of the pirates and commandeered a speeder bike, using it to take out several others. When Ohnaka arrived on the scene in his tank, however, Embo wasn't quick enough to avoid one of the tank's blasts and was hit. With a badly wounded right arm, Embo was helped into the main barn at the center of the village by Sugi and the others, unable to participate in the battle any longer. After Ohnaka and his pirates retreated and fled the system, Embo left in Sugi's ship, Halo, along with the Jedi, and traveled to a Republic outpost.\nAt one point, Embo and Sugi, were present at the palace of Jabba the Hutt on Tatooine. While they were there, Pantoran diplomats Papanoida and his son, Ion, were searching for Greedo, a Rodian bounty hunter that had kidnapped Papanoida's daughters.\nLater on, Embo was present on Serenno with eleven other bounty hunters, including Obi-Wan Kenobi, who was disguised as the Concordian bounty hunter Rako Hardeen, to fight in the \"Box,\" which had been designed by Moralo Eval. Embo was one of the few hunters to survive the challenge, and was assigned by Count Dooku to kidnap Supreme Chancellor Sheev Palpatine.\nEmbo then traveled to Naboo to carry out the daring mission. The hunters successfully kidnapped the Chancellor, assuming the roles of Senate Commandos through the use of the holographic disguise matrix, developed by Sinrich. Embo rushed the Chancellor away but failed to escape and were arrested by Skywalker and Mace Windu.\nEmbo did not remain in Republic custody for long, however. Some time later, he along with the Kyuzo's pet anooba Marrok were seen sharing a table at Chalmun's Spaceport Cantina, while the pair were also present outside a hut in the town.\nSome time later, Embo was employed by the Grand Hutt Council as a bodyguard, along with Sugi, Dengar, and Latts Razzi. When Maul and his brother, Savage Opress, representing the Shadow Collective, threatened the Hutts, Embo and the others sprang into action to defend their employers. At first the bounty hunters were able to beat the brothers back, but they were driven back when the forces of Death Watch joined in the attack. Embo went up against Opress on his own, saved from the Zabrak only by the strength of his hat. When it was clear that they couldn't defeat the two brothers, Embo and the others retreated, abandoning their employers.\nSometime after this, Embo traveled to Scipio, the home planet of Rush Clovis, whom he had been hired to drive off the InterGalactic Banking Clan vault world. When Clovis arrived, along with Padmé Amidala and Skywalker, Embo killed Amidala's aide, Teckla Minnau, and disabled the trio's ship. As they fled in a speeder, Marrok forced them to pilot down the mountainside. Embo used his hat to sled down the mountain in pursuit of the speeder carrying his target. However, he was held at bay by Skywalker until the trio was saved by R2-D2, who was piloting their ship, saving them before they could go over a cliff. Having accomplished his mission, Embo informed his employer, Darth Sidious, that Clovis had escaped—just as the Dark Lord had planned.\nIn the latter months of the war, Embo began taking jobs on a regular basis with Boba Fett's team of bounty hunters, Krayt's Claw. One job in particular found the crew hired by former ally of the Sith, Asajj Ventress, to assist in the rescue of her lover, Quinlan Vos, from his captivity on Serenno. This was his first time working with the Dathomirian Nightsister and former Sith apprentice. Embo and his anooba Marrok traveled to Serenno on the Guillotine and rendezvoused with Krayt's Claw and Ventress at the planet's spaceport. While the mission proved to be a failure, Embo and the rest of Fett's team escaped a direct encounter with the Sith Lord Count Dooku, alive.\nSeveral years before the Battle of Yavin, Embo was depicted in some graffiti art, courtesy of Sabine Wren, aboard the Ghost, the ship of Hera Syndulla.\nFollowing the Battle of Endor, Embo took on a job to collect a bounty placed on Lando Calrissian, a prominent general in the Alliance to Restore the Republic who had been responsible for the destruction of the Galactic Empire's second Death Star. Embo located Lando's ship, the Millennium Falcon, at a refueling station and snuck onboard the vessel. The stowaway Embo sabotaged the ship, keeping it from taking liftoff. While Calrissian was attempting to conduct repairs, Embo cornered him with his bowcaster. Embo spoke to him, though Lando could only understand the words \"Death Star\" come from the Kyuzo. Lando realized that Embo was there to collect the bounty on him and tried to offer Embo a deal that involved splitting the bounty. Embo protested and aimed his blaster, but Lando stalled long enough for one of the Falcon's pipes to burst behind Embo, knocking the hunter into a wall and incapacitating him. While Embo got his bearings, he was tied up by Calrissian. Lando brought the captive Embo outside the ship, where he exaggerated what had happened to his co-pilot, Nien Nunb. Lando had also managed to complete repairs on the ship, and credited an old friend inside the Falcon for helping him stop Embo\nIn 5 ABY, Embo, along with the bounty hunters Dengar and a Rodian named Jeeta, was hired by Mercurial Swift in order to capture Jas Emari, Sugi's niece. The Black Sun crime boss Gyuti had imposed a bounty on Emari's head. Embo joined Swift's party because he wanted to clear his debts. After learning that Niima the Hutt had taken Jas captive on Jakku, Embo and the other bounty hunters traveled to Niima's temple to pick her up. Swift went into Emari's cell to fetch her, intending to collect the bounty for himself and abandon his crew. However, Jas broke free and overpowered her captors.\nAfter escaping her captors, Jas headed to the hangar only to find Embo and Dengar guarding Swift's Corellian shuttle. They began speaking, and during the conversation Embo mentioned the death of Marrok, which had happened years before. Knowing that Embo had incurred debts, Jas tried to remind Embo that he and her aunt Sugi had worked together. Emari convinced Embo to let her take the ship, saying that he was old and that Marrok always liked her. Dengar tried to stop Jas but she managed to escape on the Corellian shuttle.\nLater, Jas Emari and the New Republic operative Norra Wexley returned to Niima's temple. In return for ferrying Niima back to her temple, the Hutt crime lady had outfitted them with an old Imperial shuttle, old uniforms, and clearance codes to enter the Main Imperial base on Jakku. Embo and the rest of Swift's party cornered Jas and Niima. While Norra escaped with her son's droid Mister Bones aboard the shuttle, Jas stayed behind in order to allow Norra to proceed with her mission to capture Grand Admiral Rae Sloane.\nFollowing Emari's capture, Swift attempted to travel to Nar Shaddaa to deliver Jas to Boss Gyuti. However, they were unable to leave due to the Battle of Jakku. During the wait, Jas managed to convince Embo, Dengar, and Jeeta to turn against Swift. She offered to secure them pardons from the New Republic if they switched sides. Swift tried to object but was thrown out of the shuttle by Jas with the help of Dengar. Embo, Jeeta, and Dengar then became Jas' crew. They took Swift's shuttle to the Jakku Observatory where they picked up Norra, who had joined forces with Sloane and her estranged husband Brentin Lore Wexley to stop Gallius Rax from destroying Jakku as part of the late Emperor's contingency plan.\nFollowing the Battle of Jakku and the Galactic Concordance, Embo and the rest of Emari's crew received full pardons from the New Republic with the help of Jas' friend Sinjir Rath Velus, a former Imperial loyalty officer who had become an adviser to Chancellor Mon Mothma. They also received enough money from the New Republic and continued to work with Emari as her crew.\nSometime in the decades after the Battle of Jakku, the New Republic funding Embo had received ran dry and he informally retired from bounty hunting. Embo chose Felucia to settle on due to its value to him, starting a life as a farmer there. In 34 ABY, Embo was sought out by mercenary Bazine Netal, who was searching for the whereabouts of the Millennium Falcon. Netal learned from junk droid Teetee that a bounty hunter who once owned a pet anooba and an armored hat had been in contact with the Falcon, and she immediately recognized who the droid was referring to. Netal found Embo on Felucia, though the Kyuzo reacted poorly to her arrival and, after a short chase, he cornered her and she offered him a deal. Netal knew that he was low on credits and offered him some in exchange for information on his encounter with the Falcon. Despite the initial language barrier, Embo told her the story of his failed attempt to capture the ship and collect the bounty on Lando Calrissian's head after the Battle of Endor. Netal was underwhelmed with the story and didn't believe it was worth the credits, but held up her end of the bargain. As she prepared to make her leave, Embo gave her what information he had on the current location of the ship. He told her that it had surfaced on Corellia, and directed Netal to meet with Lady Proxima to find out more.\nEmbo was a quiet, stoic, and disciplined individual, speaking only in his native language, which made it difficult for others to understand him. He was also totally ruthless, dispatching foe after foe without mercy or remorse, and using his unorthodox weapons to lethal effect. Embo had no code beyond getting paid.\nAlthough commonly freelance, Embo was a constant and reliable ally of Sugi, who could always count on him to show up when she needed him. Embo was also respected by her niece Jas Emari. Having incurred debts by the time of the Battle of Jakku, Embo reluctantly accepted an offer from Mercurial Swift to join his crew and collect Boss Gyuti's bounty on Jas. However, Embo was unwilling to hurt Jas since they had worked together in the past. On one occasion, he allowed Jas to escape. On another, he and his fellow bounty hunters Dengar and Jeeta turned against Swift after Jas convinced them to join forces with her in return for securing pardons from the New Republic. Due to their dislike for Swift, Embo did not object to Dengar and Jas throwing Swift out of his shuttle.\nHailing from the planet Phatrong, Embo stood at 1.99 meters, or 6 feet, 6 inches.\nA deadly fighter, Embo was skilled in a variety of areas. Extremely acrobatic and agile, Embo could jump very high and run faster than any human, while his proficiency in unarmed combat made him the equal of any Jedi or Sith when it came to close-quarters fighting. Embo was very skilled with his chosen weapons, using his rimmed hat to take out opponents from a distance and also use as a shield. Embo was also a good shot with his bowcaster, and was a capable sniper. He was also an expert tracker. At one point in the Clone Wars, Embo was considered second only to Cad Bane in the entire galaxy. Bane personally held himself in higher regard but also respected Embo's ability.\nUnlike bounty hunters such as Cad Bane or Jango Fett, Embo relied little on technology. Embo's primary weapons were a bowcaster and his unique metallic, wide-rimmed hat, which doubled as a shield and as a throwing weapon. During the Clone Wars, Embo often wore a chest plate, with an ammunition bandolier slung over his shoulder, and wore a long red fighting skirt decorated with gold symbols.\nEmbo was voiced by supervising director Dave Filoni. The character was intended to be killed off at the end of \"Bounty Hunters.\" However, after discussion about the character and story among the production team , they decided to have him injured by Hondo as seen in the final version. The unfinished version can be seen from the behind-the-scenes clips about the season included in the DVD and Blu-ray releases.\nEmbo's species, the Kyuzo, was named after the character \"Kyuzo\" in the film Seven Samurai. This is one of many homages to the film found in Embo's first episode, \"Bounty Hunters.\" Embo's alien language, devised by Filoni, is actually a badly enunciated version of the Smurfs Books, written in French. In the Dark Disciple book, he instead uses Italian soccer players surnames.\nEmbo was made into a LEGO minifigure in 2011. It appeared in the set \"7930 Bounty Hunter Gunship,\" alongside Sugi, Aurra Sing, and an elite assassin droid. The set featured a version of the Halo, the ship found in the episode \"Bounty Hunters.\"\nWhen the complete season 4 DVD collection of the Clone Wars series was released, Embo appeared on a special wanted poster along with Cad Bane, Rako Hardeen, Moralo Eval, and Derrown, that came in the package.\nBefore the cancellation of The Clone Wars TV series, Embo was set to make an appearance during a four-episode arc starring Boba Fett and Cad Bane. In a clip revealed during the \"Animated Origins and Unexpected Fates\" panel at Celebration Orlando in 2017, Embo and Bossk were seen siding with Bane during a stand-off against Fett and other bounty hunters, with the Kyuzo dropping the younger mercenary's carbine. While Bossk betrayed Bane by suggesting giving Fett a chance to prove himself, Embo's treachery was sitting idle, abandoning the Duro bounty hunter to his fate.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Embo",
  "/wiki/Embo/Legends",
  "/wiki/The_Long_Game_(Age_of_Rebellion)",
  "/wiki/Phatrong",
  "/wiki/Kyuzo",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Sugi%27s_bounty_hunters",
  "/wiki/Cad_Bane%27s_group",
  "/wiki/Hutt_Clan",
  "/wiki/Krayt%27s_Claw",
  "/wiki/Jas_Emari%27s_crew",
  "/wiki/Bounty_hunter",
  "/wiki/Republic_Era",
  "/wiki/Clone_Wars",
  "/wiki/Time",
  "/wiki/Bowcaster",
  "/wiki/Hat",
  "/wiki/Sugi_(bounty_hunter)",
  "/wiki/Bounty",
  "/wiki/Felucia",
  "/wiki/Felucian",
  "/wiki/Ohnaka_Gang",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Shadow_Collective",
  "/wiki/Boba_Fett",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/C-21_Highsinger",
  "/wiki/Latts_Razzi",
  "/wiki/Asajj_Ventress",
  "/wiki/Quinlan_Vos",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Castle_Serenno",
  "/wiki/Serenno",
  "/wiki/Scipio",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Anooba",
  "/wiki/Marrok",
  "/wiki/Starship",
  "/wiki/Guillotine_(starship)",
  "/wiki/Imperial_Era",
  "/wiki/Mercurial_Swift",
  "/wiki/Jas_Emari",
  "/wiki/Dengar",
  "/wiki/Jeeta",
  "/wiki/Battle_of_Jakku",
  "/wiki/New_Republic",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Rumi_Paramita",
  "/wiki/Seripas",
  "/wiki/Casiss_Midagatis",
  "/wiki/Farm",
  "/wiki/Nysillin",
  "/wiki/Pirate",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Ahsoka_Tano",
  "/wiki/Jedi",
  "/wiki/Mission_to_Florrum",
  "/wiki/Skirmish_on_Felucia",
  "/wiki/Scout",
  "/wiki/Starhawk_speeder_bike",
  "/wiki/Kyuzo_war_shield",
  "/wiki/Weequay",
  "/wiki/Speeder_bike",
  "/wiki/Speeder",
  "/wiki/Tank_(vehicle)",
  "/wiki/Felucia_system",
  "/wiki/Halo",
  "/wiki/Galactic_Republic",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Tatooine",
  "/wiki/Pantoran",
  "/wiki/Diplomat",
  "/wiki/Notluwiski_Papanoida",
  "/wiki/Ion_Papanoida",
  "/wiki/Greedo",
  "/wiki/Rodian",
  "/wiki/Kidnapping_of_the_Papanoida_daughters",
  "/wiki/Concord_Dawn",
  "/wiki/Rako_Hardeen",
  "/wiki/Box",
  "/wiki/Moralo_Eval",
  "/wiki/Tournament_on_Serenno",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Naboo",
  "/wiki/Skirmish_in_Theed",
  "/wiki/Senate_Commando",
  "/wiki/Holographic_disguise_matrix",
  "/wiki/Sinrich",
  "/wiki/Mace_Windu",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Mos_Eisley",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Bodyguard",
  "/wiki/Savage_Opress",
  "/wiki/Mission_to_Nal_Hutta",
  "/wiki/Death_Watch",
  "/wiki/Mission_to_Scipio",
  "/wiki/Rush_Clovis",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Teckla_Minnau",
  "/wiki/R2-D2",
  "/wiki/Pilot",
  "/wiki/T-6_shuttle",
  "/wiki/Darth",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Standard_month",
  "/wiki/Sith",
  "/wiki/Dathomirian",
  "/wiki/Nightsisters",
  "/wiki/Sith_apprentice",
  "/wiki/Spaceport",
  "/wiki/Mission_to_Serenno_(Krayt%27s_Claw)",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Graffiti",
  "/wiki/Sabine_Wren",
  "/wiki/Ghost",
  "/wiki/Hera_Syndulla",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Millennium_Falcon",
  "/wiki/Nien_Nunb",
  "/wiki/L3-37",
  "/wiki/Black_Sun",
  "/wiki/Boss",
  "/wiki/Gyuti",
  "/wiki/Niima",
  "/wiki/Jakku",
  "/wiki/Niima%27s_temple",
  "/wiki/Hangar",
  "/wiki/Corellian_shuttle",
  "/wiki/Death",
  "/wiki/Shuttle",
  "/wiki/Norra_Wexley",
  "/wiki/Clothing",
  "/wiki/Main_Imperial_base",
  "/wiki/Temmin_Wexley",
  "/wiki/Droid",
  "/wiki/Mister_Bones",
  "/wiki/Grand_Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Nar_Shaddaa",
  "/wiki/Jakku_Observatory",
  "/wiki/Marriage",
  "/wiki/Brentin_Lore_Wexley",
  "/wiki/Gallius_Rax",
  "/wiki/Galactic_Emperor",
  "/wiki/Contingency",
  "/wiki/Galactic_Concordance",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/Loyalty_officer",
  "/wiki/Advisor",
  "/wiki/Chancellor_(New_Republic)",
  "/wiki/Mon_Mothma",
  "/wiki/Currency",
  "/wiki/34_ABY",
  "/wiki/Bazine_Netal",
  "/wiki/Monster_droid",
  "/wiki/Teetee",
  "/wiki/Corellia",
  "/wiki/Lord",
  "/wiki/Proxima",
  "/wiki/Kyuzo_(language)",
  "/wiki/Human",
  "/wiki/Cad_Bane",
  "/wiki/The_galaxy",
  "/wiki/Jango_Fett",
  "/wiki/Bandolier",
  "/wiki/Dave_Filoni",
  "/wiki/Bounty_Hunters_(episode)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/LEGO",
  "/wiki/Aurra_Sing",
  "/wiki/Assassin_droid",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Celebration_Orlando",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Sphere_of_Influence",
  "/wiki/The_Box",
  "/wiki/Crisis_on_Naboo",
  "/wiki/Bane%27s_Story",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Bounty_(episode)",
  "/wiki/Revenge_(episode)",
  "/wiki/Eminence_(episode)",
  "/wiki/An_Old_Friend",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Fighter_Flight",
  "/wiki/Age_of_Rebellion_Special_1",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Flight_of_the_Falcon,_Part_2:_The_Planet_of_Misfit_Droids",
  "/wiki/Star_Wars_Adventures_(2017)_15",
  "/wiki/Flight_of_the_Falcon,_Part_3:_Home_Again",
  "/wiki/Star_Wars_Adventures_(2017)_16",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_16",
  "/wiki/Databank_A-Z",
  "/wiki/No_Disintegrations_(Fantasy_Flight_Games)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Adventures,_Volume_6:_Flight_of_the_Falcon",
  "/wiki/Resistance",
  "/wiki/Batuu",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Flight_of_the_Falcon,_Part_4:_Lady_and_the_Tramp",
  "/wiki/Star_Wars_Adventures_(2017)_17",
  "/wiki/Star_Wars"
 ]
}