{
 "name": "Embraced_Chaos_of_Exar_Kun",
 "display_name": "Embraced Chaos of Exar Kun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Yavin 4"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cult of Exar Kun"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Exar Kun"
     ]
    }
   ]
  }
 ],
 "content": "The Embraced Chaos of Exar Kun was a dark side Force-user who was an unwilling follower of Exar Kun.\nBefore becoming an unwilling follower of Exar Kun, the Embraced Chaos of Exar Kun was a student at Corellia University, trained in the histories of the Jedi and the Sith. He may have been a member of an archaeological expedition on Yavin 4 in 1 ABY that unknowingly tunneled into the tombs below the Temple of Exar Kun and released the Sith Lord's spirit. The evil spirit proceeded to bind the students and researchers to his will, and induct them into the Cult of Exar Kun. This scholar's desire of knowledge and power twisted his mind into a servant to the Dark Lord. Afterward, the spirit of Kun sent them to Talus, to the Corellia University research outpost they had originally come from to enslave the rest of the people there. The majority of them were then sent back to Yavin 4. After losing contact with the outpost and fearing the worst, Professor Cornelius Wagglehorn hired a group of spacers to travel to Talus and investigate. The spacers learned what had transpired and informed the professor. He provided them with the coordinates to the tomb and implored them to destroy the Sith Lord's spirit within. Embraced Chaos was among the dark Force-user that confronted the spacers before they were able to get to the spirit of Exar Kun. However, the spacers managed to defeat all former students, and then proceed to confront the Dark Lord himself.\nThe Embraced Chaos of Exar Kun was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The Embraced Chaos was added to the game as part of the \"Exar Kun\" Heroic Encounter, introduced with the release of the \"Chapter 9\" update, on April 3, 2008.\nBecause the Embraced Chaos of Exar Kun appeared in the game as a generic Exar Kun cultist, the gender and appearance of this character were randomized during each server reset.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chaos_(disambiguation)",
  "/wiki/1_ABY/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Cult_of_Exar_Kun",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Corellia_University/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Temple_of_Exar_Kun",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Force_ghost",
  "/wiki/Talus/Legends",
  "/wiki/Corellia_University_research_outpost",
  "/wiki/Cornelius_Wagglehorn",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/April_3",
  "/wiki/2008",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Galactic_Hunters",
  "/wiki/Template:SWGTCG",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}