{
 "name": "Emesh_Nar",
 "display_name": "Emesh Nar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3 BBY; Etti IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Emesh Nar was a Human male who served as an aide to Ambassador Blains Vorlin. He was stationed at the Imperial embassy on Etti IV in the Corporate Sector.\nHe was tasked to find Jahan Cross after he landed at Imperial Pad 693. However, he was late due to a miscommunication about the arrival time and this allowed Cross to wander around the spaceport where he ran into Han Solo and proceeded to get into a brawl with a group of cantina patrons. Nar finally found Cross and invited him to a party later that evening.\nAt the party, Emesh confronted Cross and demanded to know his interest in the Starks. When Cross refused to reveal anything, Nar warned Cross that the Starks were powerful and well-connected. Cross reminded him that his loyalty should lie with the Empire. Nar stormed off, leaving Cross alone. Later, while Cross was being arrested for the murder of Dah'lis Stark, Nar revoked his diplomatic immunity by stating he was a rogue agent. Nar was with Iaclyn Stark at Cross's room in the Imperial embassy when IN-GA 44 was disabled. He arranged for the droid to be smuggled off of the premises.\nNar went back to his quarters to meet up with a date, but he found Cross there instead. When Cross demanded a sum of credits from him, Nar insulted him by calling him a common thief. Cross struck him with the blaster, and continued to demand the credits, which Cross knew were illegally obtained. When Nar denied he had any money, Cross kicked him and informed him that he knew of the hidden safe in the wall. Nar opened the safe, but grabbed a blaster that he had hidden in the safe. He attempted to shoot Cross, but the agent was faster and killed Nar instead.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Etti_IV/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Aide/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Blains_Vorlin",
  "/wiki/Imperial_Embassy_(Etti_IV)",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Jahan_Cross",
  "/wiki/Imperial_Pad_693",
  "/wiki/Han_Solo/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Dah%27lis_Stark",
  "/wiki/Iaclyn_Stark",
  "/wiki/IN-GA_44",
  "/wiki/Dawn_(escort)",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Blaster/Legends",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_1",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_2",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_3",
  "/wiki/Jedi_Council_Forums",
  "/wiki/John_Ostrander",
  "/wiki/March_20",
  "/wiki/2011",
  "/wiki/April_13",
  "/wiki/2013"
 ]
}