{
 "name": "Emon_Azzameen",
 "display_name": "Emon Azzameen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Azzameen family",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Emon Azzameen was a Human male who was the quick-tempered son of Tomaas Azzameen and the middle brother of the Azzameen siblings during the Galactic Civil War. He was second in line to take over the family cargo company. A skilled pilot, Emon owned his own Firespray-class starship, the Andrasta.\nAfter Ace Azzameen was involved in his first real firefight at Harlequin Station, Antan Azzameen advised him to take lessons in combat from his older brother Emon. Emon taught Ace the principles of targeting and shooting from the Sabra's gun turret.\nEmon participated in a raid on Viraxo 54 to lure the authorities out, hoping they would discover the spice that Aeron Azzameen was planting, in retaliation for a similar trick the Viraxo had tried to pull off. Her ship, the Selu , had not yet delivered its cargo when Emon arrived, and, with the plan in chaos, she was forced to flee. However, her ship was disabled by the Viraxo, and Emon was forced to rescue her. After Emon retrieved Aeron, Ace destroyed the Selu to obscure evidence of the family's involvement.\nEmon was present with his family when Tomaas attempted to procure bacta for a Rebel hospital. When black market bacta dealers from the Loose Cannon pirates attempted to capture the Azzameen family, Emon and his brothers defended themselves with lethal force. They succeeded in rebuffing the pirates. Despite Emon's vocal objections, the Azzameens did not destroy the pirates' starship, End Run. Emon located a bottle of Zairona Ale during the skirmish and gave it to Ace, claiming it would put hair just about everywhere, a statement borne from personal experience.\nEmon accompanied Ace, Tomaas and Galin to the Rebel hospital. When the Star Destroyer Corrupter attacked the Hospital, Emon helped Ace provide cover for the Rebels evacuation. Unfortunately, his father's vessel Vasudra was destroyed under intense fire. Unwilling to allow his youngest brother to suffer a similar fate, Emon urged a reluctant Ace to flee the battle. Emon escaped the battle, and became convinced that, as Antan had always averred, Tomaas Azzameen simply took too many risks.\nTogether, Emon and Antan decided to abandon Azzameen Station and flee to the Outer Rim, though Antan did not inform Emon of his planned destination. The pair planned to gather what supplies they could from their storage facilities. Their plans were interrupted when the Viraxo attacked the facilities. Emon escaped the ambush, but Antan was captured. He returned to the family home and met with Ace and Aeron. As they discussed their options, the Corrupter arrived. With no other choice, the three decided to seek out the Rebellion for help, using emergency co-ordinates given to Aeron by her friend, Olin Garn. As the Corrupter ordered the siblings to cease their flight and return to the Base, Emon retorted, in typical fashion, \"Not today, bootlicker.\"\nWhen the siblings arrived at the Defiance, Emon saw his two younger relatives were safe, then left to take care of family issues, amongst others. Emon was able to discover where Antan was being held by the Viraxo: a XQ5 Platform called Viraxo Industries. Assisted by Ace, Emon rescued Antan from the Viraxo. Afterward he then went of to start causing trouble for both the Viraxo and the Empire.\nSoon he and Ace went to Destreg II to destroy K'Armyn Viraxo in his Personal Luxury Yacht 3000, the Highroller. Only to find out that K'Armyn had somehow been forewarned and had set up a trap. Both Ace and Emon managed to destroy the Highroller and the bounty hunters that arrived to kill them, and escaped before the Imperials arrived.\nWhen the family was transferred to the Liberty, Emon found a beautiful young woman named Lady Blue, who was the previous year's \"Miss Liberty\". He convinced her to go on a date with Ace by claiming what 'a great guy' Ace was . However Lady Blue was killed in the Japai system on a recon mission before she could do so. Emon was unable to attend her funeral.\nEmon then went off again on what Aeron dubbed, a 'secret mission'. Emon however, was captured and imprisoned on an Imperial prison facility called Quesna Base. However Ace and Dunari, an old friend of Tomaas, and a recent 'business partner' of the Rebellion, made a successful rescue attempt at the prison colony. Emon was taken back to Dunari's Rest for recuperation, including free food and drink, it was an offer Emon took up immediately.\nAt some point he then stopped an attack by a smuggler called S'Artak on civilian cargo ferries in the Taborin system. He managed to defeat S'Artak resulting in the others scrambling away. He then told his brother he was on his way back home to the Liberty.\nLater, after discovering that Azzameen home had become a base for mercenaries and pirates, Emon was part of the strike force that recaptured the base. During the mission, Emon discovered that Antan's ship, the Big Score, was present at the battle.\nAntan soon contacted the siblings and promised them to explain why he was present there. He also told them that Galin and Tomaas were in fact still alive, and held in large prison complex near Kessel.\nAfter Emon's Andrasta and Ace and Aeron in the Otana followed the Big Score to a Golan III platform near Kessel called Kessel Station, it was revealed that Tomaas and Galin were not in fact there, and that Antan had betrayed Ace, Aeron, and Emon to the Empire. The Azzameen siblings were able to protect themselves from the incoming TIEs until Dunari unexpectedly showed up and helped them escape the ambush. Afterward, Emon vowed to make Antan pay the price for betraying the family, and presumably began to hunt him down.\nIn stark contrast to his tranquil and thoughtful older brother Galin, Emon was hot-headed, rash and violent, though showed great concern for the well-being of his family, on many occasions going out of his way to protect them. It was Emon who rescued his sister Aeron after she was forced to abandon the Selu, ensured that Ace made it away from the rebel hospital alive, and came up with the plan of rescuing his uncle Antan.\nAlong with his impulsive nature came a great deal of impatience, and a strong desire to simply get things done as quickly as possible.\nEmon's fiery temper often got him in to dangerous situations that could have easily been otherwise avoided, such as attacking the Enkidu unprovoked in neutral space, a decision that ruined his plans to take Ace for a celebratory drink. On several occasions, Emon would attempt to take revenge for a past affront, often without thinking. His desire for revenge against the Viraxo saw him take Ace blindly into a trap, when he acted instantly on scant information of K'Armyn Viraxo's whereabouts, and he would later be imprisoned by the Empire, presumably for an equally ill thought out plan for revenge.\nThis said, Emon was not opposed to taking life easy, or taking advantage of a friend's hospitality, exemplified after he was broken out of prison and spent his subsequent recuperation doing his hardest to eat and drink Dunari out of pocket.\nEmon Azzameen's Irish accent, unique among his family, is as yet unexplained. His name is also spelled similarly to the common Irish name Eamon. Emon was voiced by Nick Jameson.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Azzameen_family",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Aeron_Azzameen",
  "/wiki/Tomaas_Azzameen/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Twin_Suns_Transport_Services/Legends",
  "/wiki/Firespray-31-class_patrol_and_attack_craft/Legends",
  "/wiki/Andrasta",
  "/wiki/Ace_Azzameen/Legends",
  "/wiki/Harlequin_Station",
  "/wiki/Antan_Azzameen",
  "/wiki/Sabra",
  "/wiki/Raid_on_Viraxo_54",
  "/wiki/Viraxo_54",
  "/wiki/Selu",
  "/wiki/Venix",
  "/wiki/Viraxo",
  "/wiki/Bacta/Legends",
  "/wiki/Hospital_(XQ2_Platform)",
  "/wiki/Loose_Cannon_pirates",
  "/wiki/End_Run_(Xiytiar-class)",
  "/wiki/Zairona_Ale",
  "/wiki/Galin_Azzameen/Legends",
  "/wiki/Corrupter_(Imperial-class)",
  "/wiki/Battle_of_Hospital",
  "/wiki/Vasudra",
  "/wiki/Azzameen_Station",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Imperialization_of_Azzameen_assets",
  "/wiki/Olin_Garn",
  "/wiki/Defiance/Legends",
  "/wiki/XQ5_Platform",
  "/wiki/Viraxo_Industries",
  "/wiki/Rescue_of_Antan_Azzameen",
  "/wiki/Destreg_II",
  "/wiki/Assassination_attempt_on_K%27Armyn_Viraxo",
  "/wiki/K%27Armyn_Viraxo",
  "/wiki/Personal_Luxury_Yacht_3000",
  "/wiki/Highroller",
  "/wiki/Liberty/Legends",
  "/wiki/Lady_Blue",
  "/wiki/Japai_system",
  "/wiki/Quesna_Base",
  "/wiki/Dunari",
  "/wiki/Dunari%27s_Rest",
  "/wiki/Taborin_system",
  "/wiki/Battle_of_Azzameen_Station",
  "/wiki/Big_Score",
  "/wiki/Kessel/Legends",
  "/wiki/Kessel_Station",
  "/wiki/Mission_to_Kessel_Station",
  "/wiki/Enkidu",
  "/wiki/Nick_Jameson",
  "/wiki/Category:Audio_files_of_Emon_Azzameen",
  "/wiki/Star_Wars:_X-Wing_Alliance",
  "/wiki/LucasArts",
  "/wiki/Star_Wars:_X-Wing_Alliance:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/Most_Wanted_Expansion_Pack",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Scum_and_Villainy_Conversion_Kit",
  "/wiki/Slave_I_Expansion_Pack_(X-Wing:_Second_Edition)"
 ]
}