{
 "name": "Emperor's physician",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Dark Empire"
     ]
    }
   ]
  }
 ],
 "content": "The Emperor's physician was Emperor Palpatine's personal medical care provider during his return in the form of several clone bodies.\nDespite the prestige of his position, as one of the few beings close enough to the reborn Emperor Palpatine at the Imperial Citadel on Byss, the physician became complacent and wished for more power and wealth for himself. Taking a very large bribe from Carnor Jax, an overly-ambitious Imperial Royal Guardsman, the physician tampered with all of the Emperor's remaining clone bodies causing them to age much faster than was normal. In a final act of betrayal, he sabotaged the genetic source material making it impossible to create new copies without the defect.\nIn a quest to find a fresh body, Palpatine left Byss to try and inhabit that of Princess Leia's newborn son Anakin. The physician was brought along. In an attempt to throw his soul into the baby, Palpatine's spirit was trapped by Empatojayos Brand and he finally surrendered to the abyss. Seeing the Emperor finally perish at the hand of the New Republic's frontmen brought great guilt upon the physician. He was captured by Jedi Knight Luke Skywalker and his allies, and confessed his part in the conspiracy. Unbeknownst to him, an Imperial Royal Guardsman heard the confession and brought the news, including the treachery of Carnor Jax, to remaining peers on Yinchorr.\nSome fans have identified the Emperor's physician with Sigit Ranth, but this has never been mentioned in any canonical source and is strictly fanon. Note that although the physician was indeed Palpatine's primary care provider, he was a physician, not a Clone Master; that role belonged to the Constable of Homunculi, still another separate character.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dark_Empire",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Emperor",
  "/wiki/Palpatine",
  "/wiki/Emperor%27s_Citadel",
  "/wiki/Byss/Legends",
  "/wiki/Carnor_Jax",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Anakin_Solo",
  "/wiki/Empatojayos_Brand",
  "/wiki/New_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Yinchorr/Legends",
  "/wiki/Sigit_Ranth",
  "/wiki/Fanon",
  "/wiki/Clone_Master",
  "/wiki/Constable_of_Homunculi",
  "/wiki/Star_Wars:_Empire%27s_End",
  "/wiki/Crimson_Empire_0",
  "/wiki/Star_Wars:_Crimson_Empire",
  "/wiki/Crimson_Empire_(audio)",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Emperor%27s_Pawns",
  "/wiki/Star_Wars_Gamer_5",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/StarWars.com",
  "/wiki/Jedi_Academy_Training_Manual"
 ]
}