{
 "name": "Enaq",
 "display_name": "Enaq",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Evocii"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  }
 ],
 "content": "Enaq was an Evocii male who lived as a refugee on the moon Nar Shaddaa during the Cold War between the Galactic Republic and the reconstituted Sith Empire. Enaq befriended a young Human girl named Kira Carsen, but he and his fellow refugees suffered when Carsen's defense of her friends gave the group a formidable reputation, turning away potential aid.\nEnaq was an Evocii who, like many of his species during the Galactic War and Cold War between the Galactic Republic and the Sith Empire, lived as a refugee in the depths of the city-moon Nar Shaddaa. He and a group of refugees, led by an Anomid named Darshyn, lived and worked at the Alien Outreach Center in Nar Shaddaa's High Security Lockdown district, providing aid to fellow victims and displaced persons. Around 3653 BBY, a young Human girl named Kira Carsen joined the group, and Enaq became friends with her. Carsen bundled herself in extra layers of clothing in order to look bigger and tougher than she really was.\nCarsen stayed with the group for eight years, but during that time, a gang known as the Ur'kossags began to terrorize the refugees and rob them. When Carsen paid them a visit and asked them to leave the refugees alone, the Ur'kossags offered the girl membership in their group, asking her to kill a rival gangster as a test. She refused and was forced to kill the entire group with her nascent Force powers.\nCarsen was recruited into the Jedi Order not long afterward, so she was unaware of how her actions affected Enaq and the others—because of the Ur'kossags' deaths, the refugees acquired a formidable reputation that prevented other gang attacks but also turned away groups that would typically offer aid, though additional refugees continued to seek aid. Two years later, Enaq contacted Carsen and requested supplies and aid, and she readily responded, bringing along her new Jedi Master. However, Enaq and Carsen's reunion was disrupted by a furious Darshyn, who blamed the girl for their lack of supplies and the reputation that her actions gave them. Disheartened, Carsen departed, though she promised to return again soon with more supplies.\nAn Evocii refugee, Enaq had tan skin and blue eyes, as well as black sideburns and a small amount of black hair atop his head. Even though he himself was a refugee, Enaq and the rest of his group went out of their way to provide aid and supplies to other refugees. He did not hold Carsen's killing of the Ur'kossags against her, as he understood that she had been trying to protect her friends.\nEnaq appears in \"The Merciful One,\" a conversation-mission for the Jedi Knight-class companion character Kira Carsen in Star Wars: The Old Republic, a video game released in 2011 by BioWare. Unlike most companion conversations, \"The Merciful One\" is an actual mission that requires players to travel to Nar Shaddaa with Carsen as the players' companion.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Evocii",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Refugee/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Human/Legends",
  "/wiki/Kira_Carsen",
  "/wiki/Species/Legends",
  "/wiki/Galactic_War",
  "/wiki/City/Legends",
  "/wiki/Anomid/Legends",
  "/wiki/Darshyn",
  "/wiki/Alien_Outreach_Center",
  "/wiki/High_Security_Lockdown",
  "/wiki/3653_BBY",
  "/wiki/Clothing/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Time/Legends",
  "/wiki/Ur%27kossags",
  "/wiki/Death/Legends",
  "/wiki/Unidentified_gangster",
  "/wiki/Force_power/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Video_game",
  "/wiki/2011",
  "/wiki/BioWare",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Reproduction/Legends",
  "/wiki/3663_BBY",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound",
  "/wiki/3643_BBY"
 ]
}