{
 "name": "Endente",
 "display_name": "Endente",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Utapau"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sugi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Endente's arms dealing group"
     ]
    }
   ]
  }
 ],
 "content": "Endente was a Sugi arms dealer who at some point made a deal with Governor Torul Blom and Count Dooku to provide the Separatists with a giant kyber crystal.\nEndente was the leader of a group of Sugi arms dealers during the Clone Wars. He negotiated with Separatist Head of State Count Dooku to sell a large kyber crystal to his Confederacy. He had allied himself with Governor Torul Blom by the time of his attempts to sell the prized possession.\nHe later had Jedi Knights Obi-Wan Kenobi and Anakin Skywalker arrested and prepared to get with the crystal to Pau City. He was informed by Count Dooku that if he failed he would not only lose his money but his life as well. He lost the transport with the crystal which was captured by Kenobi and Skywalker, but still got to the city where he entered Governor Blom's office. As he was about to speak he realized that he and the Pau'an were not alone and saw Dooku's enforcer: General Grievous. The cyborg was as displeased as his master and asked Endente where was the crystal. The Sugi attempted to cover up his failure by telling him that it would be delivered on time. With that said, Grievous sarcastically asked again if the Jedi were also part of the plan after which he revealed that he knew of the latter had lost the object. Grievous stated that he had no more business to do with him, and after which he decapitated the arms dealer, and threw his body to the other side of the room. Grievous then went to deal with the Jedi himself.\nEndente first appeared in an unfinished episode of Star Wars: The Clone Wars, \"In Search of the Crystal,\" and was voiced by James Hong.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/19_BBY",
  "/wiki/Utapau",
  "/wiki/Sugi",
  "/wiki/Gender",
  "/wiki/Endente%27s_arms_dealing_group",
  "/wiki/Arms_dealer",
  "/wiki/Torul_Blom",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Kyber_crystal",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Head_of_State",
  "/wiki/Governor",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Pau_City",
  "/wiki/Transport",
  "/wiki/City",
  "/wiki/Pau%27an",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Cyborg",
  "/wiki/Jedi",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/In_Search_of_the_Crystal",
  "/wiki/James_Hong",
  "/wiki/Crystal_Crisis",
  "/wiki/The_Big_Bang",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}