{
 "name": "Energizer_Bunny",
 "display_name": "Energizer Bunny",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Unknown lagomorph-like species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pink"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Power pack"
     ]
    }
   ]
  }
 ],
 "content": "The \"Energizer Bunny\" was a small male lagomorph-like creature that used an Energizer battery attached to his back to keep going and going. Around 3 ABY, the Sith Lord Darth Vader was sent by his master, Emperor Palpatine, to take the Energizer Bunny's battery. However, after a brief duel in Cloud City's carbon-freezing chamber, the Bunny was able to escape from Vader after the batteries in the Sith Lord's lightsaber ran out, leaving Vader disarmed.\nThe Energizer Bunny was male member of a lagomorph-like species that used an Energizer battery to keep going and going. Sometime during the Galactic Civil War, the Energizer Bunny's presence in the Force was so strong that it registered on the sensors of the Star Dreadnought Executor—a remarkable occurrence, given that detecting the Force generally required very specialized equipment such as a Force detector. Despite this, it is apparent that Vader only took action with regard to this matter after Emperor Palpatine ordered Vader to \"get his battery\" after sensing the \"great disturbance in the Force\" caused by the Energizer Bunny.\nVader and the Energizer Bunny eventually met at a carbon-freezing facility at an undisclosed location, possibly Cloud City. Vader soon discovered that retrieving the Energizer Bunny's power cell would not be as easy as he had thought. He taunted the Energizer Bunny and tried to lure it to the dark side of the Force. It easily evaded the Sith Lord's attacks by spinning. Eventually Vader's lightsaber, which had been powered by allegedly inferior Supervolt power cells, died out.\nWith no apparent urgency, the Energizer Bunny exited the carbon-freezing chamber as the Dark Lord of the Sith screamed in frustration.\nAt some point, the Energizer Bunny was spotted on a viewscreen at the Star Tours depot. The extent of his involvement in the venture is presently unclear.\nThe Energizer Bunny was agile, being able to evade several of Darth Vader's lightsaber attacks during the duel on Cloud City. Because of the Energizer battery attached to his back, the Bunny could keep going and going for long periods of time, along with continuously beating on a pair of drums he carried around with him.\nThe Energizer Bunny had an Energizer battery attached to his back, which allowed him to keep going and going. He also carried around a set of drums, which he constantly beat. The Energizer Bunny wore a pair of sunglasses and sandals.\nThe Energizer Bunny was featured in a licensed Star Wars–themed commercial in 1994. During the Energizer company's relationship with Lucasfilm, the Energizer Bunny was also displayed at the Star Tours attraction at Disneyland.\nThe species of the Energizer Bunny has never been revealed, but he does bear a distinct resemblance to several different lagomorph species. He is apparently small enough to fit in a human hand, has short, brightly colored fur, never speaks aloud, and appears to operate on electricity. These characteristics might be sufficient to classify him as a Hoojib.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Energizer",
  "/wiki/Rabbit/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Power_pack",
  "/wiki/Palpatine/Legends",
  "/wiki/File:EnergizerBunny-30secondspot-Palpy.ogg",
  "/wiki/3_ABY/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Carbon-freezing_chamber/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Species/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Force_detector",
  "/wiki/Disturbance_in_the_Force/Legends",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/Dun_M%C3%B6ch/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Supervolt",
  "/wiki/Viewscreen/Legends",
  "/wiki/Star_Tours/Legends",
  "/wiki/Glareshades",
  "/wiki/Star_Wars",
  "/wiki/1994",
  "/wiki/Star_Tours_(real-world)",
  "/wiki/Human/Legends",
  "/wiki/Hoojib/Legends",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_24",
  "/wiki/Alien_Anthology"
 ]
}