{
 "name": "Enfys Nest",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "27 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.67 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Cloud-Riders"
     ]
    }
   ]
  }
 ],
 "content": "Enfys Nest was a human female resistance fighter who led the Cloud-Riders, a band of pirates and rebel group that fought against the crime syndicate, Crimson Dawn. Nest's skills as a pirate earned her a reputation as an infamous marauder including in Crimson Dawn, who Nest and her Cloud-Riders actively fought against in retaliation for the atrocities Crimson Dawn had committed against them. Nest, who wore a battle helmet passed down to her from her mother, had run-ins with Crimson Dawn operative Tobias Beckett and his gang.\nIn 10 BBY, Nest and the Cloud-Riders sparred with Beckett and his crew, including Han Solo, as they competed for a score of valuable hyperspace fuel called coaxium. After both groups failed to steal a shipment on Vandor, Nest and her lieutenant, Weazel, tracked Beckett's crew as they stole coaxium from Kessel. Nest and the Cloud-Riders found Beckett's crew on Savareen, where she revealed the group's true purpose as allies fighting against Crimson Dawn. Solo sided with Nest and they teamed up to steal the coaxium from Crimson Dawn, dealing the syndicate a critical blow in the process. Nest intended to use the coaxium to help give life to a rebellion, so she gave the coaxium to Saw Gerrera of the Partisans and his young ward, Jyn Erso.\nBorn during the twilight years of the Galactic Republic in 27 BBY into a family whose women fought to protect the galaxy for many generations, Enfys Nest was the daughter of a woman who led the Cloud-Riders, a band of pirates who sought reprisal against the Galactic Empire and criminal syndicates that terrorized the galaxy. She came from a world that was brutalized by the criminal organizations of the Five Crime Syndicates and carried a specific vendetta against Crimson Dawn—widely considered the deadliest and most powerful of the Five syndicates—for what they did to her homeworld, family and innocents across the galaxy.\nIn 11 BBY Nest's mother perished, leaving the 16-year-old Nest to take up the mantle of her mother's distinctive mask and armor and her place as leader of the Cloud-Riders to carry on the mission of fighting back against the threats to the galaxy's safety. With her identity and age hidden behind mask and vocoder chest box, she built a reputation as an infamous and dangerous pirate, not underestimated for her youth as she had been in the past.\nIn 11 BBY, about a year following her ascension to leader of the Cloud-Riders, Nest led a squad of six marauders on a raid of an Imperial spice cache on Gargon. The raiding party approached the cache aboard their swoop bikes and stole its stores of medicinally processed spice, kept in ready-for-use triage kits and emergency packs. Although pursued by Imperial forces that came near to closing in on them, the Nest and the Cloud-Riders successfully escaped with their quarry.\nIn the ensuing Imperial Security Bureau investigation of the incident, Agent Andressa Divo observed how the raiding party took only the medicinally processed spice, forgoing the raw spice that could be refined into a lucrative narcotic form and sold for immense profit. While her compatriots attributed this curiosity to a hurried escape forced by Imperial pursuit, Divo judged it was a deliberate decision on Nest's part and reflective of the ideological motives behind her gang's activities. She suspected Nest was not simply out to make a profit but fostering an insurrectionist movement against the Empire and preparing an army to go to war.\nIn need of some blank identichips, Nest decided to trick her rival Tobias Beckett into acquiring some for her. Nest sent a transmission to Beckett and his crew, posing as Dryden Vos of the Crimson Dawn. Believing Vos wanted them to steal blank identichips, Beckett and his crew stole a package of identichips from Dvorad on Hovun IV.\nBeckett's gang took their cargo to the space station Munt Ontdal on the Rampart. However, when they arrived, they discovered that it had been a setup when Nest and her Cloud-Riders confronted them, managing to take them prisoner. Beckett tried to intimidate them with the threat of Dryden Vos showing up, but Val had deduced that Nest had been the one to send them on their mission. Nest threatened Beckett with a blaster, asking him where the identichips had been hidden. To prevent Nest from getting the cargo, Beckett destroyed the Rampart, escaping with his crew during the explosion.\nHaving been a thorn in the side of Tobias Beckett and Crimson Dawn for an extended period of time, the possibility of Nest and the Cloud-Riders interfering with Beckett's heist on Vandor was brought up by Val, whose advice fell on deaf ears; Beckett had been assured that only he and his inside men had the knowledge of the supply carried by a 20-T Railcrawler conveyex transport in the mountains of Vandor. However, Val's fears were soon proven correct when Enfys Nest arrived with her Cloud-Riders, attempting to thwart an attempt by Beckett's gang to steal a large quantity of coaxium from the conveyex, wanting to take the coaxium for themselves. As Beckett and his gang detached the train car carrying the hyperfuel, Nest and the Cloud-Riders, flying swoops, attached tow cables to the car and attempted to wrest the fuel from Beckett's stolen Y-45 armored transport hauler, flown by Rio Durant and Han Solo. In the ensuing struggle, the coaxium cargo fell into a mountainous ravine, resulting in a huge explosion.\nShortly before Beckett and the rest of his team left Vandor, Nest had other members of the Cloud Riders place a homing beacon upon the ship. As the Falcon flew off, Weazel reported to Nest about having successfully attached the beacon.\nBeckett and his gang regrouped and managed to steal a second load of coaxium, this time in unrefined form, from the mines of Kessel. The unrefined hyperfuel was highly unstable and needed to quickly be processed at the Bis Refinery on the planet Savareen. After the fuel was processed, Beckett and his crew planned to deliver it to Dryden Vos, but were once again ambushed by Enfys Nest and the Cloud-Riders, who had been tracking them since Vandor. One of Beckett's crew members, Han Solo, attempted to bluff that the Millennium Falcon was poised to dispatch the Cloud-Riders, only for its owner, Lando Calrissian, to flee the planet.\nAfter a confrontation, Nest revealed that the Cloud-Riders were not \"marauders\" as Beckett had believed, but freedom fighters trying to stop crime syndicates and the Empire from gaining more power. Solo was sympathetic to her cause, and hatched a plan to double-cross Crimson Dawn for the coaxium. The Cloud-Riders would then temporarily go into hiding and villagers would pose as the Cloud-Riders in order to lure away the Crimson Dawn's Hylobon Enforcers so Vos would be alone and easy to kill.\nSolo's plan worked and the Hylobon Enforcers disarmed the \"Cloud-Riders,\" securing the coaxium vault. Before they could take the coaxium back to Vos, Nest and the real Cloud-Riders appeared in the encampment, ambushing and quickly defeating all of the guards. After the deaths of both Vos and Beckett, Solo handed the coaxium over to Nest, who stated that such a large quantity of the valuable material would help fund a rebellion against the Empire. She gave one of the vials of coaxium, offering Han a chance to join her movement, which he politely refused, leaving Savareen.\nBacked by her Cloud-Riders, Nest delivered the coaxium acquired on Savareen to the Partisan leader Saw Gerrera. Meeting on the condition that Gererra come alone, Nest was vexed by sounds of another person from within his shuttle and the Cloud-Riders readied their weapons for a fight. Gererra diffused the situation by revealing the companion was his eleven-year-old ward, Jyn Erso. Jyn had wanted to accompany him, curious to observe the exchange; believing she needed to learn to survive the dangers of the Empire, Gerrera allowed it.\nWhile initially surprised by her presence, Nest saw much of her younger self in the young girl and sensed Jyn lost her innocence at a young age much as she had. Choosing to break with her custom of hiding her identity and age even from potential allies, she removed her mask to reveal she herself was very young. Nest asked Jyn if she thought her age protected her. When the girl said no, she warned Jyn that people would still underestimate her and advised she make them regret it. Redirecting their attentions to the true purpose of the meeting, Gerrera and Nest boarded his shuttle to negotiate the exchange of coaxium, leaving the Cloud-Riders behind to secure the ship. As Nest walked in, Jyn quietly told her that Gerrera would underestimate her, impressing the older woman with how quickly she learned.\nEnfys Nest wore gauntlets made of beskar armor plates that could be fanned out using a built-in servo and act as shields. She wore a battle helmet, previously worn by her mother which was made out of items stolen or scavenged by its owners and inscribed with a poetry extract reading \"Until we reach the last edge, the last opening, the last star, and can go no higher.\" Nest rode a Skyblade-330 model swoop bike. Enfys also made use of repulsorlift boosters strapped to her legs in order to increase her jumping ability. One of her most crucial weapons was her electroripper staff, which ran a current of energy through a coil in order to shred metal. Nest also had a carrier at her disposal named the Aerie, it could launch their swoop bikes from altitudes of 400 kilometers.\nEnfys Nest is a character created for the 2018 Star Wars Anthology film Solo: A Star Wars Story, portrayed by Erin Kellyman. The character was inspired by Maisie Williams' portrayal of Arya Stark in the Game of Thrones TV series. John Powell, the composer of Solo, created a unique musical theme for Enfys Nest, one of six new themes written for the film.\nErin was relatively unknown before getting cast on Solo, but casting director Nina Gold discovered her and gave her the role of Nest. To get the part, Kellyman made three auditions. Though she thought after the first one that she had messed up, she was called again. In her third audition, she met Han Solo's portrayer Alden Ehrenreich and they did a screen test together. Kellyman was also tested on how well she fought, and went through stunt tests just before her audition with Ehrenreich, though some of the stunts in the film were performed by Kellyman's stunt double Casey Michaels.\nOn her approach to the character, Kellyman was informed by the film's directors about Enfys' past life, including her mother, so she could understand what Nest got to become in what she later became.\nThe character's name was officially revealed on a Denny's-exclusive Topps trading card. A French trading card from LECLERC specified Nest's gender as female before the film's actual release. However, Star Wars Insider 180 referred to the character as a male, thus calling her he several times. Nest's gender was thus left a mystery until the film's release where Nest was revealed to be female.\nNest's height is listed as 1.87 meters in her Databank entry, whereas Solo: A Star Wars Story Official Sticker Collection provides a height of 1.88 meters and Solo: A Star Wars Story The Official Guide measures her at 1.67 meters. As Nest is visibly shorter than Tobias Beckett, with Beckett's height stated as 1.78 meters, this article currently assumes that Nest's height is 1.67 meters.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/The_Art_of_Solo:_A_Star_Wars_Story",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Tobias_Beckett_and_Other_Characters_From_the_Underworld",
  "/wiki/27_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Cloud-Riders",
  "/wiki/File:Enfys-Allies.ogg",
  "/wiki/Pirate",
  "/wiki/Crimson_Dawn",
  "/wiki/Battle_helmet",
  "/wiki/Enfys_Nest%27s_mother",
  "/wiki/Tobias_Beckett",
  "/wiki/Beckett%27s_gang",
  "/wiki/10_BBY",
  "/wiki/Han_Solo",
  "/wiki/Hyperspace",
  "/wiki/Coaxium",
  "/wiki/Heist_on_Vandor",
  "/wiki/Vandor",
  "/wiki/Weazel",
  "/wiki/Kessel",
  "/wiki/Savareen",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Jyn_Erso",
  "/wiki/Reproduction",
  "/wiki/Standard_year",
  "/wiki/Galactic_Republic",
  "/wiki/The_galaxy",
  "/wiki/Galactic_Empire",
  "/wiki/Galaxy",
  "/wiki/Five_Crime_Syndicates",
  "/wiki/Homeworld",
  "/wiki/11_BBY",
  "/wiki/Parent",
  "/wiki/Death",
  "/wiki/Armor",
  "/wiki/Vocabulator",
  "/wiki/Spice",
  "/wiki/Gargon",
  "/wiki/Swoop",
  "/wiki/Thief",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Andressa_Divo",
  "/wiki/Army",
  "/wiki/Identichip",
  "/wiki/Dryden_Vos",
  "/wiki/Heist_on_Hovun_IV",
  "/wiki/Dvorad",
  "/wiki/Hovun_IV",
  "/wiki/Space_station",
  "/wiki/Munt_Ontdal",
  "/wiki/Rampart_(Tobias_Beckett)",
  "/wiki/Val",
  "/wiki/Blaster",
  "/wiki/20-T_Railcrawler_conveyex_transport",
  "/wiki/Y-45_armored_transport_hauler",
  "/wiki/Rio_Durant",
  "/wiki/Bis_Refinery",
  "/wiki/Millennium_Falcon",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Hylobon_Enforcers",
  "/wiki/Shuttle",
  "/wiki/Starship",
  "/wiki/Beskar",
  "/wiki/Skyblade-330",
  "/wiki/Electroripper_staff",
  "/wiki/Carrier",
  "/wiki/Aerie_(carrier)",
  "/wiki/Kilometer",
  "/wiki/Jon_Kasdan",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Erin_Kellyman",
  "/wiki/John_Powell",
  "/wiki/Nina_Gold",
  "/wiki/Alden_Ehrenreich",
  "/wiki/2018_Leclerc_Solo:_A_Star_Wars_Story",
  "/wiki/Star_Wars_Insider_180",
  "/wiki/Databank",
  "/wiki/Solo:_A_Star_Wars_Story_Official_Sticker_Collection",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Beckett_1",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Read-Along_Storybook_and_CD",
  "/wiki/Solo:_A_Star_Wars_Story_(Golden_Book)",
  "/wiki/Solo:_A_Star_Wars_Story:_Train_Heist",
  "/wiki/Solo:_A_Star_Wars_Story_Sound_Book",
  "/wiki/Solo:_A_Star_Wars_Story:_Han_on_the_Run",
  "/wiki/Star_Wars:_Solo_Graphic_Novel_Adaptation",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_1",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_2",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_3",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_5",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_6",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_7",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Han_Solo_-_From_Smuggler_to_General",
  "/wiki/Choose_Your_Destiny:_A_Han_%26_Chewie_Adventure",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Flight_of_the_Falcon,_Part_1:_Spy_Games",
  "/wiki/Star_Wars_Adventures_(2017)_14",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Enfys_Nest",
  "/wiki/Category:Images_of_Enfys_Nest",
  "/wiki/StarWars.com",
  "/wiki/2018_Topps_Denny%27s_Solo:_A_Star_Wars_Story",
  "/wiki/Hasbro_Inc.",
  "/wiki/Solo:_A_Star_Wars_Story_(toy_line)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Entertainment_Weekly%27s_The_Ultimate_Guide_to_Han_Solo",
  "/wiki/Star_Wars",
  "/wiki/Solo:_A_Star_Wars_Story_Look_and_Find",
  "/wiki/Solo:_A_Star_Wars_Story_Ultimate_Sticker_Collection",
  "/wiki/Star_Wars_Insider_181",
  "/wiki/Solo:_A_Star_Wars_Story_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Insider_182",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars_Insider_183",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Insider_184",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Convergence_(Star_Wars:_Destiny)",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Enfys_Nest_and_the_Cloud-Riders",
  "/wiki/Star_Wars_Insider_195",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_71",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2023",
  "/wiki/Databank_(website)",
  "/wiki/Raid_on_Gargon",
  "/wiki/C.R.C.",
  "/wiki/Galactic_standard_calendar",
  "/wiki/April_18",
  "/wiki/File:KasdanStarkTweet.png",
  "/wiki/May_18",
  "/wiki/October_2"
 ]
}