{
 "name": "Engels",
 "display_name": "Engels",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish-brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Military",
      "Imperial Military"
     ]
    }
   ]
  }
 ],
 "content": "Engels was a male human who served as an officer in the military of the Galactic Empire. At the time of the early rebellion against the Empire, he had the rank of captain, and was in charge of a metal factory hovering in the atmosphere of Dooma 4, supervising the production of the entire facility.\nAt one point, the factory was assaulted by the notorious rebel Saw Gerrera and his Partisans, who were hoping to retrieve classified information. Engels let a subordinate lead the stormtroopers and Death troopers against the rebels, watching the battle via security cameras. As the struggle raged outside, the captain's men caught Gerrera's lieutenant, Megyn Soone, who had just placed explosive charges inside the factory. Engels, who had read many files about Gerrera and his troubled past—including the tragic death of his sister Steela—hoped he could use the capture of Soone to his advantage. He contacted Gerrera directly via comlink, informing him that Soone lay in his clutches, and that he would let her go if the Rebel told him where the charges were placed. In response, Gerrera offered Engels a seemingly better deal: he would not only deliver the charges' detonator in person, but also surrender and trade places with Soone. At the  meeting place, a triumphant Engels came to proceed with the exchange, but instead of surrendering, Gerrera activated the detonator. The charges then exploded, destroying the stabilizers that maintained the factory in the air. As the station started crashing with everyone on board, Engels called Gerrera crazy, thinking he had effectively committed suicide. However, the Rebel had a plan, for an allied U-wing blasted a hole in the station's wall, acreating an escape route for him and Soone. The Imperial captain attempted to escape, but Gerrera caught him by the leg, and the two engaged in a brief struggle during which the Rebel managed to steal Engels' code cylinder. At the eleventh hour, Gerrera and Soone hopped into the hovering U-wing, leaving the crumbling station and abandoning Engels to his fate.\nEngels was a broad-shouldered male human with light skin and blue eyes. He had a prominent nose and a square jaw. Although completely bald or shaven, he sported black eyebrows and a reddish-brown mustache. Even when talking to an enemy, Engels maintained an air of affability and calm, which he only lost when the station started crashing.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Military",
  "/wiki/Imperial_officer",
  "/wiki/Captain",
  "/wiki/Atmosphere",
  "/wiki/Dooma_4",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Stormtrooper",
  "/wiki/Death_trooper",
  "/wiki/Lieutenant",
  "/wiki/Megyn_Soone",
  "/wiki/Death",
  "/wiki/Steela_Gerrera",
  "/wiki/Comlink",
  "/wiki/Limb",
  "/wiki/Imperial_code_cylinder",
  "/wiki/Star_Wars_Rebels_Animation",
  "/wiki/Crossing_the_Line",
  "/wiki/Star_Wars_Rebels_Animation_4"
 ]
}