{
 "name": "Engi Golba",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Didyma V"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Didynon"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Exegol landing team",
      "Exegol landing team"
     ]
    }
   ]
  }
 ],
 "content": "Engi Golba was a Didynon male from the world Didyma V. He originally worked as a miner, setting explosives in the lommite mines, but escaped his home when it was annexed by the First Order. Golba joined the Resistance, utilizing his talents with explosives. In 35 ABY, he was part of the Resistance's landing team who fought Sith Eternal forces on the surface of the Steadfast command ship during the Battle of Exegol.\nEngi Golba hailed from the terrestrial world of Didyma V. He worked as a miner there, planting explosives in lommite mines in order to open new tunnels. When the First Order arrived and took over production when they annexed the world, he fled the mines and eventually joined the Resistance, bringing his skills in using explosives with him.\nIn 35 ABY, he was stationed at the Resistance's base on the jungle moon Ajan Kloss when Generals Poe Dameron and Finn briefed the Resistance on their mission to the planet Exegol, aiming to eliminate the fleet of the Sith Eternal and First Order. Golba was a member of the Resistance's landing team, whose main objective was to sabotage a navigation tower which would allow the fleet to depart the planet.\nThe team traveled to Exegol in a YC-123B transport hauler, the Fortitude. Upon arriving however, the Sith fleet switched the navigation signal to the Steadfast command ship. General Finn then ordered the transport to land on the Steadfast instead. The landing team was then deployed on the starship and they began advancing towards the tower. Sprinting behind a Talpiddian, Golba assisted in engaging the Sith troopers and jet troopers that had arrived to defend the tower. Eventually, Finn and former stormtrooper Jannah disabled the signal, and Golba and the landing team retreated to the Fortitude. Ultimately, the Resistance won the battle and returned to Ajan Kloss for celebrations.\nGolba was a Didynon male with white skin. With his skills in utilizing explosives, he had a passion for destroying First Order property.\nGolba was talented with explosives, using them in lommite mines and later in the destruction of First Order equipment.\nGolba wore a brown robe over tattered clothing. In addition to keeping explosives on his person, he carried an EL-16HFE blaster rifle for combat.\nEngi Golba appeared in the 2019 film Star Wars: Episode IX The Rise of Skywalker, and was identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, written by Pablo Hidalgo. The character was played by singer-songwriter Ed Sheeran, who also played a First Order stormtrooper in the film. Concept art of the Didynon species, titled \"Two Alien Wizards 80,\" was drawn by Martin Rezard.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Didyma_V",
  "/wiki/Didynon",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Exegol_landing_team",
  "/wiki/Planet",
  "/wiki/Miner",
  "/wiki/Lommite",
  "/wiki/Annexation_of_Didyma_V",
  "/wiki/First_Order",
  "/wiki/35_ABY",
  "/wiki/Sith_Eternal",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Command_ship",
  "/wiki/Battle_of_Exegol",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Jungle",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/General",
  "/wiki/Poe_Dameron",
  "/wiki/Finn",
  "/wiki/Exegol",
  "/wiki/Final_Order",
  "/wiki/YC-123B_transport_hauler",
  "/wiki/Fortitude_(transport)",
  "/wiki/Sith",
  "/wiki/Transport",
  "/wiki/Starship",
  "/wiki/Talpiddian",
  "/wiki/Sith_trooper",
  "/wiki/Sith_Jetpack_Trooper",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Jannah",
  "/wiki/Robe",
  "/wiki/EL-16HFE_blaster_rifle",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Ed_Sheeran",
  "/wiki/Species",
  "/wiki/Martin_Rezard",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_(Screen_Comix)",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/Neal_Scanlan:_A_Force_Reawakended",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Disney%2B",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY",
  "/wiki/Star_Wars",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker"
 ]
}