{
 "name": "Eno Cordova",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Cere Junda"
     ]
    }
   ]
  }
 ],
 "content": "Eno Cordova was a human male Jedi Master who served the Jedi Order as a scholar and archaeologist with a deep interest in ancient civilizations. Serving as the master of Cere Junda during her years as a Padawan, Cordova became obsessed with the Zeffo after first encountering the ruins of one of their temples on the planet Ontotho. Sometime during the Clone Wars, while meditating inside an ancient vault on Bogano, Cordova was given a vision of the fall of the Jedi Order. To preserve the future of the Jedi, he hid a holocron containing the location of all Force-sensitive children within the Bogano Vault, and entrusted everything he had learned during his journeys to his droid, BD-1, hoping that Junda or some other Jedi would continue his mission if he should fail.\nEno Cordova was trained by the Jedi Order in the ways of the Force, learning to wield it as an ally alongside his blue-bladed lightsaber. A student of ancient history and an explorer at heart, Cordova's service to the Order and the Republic led him across the galaxy to many worlds where he met many representatives of strange cultures and species. Among the contacts he made during his career was the Wookiee chieftain Tarfful of Kashyyyk. After attaining a reputation of a learned scholar, Cordova was granted the rank of Jedi Master and took Cere Junda as his Padawan.\nAt some point before the Clone Wars, the Jedi High Council sent Cordova and Junda to oversee the excavation of a temple on Ontotho. However, in the process, they were caught up in a battle waged between the Fylar Freedom Fighters and local security forces.\nPursuing rumors and legends, Cordova's pursuit of the Zeffo led him to their ancient homeworld Zeffo, where he eventually discovered a towering edifice which served as the final resting place of the Zeffo Sage Eilram. Within the depths of the tomb, Cordova uncovered clues which led him to believe the Zeffo had once traveled to Kashyyyk. Armed with this knowledge, Cordova sought out his old friend Tarfful for wisdom surround this mystery.\nWhile exploring an ancient Zeffo temple, Cordova received a vision of the fall of the Jedi Order and rushed back to Coruscant to warn the Jedi Council. None of the Council were convinced and disregarded his vision, with the only member of the Order who believed him being Jocasta Nu, his trusted confidante during his time at the Jedi Temple. Nu entered the Archives and created a copy of a holocron which listed all potential Force-sensitive children across the galaxy and gave it to Cordova to protect. Cordova hid the holocron in a Zeffo Vault on Bogano, a largely unexplored planet where it would be safe from the Galactic Empire.\nCordova, sensing his life would soon come to an end, had his trusted companion droid BD-1 record video messages detailing his journeys across Bogano, Zeffo, Kashyyyk, and Dathomir. Cordova hoped these holographic messages would guide a new Jedi to retrieve and unlock the holocron so that the Jedi Order could be rebuilt following the Great Jedi Purge. Cordova warned that, in order to prevent the messages from being accessed by the Empire, he would have to encrypt them, essentially meaning BD-1 would have to lose his memories in order to protect the information. The droid agreed, and Cordova parted ways with his trusted friend, sending BD to find the savior of the Jedi.\nCordova's former apprentice Cere Junda was eventually captured by the Empire while trying to lead them away from her own apprentice Trilla Suduri and a group of younglings. During her torture, Cere was forced to give up their location, but the Empire was particularly interested in any information relating to Cordova.\nBD-1 eventually encountered Cal Kestis, a Jedi Padawan who had survived Order 66 by hiding out as a scrapper on Bracca, when Cere Junda took Cal to the Bogano Vault. BD showed Kestis Cordova's first message and accompanied him on his adventures through the galaxy, with each success building the trust between the droid and the Jedi and subsequently unlocking more of Cordova's messages.\nTrilla Suduri, who by now had been forcibly turned into an Inquisitor, had recently come up against Cal and her old master. In her subsequent investigation, she learned of Cal and Cere's quest to find Cordova's holocron. She thus travelled to Zeffo and awaited to confront Kestis in one of the excavated caverns. When confronting him she revealed her knowledge of his quest and taunted him about the location of the holocron.\nIn the 2019 video game Star Wars Jedi: Fallen Order, Eno Cordova is portrayed in both voice and likeness by Tony Amendola. The design team of Respawn Entertainment explored unconventional visual elements for Cordova's clothing but eventually settled on clothing that resembled the classic Jedi aesthetic. Some early concepts depicted him as a Cerean. Concept art for Eno Cordova was done by artist Amy Fry.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Jedi_Fallen_Order_-_Dark_Temple",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Eno_Cordova",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Cere_Junda",
  "/wiki/Jedi_Master",
  "/wiki/Archaeologist",
  "/wiki/Padawan",
  "/wiki/Zeffo_(species)",
  "/wiki/Temple_on_Ontotho",
  "/wiki/Planet",
  "/wiki/Ontotho",
  "/wiki/Clone_Wars",
  "/wiki/Bogano_Vault",
  "/wiki/Bogano",
  "/wiki/Force_vision",
  "/wiki/Eno_Cordova%27s_holocron",
  "/wiki/Force-sensitive",
  "/wiki/BD-1",
  "/wiki/Jedi",
  "/wiki/The_Force",
  "/wiki/Eno_Cordova%27s_lightsaber",
  "/wiki/The_galaxy",
  "/wiki/Wookiee",
  "/wiki/Chief",
  "/wiki/Tarfful",
  "/wiki/Kashyyyk",
  "/wiki/Jedi_High_Council",
  "/wiki/Battle_for_Ontotho",
  "/wiki/Fylar_Freedom_Fighters",
  "/wiki/Daa_Security_Forces",
  "/wiki/Zeffo",
  "/wiki/Tomb_of_Eilram",
  "/wiki/Zeffo_Sage",
  "/wiki/Eilram",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Coruscant",
  "/wiki/Jocasta_Nu",
  "/wiki/Imperial_Palace",
  "/wiki/Jedi_Archives",
  "/wiki/Galactic_Empire",
  "/wiki/Dathomir",
  "/wiki/Hologram",
  "/wiki/Second_Sister",
  "/wiki/Cal_Kestis",
  "/wiki/Order_66",
  "/wiki/Bracca",
  "/wiki/2019",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Tony_Amendola",
  "/wiki/Respawn_Entertainment",
  "/wiki/Cerean",
  "/wiki/Amy_Fry",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_1",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_2",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_3",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_4",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_5",
  "/wiki/Category:Images_of_Eno_Cordova",
  "/wiki/StarWars.com",
  "/wiki/The_Art_of_Star_Wars_Jedi:_Fallen_Order",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets"
 ]
}