{
 "name": "Entora_Zar",
 "display_name": "Entora Zar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Terephon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "40 ABY",
      "Terephon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hapan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hapes Consortium"
     ]
    }
   ]
  }
 ],
 "content": "Entora Zar was a Hapan native of the planet Terephon where she served at Villa Solis, the private hunting retreat of Ducha Galney. Not only was Zar, in her own opinion, the Ducha's favorite riding companion, she was also a qualified flying instructor and the keeper of the hunting murgs kept by Galney at the back of the Villa.\nEntora Zar was unwittingly involved in the Heritage Council's plot to overthrow Queen Mother Tenel Ka. A squat, stunted woman, Zar was left behind by her mistress, Ducha Galney, to act as a decoy for Jedi Knights Jaina Solo and Zekk. Galney was in fact one of the ringleaders of the plot, and knew she could not meet the Jedi in person, so she aimed to have them killed. Unfortunately for Zar, Galney was willing to go to any length to murder the two Jedi.\nWhen the Jedi Knights arrived, Zar did not open the gates to the villa. When they began to cut through with their lightsabers, she hastily opened the gate, and engaged them in a discussion about piloting skills in an attempt to keep them occupied. Zar revealed she could fly on her holosimulator Naboo N-1 starfighters, Mark One Headhunters and the Xi Char DFS, but was cut off by the Jedi, searching for the Ducha. She informed them that the Ducha left shortly after their arrival and proceeded to order them to leave the premises. When Jaina and Zekk began to search for the Ducha, Zar was unable to stop them; they drew too close to the underground hangar where Galney was hiding, and Zar's mistress left in her luxury yacht.\nEntora Zar then stopped the Jedi from killing the precious hunting murgs she cared for, but did not survive the trap left by Galney. Two YVH droids confronted the group. Entora stepped in the lead droid's path, attempting to reason with it, but was fatally wounded by the emotionless YVH. Her lifeless body was dragged off by one of her faithful murgs.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Terephon",
  "/wiki/40_ABY",
  "/wiki/Hapan",
  "/wiki/Gender/Legends",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Villa_Solis",
  "/wiki/Galney_(Ducha_of_Terephon)",
  "/wiki/Murg",
  "/wiki/Heritage_Council",
  "/wiki/Queen_Mother",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Zekk",
  "/wiki/Jedi/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Holosimulator",
  "/wiki/Naboo/Legends",
  "/wiki/N-1_starfighter/Legends",
  "/wiki/Z-95mk1_Headhunter",
  "/wiki/Xi_Char/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Hangar/Legends",
  "/wiki/YVH-Series_battle_droid",
  "/wiki/2-20",
  "/wiki/Legacy_of_the_Force:_Tempest"
 ]
}