{
 "name": "Eogan_Truax",
 "display_name": "Eogan Truax",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "49 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Eogan Truax was the sixteen-year-old Human male son and fellow prisoner of Artagan Truax at the Cog Hive Seven prison in the year 33 BBY. He had red-brown hair and pale-green eyes.\nBorn in 49 BBY, Eogan Truax was the son of Artagan Truax and lived in the Cog Hive Seven prison. After saving the life of a man called Iram Radique from an assassination, Artagan fled the scene with his son, Eogan. Eogan Truax was taken to the Prison Cog Hive Seven by his father when they were being hunted down by the  the Bando Gora Cult. Artagan Truax, wanting to leave the cult life behind him looked to Radique for help and support in order to protect his son. But the deal offered to him was disturbing and so he declined his support.\nHe and his son remained in Cog Hive Seven for years until he payed one of the guards to set them free and to have the bombs removed from their chests. The plan didn't work however, they were recaptured and Artagan was wounded. Eogan had been trained by his father thoroughly to fight to the death with any opponent, but his father could not see the same merciless energy and desire to win and conquer that he himself possessed in his son, and so thought Eogan would most definitely die if he was put into a death match.\nArtagan eventually died from the wounds he had, getting a bad case of blood poisoning, and a diabolical fever. Eogan was somehow able to survive the destruction of Cog Hive Seven however, by getting a lift with the crazy ex-Jedi Apprentice of Count Dooku, Komari Vosa, and the Sith Assassin at the time, Maul.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/49_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Artagan_Truax",
  "/wiki/Cog_Hive_Seven",
  "/wiki/Prison/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Iram_Radique",
  "/wiki/Mission_to_Cog_Hive_Seven",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Eogan_Truax",
  "/wiki/Maul:_Lockdown",
  "/wiki/Maul:_Lockdown_(audiobook)"
 ]
}