{
 "name": "Eon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Mottled brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Eon was a humanoid, male Jedi serving the Jedi Order and Galactic Republic during the Clone Wars. Around 19 BBY, Eon was promoted to the rank of Jedi Knight and was placed under Jedi Master and General Ki-Adi-Mundi's charge. He was dispatched to the planet Mygeeto along with Republic troopers to attack the world's Separatist base. During the battle, Eon and his fellow Jedi managed to force the Separatists into retreat. However, a Venator-class Star Destroyer was disabled and began to plummet towards the planet's surface. One of Eon's fellow Knights, Rivi-Anu, used the Force to delay the ship's crash, enabling Eon and his allies to escape to a safe distance. After Rivi-Anu was crushed by the Star Destroyer as it finished its descent to the surface, Eon and Mundi acknowledged Rivi-Anu's self-sacrifice.\nThe humanoid, male Eon was born during the final decades of the Galactic Republic. He was trained in the ways of the Force by the Jedi Order. Around 19 BBY, during the galaxy-wide conflict between the Republic and the Confederacy of Independent Systems known as the Clone Wars, Eon was promoted to the rank of Jedi Knight, because of the Republic's increasing need for Knights in the war.\nDuring that same year, Eon, along with the Jedi Rivi-Anu, a Twi'lek Jedi, and a Human Jedi, was placed under Jedi Master and General Ki-Adi-Mundi's command. Eon and his fellow Jedi were dispatched to the planet Mygeeto during the Republic's sieges in the Outer Rim Territories to combat forces of the Separatist Droid Army. Eon and his fellow Jedi had concerns about their status as Knights, which they related to Rivi-Anu, who spoke with Mundi about the issue.\nEventually, Eon participated in a battle alongside Ki-Adi-Mundi and his fellow Jedi against the Separatists. As they were pushing their enemies into retreat, a Republic Venator-class Star Destroyer, which had been crippled by the Separatists, plunged down through the atmosphere, threatening the forces on the surface. Eon, his fellow Jedi, and the forces under their command, retreated to safety as Rivi-Anu used the Force to delay the ship's plummet from orbit. After Eon and his allies successfully reached safety, Rivi-Anu lost control of the ship, leaving it to crush her when it crashed on the surface. After her death, both Eon and Mundi noted Rivi-Anu's self-sacrifice.\nEon was a humanoid male who had mottled brown skin, black eyes, no hair, and a sharp set of teeth. Along with his fellow Jedi, Eon was concerned about his youth and status as a Jedi Knight, due to the fact that his training was rushed because of the increasing need for Jedi Knights among the Republic forces. He was also scared of going into the upcoming battle against the Separatists. Mundi, however, had faith in Eon and his allies' abilities as Jedi Knights. After Rivi-Anu's death, Eon made it a point to note Rivi-Anu's self-sacrifice.\nEon was sensitive to the Force. During the fighting on Mygeeto, he destroyed multiple battle droids and was capable of deflecting blaster bolts with his lightsaber.\nEon wore a set of brown Jedi robes and used a lightsaber containing a blue crystal during Battle of Mygeeto.\nEon was introduced in the short story \"To the Vanishing Point,\" which was one of four stories compiled in the sixth volume of the Clone Wars Adventures trade paperbacks. The character was created and drawn by Matthew and Shawn Fillbach. In \"To the Vanishing Point,\" the battle n which Eon participated was implied to have taken place on a different world from Mygeeto. However, The Complete Star Wars Encyclopedia later established that the events of the story took place on Mygeeto. This article assumes the latter to be correct.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/To_the_Vanishing_Point",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Knighting_ceremony/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mygeeto/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Battle_of_Mygeeto",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Rivi-Anu",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Death/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Unidentified_Twi%27lek_Jedi_(Clone_Wars)",
  "/wiki/Unidentified_young_Human_Jedi",
  "/wiki/Outer_Rim_Sieges/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Tooth/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_6",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Matthew_Fillbach",
  "/wiki/Shawn_Fillbach",
  "/wiki/Star_Wars_Insider",
  "/wiki/Drawn_By_The_Force",
  "/wiki/Star_Wars_Insider_89",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_New_Essential_Chronology"
 ]
}