{
 "name": "Ephin Sarreti",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Remnant"
     ]
    }
   ]
  }
 ],
 "content": "Ephin Sarreti was a human male politician who was the Grand Moff of the Imperial Remnant from 19 ABY. As the Moff of the Braxant sector, Sarreti was relatively progressive and was a loyal supporter of Grand Admiral Gilad Pellaeon.\nSarreti and his family were from Coruscant. He was young at the time of the Battle of Endor, while he came of age in the midst of the the Rebellion. Following the fall of Coruscant to the New Republic, his family fled offworld, eventually arriving on Sartinaynian. After settling on the planet, he entered Imperial service.\nFollowing the arrest of Moff Vilim Disra in 19 ABY for his complicity in the Caamas Document affair, the Council of Moffs appointed Sarreti to take his place as Moff of the Braxant Sector, which included the Remnant's capital world, Bastion.\nSarreti served as Moff throughout the Yuuzhan Vong War. He supported Grand Admiral Gilad Pellaeon's plan to aid the New Republic in the conflict, arguing that it was the right thing to do. He also offered to accompany Pellaeon in a military capacity, but Pellaeon declined, as the Grand Admiral felt he needed an ally in Imperial Space to keep the other Moffs loyal.\nPrior to the Battle of Ithor, he traveled with several other Moffs to the planet for a diplomatic reception with their New Republic counterparts. His enthusiasm and knowledge about the lives of Chief of State Borsk Fey'lya and his advisors raised their suspicions.\nAfter the Battle of Bastion, from which he escaped with a broken arm, Sarreti supported Pellaeon's stance that the Remnant align with the Galactic Alliance and conduct an offensive campaign against the Yuuzhan Vong.\nBy 40 ABY, Sarreti was one of the few Moffs that Pellaeon still trusted as of the Second Battle of Fondor.\nDecades later, the Fel Empire honored Sarreti by naming a Star Destroyer after him.\nSarreti's relative youth and experiences meant that he never met Emperor Palpatine, and was not as enmeshed in Palpatine's prejudices. As he had joined Imperial service during its decline, he did not view the recent past through the lenses of melancholy and fury that his elders amongst the Moffs, such as Kurlen Flennic, often did. This detachment allowed him to advocate moves that drew opposition from other Imperials, such as allying with the Galactic Alliance. Even so, he was not a fan of democracy.\nSarreti was completely loyal to Pellaeon; after the meeting where Pellaeon announced the mobilization of all reserve forces, he asked to accompany the Grand Admiral in a military capacity. Pellaeon trusted Sarreti to keep the peace in Imperial Space while the Grand Admiral was away on campaign and considered the young man a builder.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ephin_Sarreti_(Star_Destroyer)",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Politics/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Braxant_sector",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Rebellion_era",
  "/wiki/Liberation_of_Coruscant_(Galactic_Civil_War)",
  "/wiki/New_Republic/Legends",
  "/wiki/Bastion/Legends",
  "/wiki/Vilim_Disra",
  "/wiki/Caamas_Document_Crisis",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Imperial_Space",
  "/wiki/Battle_of_Ithor",
  "/wiki/Ithor/Legends",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Borsk_Fey%27lya",
  "/wiki/New_Republic_Advisory_Council",
  "/wiki/Battle_of_Bastion",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/40_ABY",
  "/wiki/Second_Battle_of_Fondor",
  "/wiki/Fel_Empire",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Kurlen_Flennic",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_I:_Remnant",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/25_ABY/Legends",
  "/wiki/29_ABY/Legends",
  "/wiki/Crowal",
  "/wiki/Freyborn",
  "/wiki/41_ABY",
  "/wiki/Drikl_Lecersen",
  "/wiki/Quille",
  "/wiki/Rosset",
  "/wiki/Siralt"
 ]
}