{
 "name": "Ephraim_Bridger",
 "display_name": "Ephraim Bridger",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lothal"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Approximately 3 BBY",
      "during a revolt in an Imperial prison"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Copper"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bridger family"
     ]
    }
   ]
  }
 ],
 "content": "Ephraim Bridger was a human male dissident during the height of the Galactic Empire from the Outer Rim planet of Lothal. He and his wife, Mira, spoke out against the rule of the Empire by broadcasting revolutionary messages on Lothal, actions that were supported by the planet's governor, Ryder Azadi. As a result of their broadcasts, the Bridgers and Azadi were arrested and imprisoned by the Empire. This left their son, Ezra, to fend for himself on Lothal for nearly a decade. Ezra eventually became part of a rebel cell on Lothal and broadcasted his own message of rebellion to the planet's citizens. This broadcast reached the Imperial prison were Ephraim and Mira were being held, inspiring them to lead a prison revolt. Dozens of prisoners escaped with the Bridgers' help, but Ephraim and Mira were killed during the escape.\nEphraim Bridger married Mira Bridger and the two had a son, Ezra, who was born on the day that the Galactic Empire was founded. After the Empire took control of their homeworld of Lothal, a planet in the Outer Rim Territories, Ephraim and Mira became revolutionaries in 18 BBY when they began sending out underground broadcasts that spoke out against the Empire's activities on their planet. They were supported by Lothal's governor, Ryder Azadi.\nTheir transmissions reached Milo and Lina Graf who eventually made their way to Lothal on their ship the Whisper Bird. Ephraim would subsequently rescue the two as they were making their escape from the Twin Horn Syndicate. He and Mira aided them in deducing the fact that a bounty hunter named The Shade was after the siblings and had actually been manipulating them just earlier before. Together, they concocted a plan to get the bounty hunter off their trail which would allow the siblings to escape Lothal. Unfortunately, the plan failed and the siblings together with their pet Morq and droid CR-8R were captured and flown off. Chastised but not ready to accept defeat yet, Ephraim would contact Ryder Azadi for assistance.\nAs a result of their activities, the Empire sent stormtroopers after Ephraim and Mira, and the soldiers took them away to be imprisoned on the charge of treason; Governor Azadi was also arrested for his support of their broadcasts. Tseebo, a Rodian on Lothal who was a close friend of Ephraim and Mira, promised to look after Ezra, but he was too afraid and failed to do so, leaving Ezra to live on his own for several years.\nYears later, while still in prison, Ephraim and Mira learned that Ezra had become part of a rebel cell that fought the Empire on Lothal. He transmitted a message of rebellion to the people of Lothal that reached other worlds in the Outer Rim, and even made its way to the prison where the Bridgers were being held. Ephraim and Mira, who always tried to help their fellow prisoners, could tell that the voice in the broadcast was their son because of his words. They were inspired by what he said and organized a prison break. Dozens of prisoners, including Azadi, were able to escape with their help, but the Bridgers were separated and refused to leave until everyone else had escaped. By the time the others were free, it was too late for Ephraim and Mira—they gave their lives so others could be free.\nWhile Ephraim and Mira were in captivity, Ezra initially did not want to learn what happened to them, as he believed he would not have been able to survive alone on Lothal if he held out hope that they would return to him. However, he began to learn more after finding Tseebo and learning that the Rodian had volunteered his services to the Imperial Information Office in the hopes of making up for his failure to help the Bridgers. Tseebo wore a device known as the AJ^6 cyborg construct that gave him access to sensitive information, and he learned that the Bridgers had been imprisoned. Ezra did not learn about this initially, but was later told the truth by his Jedi teacher, Kanan Jarrus, and rebel captain Hera Syndulla. This truth coincided with a vision of his parents that led him back to Lothal, which he and the rebels had previously abandoned.\nOnce on Lothal, Ezra met Azadi, who returned to find Ezra and tell him what happened to his parents. Ezra was grateful to know the truth, but was nonetheless saddened by the loss of his parents. Ezra had another vision after learning of their fates, where he saw Ephraim and Mira through the Force. They told him they were proud of him and urged him to remain strong. Ezra was confused as to how he could see his parents, but Jarrus told him that Jedi philosophy taught that life did not end at death but merely transformed into something new in the Force. Ephraim and Mira would always be with him.\nIn 0 BBY, during the Liberation of Lothal, Ezra was welcomed aboard the Chimaera to talk with Emperor Sheev Palpatine about an offer he wanted to make. Attempting to lure the young Padawan to his trap by enter into the remains of the Lothal Jedi Temple, Bridger heard the voice of Ephraim, calling him out. However, Ezra realized that it was just a lie because he sensed his parents' death and turned down Palpatine's offer before calling the purrgil to remove Grand Admiral Thrawn's Imperial forces from Lothal.\nEphraim Bridger was a human male with black hair, blue eyes, and copper skin. He was opposed to the rule of the Galactic Empire on Lothal and spoke out against them, at the cost of his own freedom. Even while imprisoned, he and Mira continued to fight for others, up until the point that their lives were lost in ensuring other prisoners could escape from Imperial captivity.\nEphraim Bridger was first heard, and pictured in a hologram, in \"Empire Day\" and \"Gathering Forces,\" episodes of the first season of the animated television series Star Wars Rebels. He is voiced by actor Dee Bradley Baker. The character was first depicted in non-holographic form in the young reader novels Adventures in Wild Space: The Steal and Adventures in Wild Space: The Dark, which take place chronologically many years before the events of Star Wars Rebels.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Adventures_in_Wild_Space:_The_Steal",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Adventures_in_Wild_Space:_The_Dark",
  "/wiki/Lothal",
  "/wiki/3_BBY",
  "/wiki/Revolt_in_an_Imperial_prison",
  "/wiki/Galactic_Empire",
  "/wiki/Prison",
  "/wiki/Human",
  "/wiki/Lothalite",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bridger_family",
  "/wiki/Imperial_Era",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Marriage",
  "/wiki/Mira_Bridger",
  "/wiki/Governor",
  "/wiki/Ryder_Azadi",
  "/wiki/Ezra_Bridger",
  "/wiki/Standard_decade",
  "/wiki/Spectres",
  "/wiki/Ezra%27s_broadcast",
  "/wiki/Prisoner",
  "/wiki/Death",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Homeworld",
  "/wiki/18_BBY",
  "/wiki/Milo_Graf",
  "/wiki/Lina_Graf",
  "/wiki/Whisper_Bird",
  "/wiki/Broken_Horn_Syndicate",
  "/wiki/Bounty_hunter",
  "/wiki/Shalla_Mondatha",
  "/wiki/Morq",
  "/wiki/CR-8R",
  "/wiki/Stormtrooper",
  "/wiki/Treason",
  "/wiki/Tseebo",
  "/wiki/Rodian",
  "/wiki/Standard_year",
  "/wiki/Imperial_Information_Office",
  "/wiki/AJ%5E6_cyborg_construct",
  "/wiki/Jedi",
  "/wiki/Kanan_Jarrus",
  "/wiki/Captain",
  "/wiki/Hera_Syndulla",
  "/wiki/Force_vision",
  "/wiki/The_Force",
  "/wiki/0_BBY",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Chimaera",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Padawan",
  "/wiki/Lothal_Jedi_Temple",
  "/wiki/Purrgil",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Hologram",
  "/wiki/Empire_Day_(episode)",
  "/wiki/Gathering_Forces",
  "/wiki/Star_Wars_Rebels_Season_One",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Adventures_in_Wild_Space:_Books_1%E2%80%933",
  "/wiki/Adventures_in_Wild_Space:_The_Cold",
  "/wiki/Adventures_in_Wild_Space:_The_Rescue",
  "/wiki/Adventures_in_Wild_Space:_Books_4%E2%80%936",
  "/wiki/Ezra%27s_Gamble",
  "/wiki/Star_Wars_Rebels_(webcomic)",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion",
  "/wiki/Fighter_Flight",
  "/wiki/TIE_Fighter_Trouble",
  "/wiki/Ezra%27s_Duel_with_Danger",
  "/wiki/Path_of_the_Jedi",
  "/wiki/Vision_of_Hope",
  "/wiki/Call_to_Action",
  "/wiki/Battle_to_the_End",
  "/wiki/Fire_Across_the_Galaxy",
  "/wiki/Legacy_(episode)",
  "/wiki/A_Princess_on_Lothal",
  "/wiki/Legends_of_the_Lasat",
  "/wiki/Twilight_of_the_Apprentice",
  "/wiki/Maul:_A_Star_Wars_Rebels_Cinestory_Comic",
  "/wiki/An_Inside_Man",
  "/wiki/Trials_of_the_Darksaber",
  "/wiki/A_World_Between_Worlds",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/StarWars.com",
  "/wiki/A_New_Hero",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Rebels_Recounted",
  "/wiki/Star_Wars_Insider_155",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_8",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Helmets",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Databank_(website)"
 ]
}