{
 "name": "Ephran Zell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ephran Zell was a Human male Imperial archaeologist who resided on Korriban during the Cold War with the Galactic Republic.\nBorn into a long line of researchers and archaeologists serving the Sith Empire, Ephran Zell served the Empire by assisting in the excavation of the Valley of the Dark Lords during the Cold War with the Galactic Republic. Working inside the tomb of Sith Lord Tulak Hord, Zell longed to uncover the secrets of Hord's ancient Red Engine, a machine of untold power. According with Zell, Tulak Hord's tomb was build with exact specification provided by Hord himself to hold the Red Engine. While most scholars at the nearby Sith Academy believed the machine to be incomplete, Zell had evidence that those Sith who had tried to activate it had failed to fully understand the mystery of the engine. While Zell was not an educated man, he believed that the machine needed blood of the tomb's beasts and the hatred of a true Sith to activate the machine. When a passing Sith Acolyte agreed to undertake Zell's challenge of venturing into the tomb and turning on the machine, Zell was eventually proven right when the Acolyte returned with the hidden teachings from the machine.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Archaeologist/Legends",
  "/wiki/Korriban",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Archaeology/Legends",
  "/wiki/Valley_of_the_Dark_Lords/Legends",
  "/wiki/Tomb_of_Tulak_Hord",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Tulak_Hord",
  "/wiki/Red_Engine",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Sith_Acolyte",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}