{
 "name": "Ephru_Shinn",
 "display_name": "Ephru Shinn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council"
     ]
    }
   ]
  }
 ],
 "content": "Ephru Shinn was a Mon Calamari female who served on the Jedi High Council in 232 BBY. She participated in a debate about Jedi interference in military matters regarding the Nihil threat, where she opined that as Jedi involvement in such matters had only ever complicated such situations, it was important to keep the peace in the galaxy. Jedi Master Yarael Poof disagreed with Shinn, noting that justice was just as important as peace, but the Mon Calamari did not back down on her argument.\nEphru Shinn was a Mon Calamari female member of the Jedi Order during the High Republic Era. She was selected by Yoda as a temporary replacement on the Jedi High Council while the ancient Jedi Master went on a sabbatical from Council matters.\nWhen the Council convened to discuss the threat of the Nihil in 232 BBY, the Mon Calamari countered her colleagues, among them Oppo Rancisis and Yarael Poof, who had been discussing Jedi military history. She instead raised a hand and told the Council to focus on the present and on ensuring peace in the galaxy. However, Shinn's argument of maintaining peace was brought into question by Poof, who felt that justice was as essential an ideal as peace to the Jedi.\nShinn further spoke of her belief that past Jedi interventions in galactic governance and military matters only ever complicated matters. Jedi Grandmaster Lahru then rhetorically asked whether the Jedi should refrain from interfering in galactic military affairs if only for simplicity's sake, reminding the Mon Calamari that the galaxy was not a simple place. The debate went on, and the matter of including Jedi in a mission against the Nihil was voted on; the result was in support of having Jedi aid the mission, with six council members supporting and five opposing.\nEphru Shinn felt strongly that the Jedi should strive to present a peace-centered way of life and that it was important to focus on the role of the Jedi in the present-day Republic instead of on ancient history. She even pushed back to Master Poof's argument that peace required justice alongside it, maintaining that the only thing Jedi involvement in military matters achieved was more complications. Shinn had orange skin and yellow eyes.\nThe Mon Calamari wore a beige robe underneath her white-and-gold Jedi robes along with brown shoes.\nEphru Shinn appeared in the 2021 novel Light of the Jedi, written by Charles Soule as part of the Star Wars: The High Republic multimedia series. An image of Shinn alongside other members of the council was created for the upcoming reference book Star Wars: The High Republic: Chronicles of the Jedi, set to be published in 2023; prior to its release, the art was included in an October 9, 2022 StarWars.com article previewing the book.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/232_BBY",
  "/wiki/Nihil",
  "/wiki/Jedi",
  "/wiki/The_galaxy",
  "/wiki/Jedi_Master",
  "/wiki/Yarael_Poof",
  "/wiki/High_Republic_Era",
  "/wiki/Yoda",
  "/wiki/Time",
  "/wiki/Oppo_Rancisis",
  "/wiki/Limb",
  "/wiki/Galaxy",
  "/wiki/Grand_Master",
  "/wiki/Lahru",
  "/wiki/Standard_day",
  "/wiki/Eye",
  "/wiki/Robe",
  "/wiki/Jedi_robes",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Charles_Soule",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/Star_Wars:_The_High_Republic:_Chronicles_of_the_Jedi",
  "/wiki/2023",
  "/wiki/October_9",
  "/wiki/2022",
  "/wiki/StarWars.com",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Pra-Tre_Veter",
  "/wiki/Keaton_Murag",
  "/wiki/Ada-Li_Carro",
  "/wiki/Teri_Rosason",
  "/wiki/Adampo",
  "/wiki/Rana_Kant",
  "/wiki/Stellan_Gios",
  "/wiki/Soleil_Agra",
  "/wiki/Jora_Malli",
  "/wiki/Ry_Ki_Sakka"
 ]
}