{
 "name": "Eppie_Belden",
 "display_name": "Eppie Belden",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bakura"
     ]
    },
    {
     "name": "Born",
     "values": [
      "128 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bakuran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Antruse family",
      "Belden family",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Eppie Belden, maiden name Eppie Antruse, was a Bakuran female member of the Antruse family of Bakura. She joined the Rebel Alliance during the Galactic Civil War. With her husband, Orn Belden, she had a son named Roviden Belden. After Roviden and Eppie both aided the Rebellion, Imperial Governor Wilek Nereus ordered her son's execution and her mind destroyed using a parasitic insect from the Jospro sector, causing her to live in a state resembling advanced senility; Orn was also eventually killed.\nBelden was 132 years old by the time of the Bakura Incident, during which the Jedi Knight Luke Skywalker used the Force to reverse her condition. Using her Bakuran underground contacts and her skills as a slicer, she initiated the Bakuran Revolution and personally captured Nereus.\nEppie Antruse was a Bakuran female who was born in 128 BBY as a member of the Antruse family of Bakura. In 97 BBY, the same year as a droid uprising on Bakura, she married Senator Orn Belden and changed her name to Eppie Belden. Sometime afterward, they had their only child, Roviden.\nAlong with her husband and son, Eppie sympathized with the Rebel Alliance during the Galactic Civil War. Bakura was independent and neutral during the conflict until the Galactic Empire annexed Bakura in 1 ABY. Roviden, who had become an agent of the Rebellion, was executed on order of Imperial Governor Wilek Nereus; Eppie, who had also aided the Rebellion, was also ordered to be executed. Orn pleaded for her life, and Nereus agreed to grant it—but instead of killing her, Nereus destroyed her mind using a parasitic insect from the Jospro sector. The price for Orn was the loss of his voice.\nEppie's condition, which resembled advanced senility, was incurable until the Invasion of Bakura, when Jedi Knight Luke Skywalker used the Force to reverse the damage. She awoke to find that Nereus had killed her husband and arrested Prime Minister Yeorg Captison, and—using her contacts in the Bakuran underground and her skills as a slicer—initiated the Bakuran Revolution.\nDespite her age, she personally captured Nereus, and like other revolutionaries, was in favor of trying him in a revolutionary tribunal. However, with the surrender of the Imperial garrison and the release of Prime Minister Captison, the revolutionaries deferred authority back to the Bakuran Senate and handed Nereus over to Skywalker.\nShe had a personality that was described as \"fiery,\" to match her hair, and was the first adult friend of Gaeriel Captison.\nBelden was skilled as a slicer.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Template:Expand",
  "/wiki/Bakura/Legends",
  "/wiki/128_BBY",
  "/wiki/Bakuran",
  "/wiki/Gender/Legends",
  "/wiki/Antruse_family",
  "/wiki/Belden_family",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Orn_Belden",
  "/wiki/Parent/Legends",
  "/wiki/Roviden_Belden",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Wilek_Nereus",
  "/wiki/Death/Legends",
  "/wiki/Jospro_sector",
  "/wiki/Standard_year/Legends",
  "/wiki/Bakura_Incident",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/97_BBY",
  "/wiki/Droid/Legends",
  "/wiki/Senator/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Invasion_of_Bakura",
  "/wiki/Prime_Minister_(Bakura)",
  "/wiki/Yeorg_Captison",
  "/wiki/Bakuran_Senate",
  "/wiki/Gaeriel_Captison",
  "/wiki/The_Truce_at_Bakura",
  "/wiki/The_Truce_at_Bakura_Sourcebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_23",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}