{
 "name": "Erlick Frodar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Demophon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy",
      "Alliance to Restore the Republic",
      "Alliance Army",
      "Alliance Fleet",
      "Alliance Army",
      "Alliance Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Erlick Frodar was the commander of Asteroid Base on Orflon during the Galactic Civil War. He had previously served in the Imperial Navy before joining the Alliance to Restore the Republic, serving in the Alliance Fleet, then the Alliance Army where he held the rank of colonel.\nErlick Frodar was a native of Demophon, and was a young graduate of the Imperial Academy. He served in the Imperial Navy, shuttling stormtrooper teams in the shuttle Hard Liner. After he served his time he left the Imperial Navy with an honorable discharge. Erlick bought a YT-1300 light freighter, which he named the Flat Liner, and went into business as a free trader in the Demophon system. Unable to compete with the legal competition, he soon went bankrupt and was forced to turn to smuggling. He became the regular pilot for a group of Alliance to Restore the Republic agents, whom he believed were merely mercenaries, and impressed them enough to offer Erlick a commission in the Alliance Fleet. He accepted, and proved not only a loyal soldier, but an invaluable source of information about the Demophon sector. When the Alliance Army established Asteroid Base on Orflon they put Erlick in charge as a colonel. Before the Demophon system was destroyed by a supernova, Colonel Frodar sent rebel agents to oversee the evacuation of the Ssither from Jatee.\nErlick Frodar was a large, heavy-set man who cut a commanding figure. His experiences ferrying stormtroopers to their target worlds made him aware of how ruthless and bloodthirsty the Galactic Empire was, and he became a very loyal member of the Alliance to Restore the Republic. He loved space flight, but he loved his home sector of Demophon even more, which led him to accept a planetside posting on Asteroid Base. When he intended to send rebel agents on a mission he had a particular look that those under his command learned to recognize.\nErlick Frodar was an excellent pilot of space transports like the YT-1300, an able commander, and an expert on the Demophon sector.\nErlick Frodar was the owner and pilot of the Flat Liner, a YT-1300 light freighter. After his assignment to Asteroid Base the ship was mostly used for spare parts, and was unceremoniously rechristened the One Liner until its destruction during the evacuation of Jatee.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Demophon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Army/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Asteroid_Base",
  "/wiki/Orflon",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Hard_Liner",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/One_Liner",
  "/wiki/Demophon_system",
  "/wiki/Demophon_sector",
  "/wiki/Supernova/Legends",
  "/wiki/Ssither",
  "/wiki/Jatee",
  "/wiki/West_End_Games",
  "/wiki/The_Evacuation_of_Jatee",
  "/wiki/Supernova_(WEG)",
  "/wiki/The_Beginning_of_the_End"
 ]
}