{
 "name": "Erli_Prann",
 "display_name": "Erli Prann",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 29 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red/silver"
     ]
    }
   ]
  }
 ],
 "content": "Erli Prann was an adventurer, pirate, and scavenger who operated during the Grand Admiral Thrawn crisis and later during the Yuuzhan Vong's invasion of the galaxy.\nFollowing the death of Grand Admiral Thrawn, Erli Prann gathered a group fellow pirates and began a very lucrative career as a scavenger. One of his group's first acquisitions was a Golan II Space Defense SpaceGun and cloaking device from the Bilbringi Shipyards. Later during the Yuuzhan Vong War, Prann and his salvagers began \"liberating\" technology from Yuuzhan Vong conquered worlds. Prann and his comrades would journey to these worlds and would smuggle the contraband off planet before the Yuuzhan Vong could destroy it, often selling it for a high profit. In the later years of the war, Prann's Golan II Platform was commandeered by Alliance forces in the Second Battle of Bilbringi, which was part of Operation Trinity. During the battle, Jaina Solo landed on the station, along with her Twin Suns squadron, and was captured by Prann and his band of pirates. With the help of Hiksri Jith, Jaina would usurp Prann and gain control of the Golan defense platform, using it to cover the Galactic Alliance's retreat from the Yuuzhan Vong.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/29_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Scavenger/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/The_galaxy/Legends",
  "/wiki/Death/Legends",
  "/wiki/Golan_II_Space_Defense_SpaceGun",
  "/wiki/Cloaking_device/Legends",
  "/wiki/Bilbringi_Shipyards",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Alliance_Army",
  "/wiki/Second_Battle_of_Bilbringi",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Twin_Suns_Squadron",
  "/wiki/Hiksri_Jith",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/The_New_Jedi_Order:_The_Final_Prophecy",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}