{
 "name": "Erminia",
 "display_name": "Erminia",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "De'Rruyet Industries"
     ]
    }
   ]
  }
 ],
 "content": "Erminia was a human individual who worked for De'Rruyet Industries during the reign of the Galactic Empire. Between 3 ABY and 4 ABY, Erminia was present at the De'Rruyet Center on the planet Midarr where Beol De'Rruyet, the leader of De'Rruyet Industries, planned to unveil a replicated Nihil Path engine hyperdrive. Before the event could take place, forces of the Unbroken Clan led by General Vukorah arrived at the center and, in an attempt to claim the hyperdrive for herself, took De'Rruyet and his employees hostage.\nRogue archaeologist Doctor Chelli Lona Aphra and the smuggler Sana Starros, who had been sent by Lady Domina Tagge to acquire the hyperdrive for the Tagge Corporation, planned for Starros to rescue the employees whilst Aphra stalled Vukorah. Starros came across two Unbroken Clan soldiers who were holding Erminia and three other employees hostage and subdued the soldiers, informing the employees they were now safe and asked if the employees were okay. Erminia responded that they were fine and thanked to Starros. Starros then asked Erminia where the nearest exit was, and Erminia pointed to where it was, before they began to ask what would happen if the soldiers came back. Before Erminia could finish, however, Starros informed the employees that she would not let them be hurt, and the group then made their way to the exit. After they exited the building, Erminia reunited with her mother.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Color",
  "/wiki/De%27Rruyet_Industries",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/De%27Rruyet_Center",
  "/wiki/Planet",
  "/wiki/Midarr",
  "/wiki/Beol_De%27Rruyet",
  "/wiki/De%27Rruyet_Industries_confluence",
  "/wiki/Nihil",
  "/wiki/Path_engine",
  "/wiki/Hyperdrive",
  "/wiki/Unbroken_Clan",
  "/wiki/General",
  "/wiki/Vukorah",
  "/wiki/Archaeologist",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Smuggler",
  "/wiki/Sana_Starros",
  "/wiki/Lord",
  "/wiki/Domina_Tagge",
  "/wiki/Tagge_Corporation",
  "/wiki/Soldier",
  "/wiki/Erminia%27s_mother",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Erminia",
  "/wiki/Doctor_Aphra_(2020)_10",
  "/wiki/StarWars.com",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Doctor_Aphra_(2020)_8"
 ]
}