{
 "name": "Erskin_Semaj",
 "display_name": "Erskin Semaj",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Military",
      "Alliance Military"
     ]
    }
   ]
  }
 ],
 "content": "Erskin Semaj was a human male commander who served as an aide to Senator Mon Mothma in the rebellion and later served in the Alliance to Restore the Republic. He and members of Gold Squadron encountered Hera Syndulla's Spectres' rebel cell the Phoenix Squadron during a mission to escort Mon Mothma to Dantooine to rally the rebel fleet.\nErskin Semaj served as Senator Mon Mothma's senatorial attache during the Age of the Empire. In 2 BBY, Senator Mon Mothma denounced the Galactic Empire's role in the Ghorman Massacre and resigned from the Imperial Senate. Erskin and members of Gold Squadron accompanied Mon Mothma into hiding on her Taylander shuttle Chandrila Mistress and several Y-wing escorts. With Mon Mothma and her fellow rebels now fugitives, her friend Senator Bail Organa arranged for the group to rendezvous with Phoenix Leader Hera Syndulla and her Spectres in deep space in order to refuel their ships.\nAfter Mothma's freighter docked with Hera's VCX-100 light freighter Ghost, Semaj and Gold Leader Captain Jon Vander boarded the rebel ship. The two met Hera and her crew Garazeb Orrelios, Ezra Bridger, and the astromech droid Chopper. When Ezra asked what cargo they were carrying, Erskin told them they were not allowed aboard due to security conditions. Hera responded by telling them they were welcome aboard her ship. The Ghost then began refueling Mothma's freighter's Y-wing escorts.\nWhile they were refueling, an argument broke out between the pilot Gold Two and the Spectres over secrecy and tactics. When Hera defended her crew, Semaj took a conciliatory stance and remarked that the tactical infiltration pod that the Spectres had encountered earlier was probably looking for them. After an Arquitens-class command cruiser and a Gozanti-class cruiser exited hyperspace and damaged Mothma's ship, Semaj, Mothma, and the remaining crew fled aboard the Ghost. Together with the Y-wing escorts, the rebels then fled to the Archeon Nebula.\nFollowing their escape, Semaj advised the former Senator Mothma to abandon their mission and return to a safe hiding place on Chandrila. Mothma disagreed and said that she would not hide because her presence at the meeting on Dantooine was not optional. Mothma then briefed the rebels about her plan to convene a meeting of the different rebel factions on Dantooine in order to form a Rebel Alliance. After escaping an Imperial trap in the Archeon Nebula, Semaj and his fellow rebels managed to reach Dantooine where Mon Mothma delivered a speech to the assembled rebel fleet.\nAfter the Spectres arrived on Yavin 4 aboard the Ghost, Erskin Semaj informed the Spectres that Mon Mothma had requested a meeting with them to discuss intelligence from the Lothal resistance group leader Ryder Azadi that the Empire was testing a new kind of TIE/d \"Defender\" Multi-Role Starfighter. The Spectres accepted the mission and infiltrated Lothal with the help of the crime lord Cikatro Vizago. Hera Syndulla managed to steal the prototype starfighter's flight data recorder and returned to Yavin 4 aboard Ryder's U-wing. Erskin and Mothma greeted Syndulla and were both pleased to see the flight recorder.\nLater, Erskin attended a high-level rebel briefing with Mon Mothma, Senator Organa, General Dodonna, and Syndulla to discuss the threat posed by the TIE/D Defender Elite to the Alliance's starfighters. After the Empire launched Protocol 13, Hera convinced Mon Mothma to authorize a strike mission to take out the Imperial factories on Lothal.\nErskin Semaj was a human male with brown eyes. A senatorial attaché, he wore a blue and white uniform patterned similarly to Rebel SpecForce Pathfinders stationed on Yavin at the time. Semaj was a loyal and protective servant of the rebel leader Mon Mothma. While he sometimes regarded her as too daring, he was a reliable aid and shared her beliefs in fighting for the galaxy's freedom. Semaj could also be brusque towards strangers. His pragmatism clashed with Mothma's idealism.\nErskin Semaj first appeared in the Star Wars Rebels Season Three episode \"Secret Cargo,\" which first premiered on Disney XD on March 4, 2017. He was voiced by Josh Brener.\nThe character's name is a tuckerization of James Erskine, Story Editor at Lucasfilm.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Alliance_Military",
  "/wiki/Commander",
  "/wiki/Aide",
  "/wiki/Senator",
  "/wiki/Mon_Mothma",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Hera_Syndulla",
  "/wiki/Spectres",
  "/wiki/Operation_Handoff",
  "/wiki/Dantooine",
  "/wiki/Imperial_Era",
  "/wiki/2_BBY",
  "/wiki/Galactic_Empire",
  "/wiki/Ghorman_Massacre",
  "/wiki/Imperial_Senate",
  "/wiki/Taylander_shuttle",
  "/wiki/Chandrila_Mistress",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Phoenix_Leader",
  "/wiki/Fuel",
  "/wiki/VCX-100_light_freighter",
  "/wiki/Ghost",
  "/wiki/Gold_Leader",
  "/wiki/Captain",
  "/wiki/Jon_Vander",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Ezra_Bridger",
  "/wiki/Astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Gold_Two_(rebellion)",
  "/wiki/X3-13",
  "/wiki/Arquitens-class_command_cruiser",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Hyperspace",
  "/wiki/Archeon_Nebula",
  "/wiki/Chandrila",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Lothal_resistance_group",
  "/wiki/Ryder_Azadi",
  "/wiki/TIE/D_Defender_Elite",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Crime_lord",
  "/wiki/Cikatro_Vizago",
  "/wiki/Flight_data_recorder",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Attack_on_Lothal",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels_Season_Three",
  "/wiki/Secret_Cargo",
  "/wiki/Disney_XD",
  "/wiki/March_4",
  "/wiki/2017",
  "/wiki/Josh_Brener",
  "/wiki/Tuckerization",
  "/wiki/The_Occupation",
  "/wiki/Kindred",
  "/wiki/Crawler_Commandeers",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Databank_(website)"
 ]
}