{
 "name": "Erudo Ro-Kiintor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Hevurion"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Centrists",
      "Centrists",
      "First Order"
     ]
    }
   ]
  }
 ],
 "content": "Erudo Ro-Kiintor was a human male that served as the senior New Republic senator from Hevurion. About six years before the destruction of the Hosnian system, Ro-Kiintor was part of a faction known as the Centrists which advocated a stronger central government and a powerful military. Six years later, Erudo was suspected by the Resistance of colluding with the First Order by blocking motions critical of the Imperial remnant in the Galactic Senate.\nIn response, General Leia Organa sent Poe Dameron and his colleagues on a mission to steal his starship Hevurion Grace. Despite the arrival of a First Order fleet, Poe and his colleagues managed to bring Ro-Kiintor's ship back to the Resistance. As a result, the Resistance uncovered evidence that confirmed Ro-Kiintor's collusion with the First Order and information relating to Leia's quest to find her Jedi brother Luke Skywalker.\nErudo Ro-Kiintor was the senior senator representing the planet Hevurion in the Galactic Senate of the New Republic, the successor to the Rebel Alliance. In 28 ABY, Ro-Kiintor was a member of the Centrists faction in the Galactic Senate which advocated a strong central government and a powerful military. The Centrists were opposed by the Populists who believed that individual planets should retain full sovereignty. One of Senator Ro-Kiintor's political adversaries was Leia Organa, a former hero of the Rebel Alliance and the daughter of Darth Vader. As tensions between the two factions escalated, the Centrists began calling for the creation of the position of First Senator to bring order to the divided Senate.\nFearing that the Centrists would use the office of First Chancellor to promote authoritarianism, the Populists nominated Senator Organa for the position. However, Lady Carise Sindian sabotaged Organa's career by revealing her true parentage to the Junior senator Ransolm Casterfo, a promising Centrist politician who had befriended Organa during their investigation into Rinnrivin Di's cartel. Feeling betrayed by Leia, Casterfo announced that Leia was the daughter of the reviled Darth Vader; a move that tarnished Organa's political career.\nFollowing the revelations of Leia's parentage, Senator Ro-Kiintor hosted a meeting on military appropriations. Casterfo, hoping to be invited to one of the relevant Senate committees, attended the meeting. When Erudo discussed his appropriates bill, Casterfo interjected and expressed concerns that the scale of the bill was excessive; adding that the New Republic already maintained a sizeable military for a peacetime government. Ro-Kiintor responded that the New Republic's armies were adequate to the recent security threats posed by the Amaxine warriors and Rinnrivin's cartel but asserted that they needed to be ready for future conflicts.\nRansolm then pointed out that the New Republic comprised the majority of worlds in the galaxy with the exception of a few small, disconnected sectors, which had shown no sign of hostility. Ro-Kiintor contended that the New Republic was made up of separate systems and claimed that it had neglected individual planetary defenses. As a member of the far-right of the Centrist faction, Erudo believed that even the lowliest moon needed enough firepower to take out a Super Star Destroyer on its own. Ransolm suspected that the Senator saw the armaments bill as away of earmarking more government funding to Centrist worlds.\nWhen Casterfo suggested reducing the amount of defense funds to planetary defenses, one of Ro-Kiintor's staffers laughed under his breath. Ro-Kiintor then turned his attention to Senator Organa's plan to address the Senate following her trip to Sibensko. While Senator Ro-Kiintor was confident that Leia would be unable to master the quorum needed to grant her the floor, his staffer pointed out that Leia had only fallen short by one vote and that the Populists and independents had already voted. In response, Ransolm voted for Leia to be permitted to address the Senate; giving her a one vote majority.\nErudo and his Centrist colleagues presumably listened to Leia's address and Ransolm's speech defending her report. Following the assassination of the Populist candidate Tai-Lin Garr, Erudo presumably joined forces with his Centrist colleagues in expressing their condolences and disassociating themselves from Ransolm, who was framed by Lady Carise for Tai's murder. The Centrists then supported a motion to suspend the election for First Senator in anticipation for their plan to secede from the New Republic and join the First Order, a remnant of the \"Old Empire.\"\nAbout thirty years after the Battle of Endor, Senator Ro-Kiintor was secretly colluding with the First Order, the successor to the \"Old Empire\" that had emerged in the Unknown Regions. He aided the First Order by blocking motions extending sanctions to the First Order or increasing support for the Republic Navy. In return, the Order transferred large sums of money into his accounts with the aid of the Corporate Sector Authority through its shell and third-party corporations. Erudo's Pinnacle-class luxury ship Hevurion Grace was spotted by Resistance operatives in First Order space. Some like the Resistance leader General Leia Organa suspected that he was in contact with senior First Order officials like General Armitage Hux and Supreme Leader Snoke.\nWhile General Leia believed that Senator Ro-Kiintor was engaged in treason, she lacked hard evidence to charge the Senator. In response, General Organa sent her best pilot Poe Dameron and his former Rapier Squadron colleagues Karé Kun and Iolo Arana on a mission to steal the Hevurion Grace so that the Resistance could access his ship's navicomputer. Flying vintage Z-95 Headhunters, the Resistance pilots intercepted Ro-Kiintor's ship in the Uvoss system and Iolo managed to disable the Hevurion Grace with a concussion missile. Upon sighting Poe and his comrades, Senator Ro-Kiintor and his crew mistook them for pirates and sent a distress signal to the First Order.\nWearing an EVA suit, Poe Dameron managed to eject from his Headhunter and climb aboard the Senator's starship in space. Posing as a member of the Irving Boys, Poe ordered Senator Ro-Kiintor, his servant, and the pilot at gunpoint to move to the ship's escape pods. When Ro-Kiintor protested, Poe shot at the floor and threatened to enslave him and his entourage. Ro-Kiintor and his entourage fled into the escape pods. Despite being attacked by several First Order warships and TIE fighters, Poe and his comrades managed to flee into hyperspace with Erudo's stolen yacht.\nThe following day, Leia and her crew examined the Hevurion Grace's navicomputer and uncovered evidence which confirmed that Senator Ro-Kiintor had indeed working for the First Order. Leia feared that Erudo was not alone and that there were other like-minded senators conspiring with the First Order. Among the information that the Resistance salvaged from the ship's navicomputer was information about a puzzle leading to her missing Jedi brother Luke Skywalker. Using this information, Leia sent Poe on a mission to find her old friend Lor San Tekka, whom she believed could lead them to Luke.\nErudo Ro-Kiintor was a tall, thin man who liked to dress in extravagant robes and wore a narrow visor over his head. He owned a Pinnacle-class luxury ship called the Hevurion Grace. Erudo supported the views of the Centrists, a faction in the Galactic Senate, which wanted a stronger central government and a more powerful military. Later, Ro-Kiintor became a secret ally of the First Order and helped derail motions critical of the Imperial remnant in return for financial support. His duplicity earned him the ire of several Resistance members including Leia Organa and Poe Dameron.\nFearful of having his dealings with the First Order exposed, Ro-Kiintor contacted the First Order for help when he was accosted by members of the Resistance in space; who were disguised as the pirate gang known as the Irving Boys. When confronted by a disguised Poe, Erudo attempted to challenge the \"pirate.\" However, he and his entourage were easily cowered when Poe fired a blaster and threatened to sell them as slaves if they did not leave the Hevurion Grace.\nErudo Ro-Kiintor first appeared as a minor antagonist in Greg Rucka's 2015 junior novel Before the Awakening, which was released as a prequel tie-in to Star Wars: Episode VII The Force Awakens.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Hevurion",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/New_Republic",
  "/wiki/Centrists",
  "/wiki/First_Order",
  "/wiki/Senator",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Hosnian_system",
  "/wiki/Resistance",
  "/wiki/Imperial_remnant_(cold_war)",
  "/wiki/New_Republic_Senate",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Poe_Dameron",
  "/wiki/Operation:_Sabre_Strike",
  "/wiki/Hevurion_Grace",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Senior_senator",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/28_ABY",
  "/wiki/Populists",
  "/wiki/Anakin_Skywalker",
  "/wiki/First_Senator",
  "/wiki/Lord",
  "/wiki/Carise_Sindian",
  "/wiki/Ransolm_Casterfo",
  "/wiki/Rinnrivin_Di",
  "/wiki/Rinnrivin_Di%27s_cartel",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/Amaxine_warriors_(New_Republic_Era)",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Mission_to_Sibensko",
  "/wiki/Sibensko",
  "/wiki/Tai-Lin_Garr%27s_assassination",
  "/wiki/Tai-Lin_Garr",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Endor",
  "/wiki/Unknown_Regions",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Corporate_Sector_Authority",
  "/wiki/Pinnacle-class_luxury_ship",
  "/wiki/Armitage_Hux",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Treason",
  "/wiki/Rapier_Squadron",
  "/wiki/Kar%C3%A9_Kun",
  "/wiki/Iolo_Arana",
  "/wiki/Z-95_Headhunter",
  "/wiki/Pilot",
  "/wiki/Uvoss_system",
  "/wiki/Concussion_missile",
  "/wiki/EVA_suit",
  "/wiki/Irving_Boys",
  "/wiki/Escape_pod",
  "/wiki/Slavery",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Lor_San_Tekka",
  "/wiki/Blaster",
  "/wiki/Greg_Rucka",
  "/wiki/2015",
  "/wiki/Before_the_Awakening",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/Poe_Dameron_2",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_26",
  "/wiki/Starfighter_Aces",
  "/wiki/Del_Rey",
  "/wiki/File:New_Republic_Bloodline_Twitter_Post.jpg",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY"
 ]
}