{
 "name": "ES-02",
 "display_name": "ES-02",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "CT-9904's Elite Squad",
      "CT-9904's Elite Squad"
     ]
    }
   ]
  }
 ],
 "content": "ES-02 was the designation of a human female Elite Squad Trooper who was recruited into the military of the Galactic Empire in its early foundation by Vice Admiral Rampart. She, along with her squadmates, was described by Rampart as one of the best soldiers in the galaxy, and was brought into the Elite Squad under the leadership of Clone Commander CT-9904 \"Crosshair.\" During the Empire's operation on Kamino, ES-02 began to doubt her commander's loyalty regarding his former unit, Clone Force 99, who he intended to lure into a trap in Tipoca City, and reported her concerns to Rampart. When she later discovered that Crosshair had lost control of the situation he had planned and the rest of the Elite Squad was dead, ES-02 departed Tipoca City as ordered before Rampart began bombarding the city, leaving Crosshair to die.\nThe human designated \"ES-02\" was a female soldier. After the end of the Clone Wars, the new Galactic Empire sought to replace its clone troopers with a wholly recruited military. As part of Project War-Mantle, Vice Admiral Rampart recruited four soldiers to be the first Elite Squad Troopers. Besides ES-02, the unit included ES-01, ES-03, and ES-04. The squad was placed under the command of CT-9904, a modified clone formerly known as \"Crosshair,\" after being shown to Admiral Wilhuff Tarkin for inspection on Kamino.\nThey were subsequently sent on their first mission, ordered to find and kill the rebel leader Saw Gerrera and his fighters On the shuttle journey to Onderon, ES-02 silently listened as ES-01 challenged Crosshair's authority, claiming that he would soon become the commander of the unit as clones were inferior. ES-02 and the rest of the squad attacked several of Gerrera's fighters as they were attempting to evacuate civilian refugees, although Gerrera was absent, killing all of the fighters. After receiving no intel on Gerrera's whereabouts, Crosshair ordered the Elite Squad to execute the civilians. They were initially hesitant, but after he executed ES-01 for protesting the order, ES-02 and the rest of the squad complied.\nES-02 later participated in a mission to Bracca, attempting to eliminate Clone Force 99, Crosshair's former squad. The Elite Squad was later sent to Ryloth, before participating in an Imperial operation on Kamino, arresting Chief Medical Scientist Nala Se after she was discovered attempting to gather medical personnel to depart the planet.\nAfter Hunter, the leader of Clone Force 99, was captured by Imperial forces on Daro, ES-02 remained with her squad and Crosshair as they awaited the Bad Batch's arrival on Kamino. Wary of Crosshair's loyalty, she informed Rampart of her suspicions and was ordered to keep an eye on her commander. When her squad apprehended the remaining members of the Bad Batch, ES-02 was tasked with tracking down Omega. Upon locating the girl, she was then ordered to send her on a shuttle off-world, but was incapacitated by AZI-3. When she regained consciousness, ES-02 attempted to regroup with her squad, only to find them dead and Crosshair and the Bad Batch engaged in a firefight with the facility's training droids. One of the droids attempted to attack ES-02 but she promptly eliminated it and escaped from the training room. Retreating from the area, she informed Rampart of Crosshair's failure before evacuating Tipoca City prior to its destruction.\nES-02 was a human female with pale skin and black hair, which she wore in a bun. Loyal to the Galactic Empire, ES-02 was initially apprehensive about killing civilians on Onderon, but complied after the execution of ES-01. When she began to suspect that Crosshair's loyalty to the Empire was wavering and that his plans for the Bad Batch were different than what Rampart wanted, she informed Rampart, and left her commander behind when she found he had lost control of the situation.\nES-02 was considered one of the best soldiers in the galaxy, enough so that she was selected to be one of the first Elite Squad Troopers.\nLike other Elite Squad Troopers, ES-02 wore modified clone trooper armor, which was fitted to match her body type. In combat, she wielded a DC-15A blaster rifle, which was modified to include a scope.\nES-02 first appeared in the third episode of the first season of the television series Star Wars: The Bad Batch, voiced by Tina Huang.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/CT-9904%27s_Elite_Squad",
  "/wiki/Elite_Squad_Trooper",
  "/wiki/Imperial_Military",
  "/wiki/Vice_Admiral",
  "/wiki/Rampart",
  "/wiki/Soldier",
  "/wiki/The_galaxy",
  "/wiki/Clone_Commander",
  "/wiki/CT-9904",
  "/wiki/Operation_on_Kamino",
  "/wiki/Kamino",
  "/wiki/Commander",
  "/wiki/Clone_Force_99",
  "/wiki/Rescue_of_Hunter",
  "/wiki/Tipoca_City",
  "/wiki/Death",
  "/wiki/City",
  "/wiki/Clone_Wars",
  "/wiki/Clone_trooper",
  "/wiki/Project_War-Mantle",
  "/wiki/ES-01",
  "/wiki/ES-03",
  "/wiki/ES-04",
  "/wiki/Squad",
  "/wiki/Cloning",
  "/wiki/Admiral",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Mission_to_Onderon_(Elite_Squad)",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Shuttle",
  "/wiki/Onderon",
  "/wiki/Refugee",
  "/wiki/Mission_on_Bracca",
  "/wiki/Bracca",
  "/wiki/Ryloth",
  "/wiki/Chief_Medical_Scientist",
  "/wiki/Nala_Se",
  "/wiki/Planet",
  "/wiki/Hunter",
  "/wiki/Daro",
  "/wiki/Omega",
  "/wiki/AZI-345211896246498721347",
  "/wiki/Battle_droid",
  "/wiki/Hair",
  "/wiki/Clone_trooper_armor",
  "/wiki/DC-15A_blaster_rifle",
  "/wiki/Replacements",
  "/wiki/The_Bad_Batch_Season_1",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Tina_Huang",
  "/wiki/Reunion",
  "/wiki/Devil%27s_Deal",
  "/wiki/Rescue_on_Ryloth",
  "/wiki/War-Mantle",
  "/wiki/Return_to_Kamino",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)"
 ]
}