{
 "name": "ES-01",
 "display_name": "ES-01",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Onderon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "CT-9904's Elite Squad",
      "CT-9904's Elite Squad"
     ]
    }
   ]
  }
 ],
 "content": "ES-01 was the designation of a human male Elite Squad Trooper, one of the first conscripted soldiers of the Galactic Empire recruited via Vice Admiral Rampart's Project War-Mantle. ES-01, along with his squad-mates, was described by Rampart as one of the best soldiers in the galaxy, and was brought into the Elite Squad under the leadership of Clone Commander CT-9904. ES-01 was killed by CT-9904 after refusing to execute civilians under the protection of rebel leader Saw Gerrera on the planet Onderon.\nES-01 took an immediate disliking to the group's leader, Crosshair, and as they traveled to Onderon, made a remark about how he would one day lose his leadership role. The contentiousness continued during the mission, where ES-01 tried to take the lead and convince the squad to disobey orders, leading to his execution by Crosshair.\nES-01 was a human male who lived during the time when the Galactic Republic transitioned into the Galactic Empire at the end of the Clone Wars. He was recruited into the new Imperial Military through Project War-Mantle, an initiative to enlist conscripted and recruited soldiers into the military rather than clones.\nES-01 was present when Vice Admiral Rampart presented him, along with the rest of his Elite Squad, to Admiral Wilhuff Tarkin on Kamino. Later, ES-01 expressed his frustration at joining the military only to be scanned by droids. He also remarked with his fellow squad-mates that the Empire did more for him than the Republic ever did by paying, feeding, and housing him.\nES-01 and his squad were assigned under Clone Commander CT-9904, nicknamed \"Crosshair.\" They were ordered by Admiral Tarkin to finish Clone Force 99's mission and execute Saw Gerrera and his insurgents on Onderon. While en route to Gerrera's camp in their Nu-class attack/transport shuttle, ES-01 openly expressed his disdain for Crosshair as a clone and warned him that he coveted his command.\nAt Gerrera's camp, ES-01 and his squad defeated the insurgents, taking out their starship and coercing the survivors to surrender. When Crosshair ordered the squad to execute the rest, ES-01 protested and refused to follow the orders, noting that they were civilians and calling the orders wrong. ES-01 ordered the rest of the squad to take them into custody, but Crosshair promptly executed him, causing the rest of the squad to look on the civilians before killing them.\nES-01's absence was later noticed by Tarkin when the squad returned to Kamino, but Rampart remarked that even though his loss was unfortunate, soldiers could always die in battle and knew the risks.\nThe human male designated ES-01 was regarded by Vice Admiral Rampart as one of the \"top soldiers\" in the galaxy. Despite this, ES-01 was willing to show open defiance and frustration, as well as publicly express his disagreement with orders when he felt they were wrong. ES-01 also had a competitive edge, and looked down on Crosshair as a clone, stating that he believed that the Empire was looking for conscripts and recruits because the clones weren't as efficient as they were thought to be.\nES-01 made his first appearance in \"Replacements,\" the third episode of the first season of the television series Star Wars: The Bad Batch released on May 14, 2021. He was voiced by Emilio Garcia-Sanchez as identified in the credits.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/19_BBY",
  "/wiki/Onderon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/CT-9904%27s_Elite_Squad",
  "/wiki/Elite_Squad_Trooper",
  "/wiki/Soldier",
  "/wiki/Vice_Admiral",
  "/wiki/Rampart",
  "/wiki/Project_War-Mantle",
  "/wiki/The_galaxy",
  "/wiki/Clone_Commander",
  "/wiki/CT-9904",
  "/wiki/Death",
  "/wiki/Early_rebellion_against_the_Galactic_Empire",
  "/wiki/Saw_Gerrera",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Clone_Wars",
  "/wiki/Imperial_Military",
  "/wiki/Clone_trooper",
  "/wiki/Admiral",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Kamino",
  "/wiki/Droid",
  "/wiki/Squad",
  "/wiki/Clone_Force_99",
  "/wiki/Mission_to_Onderon_(Elite_Squad)",
  "/wiki/Partisans",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/Starship",
  "/wiki/Replacements",
  "/wiki/The_Bad_Batch_Season_1",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/May_14",
  "/wiki/2021",
  "/wiki/Emilio_Garcia-Sanchez",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Clone_commando",
  "/wiki/War-Mantle",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Return_to_Kamino",
  "/wiki/Kamino_Lost"
 ]
}