{
 "name": "ES-03",
 "display_name": "ES-03",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 19 BBY",
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "CT-9904's Elite Squad",
      "CT-9904's Elite Squad"
     ]
    }
   ]
  }
 ],
 "content": "ES-03 was the designation of a human male of the Galactic Empire who was recruited early in its foundation by Vice Admiral Rampart. ES-03, along with his squad-mates, was described by Rampart as one of the best soldiers in the galaxy, and was brought into the Elite Squad under the leadership of Clone Commander CT-9904. Along with the other members of the squad, ES-03 participated in the squad's mission to Onderon, the Mission on Bracca, several battles during the Ryloth Insurgency, and was killed along with a number of Elite squad troopers when CT-9904 ricocheted a shot around the room, killing them all.\nAfter the Republic was dissolved and replaced with with the Galactic Empire in 19 BBY, the Imperial Military sought to reorder its ranks. Under Project War-Mantle, Vice Admiral Rampart began to recruit humans to possibly replace the clone troopers, who had previously fought for the Galactic Republic. ES-03 was one of the first to be recruited, and was regarded as one of the top soldiers of the galaxy. He was assigned to CT-9904's Elite Squad along with fellow recruits ES-01, ES-02, and ES-04, under the command of CT-9904 and brought to the Tipoca City Military Complex, where he was examined by a Kaminoan medical droid.\nGovernor Wilhuff Tarkin ordered ES-03 and the Elite Squad to Onderon to wipe out a camp of Saw Gerrera's Partisans. They arrived on a Nu-class attack/transport shuttle and made their way through the jungles until they arrived at Saw Gerrera's camp. CT-9904 \"Crosshair\" picked off several insurgents before ordering ES-03 through the jungle. Most were killed, but several of the insurgents and all the refugees managed to get on their starship. It managed to take off, but the pilot was shot by ES-02. The last remaining Partisan left the ship, where she was shortly interrogated by Crosshair before he shot her when she refused to give him the location of Saw.\nCrosshair moved to execute the refugees, but ES-01 said that it was wrong, and that they should take them prisoner instead. Crosshair countered by saying that those weren't their orders, to which ES-01 said to forget their orders. Crosshair executed him on the spot for disobedience, and told ES-03 and the troopers to finish the mission, to which they all reluctantly did, killing them all. They then returned to Kamino, where Tarkin was impressed, saying that the initiative certainly had potential.\nOn Bracca, several scavengers spotted intruders on a Venator-class Star Destroyer that was being scrapped. Admiral Rampart ordered the squad to Bracca, with orders to simply terminate the members of Clone Force 99. They and several squads of stormtroopers arrived on Bracca. ES-03's scanners were not working, which he naively chalked up to atmospheric interference. Crosshair told him that they were being jammed instead. They then moved to lay a trap, manipulating Clone Force 99's leader, \"Hunter\", into leading his group towards the artillery deck, where they were cornered by Crosshair's squad and a squad of stormtroopers. After a short talk, a member of Clone Force 99, nicknamed \"Tech\" managed to fire the cannons on the ship, which violently launched ES-03, ES-02, and Crosshair back. Their squad of stormtroopers was taken out, and ES-03 narrowly managed to escape the top of the artillery deck collapsing on them.\nClone Force 99 would eventually get away, although Omega would be kidnapped by Cad Bane until she was rescued on the planet of Bora Vio.\nES-03 would be present when the Free Ryloth Movement started to ramp up. He would be present while Cham Syndulla encouraged the Twi'leks to lay down their weapons and embrace peace. The peace would not last forever, however. When Gobi Glie, Serin, and Hera Syndulla attempted to smuggle more weapons onto the planet, they were tracked and shot down by Crosshair. ES-03 and his squad would arrest them for Treason. They were transported back to the capitol in a HCVw A9 turbo tank with BARC speeder escorts. The convoy was attacked, and Hera temporarily freed. However, Crosshair shot Orn Free Taa, and Admiral Rampart blamed it on Cham. ES-03, the Elite Squad, and several stormtroopers would land in LAAT gunships to arrest the attackers. However, Hera and C1-10P \"chopper\" would get away.\nLater, ES-03 would participate in the search for Hera Syndulla, which would fail.\nHera, Omega, Tech, and \"Wrecker\" would attack the Imperial doonium refinery, which served as a distraction while Hunter and CT-1409 \"Echo\" would rescue Cham and Eleni Syndulla. However, Crosshair realized what the distraction was, and ordered his squad to stay and prevent the prisoners from escaping. They would have been successful had Captain Howzer not saved the escaping prisoners by telling them of the trap waiting. He would then try to talk to the waiting clone troopers, telling them that they were now suppressing the people that they swore to protect. He would inspire several troopers to lay down their weapons, but Crosshair ordered ES-03 and the troopers to arrest the traitors, which they did.\nCrosshair would get permission from Rampart to hunt down Clone Force 99, after Rampart saw their power when they destroyed the doonium mine. This search would ultimately be fruitless until Hunter was captured on Daro by clone commandos.\nAfter Hunter's capture, he was brought back to Kamino to lay a trap for the remaining members of Clone Force 99. Using Hunter's comlink, Crosshair managed to lure Hunter's brothers to come rescue him. ES-03 and the Elite Squad would surround the entrance to the Tipoca City Training Facility, and force Clone Force 99 to lay down their weapons. Crosshair told Hunter that he would give the squad what they never gave him, a second chance, telling them to join the Empire. He told the Elite Squad to stand down, but the Elite Squad, having received orders from Rampart to keep an eye on Crosshair, would not. Crosshair then ricocheted a shot perfectly on reflectors, which bounced and killed all four Elite Squad Troopers, including ES-03.\nES-03 was a human male with darkish skin, blond hair, and brown eyes. He willingly enlisted in the Imperial Military. He was reluctant to execute civilians, however did so after Crosshair killed ES-01, after which he performed his orders perfectly, such as when Crosshair told him to aim for a kid. He was completely loyal to the newly-formed Empire, which is what ended up getting him killed in the end.\nES-03 was regarded as one of the top soldiers across the galaxy according to Rampart. He was skilled in a firefight, as demonstrated during the attack on Saw's camp.\nLike everyone in the Elite Squad, ES-03 wore a set of modified clone trooper armor, that was black with a green visor on the helmet. He used a DC-15A blaster carbine in battle.\nES-03 first appeared in the television series Star Wars: The Bad Batch. He was voiced by Ness Bautista.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Special:Upload",
  "/wiki/19_BBY",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/CT-9904%27s_Elite_Squad",
  "/wiki/Vice_Admiral",
  "/wiki/Rampart",
  "/wiki/Soldier",
  "/wiki/The_galaxy",
  "/wiki/Clone_Commander",
  "/wiki/CT-9904",
  "/wiki/Mission_to_Onderon_(Elite_Squad)",
  "/wiki/Mission_on_Bracca",
  "/wiki/Ryloth_Insurgency",
  "/wiki/Elite_Squad_Trooper",
  "/wiki/Rescue_of_Hunter",
  "/wiki/Death",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Imperial_Military",
  "/wiki/Project_War-Mantle",
  "/wiki/Clone_trooper",
  "/wiki/Galactic_Republic",
  "/wiki/ES-01",
  "/wiki/ES-02",
  "/wiki/ES-04",
  "/wiki/Tipoca_City_Military_Complex",
  "/wiki/Unidentified_medical_droid_model",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Onderon",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/Saw_Gerrera%27s_camp",
  "/wiki/Starship",
  "/wiki/Unidentified_male_Onderonian_fighter",
  "/wiki/Unidentified_female_Onderonian_fighter",
  "/wiki/Death_penalty",
  "/wiki/Refugee",
  "/wiki/Bracca",
  "/wiki/Scavenger",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Clone_Force_99",
  "/wiki/Stormtrooper",
  "/wiki/Hunter",
  "/wiki/Tech",
  "/wiki/Omega",
  "/wiki/Cad_Bane",
  "/wiki/Bora_Vio",
  "/wiki/Free_Ryloth_Movement",
  "/wiki/Cham_Syndulla",
  "/wiki/Twi%27lek",
  "/wiki/Gobi_Glie",
  "/wiki/Serin",
  "/wiki/Hera_Syndulla",
  "/wiki/Treason",
  "/wiki/HCVw_A9_turbo_tank",
  "/wiki/BARC_speeder",
  "/wiki/Rescue_of_Hera_Syndulla",
  "/wiki/Orn_Free_Taa",
  "/wiki/Low_Altitude_Assault_Transport",
  "/wiki/C1-10P",
  "/wiki/Wrecker",
  "/wiki/Imperial_doonium_refinery",
  "/wiki/Echo",
  "/wiki/Rescue_of_Cham_and_Eleni_Syndulla",
  "/wiki/Eleni_Syndulla",
  "/wiki/Captain",
  "/wiki/Howzer",
  "/wiki/Daro",
  "/wiki/Clone_commando",
  "/wiki/Comlink",
  "/wiki/Tipoca_City_Training_Facility",
  "/wiki/Clone_trooper_armor",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Ness_Bautista",
  "/wiki/Replacements",
  "/wiki/Reunion",
  "/wiki/Devil%27s_Deal",
  "/wiki/Rescue_on_Ryloth",
  "/wiki/War-Mantle",
  "/wiki/Return_to_Kamino",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Kamino_Lost"
 ]
}