{
 "name": "Eseni",
 "display_name": "Eseni",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lethan Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Violet"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pilgrims"
     ]
    }
   ]
  }
 ],
 "content": "Eseni was a Lethan Twi'lek female who was a member of the religious group known as the Pilgrims during the Cold War between the Republic and the Sith Empire. She settled on the planet Tython with the rest of the Pilgrims, and, during a conflict with the native Flesh Raiders, Eseni and a number of villagers attempted to betray the Jedi Order to the Flesh Raiders' leader, the Dark Jedi Bengel Morr. Under threat from Morr, Eseni and several other Pilgrims tried to kill a young Padawan who had saved the village's crop fields from Flesh Raider sabotage, but the Jedi mind-tricked them and ended the standoff without violence.\nA Twi'lek female, Eseni was a member of the religious group known as the Pilgrims, which settled on the planet Tython during the Cold War between the Republic and the Sith Empire. The Pilgrims built Kalikori village between the Jedi Temple and the Tythos Ridge mountain range, in defiance of the Galactic Senate's refusal of settlement rights, and worked to survive on Tython despite attacks by the native Flesh Raiders. In 3643 BBY, the Flesh Raiders began moving against both the villagers and the Jedi Order in an organized fashion, leading the Jedi to reach out to the villagers and work to halt the Flesh Raider threat. Eseni witnessed a Flesh Raider incursion that saw Flesh Raiders seed the village's crop fields with toxin mines. After a scout collapsed from the toxic fumes, Eseni rushed to inform the village's leader, Matriarch Ranna Tao'Ven.\nTao'Ven was meeting with the young apprentice of Jedi Master Orgus Din, and she and Eseni begged the Padawan to help them against the Flesh Raiders. The Jedi was successful in destroying the toxin mines and killing the saboteurs, saving the village's food supply. However, the Dark Jedi Bengel Morr—the man responsible for the Flesh Raiders' recent activities—approached the villagers with an offer: In return for helping him capture Orgus Din, his former teacher, Morr would spare Kalikori from further attacks. The villagers agreed and sent out a false distress signal, luring Din back to the village, where Morr's Flesh Raiders subdued and captured the Jedi Master. Not long afterward, however, Morr contacted the village and changed the terms of their deal—he now wanted them to kill Din's Padawan as well. Eseni, Scout Chief Moorint, and another villager named Saylew then headed to the Matriarch's building, where the Padawan had just arrived and was talking with Tao'Ven and the astromech droid T7-O1.\nMoorint shot the Padawan with a dart coated with a sedative and painkiller, and Saylew shot T7-O1 with an ion blaster, but Tao'Ven was outraged and leaped to the Jedi's defense. As the Jedi struggled to remain conscious, Tao'Ven began to argue with Eseni and the other villagers, refusing to let them kill the Padawan. When the apprentice recovered from the dart, Moorint explained that Morr had changed their deal, but the Padawan reached out with the Force and convinced the trio to leave the building peacefully. Fortunately for the villagers, they were spared Morr's wrath when Din's apprentice defeated the Dark Jedi and rescued Din.\nA member of the Lethan Twi'lek subspecies, Eseni had red skin and violet eyes. She was easily influenced by the young Padawan's mind tricks.\nEseni owned a small blaster, which she carried when trying to kill the Padawan. Like many of the Pilgrims, she wore dark-gray clothing.\nEseni first appeared in the Jedi Knight-class mission \"The Face of the Enemy\" in Star Wars: The Old Republic, a video game released by BioWare in 2011. She later appears in the mission \"Dark Temptations,\" in which the player can choose to either kill the villagers for dark-side points, try and fail to convince them to leave for light-side points, or Force-persuade them to leave for maximum light-side points. As the Jedi Knight is a Republic character and is thus assumed to make choices that reward the maximum light-side points, this article assumes Eseni survived.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Lethan",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Pilgrims",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Planet/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Flesh_Raider_uprising",
  "/wiki/Flesh_Raider",
  "/wiki/Kalikori_village",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Bengel_Morr",
  "/wiki/Death/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/City/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Jedi_Temple_(Tython)/Legends",
  "/wiki/Tythos_Ridge",
  "/wiki/Mountain/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/3643_BBY",
  "/wiki/Skirmish_in_the_Kalikori_village_fields",
  "/wiki/Toxin_mine",
  "/wiki/Scout/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Matriarch",
  "/wiki/Ranna_Tao%27Ven",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Orgus_Din",
  "/wiki/Padawan/Legends",
  "/wiki/Mine/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Distress_signal/Legends",
  "/wiki/Scout_Chief",
  "/wiki/Moorint",
  "/wiki/Saylew",
  "/wiki/T7-series_astromech_droid",
  "/wiki/T7-O1",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Dart",
  "/wiki/Ion_blaster/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Battle_of_the_Forge",
  "/wiki/Eye/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}