{
 "name": "Espis Zanchal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Lord Espis Zanchal was a human male baron who served the Galactic Empire during the Imperial Era. He lived in Zanchal Estate on the planet Coruscant, where he kept a domestic narglatch. Between 3 ABY and 4 ABY, Zanchal's name was included on a list containing supposed Crimson Dawn infiltrators within the Empire. The list had been put together by the Crimson Dawn operative Sabé as part of her hunt for the Sith Lord Darth Vader, with at least half of the names being loyal Imperials and not Crimson Dawn spies, and also left out a number of the true spies. After Vader uncovered the list at the Crimson Dawn Sub-Headquarters on Laecor and discovered Zanchal's name on it, he sent the Revengers, which consisted of S'ira, Ankala Sahm, and Tanka, along with the assassin Gee-Ninety and Imperial officer Beilert Valance to the Zanchal Estate to eliminate Zanchal.\nAfter the group broke into the estate, they informed Zanchal of his exposure as a Crimson Dawn infiltrator and asked if he had anything to say before he was killed. The baron responded by insisting the group were mistaken and that he had no connections to Crimson Dawn, informing them they could search his estate and take anything they wanted. He then told his droid to give them access to all the estate's chambers, which the droid complied with. With this, Zanchal's narglatch and several individuals kept in cages above the creature were revealed, which angered Sahm. Despite his insistance that the narglatch was certified and registered, and that he was not a member of Crimson Dawn, Sahm confronted the baron about the discovery and asked if he thought she cared about him not being affiliated with Crimson Dawn. After this the baron told his guards to open fire on the group, and during the resulting skirmish, he was killed. After Zanchal's death, the individuals kept in the cages were freed, and Gee-Ninety searched his records but found nothing that showed any affiliation with Crimson Dawn. The baron's droid then informed the group that he had not been lying and that everything he had told them was legitimate.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Lord",
  "/wiki/Baron",
  "/wiki/Imperial_Era",
  "/wiki/Zanchal_Estate",
  "/wiki/Planet",
  "/wiki/Narglatch",
  "/wiki/Crimson_Dawn",
  "/wiki/Sab%C3%A9",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Spy",
  "/wiki/Attack_on_the_Crimson_Dawn_Sub-Headquarters",
  "/wiki/Crimson_Dawn_Sub-Headquarters",
  "/wiki/Laecor",
  "/wiki/Revengers",
  "/wiki/S%27ira",
  "/wiki/Ankala_Sahm",
  "/wiki/Tanka",
  "/wiki/Assassin",
  "/wiki/Gee-Ninety",
  "/wiki/Imperial_officer",
  "/wiki/Beilert_Valance",
  "/wiki/Purge_of_suspected_Crimson_Dawn_collaborators",
  "/wiki/Death",
  "/wiki/Droid",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Espis_Zanchal",
  "/wiki/Darth_Vader_(2020)_20",
  "/wiki/Darth_Vader_(2020)_21",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/Databank_(website)"
 ]
}