{
 "name": "Estoric Sandskimmer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "29 ABY",
      "Chashima"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Estoric Sandskimmer was a Human male who served as a member of Wraith Squadron during the Yuuzhan Vong War. In 29 ABY, he and Runt infiltrated the Yuuzhan Vong shapers' compound on the planet of Chashima in order to steal a new bioweapon developed by the Vong, which the invaders planned to use against the Galactic Alliance. The infiltration was successful, and Sandskimmer and Ekwesh escaped the compound with the weapon, but they were soon chased down by Yuuzhan Vong warriors, forcing them to fight. Unfortunately, during the confrontation, Sandskimmer was impaled by one of the warriors' amphistaffs and he died. Ekwesh also died during the battle, but thanks to the sharpshooting by Wraith Voort \"Piggy\" saBinring, the warriors also perished.\nNeither Sandskimmer nor Ekwesh's deaths were in vain though, for they managed to plant explosives that were set to detonate via timers that brought down the shaper compound. Piggy managed to take the Yuuzhan Vong weapon with him before he was caught by further Vong patrols and he made it back successfully to the Galactic Alliance with that weapon before he retired from Wraith Squadron.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/29_ABY/Legends",
  "/wiki/Chashima",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Wraith_Squadron",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Hohass_Ekwesh",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Shaper_caste",
  "/wiki/Planet/Legends",
  "/wiki/Warrior_caste",
  "/wiki/Amphistaff",
  "/wiki/Voort_saBinring",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)"
 ]
}