{
 "name": "Ethan Adare",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fel Empire",
      "Darth Krayt's Galactic Empire",
      "Imperial Mission",
      "Imperial Mission"
     ]
    }
   ]
  }
 ],
 "content": "Ethan Adare was a Human male who served the Imperial Mission, an organization dedicated to the Fel Empire's \"Victory Without War\" program, on the planet Tatooine during the Second Imperial Civil War. In 137 ABY, Adare met the Zeltron pirate Deliah Blue—who was pretending to be the Imperial Missionary Astraal Vao—as she was attempting to locate a trivalve assembly, which was essential for repairing her crew's ship, the Mynock. After visiting the local Imperial Mission's house, Adare provided Blue with the trivalve assembly, despite knowing that she was lying about her identity. After Blue eventually revealed her true identity to him, Adare helped her install the trivalve assembly on the Mynock.\nEthan Adare, a Human male, served the Fel Empire as a representative of the Imperial Mission, which was designed to promote Emperor Roan Fel's \"Victory Without War\" initiative, in the years leading up to the Sith–Imperial War. In 130 ABY, at the end of the war, the Dark Lord of the Sith Darth Krayt seized the Imperial throne from Fel. Adare continued to serve the Imperial Mission as a part of Krayt's Empire, and by 137 ABY, he was assigned to the Imperial Mission's station on the Outer Rim planet Tatooine in the city of Mos Eisley.\nIn that same year, Adare met the Zeltron Deliah Blue—who was pretending to be an Imperial Missionary in order to find a trivalve assembly needed to fix her crew's ship, the Mynock—in Mos Eisley. She introduced herself to him as Astraal Vao and asked where the local mission house was. Adare offered to take her there as she told him that a farmer who had helped her needed a new trivalve assembly for his transport. After they arrived at the mission house, Adare shared his views on the local Imperial Mission and the organization's role in the galaxy with Blue, who reminded Adare that the farmer needed the trivalve assembly. Adare retrieved the part and traveled with Blue to Mos Eisley's spaceport.\nAfter arriving at the Mynock's location in the spaceport, Adare was held at gunpoint by Blue, who instructed him to give her the trivalve assembly and leave the spaceport. However, he insinuated that he would alert the local authorities and suggested that she kill him in order to ensure his silence. Blue grew frustrated, and Adare revealed that he knew that she was not really Astraal Vao, since he had met the Imperial Missionary before. She revealed her true identity to him and began weeping over the fact that her inability to install the trivalve assembly would lead to the Black Sun crime syndicate finding and killing Cade Skywalker and Jariah Syn, two of her friends. After hearing this, Adare gave her the part for the Mynock, stating that she should have asked for assistance in the beginning. He then offered his help in installing the trivalve assembly on the Mynock, much to Blue's surprise. With Adare's assistance, Blue was able to successfully repair the Mynock and leave Tatooine.\nAs an Imperial Missionary, Ethan Adare believed in the principles of the organization, which operated on Emperor Roan Fel's \"Victory Without War\" initiative. Adare believed that the Sith–Imperials would have ceased the Imperial Mission's funding if not for Moff Konrad Rus's belief in the organization. Despite knowing that Deliah Blue was lying to him about her identity, Adare still assisted her in locating a trivalve assembly. After she revealed her true identity and began degrading herself, he made it a point to tell her that she was not worthless and offered further assistance in installing the trivalve assembly aboard the Mynock, despite having been held at gunpoint by Blue moments before. Adare wore a set of robes typically worn by Imperial missionaries and had flowing white hair and a beard.\nEthan Adare was created by John Ostrander for the thirty-eighth and fortieth issues of the Star Wars: Legacy comic series, which were part of the series' Tatooine story arc. In both appearances Adare was drawn by Jan Duursema.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/White",
  "/wiki/Brown",
  "/wiki/Fel_Empire",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Imperial_Mission",
  "/wiki/Victory_Without_War",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/137_ABY",
  "/wiki/Zeltron/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Deliah_Blue",
  "/wiki/Astraal_Vao",
  "/wiki/Trivalve_assembly/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Mynock_(Helot-class)",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Standard_year/Legends",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/130_ABY",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/City/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Farm/Legends",
  "/wiki/Transport/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Death/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Jariah_Syn",
  "/wiki/Emperor/Legends",
  "/wiki/One_Sith",
  "/wiki/Moff/Legends",
  "/wiki/Konrad_Rus",
  "/wiki/John_Ostrander",
  "/wiki/Legacy_(2006)_38",
  "/wiki/Legacy_(2006)_40",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy:_Tatooine",
  "/wiki/Jan_Duursema",
  "/wiki/Category:Images_of_Ethan_Adare",
  "/wiki/Legacy_(2006)_1",
  "/wiki/Legacy_Era_Campaign_Guide"
 ]
}