{
 "name": "Etro Edthatt",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue-green"
     ]
    }
   ]
  }
 ],
 "content": "Etro Edthatt was a Duros male who made headlines after being kidnapped along with his wife, Droza Edthatt, by members of the Human species. Shortly after marrying Droza and returning from their honeymoon, the couple was abducted by Humans, who held the newlyweds hostage on the planet Urthha for over four solar periods. The couple managed to escape the planet using a matter catalyst, a locally common piece of transportation technology.\nEtro Edthatt was a male Duros, a species of blue-green skinned, noseless humanoids. After he married fellow Duros Droza Edthatt, the couple went on a honeymoon. Upon their return, the newlyweds, while still mid-digestion, were battered with metal sticks by Human beings, forced out of their transport and loaded into another transport that Etro Edthatt thought resembled an \"upside down\" re-humidifier. The Humans then blinded the Duros and levitated them to their homeworld, which the couple believed was a planet called \"Urthha.\" Etro and Droza were stranded there for over four solar periods.\nArriving on the planet, the Duros couple adjusted their portable simultaneous translation devices known as aural synchronizers, since neither of them spoke the local language, in order to readily comprehend Human speech. Confused, they were then taken to a dinner party, where they were pinched and looked at as the guests laughed. One male Human insisted in showing Etro his collection of images of naked females, which surprised the alien.\nThe Edthatts were then led to a table, until then an unknown object to them, where they were forced to sit and consume food. To the Edthatts, Human cuisine resembled stationary products from the Vretha system—a galactic location within the Mid Rim's Hollan sector. Out of habit, Edthatt started to stamp the food, angering the hostess in the process and making her leave in what they believed to be a \"hufff.\" When trying to eat a potato, Etro Edthatt experienced an extreme physiological reaction, breaking out in collard lesions, a condition that affected Duros. The sudden reaction scared away the Humans, including the home owners, who ran off in fear and did not return to their house for the rest of the period the aliens stayed there. With the domicile empty, the Duros couple used the privacy to go to the freezer, seeing as it was their honeymoon.\nThe Edthatts spent their remaining solar periods on Urrtha enjoying themselves, practicing activities such as bouncing on antennas, reading vegetables and choking books and paintings, which, unlike the ones from their homeworld, put up little resistance. They bemoaned, however, the lack of suitable objects to scratch. When one day a young Human tried to throw folded piles of paper at the exterior of the residence, he saw the couple and helped them leave the planet by means of a matter catalyst, a device large enough to fit two grown Duros and known locally as a \"blender.\" After the child beat them in what they believed was a \"professional-level\" game of Twister, the kid put them in the device and sent them on their way home.\nThe married couple later recalled the experience with joy in a thorough article published in an edition of the news periodical The Galactic Gossip, as part of an interview conducted by staff writer Trebor Uarrac. The article included a photo of the couple, as well as an image of the technological device that ensured their safe return, a seven-speed vortex-equipped matter catalyst.\nAlthough the Duros were famed for being a species with a strong interest on space travel and for being one of the first civilizations to develop the technology to do so, Etro Edthatt and his wife, until the abduction, were not completely sure life developed elsewhere and had never before seen Humans, the most populous species in the galaxy. Additionally, he could not speak Urthha's language, a high-pitched form of verbal communication that, at first, reminded him of Mocking Trees, and which required Etro and his wife to wear portable aural synchronizers to understand and communicate with other individuals. He struggled to grasp many cultural concepts and objects common to Humans such as \"party,\" \"table,\" \"potato\" and pieces of technology like matter catalysts.\nInitially frightened with the kidnapping and the profound cultural shock, Edthatt over time developed a positive view of the whole affair, enjoying his time on Urthha. He displayed curiosity and surprise towards Human anatomy, particularly females, constantly maintaining an inquisitive stance, and often trying out new experiences, although this exploratory behavior was the cause for his collard lesion breakout on one occasion. Edthatt only lamented the fact that he and Droza could not find suitable objects to scratch. Overall, the events that transpired during his honeymoon served to confirm his hypothesis that life, especially sentient life, indeed existed beyond his homeworld, although it was not necessarily very intelligent.\nEdthatt, like all Duros, possessed red eyes, no hair, a green-blue skin color, and a long, thin and noseless head. He displayed an usual Duros trait upon having enjoyed telling the story about his trip, making use of his photographic memory.\nEtro Edthatt was featured in a two-page story titled \"Aliens Kidnapped by Humans!,\" a gossip magazine parody attributed to Trebor Uarrac of The Galactic Gossip. The story was written by Bob Carrau for the 1993 book Monsters and Aliens from George Lucas, a publication that combines creature designs and photographs from various projects of George Lucas, creator of the Star Wars franchise, with a variety of original short fiction pieces written by Carrau. Lucasfilm employee Leland Chee, who maintains the Holocron continuity database, has indicated that information contained in the book is non-canonical.\nIn the story, the Duros newlyweds are \"abducted by human beings,\" a common fiction trope that usually goes contrariwise. A couple of references to Earth are also made, such as when they mishear the name of the Human homeworld as \"Urthha\" and when the couple is said to leave the planet after playing a game of Twister and by means of a \"matter catalyst,\" pictured and referred to as the real-world home appliance known as blender.\nA picture of the Edthatts, originally a production photo from Star Wars: Episode IV A New Hope, is included in the segment, although the newlyweds are not individually identified in the image. The Duros in the original picture were canonically revealed to be Chachi De Maal in the 1993 sourcebook Galaxy Guide 7: Mos Eisley and Ohwun De Maal in the 2000 article The University of Sanbra Guide to Intelligent Life: The Duros.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Droza_Edthatt",
  "/wiki/Unidentified_Human_abductors",
  "/wiki/Human/Legends",
  "/wiki/Species/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Earth_(planet)",
  "/wiki/Star/Legends",
  "/wiki/Time/Legends",
  "/wiki/Matter_catalyst",
  "/wiki/Nose/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Unidentified_transport",
  "/wiki/Re-humidifier",
  "/wiki/Homeworld/Legends",
  "/wiki/Aural_synchronizer",
  "/wiki/Unidentified_male_Human_(Urthha)",
  "/wiki/Alien/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/Vretha_system",
  "/wiki/The_galaxy/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Hollan_sector",
  "/wiki/Unidentified_female_Human_(Urthha)",
  "/wiki/Potato",
  "/wiki/Collard_lesions",
  "/wiki/Vegetable/Legends",
  "/wiki/Book/Legends",
  "/wiki/Painting/Legends",
  "/wiki/Unidentified_Human_(Urthha)",
  "/wiki/Paper/Legends",
  "/wiki/Twister_(game)",
  "/wiki/Galactic_Gossip",
  "/wiki/Trebor_Uarrac",
  "/wiki/Realspace/Legends",
  "/wiki/Mocking_Tree",
  "/wiki/Sentience/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Bob_Carrau",
  "/wiki/1993",
  "/wiki/Monsters_and_Aliens_from_George_Lucas",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars",
  "/wiki/Leland_Chee",
  "/wiki/Holocron_continuity_database",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Chachi_De_Maal",
  "/wiki/Galaxy_Guide_7:_Mos_Eisley",
  "/wiki/Ohwun_De_Maal/Legends",
  "/wiki/2000",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Duros",
  "/wiki/Galaxy_Guide_4:_Alien_Races",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Children_of_the_Force",
  "/wiki/Jason_Fry",
  "/wiki/The_Essential_Atlas",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/The_Paradise_Snare",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/May_3",
  "/wiki/2006",
  "/wiki/June_2",
  "/wiki/2020",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars_Gamer_2"
 ]
}