{
 "name": "Eugene Talmont",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Eugene Talmont was the Imperial Prefect of Mos Eisley spaceport. Following in the footsteps of his father, he was constantly assigned to backwater worlds and cities, due to his unremarkable past. When given his Mos Eisley assignment, he at first saw it as an opportunity to reform and tame the lowlifes and riffraff that populated the streets, but in a short time, he began dedicating all his resources to obtaining a transfer.\nAt first setting his sights on Rebel fugitives who wandered into his territory, Talmont began combating the Hutt cartels that harried honest business in Mos Eisley. He had no qualms about taking bribes and getting involved in underhanded business to fight Jabba Desilijic Tiure, the most powerful crime lord in the sector. At first hiring honest Imperial citizens to infiltrate Jabba's community, Talmont's actions drew the attention of Governor Tour Aryon, who contacted the Imperial Security Bureau, Imperial Intelligence, and the Inquisitorius in turn to discover the truth behind the Prefect's dealings. Talmont was able to evade disaster, though, and by 4 ABY he was still working to destroy Jabba's empire.\nEugene Talmont served the Galactic Empire loyally, like his father, but his untarnished reputation and low-key background led him to be transferred from unremarkable post to unremarkable post. He began to develop a grudge against his father, considering him to be an inferior human being. In 0 BBY, he found himself at Mos Eisley, a spaceport on the arid planet of Tatooine, where he was to serve as Prefect. Upon learning that his predecessor, Orun Depp, had been assassinated by IG-72, he devised a series of schemes to get himself transferred. At first, Talmont saw the job as an opportunity to tame the barbaric nature of Tatooine's denizens, but after a while, he began to suspect that someone in the upper echelons of the government disliked him. A civilian officer, Talmont had a squad of Stormtroopers at his disposal, but he was required to make formal requests of Lieutenant Harburik, the squad leader. He was assigned to work out of Mos Eisley's dingy regional offices, where he would meet employees and citizens alike.\nOne of Talmont's other employees was the spy Garindan. At some stage, Garindan, working with the Devaronian Labria, was able to learn that a group of spacers were planning to break the smuggler Big Bunji out of Imperial custody, as Bunji himself was being delivered to Mos Eisley aboard a hover truck. Talmont, in response, set up a trap, and had the hover truck filled with stormtroopers, while Bunji was clandestinely delivered to Docking Bay 87. The stormtroopers, as expected, engaged the spacers, but they were able to break free, track down Bunji, and free him anyway.\nWithin the year, Talmont's power began to rival that of Governor Tour Aryon, and he had a degree of jurisdiction over the entire planet. Still, he sought to be transferred, and came up with a plan to impress his superiors. Han Solo, captain of the Millennium Falcon, was wanted by the Empire, and Talmont's men had gained intelligence that he would be returning to Tatooine to pay off Jabba Desilijic Tiure, a crime lord who had a bounty on the fugitive smuggler's head. Hiring three bounty hunters, Dengar, Udin, and Eron Stonefield, Talmont intended to have his employees camp outside Jabba's Palace and wait for Solo to arrive. Talmont promised to pay the bounty hunters considerably, and believed that the capture of such an elusive terrorist would secure his passage to a better post.\nWhat was essentially a simple plan, however, evolved into a complex, galaxy-wide chase involving kidnappings of Hutts, planetary revolutions, and trade disputes. With his Ur-Damo in the clutches of Solo, Jabba expressed interest in the hunt, and contacted Talmont. Though the Prefect was no friend of the Hutt, he assured him that the three hunters were totally capable. With the Hutt now involved, Talmont's involvement diminished. Though the hunters eventually caught Solo, they unwittingly handed them over to Rebels, disguised as Imperials. As a result, celebrations broke out across Mos Eisley, and Talmont did not get the transfer he sought.\nWithin the same year, Prefect Talmont was called upon by the Imperial Security Bureau  to research the Hutt kajidics, or clans. Talmont did so, and compiled a particularly critical and damning report of the kajidics, mentioning such psychological theories as \"The Hutt Mirror.\" Talmont's report was dispatched to the ISB, and in turn, Commander Maximillian Seerdon sent it to Grand Vizier Sate Pestage.\nIn 1 ABY, Wilhalm Skrim, Governor Aryon's secretary, referred a traveling Imperial spacer onto Talmont. Talmont, who was visiting Bestine, had several errands that the spacer was willing to run. First, he sent the spacer to kill the gangster Akkar Plint, who was working for Gohn Bimmin, an Imperial official. Bimmin had apparently fabricated evidence claiming that Talmont was involved in a bribery scandal, and was heading to Bestine to present his case. The spacer fulfilled the task, and Talmont was safe, for the moment. He then sent the spacer to assassinate Bimmin, further securing the safety of the Prefecture from harmful allegations.\nImpressed with the spacer's work, Talmont enlisted the nomad in his war against the Hutts. He sent the spacer on another assassination mission, this time to kill the Hutt employee Snrrrlagga. The spacer succeeded, and Talmont grew confident that he would gain the upper hand in the minor conflict. Governor Aryon grew suspicious of Talmont's movements, however, and enlisted the services of an Imperial Security Bureau officer to keep an eye on the Prefect. Talmont, indignant, discovered that the Bothan spy Nwilla Thar'lyat had been providing the ISB officer with details on his operations, and so sent the spacer to kill Thar'lyat.\nThough Thar'lyat perished, Aryon did not give up, and with the ISB's effectiveness hampered, enlisted Imperial Intelligence to do the job. Talmont was confident he could deal with the Intelligence officer, but knew that the officer's guard, Klaua Jik, would pose a problem. Reminding the spacer to be exceptionally secretive, Talmont enlisted them, once again, for an assassination task, with Jik as the target. Jik, shortly thereafter, perished, and Talmont found himself able to move freely again. Still, Aryon was not satisfied. She called upon the Inquisitorius, who sent one of their number to interrogate those close to Talmont. The Prefect, panicking, dispatched the spacer to kill Harbo Linn, a member of the Prefecture who would reveal damning information if he were to fall into the hands of the Inquisitor. The spacer succeeded, but Talmont was too distraught to be pleased.\nTalmont realized he had to get rid of Jabba and his criminal enterprises that riddled Mos Eisley. At first, he hired Imperial agents to infiltrate Jabba's Palace and steal data discs containing information about the crime lord's bribery of important officials. He continued in his efforts, but instead of hampering the crime lord's movements, he simply created a set of easily avoided obstacles. Further setbacks occurred with the hiring of Dannik Jerriko, an Anzati assassin. Jerriko was in both Talmont and Lady Valarian's employ, causing the Prefect a great deal of grief and confusion. In 4 ABY, he contacted two members of Jabba's cartel: Tessek and Ree-Yees. Ree-Yees, an alcoholic murderer from Kinyen, had three deaths on his record, but Talmont agreed to clear the Gran's name if he could eliminate Jabba. As such, he had his men deliver the parts of a bomb gradually to Ree-Yees, in the hope that the Gran would be able to assemble it and eliminate Jabba.\nTessek, Jabba's accountant, made a separate deal with Talmont. He would arrange to have Jabba inspect a spice shipment in a large warehouse in Mos Eisley, during which Talmont and his men would raid the illegal stash and arrest the Hutt. Talmont believed that by eliminating Jabba, either way, he would be transferred to another world. The day before the planned raid, Talmont went to the Lucky Despot with several of his men, and was met by Ephant Mon, another of Jabba's employees. Watching the Chevin dispatch a pair of local thugs, he commended Mon on his combat skills. Mon, however, hinted that he knew of Tessek's plan, causing Talmont to fret. Luckily for Talmont, Jabba was assassinated by Leia Organa the following day at the Pit of Carkoon.\nThe Prefect was also working with swoop gangs in order to incite chaos in Mos Eisley, allowing him to declare martial law and consolidate his power. A Light corvette arrived and told him about the Battle of Endor. However, when his plot came to light he was forced to flee.\nEugene Talmont was a rather bitter man, particularly towards his father and his superiors. His father had, in Talmont's opinion, always been given choice assignments and postings, while he himself had received nothing but backwater posts. Adding insult to injury, Talmont believed himself to be a far better man than his father. The Prefect did not put his posting to Tatooine down to coincidence, either, as he was convinced that his superiors had given him a poor assignment just to spite him. While at first Talmont thought Mos Eisley may provide him with an opportunity to subdue the rowdy citizens, he quickly discovered that it was a highly dangerous and barren city, with practically no prospects for advancement. He apparently also had a vicious temper when learning of failures from within his unit, as the colonel in charge of what was the Tusken Bunker hired a spacer to clear out the Tusken Raiders who had taken over the base over reporting the loss due to fearing being reprimanded by him.\nHe had no qualms with taking bribes, but was utterly disgusted at the fact that he was accused of misconduct. He frequently clashed with the governor, and usually tried to avoid her, but when Talmont's assassination orders got out of hand, the governor began to investigate. Talmont panicked in such an instance, and simply ordered more killings, which did, eventually, resolve the problem. He believed that accepting bribes was perfectly normal for a man in his position, and accepted credits from almost every business in Mos Eisley, in exchange for a selectively blind eye. Talmont's objective became not so much \"fixing\" Mos Eisley, but doing something noteworthy to attract the attention of his superiors, as he hated Tatooine and sought a transfer. He concocted a wide variety of schemes, none of which succeeded.\nA slight man of wiry build, Talmont was not a particularly imposing figure, and was also physically short-sighted. In his first year at Mos Eisley, he wore a toupee, but substituted it in 1 ABY for an officer's cap, to match his prefect's uniform. He had a walking stick as well, but he had seemingly done away with it by the time of his second year on the job.\nEugene Talmont was created by Martin Wixted and first appeared in the West End Games sourcebook Galaxy Guide 7: Mos Eisley. The character went on to appear in the short-story collection Tales from Jabba's Palace, and made his first in-story appearance in Kenneth C. Flint's Old Friends: Ephant Mon's Tale. The character was later used by Dave Wolverton, as the catalyst for the plot of the second arc of the Star Wars Missions series, in 1998.\nIn the Star Wars Miniatures Battles scenario A Line in the Sand..., which occurs during the Rebellion on Tatooine, Prefect Talmont can be rescued by the Empire, captured by the Mos Eisley militia, or killed by the swoop gang.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Unidentified_Imperial_Prefect",
  "/wiki/Eugene_Talmont",
  "/wiki/West_End_Games",
  "/wiki/A_Rebel_Agent",
  "/wiki/Galaxy_Guide_7:_Mos_Eisley",
  "/wiki/Star_Wars_Trilogy_Sourcebook,_Special_Edition",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Mammon_Hoole",
  "/wiki/Imperial_Prefect",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Tour_Aryon",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Prefect/Legends",
  "/wiki/Orun_Depp",
  "/wiki/IG-72",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Harburik",
  "/wiki/Garindan",
  "/wiki/Devaronian/Legends",
  "/wiki/Kardue%27sai%27Malloc/Legends",
  "/wiki/Big_Bunji/Legends",
  "/wiki/Hovertruck/Legends",
  "/wiki/Docking_Bay_87_(Mos_Eisley)",
  "/wiki/Han_Solo/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Dengar/Legends",
  "/wiki/Udin",
  "/wiki/Eron_Stonefield",
  "/wiki/Jabba%27s_Palace",
  "/wiki/The_galaxy/Legends",
  "/wiki/Huttese/Legends#People",
  "/wiki/Kajidic/Legends",
  "/wiki/The_Hutt_Mirror",
  "/wiki/Commander/Legends",
  "/wiki/Maximillian_Seerdon",
  "/wiki/Grand_Vizier/Legends",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/1_ABY/Legends",
  "/wiki/Wilhalm_Skrim",
  "/wiki/Spacer/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Akkar_Plint",
  "/wiki/Gohn_Bimmin",
  "/wiki/Snrrrlagga",
  "/wiki/Bothan/Legends",
  "/wiki/Nwilla_Thar%27lyat",
  "/wiki/Klaua_Jik",
  "/wiki/Harbo_Linn",
  "/wiki/Dannik_Jerriko",
  "/wiki/Anzat_(species)",
  "/wiki/Tessek/Legends",
  "/wiki/Ree-Yees/Legends",
  "/wiki/Kinyen/Legends",
  "/wiki/Gran/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Lucky_Despot",
  "/wiki/Ephant_Mon/Legends",
  "/wiki/Chevin/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Light_corvette/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Tusken_Bunker",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Martin_Wixted",
  "/wiki/Tales_from_Jabba%27s_Palace",
  "/wiki/Kenneth_C._Flint",
  "/wiki/Old_Friends:_Ephant_Mon%27s_Tale",
  "/wiki/Dave_Wolverton",
  "/wiki/Star_Wars_Missions",
  "/wiki/1998",
  "/wiki/Star_Wars_Miniatures_Battles",
  "/wiki/A_Line_in_the_Sand...",
  "/wiki/Rebellion_on_Tatooine",
  "/wiki/Star_Wars_Missions_5:_The_Hunt_for_Han_Solo",
  "/wiki/Star_Wars_Missions_7:_Ithorian_Invasion",
  "/wiki/There%27s_Many_a_Slip_Betwixt_Cup_and_Lip",
  "/wiki/Mos_Eisley_Adventure_Set",
  "/wiki/Of_the_Day%27s_Annoyances:_Bib_Fortuna%27s_Tale",
  "/wiki/Out_of_the_Closet:_The_Assassin%27s_Tale",
  "/wiki/Goatgrass:_The_Tale_of_Ree-Yees",
  "/wiki/A_Free_Quarren_in_the_Palace:_Tessek%27s_Tale",
  "/wiki/Skin_Deep:_The_Fat_Dancer%27s_Tale",
  "/wiki/The_Passage_From_Perdition",
  "/wiki/The_Illustrated_Star_Wars_Universe",
  "/wiki/Cynabar%27s_Fantastic_Technology:_Droids",
  "/wiki/Platt%27s_Smugglers_Guide",
  "/wiki/Secrets_of_Tatooine",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Star_Wars_Galaxies",
  "/wiki/Star_Wars_Insider_65",
  "/wiki/Gamescape",
  "/wiki/Star_Wars_Insider_68",
  "/wiki/Underworld:_A_Galaxy_of_Scum_and_Villainy",
  "/wiki/Star_Wars_Insider_89",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_11",
  "/wiki/The_Official_Star_Wars_Fact_File_33",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Missions_6:_The_Search_for_Grubba_the_Hutt",
  "/wiki/Star_Wars_Missions_8:_Togorian_Trap",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Tatooine_Manhunt"
 ]
}