{
 "name": "Eustacia_Okka",
 "display_name": "Eustacia Okka",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "University of Bar'leth",
      "Shadow University"
     ]
    }
   ]
  }
 ],
 "content": "Eustacia Okka was a Mirialan female professor who worked for the Shadow University. A former classmate of Chelli Lona Aphra at the University of Bar'leth, Okka launched her own archeological career after being expelled from the Shadow University, who claimed her writings on the Rings of Vaale were not credible, and became a Doctor. Some time after the Battle of Hoth, she would join her former friend Aphra's crew to hunt for the rings herself.\nEustacia Okka was a classmate and friend of the rogue archaeologist Chelli Lona Aphra while they both worked on their doctorates at the University of Bar'leth. At one point, Okka read Lost Legends of the High Republic for her dissertation research when she was bored during a lecture by the Sava. She expected Aphra to think it was weird, but Aphra told her to stop caring so much what other people thought and kissed her. Eventually, their relationship turned sour. Okka became a professor at the Shadow University, but soon after she published an article in the Shadow University Journal about the Rings of Vaale, an artifact that was supposedly cursed, Okka was expelled by the University for what they called \"insufficient credible academic research.\" Following her expulsion, she completed independent field work with assistance from the droid TA-418, and began to carry her own blaster.\nDuring the Imperial Era, Okka was studying the Ruins of Kolkur when mercenaries on behalf of Ronen Tagge, scion of the powerful House of Tagge, approached her, demanding that she help them find the rings. Soon after, her former classmate Aphra, graduate student Detta Yao, bounty hunter Krrsantan, and the smuggler Just Lucky approached her about the rings as well. In that moment the mercenaries returned, but the crew escaped onto Aphra's ship. Okka was initially hesitant, but eventually chose to help Aphra and her associates when Aphra promised her sole credit of the discovery, hoping that finding the Rings would lead the Shadow University to reinstate her credentials.\nEn route to Dianth, where the rings were rumored to be located, Okka's droid TA-418 played a hologram message of Tagge, who told her that he still wanted to work with her to find the rings, tempting her with the vast resources at his disposal. As Tagge told her that he would show her no mercy if she refused him, Okka turned off the message and accusingly said that there was a liar aboard the ship.\nThe crew ventured into the city of Vaale, where Okka went off alone and discovered the fabled workshop of The Architects of Vaale. The group ventured underground into the sanctum. As they tried to get past the door that blocked their path, Okka and Lucky doubled back to the murals to look for clues on how to pass. As Yao attempted to open the door, the floor collapsed out from under them, and Okka fell alongside Lucky and Black Krrsantan.\nSana Starros had been tasked by Domina Tagge with finding Aphra, who had been possesed by the Spark Eternal, so she assembled a team of people who knew Aphra well, including Okka since she was one of Aphra's exes. They met up with Magna Tolvan who initially viewed the mission and the team with contempt, but joining after an impassioned appeal by Starros. She believed Aphra would've hidden something important at the site of a personal victory since she would like to brag. They decided to go to Birukay, where they found a lot of dead and heavily wounded Crimson Dawn members. As they walked, they spotted a small hut, but were attacked by more Crimson Dawn members. Starros told Okka to get Korin Aphra to safety from the fight. But when they reached the hut, they realised that it was a trap, and Aphra had left 0-0-0 and BT-1.\nEustacia Okka was a green-skinned Mirialan that had darker green spots on the left side of her face. She had white hair, dark eyebrows, and purple eyes. In University, Aphra noted that Okka worried too much about other people's perception of her and her work.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Doctor_Aphra_(2020)_3",
  "/wiki/Doctor_Aphra_(2020)_4",
  "/wiki/Doctor_Aphra_(2020)_5",
  "/wiki/Doctor_Aphra_(2020)_19",
  "/wiki/Doctor_Aphra_(2020)_21",
  "/wiki/Doctor_Aphra_(2020)_23",
  "/wiki/Doctor_Aphra_(2020)_24",
  "/wiki/Doctor_Aphra_(2020)_25",
  "/wiki/Mirialan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/University_of_Bar%27leth",
  "/wiki/Shadow_University",
  "/wiki/Professor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Rings_of_Vaale",
  "/wiki/Doctor",
  "/wiki/Battle_of_Hoth",
  "/wiki/Chelli_Lona_Aphra%27s_crew",
  "/wiki/Archaeologist",
  "/wiki/Sava",
  "/wiki/Droid",
  "/wiki/TA-418",
  "/wiki/Blaster",
  "/wiki/Imperial_Era",
  "/wiki/Ruins_of_Kolkur",
  "/wiki/Tagge%27s_mercenaries",
  "/wiki/Ronen_Tagge",
  "/wiki/House_of_Tagge",
  "/wiki/Detta_Yao",
  "/wiki/Bounty_hunter",
  "/wiki/Krrsantan",
  "/wiki/Smuggler",
  "/wiki/Just_Lucky",
  "/wiki/Ark_Angel_III",
  "/wiki/Dianth",
  "/wiki/Hologram",
  "/wiki/Vaale",
  "/wiki/The_Architects_of_Vaale",
  "/wiki/Sana_Starros",
  "/wiki/Domina_Tagge",
  "/wiki/Spark_Eternal",
  "/wiki/Magna_Tolvan",
  "/wiki/Birukay",
  "/wiki/Crimson_Dawn",
  "/wiki/Korin_Aphra",
  "/wiki/0-0-0",
  "/wiki/BT-1",
  "/wiki/Category:Images_of_Eustacia_Okka",
  "/wiki/Doctor_Aphra_(2020)_1",
  "/wiki/Doctor_Aphra_(2020)_2",
  "/wiki/Doctor_Aphra_(2020)_26",
  "/wiki/StarWars.com"
 ]
}