{
 "name": "Evaan Verlaine",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Amber"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Organa",
      "Alliance to Restore the Republic",
      "Gold Squadron",
      "Starlight Squadron",
      "Gold Squadron",
      "Starlight Squadron",
      "New Republic",
      "New Republic Defense Fleet",
      "New Republic Defense Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Evaan Verlaine was a human female pilot who served as a lieutenant in the Alliance to Restore the Republic and the New Republic during the Galactic Civil War. She was born on Alderaan and was one of the few Alderaanian youths mentored by Queen Breha Organa, which cultivated a deep respect for the House of Organa. Verlaine, a committed royalist, followed in the footsteps of her homeworld's leaders and became a member of the Rebel Alliance, serving as a pilot in the Rebel Alliance Starfighter Corps.\nAfter the Galactic Empire's deep space mobile battle station, the Death Star, destroyed Alderaan, Verlaine heard whispers that the Empire was hunting down surviving Alderaanians. Following the destruction of the Death Star during the Battle of Yavin, Verlaine pledged her loyalty to Princess Leia Organa. The two defied the orders of the Rebel leadership and set out on their own mission to find and protect surviving Alderaanians from the Empire. The two first made their way to the planet Naboo, where they took on a small group of Alderaanian citizens and had to inform them of their world's destruction, before heading for the planet Sullust.\nEvaan Verlaine was born on the planet Alderaan many years before the Battle of Yavin. At a young age, she was one of only a few Alderaanian youths to be mentored by Queen Breha Organa, the planet's ruling monarch. Through her time with the queen, Verlaine learned much about the culture and heritage of her homeworld and formed a life-long respect for both the queen and House of Organa. She became a committed royalist, believing in the Alderaanian monarchy, and followed in the footsteps of the planet's leaders by joining the Alliance to Restore the Republic. As a member of the Rebellion against the rule of the Galactic Empire, Verlaine became a Rebel pilot.\nIn 0 BBY, Verlaine participated in the Battle of Scarif as Gold Three from Gold Squadron as part of the Rebel support forces attacking the Shield Gate above Scarif.\nAssisting in the space battle as the Alliance Fleet attacked the Shield Gate, Gold Squadron conducted several attack runs on the Shield Gate in an effort to weaken the shield. After several runs against the gate, the Squadron redirected their efforts against a pair of Star Destroyers.\nIn 0 BBY, she served in the Great Temple, the Rebel base on Yavin 4, when Alderaan was destroyed. The destruction, known to Alderaanian survivors as \"the Disaster,\" was carried out by the Death Star, the Empire's deep space mobile battle station, and led to the death of Queen Organa and her husband, Viceroy Bail Organa, one of the founders of the Rebel Alliance. The Rebels gained a quick victory, however, when Princess Leia Organa, the queen's adoptive daughter, brought the stolen Death Star plans to Yavin 4. Once the plans were analyzed and a weakness in the station was discovered, a small fleet of Rebel starfighters launched the Battle of Yavin and destroyed the Death Star. Verlaine participated in the battle as Gold Three of Gold Squadron, alongside seven other Y-wings led by Jon \"Dutch\" Vander. As Verlaine attempted to make her way back to the Yavin moon, her Y-wing was targeted by the TIE fighter of Senior Lieutenant Iden Versio, but the rebel pilot was able to successfully make her way back to the base, unlike the rest of her squadron.\nAfter the Battle of Yavin, only a small group of the initial task force returned. Luke Skywalker, the pilot who fired the shot that destroyed the Death Star; and Han Solo, a smuggler who helped Organa bring the Death Star plans to the Rebel base and aided Skywalker in the battle, both received medals in a ceremony held in the Great Temple. Verlaine was in attendance at the ceremony. After the medals were presented, Organa said a few words in remembrance of her parents and her homeworld. Her words were measured and lacked emotion, leading some of the assembled Rebels to refer to her as the \"ice princess.\" When the ceremony ended, Verlaine remained behind and paid her respects to Queen Organa and Viceroy Organa at a memorial statue.\nBecause the Empire learned of the location of the Rebel base before the Battle of Yavin, Rebel General Jan Dodonna ordered the evacuation of the Great Temple. Verlaine and some of her fellow Rebels packed supplies in the base's hangar that would be loaded into the Rebel fleet that arrived at Yavin 4. While working, she and another Rebel discussed Organa's cold demeanor. The princess overheard them and approached, at which point the other Rebel quickly left, leaving Organa and Verlaine to talk on their own. Verlaine explained her loyalty to House of Organa and to the late queen, and she pledged her service to the princess, despite her initial reservations about how the princess was handling her duties in the aftermath of Alderaan's destruction. Verlaine also told Organa about rumors suggesting that the Empire was hunting down all surviving Alderaanians, rumors that Verlaine believed. Between Verlaine's concerns about Organa's leadership and the rumors, Organa decided to leave the Rebel base without a Rebel escort, in defiance of General Dodonna's orders, and find the surviving Alderaanians to protect them. Verlaine agreed to go with her in order to preserve their planet's culture.\nVerlaine, Organa, and the astromech droid R2-D2, left Yavin 4 aboard a T-1 shuttle, which Verlaine piloted. Before they left, Organa sent a holographic recording to General Dodonna informing him of why she had to leave the Rebel base in violation of his orders. Verlaine disagreed with sending the message as she believed it would lead the Rebels to send their forces to stop them from leaving, a concern that was proven right when Skywalker and Wedge Antilles—the only two members of Red Squadron who survived the Battle of Yavin—intercepted the shuttle and ordered them to turn back. Verlaine and Artoo quietly worked out a strategy in which they would lead the X-wing pilots to believe that they had intercepted the shuttle and then release a part of the ship that the pilots would believe was an important part of the hyperdrive, but that was in actuality a decoy. They did not tell the princess, as the pilots were listening into their conversations. Organa was irate once the plan was enacted, believing that Verlaine had recklessly compromised the mission by damaging the ship when it struck Antilles' X-wing. However, when the fighters backed off to avoid the presumed damage, Verlaine jumped the ship into hyperspace.\nOnce the ship was safely in hyperspace, Verlaine admitted to the princess that the maneuver was a trick. Organa thanked her for her efforts and the two made their way towards the planet Naboo. During the voyage, Organa and Verlaine briefly debated the latter's role in the princess' mission, with Organa making it clear that she wanted Verlaine to be an accomplice rather than a servant. Once the shuttle arrived over Naboo, Artoo sent out a signal that falsely identified them as Imperial auditors, as Organa believed that no authorities would question them due to not wanting to interact with auditors. Verlaine was skeptical of the plan, as there was a bounty on the princess' head and Naboo was the homeworld of the Emperor, Sheev Palpatine. Organa felt it important to try anyway as there was a cloister of Alderaanian musicians known as Melodic Order living on the planet, and she believed that the Empire would start the eradication of surviving Alderaanians with that particular group.\nThe shuttle landed at a dock in Theed, the capital city of Naboo. Organa identified herself under a false name, First Minister Solo, and demanded that all fees be charged to the Imperial Advisor's Office. Verlaine questioned this approach, wondering if it would have been simpler to pay cash credits and avoid attracting Imperial attention, but Organa told her that they did not have any money on them and would instead have live by their wits. The princess abruptly stopped talking upon seeing a mural of the late Padmé Amidala, who served as Queen of Naboo and later as its Senator during the Clone Wars. Organa recognized her somehow and Verlaine asked who it was, but the princess brushed it off.\nThe group made their way through the streets of Theed, where they were spotted by Lord Junn, an old friend of the princess—who was secretly working for his own benefit, and had recognized Artoo's signal as a plant that effectively alerted the Imperials that the princess was on the planet. Organa introduced Verlaine to the man, and the Rebel pilot was cautious about the encounter, particularly with the princess having taken off the hood that had been obscuring her face from those who might have recognized her. Junn led the group to his palace, where he revealed that he knew why Verlaine and Organa were on Naboo and offered to put them into contact with the owner of Club Deeja, Mul Sanaka, where Melodic Order performed via hologram. Junn left the area to speak with Sanaka and quietly inform him of the princess' identity, and Verlaine took the opportunity to make her suspicions known and tell the princess that she was still worried about the bounty on Organa's head. Organa pressed Verlaine to trust her, but the pilot still had her doubts. When Junn returned, he told them that he had been in contact with Sanaka and that they could proceed to the club.\nVerlaine and Organa made their way to Club Deeja in the Marina District of the city Keren. Their arrival attracted considerable attention and concern amongst the locals, who believed it to be an Imperial shuttle. Verlaine and Organa attempted to enter the club but were stopped by Sanaka, who claimed to believe that Organa was First Minister Solo and was there to collect the Alderaanians for the Empire. Snes, the club guard, forced them to hand over their weapons, at which point he revealed that he knew who Organa really was and ordered Verlaine and the princess to enter the club. Rather than comply, the princess attacked Snes, leading to a brawl in the club's entrance between Verlaine, Organa, and the guards. The two took out the guards and Sanaka nearly shot the princess, before a fellow Alderaanian, Uwa Pareece, knocked him unconscious and revealed that she too knew who the princess was.\nPareece, who had kept the news of the Disaster from the collective of Alderaanians she protected, led Verlaine and Organa into the club. Verlaine watched as Pareece revealed the truth to her people, and as Organa promised to protect them. The Alderaanian cloister agreed to join them, and Organa was able to barter a ship, named Lord Junn, from Junn in exchange for letting him live after his betrayal. The cruiser, big enough to carry the Alderaanians, followed Verlaine and Organa's shuttle as it made its way towards the planet Sullust in the Outer Rim Territories.\nVerlaine and Organa were then taken to Sullust's Alderaan Enclave by a smuggler, Tivvy. There, they were taken to Preserver Jora Astane. Astane was at first suspicious that the princess was going to turn them to the Empire but Organa told her about her ship in orbit and how they were rescuing Alderaanian survivors. Astane ordered Clovis to scan the ship, ignoring Veraine's comment to trust their princess. As Astane toured them the Enclave, they got into an argument. Verlaine accused Astane of being a hypocrite and ravaging what was left of Alderaan's culture. Their conversation was interrupted by the replay of a transmission between Lord Junn and an Imperial cruiser. Verlaine and Organa realized that there was a traitor in their midst aboard the ship but Astane accused them of being traitors, as they found out that the cruiser had entered the orbit. Astane's troops open fired on them and Verlaine protected Organa as they made their way to a computer to warn Lord Junn of the incoming Imperials.\nAs more troops fired upon them, R2 intervened and they escaped into a waterway. As they were studying the map Verlaine insisted Organa to not blame herself for what happened to Alderaan. The group then encountered Rockrenders who fed on dense minerals. R2 led the creatures to the stormtroopers who had infiltrated the enclave and were firing upon the Alderaanians. With their forces combined, all the Alderaanians defeated the Imperials and on Astane's command knelt before their princess.\nNien Nunb, a Sullustan smuggler, transported the Alderaanians off Sullust. Verlaine later oversaw supplies and weapons being bought from Nunb's ship, the Mellcrawler, to the Lord Junn. She then took Nunb to meet with Organa, to express their gratitude. Organa awarded Nunb the Chalcedony waves from her late mother, Queen Breha Organa.\nVerlaine then rescued Organa from Dreed and his stormtroopers using Nunb's ship to pass the Star Destroyer. Organa then ordered Verlaine to warn the Lord Junn of the Star Destroyer's imminent arrival, and were joined by thousands of other Alderaanian survivors. Verlaine and Organa then brought Tula back to her sister Tace. Verlaine then encouraged Organa to continue leading her people with Verlaine as her friend. Following their victory over the Empire, Verlaine celebrated alongside Nunb, Organa and other Alderaanians. Before Organa left to return to the Rebel Alliance, Organa recommended that the Alderaanians elect a new princess to lead them and said that Verlaine should be the one elected.\nAccording to the cartographer Emil Graf, as the Alliance evacuated their base on Yavin, they were intercepted by an Imperial Star Destroyer. It was up to Verlaine to lead a team to stop the Destroyer. Although they took the bridge, the Imperials had locked down the controls. As her troops argued about what to do, she went to the hangar to pilot a Raider-class corvette, which she then rammed into the mighty vessel, ejecting at the last moment. The impact was enough to knock it off course when it fired, causing the blast to level the top of a nearby mountain. The act bought enough time to finish the evacuation.\nIn 3 ABY, Verlaine was recruited into Starlight Squadron as part of the Fourth Division's Operation Starlight. The squadron was tasked with finding the scattered divisions of the Rebel Alliance fleet following the Battle of Hoth, to warn them that the Galactic Empire had cracked Alliance communications and to deliver a new Trawak code that C-3PO and his team had developed. During their search, the squadron discovered wreckage of the Sixth Division near Felucia and encountered Imperial probe droids waiting nearby. The probe droids latched onto the astromechs of the X-wings and attempted to access their archives. Fearing the probe droids getting the other rendezvous points, Wedge Antilles suggested shooting them off, however Shara Bey  questioned their ability to actually pull it off. Instead, Bey ordered all pilots to set their astromech's self-destruct and eject them. However, doing this meant losing their nav data and getting back home. With no other choice, the droids ejected and detonated, saving their valuable data from the Empire. With no time to catch their breath, the Imperial II-class Star Destroyer Tarkin's Will arrived and attacked the squadron.\nFollowing the Battle of Endor, Evaan joined the New Republic Defense Fleet. In 5 ABY, Evaan was stationed at Hanna City Spaceport on Chandrila, the capital of the New Republic; the successor to the Rebel Alliance. After the slicer Conder Kyl informed Leia Organa that the Empire had unleashed an orbital bombardment of the planet Kashyyyk in response to a Wookiee uprising orchestrated by Leia's husband Han Solo and his Wookiee co-pilot Chewbacca, Leia managed to convince Verlaine to fly her on the freighter Millennium Falcon to the Kashyyyk system by appealing to her Alderaanian patriotism.\nEvaan served as Leia's co-pilot during a brief space battle with three Imperial Star Destroyers above Kashyyyk. Evaan and Leia were reinforced by Captain Wedge Antilles' Phantom Squadron and Admiral Ackbar's cruiser Home One. After Solo and Chewie managed to hijack the Star Destroyer Dominion and destroy the Vitiator, the remaining Star Destroyer Neutralizer capitulated to the New Republic; ending the Imperial occupation of Kashyyyk. Evaan and Leia then flew into the Dominion's hangar where Leia reunited with Han.\nEventually, in addition to her service in the Republic Starfleet, Verlaine was also entrusted with the managing of Leia Organa's image. As such, she was charged with approving likenesses of her friend in works of propaganda.\nEvaan Verlaine was a human female with blonde hair, light brown eyes, and light skin. As a rebel pilot, she wore an orange flight suit accompanied with a flight helmet similar to Blue Leader Antoc Merrick's.\nShe was mentored by the Queen of Alderaan herself and, as a result, had a strong reverence towards the throne of Alderaan. The queen earned Verlaine's respect, and Verlaine became a strong royalist as a result. Even after the destruction of Alderaan, Verlaine pledged her loyalty to Princess Organa, seeing her as the rightful queen and leader of the remnants of the Alderaanian people. Though Organa objected to such treatment, Verlaine believed it was important to maintain one of the few parts of Alderaanian culture that survived the Disaster. That included the safety of the princess; during their mission to save Melodic Order on Naboo, Verlaine raised a number of concerns to how Organa was conducting the mission, including how the princess would put herself into potential jeopardy.\nEvaan regarded herself as an Alderaanian pilot first and a New Republic pilot second. Her friendship and respect for Princess Leia led her to accompany her on the Millennium Falcon during a dangerous mission to Kashyyyk.\nVerlaine was a skilled pilot in the Rebel Alliance. She was able to pilot the T-1 shuttle away from Yavin 4 on her mission with Organa, tricking seasoned pilots Luke Skywalker and Wedge Antilles in the process. The maneuver she used to escape the two X-wing pilots left Skywalker impressed. She also had effective combat skills, demonstrated in such situations as eliminating at least one Besalisk guard outside of Club Deeja on Naboo. Evaan was also a competent co-pilot who once flew the Millennium Falcon with Princess Leia.\nEvaan Verlaine was created for the 2015 Marvel comic book mini-series Star Wars: Princess Leia, written by Mark Waid and with art by Terry Dodson. She first appeared in Princess Leia 1, in which she was identified only as Evaan, and her surname was revealed in Princess Leia 2. In designing the look of the character, Dodson worked off a suggestion from Waid to make Verlaine Organa's \"physical opposite: tall, blonde, and blue eyed.\" He added angles to her face in order to draw a contrast to Organa's look, but at the same time he wanted there to be some level of consistency between the two characters. He gave them both hairstyles that he attributed to Alderaan, based on the Northern European look that Organa had in Star Wars: Episode IV A New Hope.\nEvaan Verlaine is not seen physically in Star Wars: Episode IV A New Hope. However, it was confirmed in later sources that she was the Y-wing pilot who survived the Battle of Yavin. In the Star Wars Legends continuity, the Y-wing pilot who survived the Battle of Yavin was Keyan Farlander.\nVerlaine later made a cameo appearance in Chuck Wendig's 2016 novel Aftermath: Life Debt, the second installment in The Aftermath Trilogy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Expand",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/Grounded",
  "/wiki/Star_Wars:_Operation_Starlight",
  "/wiki/Star_Wars_(2020)_15",
  "/wiki/Star_Wars_(2020)_21",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/Age_of_Rebellion_-_Princess_Leia_1",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Talk:Evaan_Verlaine",
  "/wiki/Alderaan",
  "/wiki/Human",
  "/wiki/Alderaanian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/House_of_Organa",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Starlight_Squadron",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Pilot",
  "/wiki/Lieutenant",
  "/wiki/Galactic_Civil_War",
  "/wiki/Reproduction",
  "/wiki/Queen",
  "/wiki/Breha_Organa",
  "/wiki/Homeworld",
  "/wiki/Rebel_pilot",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_station",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/The_Disaster",
  "/wiki/Battle_of_Yavin",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Mission_to_rescue_the_survivors_of_Alderaan",
  "/wiki/Naboo",
  "/wiki/Sullust",
  "/wiki/Planet",
  "/wiki/Standard_year",
  "/wiki/Monarchy",
  "/wiki/0_BBY",
  "/wiki/Battle_of_Scarif",
  "/wiki/Gold_Three",
  "/wiki/Alliance_Military",
  "/wiki/Shield_Gate",
  "/wiki/Scarif",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Squadron",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Marriage",
  "/wiki/Viceroy",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Death_Star_plans",
  "/wiki/Fleet",
  "/wiki/Starfighter",
  "/wiki/Yavin_Prime",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Jon_Vander",
  "/wiki/Moon",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Senior_Lieutenant",
  "/wiki/Iden_Versio",
  "/wiki/Luke_Skywalker",
  "/wiki/Han_Solo",
  "/wiki/Smuggler",
  "/wiki/Medal_of_Bravery",
  "/wiki/Royal_Award_Ceremony",
  "/wiki/Water",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Evacuation_of_Yavin_4",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Jan_Dodonna%27s_T-1_shuttle",
  "/wiki/T-1_shuttle_(Rebel_Alliance)",
  "/wiki/Hologram",
  "/wiki/Wedge_Antilles",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Hyperdrive",
  "/wiki/Hyperspace",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Musician",
  "/wiki/Melodic_Order",
  "/wiki/Theed",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Minister",
  "/wiki/Imperial_Advisor%27s_Office",
  "/wiki/Credit",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Clone_Wars",
  "/wiki/Lord",
  "/wiki/Junn",
  "/wiki/Junn%27s_palace",
  "/wiki/Club_Deeja",
  "/wiki/Mul_Sanaka",
  "/wiki/Marina_District",
  "/wiki/Keren",
  "/wiki/Snes",
  "/wiki/Uwa_Pareece",
  "/wiki/Starship",
  "/wiki/Lord_Junn",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Alderaan_Enclave",
  "/wiki/Tivvy",
  "/wiki/Preserver",
  "/wiki/Jora_Astane",
  "/wiki/Covis",
  "/wiki/Tace",
  "/wiki/Rockrender",
  "/wiki/Nien_Nunb",
  "/wiki/Sullustan",
  "/wiki/Mellcrawler",
  "/wiki/Cartographer",
  "/wiki/Emil_Graf",
  "/wiki/Raider-class_corvette",
  "/wiki/3_ABY",
  "/wiki/Fourth_Division",
  "/wiki/Operation_Starlight",
  "/wiki/Battle_of_Hoth",
  "/wiki/Trawak",
  "/wiki/C-3PO",
  "/wiki/Sixth_Division",
  "/wiki/Felucia",
  "/wiki/Ambush_near_Felucia",
  "/wiki/Viper_probe_droid",
  "/wiki/Shara_Bey",
  "/wiki/Starlight_Leader",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Tarkin%27s_Will",
  "/wiki/Battle_of_Endor",
  "/wiki/5_ABY",
  "/wiki/Hanna_City",
  "/wiki/Spaceport",
  "/wiki/Chandrila",
  "/wiki/Slicer",
  "/wiki/Conder_Kyl",
  "/wiki/Kashyyyk",
  "/wiki/Wookiee",
  "/wiki/Liberation_of_Kashyyyk",
  "/wiki/Chewbacca",
  "/wiki/Millennium_Falcon",
  "/wiki/Kashyyyk_system",
  "/wiki/Captain",
  "/wiki/Phantom_Squadron",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/Home_One",
  "/wiki/Dominion",
  "/wiki/Vitiator",
  "/wiki/Neutralizer",
  "/wiki/Hangar",
  "/wiki/Propaganda",
  "/wiki/Flight_suit",
  "/wiki/Flight_helmet",
  "/wiki/Blue_Leader",
  "/wiki/Antoc_Merrick",
  "/wiki/Besalisk",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/2015",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Princess_Leia",
  "/wiki/Mark_Waid",
  "/wiki/Terry_Dodson",
  "/wiki/Princess_Leia_1",
  "/wiki/Princess_Leia_2",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Keyan_Farlander/Legends",
  "/wiki/Chuck_Wendig",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Star_Wars:_The_Aftermath_Trilogy",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Retcon",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Luke_vs._the_Death_Star_-_X-wing_Assault",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_Heroes_Path",
  "/wiki/Duty_Roster",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_A_New_Hope_Cinestory_Comic",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/Leia_Charts_Her_Own_Course",
  "/wiki/Galactic_Adventures_Storybook_Collection",
  "/wiki/Princess_Leia_3",
  "/wiki/Princess_Leia_4",
  "/wiki/Princess_Leia_5",
  "/wiki/Star_Wars_(2020)_10",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/Star_Wars_(2020)_12",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Tales_from_Wild_Space:_The_Flat_Mountain_of_Yavin",
  "/wiki/Star_Wars_Adventures_(2017)_2",
  "/wiki/Category:Images_of_Evaan_Verlaine",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_23",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Princess_Leia:_Royal_Rebel",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/BTL-A4_Y-Wing_Expansion_Pack",
  "/wiki/Rebel_Alliance_Conversion_Kit",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_70",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Princess_Leia_Organa",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Insider",
  "/wiki/One_Thousand_Levels_Down",
  "/wiki/Star_Wars_Insider_151",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/4_ABY",
  "/wiki/Kes_Dameron",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars_Q%26A",
  "/wiki/Star_Wars_Insider_63"
 ]
}