{
 "name": "Eve Yarrow",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Acherin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yarrow Industries",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Eve Yarrow was the daughter of Evin Yarrow, the head of Yarrow Industries. She was from Sood, the capital of the planet Acherin. Her mother died when she was a young girl, so she was raised by her father. She traveled the galaxy with her father as a child to places such as factories, trade shows, and the Senate. After her father died, she became head of Yarrow Industries. Once the Empire invaded Acherin, the operations of Yarrow Industries was moved off-planet. Eve was then imprisoned by the Imperials, however, she claimed to have escaped prison, and managed to move her wealth off-planet, to Niro 11.\nIt was likely at this time Yarrow became an Imperial spy who answered directly to Darth Vader. Under the alias of Flame, she set up Operation Moonstrike, a plan that appeared to form a major Rebellion. However, this plan was actually part of Operation Twilight, a scheme to eliminate many resistance leaders all at once.\nYarrow met up with Ferus Olin and his group, befriending them and gaining their trust. After many months together, Flame eventually proposed the idea of gathering all major resistance leaders and moving them to Ferus' base. When the ships were nearing the asteroid base, Yarrow was discovered by Olin. Due to the influence of a Sith holocron, Ferus ordered for her execution, but it was later decided that she was to be left on the uninhabited moon, XT987. Although Yarrow was discovered, operation Twilight was a success; all resistance leaders were destroyed by the superweapon attached to Vader's Star Destroyer. However, Ferus, Trever and Lune managed to escape.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fire",
  "/wiki/Yarrow",
  "/wiki/Acherin",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Yarrow_Industries",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Evin_Yarrow",
  "/wiki/Sood",
  "/wiki/Senate",
  "/wiki/Niro_11",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Moonstrike_(Acherin)",
  "/wiki/Twilight_(operation)",
  "/wiki/Ferus_Olin",
  "/wiki/Jedi_asteroid",
  "/wiki/Sith_holocron/Legends",
  "/wiki/XT987",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Trever_Flume",
  "/wiki/Lune_Oddo_Divinian",
  "/wiki/The_Last_of_the_Jedi:_Return_of_the_Dark_Side",
  "/wiki/The_Last_of_the_Jedi:_Secret_Weapon",
  "/wiki/The_Last_of_the_Jedi:_Against_the_Empire",
  "/wiki/The_Last_of_the_Jedi:_Master_of_Deception",
  "/wiki/The_Last_of_the_Jedi:_Reckoning",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}