{
 "name": "Even_Piell",
 "display_name": "Even Piell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lannik"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Lola Sayu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lannik"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.22 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi assault team",
      "Jedi High Council",
      "Jedi assault team",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Even Piell was a Force-sensitive male Lannik Jedi Master who served on the Jedi Council during the Invasion of Naboo and the Clone Wars. Considered brusque, bellicose, and even gruff, Master Piell was nonetheless respected for his immense courage.\nEven Piell was born on Lannik prior to the Clone Wars. At some point, Piell lost his left eye during a confrontation with terrorists on his home planet. Eventually Piell became a Jedi Master and gained a seat on the Jedi High Council.\nPiell was present when Qui-Gon Jinn reported an incident he had with a mysterious warrior who he believed was a Sith. When Jinn mentioned he met a child called Anakin Skywalker whom he believed was the Chosen One, Piell and the rest of the Council refused to let him be trained, as he was too old and had already formed attachments. However, the Jedi Council finally agreed to train Skywalker. Piell was present during Jinn's funeral and was also present when the Naboo celebrated their victory over the Trade Federation.\nTen years later, Senator Padmé Amidala was the subject of a series of assassination attempts and Piell, along with the Council, approved Obi-Wan Kenobi investigating the matter whilst Skywalker served as Amidala's bodyguard when she returned to on Naboo. Piell participated in the First Battle of Geonosis, which marked the beginning of the Clone Wars.\nOne year and nine months into the war in 20 BBY, he was assigned a dangerous mission to the Outer Rim. On the return trip, he realized his information about the Nexus Route could be dangerous if it fell into the hands of the Confederacy of Independent Systems. Memorizing one half of the information while his captain, Wilhuff Tarkin, memorized the other half, he erased the onboard computer's memory so that if somehow one of them broke under interrogation, it would useless without the other half. Later, his cruiser was invaded by the Confederacy of Independent Systems who wanted to kidnap him in order to learn information about the route. He and his battalion tried to defend themselves but was outnumbered and captured.\nAt his cell, he was tortured in the infamous prison, the Citadel, until he would admit what he knew. Piell refused and the Separatists were about to put out his right eye when Republic forces rushed into the cell and destroyed the droids who were there. When he was put on the floor, he asked Kenobi what took him so long to rescue him. Skywalker told Piell he hasn't lost his sense of humor and he said it took more than that to force him to admit what he knew. He told Kenobi and Skywalker what he did on the return trip before he was captured and said he assumed his captain was also imprisoned.\nThey freed Tarkin and they hatched a plan that Piell was to go with Kenobi whilst Tarkin with Skywalker. As they ran out of the cell, security chased them. So they exploded a bomb, destroying the majority of the droids on their trail. They found a hole and rushed out.\nThey then split and carried out their escape plan. Kenobi's half realized a droid was tracking them. Piell destroyed it, but not fast enough before it told the Separatists all it saw. Then, security doors closed all over the tunnel and Kenobi warned him to move before he got cut in half. Piell, Kenobi, and the clones were locked in different sections. But Piell cut the door of his section and got into Kenobi's with his lightsaber and told Kenobi they already cut one door and that it was time to cut the rest.\nAfter cutting down all the doors, they couldn't find where R2-D2 was. They decided to go outside and get a better view despite knowing it might be a trap. After going outside, they jumped down to a lower level. They tried to contact Skywalker's level only to hear Osi Sobeck hearing that he had watched their every move through security the whole time. They watched in horror as they were again captured by the Separatists. At Sobeck's office, he told Piell to give him the information or he would start executing his men one by one. Piell only replied that it was war and that they had to protect the information. Sobeck, angered, was about to kill them when a droid reported that they had spotted Skywalker's half. Sobeck ordered Kenobi's half to be tortured slowly.\nThey were let out of the office and finally spotted R2. The droids told them that they should go on and they did. When they got outside, Kenobi started destroying the droids, followed by the clones. Soon the guns started firing on them as they ran away. Skywalker got on a Single Trooper Aerial Platform and Piell jumped in after him. Skywalker drove while Piell deflected shots. The Separatists blew up the STAP, throwing Skywalker and Piell off. Then they ran off. While they were running, ARC trooper Echo tried to protect a transport they could use to escape from the Citadel, the Separatists however blew up the transport, causing Piell and the others to fall down.\nThey contacted the Jedi Temple. Yoda told him they would send a ship to evacuate him and his men and showed him where they would land it.\nAs they were walking to the location they would be rescued from, Piell sensed the Separatists coming and told the others. Everyone prepared for battle. During the battle, he destroyed some droids before an anooba jumped and attacked Piell. Ahsoka Tano used the Force to hurl it away, but not before it gravely injured Piell. Tano attempted to call help, but Piell told her to stay so he could give her the information and instruct her to relay it only to the Council. She denied, saying Kenobi or Skywalker needed to hear that, and that she only lied to be a part of the mission. But Piell told her that she was now the most important part of the mission and that she had to remember the information and make sure only the Jedi Council knew it. Tano finally agreed and Piell whispered the information into her. Shortly thereafter, Piell died of his injuries.\nAfter his death, Tano brought his body to the rest of the group, saying he died honorably. Skywalker asked about the information and Tano said she had it and that he told her before he died.\nLater, his body was wrapped up and Kenobi told everyone to take a moment to honor him and told them that they had to move on afterwards because he would've wanted them to complete the mission. Kenobi and Skywalker used the Force to put Piell's body into the lava. It fell down a lava-fall and it burned shortly thereafter.\nEven Piell had a distinguishing scar on his face, which rendered his left eye useless. He was known too for being \"brusque and bellicose.\"\nPiell was a battle-hardened Jedi and a great warrior, always willing to charge into battle and highly skilled with a lightsaber. According to Wilhuff Tarkin, who had served under Piell's command during the Clone Wars, the Lannik excelled in lightsaber combat. However, according also to Tarkin, a renowned military strategist, Piell's tactical skills were somewhat subpar.\nPiell was also revered for his courage and telekinetic powers.\nIn the 2015 reference book Ultimate Star Wars, Even Piell's species was mistakenly identified as Zabrak. Piell was portrayed by Michaela Cottrell in Star Wars Episode I The Phantom Menace and Star Wars: Episode II Attack of the Clones and was voiced by Blair Bess in Star Wars: The Clone Wars animated series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Even_Piell",
  "/wiki/Even_Piell/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Even_Piell",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Lannik",
  "/wiki/20_BBY",
  "/wiki/Lola_Sayu",
  "/wiki/Lannik_(species)",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Jedi_assault_team",
  "/wiki/Galactic_Republic",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Master",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Clone_Wars",
  "/wiki/Reproduction",
  "/wiki/Eye",
  "/wiki/Terrorist",
  "/wiki/Homeworld",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Duel_on_Tatooine",
  "/wiki/Maul",
  "/wiki/Sith",
  "/wiki/Youngling",
  "/wiki/Anakin_Skywalker",
  "/wiki/Chosen_One",
  "/wiki/Jedi_training",
  "/wiki/Funeral_of_Qui-Gon_Jinn",
  "/wiki/Naboo_(people)",
  "/wiki/Battle_of_Naboo",
  "/wiki/Trade_Federation",
  "/wiki/22_BBY",
  "/wiki/Standard_year",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Bodyguard",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Cloning",
  "/wiki/Standard_month",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Nexus_Route",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Captain",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Computer",
  "/wiki/Cruiser",
  "/wiki/Capture_of_Even_Piell",
  "/wiki/Battalion",
  "/wiki/Torture",
  "/wiki/Prison",
  "/wiki/Citadel",
  "/wiki/Republic_Military",
  "/wiki/Battle_of_Lola_Sayu",
  "/wiki/Droid",
  "/wiki/Probe_droid",
  "/wiki/Clone_trooper",
  "/wiki/Lightsaber",
  "/wiki/R2-D2",
  "/wiki/Osi_Sobeck",
  "/wiki/Time",
  "/wiki/Death",
  "/wiki/Single_Trooper_Aerial_Platform",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Echo",
  "/wiki/Transport",
  "/wiki/Jedi_temple",
  "/wiki/Yoda",
  "/wiki/Anooba",
  "/wiki/Ahsoka_Tano",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Funeral_of_Even_Piell",
  "/wiki/Magma",
  "/wiki/Lightsaber_combat",
  "/wiki/2015",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Zabrak",
  "/wiki/Michaela_Cottrell",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Blair_Bess",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_Attack_of_the_Clones_Graphic_Novel_Adaptation",
  "/wiki/Brotherhood",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/The_Citadel",
  "/wiki/Counterattack",
  "/wiki/Citadel_Rescue",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_I_Am_a_Jedi",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_75",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_27",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Pelta-class_Frigate_Expansion_Pack",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/19_BBY",
  "/wiki/Category:Images_of_Even_Piell",
  "/wiki/Ghosts_of_Mortis",
  "/wiki/Water_War",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Battle_of_Murkhana",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Standard_week",
  "/wiki/32_BBY",
  "/wiki/Mace_Windu",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Plo_Koon",
  "/wiki/Saesee_Tiin",
  "/wiki/Yarael_Poof",
  "/wiki/Oppo_Rancisis",
  "/wiki/Yaddle",
  "/wiki/Eeth_Koth",
  "/wiki/Adi_Gallia",
  "/wiki/Depa_Billaba",
  "/wiki/Coleman_Trebor",
  "/wiki/Shaak_Ti",
  "/wiki/Kit_Fisto",
  "/wiki/Coleman_Kcaj"
 ]
}