{
 "name": "Evenyl_Yob",
 "display_name": "Evenyl Yob",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal Naboo Security Forces",
      "Naboo Royal Space Fighter Corps",
      "Echo Flight",
      "Naboo Royal Space Fighter Corps",
      "Echo Flight",
      "Echo Flight"
     ]
    }
   ]
  }
 ],
 "content": "Evenyl Yob was a teenage female Human from Naboo who served as a starfighter pilot in the Naboo Royal Space Fighter Corps' Echo Flight.\nIn 33 BBY, Station TFP-9 was attacked by what was assumed to be pirates consisting of Z-95 Headhunters with a Hornet-class carrier serving as their capital ship. She was assigned as Echo One for a squadron of twelve N-X Police Cruisers. She would be watched over by two N-1 starfighters from Bravo Seven, piloted by Essara Till and Eight, piloted by Dren Melne, who was secretly contracted by the Agamar Governor Challep to steal both N-1s and some of the cruisers.\nWhen the Naboo fighters arrived both squadrons engaged and drove the Z-95s to their carrier with Echo flight taking minor damage. She was supposed to report the latest development, only for Rhys Dallows to beat her to it instead. Till then asked her and Echo Two, piloted by Kerl, to join her and Dren for an attack run on the Carrier. It was then that a second Hornet-class Carrier, Velumina, lead by Captain Sorran arrived with more Z-95s armed with Concussion missiles, while the first carrier dropped Droid starfighters.\nIt was then that Dren Melne betrayed Naboo by breaking formation and opened fire on Echo Two causing the fighter to spiral and collide with Echo one destroying her astromech droid. Dren proceeded to engage her, while telling Till to order Echo Flight to power down their craft or else they would be destroyed. Despite losing her droid, she pulled impressive evasive maneuvers to keep Dren from locking on, trying to give Till time to stop him. In the end, her fighter was soon hit by one of Dren's two torpedoes overloading the craft's shield generator and the secondary systems started to malfunction. Essara Till ordered Evenyl to power down all systems, leaving her stranded in space.\nIn the end, the battle ended in Naboo's favor as Essara Till, along with Rhys, managed to destroy the first Hornet-Class carrier and Dren was soon killed by his own employers for failing to deliver what he promised. After the battle technicians from the Station TFP-9 recovered the stranded pilots, but only 5 made it back home alive. Essara Till then gave Ric Olié Evenyl Yob, along with Rhys Dallows and Keela Egast a recommendation to be part of Bravo flight.\nEvenyl Yob, although a young girl, believed that she was supposed to give updates on the status on Echo Flight when Rhys Dallows brought Essara Till up to speed during the battle. When Dren Melne opened fire on her fighter craft, she was screaming and was almost consumed by fear, begging Till to save her. Despite this and her astromech droid being destroyed, she pulled evasive maneuvers on her cruiser keeping Dren from locking on to her craft. This impressed Till who promised to herself that she would commend her when the situation was over.\nWhen her craft was hit and her systems malfunctioned, she was able to power down her fighter at Essara's order, despite crying over her radio frequency. Soon she was able to regain her composure enough to report the condition of her ship to notify that she was out of the fight but still alive.\nEvenyl Yob appears in the short story The Starfighter Trap, released in 2000 on the main website, and on Star Wars Gamer 1.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Naboo_Royal_Space_Fighter_Corps/Legends",
  "/wiki/Echo_Flight",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Station_TFP-9",
  "/wiki/Battle_at_TFP-9",
  "/wiki/Pirate/Legends",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Hornet-class_carrier",
  "/wiki/Capital_ship/Legends",
  "/wiki/Echo_One",
  "/wiki/Squadron/Legends",
  "/wiki/N-X_Police_Cruiser/Legends",
  "/wiki/N-1_starfighter/Legends",
  "/wiki/Bravo_Flight/Legends",
  "/wiki/Bravo_Seven",
  "/wiki/Essara_Till/Legends",
  "/wiki/Bravo_Eight",
  "/wiki/Dren_Melne",
  "/wiki/Agamar/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Challep",
  "/wiki/Rhys_Dallows",
  "/wiki/Echo_Two_(Echo_Flight)",
  "/wiki/Kerl",
  "/wiki/Velumina",
  "/wiki/Captain/Legends",
  "/wiki/Sorran",
  "/wiki/Concussion_missile/Legends",
  "/wiki/Droid_starfighter/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/Proton_torpedo/Legends",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Ric_Oli%C3%A9/Legends",
  "/wiki/Keela_Egast",
  "/wiki/The_Starfighter_Trap",
  "/wiki/2000",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/Star_Wars_Gamer"
 ]
}