{
 "name": "Everi Chalis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Unidentified planet"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Department of Military Research",
      "Imperial Ruling Council",
      "Imperial Department of Military Research",
      "Imperial Ruling Council",
      "Alliance to Restore the Republic",
      "61st Mobile Infantry",
      "61st Mobile Infantry"
     ]
    }
   ]
  }
 ],
 "content": "Everi Chalis was a female human from a remote and impoverished planet in the galaxy. Enrolling in the Colonial Academy to become an artist, she took an apprenticeship under Count Denetrius Vidian of the Galactic Empire. She later became his successor and served as the governor of Haidoral Prime during the Galactic Civil War, before temporarily defecting to the Alliance to Restore the Republic.\nBorn a female human, Everi Chalis grew up on an impoverished planet under the care of her mother, living in the ruins of a bombed out paper mill where they shared a stained mattress. When Chalis reached the age of six, her mother tried selling her to a Trade Federation exploratory vessel. The vessel's captain rejected the offer because Chalis was too small, and the captain gave her a packet of nectrose crystals out of pity. She used her fingers to eat the crystals, not knowing that it was intended to be sprinkled in water to add fruitiness, although Chalis didn't have access to fresh water anyway.\nChalis rationed the crystals and had them only once a week for months. She soon realized she was living in filth, eating garbage, and drinking poison, while others in the galaxy were rich enough to share treats such as nectrose packets. Desperate to leave her world, she enrolled into the Colonial Academy and made it off-world. Eventually, she made it offworld, but found she had nowhere to go under the Galactic Republic.\nAfter the Galactic Empire was born from the Republic in 19 BBY, Imperial Count Denetrius Vidian saw quality in Chalis's sculptures and admired her ability to visualize concepts, so he offered her an apprenticeship. Chalis accepted the offer, and artistry drifted out of her life. Rising to be a lieutenant under the tutelage of Vidian on Calcoraan, Chalis found herself committing horrible acts, such as proposing the mining of an inhabited planet's atmosphere and deceiving and killing an Imperial moff.\nIn 14 BBY, Chalis was Vidian's most trusted aide, and he constantly had her traveling on assignment. After Vidian and Grand Moff Wilhuff Tarkin uncovered an insurgence on Gilvaanen, a planet responsible for producing stormtrooper armor, Vidian placed Chalis in charge of the Imperial Department of Military Research. After Vidian's death during the Gorse Conflict in 11 BBY, Chalis took over the roles of her mentor, becoming an emissary to the Imperial Ruling Council and the honorary Grand Architect of the New Order.\nAt the end of 0 BBY, the Empire's Death Star superweapon was destroyed by the Rebel Alliance at the Battle of Yavin. Bolstered by their victory, the Alliance then began a campaign into the Mid Rim Territories around 1 ABY. At that time, Emperor Palpatine went and blamed the higher echelons of the Empire for the loss of the Death Star, arranging the deaths of a number of high status individuals such as Moff Coovern and Minister Khemt. Chalis herself was appointed as the governor of the Mid Rim planet Haidoral Prime, which she considered a punishment.\nThe Alliance's campaign into the Mid Rim went awry nine months in, the Empire slowly chasing the Alliance Fleet out of the region. Nine months into the retreat, the Alliance's 61st Mobile Infantry, better known as Twilight Company, attacked Haidoral Prime. Convinced she would be punished by her superiors regardless of winning or losing the fight, she defected to Twilight Company, and was brought aboard the Thunderstrike, their CR90 corvette. She was placed in the airlock as a make-shift cell for her safety. She stayed there for days, until the Thunderstrike was attacked by Imperial forces. The section of the corvette containing Chalis's airlock caught fire, so First Sergeant Hazram Namir attempted to rescue her. Namir reached the airlock, but the heat's intensity prevented him from making a return trip, so he locked himself in the airlock with her. Eventually the flames were put out, and their burns were treated.\nRecalling the Tseebo incident, Chalis believed that Vader would come looking for her. In actuality, Vader was searching for Luke Skywalker, the pilot responsible for destroying the Death Star two years earlier, while Verge, a young prelate, led the search for Chalis. The company continued moving from planet to planet fighting in numerous battles, before being summoned to the new Rebel base on the ice planet Hoth. While on Hoth, Chalis gained the trust of Rebel general Philap Bygar, and she provided the Alliance High Command with statistical data of the Empire. In the following days, the Empire discovered the location of the Rebel base, and within eleven days of Chalis's arrival the Rebellion began evacuating. In the subsequent Battle of Hoth, Imperial ground forces led by Darth Vader breached the base. Before Chalis was able to evacuate, she and her Rebel escort encountered Vader and the snowtroopers of Blizzard Force. After a short-lived battle, Chalis, believing Vader was there for her, approached the Sith Lord and submitted herself for execution. Vader, uninterested in Chalis, Force choked her and demanded to know the location of Skywalker. As Chalis struggled, a stormtrooper informed Vader that the Millennium Falcon had been found. Vader then released Chalis and resumed his chase for the young rebel.\nOther than Chalis, only Namir survived Vader's attack. The two limped to a shuttle and managed to slip past the Imperial blockade using Chalis's old clearance codes. Following the jump to hyperspace, they rendezvoused with the rest of Twilight Company on the planet Ankhural. Chalis, now aware of her triviality to the Empire, wanted to get revenge. Together with Namir, who unofficially replaced the deceased Micha Evon as captain of Twilight, Chalis plotted out seemingly random targets for the company to hit, finishing with an Imperial Star Destroyer construction yard on Kuat. Understanding the workings of the Imperial system, Chalis knew that destroying the listed facilities would be a devastating setback for the Empire. Namir, not seeing any alternatives, complied with Chalis's plan. Twilight began its campaign against the locations determined by Chalis, and after several victories the company reached their second-to-last target: the Inyusu Tor mineral processing facility on Sullust. However, Prelate Verge had determined Chalis was assisting the Rebels, and he was able to predict their attack. Twilight Company was ambushed, and they suffered heavy losses, including the Thunderstrike.\nDuring the ensuing battle, Chalis fled to the nearby city of Pinyumb, killed an Imperial officer, and attempted to escape the planet in a shuttle. Before she was able to leave the atmosphere, Verge's Star Destroyer, the Herald, locked onto the shuttle with its tractor beam. Verge, accompanied by Tabor Seitaron, approached the captive shuttle. Chalis exited the vessel, and after exchanging a few words with the prelate, revealed the shuttle had been rigged with ion charges. Chalis activated the charges, dealing major power loss to the Star Destroyer. Unable to power its weapons and maintain altitude, the ship began to drop towards the surface. Verge, adamant about continuing the attack, ordered the ship's crew to continue firing and began scuffling with Chalis. However, Seitaron, who was not willing to die unnecessarily, shot and killed the young prelate, ordering the crew to cease the attack and move the ship into orbit. As Seitaron prepared to execute Chalis, she took advantage of his fear of punishment for killing Verge, and she convinced him to let her go.\nNo longer a captive of the Rebellion, Chalis traded the shuttle for a civilian starcutter and drained her offworld financial accounts. In the following days she sent a recorded message to Namir, telling him that he should have trusted her and that she would not return to the Rebellion. Thinking of plans for her future, she decided to reside on a remote planet and continue her artwork. Recalling Namir speak of his homeworld, Crucival, she decided to start there.\nEveri Chalis was a female human with light skin and white-streaked, graying, black hair. She spoke with an exaggerated Coruscanti accent, enjoyed reading classical fiction, and was a skilled sculptor.\nEveri Chalis was first mentioned in the canon short story \"Bottleneck,\" which was published in The Rise of the Empire in 2015. Written by John Jackson Miller, \"Bottleneck\" bridges the novels Tarkin and A New Dawn. Chalis made her first full debut in the novel Battlefront: Twilight Company, which was written by Alexander Freed and released November 3, 2015.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Everi_Chalis",
  "/wiki/Unidentified_planet_(Everi_Chalis)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Department_of_Military_Research",
  "/wiki/Imperial_Ruling_Council",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/The_galaxy",
  "/wiki/Colonial_Academy",
  "/wiki/Artist",
  "/wiki/Count",
  "/wiki/Denetrius_Vidian",
  "/wiki/Governor",
  "/wiki/Haidoral_Prime",
  "/wiki/Galactic_Civil_War",
  "/wiki/Reproduction",
  "/wiki/Everi_Chalis%27s_mother",
  "/wiki/Bomb",
  "/wiki/Unidentified_paper_mill",
  "/wiki/Parent",
  "/wiki/Trade_Federation",
  "/wiki/Starship",
  "/wiki/Unidentified_captain_(Everi_Chalis)",
  "/wiki/Captain",
  "/wiki/Nectrose_crystal",
  "/wiki/Limb",
  "/wiki/Crystal",
  "/wiki/Water",
  "/wiki/Fruit",
  "/wiki/Standard_week",
  "/wiki/Standard_month",
  "/wiki/Poison",
  "/wiki/Planet",
  "/wiki/Galactic_Republic",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/Lieutenant",
  "/wiki/Calcoraan",
  "/wiki/Mining",
  "/wiki/Atmosphere",
  "/wiki/Death",
  "/wiki/Moff",
  "/wiki/14_BBY",
  "/wiki/Aide",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Gilvaanen",
  "/wiki/Stormtrooper",
  "/wiki/Stormtrooper_armor",
  "/wiki/Gorse_Conflict",
  "/wiki/11_BBY",
  "/wiki/Emissary",
  "/wiki/Grand_Architect_of_the_New_Order",
  "/wiki/0_BBY",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Battle_of_Yavin",
  "/wiki/Mid_Rim_Retreat",
  "/wiki/Mid_Rim_Territories",
  "/wiki/1_ABY",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Coovern",
  "/wiki/Minister",
  "/wiki/Khemt",
  "/wiki/Alliance_Fleet",
  "/wiki/Attack_on_Haidoral_Prime",
  "/wiki/Company",
  "/wiki/Thunderstrike",
  "/wiki/CR90_corvette",
  "/wiki/Airlock",
  "/wiki/Standard_day",
  "/wiki/Imperial_Military",
  "/wiki/Corvette",
  "/wiki/Fire",
  "/wiki/First_Sergeant",
  "/wiki/Hazram_Namir",
  "/wiki/Rescue_of_Tseebo",
  "/wiki/Luke_Skywalker",
  "/wiki/Rebel_pilot",
  "/wiki/Verge",
  "/wiki/Prelate",
  "/wiki/Echo_Base",
  "/wiki/Hoth",
  "/wiki/General",
  "/wiki/Philap_Bygar",
  "/wiki/Alliance_High_Command",
  "/wiki/Battle_of_Hoth",
  "/wiki/Imperial_Army",
  "/wiki/Darth",
  "/wiki/Cold_weather_assault_stormtrooper",
  "/wiki/Blizzard_Force",
  "/wiki/Sith_Lord",
  "/wiki/Force_choke",
  "/wiki/Millennium_Falcon",
  "/wiki/Shuttle",
  "/wiki/Blockade",
  "/wiki/Hyperspace",
  "/wiki/Ankhural",
  "/wiki/Micha_Evon",
  "/wiki/Star_Destroyer",
  "/wiki/Kuat",
  "/wiki/Inyusu_Tor",
  "/wiki/Inyusu_Tor_mineral_processing_facility",
  "/wiki/Sullust",
  "/wiki/Siege_of_Inyusu_Tor",
  "/wiki/City",
  "/wiki/Pinyumb",
  "/wiki/Imperial_officer",
  "/wiki/Herald",
  "/wiki/Tractor_beam",
  "/wiki/Tabor_Seitaron",
  "/wiki/Ion_charge",
  "/wiki/Orbit",
  "/wiki/Starcutter",
  "/wiki/Currency",
  "/wiki/Homeworld",
  "/wiki/Crucival",
  "/wiki/Hair",
  "/wiki/Coruscanti",
  "/wiki/Bottleneck_(short_story)",
  "/wiki/The_Rise_of_the_Empire",
  "/wiki/2015",
  "/wiki/John_Jackson_Miller",
  "/wiki/Tarkin_(novel)",
  "/wiki/A_New_Dawn_(novel)",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/November_3",
  "/wiki/Category:Audio_files_of_Everi_Chalis",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Kanan_Jarrus",
  "/wiki/Hera_Syndulla",
  "/wiki/Gorse",
  "/wiki/Standard_year",
  "/wiki/Star_Wars_Rebels",
  "/wiki/5_BBY",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/3_ABY",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_61",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)"
 ]
}