{
 "name": "Evie_Bo",
 "display_name": "Evie Bo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Shroud's organization",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Evie Bo was a Human female spy that was a top lieutenant in The Shroud's organization during the Galactic War between the Galactic Republic and the Sith Empire.\nWhen she discovered that her boss wanted to launch a starship into Kaas City, Evie tried to explain him that a direct attack on the Empire was suicidal. The Shroud responded with an attempt on her life, so Evie decided to desert and sell him to the Dark Councilor Darth Mortis, bringing with her special EV2 discreet reconnaissance macrobinoculars and revealing the Shroud's entire scheme.\nDarth Mortis introduced Evie to an Imperial hero, whom he recruited to track down the Shroud, Evie would act as the mission control from the Citadel in Kaas City. She guided the Imperial through a string of Shroud's bases and lieutenants, eventually leading him to the Shroud himself on Nar Shaddaa. The spy was defeated and the attack on Dromund Kaas averted, but just as Evie began to celebrate her new life free of the Shroud, he interrupted her holocall with Darth Mortis. Leaving a double to be killed in his place, the Shroud survived and presented his parting gift to Evie. Whispering a single word - \"asunder\" - he triggered the neural scrambler secretly implanted in Evie's brain, sending her into unconsciousness. Upon awakening, Evie remained completely healthy physically, but all of her memories and personality were gone, leaving her a blank slate to be used by the Empire and preventing her from revealing any more of the Shroud's secrets. After Darth Mortis managed to get back through, the Imperial hero convinced an amnesiac Bo that she was a loyal servant of the Empire.\nEvie Bo appeared in Star Wars: The Old Republic: Rise of the Hutt Cartel a 2013 expansion to the 2011 massively-multiplayer online roleplaying video game Star Wars: The Old Republic. She appears during \"The Shroud\" questline for Imperial-aligned players.\nAt the beginning of the \"Shroud of Ruin\" mission, Imperial-aligned player characters of any gender may attempt to flirt with Bo. If the player character is male, Bo responds irritably, and requests to shift back to the topic at hand. If the player character is female, Bo indicates that she is flattered, but also steers the conversation back to the topic of the Shroud.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/The_Shroud%27s_organization",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Spy/Legends",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Kaas_City",
  "/wiki/Dark_Council",
  "/wiki/Darth_Mortis",
  "/wiki/EV2_discreet_reconnaissance_macrobinoculars",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/2013",
  "/wiki/2011",
  "/wiki/Roleplaying_game",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}