{
 "name": "Evinn_Dastt",
 "display_name": "Evinn Dastt",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Evinn Dastt was a Human male pilot who served with the Rebel Alliance's starfighter corps.\nDuring the Galactic Civil War, Dastt spent at least four years as an X-wing starfighter pilot. He enjoyed starfighter combat, which he called \"The Show,\" and described as \"pure adrenaline, pure instinct.\" His expertise was not limited to X-wings: he also went on combat airspeeder patrols during planet-bound operations, and claimed to be skilled with landspeeders, speeder bikes, and swoops. He was confident in his combat skills, convinced that his abilities would soon make him famous. Though he admitted that combat was dangerous, he usually talked about it as something that was dangerous for his opponents, making remarks such as \"when I get irked, other people get shot down.\"\nDastt may have been acquainted with Rebel-aligned smugglers Han Solo and Platt Okeefe—at least, he knew them by their reputation as skilled pilots of modified light freighters. Dastt also knew Airen Cracken, the Alliance's Chief of Intelligence, who he respected for earning his rank through active service, as opposed to \"pushing datacards and routing supplies.\"\nThe bounty hunter Tirog also knew Dastt well enough to ask him to teach one or more novices some of the basics of flying. Dastt was enthusiastic as a flight instructor, teaching about everything from basic combat maneuvers to how to buy a starship. During these lessons, he said that the relationship between a starship and its pilot was crucial, and that in a crisis, a starship would be \"your mother, your brother, and your best friend.\" He also said that a well-treated ship would develop almost a \"personality.\"\nEvinn Dastt is one of the characters appearing in Star Wars: The Roleplaying Game, Second Edition, Revised and Expanded who helps to introduce Star Wars: The Roleplaying Game and the Star Wars universe to players. Though Dastt, like the other characters, stays in-character, he also \"breaks the fourth wall\" by addressing the readers directly to discuss the rules of the game. Dastt introduces the chapters most appropriate for a Rebel pilot: \"Movement and Chases,\" \"Space Travel and Combat,\" \"Vehicles,\" and \"Starships.\"\nThe time placement of the in-universe text of the Revised and Expanded rulebook is uncertain: it must be early enough in the Galactic Civil War that characters refer to the Rebel Alliance rather than the New Republic, but late enough that Dastt has been piloting an X-wing for approximately four years. This may mean that Dastt was one of the first pilots in the Alliance to operate an X-wing after the first four prototypes were liberated in the Battle of Fresia .\nEvinn Dasst was originally going to be established as a Rebel pilot seen in 1980's Star Wars: Episode V The Empire Strikes Back in Star Wars Insider 146's Rogues Gallery article \"Clearance for Immediate Launch\", which covered the Rebel Alliance Pilots. However, a last minute change of images resulted in that being cut from the final version.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Alliance_Starfighter_Corps",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Landspeeder/Legends",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Platt_Okeefe/Legends",
  "/wiki/Light_freighter/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Chief_of_Intelligence/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Tirog",
  "/wiki/Starship/Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Star_Wars",
  "/wiki/New_Republic/Legends",
  "/wiki/Battle_of_Fresia",
  "/wiki/Star_Wars:_Empire_at_War",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_Insider_146",
  "/wiki/Rogues_Gallery",
  "/wiki/Tim_Veekhoven",
  "/wiki/Kevin_Beentjes",
  "/wiki/Sander_de_Lange",
  "/wiki/December_4",
  "/wiki/2013",
  "/wiki/File:NamingRoguePilots.png"
 ]
}