{
 "name": "Evram Darkmere",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 40 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Daupherm Planet States",
      "Daupherm Merchant Fleet",
      "Daupherm Marine Corps",
      "Daupherm Merchant Fleet",
      "Daupherm Marine Corps",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Evram Darkmere was a space pirate who became an informer for the Alliance to Restore the Republic during the Galactic Civil War.\nDarkmere's mother was a pirate, but when he was ten years old, she was killed during a conflict between the Daupherm Planet States and the Botor Enclave, leaving Darkmere to raise himself and his younger brother, Garreck Darkmere. Two years later, Darkmere became a cabin boy in the Daupherm Merchant Fleet and his brother was sent to an orphanage. After rising through the ranks, Darkmere became a second-in-command, but was then drafted into the Daupherm Marine Corps.\nAfter his five-year tour with the military ended, Darkmere's former Captain, Gorvan Shrulldike stole the Retribution, a Daupherm Systems Fleet Discril-class attack cruiser, and set himself up as a slaver and space pirate. Darkmere joined Shrulldike's crew, but he found slavery to be repugnant so, with the backing of some Rebel agents, he defeated Shrulldike in single combat and became the new captain of the Retribution. Darkmere met Arsitta Kushoe, a woman who was serving as an X-wing pilot in the Rebel Alliance, and they became very close. However, after she went missing-in-action, Darkmere became a reformed character and tried to aide the Alliance, although he continued to remain an independent operator. He would pass information to the Alliance via his best friend Nelson Flin, who was an Alliance military operative. His First Mate was Dexter Thorgrim, and together they would often search cantinas, looking for new crew members. Darkmere once met with General Airen Cracken of the Alliance in a bar on Nar Shaddaa, where they shared a few drinks.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/40_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Daupherm_Planet_States",
  "/wiki/Daupherm_Merchant_Fleet",
  "/wiki/Daupherm_Marine_Corps",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Botor_Enclave",
  "/wiki/Garreck_Darkmere",
  "/wiki/Captain/Legends",
  "/wiki/Gorvan_Shrulldike",
  "/wiki/Retribution_(Discril-class)",
  "/wiki/Daupherm_Systems_Fleet",
  "/wiki/Discril-class_attack_cruiser",
  "/wiki/Arsitta_Kushoe",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Nelson_Flin",
  "/wiki/First_Mate/Legends",
  "/wiki/Dexter_Thorgrim",
  "/wiki/Cantina/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Pirates_%26_Privateers"
 ]
}