{
 "name": "Ezar Elasra",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Barabel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ezar Elasra was a male Barabel Jedi Master who served the Jedi Order during the waning years of the Galactic Republic.\nA Force-sensitive Barabel, Ezar Elasra was educated in the ways of the Force by the Jedi Order, achieving the rank of Jedi Master in the final decade of the Galactic Republic. When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Master Elasra took up the rank of General within the Grand Army of the Republic, being placed in command of a small, but successful battlegroup. Operating aboard the flagship Solidarity, a Venator-class Star Destroyer that patrolled the Mid Rim, Elasra was responsible for keep the peace in several sectors.\nTasked by the Jedi High Council with retaking the planet of Tirahnn from the Confederacy, Elasra developed a plan to recapture the world, by having a strike team activate a planetary ion cannon and then using it against the orbiting CIS fleet. He summoned a group of Republic agents to the Solidarity and on their arrival, tasked them with reactivating the cannon. The agents were successful in activating the cannon and when it began opening fire on the Separatist fleet, Elasra brought his battlegroup out of hyperspace near the planet, beginning the Battle of Tirahnn.\nAbout thirty minutes into the battle, Elasra contacted the Republic agents via a hologram and gave them a new assignment. He asked them to place some homing beacons on a group of CIS Ground Armored Tanks that were threatening Republic forces. He also said that he would send a group of clone troopers to take custody of CIS Commander Zolghast, whom the agents had captured. Shortly afterwards, Elasra boarded his Delta-7 Aethersprite-class light interceptor and led a squadron of V-19 Torrent starfighters in the space battle. Meanwhile, in his absence, the Clawdite CIS spy Braxus Lyn disguised herself as Elasra and freed Zolghast from Republic custody. This caused a clone commander to believe that Elasra had defected to the Separatists, so the Republic agents were sent to recapture Zolghast and stop the false Elasra. The Republic forces were eventually victorious and captured the planet; and Elasra commended the Republic agents for their actions during the battle.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Ezra_(disambiguation)",
  "/wiki/Barabel/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Battlegroup",
  "/wiki/Flagship/Legends",
  "/wiki/Solidarity_(Venator-class)",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tirahnn/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Battle_of_Tirahnn_(Clone_Wars)",
  "/wiki/Hologram/Legends",
  "/wiki/Homing_beacon/Legends",
  "/wiki/Ground_Armored_Tank",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Zolghast",
  "/wiki/Delta-7_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/V-19_Torrent_starfighter/Legends",
  "/wiki/Clawdite/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Braxus_Lyn",
  "/wiki/Clone_trooper_commander",
  "/wiki/Galaxy_at_War"
 ]
}