{
 "name": "F%27quallix",
 "display_name": "F'quallix",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nalroni"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    }
   ]
  }
 ],
 "content": "\"F'quallix\" was the alias of a Nalroni male spice-jacker active in 10 ABY. Well-known for numerous crimes, \"F'quallix\" nonetheless shied away from excessive violence during jobs, and often employed local muscle.\n\"F'quallix\"—real name unknown—was a Nalroni male spice-jacker active in 10 ABY. According to his TracSheet, \"F'quallix\" was notorious for crimes including illegal weapon possession, theft, criminal conspiracy, assault, criminal trespass, and possession of stolen merchandise. \"F'quallix\" generally worked with a gang comprised of local enforcers and spaceport haulers.\n\"F'quallix\" was somewhat of an exception among spice-jackers in that he took pains to minimize casualties among crews whose ships he raided, relying on his reputation to ensure this. Such clemency did not extend as much to those on the black market with whom he dealt if a deal were to sour, with \"F'quallix\" reportedly inflicting grievous injuries in such cases. A Nalroni male, \"F'quallix\" stood at a height of 1.6 meters and had a muscular build and thick dark brown fur.\n\"F'quallix\" had extensive knowledge of bureaucracy and was incredibly streetwise and perceptive. In addition, he was adept at commanding others, and possessed technical skills, specializing in starship security systems. He could also handle a blaster.\n\"F'quallix\" carried a datapad, heavy blaster pistol, droid disabler and a retina disguiser, as well as a shipjacking kit. He wore eye protectors owing to a possible sensitivity to light.\n\"F'quallix\" first appeared in Galaxy Guide 11: Criminal Organizations, a 1994 supplement to Star Wars: The Roleplaying Game written by Bill Smith.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nalroni/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Spice-jacker",
  "/wiki/10_ABY/Legends",
  "/wiki/TracSheet",
  "/wiki/Thief/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Black_market/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Droid_Disabler",
  "/wiki/Retinal_disguiser",
  "/wiki/Shipjacking_kit",
  "/wiki/Eye/Legends",
  "/wiki/Galaxy_Guide_11:_Criminal_Organizations",
  "/wiki/1994",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Bill_Smith",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi",
  "/wiki/4_ABY/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}