{
 "name": "Faarl",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Korlings"
     ]
    },
    {
     "name": "Born",
     "values": [
      "12 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.1 meters"
     ]
    }
   ]
  }
 ],
 "content": "Faarl, called \"Faarl the Conqueror\" or \"The Child Conqueror\", was a pirate, slaver, and warlord who managed to conquer several low-technology planets in Wild Space before his twentieth birthday.\nAllegedly born the eldest son of a noble family in the Korlings system, Faarl somehow gathered a small group of a few dozen pirates under his command at a young age. At first, his band merely plundered weakly-defended systems and captured poorly-armed freighters. Soon, however, he discovered the Parthovian Cluster, a part of Wild Space with several inhabited worlds rich in plunder but low in technology. Better still for Faarl's purposes, the star cluster was far from the reach of the Galactic Empire.\nIn a few months, his raids added three Corellian corvettes, six Corellian gunships, and a score of starfighters to his fleet. At the same time, his reputation grew, leading many pirates to join his band. Once his forces were strong enough, he revealed his plan and led his forces to a planet in the Parthovian Cluster. This planet's steam-powered technology was no match for Faarl's modern weapons, allowing him to conquer the planet and enslave its populace within two months. He then made alliances with the planet's natives, giving them positions of power in exchange for a tribute of slaves and other valuables.\nThis pattern of conquest was repeated in Faarl's later campaigns, allowing him to increase his forces with by adding mercenaries and slave soldiers from each new conquest. Each twelve-person unit in his army was commanded by a pirate who had been with him before he began his conquests. Mercenaries made up half of each unit, with the rest being low-ranking slave soldiers. These slaves could, in theory, earn their freedom in combat, but the free mercenaries and pirate officers ensured that this rarely happened by ordering slaves into the most lethal situations. Faarl's mercenary troops were not entirely trustworthy, but the authority they were given over the slave soldiers, the promise of lethal force from the soldiers who would remain loyal in a possible revolt, and most importantly the promise of plunder, staved off any possible mutiny.\nHis next conquest was the planet Pochi, another primitive planet orbiting an unnamed and uncharted sun. Faarl named the sun and the system Faarlsun in his own honor. Finding the ancient Fortress Baarlos on the planet, he decided to make it his permanent base of operations. He also found that the native semi-sentient Tulvarees made excellent soldiers, and added many of them to his army.\nFaarl made Pochi his capital world. His forces expanded Fortress Baarlos by excavating catacombs beneath the tower, and adding planetary shield generators and an ion cannon for defense. In addition to dungeons for slaves and prisoners, and quarters for his soldiers and aides, he organized an extensive library of holovids and a huge assembly chamber where he held court, received tribute, and viewed entertainment. A connoisseur of literature and art, Faarl hired over one hundred artists and entertainers for his court, including writers, musicians, and a troupe of Tetranni body-sculptors. He also built a spaceport on Pochi, which encouraged the growth of the city of Vindru.\nFaarl's activities led General Airen Cracken, the head of New Republic Intelligence, to set a bounty of 50,000 credits for Faarl's capture in 7 ABY. The New Republic was too busy fighting the Galactic Empire at the time, however, and was unable to take direct action against his remote conquests. Faarl was eventually captured by Boba Fett, who defeated his Tulvaree guards, entered Fortress Baarlos, and captured the young warlord.\n\"The Child Conqueror\" was described by General Cracken as a \"cunning warrior.\" Though he rarely took the field, preferring to direct his forces from his hidden base, Faarl often wore a suit of battle armor and armed himself with a powerstaff.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Korlings",
  "/wiki/12_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Pirate/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Birthday/Legends",
  "/wiki/Korlings_system",
  "/wiki/Star_system/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Parthovian_Cluster",
  "/wiki/Star_cluster/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/DP20_frigate",
  "/wiki/Starfighter/Legends",
  "/wiki/Tulvaree",
  "/wiki/Mercenary/Legends",
  "/wiki/Pochi",
  "/wiki/Orbit/Legends",
  "/wiki/Star/Legends",
  "/wiki/Faarlsun",
  "/wiki/Fortress_Baarlos",
  "/wiki/Sentience/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planetary_shield/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Holovid/Legends",
  "/wiki/Musician/Legends",
  "/wiki/Tetranni_body-sculptor",
  "/wiki/Spaceport/Legends",
  "/wiki/City/Legends",
  "/wiki/Vindru",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Bounty/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/7_ABY/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Assault_on_Fortress_Baarlos",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Battle_armor",
  "/wiki/Powerstaff",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_History_of_the_Mandalorians",
  "/wiki/Star_Wars_Insider_80",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Xim_Week:_The_Despotica",
  "/wiki/StarWars.com"
 ]
}