{
 "name": "Faie",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Quinlan Vos's unit",
      "Quinlan Vos's unit"
     ]
    }
   ]
  }
 ],
 "content": "\"Faie\" was the nickname of a human male clone trooper who served in the Grand Army of the Republic with the military rank of Clone Commander. Serving in the unit of Jedi General Quinlan Vos, Commander Faie's by-the-book and no-nonsense approach aggravated his Jedi superior. Faie was dispatched to the planet Saleucami and subsequently to the Wookiee homeworld, Kashyyyk, to defend it from the Separatist Alliance. Faie took control of the Galactic Republic's troopers after the disarray of Order 66, a directive calling for the immediate execution of the Jedi. A wounded Vos struck down Faie during the Great Jedi Purge before Faie could destroy a Wookiee village.\nGrown on the planet Kamino from the DNA of Jango Fett, a bounty hunter who became the template of the Grand Army of the Republic, the individual who adopted the nickname \"Faie\" was a clone trooper with the military rank of Clone Commander. Faie was one of many commanders that were specially trained for combat for the pan-galactic Clone Wars between the Galactic Republic and the Separatist Alliance.\nIn 19 BBY, during the final stages of the Clone Wars, Commander Faie was dispatched to Saleucami, a planet within the Foundry of the Confederacy, alongside Clone Commander CC-8826 \"Neyo\" of the 91st Mobile Reconnaissance Corps and Clone Marshal Commander CC-5052 \"Bly\" of the 327th Star Corps.\nThe Wookiee homeworld, Kashyyyk, located in the Mid Rim Territories, was an attractive target for the Separatists. As such, Jedi General Luminara Unduli commanded Kashyyyk's defenses, and was joined by Jedi Grand Master Yoda and Jedi General Quinlan Vos in 19 BBY. Following his time on Saleucami, Commander Faie was sent to Kashyyyk as well, with both Faie and the general in whose unit he served, Vos, fighting a vicious campaign against droid armies, keeping the planet securely in Republic control. During the Battle of Kashyyyk, Dark Lord of the Sith Darth Sidious, publicly the Republic Supreme Chancellor Sheev Palpatine, contacted clone trooper officers throughout the galaxy, directing them to execute Order 66. The protocol called for the immediate execution of the Jedi as they were classified as traitors, thus beginning the Great Jedi Purge.\nRepublic forces fell into disarray as clone troopers sought to eliminate their Jedi Generals, during which Separatist forces led by the ST-series super tactical droid General Linwodo established a beachhead and prepared their attack on the city Kachirho. Despite Clone Commander CC-1004 \"Gree\" of the 41st Elite Corps and Clone Captain \"Jek\" of the Ranger Corps having been killed attempting to assassinate Master Yoda as part of Order 66, Commander Faie was able to quickly regroup the Republic forces and secure a final victory against the Separatists. Clone operations then adjusted to hunting down lingering Separatists and Jedi fugitives. On Faie's orders, clone scout troopers using All Terrain Reconnaissance Transports, including the 41st Ranger Platoon, searched for Yoda and Vos amid Kashyyyk's bogs and forests.\nAlthough Yoda escaped, a wounded Vos struck down Faie before he could destroy a Wookiee village in his hunt for the Jedi. Unduli was captured and placed in custody, where she eventually died. Although Vos' fate became unknown, the Inquisitorius, a dark side Jedi hunting organization within the Republic's successor government, the Galactic Empire, presumed Vos to have survived and included him in a list of priority targets with other presumed survivors, such as Yoda.\nAs a clone, Commander Faie was a human male who stood 1.83 meters tall. Faie was an ideal soldier from the Kaminoan engineers that produced him, as he was a by-the-book, no-nonsense soldier. As such, his attitude was the cause of much aggravation to his Jedi General, Quinlan Vos, who was more flexible.\nAs a clone trooper officer, Commander Faie was trained in combat.\nCommander Faie used a set of white customized Phase II clone trooper armor with circular light brown markings on the limbs. Faie's helmet had one such marking as a circle on the right side of the helmet. The helmet consisted of respirators, a mouthpiece, and two small visors for the eyes. Additionally, a pentagonal accessory was placed on the top section of the helmet, centered above the visors. Faie also wore a white cloak over his armor, and he was equipped with a DC-15A blaster rifle as well as a light brown utility belt.\nClone Commander Faie debuted in the new Star Wars canon in a bust for the character from Gentle Giant Studios as an exclusive product for Premier Guild members. The hand-made polyresin bust, released in 2016, was based on concept art for Star Wars: Episode III Revenge of the Sith, the final installment of the prequel trilogy, which was released on May 19, 2005. Originally, Faie was meant to be the clone appearing on Saleucami, but after Faie's digital model was replaced by CC-8826's instead, the clone's name was changed to correspond with the alteration. As a result, Faie did not appear in the film. Faie is named after Lucasfilm Art Department Supervisor Fay David.\nIn the Star Wars Legends continuity, Faie debuted in the seventy-fourth issue of Dark Horse Comics' Star Wars: Republic comic-book series, released on March 23, 2005. The comic issue was authored and penciled by John Ostrander and Jan Duursema, respectively.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Faie",
  "/wiki/Faie/Legends",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Quinlan_Vos%27s_unit",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Military_rank",
  "/wiki/Clone_Commander",
  "/wiki/Jedi_General",
  "/wiki/Quinlan_Vos",
  "/wiki/Commander",
  "/wiki/Jedi",
  "/wiki/Siege_of_Saleucami",
  "/wiki/Planet",
  "/wiki/Saleucami",
  "/wiki/Wookiee",
  "/wiki/Homeworld",
  "/wiki/Kashyyyk",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Trooper",
  "/wiki/Order_66",
  "/wiki/Death_penalty",
  "/wiki/Great_Jedi_Purge",
  "/wiki/DNA",
  "/wiki/Jango_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_template",
  "/wiki/The_galaxy",
  "/wiki/Clone_Wars",
  "/wiki/19_BBY",
  "/wiki/Foundry_of_the_Confederacy",
  "/wiki/CC-8826",
  "/wiki/91st_Mobile_Reconnaissance_Corps",
  "/wiki/Clone_Marshal_Commander",
  "/wiki/CC-5052",
  "/wiki/327th_Star_Corps",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Luminara_Unduli",
  "/wiki/Commanding_officer",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Time",
  "/wiki/General",
  "/wiki/Battle_of_Kashyyyk",
  "/wiki/Droid",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Sidious",
  "/wiki/Supreme_Chancellor",
  "/wiki/Clone_trooper_officer",
  "/wiki/Galaxy",
  "/wiki/Treason",
  "/wiki/ST-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/Linwodo",
  "/wiki/City",
  "/wiki/Kachirho",
  "/wiki/CC-1004",
  "/wiki/41st_Elite_Corps",
  "/wiki/Clone_Captain",
  "/wiki/Jek",
  "/wiki/Ranger_Corps",
  "/wiki/Death",
  "/wiki/Clone_scout_trooper",
  "/wiki/All_Terrain_Reconnaissance_Transport",
  "/wiki/41st_Ranger_Platoon",
  "/wiki/Forest",
  "/wiki/Inquisitorius",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Jedi_hunter",
  "/wiki/Galactic_Empire",
  "/wiki/Soldier",
  "/wiki/Kaminoan",
  "/wiki/Engineer",
  "/wiki/Officer",
  "/wiki/Color",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Limb",
  "/wiki/Helmet",
  "/wiki/Breath_mask",
  "/wiki/Mouth",
  "/wiki/Eye",
  "/wiki/Cloak",
  "/wiki/Armor",
  "/wiki/DC-15A_blaster_rifle",
  "/wiki/Utility_belt",
  "/wiki/Star_Wars",
  "/wiki/Gentle_Giant_Studios",
  "/wiki/2016",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Prequel_trilogy",
  "/wiki/May_19",
  "/wiki/2005",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Fay_David",
  "/wiki/Star_Wars_Legends",
  "/wiki/Republic_74",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars:_Republic",
  "/wiki/Star_Wars_comic_books",
  "/wiki/March_23",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_42",
  "/wiki/Category:Images_of_Faie",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_21",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Darth_Vader_(2017)_7",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/Databank_(original)",
  "/wiki/May_20",
  "/wiki/2015"
 ]
}