{
 "name": "Falyeh_Keth",
 "display_name": "Falyeh Keth",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Circa 28 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "78 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Falyeh Keth was a male Gungan who served in the Rebel Alliance during the Galactic Civil War.\nKeth was born on the planet Naboo in about 28 BBY and during his childhood he often listened to stories about the rise if the Galactic Empire. He became convinced that the things that the Empire was doing were wrong and over time, he developed a number of technical skills that he believed would be of use to any rebellion that took place against Imperial rule. Following the outbreak of the Galactic Civil War, Keth left Naboo and joined the Rebel Alliance.\nAt some point after the destruction of the planet Alderaan, Keth and a team of Rebel agents were dispatched by the Alliance to the planet Tazan, to destroy an Imperial Data Processing Facility that was located on the world. After arriving on Tazan, Keth and the rest of the team rendezvoused with the Alliance sympathizer Willer Clines in Clines' house, in the Desander Section of Tazan City. However, their conversation with Clines was secretly monitored by a group of Imperial stormtroopers and once the stormtroopers believed that Rebels had revealed all that they would about their mission, the stormtroopers entered Clines' lounge and attacked Keth and the rest of the Rebels. The agents escaped and eventually infiltrated the Data Processing Facility, where they extracted some Imperial TIE Fighter communications protocols and then blew up the structure.\nKeth's skills and abilities ensured that he was welcomed by his colleagues within the Rebel Alliance. However, he was always looking for an opportunity to prove himself, became he was aware that Gungans were regarded as a bit of a joke by members of some other species.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/28_BBY/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Kilogram/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Alderaan/Legends",
  "/wiki/Mission_to_Tazan",
  "/wiki/Tazan",
  "/wiki/Imperial_Data_Processing_Facility",
  "/wiki/Willer_Clines",
  "/wiki/Willer_Clines%27_House",
  "/wiki/Desander_Section",
  "/wiki/Tazan_City",
  "/wiki/Stormtrooper/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Species/Legends",
  "/wiki/Ultimate_Core_Dump",
  "/wiki/0_BBY/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}