{
 "name": "Fang Zar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sern Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Delegation of 2",
      "000",
      "Delegation of 2",
      "000",
      "Galactic Empire",
      "Imperial Senate",
      "Imperial Senate"
     ]
    }
   ]
  }
 ],
 "content": "Fang Zar was a male human senator who served in the Galactic Senate during the Clone Wars representing Sern Prime. Prior to the war's end, he was part of the Delegation of 2,000 out of concern over various amendments to the constitution. As a result, he and his allies presented the Petition of 2,000 to Supreme Chancellor Sheev Palpatine. Palpatine later transformed the Republic into the Galactic Empire after Order 66 was enacted. One day after the formation of the Empire, Imperial Intelligence conducted a mass arrest of senators, which included Zar.\nFang Zar was a male human who served as the senator of Sern Prime in the Galactic Senate of the Galactic Republic during the Clone Wars against the Confederacy of Independent Systems. During the war, Zar was present in the Galactic Senate Chamber when Senator Rush Clovis spoke about his and Senator Padmé Amidala's discovery of corruption in the InterGalactic Banking Clan.\nAfter Clovis was nominated as the head of the Banking Clan and substantially increased the interest rates on loans undertaken by the Republic and not on the loans by the Separatists, Zar was present in the Senate Chamber as the Senate reacted to the news.\nAfter a mission to Oba Diah undertaken by the Jedi Order, Zar was present in the Jedi Temple on Coruscant accompanying fellow Mon Calamari Senator Meena Tills when Jedi Master Mace Windu approached Master Obi-Wan Kenobi and spoke to him about his concern for Grand Master Yoda's health.\nBy the final stages of the Clone Wars, Zar was part of the Delegation of 2,000, a group of 2,000 senators that were concerned with Supreme Chancellor Palpatine's growing political power. The Delegation presented the Petition of 2,000, a formal protest to Palpatine's growing power. Eventually, Palpatine, secretly the Dark Lord of the Sith Darth Sidious, proclaimed the Jedi traitors to the Republic and transformed the Republic into the Galactic Empire, with himself as its Emperor.\nOne day after the formation of the Empire, Imperial Intelligence arrested sixty-three senators from the Delegation, including Zar, on charges of conspiracy and treason.\nZar had a long, graying beard and wore a diamond-patterned lilac robe.\nMany senators proudly wore the traditional dress of their people. However, others used their statues and substantial budgets of their offices to pay for the luxurious outfits. On Coruscant they wore flamboyant creations made by the most famous designers using delicately important fabrics. Senator Fang Zar was one of them.\nFang Zar first appeared in the 2005 film Star Wars: Episode III Revenge of the Sith and was portrayed by Warren Owens.\nZar was later identified in the episode guide of \"An Old Friend,\" the fifth episode of the sixth season released in 2014, where he was slated to appear but was cut from the final version of the episode.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Fang_Zar",
  "/wiki/Fang_Zar/Legends",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_End_of_the_Clone_Wars",
  "/wiki/Sern_Prime",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Delegation_of_2,000",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Senate",
  "/wiki/Senator",
  "/wiki/Galactic_Senate",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Constitution",
  "/wiki/Petition_of_2,000",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Order_66",
  "/wiki/Standard_day",
  "/wiki/Imperial_Intelligence",
  "/wiki/Senatorial_arrests",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Galactic_Senate_Chamber",
  "/wiki/Rush_Clovis",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Mission_to_Oba_Diah_(Clone_Wars)",
  "/wiki/Oba_Diah",
  "/wiki/Jedi_Order",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Mon_Calamari",
  "/wiki/Meena_Tills",
  "/wiki/Jedi_Master",
  "/wiki/Mace_Windu",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Cloning",
  "/wiki/Politics",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth",
  "/wiki/Jedi",
  "/wiki/Galactic_Emperor",
  "/wiki/Imperial_calendar",
  "/wiki/Treason",
  "/wiki/Clothing",
  "/wiki/2005",
  "/wiki/Warren_Owens",
  "/wiki/An_Old_Friend",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/2014",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/Crisis_at_the_Heart",
  "/wiki/Voices",
  "/wiki/StarWars.com",
  "/wiki/The_Creatures_of_Episode_III",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Databank_(website)",
  "/wiki/Databank_(original)"
 ]
}