{
 "name": "Fanry",
 "display_name": "Fanry",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pijal"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 54 BBY",
      "Pijal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pijali monarchy"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Rael Averross"
     ]
    }
   ]
  }
 ],
 "content": "Fanry was a human female princess who hailed from the Inner Rim planet Pijal during the Republic Era. Born around 54 BBY as a member of the Pijali monarchy, she lived within the Pijali palace in the world's capital city during her childhood. When she was six years old, Fanry inherited the right to Pijal's throne, and the Jedi Knight Rael Averross was sent to serve as her lord regent. Shortly after his arrival on Pijal, Averross took Fanry under his wing, mentoring the Pijali princess in leadership and diplomacy. Over time, Fanry came to resent being viewed as a replacement protégé for Averross's former Padawan, Nim Pianna. In the following years, she formed a distaste for the Czerka Corporation, a company she felt had exploited Pijal and its citizens for centuries using its expansive influence. Her research on Pijal's former monarchs led her to feel passionately that the Pijali people deserved to achieve freedom from Czerka.\nAt some point, Averross and the Czerka Sector Supervisor Meritt Col drafted a Governance Treaty for Fanry to sign at her coronation, a motion that would transfer authority to a newly formed democratic Assembly that could act to open the Pijal Hyperspace Corridor hyperspace route in coordination with the Galactic Republic. Despite her regent's heavy support of the initiatve, Fanry dissented with the ritual phrases in the treaty, strongly feeling that it would eventually grant Czerka irrevocable power on Pijal. With her crowning steadily approaching, the princess's increasing disillusionment with Czerka prompted her to conscript the assistance of her slave attendant Cady and her royal guard captain Deren in plotting a revolution against Averross's goal of making her a constitutional monarch. Under her orders, Pijali blackguards incited attacks on Czerka facilities, slowly increasing in intensity. Jedi Master Qui-Gon Jinn and Padawan Obi-Wan Kenobi were sent to Pijal following the incidents, aiming to protect the princess and ratify the Governance Treaty on behalf of the Republic upon its signing.\nUndeterred, Fanry continued with her revolutionary plans, hoping to prevent the treaty signing and free her world from Czerka. The princess devised two fabricated assassination attempts on herself, both of which Cady assisted with. However, when these attacks only strengthened Averross's resolve to force Fanry into signing the Governance Treaty, the princess began plotting to seize power by force in the near future. At her coronation, after being crowned queen, Fanry stabbed a Pijali religious leader and ordered the death of anyone who supported Averross's initiative. After the ensuing chaos, from the bridge of the flagship Righteous, Fanry rejected appeals to find a peaceful resolution with opposing parties. As she prepared her ship to fire on the Leverage, a Czerka cruiser, she was informed that slaves aboard the company's vessel were revolting against their owners. When Fanry coldly refused to help them, Cady turned on her queen, holding her at blaster-point until the ruler surrendered. In the aftermath of the incident, Fanry abdicated her position and Pijal's government was formed into a democratic Assembly lead by the Pijali Governor Orth. The former ruler was sentenced to four years of house arrest for her actions, and Averross later expressed guilt for failing Fanry as a mentor.\nThe human female Fanry was born on the Inner Rim planet Pijal around 54 BBY. As a Pijali princess in line for the throne, she was raised as a member of the Pijali monarchy and kept confined to the Pijali palace in Pijal's capital city during her early years. From a young age, Fanry became accustomed to having attendants and slaves serve her and moved into the palace's royal chamber quarters at some point. Around 48 BBY, at six years old, she inheirited the right to Pijal's throne after the world's prior monarch died. Pijal's courtiers argued over who should govern as Fanry's regent until she was old enough to rule, but they failed to come to a consensus and reached out to the Galactic Republic for a neutral arbiter. The Jedi High Council sent Jedi Knight Rael Averross of the Jedi Order to Pijal to serve as the world's lord regent on the Republic's behalf until the princess was of age to be officially invested as monarch. Shortly after his arrival on Pijal, Averross took Fanry under his wing as a pupil in the fields of leadership and diplomacy, intending to prepare the princess for her future role as Pijal's queen.\nAround 42 BBY, Averross represented the Pijali princess in a meeting of Senate diplomats while in the Galactic Senate Building on the Core Worlds planet Coruscant, briefly discussing the session with his former Jedi Master, Dooku. Over time, Fanry heard many stories about the death of her regent's former Padawan, Nim Pianna, and grew to resent being viewed as a replacement protégé for the Jedi student in Averross's eyes. Eventually, the princess's observations of Averross led her to conclude that his actions as lord regent were rooted in an effort to make up for his failures with Pianna and not because he cared about her role as Pijal's future queen. As years passed, Averross continued to micromanage her daily life, and the princess began to intentionally act as a naïve child to him and her court while privately forming strong resolve surrounding her life goals and ideals. Fanry formed a strong dislike for Averross's close association with and support of the Czerka Corporation, a company she felt had exploited Pijal and its citizens for centuries. In preparation for her future role as queen, the princess researched many of her homeworld's former monarchs, discovering that all in recent history had been relatively powerless puppet rulers due the heavy Czerka influence on Pijal.\nAt some point, against Fanry's wishes, Averross worked with the local Czerka Sector Supervisor Meritt Col to draft a Governance Treaty initiative that would strip power from the Pijali monarchy governing the Pijal system. The motion would instead grant authority to a democratic Assembly, a system of government that Averross felt could use its newly given jurisdiction to open the Pijal Hyperspace Corridor hyperspace route in coordination with the Republic. Although Averross and Col were insistent that the princess sign the treaty on her fourteenth birthday at her coronation, she dissented with the initiative. Fanry's unease with the treaty in part stemmed from the ritual language it included, strongly feeling that it would grant Czerka irrevocable power on Pijal through the Assembly's inability to cancel contract agreements once made, which would allow the company to abuse Pijali citizens unchecked while the world's new government gradually lost authority over time. When voicing her disagreement with the Governance Treaty, the princess's concerns were brushed off as the baseless musings of a child too young to comprehend serious matters by most courtiers, except for the Pijali minister Orth, who also despised Czerka.\nWith the day of her coronation steadily approaching, Fanry became increasingly disillusioned with Czerka's influence after learning that her Skykeeper, a revered religious leader on Pijal, was taking bribes from the company in violation of his duties to protect Pijali soulcraft vessel docks from commercial use. As Averross's fixation with the treaty's success intensified, Fanry conscripted the assistance of her Czerka-owned slave and trusted confidante, Cady, in plotting a revolution against the regent's aspiration to install her as a relatively powerless constitutional monarch. To gather information about Averross's activities, the princess instructed Cady to spend the majority of her time monitoring the regent. As her frustration grew, Fanry ordered the Pijali armed forces loyal to her, which consisted of royal guards and blackguards led by their captain, Deren, to instigate increasingly violent attacks against Czerka facilities. With Averross's attentions focused on discovering the origin of the incidents, Fanry helped frame the Opposition, a political performance troupe known for protesting the treaty, for the dissidence caused by her guards.\nIn 40 BBY, with her crowning only a few days away, Fanry instructed her guards to increase the intensity of their attacks to instill fear in Averross, hoping he would postpone or cancel the treaty signing. The blackguards, acting under their monarch's orders, used corrosive nanotechnology to disintegrate the roof of a newly constructed Hall of Assembly building and detonated an explosive droid that blew up a Czerka warehouse facility. As her regent's resolve to coerce Fanry into signing the treaty hardened, she began planning to seize power by force at her upcoming coronation. Due to the chaos resulting from the strikes, Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi were sent to Pijal to protect Fanry until her coronation and ratify the signing of the Governance Treaty on the Republic's behalf.\nBy then operating under the watchful eyes of the Jedi, Fanry became more determined to lead Pijal into a future free of Czerka influence as a warrior queen. Although she acted outwardly childish and friendly to Jinn, Kenobi, and the rest of her court, the princess continued working with Deren and Cady to undermine Averross. As the next part of her plan, Fanry devised a fake assassination attempt on herself to frame the Opposition for its first violent initiative against the Pijali monarchy, which Cady carried out. Assisted by Fanry, Cady acquired a slicer dart, a type of nanotechnology device capable of temporary mind control, and planted it in the windowsill of her mistress's Pijali palace quarters. The incident horrified Averross, whose former Padawan had died during an incident involving a slicer dart. His rage following the fabricated attack led him to believe it as a legitimate attempt on Fanry's life, fueling his fear for the princess and resolve to protect her until the treaty could be signed.\nDespite the apparent security risks, Fanry attended several events meant to introduce her to a wider audience of Pijali citizens, which included a concert from the balcony of her quarters and a private party with Col. To follow her planet's traditions, she prepared to participate in a ceremonial Grand Hunt event, which was a ritual rite of passage symbolizing a future monarch's ability to provide for their people. Prior to the hunt, Cady, under Fanry's orders, sabotaged the event's prey, a modified crab droid, by giving it orders to kill the princess. The evening of the event, the princess rode a Pijal varactyl in the Grand Hunt and skillfully pursued the prey droid. However, as a result of Cady's prior sabotage, the crab droid attacked Fanry, prompting Jinn, Averross, and Kenobi to destroy it with their lightsabers and begin investigating the incident. Although the Jedi's investigation concluded that the droid's saboteur must have been one of the palace staff or Pijali nobles attending the event, Fanry covered for Cady, insisting on her court's loyalty.\nFollowing a violent vision of Fanry's upcoming coronation, Jinn refused to ratify the Governance Treaty at the crowning, fearing something adverse would occur. Although Fanry was elated at the news, Averross's support of the initiative remained unchanged and Jinn's apprentice was instructed by the Jedi Council to affirm the validity of the treaty after the princess's signing in his Master's place. As her regent's relationship with the older Jedi deteriorated, Fanry sent royal troops led by Deren to Pijal's moon to rescue Jinn and Kenobi when they were attacked by blackguards, against Averross's wishes. Initially disappointed by her decision to overstep him, Averross viewed Fanry's rescue of Jinn as mature, crediting himself for mentoring her well. Two days prior to her crowning, in preparation for her ascent to the throne, the princess selected a circlet crown beaded with gemstones from Pijal's royal treasury to wear during the event with the help of her court jeweler and Orth.\nShortly prior to the coronation, Fanry helped replace the kyber crystal in Kenobi's lightsaber with a kohlen crystal in an attempt to render it useless as a weapon. On the day of the grand event, Cady helped prepare her princess, assuring that positive change would happen soon. As regal music played, the princess entered the palace's Celestial Chalice for her crowning, stopping at a grand dais in the center of the room. In keeping with tradition, Fanry swore her loyalty to Pijal, received a ceremonial sword from the Skykeeper, and was crowned queen. She proceeded to stab the religious leader with the sword and instructed Deren to activate kohlen crystal–powered shields that protected herself, her guard captain, and Cady. Having successfully completed her seizure of power as an absolute monarch, she publicly decried democracy and justified her violent actions as defending Pijal's citizens from Czerka's tyranny. Fanry berated her Skykeeper for accepting bribes from Czerka and ordered Deren to kill several individuals who had supported the Governance Treaty, only choosing to spare those who had spoken out against the initiative.\nBefore the captain could execute his orders, Kenobi used the orange blade projected from his sabotaged lightsaber to breach Deren's shield, cutting the man open. The sight of the injured guard prompted Fanry and Cady to escape through the Chalice's roof by using an ascending cable attached to a harness to climb into a royal troop dropship, leaving Deren, the injured Skykeeper, and Pijal's court jeweler behind. After the pair boarded the Righteous, the recently renamed flagship of Pijal's royal fleet, Fanry allowed Cady to have a droid remove her slave-tracking chip, freeing the attendant from Czerka. The newly crowned queen became furious upon learning that Col, whom she wished kill at her coronation, had escaped the ceremony and remained in command of the Leverage, a Czerka cruiser.\nNow alight with adrenaline and confidence from her coronation, Fanry accepted a hologram call from Jinn and Averross from the bridge of the Righteous, brushing off attempts to negotiate a peaceful solution to the ordeal. The queen, upon hearing Averross's voice, berated him for his collaboration with Czerka and for treating her as a replacement for Pianna to assuage his personal feelings of grief. Proceeding with her plans, Fanry coldly ordered her flagship to prepare to attack the Leverage. As the Righteous's weapons powered up, Jinn informed her in a second hologram call that the slaves stationed aboard the Leverage were revolting against their owners. Although Cady initially believed that her queen would help the slaves, Fanry insisted on commencing her assault on the Leverage despite the innocent lives still on board.\nFeeling betrayed, Cady became furious, confronting Fanry about the extensive work and sabotage she had carried out under the monarch's orders with the belief that she would end slavery on Pijal after becoming queen. When Cady proceeded to hold Fanry at blaster-point, refusing to take orders from the Pijali queen, the ruler was eventually forced to surrender. Within two days of the chaotic coronation, Fanry opted to abdicate her right to Pijal's throne after a Republic judicial ruling deemed her ascent to the throne through violent means as illegal. A distant cousin of Fanry's, Lamia, briefly reigned as Pijal's queen for a few hours to sign treaties forming the world's monarchy into a democratic Assembly, outlawing slavery in the Pijal system, and setting up the Pijal Hyperspace Corridor as a hyperspace route.\nThe new leader of the Assembly, Governor Orth, immediately canceled all contracts Pijal had maintained with Czerka, lamenting that Fanry had never reached out to her for help in standing up to the company in a violence-free way. As punishment for her failed revolution, Fanry was placed under house arrest in the Pijali palace for a sentence of four years, a term meant to end when she turned eighteen years old. In the aftermath of the events, Averross came to recognize that Fanry had felt that she was Pianna's replacement to him and lamented his errors in mentoring the princess. Upon Jinn and Kenobi's return to Coruscant, the Master reported what had happened on Pijal during their mission, including Fanry's attempted revolution, to the Jedi Council.\nAs a Pijali princess, Fanry was passionate about her planet's traditions and the responsibility of leading her world to a brighter future. Over time, Fanry formed a strong conviction that the Czerka Corporation was harming Pijali cititzens and was emboldened to protect her people as soon as she was able to. The princess cultivated fury against the company and Averross's failure to listen to her, using it as fuel for her aspirations to become a warrior queen. Knowing that many viewed her as an innocent child, Fanry actively played into their assumptions and presented herself to the Pijali court as a relatively naïve and charming conversationalist.\nTo achieve her goals, Fanry was willing to engage in subterfuge and later murder, conscripting her trusted slave Cady to help her with several aspects of her revolution. As Averross imparted knowledge to Fanry, she used what she learned about diplomacy to lie to him and others, fooling most of the Pijali court of the Opposition's alleged involvement with violent attacks while concurrently planning each incident for her blackguards to carry out. The princess's resentment for Averross led her to wish for his death, believing that he never cared about her and was using her as a method to assuage his past feelings of lingering guilt for his last student's death. At her coronation, Fanry's violent of seizure of power and subsequent speech earned her the admiration of her citizens. She felt passionately that the system of government ruling the Pijal system was far superior than the Galactic Republic's and publicly decried its democratic ideals.\nWhen presented with the option, Fanry's desire to see Czerka's officials suffer outweighed her wish to protect slaves working for the company. Cady, who had been loyal to her ruler under the impression that she would end slavery on Pijal once queen, betrayed her former owner after being freed from her tracking chip. After abdicating her position, the former queen was regarded as having had courage for standing up to Czerka and was thought of by Orth as someone who could achieve great things after maturing more. Fanry had pale skin and blue eyes, and her curly red hair resembled the color of a fire's blaze. By the time of her coronation, she possessed a youthful appearance and had short stature.\nWhile crown princess on Pijal, Fanry carried out her court duties with grace and poise. As the princess later began to plot her revolution, she became an extremely skilled liar, engaging in many forms of subterfuge for an extended period of time. Fanry was a studious learner, successfully acting innocent and gullible to everyone she met. Her technical knowledge helped her devise several violent attacks against Czerka and an assassination attempt on herself, all of which she framed the Opposition for. Although unskilled in direct combat, Fanry proved able to stab the Skykeeper with a sword during her coronation and ascend from the Celestial Chalice with a cable and harness to flee the venue. The princess's ruthless control over her emotions led her to care little for the consequences of her actions, having honed her ability to give orders efficiently from a young age.\nAs a Pijali royal preferring to dress in her planet's traditional style, Fanry's wardrobe was well stocked with tailored clothing that focused on highlighting subtle hints of internal beauty with a mostly plain external appearance. Her clothing collection included several pieces of silk finery, including white court gowns and slippers for daily wear. In keeping with Pijali tradition, Fanry kept her hair hidden from the public until becoming queen by covering it with scarves in daytime and a nightcap while asleep. The princess owned several turbans and headscarves in colors such as white, ivory, and pale green, often opting to coordinate her selection with her gown's color.\nWhile devising revolutionary plots, Fanry had access to corrosive nanotechnology, which her blackguards used to disintegrate the roof of a newly finished Hall of Assembly building. The princess also acquired a slicer dart and a droid rigged to explode, instructing those working for her to utilize them in fabricated attacks on Czerka and the monarchy while she helped frame the Opposition for the incidents. As princess, she held the loyalty of Pijal's royal guards and blackguards, which allowed her maintain full control over Pijal's armed fleet and its flagship, Heavenly Sphere, which she later renamed the Righteous. Fanry used these ships to rescue Jinn on Pijal's moon as well as to contact him through hologram calls days later.\nWhen greeting Jedi arriving to aid Pijal, Fanry wore a long white dress featuring slits in the sleeves and skirts, which showed glimpses of her gold-colored shimmersilk undergown. As heir apparent of her planet's throne, she participated in a Grand Hunt while wearing a plain, wide-sleeved sandy frock and green underdress for varactyl riding. For the event, she was given an energy bow to shoot prey and was provided with a basket of luxuries. For her coronation, Fanry chose to don a long-sleeved white dress paired with a midnight blue undergown and a thick cuff bracelet. During the event, she received the Pijali ceremonial sword and crowned herself with a ceremonially consecrated circlet adorned with small gemstones. When it became necessary for her to escape from the Celestial Chalice, Fanry took a personal shield–generating device from Deren and used an ascending cable attached to a harness to ascend into a dropship. As her gown became stained in the coronation, she chose to don a silvery armorweave chestplate over it.\nFanry first appeared in Master \u0026 Apprentice, a 2019 novel written by Claudia Gray. In an interview, Gray reflected that she considered Fanry and Rael Averross's relationship similar to that of an overprotective father's tension with his daughter. The author felt that Averross's motivation for mentoring Fanry was fueled by his failure to save his former Padawan and that the regent's extensive training of Fanry in royal protocol and politics helped the young ruler to fool almost everyone around her into believing she was a child with no aspirations to seize power at her coronation. Gray personally envisioned Fanry as being portrayed by actress Sadie Sink.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Pijal",
  "/wiki/54_BBY",
  "/wiki/Human",
  "/wiki/Pijali",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Pijali_monarchy",
  "/wiki/Rael_Averross",
  "/wiki/File:Fanry1.ogg",
  "/wiki/Prince",
  "/wiki/Homeworld",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Republic_Era",
  "/wiki/Reproduction",
  "/wiki/Pijali_palace",
  "/wiki/Pijal_capital_city",
  "/wiki/Standard_year",
  "/wiki/Throne",
  "/wiki/Jedi_Knight",
  "/wiki/Mission_to_Pijal_(Rael_Averross)",
  "/wiki/Lord",
  "/wiki/Regent",
  "/wiki/Diplomat",
  "/wiki/Time",
  "/wiki/Padawan",
  "/wiki/Nim_Pianna",
  "/wiki/Czerka_Arms",
  "/wiki/Standard_century",
  "/wiki/Politics",
  "/wiki/Monarchy",
  "/wiki/Sector_Supervisor",
  "/wiki/Meritt_Col",
  "/wiki/Governance_Treaty",
  "/wiki/Coronation_of_Queen_Fanry",
  "/wiki/Democracy",
  "/wiki/Assembly_(Pijal)",
  "/wiki/Pijal_Hyperspace_Corridor",
  "/wiki/Hyperspace_route",
  "/wiki/Galactic_Republic",
  "/wiki/Crown",
  "/wiki/Slavery",
  "/wiki/Aide",
  "/wiki/Cady",
  "/wiki/Royal_guard_(Pijal)",
  "/wiki/Captain",
  "/wiki/Deren",
  "/wiki/Blackguard",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Mission_to_Pijal",
  "/wiki/Assassin",
  "/wiki/Religion",
  "/wiki/Unidentified_Skykeeper",
  "/wiki/Death",
  "/wiki/Flagship",
  "/wiki/Heavenly_Sphere",
  "/wiki/Starship",
  "/wiki/Leverage",
  "/wiki/Cruiser",
  "/wiki/Slave_revolt_on_the_Leverage",
  "/wiki/Blaster",
  "/wiki/Governor",
  "/wiki/Orth",
  "/wiki/File:Fanry2.ogg",
  "/wiki/Royal_chamber",
  "/wiki/48_BBY",
  "/wiki/Unidentified_Pijal_monarch",
  "/wiki/Noble",
  "/wiki/Jedi_High_Council",
  "/wiki/Jedi_Order",
  "/wiki/Queen",
  "/wiki/42_BBY",
  "/wiki/Galactic_Senate",
  "/wiki/Galactic_Senate_Building",
  "/wiki/Core_Worlds",
  "/wiki/Coruscant",
  "/wiki/Dooku",
  "/wiki/Jedi",
  "/wiki/Eye",
  "/wiki/Standard_day",
  "/wiki/Youngling",
  "/wiki/Pijal_system",
  "/wiki/Birthday",
  "/wiki/Language",
  "/wiki/Minister",
  "/wiki/File:Fanry3.ogg",
  "/wiki/Soulcraft",
  "/wiki/Spy",
  "/wiki/Weapon",
  "/wiki/Opposition",
  "/wiki/Security_guard",
  "/wiki/40_BBY",
  "/wiki/Nanotechnology",
  "/wiki/Hall_of_Assembly",
  "/wiki/Droid",
  "/wiki/Czerka_warehouse",
  "/wiki/File:Fanry4.ogg",
  "/wiki/Slicer_dart",
  "/wiki/Viewport",
  "/wiki/Mutiny_on_the_Advent",
  "/wiki/Grand_Hunt",
  "/wiki/Hunting",
  "/wiki/Saboteur",
  "/wiki/LM-432_crab_droid",
  "/wiki/Pijal_varactyl",
  "/wiki/Lightsaber",
  "/wiki/Force_vision",
  "/wiki/Troop",
  "/wiki/Pijal%27s_moon",
  "/wiki/Gemstone",
  "/wiki/Pijali_palace_treasury",
  "/wiki/Unidentified_court_jeweler",
  "/wiki/File:Fanry5.ogg",
  "/wiki/Kyber_crystal",
  "/wiki/Obi-Wan_Kenobi%27s_first_lightsaber",
  "/wiki/Kohlen_crystal",
  "/wiki/Music",
  "/wiki/Celestial_Chalice",
  "/wiki/Pijali_ceremonial_sword",
  "/wiki/Sword",
  "/wiki/Crystal",
  "/wiki/Deflector_shield",
  "/wiki/Ascension_cable",
  "/wiki/Dropship",
  "/wiki/Royal_fleet",
  "/wiki/Commanding_officer",
  "/wiki/File:Cady1.ogg",
  "/wiki/Hologram",
  "/wiki/Judicial",
  "/wiki/Lamia",
  "/wiki/Standard_hour",
  "/wiki/Hyperspace",
  "/wiki/File:Cady4.ogg",
  "/wiki/Hair",
  "/wiki/Fire",
  "/wiki/File:Fanry6.ogg",
  "/wiki/File:Fanry7.ogg",
  "/wiki/Tailor",
  "/wiki/Clothing",
  "/wiki/Silk",
  "/wiki/Fleet",
  "/wiki/Moon",
  "/wiki/Shimmersilk",
  "/wiki/Varactyl",
  "/wiki/Energy_bow",
  "/wiki/Bracelet",
  "/wiki/Armorweave",
  "/wiki/File:FanryBtS.ogg",
  "/wiki/Master_%26_Apprentice",
  "/wiki/2019",
  "/wiki/Claudia_Gray",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Master_%26_Apprentice_(audiobook)",
  "/wiki/Category:Audio_files_of_Fanry",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/32_BBY",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/June_17",
  "/wiki/March_20",
  "/wiki/2022"
 ]
}