{
 "name": "Farious Gletch",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Farious Gletch was a Human male criminal who resided in a humble abode in the capital city of Bestine on the Outer Rim world of Tatooine during the time of the Galactic Civil War.\nSometime following 0 BBY, the Human male by the name of Farious Gletch resided in a humble abode in the capital city of Bestine on the Outer Rim world of Tatooine. During his time in Bestine, a Rodian thief by the name of Greenfinger attempted to skip town without paying his debt to Gletch.\nGletch considered this to be an unacceptable turn of events, and urged a spacer he had encountered with tracking down Greenfinger and killing him in the most violent and painful fashion. To further entice the spacer, Gletch granted permission to keep whatever Greenfinger's had on him as a tip. Gletch knew that this job required a \"strong stomach\" and \"nerves of durasteel,\" but the spacer was not the squeamish type, and agreed to assassinate the rogue Rodian. Greenfinger, who was not far outside of Bestine, was eventually located by the spacer and successfully killed after a brief firefight. Gletch, who had initially misjudged the spacer, was pleased by these turn of events and presented an award of 2,000 credits.\nHowever, Gletch's woes did not end with Greenfinger's insubordination. An Aqualish enforcer by the name of Gordul Koga grew tired of working for Gletch, and left to pursue business for himself. Gletch did not take kindly to Koga's independence, and instructed the spacer to remind Koga that without him, he had no future. The spacer, once again willing to serve as a new enforcer for the likes of Gletch, successfully tracked down Koga within the expansive desert surrounding Bestine, and defeated him and his two other cronies in a small battle. Gletch, taking a new liking to the spacer, awarded yet an additional 3,000 credits for eliminating the ruthless Aqualish.\nDuring his time on the desert world of Tatooine, Gletch purchased illegal glitterstim spice from a swooper working for Jabba the Hutt, a Human named Ripper. Glitterstim, a potent variety of spice mined on Kessel, gave its users a brief, yet pleasurable telepathic boost and heightened mental state. Gletch claimed to have paid a fair market price for the \"merchandise,\" but insisted that Ripper was attempting to twist his arm for more credits. To make this problem go away, he urged the spacer to kill this man as well. To put a positive spin on the job, Gletch pointed out that removing a known gangster responsible for many deaths could be considered a public service. The spacer once agreed to enforce Gletch's wishes, hunted down Ripper in the surrounding region, and killed him and his two fellow associates in Jabba Desilijic Tiure's criminal empire. However, before Ripper fell at the end of the spacer's weapon, he angrily shouted that Gletch had cheated him, and did not pay a single a single credit for the contraband. When the spacer returned to Gletch to report the news, he simply laughed at Ripper's fate, and dismissed any assertions he may have made about not paying for the glitterstim. While handing over a 4,0000 credit award, Gletch rhetorically asked the spacer if \"he really looked like the kind of guy who would cheat someone.\" Before the spacer could answer, however, Farious had second thoughts, and said not to answer that.\nAfter the assassination of Ripper, Gletch and his loyal associate went about their own business for a while. Yet this break was cut short when Gletch learned of some terrifying news. A Bith assassin who went by the name of Professor Whisper was setting out on a mission to eliminate the Imperial Prefect, Eugene Talmont. Talmont, who held considerable sway over the governing of Tatooine, at that time held office in the nearby Bestine Capitol building alongside the likes of Governor Tour Aryon and other influential officials. Gletch frantically informed the spacer that Whisper was under the false delusion that he had hired him to kill the Prefect. Gletch attributed this misunderstanding to a passing comment he made to someone in the street, that Bestine would be better off without the Prefect. Gletch insisted that the Bith's overly-acute hearing, inability to take a joke, and downright insanity were what led him to embark on this mission. Gletch was no fool, for even he knew that an attempt on the life of an important Imperial political figure would be met with swift and brutal punishment from the Galactic Empire. The spacer, understanding the major implications, immediately sought out to kill the allegedly insane \"Professor.\" Before Whisper could make his way to the Bestine Capitol, Gletch's loyal enforcer confronted the Bith, preparing for a fight. Before the deadly skirmish began, Whisper insisted that he was a professional, and that Gletch could have simply contacted him if he wanted the contract terminated. However, it was too late to turn back, for Professor Whisper declared that both Gletch and his newfound enforcer now had to die. Despite Gletch's insistence that Whisper was a deadly, insane assassin, the Bith was ultimately defeated at the hands of the spacer's superior combat ability. With Whisper dead, and the plot to kill Prefect Talmont foiled, the spacer returned to Gletch to deliver the good news. Gletch, greatly relieved, awarded the spacer with a record sum of 6,000 credits, and suggested that the two of them part ways for the time being. Gletch, he said, was in dire need of a vacation.\nGletch had fair skin, black braided hair, and brown colored eyes and eyebrows.\nDuring his time in Bestine, he wore a greyish-colored ribbed shirt beneath a simple green pullover vest. He also wore black uniform boots, the boot vamp more closely resembling the appearance of grey-colored sneakers. In addition to a pair of grey striped pants with a black stripe, Fletch wore a standard-issue stormtrooper utility belt.\nFarious Gletch was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Players who performed a series of quests for Gletch had to kill four different individuals, including Greenfinger, Gordul Koga, Ripper, and Professor Whisper. After completing these tasks, players would receive a net sum of 15,000 credits. Although the player could choose not to do Gletch's quests, this article assumes 100% game completion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Greenfinger",
  "/wiki/Canon",
  "/wiki/Spacer/Legends",
  "/wiki/Death/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Stomach/Legends",
  "/wiki/Durasteel/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Lightfight",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Aqualish/Legends",
  "/wiki/Gordul_Koga",
  "/wiki/Desert/Legends",
  "/wiki/Glitterstim/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Swooper/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Ripper_(Human)",
  "/wiki/Mining/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Telepathy/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Bith/Legends",
  "/wiki/Professor/Legends",
  "/wiki/Whisper_(Bith)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Prefect/Legends",
  "/wiki/Eugene_Talmont",
  "/wiki/Bestine_Capitol",
  "/wiki/Governor/Legends",
  "/wiki/Tour_Aryon",
  "/wiki/Ear/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Shirt",
  "/wiki/Clothing/Legends",
  "/wiki/Issued_officer_boots",
  "/wiki/Boot/Legends",
  "/wiki/Sneakers",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Belt/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided_Quick_Reference_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/Jedi_Search"
 ]
}