{
 "name": "Farl Cort",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Halanit"
     ]
    },
    {
     "name": "Died",
     "values": [
      "7 ABY",
      "Halanit"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Halanit"
     ]
    }
   ]
  }
 ],
 "content": "Farl Cort was a Human male who served as the leader of the colony on Halanit during the Galactic Civil War.\nWhen a virus began sweeping the remote colony, he put out a request for bacta, but to buy from Thyferra, now controlled by Ysanne Isard, would cost too much. Cort was relieved when Corran Horn and Ooryl Qrygg showed up, shepherding a tanker of bacta hijacked from one of Isard's convoys. The Rogues provided the bacta free of charge, leading Cort to thank them profusely and provide the two pilots with warm baths and fish dinners—mineral springs and fish being Halanit's two primary resources.\nWhen Rogue pilot Gavin Darklighter appeared at Halanit on the run from Isard's forces, Cort took him in and provided him with shelter as his fighter was refueled. During that time, however, Isard sent a Star Destroyer to punish Halanit for having accepted the stolen bacta earlier. Darklighter, convinced the Star Destroyer had followed him, gave Cort his blaster and took off, thinking he could lead the Imperial forces away if they were actually after him. Isard's forces destroyed the colony, however. Cort had no chance to survive.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Halanit",
  "/wiki/7_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Thyferra/Legends",
  "/wiki/Ysanne_Isard",
  "/wiki/Corran_Horn",
  "/wiki/Ooryl_Qrygg",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Gavin_Darklighter",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}