{
 "name": "Farng",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Empress Teta"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3997 BBY",
      "Empress Teta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Carbonite Miners' Union",
      "Empress Teta resistance"
     ]
    }
   ]
  }
 ],
 "content": "Farng was a Human male carbonite trader and the leader of the Carbonite Miners' Union active in the Empress Teta system in the years leading up to the Great Sith War. In 3997 BBY, a dark side–worshiping organization known as the Krath, led by royal heirs Satal and Aleema Keto, overthrew the Tetan Monarchy and took control of the system. Farng and a number of fellow carbonite traders refused to bow to the Krath's rule and started a resistance group; however, Farng was discovered and captured, and was sentenced to be killed during a Krath public execution ceremony. On the day that Farng was to be killed, Aleema Keto offered him a chance to change his mind and obey the Krath, but Farng refused, and the darksider prepared to execute him. Suddenly, an onlooker tossed Farng a knife, and Farng leaped at Keto while members of the resistance revealed themselves and started fighting Krath security. Knife in hand, Farng nearly reached the Krath leader, but Jedi Knight Ulic Qel-Droma, on a mission to infiltrate the Krath, emerged from the crowd and killed the carbonite trader with his lightsaber.\nA Human male native to the planet Empress Teta, Farng worked as a carbonite trader in the years prior to the Great Sith War. Farng also served as the leader of the Carbonite Miners' Union. During these times, the Carbonite Guild wielded a heavy amount of influence in the Empress Teta system, and the monarchs of the system, Lord Keto and his sister, Magda Keto, were forced to share their power with the organization. But, in 3997 BBY, a dark side–wielding group known as the Krath, led by royal heirs Satal and Aleema Keto, overthrew the Tetan Monarchy. Under Krath rule, all opposed were persecuted and usually killed in public execution ceremonies. However, not all the inhabitants of the system bowed to their will; a group of local carbonite traders, including Farng, decided to resist the Krath regime. Eventually, Farng was captured and sentenced to be killed in an upcoming Krath public execution. The Krath's preferred method of death was to have their prisoners stand on a Tetan repulsordisk situated high above a Carbonite drilling machine, followed by Aleema Keto frightening their captive with a dark side illusion, causing them to lose their balance and fall into the drilling machine. Farng was to be executed in this manner.\nWhen it was Farng's time to be executed, Aleema Keto offered him one last chance to obey the Krath and save himself, but Farng refused, saying that he would rather die than capitulate to the Krath's rule. With Farng's fate seemingly sealed, the sorceress prepared to kill him. At that moment, an onlooker threw Farng a knife, proclaiming that the Krath regime would die instead. Freeing himself from his shackles, Farng leapt toward Keto, while other members of the resistance revealed themselves and drew their weapons. Farng, knife in hand, nearly reached the Krath ruler. However, Jedi Knight Ulic Qel-Droma, on an undercover mission to infiltrate the Krath and learn their dark secrets, emerged from the crowd and killed the carbonite trader with his lightsaber. With Farng dead, the rest of the mob was subdued by Krath security forces.\nFarng was very opposed to the Krath regime and was bold enough to try and assassinate the leader of the organization, Aleema Keto. He was very committed to his beliefs, so much so that he refused to capitulate to the Krath's rule, even on consequence of death. Farng knew how to handle a knife in combat and was agile enough to be able to leap from his Tetan repulsordisk to Aleema Keto's perch several meters away.\nFarng first appeared in Star Wars: Tales of the Jedi - Dark Lords of the Sith, a story arc of the Star Wars: Tales of the Jedi comic book series, written by Kevin J. Anderson and Tom Veitch and released from late 1994 to early 1995. Farng made his first and only appearance in Dark Lords of the Sith in the arc's fourth issue, in which he was killed. He was also indirectly mentioned on the first page of the arc's fifth issue. In his appearance, Farng was illustrated by Chris Gossett. He additionally appeared in the Dark Lords of the Sith audio adaptation, but his name was not mentioned.\nIn Farng's entry in The Complete Star Wars Encyclopedia, he is stated to be bald, although in Dark Lords of the Sith, he clearly has blond hair. For the purposes of this article, Dark Lords of the Sith is treated to be correct.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Empress_Teta/Legends",
  "/wiki/3997_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Carbonite_Miners%27_Union",
  "/wiki/Empress_Teta_resistance",
  "/wiki/Carbonite/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Empress_Teta_system/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Krath/Legends",
  "/wiki/Satal_Keto/Legends",
  "/wiki/Aleema_Keto",
  "/wiki/Political_uprising_of_the_Empress_Teta_system",
  "/wiki/Tetan_Monarchy",
  "/wiki/Star_system/Legends",
  "/wiki/Death/Legends",
  "/wiki/Darksider",
  "/wiki/Knife/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Carbonite_Guild",
  "/wiki/King/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Keto",
  "/wiki/Magda_Keto",
  "/wiki/Prisoner/Legends",
  "/wiki/Tetan_repulsordisk",
  "/wiki/Carbonite_drilling_machine",
  "/wiki/Mind_trick/Legends#Force_illusion",
  "/wiki/Assassin/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_-_Dark_Lords_of_the_Sith",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(comic_series)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Tom_Veitch",
  "/wiki/1994",
  "/wiki/1995",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_4",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_5",
  "/wiki/Chris_Gossett",
  "/wiki/Tales_of_the_Jedi:_Dark_Lords_of_the_Sith_(audio)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Horse%27s_Mouth",
  "/wiki/Star_Wars_Insider_27",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded"
 ]
}