{
 "name": "Farns_Monsbee",
 "display_name": "Farns Monsbee",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Blue Squadron",
      "Blue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Farns Monsbee was a human male who flew as a pilot for the Rebel Alliance during the Galactic Civil War against the Galactic Empire. For a time he was the lone pilot stationed at a rebel base on Cassidode VI, before transferring to join Blue Squadron under General Antoc Merrick at the rebel headquarters on the moon Yavin 4. In 0 BBY, he participated in a mission to kill Imperial scientist Galen Erso on the planet Eadu. The squadron was later scrambled as part of the Alliance Fleet to aid rebel forces on the planet Scarif in stealing the plans to the Empire's Death Star superweapon. During the battle, Monsbee flew as Blue Five in a T-65B X-wing starfighter.\nMonsbee, along with the rest of Blue Squadron, was ordered to aid the rebels on the surface of Scarif, but only thirteen vessels from the squadron made it through the Imperial Shield Gate above the planet before the gate closed. The split squadron then fought against the Empire on both sides of the gate and suffered several casualties, but the plans were finally transmitted to the fleet, and the surviving Blue Squadron pilots retreated back to Yavin.\nFarns Monsbee was a human male who served the Rebel Alliance as a pilot during the Galactic Civil War against the Galactic Empire. For a period of his service, he was the sole snubfighter pilot stationed at an ill-equipped rebel outpost on Cassidode VI, where he logged a large number of flying hours in the base's sole starfighter, an X-wing. Monsbee was eventually transferred to Blue Squadron, an unusually large starfighter squadron within the Massassi Group of rebels operating out of the Great Temple on the moon Yavin 4. While on the moon, he often served as a recon flier.\nIn 0 BBY, Blue Squadron was under the command of General Antoc Merrick. After the Alliance lost contact with Intelligence officer Cassian Andor, who had been sent to kill the Imperial scientist Galen Erso on the planet Eadu, Blue Squadron was partially raised by General Davits Draven to complete the mission. Monsbee numbered among the pilots who participated in the mission and flew through the stone pillars of Eadu before opening fire on the landing platform of the secret Imperial laboratory where Erso was stationed.\nThe attack landed a successful blow that led to Erso's death, after which Blue Squadron briefly engaged enemy TIE/ln space superiority starfighters and turrets before retreating. Monsbee and the rest of the squadron then returned with Andor and his team to Yavin, where a meeting of the Alliance Civil Government convened to discuss a potential attack on the Imperial base on the planet Scarif to steal the plans for the Empire's Death Star superweapon. However, the council ultimately decided that there would be no attack.\nDespite the council's decision, the recently enlisted rebel Jyn Erso led a squad of Alliance operatives to Scarif to capture the Death Star plans by themselves. Soon thereafter, the entirety of Blue Squadron numbered among the forces that Alliance Admiral Raddus scrambled to aid the rebels on Scarif. Monsbee flew to the battle as Blue Five in a T-65B X-wing starfighter with an astromech droid bearing orange and silver plating.\nUpon the reinforcements' arrival in space above Scarif, Raddus ordered Blue Squadron to quickly head to the planet's surface through the Imperial Shield Gate—the only opening in the otherwise impenetrable planetary shield over Scarif—so that it could aid Erso's squad. As Merrick ordered his pilots to follow him in, Monsbee made an observation that they would not have long before the Imperials closed the gate, thereby sealing the planet.\nMonsbee proved to be correct, as only twelve of the squadron's X-wing starfighters and a single UT-60D U-wing starfighter/support craft made it through before the gate closed, with three Blue Squadron pilots dying as their X-wings impacted with the gate. At least four of Blue Squadron's X-wing pilots managed to pull up in time and retreat from the gate to aid the rest of the Alliance Fleet remaining in orbit.\nThose Blue Squadron pilots who did make it through the gate provided aerial support to the ground forces on Scarif, although ultimately all perished. Erso eventually succeeded in transmitting the Death Star plans to the fleet after the Shield Gate was destroyed, but she and the rest of the forces on Scarif's surface were killed when the Death Star arrived and fired on the Imperial base.\nA portion of Blue Squadron and the rebel fleet escaped and returned to Yavin, but between Eadu and Scarif, Blue and Red Squadrons had lost nineteen pilots and crew. So few pilots were left that the Alliance was unsure if it could even field Blue Squadron when the Death Star attacked Yavin not long after.\nFarns Monsbee worked well within a squadron, and he had far more flying hours logged than his colleagues thanks to his time on Cassidode VI. He was a keen historian and had a reputation for being chatty in the recreation room, a habit caused by his time in isolation on Cassidode VI. Monsbee had light skin, blue eyes, and blond hair.\nAs a pilot of the Rebellion, Farns Monsbee was equipped with a blue flight suit, a white flight harness, a gray Diagnostech life support unit, and a dark-green K-22995 light flight helmet. The latter was adorned with a modified version of the Wren Phoenix crest.\nFarns Monsbee was portrayed by Simon Farnaby in the 2016 Anthology film, Rogue One: A Star Wars Story. The character was not identified in the film but received the name \"Farns Monsbee\"—a tuckerization of Farnaby's name—in Star Wars: Rogue One: The Ultimate Visual Guide, a reference book written by Pablo Hidalgo and released alongside the film. An X-wing carrying an astromech droid with the same orange coloring as Monsbee's droid can be seen among the fighters defending the Alliance Fleet once the Shield Gate has shut, although it is unclear if this is the same droid and therefore Monsbee's ship or not.\nFarnaby initially turned down the role of Blue Five after being offered it over the phone by a producer, as he was in the middle of writing the film Paddington 2. However, after his writing partner, Paul King, told him to take the role despite their deadline, Farnaby accepted and filmed his X-wing cockpit scenes on a gimbal with a large screen around him. Farnaby is uncertain why he was chosen for the role but has stated that the makers of Rogue One were looking for characterful faces.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Blue_Squadron_(Rebel_Alliance)",
  "/wiki/File:Farns_Monsbee.ogg",
  "/wiki/Rebel_pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Time",
  "/wiki/Pilot",
  "/wiki/Cassidode_VI_rebel_outpost",
  "/wiki/Cassidode_VI",
  "/wiki/Blue_Squadron",
  "/wiki/General",
  "/wiki/Antoc_Merrick",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/0_BBY",
  "/wiki/Mission_to_Eadu",
  "/wiki/Death",
  "/wiki/Scientist",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Planet",
  "/wiki/Eadu",
  "/wiki/Squadron",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Battle_of_Scarif",
  "/wiki/Rogue_One",
  "/wiki/Scarif",
  "/wiki/Thief",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Blue_Five",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Starfighter",
  "/wiki/Shield_Gate",
  "/wiki/Starfighter_combat",
  "/wiki/Datatape",
  "/wiki/Fleet",
  "/wiki/File:SquadronUp.ogg",
  "/wiki/Snub-fighter",
  "/wiki/Standard_hour",
  "/wiki/X-wing_starfighter",
  "/wiki/Massassi_Group",
  "/wiki/Scout",
  "/wiki/Commanding_officer",
  "/wiki/Rebel_Alliance_Intelligence_Service",
  "/wiki/Intelligence_officer",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Davits_Draven",
  "/wiki/Operation_Fracture",
  "/wiki/Eadu_Energy_Conversion_Laboratory",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Turret",
  "/wiki/Alliance_Civil_Government",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/File:Merrick-On_Me.ogg",
  "/wiki/Jyn_Erso",
  "/wiki/Death_Star",
  "/wiki/Data-tape",
  "/wiki/Alliance_Military",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/Astromech_droid",
  "/wiki/Realspace",
  "/wiki/Planetary_shield",
  "/wiki/Squad",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Orbit",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Battle_of_Yavin",
  "/wiki/Historian",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Flight_suit",
  "/wiki/Flight_harness",
  "/wiki/Diagnostech_life_support_unit",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Flight_helmet",
  "/wiki/Starbird_(symbol)",
  "/wiki/Simon_Farnaby",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Tuckerization",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Cockpit",
  "/wiki/Category:Images_of_Farns_Monsbee",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_75",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Birth_of_the_Rebellion",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Duty_Roster",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/November_7",
  "/wiki/2017",
  "/wiki/September_13",
  "/wiki/2020"
 ]
}