{
 "name": "Faron Tolis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Kinooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rebel Alliance",
      "Alliance of Free Planets"
     ]
    }
   ]
  }
 ],
 "content": "Faron Tolis was a Human member of the Rebel Alliance, and later the Alliance of Free Planets, following the Battle of Endor.\nFaron Tolis was one of a twenty-member Alliance scouting party during the earliest stages of the Nagai–Tof War. His group reported directly to Luke Skywalker, and was sent to Kinooine, a barren world that had inexplicably begun to show signs of life. Unknown to the Alliance, Kinooine was serving as a staging point for the arriving Nagai fleet. The Dark Lady Lumiya along with a small complement of Nagai soldiers were manning a small outpost when the scouting party arrived. Everyone but Faron was slaughtered by Lumiya and the Nagai, leaving him as their only prisoner. Lumiya and her personal aide Den Siva brutally tortured Faron as to the whereabouts of Leia Organa, but he was unable to come up with any of the information they needed.\nAfter the torture session, Faron was given a choice: to either face more torture and death, or to serve Lumiya and the Nagai. Faron chose the latter, following \"Master Den\" around the base. When an Alliance search party composed of Skywalker, Dani, and Kiro arrived on Kinooine to search for their missing comrades, Faron stayed at the outpost while Lumiya left to capture the new arrivals. Lumiya attacked Dani and Kiro with her lightwhip, but Kiro was able to escape to warn Luke of the Dark Lady's presence. Dani, on the other hand, was brought back to the base as another captive. Faron was distraught over his former ally's condition, but he was too frightened to try and help.\nSiva ordered that Faron bring Dani to a torture chamber so he could test the Zeltron's resiliency. Faron knew what was in store, but fearing for his own life, he obeyed. At the torture chamber, Faron looked on as Siva's analysis grid tortured Dani unmercifully. With his friend writhing in anguish, Faron was filled with guilt. Sliding a knife out of Siva's belt, Faron prepared to kill the Nagai lieutenant and redeem himself for his cowardice and betrayal. However, Siva was anticipating the attack, and with lightning fast reflexes, threw a knife through Faron's chest, killing him instantly.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Kinooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Nagai%E2%80%93Tof_War",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Nagai",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Lumiya",
  "/wiki/Den_Siva",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Dani",
  "/wiki/Kiro",
  "/wiki/Lightwhip/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Zeltron/Legends",
  "/wiki/Analysis_grid",
  "/wiki/Star_Wars_(1977)_95",
  "/wiki/Star_Wars_(1977)_96",
  "/wiki/Star_Wars_(1977)_97",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/The_Forgotten_War:_The_Nagai_and_the_Tofs",
  "/wiki/StarWars.com"
 ]
}