{
 "name": "Farzala Tarabal",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zygerrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue-gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Obratuk Glii"
     ]
    }
   ]
  }
 ],
 "content": "Farzala Tarabal was a Zygerrian male Jedi Knight of the Jedi Order during the High Republic Era. Stationed aboard the academic cruiser Star Hopper under the training of Jedi Masters Obratuk Glii, Yoda, and Torban Buck, Tarabal was a friend of fellow Padawans Qort and Lula Talisola, the latter of whom often looked out for them when they caused mischief.\nTarabal was aboard the Star Hopper when the cruiser raced to rescue the Trymant system from fallout of the Great Hyperspace Disaster and a subsequent attack from Nihil marauders. The Jedi managed to drive back the Nihil until the arrival of Galactic Republic could arrive, rescuing the Force-sensitive resident Zeen Mrala and returning to the Starlight Beacon space station.\nTarabal and his fellow Padawans followed a runaway Mrala to the Bright Jewel system, where they fought the Nihil once more and defended the Junk Malens from the raiders. After this, Tarabal and Qort joined the Vessel crew on a diplomatic mission to Bilbousa, the capital of Nal Hutta. There, he was captured due to a sabotage on the Vessel, but subsequently escaped and recruited Ishnar Ti-Kharatal to join him. In his master Obratuk Glii's place, Tarabal served as the primary diplomat on the mission.\nAfter reuniting with his friends on Starlight Beacon, the Star Hopper departed for the temple on Takodana to aid Sav Malagán in her defense against the Nihil. During preparations, Nihil double agents planted thermal detonators and blew up the temple. A newly maskless Qort took care of the Nihil, and Farzala and his friends welcomed their changed friend with a hug.\nDuring the time of the High Republic, Farzala Tarabal was inducted into the Jedi Order. He became friends with Lula Talisola and Qort at an early age, and as younglings the three would eagerly watch holodramas of famed Jedi Master Tal Bota, eagerly imagining their future as Jedi. At one point, as a young Padawan, Jedi Master Obratuk Glii taught Tarabal about how fear is not the enemy, and is simply a learning experience for the future. Glii reflects on how his extreme age has lead him to see many of his former Padawans die, but he still sees the bigger picture and serves the Force.\nTarabal was one of many Padawans stationed aboard the academic cruiser Star Hopper, traveling the galaxy to learn the ways of the Jedi while receiving training under Jedi Masters Yoda and Torban Buck.\nTarabal was a close friend of Lula Talisola and Qort, fellow Padawans aboard the Star Hopper. Together, Tarabal and Qort often caused mischief, leading Talisola to look out for them.\nIn around 232 BBY, after the Trymant system came under threat from an Emergence of the Great Hyperspace Disaster, the Star Hopper was the only Jedi vessel nearby and thus rushed to provide assistance. Tarabal questioned their decision, suggesting to wait for further backup, but Yoda was determined to continue, believing that the Padawans were the only hope of rescue for the Trymant system. En route to the Trymant system, Yoda had the Padawans search for information on the incident. Tarabal and Qort determined its nature as fallout from the Great Disaster, while Talisola and Bibs informed the other Padawans that the debris threatened the densely populated Bralanak City on the planet Trymant IV.\nAs the cruiser prepared to exit hyperspace, Yoda and Buck instructed the Padawans to work on the ground to rescue the citizens and deal with smaller chunks of debris while the two Masters handled the larger pieces. The Padawans boarded their rescue speeders, with Tarabal climbing onto a speeder piloted by Talisola. The Star Hopper arrived in the Trymant system, and the speeders descended toward Trymant IV. Directing the other speeders to stay in a tight formation, Tarabal warned them of a nearby chunk of debris that narrowly missed his and Talisola's speeder, expressing relief at the near miss.\nAfter landing on the planet to assist its citizens, Tarabal noticed a piece of debris that threatened to hit a number of people on a nearby roof. He and Talisola boarded their speeder, followed by Bibs and Qort on a hover platform with which to rescue the trapped residents. Though Tarabal was unsure if they would make it in time, he managed to shoot down the debris, breaking it apart before it made impact. Talisola questioned how they would rescue the people of the city, and Tarabal suggested using a nearby Spider Cruiser, which had brought Nihil marauders to attack Trymant IV in the wake of the Emergence.\nThe Jedi confronted the Nihil, demanding to use the cruiser to evacuate the citizens, but the marauders refused, firing upon the Padawans. After deflecting the blaster bolts alongside the other Jedi, Tarabal declared their intent to take the cruiser by force, racing forward beside Talisola and Qort. Another large piece of debris fell toward them, but it was held back by the Force-sensitive resident Zeen Mrala, to the surprise of Tarabal and the other Padawans. Though Talisola helped Mrala to hold back the debris, the Jedi had become surrounded by the Nihil marauders, with Eye of the Nihil Marchion Ro ordering their deaths.\nTarabal asked Talisola what they should do, and his friend was resolved to fight. Before the Nihil could open fire, however, Masters Yoda and Buck arrived to rescue the Padawans, the latter of the two surprising Tarabal by announcing his entrance with his nickname, \"Buckets of Blood.\" The Jedi charged into battle with the Nihil, with Tarabal facing several of the marauders himself. Noticing one Nihil about to launch a large projectile, Tarabal warned his fellow Jedi, allowing Yoda to slice the projectile into pieces in midair.\nThe Jedi continued to fight through the crowd of Nihil, during which Tarabal asked Talisola about her situation, to which she noted Mrala's proficiency in utilizing the Force. Tarabal subsequently noticed Buck, surrounded by a number of raiders and expressing his dislike for fighting, and suggested that he needed assistance. The Padawans charged to Buck's rescue; however, they were interrupted by the arrival of a Republic rescue fleet above the planet, which prompted the Nihil to flee. As Republic vessels began to land on Trymant IV, Buck thanked the Padawans for the assistance, and Tarabal and Talisola questioned him about his nickname. The two Padawans exchanged confused glances upon Buck's explanation that he was a healer.\nThe Nihil cruiser took off, escaping the blockade above Trymant IV. Yoda returned, having infiltrated the vessel to find Mrala's friend, Krix Kamerat—who did not wish to be saved due to his dislike for the Jedi—and the Master declared that the Jedi and Mrala must return to the Starlight Beacon. The Jedi boarded the Star Hopper and departed from Trymant. Mrala was upset by the loss of her home and being separated from her friend, Krix Kamerat—who had been taken in by the Nihil as they departed—but Talisola comforted her, with Tarabal and Qort backing up her sympathies. As the Star Hopper arrived at the Starlight Beacon, Tarabal and the other Jedi watched their approach through a viewport.\nIn the time following the Star Hopper's return to the Starlight Beacon, Tarabal and the other Jedi were welcoming and inclusive to Mrala, allowing her to feel at home aboard the station. One week after the Trymant incident, several of Starlight's Jedi Masters convened to discuss Mrala's future; Estala Maru noted that she was too old to be trained, while Avar Kriss was unsure if Trymant IV was in a state for her to be sent back, prompting Kantam Sy to pose that Mrala could remain on Starlight for a time as she had become close with the Padawans. When Talisola interrupted, suggesting that the Masters should seek Mrala's own opinion on the matter, Tarabal added that the next most important opinion was that of Mrala's new Jedi friends.\nAs the other Jedi watched, the Padawans began to re-enact the events of the attack on Trymant, providing an account of Mrala and Talisola holding back the debris complete with Tarabal's excited narration. The display convinced the Masters that the Padawans wished for their friend to stay; with Mrala having helped to save lives on Trymant and knowing two individuals who were within the Nihil, Kamerat included, she would prove to be helpful. The Jedi had been unable to find the Nihil after their escape from Trymant; however, Yoda had provided Krix with a holoprojector while aboard the Nihil cruiser so that the boy could contact Mrala when he was ready, and the Jedi Master noted that the device could be of use in tracking the marauders down.\nThe Jedi Masters resolved to investigate the Nihil's actions further, with Kriss suspecting that the group they encountered had been on a high-level mission. Tarabal suggested sneaking up on the Nihil and blasting them with laser cannons, which Bibs and Qort proceeded to act out. As the transponder within the holoprojector only had a short range, the Jedi devised a plan to search the Bright Jewel system, which had seen increased reports of Nihil attacks, in the hope that they could pick up the signal. However, the transponder's location could only be received through a message being sent, and thus required Mrala's collaboration in manipulating Kamerat. As Tarabal and the other Jedi watched, Yoda and Talisola asked Mrala whether she would agree to help them, but she was unable to decide.\nThe signal from the holoprojector led to Quantxi, a junk moon orbiting Ord Mantell. Tarabal and his friends spotted Nihil raiders massacring native Junk Mavens and leapt to the rescue. While Talisola continued to search for Mrala, Qort and Tarabal fought for the Junk Mavens. The Junk Mavens summoned a savrip to defend them, and soon enough, Masters Buck, Sy, and Yoda came to the rescue. Afterwards, Tarabal reunited with Talisola and Mrala at the Republic Outpost on Ord Mantell.\nOn a diplomatic envoy to Bilbousa, the capital of Nal Hutta, Tarabal accompanied his master master, Obratuk Glii, the crew of the Vessel, and Qort. The Hutts had requested the Jedi envoy because of their alliance against the Drengir. Because of Obratuk, the diplomat of the crew's hibernation, Tarabal was sent to meet the Hutts in his place, leaving Qort on the Vessel. Tarabal began discussions with Skarabda the Hutt, but the mission went awry as the guns of the hijacked Vessel fired on the Hutts. Tarabal and Leox Gyasi ran through the Hutt's fortress, but were soon stopped by Hutt enforcers, with whom they fought the Drengir. The human and Zygerrian were soon after captured and imprisoned by the Hutts. In a hanging cage, Tarabal used the Force to rock back and forth and free himself and Gyasi. The two met up with Ishnar Ti-Kharatal, who worked for the Hutts, and went to talk to Jabba. A hologram call from Master Glii reassured Tarabal's ability to act as the diplomat of the Order, as the discussions commenced with Tarabal leading.\nBack on Starlight Beacon, Farzala reunited with Lula Talisola and Zeen Mrala, who were present for the Nihil attack on Valo, introducing them to his new friend Ishnar Ti-Kharatal, and meeting fellow Padawan Ram Jomaram. The group made their way to the Beacon's meditation chambers to meet with Master Buck and Master Sy, as the two masters wanted to give the Padawans a chance to ask questions about the confusing goings-on of the Galaxy and Jedi Order in the recent months. After being bombarded with questions about Loden Greatstorm and the Nihil, the masters tell the Padawans about a specific Nihil cell that has been wreaking havoc on a specific part of the Galaxy. They soon depart for the Jedi Temple on Takodana, to aid Sav Malagán against the Nihil.\nThe Star Hopper arrived on Takodana, Qort's former home, and the Jedi were met by Malagán and Maz Kanata, who greeted Qort with a hug. Tarabal was surprised that Kanata knew his Aloxian friend. The preparations for defense began, and the Padawans were introduced to Bareen and Sabata Krill, sisters who supposedly defected from the Nihil and wanted to help. The Padawans aided Malagán in setting up defensive weaponry when Malagán spotted Sabata sneaking around, simultaneously receiving information that the Nihil were back. A moment later, Sabata ignited many hidden thermal detonators around the temple, causing a very large explosion. The temple was largely destroyed, but the Padawans and Jedi survived. Qort's skull mask was also destroyed in the explosion, and he took to the skies, jumping from fighter to fighter, taking out the Nihil's ships. After he had dealt with the immediate therat, Qort landed back on the ground and Farzala and the others greeted him with a hug.\nBack on Starlight Beacon, Masters Kantam Sy and Torban Buck brought back the Great Jedi Rumble Race from their childhood for the Padawans to have some fun during this difficult time. This race was a run around the beacon, and according to the masters, it had no rules at all, except to not blow anything up. Farzala participated in the Rumble Race with his friends. As the group was approaching the finish line, Master Buck pushed them backwards, and won the race for himself.\nA Zygerrian male, Farzala Tarabal had black hair, blue eyes and a blue-gray shade of skin. He frequently caused mischief alongside fellow Padawans Qort and Talisola. Tarabal was also energetic; in the aftermath of the Trymant incident, he excitedly narrated a re-enactment of the events and was eager to defeat the Nihil with laser cannons.\nTarabal showed caution when the Star Hopper was redirected to Trymant, believing that they should wait to receive backup as they were the only Jedi starship within range, but took charge on the approach to Trymant IV, directing the other Padawans in their rescue speeders. After the Nihil marauders on Trymant IV refused to allow the Jedi to use their cruiser for evacuation, Tarabal declared their intention to take it regardless. When Talisola comforted Mrala in the aftermath of the Trymant attack, Tarabal came to her support, affirming Talisola's reassurance that the Jedi would have her back. He and the other Padawans welcomed Mrala as a friend during her time on Starlight, and Tarabal once again supported Mrala when the Jedi Masters debated the girl's fate, reminding them that the other Padawans wished for her to stay.\nOn the missions to the both Bright Jewel and Bilbousa, Tarabal showed his leadership and interpersonal skills. He selflessly helped the Junk Mavens on Bright Jewel, he maintained a cool head while being captured on Bilbousa, and was able to escape, saving Leox and being kind to Ishnar, gaining a new ally before coming before the Hutts. Before the Hutts, Tarabal demonstrated hiss diplomacy skills in the place of the intended diplomat, Obratuk Glii. Tarabal gains confidence in himself and comes into his own, speaking to Jabba the Hutt on behalf of the Jedi. He once again showed his kind and caring nature when reunited with Lula Talisola and Zeen Mrala. After a short battle on Takodana, Farzala comforted his friend Qort whose mask had been cracked, and true nature revealed.\nAs a Padawan of the Jedi Order, Tarabal possessed sensitivity to the Force. He was proficient in the use of his lightsaber, deflecting shots fired by the Nihil on Trymant IV and using the Force to push back the Nihil. While providing aid at Trymant, Tarabal managed to fire upon debris from his rescue speeder, leading Talisola to compliment his shooting. He was also a talented diplomat, relying on the teachings of his master, Obratuk Glii. He used this ability to discuss the alliance with the Hutts.\nTarabal wore brown robes with light-colored sleeves over darker pants and boots, as well as brown gauntlets and a cape with gold patterning on the edge. While in action on Trymant IV, he instead wore a brown cloak over his robes and a green belt. Tarabal carried a green-bladed lightsaber that had a gray hilt. When the Padawans of the Star Hopper went to assist the citizens of Trymant IV, Tarabal flew in a rescue speeder piloted by Talisola.\nFarzala Tarabal was created for the Star Wars: The High Republic publishing initiative, featuring in the comic series Star Wars: The High Republic Adventures, written by Daniel José Older, illustrated by Harvey Tolibao, and published by IDW Publishing. The character was first depicted on the initial cover reveal for the issue when the project was announced on February 24, 2020, and was subsequently introduced in the series' first issue on February 3, 2021. His surname was later identified in The High Republic Adventures  2, published on March 3, 2021. Older described Farzala as a mix between a mischievous older brother and a typical cat.\nTarabal's first name was misspelled as \"Farzal\" on numerous occasions, beginning with the summaries released by IDW for the series' first and second issues. The error was also picked up in a blurb on the third issue within the \"Launchpad\" section of Star Wars Insider.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/The_High_Republic_Adventures_(2021)_7",
  "/wiki/The_High_Republic_Adventures:_Galactic_Bake-Off_Spectacular",
  "/wiki/The_High_Republic_Adventures_(2021)_11",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic_Adventures_(2021)_12",
  "/wiki/The_High_Republic_Adventures_(2021)_13",
  "/wiki/Zygerrian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Obratuk_Glii",
  "/wiki/Jedi_Knight",
  "/wiki/High_Republic_Era",
  "/wiki/Cruiser",
  "/wiki/Star_Hopper",
  "/wiki/Jedi_training",
  "/wiki/Jedi_Master",
  "/wiki/Yoda",
  "/wiki/Torban_Buck",
  "/wiki/Qort",
  "/wiki/Lula_Talisola",
  "/wiki/Trymant_system",
  "/wiki/Trymant_IV_disaster",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Attack_on_Trymant_IV",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Galactic_Republic",
  "/wiki/Force-sensitive",
  "/wiki/Zeen_Mrala",
  "/wiki/Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/Bright_Jewel_system",
  "/wiki/Vessel",
  "/wiki/Bilbousa",
  "/wiki/Nal_Hutta",
  "/wiki/Ishnar_Ti-Kharatal",
  "/wiki/Jedi_Temple_(Takodana)",
  "/wiki/Takodana",
  "/wiki/Sav_Malag%C3%A1n",
  "/wiki/Thermal_detonator",
  "/wiki/Era",
  "/wiki/Youngling",
  "/wiki/Holodrama",
  "/wiki/Tal_Bota",
  "/wiki/Padawan",
  "/wiki/The_galaxy",
  "/wiki/Jedi",
  "/wiki/232_BBY",
  "/wiki/Starship",
  "/wiki/Star_system",
  "/wiki/Bibs",
  "/wiki/Bralanak_City",
  "/wiki/Planet",
  "/wiki/Trymant_IV",
  "/wiki/Hyperspace",
  "/wiki/Rescue_speeder",
  "/wiki/Speeder",
  "/wiki/Hover_platform",
  "/wiki/City",
  "/wiki/Spider_Cruiser",
  "/wiki/Emergences",
  "/wiki/Blaster",
  "/wiki/Telekinesis",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Marchion_Ro",
  "/wiki/Death",
  "/wiki/The_Force",
  "/wiki/Republic_rescue_fleet",
  "/wiki/Jedi_healer",
  "/wiki/Blockade",
  "/wiki/Krix_Kamerat",
  "/wiki/Anti-Jedi_sentiment",
  "/wiki/Viewport",
  "/wiki/Standard_week",
  "/wiki/Estala_Maru",
  "/wiki/Avar_Kriss",
  "/wiki/Kantam_Sy",
  "/wiki/Holoprojector",
  "/wiki/Laser_cannon",
  "/wiki/Transponder_beacon",
  "/wiki/Quantxi",
  "/wiki/Ord_Mantell",
  "/wiki/Junk_Mavens",
  "/wiki/Savrip",
  "/wiki/Republic_Outpost",
  "/wiki/Hutt",
  "/wiki/Drengir",
  "/wiki/Diplomat",
  "/wiki/Sleep",
  "/wiki/Skarabda",
  "/wiki/Leox_Gyasi",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Attack_on_Valo",
  "/wiki/Valo",
  "/wiki/Ram_Jomaram",
  "/wiki/Meditation_chamber",
  "/wiki/Loden_Greatstorm",
  "/wiki/Aloxian",
  "/wiki/Bareen_Krill",
  "/wiki/Sabata_Krill",
  "/wiki/Great_Jedi_Rumble_Race",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Force_push",
  "/wiki/Robe",
  "/wiki/Boot",
  "/wiki/Gauntlet",
  "/wiki/Cape",
  "/wiki/Cloak",
  "/wiki/Belt",
  "/wiki/Green",
  "/wiki/Lightsaber",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_High_Republic_Adventures_(IDW_Publishing_2021)",
  "/wiki/Daniel_Jos%C3%A9_Older",
  "/wiki/Harvey_Tolibao",
  "/wiki/IDW_Publishing",
  "/wiki/February_24",
  "/wiki/2020",
  "/wiki/The_High_Republic_Adventures_(2021)_1",
  "/wiki/February_3",
  "/wiki/2021",
  "/wiki/The_High_Republic_Adventures_(2021)_2",
  "/wiki/March_3",
  "/wiki/The_High_Republic_Adventures_(2021)_3",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider",
  "/wiki/Category:Images_of_Farzala_Tarabal",
  "/wiki/The_High_Republic_Adventures_(2021)_4",
  "/wiki/The_High_Republic_Adventures_(2021)_5",
  "/wiki/The_High_Republic_Adventures_(2021)_6",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_8",
  "/wiki/The_High_Republic_Adventures_(2021)_9",
  "/wiki/The_High_Republic_Adventures_(2021)_10",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Knights_at_the_Roundtable",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars_Inside_Intel:_Jedi_of_the_High_Republic",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Accessories_and_Structures",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/The_High_Republic:_Light_of_the_Jedi"
 ]
}