{
 "name": "Faskus_Olvidan",
 "display_name": "Faskus Olvidan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Almania"
     ]
    },
    {
     "name": "Died",
     "values": [
      "40 ABY",
      "Ziost"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Faskus Olvidan or Faskus of Ziost was a male Human from Almania who became part of the plot of Lumiya. He worked as a courier in the Tendrando Arms building on Drewwa.\nFaskus was given the Amulet of Kalara by Byalfin Dyur, under the orders of Lumiya to take to Ziost and place it in a cave. He was told to go alone, an order he refused, and brought along his daughter Kiara on his ship, the Blacktooth. While taking the amulet to the cave, Faskus heard a TIE Fighter fly over head and realized someone was going to destroy his ship with his daughter onboard. He ran back to the ship to save her, which led to him receiving a piece of shrapnel in his abdomen. When Ben Skywalker came searching for the amulet, Faskus was busy making a fire. Ben tackled him to the ground and knocked him unconscious. Ben tied him up and went about taking their gear when he realized Faskus was hurt. Dying, Faskus asked Ben who he was and gave Kiara to Ben to protect. After he died, Ben left Kiara, who tried to bury her father. Ben reconsidered leaving her after receiving a birthday message from his parents. When Ben returned, they covered him with rocks so he wouldn't be eaten by the native creatures of Ziost.\nThe name \"Faskus of Ziost\" appeared on the forged note left in the display case from which the Amulet of Kalara was stolen. Although Ben Skywalker referred to him as Faskus in his thoughts, he was unsure if that was even his real name. However, the Bothan Dyur referred to him by this name in a verbal communication to Lumiya, so this was likely his real name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Faskus_Olvidan",
  "/wiki/Almania/Legends",
  "/wiki/40_ABY",
  "/wiki/Ziost/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lumiya",
  "/wiki/Tendrando_Arms",
  "/wiki/Drewwa",
  "/wiki/Amulet_of_Kalara",
  "/wiki/Byalfin_Dyur",
  "/wiki/Kiara_Olvidan",
  "/wiki/Blacktooth",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Ben_Skywalker",
  "/wiki/Mission_for_the_Amulet_of_Kalara",
  "/wiki/Birthday/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Legacy_of_the_Force:_Exile",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}