{
 "name": "Feinu Zerk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rori"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Feinu Zerk was a Human female townsperson from Naboo's moon of Rori who lived during the time of the Galactic Civil War. She was the younger sister of Palu Zerk, both of whom ended up working for Jabba Desilijic Tiure's criminal empire on Tatooine sometime following the Battle of Yavin in 0 BBY. Working as a delivery courier for Jabba the Hutt's elite guard, Feinu at one point found herself ambushed by thugs of the rival Valarian Syndicate who attempted to kidnap her and hold her for ransom. Before they could follow through with their plan, she was rescued by a spacer dispatched by her sister in nearby town of Wayfar. As the spacer safely escorted Feinu back to Palu's shop in Wayfar, Feinu vowed to one day enact revenge against the Valarian swoopers.\nAs the younger sister of Palu Zerk, Feinu Zerk was a Human female townsperson from Naboo's moon of Rori. During the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic, both Feinu and her sister ended up in the small town of Wayfar on the Outer Rim desert world of Tatooine. By the time following the Battle of Yavin in 0 BBY, the two sisters formed a business agreement with the criminal enterprise led by the Hutt crime lord Jabba Desilijic Tiure. Working from her shop in Wayfar, Palu tailored specially designed disease-resistant clothing and other high-quality garbs exclusively for Jabba's elite forces. Feinu would then deliver this newly created equipment to Jabba's elite guard on the short, yet dangerous road from Wayfar to Jabba's Palace. Feinu traveled the road alone, despite her older sister's objections. Their arrangement drew attention and ire from Jabba's rival, Lady Valarian. During one of her treks back from the palace, Feinu ended up running late. When Palu learned from the palace scouts that she had left to come back several hours ago, she began to fear the worst, and rightly assumed that the Valarian Syndicate may be involved in her disappearance.\nFortunately for Palu, a spacer who visited her shop agreed to search the edge of town to locate her sister. As it turned out, Feinu was indeed ambushed by a group of three Valarian thugs directed by a Valarian swooper leader. The Valarian thugs warned Feinu that if she moved, they would disintegrate her on the spot. She screamed for help as the gang attempted to kidnap her and hold her for ransom. Before they could follow through with their plan, however, the spacer dispatched by Palu spotted the troubled young lady, and killed the four thugs who were attacking her. Feinu thanked her rescuer, and as the spacer escorted her back to Palu's shop in Wayfar, she vowed to one day enact revenge against the Valarian swoopers. Once Feinu was safely back in town, her older sister expressed her sincerest gratitude. In thanks, she provided the spacer some credits and a Treated Protective Coverall, a special suit which was resistant to disease. The spacer required such a suit in order to acquire corrosive bile from the sarlacc at the Great Pit of Carkoon. The spacer required the bile as a constructive component for the Zicx-bug bomb. However, gifting the spacer such a suit was an especially risky prospect for Palu. Because of her exclusive agreement with Jabba's elite guard, Palu knew that if Jabba found out that she gave the suit away, the Hutt crime lord would have the two of them killed. For this reason, she urged the spacer to leave her be, despite being grateful to individual for saving her younger sister.\nFeinu Zerk had fair skin, blonde hair, brown eyebrows, and brown colored eyes. When Valarian gang members threatened Feinu and attempted to kidnap her, Feinu was fearful and begged for help. However, she also thought of others, and worried about any passers by who might get caught in the crossfire. Feinu was greatly thankful to the spacer who had rescued her. After the attempt on her person, Feinu expressed something of a vengeful demeanor. She told her rescuer that she and her sister would one day enact revenge against the Valarian swoopers.\nDuring her journey from Jabba's Palace to Wayfar, Feinu wore a flex-form shirt colored in two shades of gray. She also wore a similarly colored pleated skirt and gray dress slippers. During her treks to and from Jabba's Palace, Feinu would deliver specially tailored disease-resistant clothing and other high-quality garbs for Jabba's elite forces. However, Feinu elected to go unarmed during these dangerous delivery trips.\nFeinu Zerk was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. She was included as part of the Zicx-bug bomb quest, added to the game on August 12, 2003. During one part of the quest, players were required to locate Feinu, save her from four Valarian thugs, and escort her safely back to Palu in the town of Wayfar. Completing this task would earn the player 100 credits and a Treated Protective Coverall. The coverall could then be used for the next portion of the quest, allowing players to acquire bile from the nearby sarlacc without suffering ill-effects. Feinu's surname of Zerk never appeared in the game. However, the Star Wars Galaxies: Jump to Lightspeed: Prima Official Game Guide  lists her full name as Feinu Zerk. The reference guide also lists her as a townsperson found on Rori. This attribute never appeared in the game, as Feinu only appeared as part a quest issued on Tatooine. Although the player could choose not to do the tasks associated with the Zicx-bug bomb quest, this article assumes 100% game completion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rori/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Naboo/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Palu_Zerk",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Tatooine/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Courier/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Valarian_Syndicate",
  "/wiki/Ransom/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/City/Legends",
  "/wiki/Wayfar",
  "/wiki/Standard_day/Legends",
  "/wiki/Valarian/Legends",
  "/wiki/Swooper/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Disease/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Lord/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Canon",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sarlacc/Legends",
  "/wiki/Great_Pit_of_Carkoon/Legends",
  "/wiki/Zicx-bug_bomb",
  "/wiki/Eye/Legends",
  "/wiki/Shirt",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_12",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed:_Prima_Official_Game_Guide",
  "/wiki/2004",
  "/wiki/The_New_Essential_Chronology"
 ]
}