{
 "name": "Fekk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Hutt Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Fekk was a Sullustan pirate who served under Captain Jet Nebula aboard the starship Auriga Fire. The ship originally worked for the Republic, but eventually the crew became more inclined to answer the Hutt Cartel. During the Cold War, when the Auriga Fire intercepted the starship Cinzia, Fekk was among the crew members who joined the Rodian Shinqo in mutiny in hopes of taking the Cinzia for themselves. Holding Nebula at blasterpoint, Shinqo ordered Fekk and fellow Sullustan Gelss to prepare for action, but the Cinzia suddenly exploded. In the confusion, Nebula's droid grabbed Shinqo's blaster and pointed it at the Rodian, who yielded. With the ship back under Nebula's control, the crew found a navicomp and a nest that produced hex droids—an apprehensive type of droid created by Lema Xandret—amidst the Cinzia's wreckage.\nFekk, a Sullustan pirate, served under Captain Jet Nebula on the starship Auriga Fire, working as a privateer for the Galactic Republic. At some point during the Cold War, however, the Auriga Fire's true employer became the Hutt Cartel—although the ship still answered to the Republic, the crew was more concerned with pleasing the Hutts. Several years after the Treaty of Coruscant, Fekk became associated with Nebula's Rodian first mate, Shinqo. Fekk supported Shinqo when the Rodian planned a mutiny against Nebula, and the Sullustan took part in the betrayal when the Auriga Fire intercepted the starship Cinzia, which the mutineers intended to take for themselves.\nShinqo held Nebula at blasterpoint, forcing him to contact the Cinzia and relay to the interdicted ship's crew that their vessel was to be boarded. The Rodian then called for Fekk and Gelss, another Sullustan who supported the Rodian's mutiny, to ready themselves for action; however, the Cinzia suddenly self-destructed. In the ensuing confusion, Nebula's J8O soldier droid, Clunker, grabbed Shinqo and took his blaster. The droid turned the weapon on the mutineer, who accepted his place back under Nebula's command, ending the mutiny. At Nebula's orders, the crew of the Auriga Fire scavenged the wreckage of the Cinzia, finding a battered navigation computer and a strange object that was eventually discovered to be a nest that produced hex droids—a deadly type of droid engineered by Lema Xandret to protect her daughter, Cinzia, after whom the ship had been named.\nFekk was a privateer and pirate who betrayed Captain Jet Nebula by joining Shinqo and several other crew members of the Auriga Fire in mutiny. Fekk, Shinqo, and the rest of the mutineers executed their betrayal while intercepting the Cinzia, hoping to gain the starship for themselves.\nFekk was first mentioned briefly in The Old Republic: Fatal Alliance , a novel by Sean Williams that served as a tie-in to the Star Wars: The Old Republic MMORPG. In the novel, Fekk's gender is not specified.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sullustan/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Pirate/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Jet_Nebula",
  "/wiki/Starship/Legends",
  "/wiki/Auriga_Fire",
  "/wiki/Privateer/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Cinzia",
  "/wiki/Rodian/Legends",
  "/wiki/Shinqo",
  "/wiki/Blaster/Legends",
  "/wiki/Gelss",
  "/wiki/Self-destruct_mechanism/Legends",
  "/wiki/Clunker",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Fastbreeder",
  "/wiki/Droid/Legends",
  "/wiki/Lema_Xandret",
  "/wiki/Hutt/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/First_Mate/Legends",
  "/wiki/J8O_soldier_droid",
  "/wiki/Engineer/Legends",
  "/wiki/Cinzia_Xandret",
  "/wiki/The_Old_Republic:_Fatal_Alliance",
  "/wiki/2010",
  "/wiki/Sean_Williams",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Video_game",
  "/wiki/Gender/Legends",
  "/wiki/The_Old_Republic:_Fatal_Alliance_(audiobook)"
 ]
}