{
 "name": "Felicia",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 29–24 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Felicia was the Human female who lived during the Republic Classic era until her tragic death. She was the daughter of Wernell Covington.\nFelicia was the daughter of Wernell Covington, a wealthy land owner who lived on Rori, a moon of Naboo. Sometime during the last decade of the Old Republic, Felicia was kidnapped for ransom. The kidnapping was planned and organized by the criminal known as Vladlun Travan. However, attempts to pay the ransom ended badly, culminating in Felicia's death. The poor girl was jettisoned into space from the starship on which she was being held.\nWernell Covington was deeply traumatized by the awful fate of his daughter and he vowed his life to avenge his daughter, personally killing most of her kidnappers. During the Galactic Civil War, Covington's age and diminishing wealth forced him to hire a spacer to eliminate the remaining two perpetrators. Almost three decades after Felicia's death, the spacer finally killed the last two kidnappers, Vladlun Travan and Jurgen Nath, allowing Covington to live out his days in peace.\nFelicia was first mentioned in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Felicia was added to the game with the release of the \"Game Update 12\", on August 10, 2009.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/29_BBY/Legends",
  "/wiki/24_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Wernell_Covington",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Republic_Classic_era",
  "/wiki/Rori/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Vladlun_Travan",
  "/wiki/Death/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Jurgen_Nath",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_10",
  "/wiki/2009",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures"
 ]
}