{
 "name": "Felix Iresso",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rehemsa"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3673 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic Army",
      "Republic Army",
      "Rift Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Felix Iresso was a Human male Republic soldier of the Galactic Republic and later the Rift Alliance.\nThe son of refugees made homeless during the Great Galactic War, Felix Iresso had been a career soldier for many years. He participated in several notable battles, including the so-called Eight-Hour Invasion of Dubrillion, where Republic forces repelled an Imperial invasion force with minimal reinforcements. Since then, Lieutenant Iresso had earned excellent technical scores and commendations for exemplary service. However, Lieutenant Iresso had one of the highest transfer rates in the Republic military, serving under almost a dozen commanders across the galaxy in two years, one of which was Aric Jorgan. Iresso admitted that he and Jorgan clashed on policy. Jorgan would give orders, and he would follow them only to the point where he felt it was best for the unit.\nIn addition to his less-than-strict adherence to protocol, there was an incident on Althir where Lieutenant Iresso was captured by the Empire and then inexplicably released after a few days. No one, not even he, knew why. Iresso did not even recall what happened during that time. Afterwards, Iresso was shuffled from one command to another, transferred from Ord Mantell, a post he found lousy, to Serroco, then to Duro and eventually to Hoth. His career had stalled to the point where he was all but exiled and assigned a group of jumpy, inexperienced recruits.\nThe Jedi Barsen'thor landed on Hoth, looking to assist the Republic forces there and stabilize a dangerous situation where a rogue White Maw pirate had been preying on the Republic's soldiers and seemed unbeatable. Iresso volunteered to help, and when his squad was transferred off the planet, he made the request to join the Consular's mission, commenting it was the longest posting he had in years and that he hated that planet.\nLater, he discovered that his old friend Milo Pellam was not only alive but also arrested on Tatooine for destroying a gangster's starship. Felix arranged for him to be released. After meeting with him, Iresso discovered that his once cool and collected friend has gone insane. When Iresso asked Pellam about their time captured by the Imperials, Pellam mentions a \"glowing box\" and a female doctor which he also recalled. Felix looked up the doctor's picture in the Republic database but did not get any new information about her. Eventually, the doctor sent him a message and revealed to him the truth: Doctor Sera Fray was ordered by Darth Ouzal to try to duplicate the information contained in a Sith holocron into the brains of two prisoners: Felix Iresso and Milo Pellam. While Pellam became unstable, the experiment of the Sith Lord was a success as Iresso had locked in a corner of his brain a library of Sith knowledge.\nDuring the Eternal Empire's Conquest, the Barsen'thor went missing, but Felix refused to believe that the Consular was dead. A year after his companion went missing, Felix heard a report that he had been sighted on Zakuul. When the Supreme Chancellor refused to respond, Felix investigated on his own, only to realize too late that he had been lured into a trap orchestrated by Jarak, who had him sent to a remote prison. For the following five years, Felix was subjected to brutal experiments in a remote Zakuul military prison with the purpose of extracting the holocron, only being let go when the newly formed Zakuulan government gave him up to the Alliance. Felix was taken to Odessen to recover from the traumatic experience.\nDespite his many setbacks, and his less-than-desirable assignment to Hoth, Iresso remained cheerful and upbeat. He did not follow many of the conventional rules for disciplining his soldiers, preferring to punish misbehavior with unpleasant, but temporary, manual labor or extra chores instead of courts martial, time in the brig, or other punishments that would go in a junior officer's permanent service record.\nHe responded positively when the Consular chose options supporting the Republic's higher ideals, or demonstrated a willingness to risk themselves and the crew for a good cause. His maverick streak, however, would assert itself if asked to so something that was lawful, but unethical. In combat, he tended to draw aggravation from the Consular's enemies, risking himself to take much of the incoming fire so the Consular would not be harmed.\nPerhaps because of his wandering across the galaxy and the hostile wildlife he battled on Hoth, Iresso was fond of collecting trophy parts from dangerous beasts.\nSince his capture by the Eternal Empire, Iresso had lost faith in the Republic, which had written him off as missing in action rather than attempt a rescue.\nHe is a companion character to Jedi Consulars. A female Consular can also start a romance subplot with him.\nHe is voiced by Dion Graham.\nThe mission to recruit Felix into the Eternal Alliance is available only to the Consular class, so this article assumes that the Outlander is the Barsen'thor.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Felix_Iresso",
  "/wiki/Rehemsa",
  "/wiki/3673_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Army",
  "/wiki/Rift_Alliance",
  "/wiki/Lieutenant/Legends",
  "/wiki/Republic_soldier",
  "/wiki/Great_Galactic_War",
  "/wiki/Eight-Hour_Invasion_of_Dubrillion",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/The_galaxy/Legends",
  "/wiki/Aric_Jorgan",
  "/wiki/Althir_III",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Serroco",
  "/wiki/Duro/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Barsen%27thor",
  "/wiki/White_Maw",
  "/wiki/Milo_Pellam",
  "/wiki/Tatooine/Legends",
  "/wiki/Sera_Fray",
  "/wiki/Darth_Ouzal",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Zakuul",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Jarak",
  "/wiki/Zakuulan_government",
  "/wiki/Eternal_Alliance",
  "/wiki/Odessen",
  "/wiki/Jedi_Consular",
  "/wiki/Dion_Graham",
  "/wiki/Alliance_Commander",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}