{
 "name": "Fennec_Shand",
 "display_name": "Fennec Shand",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.63 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Abdomen"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan",
      "Fett gotra"
     ]
    }
   ]
  }
 ],
 "content": "Fennec Shand was a human female bounty hunter, elite mercenary, and Master Assassin who worked for the top crime syndicates during the age of the Galactic Empire. Skilled and ruthless, Shand worked her way up the criminal underworld during the beginning of the Empire's reign, becoming renowned and gaining a reputation as a cunning and elite mercenary. After the fall of the Empire and the imprisonment of many of her employers, Shand went on the run. Though hunted down and left for dead, fate would intervene and she was rescued by Boba Fett.\nEntering the bounty hunter scene shortly after the birth of the Galactic Empire, Fennec Shand quickly proved her merit, and began taking lucrative jobs. One of her earliest bounties was a direct commission for the young clone Omega, for whose bounty Shand clashed with veteran hunter Cad Bane. Though her commission ended without the capture of Omega, Shand went on to become a high-profile assassin for the leading criminal syndicates of the galactic underworld, including the Hutt Clan. After the destruction of the Galactic Empire during the Galactic Civil War, many of Shand's top employers were imprisoned by the New Republic and she was left without vital lines of work. Shand found herself a fugitive from justice and escaped to the Outer Rim world Tatooine.\nNow being tracked by bounty hunters herself, Shand hid out in the deserts of Tatooine and avoided capture for some time before two hunters, the Mandalorian Din Djarin and the rookie Toro Calican, located her and led an assault to take her down. Though she managed to stall them, the two gained the upper hand and took the once-great assassin captive. Shand tried to negotiate her release with Calican but, after she managed to convince him to turn on Djarin, the rookie shot Shand and left her to die. She was discovered by the renowned bounty hunter Boba Fett, who then saved her life. Indebted to Fett, Shand began work as his partner in crime.\nShand and Fett traveled to the planet Tython to recover Fett's armor from Djarin, who had acquired it on Tatooine. In return for the armor, Shand and Fett agreed to aid Djarin in his quest to rescue his foundling, Grogu, from an Imperial remnant led by the rogue Moff Gideon. After helping him take control of Gideon's light cruiser and rescuing Grogu from the Moff, Shand and Fett parted ways with Djarin and returned to Tatooine, where they claimed Jabba the Hutt's former palace for themselves.\nIn 19 BBY, when the galaxy was moving on from the freshly-concluded Clone Wars, the human female Fennec Shand had recently begun her career as a bounty hunter and gun for hire. Though not as experienced, she was dangerous and especially skilled, and quickly achieved a reputation of deceit and ruthlessness. Eventually, even the Duros veteran bounty hunter Cad Bane became aware of her.\nIn time, she began work on a direct commission from Kaminoan scientist Nala Se to bring in the unaltered clone girl Omega, as Se wanted to protect Omega—who had escaped the planet Kamino with the rogue clone commando team Clone Force 99, otherwise known as the \"Bad Batch\"—from Prime Minister Lama Su. During this time, she was contacted by the Sullustan security manager Raspar Six, who had located the Bad Batch's modified Omicron-class attack shuttle Marauder in the city Ro Station on the moon Pantora. Six offered the location to Shand for a price. Communicating from her own ship, Shand opened a hologram of Omega. She promised to compensate Six well and ordered him to prevent the Bad Batch from escaping, before jumping to hyperspace.\nAfter arriving on Pantora, Shand observed Omega at a Gran's shop while she embarked on a supply run with Clone Force 99 members Hunter and Echo. Once Omega became lost because she was chasing a repulsorlift trolley carrying voorpaks, the bounty hunter approached her target and offered to help the young clone find her companions, speaking in a friendly way. Shand extended her arm to help Omega off the ground, since she had fallen when colliding with a passerby, and strolled off with her hand on the girl's shoulder.\nAs the two walked through the city, Omega thanked Shand for helping her to find her friends, and in response Shand asked if she was hungry. After the girl responded affirmatively, the bounty hunter slyly watched a trader with a basket of fruits and bumped into her, sending some of the fruits spilling onto the ground. Shand and Omega picked up the fruits and returned them into the trader's basket, but the girl noticed that her new companion pocketed two fruits in a clandestine manner, and was also carrying a concealed weapon. When Shand gave one to the hungry Omega, the youngling noted that they had not paid, to which the mercenary replied that sometimes it was acceptable to break the rules. Omega additionally questioned if Shand was a soldier and why she had a blaster, and Shand responded that she was not, but carried a weapon to protect herself, remarking that the galaxy was dangerous to those alone.\nHearing this, Omega reflected on how it was good to have her friends. Upon Shand's comment that Omega was lucky, the girl arrived at the idea that the lone woman should join the Bad Batch, and Shand chuckled and said that this was the best offer given to her in a long time. Before the bounty hunter could lead Omega off further, Hunter appeared from behind and commanded Omega to step away from Shand. Omega was initially puzzled, saying that Shand was helping her to find him. Although Shand responded that they \"were getting to know each other,\" she put on her helmet and reached for her blaster, while Hunter clasped the handle of his knife. After the two stared icily at each other, with Omega pressed against Shand's body, the bounty hunter fired three shots on Hunter, ducking for cover, and missed, before Omega took hold of Shand's arm, forcing her to release her.\nThe clone commando threw his knife at the bounty hunter, who blocked it with a lid and seized it in her own hand. Swiping with the knife and charging forward, Shand pinned Hunter down against a fruit rack and engaged him in hand-to-hand combat. Shand's right arm—wielding the knife—was grabbed by Hunter's left, and her left arm—wielding her blaster pistol—was pushed away by his right, causing her to miss two more shots at close range. When Shand turned the knife towards Hunter's chest, the commando called for Omega to run as he wrestled both the knife and the blaster out of her hands. Although without a weapon, Shand headbutted Hunter and stunned him, escaping the scene with her blaster as three Pantoran Security officers approached. She chased Omega with intent through the city streets, but the girl evaded her by hiding behind a crate and then pressing a button to open a nearby manhole cover, through which she fled into the subterranean maintenance tunnels.\nShand eventually caught up to Omega from behind, who had been joined by fellow Bad Batch member Wrecker, while he was trying to carry the youngling back to safety. Dropping Omega, who began to climb up a ladder, Wrecker put on his helmet and sized up Shand. When the clone commando charged at Shand, she dodged his attack and deftly threw him into the control panel of a pipe, knocking him out.\nShand then climbed up the ladder, pursuing the target to the top of a maintenance tower in the lower division of the city near lanes of traffic. The bounty hunter blasted the hatch controls at the top, causing Omega to lose her footing and hang from the platform, but she grabbed the girl as she began to plummet, saying that she could delay her gratitude. After Shand spotted Hunter approaching on a stolen speeder bike, she dropped Omega on a hovertruck below and accompanied her, with Hunter following the truck. Taking aim at the clone commando, Shand fired nine shots with her pistol and missed, while Omega snuck forward and pulled a lever on the truck which raised its bed, sending the bounty hunter off her feet and clinging to the back. However, two bales fell and struck Shand off the truck and onto a ComfortRide Passenger Airspeeder below, clutching to its left edge.\nWith the rest of the bales unsecured and sliding off, Omega saved herself by grabbing a strap on the truck. As two Pantoran Security officers gave chase on speeder bikes, Shand pulled herself up onto the airspeeder and threw the driver out, before accelerating towards Hunter's bike and the hovertruck. By ramming into Hunter from the rear, she sent his speeder flying out of sight. Noticing the two guards behind her, Shand grabbed her blaster and fired one shot, hitting the guard on her right through his windshield, which caused his speeder to careen into the one on the left, and both crashed into a building.\nHunter returned and pursued from Shand's right side, who was closing in on Omega. With his own DC-17 hand blaster, the commando hit both engines on Shand's airspeeder and swooped forward to catch Omega as she fell. Now in front of the bounty hunter, Hunter activated a pyro denton explosive and, upon repositioning behind Shand, tossed the bomb onto her speeder. Shand leapt out as an explosion destroyed the airspeeder, landing on a taxi before tumbling to the ground. Her comandeered vehicle crashed before her, consumed in a fireball. Stumbling to her feet, Shand narrowed her eyes furiously on the skylane above, watching Omega and Hunter escape.\nWhen all Bad Batch members had regrouped at the landing bay and the Marauder blasted off from Pantora, Six was unable to prevent their departure. Shand later returned to Six, backing him into a corner and edging menacingly towards him, who said that he had tried to stop the clones. The bounty hunter threw a device to him and told him to contact her if Clone Force 99 came back. Taking off her helmet, Shand spoke through a comlink outside Six's office to inform her employer that, although Omega had escaped, she would find her, as she cast her steely eyes at the night sky.\nA short time later, the Bad Batch learned of Shand's identity from the information broker Cid.\nShand took her ship and continued tracking Omega. Cad Bane, though, was soon able to capture the young clone on junkyard world of Bracca. Since Bane was arranged to hand his captive over to the Kaminoan Taun We at an abandoned cloning facility on the planet Bora Vio, Se contacted Shand to stop Omega from reaching We. Travelling to the facility, Shand killed We and took the payment case that had been for Bane. Then confronting the Duros, she insisted Omega was her score first. Bane claimed she lacked the experience to face him, but she taunted him with his payment. With the Duros demanding the case, Shand proposed a trade of the payment for Omega, her opponent asking her to hand him the case first.\nBane's droid, Todo 360, sneaked behind Shand and grabbed the case from her hands, prompting Bane to open fire on her. The pair then exchanged fire until Bane threw a thermal detonator. Shand kicked the explosive towards Todo, who was knocked out of the window and lost the credits inside the payment case. The two bounty hunters continued their gunfight, Omega fleeing while they were distracted. Shand then continued her pursuit of the young clone and left an explosive charge on her trail, which incapacitated Bane. The bounty hunter found Omega in a room full of preservation tanks, trying to convince her that she was on her side. Her target refused to trust her due to their encounter on Pantora. Todo then tried to apprehend Omega, only to be subdued by Shand. Omega ran to a terminal and made one of the preservation pods fall on the bounty hunter, smashing its contents, the preserved body of a Kaminoan, on her.\nMaking chase for Omega again, Shand found the girl being confronted by Bane at a balcony and attacked the other bounty hunter before pushing Omega out of harm's way. The two fought in hand-to-hand combat, Bane being able to knock Shand down for a short amount of time before she got up and attacked him again. Bane was eventually able to knock her out for a little longer but was then informed by Todo that Omega was getting away, witnessing a flight pod launch from the facility. Shand got up, dodging Bane's flamethrower attack and restraining the Duros. She then was able to knock him over the balcony. Before leaving the facility, Shand sabotaged Bane's ship, the Justifier, to prevent him from pursuing her or Omega, who had been rescued from her pod by the Bad Batch. The bounty hunter was contacted by Se, whom she informed that Omega had been rescued. Shand offered to go after the clones for extra, but Se said she did her job and paid Shand for her work.\nEventually earning the title of Master Assassin, Shand would continue her career, making a name for herself working as an elite and expensive mercenary for the underworld's top crime syndicates, including the Hutt Clan. At some point in her career, she became wanted by the Imperial Security Bureau. In the aftermath of the Battle of Hoth in 3 ABY, when a bounty was put on hunter Beilert Valance due to his alliance with rogue hunter Nakano Lash, bondsman Syphacc hired pit fighter Tasu Leech from the Hutts to hunt Valance over Shand, as Shand's services would cost more than Leech. However, Valance defeated the young pit fighter.\nIn 5 ABY, the Galactic Empire was defeated by the forces of the New Republic at the Battle of Jakku, after which point the Empire surrendered and the New Republic became the dominant power in the galaxy. By the year 9 ABY, the New Republic had arrested and imprisoned many of Shand's former employers, leaving the assassin on the run with a ten thousand credit bounty on her head. She ended up on the planet Tatooine, hiding out beyond the Dune Sea.\nWhile in the desert, Shand used her skills as a markswoman to hide and take a sniping position, hidden in a rock formation. This allowed her to shoot and kill a human bounty hunter who had been tracking her on a dewback before he was even aware of her presence. His corpse, still being dragged through the sand by his mount, was then discovered by two more bounty hunters on her trail, the Mandalorian Din Djarin and the rookie Toro Calican. Calican hid behind a dune while Din Djarin approached the corpse to confirm whether or not it was Shand's doing. Shand, who was positioned on a ridge some distance away, sighted the two bounty hunters and opened fire. She managed to hit Din Djarin twice in the back as he retreated toward the dune, but he survived, due to his beskar armor, which caused Shand's sniper bolts to simply glance off.\nAs Shand had the high ground, she waited for the bounty hunters to make the first move instead of trying to escape. Guessing her plan, Djarin and Calican waited till nightfall to make their approach. Once darkness had fallen, the two bounty hunters drove directly at Shand's location on a pair of Zephyr-J speeder bikes. As the assassin prepared to fire, Djarin fired off a flash charge, temporarily blinding her and forcing her to remove her helmet. She then missed her first shot, and after Calican fired off another charge, she missed again.\nHowever, when Calican misfired his next flash charge, Shand was able to shoot out Djarin's bike from beneath him. The bounty hunter survived and fired off another flash charge to cover the last portion of Calican's approach, after which Shand shot Djarin in the chest and knocked him to the ground. As she prepared to kill Din Djarin, Calican announced himself behind her, allowing her to strike his weapon with a thrown blade and slow him long enough to attack. The rookie attempted to shoot her multiple times as she battled him unarmed, but she proved too evasive for Calican to hit. Shand quickly disarmed and defeated the rookie hunter. As Shand began to crush Calican's neck, Djarin arrived and forced her to surrender at blasterpoint.\nDin Djarin forced Shand to put on a pair of stuncuffs and the two hunters marched her down to their sole remaining speeder bike, which Shand mockingly pointed out would not carry all three of them. Djarin suggested that Calican go find the dewback they had seen earlier, but after the rookie refused to trust Din Djarin alone with both the bike and the bounty, the more experienced hunter set off to find it himself, leaving Shand and Calican alone together.\nAs the pair waited, Tatooine's twin suns rose and Shand began attempting to convince Calican to work with her rather than the Mandalorian. At first, the captive hunter claimed to have a rendezvous in Mos Espa and offered to pay the young rookie double her bounty if he would take her there instead of turning her in. Calican claimed disinterest in money, causing Shand to change tactics. The assassin suggested that he capture Din Djarin, as she had heard he had betrayed the Guild and now possessed a high-value asset, a child. She pointed out to Calican that claiming the bounty on a traitor would provide far greater a reputation boost than turning in her bounty and offered to help him subdue the Mandalorian bounty hunter. She also gave him some advice as to how to thrive in their line of work.\nCalican appeared convinced and holstered his weapon, so Shand approached with her arms outstretched, expecting him to unlock the stuncuffs. Instead, the rookie hunter shot her in the stomach. As she collapsed to the ground, he pointed out that he knew she would have simply killed him once he removed the cuffs, and with Din Djarin's bounty to claim, he no longer needed her. He then thanked her for her advice and the tip she'd given him before mounting his speeder bike.\nDuring this time, Shand was found near death by Boba Fett, after seeing Djarin's flash charge on his bantha. Fett hitched her to the bantha and took her Mos Eisley's mod-parlor. There, Fett paid a mod-artist to save her life, while at the same time, making her into a cyborg, when replacing her intestines with cybernetic components. Fett then took her back into the dune sea. There, she regained consciousness, painfully, near Fett's campfire. Shand was given a black melon by Fett, despite her disgust of it. Shand saw what Fett did to her.\nWhen Fett revealed to know who Shand was, she believed that he wanted to collect the bounty on her. Shand offered him double her bounty, but Fett did not want money. When Fett revealed who he was, Shand told him that he was dead. He corrects her, telling her that he was left for dead in the dune sea like she was, and that he was captured by the Tuskens. He also told her about how the Kintan Striders had killed the Tusken tribe, much to Shand's disbelief.\nShand was asked by Fett to help him reclaim his Firespray-class gunship, Slave I, from Jabba's Palace. now under the control of his majordomo, Bib Fortuna. Shand asked why he could not ask Fortuna for his ship back. Fett, knowing he was less persuasive without his armor, believes he would not like Fortuna's answer. Shand agreed to help Fett to repay her debt to him.\nShand sent one of her drones into the palace to find out how many guards Fortuna had. After Fett freed his bantha, he told Shand about his plan to reclaim his armor, kill Fortuna and claim Jabba's Empire for himself. When the drone returned, Shand and Fett snuck into the palace through the kitchen. After dealing with several of the droids, she and Fett were able to make their way to the hangar and found Slave I. After taking care of a pair of Gamorreans, Shand watched Fett's back as he boarded Slave I and started it up. Shand held the guards while Fett attempted to open the hangar doors. After dealing with guards, Shand was able to open the doors with her rifle. As they left the palace, Shand said would stay with Fett while he took care of several personal scores.\nShand watched as Fett took out several of the Kintan striders. She then helped him search the Great Pit of Carkoon for his armor, despite the chance of it's dissolving in the sarlacc. However, the sarlacc tried to take Slave I. Luckily, Shand was able to kill it with one of Slave I's seismic charges. Shand helped fett search the Sarlacc's innards, but no trace of his armor was there. She cleaned Fett of the Sarlacc's digestive juices and told him he need to be in a bacta tank. During dinner, Fett told her about his plans about starting his own house. He told Shand that need both brains and brawns to lead his house. Shand agreed to join Fett to share in his success and to have him protect herself. Sometime later, Fett discovered that Djarin had returned to Tatooine and taken Fett's armor from Cobb Vanth, a lawman who had acquired and used the suit to protect a small town.\nShand aided Fett in tracking down Djarin to the planet Tython, where Djarin had sat Grogu upon a seeing stone at the planet's temple ruins. After the pair landed, Shand perched atop a low cliff in a sniper position. Having seen the Fett's Firespray-31-class patrol and attack craft, the Slave I, Djarin ran down the hill to investigate the new arrivals, only for Shand to fire at him, forcing him behind cover.\nFett confronted the Mandalorian, demanding his armor back and using Shand as a threat as she was scoped on Grogu. The assassin remarked she did not miss, and Djarin immediately recognized her voice. With Djarin still threatening to kill both of them, Fett suggested that they all put down their weapons and talk, the Mandalorian demanding that Shand drop hers first. Fett and Djarin soon came to an agreement and Fett told Shand to stand down. The assassin climbed down to Fett and Djarin, remarking about the latter's surprise at her presence. The Mandalorian thought that Shand had died at Tatooine, so she and Fett explained how the latter had saved her and that she was in his service.\nFett tried to bargain for his armor in exchange for the safety of Djarin and Grogu, but the Mandalorian claimed that handing it over was against the Mandalorian Creed. Shand pointed out the size of the bounty on Grogu. That was when an Imperial transport—a troop-carrier from a remnant of the Galactic Empire led by Moff Gideon—flew above them. With Djarin going back to try and retrieve Grogu, Shand and Fett went to face the incoming Imperial force. The Imperial transport landed near Djarin's gunship, the Razor Crest, deploying stormtroopers onto the field. From a position up a hillside, Shand opened fire on the troopers, dropping several of them.\nThe Imperial troops ran for cover before beginning to climb the slope, Fett taking some on with his gaderffii stick. Shand continued to pick off stormtroopers until an E-Web heavy repeating blaster cannon was set up and opened fire from her. Routed from her position, the assassin ran across a ridge and behind the cover of a large boulder. In the meantime, an artillery stormtrooper at her new position with a model 201 mortar system. The mortar round loosened the boulder, allowing her to dislodge it and send it rolling towards the E-Web turret and accompanying troopers. Despite their attempts to destroy it, the boulder crushed several stormtroopers, and destroyed the E-Web emplacement.\nBy this point, stormtroopers had reached Shand's position, forcing her to flee while engaging the approaching troopers, killing several of them as a second dropship arrived to provide reinforcements. Shand threw her helmet at one soldier as a distraction, using that brief moment to dispatch several more. Djarin then arrived and reinforced her, telling her she could leave as he owed her from their last encounter. Fett, who had regained his armor from the Razor Crest, also arrived, killing many more stormtroopers and scaring the remaining ones into a retreat. The Imperial forces withdrew to their transports, which took off for their origin. Using his armor's missile launcher, Fett was able to cause the transports to crash into each other and be destroyed.\nThe Imperial forces were not finished attacking Shand and the others, as Gideon's light cruiser fired on the Razor Crest, destroying it immediately. Shand advised Fett to return to the Slave I and Djarin began running back to Grogu, the assassin following him. However, the Child was captured by Gideon's detachment of Dark Troopers by the time Djarin and Shand reached the seeing stone. Shand informed Fett of such, and he began pursuit of the Dark Troopers. Djarin had the assassin inform the bounty hunter not to engage so as to not hurt Grogu. Witnessing Gideon's cruiser, Fett proclaimed that the Empire had returned, much to Shand's initial skepticism.\nAfter the cruiser escaped, Djarin searched the Razor Crest's crater and Fett proved to the Mandalorian through his chain code that his armor belonged to him by creed. Furthermore, the bounty hunter affirmed to his promise that he and Shand would ensure the safety of Grogu, pledging their help in rescuing the infant. Aboard the Slave I, they traveled to the planet Nevarro so that Djarin could get the help of his ally, the New Republic Marshal Cara Dune.\nShand went with New Republic marshal Carasynthia Dune, Djarin, and Fett to the Karthon Chop Fields. There, they took former Imperial sharpshooter turned mercenary Migs Mayfeld into their custody. Djarin devised a plan to use Mayfeld to find Gideon's light cruiser using a terminal at an Imperial refinery on Morak. Upon their arrival on Morak, Shand and Dune took sniper positions outside of the refinery, while Djarin and Mayfeld snuck into the refinery disguised as shoretroopers. After Mayfeld killed Valin Hess out of anger, Shand and Dune took out several of the stormtroopers, gunners, and shoretroopers from their sniping position as Djarin and Mayfeld escaped to Slave I. Being an excellent marksman herself, Shand was impressed with the shot Mayfield made, detonating a canister of rhydonium and causing a chain reaction of explosions which damaged the refinery.\nAfter Djarin recruited two Mandalorians, Lady Bo-Katan Kryze and Koska Reeves, Fennec accompanied the group aboard Dr. Pershing's Imperial shuttle. Along with Dune, Kryze, and Reeves, she made her way through Gideon's cruiser, killing numerous stormtroopers along the way, to the bridge, where they commandeered the vessel. She then stood ready to assist her compatriots against a platoon of dark troopers which were about to gain entry to the bridge, before they were all destroyed by the Jedi Luke Skywalker, who left with Grogu, intending to train him in the ways of the Force.\nFollowing Grogu's rescue, Shand and Fett's pledge to Djarin was fulfilled, and they returned to Tatooine. They went to Jabba's Palace, and, after taking out several of Bib Fortuna's guards and freeing one of his slaves, she stood by as Fett killed Fortuna. As Fett sat on Fortuna's throne, Shand stood behind him and took a bottle of spotchka to celebrate.\nShand stood by Fett as he collected tribute from Garfalaquox of the Aqualish family and Dokk Strassi of the Trandoshan family. However, when Mos Espa's Mayor Mok Shaiz's Twi'lek majordomo arrived, he asked tribute from Fett instead of giving it. Shand thought about killing the majordomo, but Fett denied the idea knowing that the twi'lek works for the mayor. She allowed the majordomo to leave unmolested and he promised that another delegation from the Mayor would arrive. Fett told Shand to keep an eye on the majordomo. When Fett allowed the two surviving Gamorean guards to conitinue as his guards, Shand questioned it and said it was a bad idea.\nShand accompanied Fett and the Gamoreans to the Mos Espa. There, they went to the Sanctuary to meet with Garsa Fwip. When Fett insisted on getting their helmets cleaned, Shand hesitated. Shand was introduced to Fwip by Fett who assured her that her business would thrive under his tenure as Fortuna's replacement. When she and Fett got their helmets back, they were filled with credits. Shand said Fett's was shinier than hers.\nAs Shand and Fett left the Sanctuary, they were ambushed and surrounded by several assassins. With assistance from the Gamoreans, they were able take out several of the assassins. Shand pursued two of them, but was ordered by Fett to bring in alive. She was able to catch both, but needing only one alive, pushed one off a roof to his death.\nShe brought in the assassin before Fett at their palace. The assassin, a member of the Order of the Night Wind, refused to answer their questions. Shand, knowing the prisoner would not talk, convince Fett to \"feed\" him to the rancor. When the assassin saw the gate opening, he told that he was sent by the mayor. However, Shand revealed that there was no rancor anymore and suggested they visit the mayor.\nShand, Fett and the Gamoreans brought the assassin to Shaiz's office. There, the assassin was killed by the Mayor's guards and Shand held her rifle up at them. After the mayor gave Fett his tribute, she went with Fett to the Sanctuary. There, they discovered that Jabba's cousins, The Twins had come to stake their claim on their late cousin's Empire. Shand watched Krrsantan as Fett told the Twins that Jabba's empire was his and to return to Nal Hutta. After The twins and Krrsantan left, she reminded Fett that they would need permission to kill the Twins.\nAt the palace, Shand and Fett listened to 8D8 explaining the status of Mos Espa during and after Jabba's demise. When they began to discuss the Mayor, Shand believed Shaiz had support from someone. However, Fett told her to wait and spoke with Lortha Peel about a street gang stealing water from him. Later, they looked into the matter on a walk through Mos Espa. After Fett offered the gang the chance to work with him, Shand paid Peel 500 credits of 1,300 the gang had stolen from him. Shand brought them back to the palace.\nDuring the night, Krrsantan attempted to kill Fett. However, Shand, the Mods, and Gamorreans were able to force Krrsantan into the main hall. There, Shand dropped him into the Rancor pit. Krrsantan attempted to climb out, but Shand tossed a knife at his hand. She then took one of the Gamorreans to the bacta tank to heal. At breakfast, Shand told Fett that Krrsantan's capture would send a message to the Twins and any other usurpers. Shand and Fett then met with the twins at the front gate to discuss their situation. After the twins gave Fett a rancor calf, Fett released Krrsantan, although Shand believed it was a bad idea.\nShand, Fett and the street gang then went to Shaiz's office to speak with the mayor. However, only his majordomo was there and tried escape them. Shand then sent the mods after the majordomo. After the mods captured the majordomo, they informed Shand and Fett that a large number of Pykes were arriving at the starport. Shand believed they were preparing for war with Fett. Shand questioned the majordomo about the mayor as Fett slept in his bacta tank. She told Fett that there was no sign of the mayor but Mods were watching for him in Mos Espa. She allowed Fett to show his face instead of resting.\nFollowing Fett's hiring of Krrsantan, he and Shand hosted a dinner with the heads of Mos Espa's crime families. Shand reminded them that they were once captains under Jabba before his sail barge debacle and how they each tried to take Jabba's place before Fortuna. She told them that Fett could make the wealthy once more if they listen to him. When the families agreed to be neutral in Fett's fight against the Pyke Syndicate, Shand toasted the agreement.\nAfter the families left, Shand asked Fett how much reserve treasure they have. Fett said they had plenty and Shand told him it could buy them muscle to assist them. She made her way to Mos Eisley. There, Shand found Djarin at Peli Motto's Hangar 3-5. Djarin agreed to help Shand and Fett for free after delivering a gift to Grogu.\nShand later reunited with Fett and their associates, to rely information on the Pykes' current whereabouts and form a strategy regarding the incoming conflict. As Djarin arrived, Shand introduced him to the rest of Fett's associates, and claimed that even though him and Krrsantan were good enough enforcers and the Mods did well in their patrolling of the streets, their operation still needed foot soldiers in the case they went to all-out war with the Syndicate. The Mandalorian informed that he could probably get help, much to the surprise of everyone present, and Fett locked his gaze on his second-in-command, waiting for her answer.\nShand played a crucial role in the war against the Pyke Syndicate. She initially stayed with Fett and Djarin in the ruins of the Sanctuary, which had been bombed by Pyke operatives, assisting Fett in planning their gotra's actions. She later left the makeshift command center after Fett discovered the location of the Pyke leadership and tasked her with travelling to Mos Eisley to eliminate them. On the way there, she intervened in a shootout between the Mods and a group of Aqualish gangsters and rescued her allies from certain death at the hands of the Aqualish family. After arriving in Mos Eisley, she surreptitiously approached the Survey Office, gunned down the guards outside the door, and slaughtered the perpetrators of the war, including Mayor Shaiz, in quick succession.\nAfter the battle, Shand and Fett took a walk through the streets of Mos Espa, watching the town being rebuilt. Shand suggested Fett to take a soak in his bacata tank, but Fett replied it was being used. As they passed through, their people cheered them on and paid their respects. A group of children ran up to them, and offered them meiloorun fruit as a gift, which Fett accepted and Shand refused. They caught up with Krrsantan, Drash and Skad, and the group joked around, celebrating their victory. Sometime after their victory, Shand and Fett launched a mission to Black Spire Outpost on the planet Batuu, where they looked for hidden members of the Pyke Syndicate and possible recruits for Fett's gotra.\nA capable and confident individual, Shand advised the young hunter Toro Calican that the best way to work as a bounty hunter was to make deals in one's own best interest, ensuring their personal survival. Through her words, she believed that she had tricked the rookie gunslinger into freeing her by convincing him to turn on his partner. Calican, however, had assumed that she would betray him and shot her; Shand's overconfidence nearly cost the assassin her life.\nAfter being rescued from death by Boba Fett, Shand dedicated her services to him as repayment, later vowing to do the same for Din Djarin after his ward was kidnapped by Gideon's forces, proving Shand was not without honor and later showed compassion in freeing a Twi'lek slave from Bib Fortuna. During Boba Fett's tenure as crimelord of Mos Espa, Shand displayed fierce loyalty to Fett, fighting side-by-side with him against a group of Night Wind assassins and followed Fett's order to capture an assassin alive without question. She later helped capture the Wookiee Krrsantan after he attempted to assassinate Fett. She also had a deep appreciation for manners and gratitude, something she noted after Drash thanked Shand for saving her life. Shand had tan skin, brown eyes, and black hair braided with brown-and-red cording.\nShand was a highly skilled mercenary, with a reputation Din Djarin had heard of that made him hesitate in attempting to capture her. She possessed a mastery of firearm usage, particularly in regards to sniper rifles. During her time on Tatooine, Shand was able to successfully shoot Djarin off his Zephyr-J bike from a great distance, even after being partially blinded by the hunter's flash charges. Her marksmanship was also deadly at shorter ranges, a skill she displayed on Tython when she managed to drop several stormtroopers within a matter of seconds. Shand was able to meet her mark even while airborne; by her own word, she never missed a shot, though was seen to have missed multiple times on Tatooine and Tython.\nShand was also a capable fighter in hand-to-hand combat. She was capable of matching the clone Hunter in a close-quarters duel on Pantora. She also easily bested Toro Calican on Tatooine with a series of punches and kicks that ended with the would-be hunter in a crushing headlock between Shand's legs. She was only stopped when Djarin held her at gunpoint. She has also fought evenly against accomplished bounty hunter Cad Bane. She also possessed very quick reflexes, grabbing a lid to block a knife thrown by Hunter with incredible speed. An athletic individual, Shand possessed enough martial skill to knock out Wrecker with his own momentum and later pushed a boulder down a hill on Tython after using it as cover from an E-Web heavy repeating blaster cannon. She also had enough combat prowess to defeat stronger species such as Gamorreans. Like other hunters who had attained a reputation like her own, she was typically only hired for jobs that a client deemed to be truly important.\nShand wielded an MK sniper rifle as her primary weapon, and kept a small throwing blade hidden in the stock. Shand also carried a blaster pistol. She wore a black jacket with orange stripes, pants with brown boots, and an orange and black helmet. During the early weeks of the Galactic Empire, Shand also flew her own ship, but, after allying with Boba Fett during the New Republic Era, the two shared Fett's modified Firespray-31-class patrol and attack craft Slave I.\nFennec Shand first appeared in Chapter 5 of Jon Favreau's 2019 Disney+ television series The Mandalorian, which aired on December 6, 2019. She was portrayed by Ming-Na Wen, with Ming Qiu and Lauren Mary Kim serving as stunt doubles. The character was first revealed prior to the episode's release in an article on Vanity Fair on November 4, 2019. Fennec Shand's name was inspired by the fennec fox. It was promised that a more detailed look at Shand's attire would be released, and, in celebration of Star Wars day, Wen released full body images of her costume on her Twitter account.\nWhen conceiving Shand, character designer Brian Matyas was instructed to explore the shape and opulence of Lando Calrissian from Star Wars: Episode V The Empire Strikes Back for inspiration. Matyas based Shand's helmet on medieval jousting helmets and gave her armor more feminine and aggressive curves, intending to reflect the role of a high-class assassin by implementing fashionable colors, geometric shapes and fabric textures.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Expand",
  "/wiki/Template:Update",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Cornered",
  "/wiki/Bounty_Lost",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Talk:Fennec_Shand",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Hutt_Clan",
  "/wiki/Fett_gotra",
  "/wiki/Bounty_hunter",
  "/wiki/Mercenary",
  "/wiki/Master_Assassin",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Jakku",
  "/wiki/Death",
  "/wiki/Boba_Fett",
  "/wiki/Omega",
  "/wiki/Cad_Bane",
  "/wiki/Contingency",
  "/wiki/Galactic_Civil_War",
  "/wiki/New_Republic",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Tatooine",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Toro_Calican",
  "/wiki/Hunt_for_Fennec_Shand",
  "/wiki/Skirmish_on_Tython",
  "/wiki/Planet",
  "/wiki/Tython",
  "/wiki/Boba_Fett%27s_armor",
  "/wiki/Mission_to_Tatooine_(Din_Djarin)",
  "/wiki/Foundling",
  "/wiki/Grogu",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Moff",
  "/wiki/Gideon",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Gideon%27s_light_cruiser",
  "/wiki/Attack_on_Jabba%27s_Palace_(Boba_Fett)",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/19_BBY",
  "/wiki/Galaxy",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Clone_Wars",
  "/wiki/Assassin",
  "/wiki/Duros",
  "/wiki/File:FennecShandHologram-Rampage.png",
  "/wiki/Kaminoan",
  "/wiki/Nala_Se",
  "/wiki/Cloning",
  "/wiki/Kamino",
  "/wiki/Clone_commando",
  "/wiki/Clone_Force_99",
  "/wiki/Prime_Minister",
  "/wiki/Lama_Su",
  "/wiki/Sullustan",
  "/wiki/Raspar_Six",
  "/wiki/Omicron-class_attack_shuttle",
  "/wiki/Marauder_(Omicron-class)",
  "/wiki/City",
  "/wiki/Ro_Station",
  "/wiki/Moon",
  "/wiki/Pantora",
  "/wiki/Fennec%27s_ship",
  "/wiki/Hologram",
  "/wiki/Hyperspace",
  "/wiki/Unidentified_Gran_trader",
  "/wiki/Unidentified_trading_post",
  "/wiki/Hunter",
  "/wiki/Echo",
  "/wiki/Repulsorlift",
  "/wiki/Voorpak",
  "/wiki/File:Shand_and_Omega.png",
  "/wiki/Soldier",
  "/wiki/Blaster",
  "/wiki/The_galaxy",
  "/wiki/File:HunterShandKnifeFight-Cornered.png",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Wrecker",
  "/wiki/File:Fennec_ShandCopKiller-Cornered.png",
  "/wiki/Lower_division",
  "/wiki/Speeder_bike",
  "/wiki/Hovertruck",
  "/wiki/ComfortRide_Passenger_Airspeeder",
  "/wiki/Airspeeder",
  "/wiki/File:Shand_Speeder_Explodes.jpg",
  "/wiki/DC-17_hand_blaster",
  "/wiki/Pyro_denton_explosive",
  "/wiki/Skylane",
  "/wiki/Comlink",
  "/wiki/Time",
  "/wiki/Information_broker",
  "/wiki/Cid",
  "/wiki/File:FennecGetsFrisky-BL.png",
  "/wiki/Mission_on_Bracca",
  "/wiki/Bracca",
  "/wiki/Taun_We",
  "/wiki/Bora_Vio_cloning_facility",
  "/wiki/Bora_Vio",
  "/wiki/Todo_360",
  "/wiki/Thermal_detonator",
  "/wiki/Credit",
  "/wiki/File:ShandCausesBanePain-BL.png",
  "/wiki/Flamethrower",
  "/wiki/Justifier",
  "/wiki/Nar_Kanji",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Battle_of_Hoth",
  "/wiki/3_ABY",
  "/wiki/Beilert_Valance",
  "/wiki/Nakano_Lash",
  "/wiki/Syphacc",
  "/wiki/Pit_fighting",
  "/wiki/Tasu_Leech",
  "/wiki/File:Fennec_Shand_Bounty_Puck.png",
  "/wiki/5_ABY",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/Imperial_Instruments_of_Surrender",
  "/wiki/Standard_year",
  "/wiki/9_ABY",
  "/wiki/Bounty",
  "/wiki/Dune_Sea",
  "/wiki/Desert",
  "/wiki/Dewback",
  "/wiki/Beskar",
  "/wiki/Mandalorian_armor",
  "/wiki/File:Shand_Sniper.png",
  "/wiki/Zephyr-J",
  "/wiki/Flash_charge",
  "/wiki/File:Calican_and_Shand.png",
  "/wiki/Stuncuffs",
  "/wiki/Tatoo_I",
  "/wiki/Tatoo_II",
  "/wiki/Mos_Espa",
  "/wiki/File:Shand_death.png",
  "/wiki/Stomach",
  "/wiki/File:FennecShandModified-BoBFCh4.png",
  "/wiki/Boba_Fett%27s_bantha",
  "/wiki/Mos_Eisley",
  "/wiki/Mos_Eisley_Mod_Parlor",
  "/wiki/Kintan_Striders",
  "/wiki/Massacre_of_a_Tusken_Raider_tribe",
  "/wiki/Unidentified_Tusken_Raider_tribe",
  "/wiki/File:FindingSlaveI-BoBFCh4.png",
  "/wiki/Firespray-31-class_patrol_and_attack_craft",
  "/wiki/Bib_Fortuna",
  "/wiki/File:DontTouchMyButtons-BoBFCh4.ogg",
  "/wiki/File:HoveringOverSarlaccPit-BoBFCh4.png",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Seismic_charge",
  "/wiki/Cobb_Vanth",
  "/wiki/Marshal",
  "/wiki/Freetown",
  "/wiki/File:FettShandTython-Chapter14.png",
  "/wiki/Seeing_stone",
  "/wiki/Slave_I",
  "/wiki/File:ShandDjarinVsStormtroopers-TMCh14.png",
  "/wiki/Mandalorian_Creed",
  "/wiki/Imperial_transport",
  "/wiki/Trooper",
  "/wiki/Carrier",
  "/wiki/Gunship",
  "/wiki/Razor_Crest",
  "/wiki/Stormtrooper",
  "/wiki/Gaderffii_stick",
  "/wiki/E-Web_heavy_repeating_blaster_cannon_(Gideon%27s_Imperial_remnant)",
  "/wiki/Artillery_stormtrooper",
  "/wiki/Model_201_mortar_system",
  "/wiki/File:TeamDjarin-TMCh14.png",
  "/wiki/Gideon%27s_Dark_Trooper_platoon",
  "/wiki/Third-generation_design_Dark_Trooper",
  "/wiki/Dark_Trooper",
  "/wiki/Chain_code",
  "/wiki/Nevarro",
  "/wiki/Carasynthia_Dune",
  "/wiki/File:MissionToMorak-TMCh15.png",
  "/wiki/Morak",
  "/wiki/Karthon_Chop_Fields",
  "/wiki/Migs_Mayfeld",
  "/wiki/Morak_Imperial_refinery",
  "/wiki/Valin_Hess",
  "/wiki/Coastal_defender_stormtrooper",
  "/wiki/Lord",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Koska_Reeves",
  "/wiki/Doctor",
  "/wiki/Pershing",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Platoon",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/File:Boba-Fenenc-Jabba-Palace-TMCH16.jpg",
  "/wiki/Unidentified_Twi%27lek_slave",
  "/wiki/Spotchka",
  "/wiki/Garfalaquox",
  "/wiki/Aqualish_crime_family",
  "/wiki/Dokk_Strassi",
  "/wiki/Tatooine_Trandoshan_family",
  "/wiki/Mok_Shaiz",
  "/wiki/Unidentified_Twi%27lek_majordomo",
  "/wiki/Majordomo",
  "/wiki/Sanctuary_(cantina)",
  "/wiki/Garsa_Fwip",
  "/wiki/File:ShandVsNightwindAssassins-BoBFCh1.png",
  "/wiki/Ambush_outside_of_the_Sanctuary",
  "/wiki/Order_of_the_Night_Wind",
  "/wiki/The_Twins_(Hutts)",
  "/wiki/Krrsantan",
  "/wiki/Nal_Hutta",
  "/wiki/File:8D8briefing-BoBFCh3.png",
  "/wiki/8D8",
  "/wiki/Lortha_Peel",
  "/wiki/Mods",
  "/wiki/Boba_Fett%27s_rancor",
  "/wiki/File:FettShandBalcony-BoBFCh4.png",
  "/wiki/Peli_Motto",
  "/wiki/Hangar_3-5",
  "/wiki/File:ShandSavesMods-BoBFCh7.png",
  "/wiki/Bombing_of_the_Sanctuary",
  "/wiki/Desert_Survey_Office",
  "/wiki/Assassination_of_the_Pyke_Syndicate_leaders",
  "/wiki/Meiloorun_fruit",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Batuu",
  "/wiki/File:Shand-Calican-TMS1C5.jpg",
  "/wiki/File:CyberFennec.png",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/File:DjarinShand-TMS1C5.ogg",
  "/wiki/File:FennecShandBadass-TMCh14.png",
  "/wiki/Sniper_rifle",
  "/wiki/Second",
  "/wiki/Atmosphere",
  "/wiki/Gamorreans",
  "/wiki/File:FennecShand-TMH.png",
  "/wiki/MK_sniper_rifle",
  "/wiki/Stock",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Helmet",
  "/wiki/Standard_week",
  "/wiki/File:FennecShandBTS.jpg",
  "/wiki/Chapter_5:_The_Gunslinger",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/December_6",
  "/wiki/Ming-Na_Wen",
  "/wiki/Ming_Qiu",
  "/wiki/Lauren_Mary_Kim",
  "/wiki/November_4",
  "/wiki/May_4",
  "/wiki/Brian_Matyas",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Rampage_(episode)",
  "/wiki/Reunion",
  "/wiki/The_Bad_Batch:_Hunted!",
  "/wiki/Common_Ground",
  "/wiki/Bounty_Hunters_8",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/The_Mandalorian_5",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/Chapter_14:_The_Tragedy",
  "/wiki/Chapter_15:_The_Believer",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/The_Mandalorian:_The_Rescue",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/The_Book_of_Boba_Fett_Junior_Novel",
  "/wiki/LEGO_STAR_WARS:_Celebrate_the_Season",
  "/wiki/Scary_Starship",
  "/wiki/Disney_Magic_Kingdoms",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Fennec_Shand",
  "/wiki/Category:Images_of_Fennec_Shand",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Technology",
  "/wiki/Score",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/The_Star_Wars_Archive",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/StarWarsKids.com",
  "/wiki/A_Galaxy_On_Your_Doorstep",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Mando_Mania",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Mandalorian",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_8",
  "/wiki/Pilots_and_Crew",
  "/wiki/Star_Wars_Ships_and_Vehicles_9",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/The_Fett_Family%27s_Finest",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/2021_Topps_Star_Wars:_The_Bad_Batch_Exclusive_Set",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Inside_Intel:_Mandalorian_Armor",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_Two)",
  "/wiki/LEGO_Star_Wars:_The_Book_of_Boba_Fett",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars_Insider_212",
  "/wiki/Star_Wars:_The_Secrets_of_the_Bounty_Hunters",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Databank_(website)",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Stormtrooper_Corps",
  "/wiki/War-Mantle",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Return_to_Kamino",
  "/wiki/Kamino_Lost",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Chapter_9:_The_Marshal",
  "/wiki/Chapter_13:_The_Jedi",
  "/wiki/Chapter_8:_Redemption",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020",
  "/wiki/File:MingNaWen-FennecShand-May-4-2020.png"
 ]
}