{
 "name": "Ferav",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Ord Mantell Orbital Station"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ferav was a Human male Sith Inquisitor who served the reconstituted Sith Empire during the Cold War with the Galactic Republic. A servant of the Sith Lord Darth Angral, Ferav accompanied Angral to the Ord Mantell Orbital Station in 3643 BBY to interrogate the Jedi Padawan Kira Carsen as to the whereabouts of her master, the Jedi Knight who killed Angral's son Tarnis. When Angral's other retainers departed to the planet Corellia, Ferav remained behind with Carsen as his captive while waiting for a shuttle to the Imperial capital Dromund Kaas, and the Inquisitor was surprised when the Knight arrived on the space station not long afterwards. However, Ferav and his Imperial soldiers were unable to defeat the Knight in battle, and the Sith was cut down along with his men.\nA Human male, Ferav was trained in the ways of the dark side of the Force and became a Sith Inquisitor in the Sith Empire by the time of the Cold War with the Galactic Republic, and he soon became a retainer of the more powerful Sith Lord Darth Angral. In 3643 BBY, Angral's son Tarnis was killed by a young Jedi Knight, and a furious Angral promptly declared war on the Republic and the Jedi Order in response. When Imperial Intelligence identified Kira Carsen, the Jedi Knight's apprentice, on the Ord Mantell Orbital Station above the planet of Ord Mantell, the Sith Lord and his retainers were over twenty parsecs away. Despite this, Angral ordered her capture and immediately set off for the space station with Ferav, Admiral Hacklin of the Imperial Navy, and several of Angral's other retainers in order to interrogate the Padawan. However, Carsen resisted the interrogation and was able to convince Angral that her master was in fact on the planet Corellia, when the Knight was really down below on Ord Mantell with the astromech droid T7-O1, raiding an Imperial listening post in order to learn Angral's plans.\nSatisfied, Angral sent his forces to Corellia while he departed with Admiral Hacklin in order to oversee the installation of the Desolator superweapon on Angral's warship Oppressor. The Sith Lord left Ferav behind with Carsen, two Imperial soldiers, and two Sith Acolytes in the airlock to the Knight's ship so that Carsen could be picked up by a transfer shuttle that would take her to the Imperial capital of Dromund Kaas for further interrogation. Ferav was explicitly ordered not to kill Carsen, though that did not stop him from threatening the Padawan's life in order to force cooperation when the Knight and T7-O1, or Teeseven, arrived in the airlock. However, Carsen called his bluff, informing her master of Angral's orders to the contrary, and Ferav pushed the bound Padawan to the side before drawing his lightsaber and ordering his men to attack the Knight and Teeseven. Despite the Imperials' advantage of numbers, Ferav and his allies were unable to defeat the Jedi and the droid, and the Inquisitor was soon killed along with all four of his subordinates.\nFerav had red eyes and fair skin, though the right side of his face featured a number of scars across his cheek. He was bald and wore a set of hooded robes that were black and gray in color. The Inquisitor was arrogant and confident in the superiority of his abilities, and was willing to use deception in order to force a favorable outcome when presented with an opportunity to do so. Ferav was unable to understand why members of the Jedi Order were willing to give up their lives for others, and he saw their sense of duty to the greater galaxy as misguided and futile.\nA Sith Inquisitor, Ferav carried a single red-bladed lightsaber in combat, and he made use of storms of Force lightning against his opponents in battle.\nFerav first appeared in Star Wars: The Old Republic, a video game released by BioWare and LucasArts. Players of the Jedi Knight class encounter him in the last stages of the mission \"New Intelligence,\" where he and his men block the path back to the player's ship aboard the Ord Mantell Orbital Station after the Knight returns from the mission to Ord Mantell's surface. Regardless of dialogue choices, Ferav will attack the player and be killed in the resulting fight.\nIf the Jedi Knight is male, when asked by Ferav why he would risk his life for Kira Carsen, he has the option to hint to Feral that he is in love with the girl. Ferav is intrigued by the Knight's infatuation with Kira and expresses regret on having to kill him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3643_BBY",
  "/wiki/Ord_Mantell_Orbital_Station",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith_Inquisitor",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Angral",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Kira_Carsen",
  "/wiki/Hero_of_Tython",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Death/Legends",
  "/wiki/Tarnis_(Sith_Lord)",
  "/wiki/Planet/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/Space_station/Legends",
  "/wiki/Imperial_soldier",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Time/Legends",
  "/wiki/Desolator_crisis",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Parsec/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Hacklin",
  "/wiki/Imperial_Navy_(Sith_Empire)",
  "/wiki/Astromech_droid/Legends",
  "/wiki/T7-O1",
  "/wiki/Mission_to_Ord_Mantell_(Desolator_crisis)",
  "/wiki/Imperial_Listening_Post",
  "/wiki/Desolator_(superweapon)",
  "/wiki/Superweapon/Legends",
  "/wiki/Oppressor_(Harrower-class)",
  "/wiki/Sith_Acolyte",
  "/wiki/Airlock/Legends",
  "/wiki/Hero_of_Tython%27s_Defender-class_light_corvette",
  "/wiki/Shuttle/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Eye/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}