{
 "name": "Feresk_Tssat",
 "display_name": "Feresk Tssat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Trandosha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Cream"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Feresk Tssat's clan",
      "Alliance to Restore the Republic",
      "New Republic",
      "Vanguard Squadron",
      "Vanguard Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Feresk Tssat, nicknamed \"Frisk,\" was a Trandoshan male pilot who flew for the New Republic's Vanguard Squadron. Frisk predominantly flew a BTL Y-wing starfighter. The squadron served in the Bormea sector around 5 ABY, but soon traveled to the planet Troithe to assist General Hera Syndulla's Barma Battle Group against the Galactic Empire's 204th Imperial Fighter Wing. When the fighter wing launched a bulk freighter in an attempt to escape, Tssat, one of Syndulla's pilots, asked Wyl Lark where the squadron commander wanted Vanguard Squadron. The 204th ultimately escaped the battle despite the efforts of the New Republic's forces.\nAt some point during Feresk's life, he worked as a smuggler who acquired valuable objects for paying clients. When Feresk, by his own accounts, accidentally procured a counterfeit painting for an Imperial governor, who in turn showed it to Admiral Thrawn, a death mark was placed on Feresk's head, forcing him to find sanctuary with the Alliance to Restore the Republic.\nDuring the Galactic Civil War, Feresk Tssat served as a pilot in the New Republic's Vanguard Squadron. Around 5 ABY, the squadron was on a special assignment in the Bormea sector to help improve the New Republic's starship supply. General Hera Syndulla brought some forces to assist Vanguard Squadron, but soon received news that her own battle group had been devastated by the Galactic Empire's 204th Imperial Fighter Wing during its campaign in the Cerberon system. Syndulla subsequently took Vanguard Squadron, Tssat included, and the squadron's headquarters, the MC75 Star Cruiser Temperance, to the Cerberon system, where some of her battle group's remaining forces were fighting the 204th at the planet Troithe.\nThe squadron engaged the fighter wing, which soon launched a bulk freighter from the surface of Troithe in an attempt to escape. As one Vanguard pilot reported a 204th squadron seemingly docking into the freighter, Tssat asked Wyl Lark,a senior pilot from Syndulla's remaining forces, where the squadron commander wanted Vanguard Squadron. Lark attempted to make the fighter wing surrender, but chose to have the New Republic forces pursue the bulk freighter when the enemy did not comply. Ultimately, the 204th launched missiles to distract the New Republic, and the fighter wing escaped aboard the freighter while under pursuit from Vanguard pilots.\nFeresk was a Transdoshan male with pale pink scales and orange eyes. He wore a blue flight suit with a standard New Republic helmet. His helmet had blue trim and orange Alliance logos on the front half of each side. Feresk wasn't shy about his loyalties and desires to make credits, but in a dogfight he was always dedicated to his fellow squadron pilots.\nFeresk Tssat was created for the video game Star Wars: Squadrons, released on October 2, 2020. Tssat was voiced by James Arnold Taylor. The character was first pictured in the reveal trailer for Star Wars: Squadrons on June 15, 2020 and first appeared, albeit only through voice, in the novel Shadow Fall, written by Alexander Freed and published on June 23, 2020. While the novel only provided the name Tssat, Star Wars: Squadrons identified his forename and nickname of \"Frisk.\"\nSquadrons writer Joanna Berry, who was responsible for conceiving the concept and characters, wanted to have a Trandoshan scoundrel character in the game based on a fondness for the species that she attributed to having written the Trandoshan Qyzen Fess in the online role-playing game Star Wars: The Old Republic. Berry stated that the nature of Squadrons required the characters to be distinct while also maintaining a balance of character types within the squadron.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Trandoshan",
  "/wiki/New_Republic_pilot",
  "/wiki/Star_Wars_Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Frissk",
  "/wiki/The_Light_You_Bring",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Trandosha",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Albinism",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/New_Republic",
  "/wiki/Vanguard_Squadron",
  "/wiki/BTL_Y-wing_starfighter",
  "/wiki/Squadron",
  "/wiki/Bormea_sector",
  "/wiki/5_ABY",
  "/wiki/Planet",
  "/wiki/Troithe",
  "/wiki/Attack_on_Troithe",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Barma_Battle_Group",
  "/wiki/Galactic_Empire",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Fighter_wing",
  "/wiki/Bulk_freighter",
  "/wiki/Pilot",
  "/wiki/Wyl_Lark",
  "/wiki/Squadron_commander",
  "/wiki/Smuggler",
  "/wiki/Painting",
  "/wiki/Governor",
  "/wiki/Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Death_mark",
  "/wiki/Galactic_Civil_War",
  "/wiki/Starship",
  "/wiki/Attack_on_Cerberon",
  "/wiki/Campaign_in_the_Cerberon_system",
  "/wiki/Cerberon_system",
  "/wiki/MC75_Star_Cruiser",
  "/wiki/Temperance",
  "/wiki/Star_system",
  "/wiki/Battle_group",
  "/wiki/Freighter",
  "/wiki/Video_game",
  "/wiki/October_2",
  "/wiki/2020",
  "/wiki/James_Arnold_Taylor",
  "/wiki/June_15",
  "/wiki/Shadow_Fall",
  "/wiki/Alexander_Freed",
  "/wiki/June_23",
  "/wiki/Joanna_Berry",
  "/wiki/Qyzen_Fess",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Electronic_Arts",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Endor",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Time"
 ]
}