{
 "name": "Ferroda",
 "display_name": "Ferroda",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Cato Neimoidia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pantoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ferroda was a male Jedi Master who served the Jedi Order and the Galactic Republic as a General in the Grand Army of the Republic during the Clone Wars. He was killed during Order 66 by Force-sensitive clone trooper X2 on the planet of Cato Neimoidia.\nA Force-sensitive, Ferroda was trained in the ways of the Force by the Jedi Order, eventually attaining the rank of Jedi Master after constructing a green-bladed lightsaber. When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Master Ferroda took up the rank of General in the Grand Army of the Republic and was assigned to oversee the clone troopers garrisoned on Tatooine. Overseeing the training on the desert world, Ferroda became acquainted with the twin Force-sensitive clones X1 and X2 when Tatooine was attacked by the Separatists. The clones were successful in defeating the droid forces of the Separatists, repelling the Separatist leadership and securing the world by the end of the battle.\nAs the war toiled on, Master Ferroda was reassigned to Cato Neimoidia where he was under the command of High Council member Plo Koon. During the fighting, Republic Supreme Chancellor Palpatine, revealed to be a Sith Lord, began eradicating the Jedi by initiating Contingency Order 66, turning the clones against the Jedi. Ambushed during the fighting, Ferroda encountered X1 and X2 once again. X1 attempted to kill Ferroda but was injured by his lightsaber. X2 grew angry at Ferroda and tried to kill him, trapping the blue-skinned Jedi in a Neimoidian building and executing him.\nAfter Master Ferroda's death his executioner, X2, regretted his decision of following orders and disavowed his ties with the newly formed Galactic Empire. Laying low for a time, X2 eventually joined the Alliance to Restore the Republic during the Galactic Civil War after he was found on Dantooine by General Rahm Kota.\nMaster Ferroda was originally created for the cancelled Star Wars: Battlefront III from Free Radical Design. He would instead go on to be used 2009 video game Star Wars Battlefront: Elite Squadron. His species is never stated in the game, though with blue skin and yellow markings he remarkably resembles the Pantoran  this was also confirmed in 2021, when Rich May  stated that they didn't had an official word about it , but that the original textures certainly had the yellow markings distinctive of a Pantoran.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Cato_Neimoidia/Legends",
  "/wiki/Pantoran",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/X2",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/X1",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Invasion_of_Tatooine",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Battle_of_Cato_Neimoidia_(Order_66)",
  "/wiki/Neimoidian/Legends",
  "/wiki/Platoon/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Rahm_Kota/Legends",
  "/wiki/Star_Wars:_Battlefront_III",
  "/wiki/Free_Radical_Design",
  "/wiki/2009",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Battlefront:_Elite_Squadron",
  "/wiki/Pantoran/Legends",
  "/wiki/Notluwiski_Papanoida/Legends",
  "/wiki/March_5",
  "/wiki/2021"
 ]
}