{
 "name": "Feyet_Kiez",
 "display_name": "Feyet Kiez",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "10 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Navy1st Sector Army",
      "Imperial Navy",
      "1st Sector Army",
      "Dark Empire"
     ]
    }
   ]
  }
 ],
 "content": "Feyet Kiez was a human male who served in the Galactic Empire's Starfleet.\nKiez was promoted to the rank of Admiral just before the Battle of Yavin. He was given command of the Empire, the very first Imperial II-class Star Destroyer, and assigned to patrol hyperspace lanes in search of Rebel Alliance supply convoys and medical ships.\nAdmiral Kiez was later placed in command of the 1st Sector Army, also known as Azure Hammer Command, with the Executor-class Star Dreadnought Whelm as his flagship.\nFollowing the Battle of Endor, the New Republic advanced into the Core Worlds and captured Coruscant in 6 ABY. Kiez's command at Anaxes became one of the few Imperial fortress worlds remaining in the Core, and held out long after the defeat of Warlord Zsinj. In 8 ABY, however, Kiez was contacted by the resurrected Emperor Palpatine on his Deep Core redoubt of Byss. Palpatine summoned Kiez into the Deep Core, where he was assembling forces for a new campaign to reconquer the galaxy. Kiez absconded from Anaxes with the Whelm, leaving his second-in-command, Osted Wermis, none the wiser about his destination. The linchpin of his defenses gone, Wermis surrendered the Axum system to the New Republic shortly afterwards.\nKiez's disappearance, along with the disappearance of the Imperial warlord-turned-pirate Inos Fonada and his fleet down the Corellian Trade Spine, the loss of the weapons designers with their schematics at the Imperial research facility on Kelada, and the disappearance of the entire senior Kuat Drive Yards design team aboard the Eclipse after the taking of Kuat, alarmed New Republic Intelligence. They believed that a new warlord had successfully unified the Deep Core. However, Kiez and other reports were mostly forgotten about in the chaos of the Thrawn campaign. Kiez's destination would not be uncovered until a few months after Thrawn's death, when the Whelm was at the spearhead of three large fleets originating from Byss.\nAdmiral Kiez was killed when the Whelm was destroyed in battle with the Panthac over Alsakan during the Imperial Civil War.\nKiez served within the Imperial Navy within the Galactic Empire. Just before the Battle of Yavin, Kiez would be promoted to the rank of Admiral.\nPrior to his promotion to Admiral, Kiez was given command of the prototype Imperial II-class Star Destroyer Empire. He would be assigned to patrol several hyperspace lanes in a search for Alliance to Restore the Republic supply convoys, medical ships, and military staging areas.\nWith several victories of ambushing staging areas, Kiez would be given command of the 1st Sector Army based in the core worlds on the galaxy. He would become the commanding officer of the Executor-class Star Dreadnought Whelm.\nFollowing the Battle of Endor, the New Republic's advance on the Empire would result in the loss of the Imperial Center in 6 ABY. Kiez would still command fortress worlds within the center of the galaxy, and Anaxes still served as a major Imperial base.\nWith the death of Warlord Zsinj after his defeat, Kiez would keep out of the return of Chiss Grand Admiral Thrawn, who was within the Unknown Regions maintaining his shadow empire, would had begun his campaign against the New Republic.\nIn 9 ABY, Following the recent defeat of Thrawn, Kiez would be contacted by the resurrected Emperor Palpatine. He told Kiez to go to Byss, located within the Deep Core, were he had sent years building up a massive military. Kiez would move away from Anaxes, leaving the planet within the Whelm. This allowed his second in command, Osted Wermis, to surrender Anaxes to the New Republic.\nKiez was killed when the Whelm was destroyed in battle with the Panthac over Alsakan during the Imperial Civil War.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/10_ABY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/First_Army",
  "/wiki/Dark_Empire",
  "/wiki/Admiral/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Empire_(Imperial_II_prototype)",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Whelm",
  "/wiki/Flagship/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Liberation_of_Coruscant_(Galactic_Civil_War)",
  "/wiki/6_ABY/Legends",
  "/wiki/Fortress_world",
  "/wiki/Hunt_for_Zsinj",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/8_ABY/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Deep_Core/Legends",
  "/wiki/Byss/Legends",
  "/wiki/Pre%E2%80%93Shadow_Hand_campaign",
  "/wiki/The_galaxy/Legends",
  "/wiki/Osted_Wermis",
  "/wiki/Axum_system",
  "/wiki/Inos_Fonada",
  "/wiki/Corellian_Trade_Spine/Legends",
  "/wiki/Kelada/Legends",
  "/wiki/Kuat_Drive_Yards/Legends",
  "/wiki/Eclipse_(Eclipse-class)",
  "/wiki/Taking_of_Kuat",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Thrawn_campaign",
  "/wiki/Panthac_(dreadnought)",
  "/wiki/Alsakan/Legends",
  "/wiki/Imperial_Civil_War",
  "/wiki/Medical_ship",
  "/wiki/1st_Sector_Army",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/6_ABY",
  "/wiki/Fortress_worlds",
  "/wiki/Anaxes/Legends",
  "/wiki/Death/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Empire_of_the_Hand",
  "/wiki/9_ABY/Legends",
  "/wiki/Deep_Core",
  "/wiki/Starships_of_the_Galaxy",
  "/wiki/The_Essential_Guide_to_Warfare"
 ]
}