{
 "name": "Feyn Gospic",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Massassi Group",
      "Massassi Group"
     ]
    }
   ]
  }
 ],
 "content": "Feyn Gospic was a human male who served within the Alliance to Restore the Republic, holding the military rank of colonel within the Alliance Military's Massassi Group during the Galactic Civil War. Colonel Gospic, alongside General Jan Dodonna, Major Lajaie, and others, immediately began to examine the Death Star plans stored within the Rebel droid R2-D2 once it arrived on the Millennium Falcon. In the subsequent Battle of Yavin against the Galactic Empire, Colonel Gospic used a monitor within the command center alongside other Alliance leaders.\nThe human male Feyn Gospic held the military rank of a colonel in the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. In 0 BBY, he was stationed in the Great Temple headquarters of the Alliance's Massassi Group on the moon Yavin 4 when the YT-1300 light freighter known as the Millennium Falcon arrived carrying the plans to the Empire's Death Star superweapon. Gospic, General Jan Dodonna, Major Lajaie, and others, then immediately began examining the plans, which had been stored in the astromech droid R2-D2, in order to find a way in which the battle station could be destroyed.\nThe Alliance soon discovered a vulnerability in the Death Star's design that had been purposefully created by the scientist Galen Erso and would allow the weapon to be destroyed. The Death Star then arrived in the Yavin system to destroy the Alliance, and several squadrons of Alliance starfighters were deployed to try and eliminate it before it could use its superlaser. During the ensuing battle, Gospic worked at a monitor station within the command center of the great temple where the Alliance's strategists were providing tactical support to the starfighter squadrons. Ultimately, the Alliance successfully destroyed the Death Star and then completely evacuated their Yavin base.\nFeyn Gospic had fair skin and brown hair.\nDuring the Battle of Yavin, Gospic wore a gray jumpsuit and a headset.\nFeyn Gospic first appeared in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. The character was first identified in the new Star Wars canon in \"The Rise of the Rebellion and the Battle of Yavin\", an encyclopedia published by De Agostini on March 9, 2021. The name originated in the Star Wars Legends continuity, where it was first used on a card in the 1998 \"Special Edition Limited\" set of the Star Wars Customizable Card Game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Feyn_Gospic",
  "/wiki/Feyn_Gospic/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Massassi_Group",
  "/wiki/Military_rank",
  "/wiki/Colonel",
  "/wiki/Alliance_Military",
  "/wiki/Galactic_Civil_War",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Major",
  "/wiki/Lajaie",
  "/wiki/Death_Star_plans",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/Millennium_Falcon",
  "/wiki/Battle_of_Yavin",
  "/wiki/Galactic_Empire",
  "/wiki/0_BBY",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/YT-1300_light_freighter",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Astromech_droid",
  "/wiki/Battle_station",
  "/wiki/Death_Star",
  "/wiki/Scientist",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Yavin_system",
  "/wiki/Squadron",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Superlaser",
  "/wiki/Starfighter",
  "/wiki/Hair",
  "/wiki/Jumpsuit",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars",
  "/wiki/The_Rise_of_the_Rebellion_and_the_Battle_of_Yavin",
  "/wiki/De_Agostini",
  "/wiki/March_9",
  "/wiki/2021",
  "/wiki/Star_Wars_Legends",
  "/wiki/1998",
  "/wiki/Special_Edition_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/July_10",
  "/wiki/2020"
 ]
}