{
 "name": "Ffon_Althe",
 "display_name": "Ffon Althe",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Korriban"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Korriban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Harkun"
     ]
    }
   ]
  }
 ],
 "content": "Ffon Althe was a male Pureblood Sith Acolyte who served the the Sith Empire during the Cold War against the Galactic Republic. After Althe was brought to Korriban, Overseer Harkun presided over Althe's initial Sith training in the ways of a Sith Inquisitor on behalf of Lord Zash, who was looking for an apprentice.\nAlthe was afforded unfair advantages by Harkun, who believed the elevation of Force-sensitive members of the Empire's slave caste was harming the Sith cause. Despite this favoritism and his Sith blood, he was bested by a competing acolyte and executed by Lord Zash.\nProtégé of Overseer Harkun, Althe was given every advantage possible, and despite that and his considerable ability he was outperformed by a fellow Acolyte, who was slave caste and eventually favored by Lord Zash. During his training, Ffon was many times asked by Harkun to showoff his powers and scare the other acolytes. In one of these times, he even executed his fellow acolyte, Gerr with a burst of Force lightning.\nFor his final trial he and his fellow Acolyte were sent into Naga Sadow's tomb to bring back a map to present to Lord Zash. Harkun, eager to give Althe every advantage possible, gave him a head start. Unfortunately for Ffon, Zash arrived shortly thereafter and briefed the remaining Acolyte on information regarding the tomb's contents she had only just discovered. Zash saw no reason to recall Althe to give him the same information, since he had been shown favoritism from the start, and not from her.\nAlthe failed his final task while his slave-caste peer succeeded, with the help of the ancient Dashade servant of Tulak Hord, Khem Val. Not willing to give up, Harkun took the map off the acolyte and gave it to Althe, demanding he take credit for retrieving it. When the Pureblood acolyte presented the map to Zash, she was skeptical in believing Althe's apparent success. Instead she demanded the truth. In fear of Zash, Althe came clean and apologized for lying, but was still promptly executed by the Sith Lord. As Ffon died, Zash chided Harkun for his favoritism, speculating that Althe would have won if all the Acolytes had been treated fairly – or if she had not been the one they'd been competing for.\nFfon Althe was capable of Force lightning powerful enough to badly injure fellow acolyte Gerr.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Ffon_Althe",
  "/wiki/Korriban",
  "/wiki/3643_BBY",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Harkun",
  "/wiki/Overseer_(Sith)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Zash",
  "/wiki/File:LordZash-FfonAlthe-TOR.ogg",
  "/wiki/Sith_Acolyte",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_training",
  "/wiki/Sith_Inquisitor",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Darth_Nox",
  "/wiki/Gerr",
  "/wiki/Force_lightning/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Tomb_of_Naga_Sadow",
  "/wiki/Dashade/Legends",
  "/wiki/Tulak_Hord",
  "/wiki/Khem_Val",
  "/wiki/Death/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}