{
 "name": "Fideltin Rusk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mindor"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3682 BBY",
      "Mindor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chagrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light blue",
      "Dark grey lethorns"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Fideltin Rusk's first squad",
      "Surgeons",
      "301st Infantry",
      "Dead Man's Legion",
      "Fideltin Rusk's first squad",
      "Surgeons",
      "301st Infantry",
      "Dead Man's Legion",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Fideltin Rusk was a Chagrian male who served the Galactic Republic as a soldier in the Republic Military during the Great Galactic War, the Cold War, and the Galactic War with the reconstituted Sith Empire. Born in 3682 BBY and raised by a colony of pacifists on Mindor, the Chagrian enlisted in the military as soon as possible and became devoted to defending those who could not defend themselves. He soon gained a reputation as a determined and skilled commander with years of experience against the Empire, criminals, and pirates across a wide range of battlefields. He was considered a pariah by his fellows because of his belief that soldiers were meant to be used regardless of the consequences.\nDuring the tense Cold War with the Sith Empire, Sergeant Rusk was stationed with the 301st Infantry on the ice planet Hoth, where he battled both the Empire and the White Maw pirate organization. Around 3642 BBY, Rusk's unit was assigned to aid the Nautolan Jedi Leeha Narezz and the Jedi Knight known as the Hero of Tython in their mission to recover the plans for the Sith Emperor's space station. Together with the two Knights, Rusk and his squad fought both pirates and Imperials across the world's icy surface as they searched for the plans, and afterward the sergeant was assigned to the Hero's crew on a permanent assignment. Rusk accompanied the Knight and the other members of the crew to the Emperor's station, but they were imprisoned for months when the Hero and the other members of the Jedi strike team were turned to the dark side and trained as Sith.\nAfter the Emperor's Wrath, Lord Scourge, betrayed his Master to free the Hero and crew from the station, the Wrath revealed that the Emperor planned to consume all life in the galaxy as part of a dark ritual and joined the Jedi's crew in an effort to stop him. As the galaxy became consumed in renewed war, Rusk accompanied the Hero and the rest of the crew as they traveled to the planets Belsavis, Voss, and Corellia in order to stop the Emperor's agents from committing genocide and rescued the strike team members from their enemy's control. In a final showdown, Rusk and the rest of the crew fought the forces of the Empire on the Imperial capital of Dromund Kaas while the Hero and the astromech droid T7-O1 faced and defeated the Emperor in battle.\nTheir mission completed, the Hero and their five companions were awarded the prestigious medal known as the Cross of Glory by Grand Master Satele Shan, and Rusk continued to travel the galaxy with the group and aid those in need during the conflict. Following the Hero of Tython's disappearance during the Eternal Empire's invasion, the crew went their separate ways. Rusk returned to the Republic Military and was given command of the Dead Man's Legion, a regiment of conscripted convicts, which was dispatched to Nar Shaddaa by order of Supreme Chancellor Jebevel Madon to deal with the Black Sun syndicate.\nThe Chagrian Fideltin Rusk was born in 3682 BBY to a pair of Chagrians who lived in a colony of pacifists on the planet Mindor, but quickly began to rebel against his family's beliefs when he realized that the colony's pacifism allowed pirates and other enemies to take advantage of them. Rusk enlisted in the Republic Military as soon as he could, and became a skilled soldier who quickly rose to the rank of sergeant during the Great Galactic War with the Sith Empire. The first squad Rusk was assigned to included the Human Callan Grayne, and during one of their missions together Grayne lost his left leg and subsequently acquired a prosthetic. During the war, Rusk served in the Geonosis campaign with Durant, a man who would eventually become a general in Republic High Command.\nRusk's first assignment as a sergeant with his new squad was to liberate prisoners of war from a relatively undefended Imperial outpost; intelligence claimed that Imperial reinforcements would not arrive for another twenty-four hours. The Intelligence was incorrect—the prison was heavily guarded, and Rusk's squad was outnumbered ten to one. However, they fought against overwhelming odds and escaped successfully with the prisoners, with almost every member of the squad sustaining heavy injuries but with no fatalities among the prisoners or Rusk's unit. The Chagrian went on to consider the soldiers in his first squad to be the finest he had ever commanded, and he continued to serve with other units while his squadmates—including Karsim, Naja, and Eckerd—were recruited by General Elin Garza into the black ops program of the Republic Special Forces Division.\nAt some point during the war, Rusk defended a fortress on the planet Amador, and he single-handedly fought off dozens of Imperial soldiers while holding the building's single entrance. By the end of the battle, Rusk had killed so many enemies that he was able to build veritable walls from their bodies. While he was initially considered a remarkable commander and excellent soldier, it was not long before Rusk's commanding officers began to receive reports of recklessness from his fellows. He was soon considered a pariah by many of the military's top leaders, as his determination and loyalty to the Republic were overshadowed by what many considered to be reckless disregard for the lives of his soldiers. Republic High Command soon began to keep a tally of the number of credits that Rusk's victories cost the government, and, by 3642 BBY, it was well over 70,000,000. During his career, Rusk faced a total of twelve military tribunals over charges ranging from accusing his superior officer of cowardice to reckless endangerment of an entire flagship.\nWhile Rusk was acquitted each time and given a medal, he was denied a promotion—and while other soldiers gained recognition and commendations, he was passed over and remained a sergeant personally leading squads into battle. He soon gained the unofficial call sign \"Undertaker\" as a result of the number of casualties among both his subordinates and superiors; yet he continued to have an incredible success rate in his missions. Rusk's behavior worsened around the end of the war when he learned that his parents' colony had been wiped out by the Empire in 3650 BBY. Rusk's persistent attitude resulted in a series of assignments throughout the tenuous conflict known as the Cold War on remote and combat-heavy environments, often against heavy opposition.\nRusk spent the later part of the next decade on the remote ice planet of Hoth, where he was stationed as part of a detachment from the 301st Infantry. Still a sergeant, Rusk aided the forces of the Republic Military as they battled pirates from the White Maw organization. The Republic's main goal on the planet was salvage: the planet's icy atmospheric conditions preserved the wrecks of starships remarkably well, and the planet contained numerous wrecks. In 3665 BBY, the Hoth system had been the site of a massive space battle that had sent hundreds of Republic and Imperial starships crashing to the surface. As tensions rose and the Cold War's peace collapsed, leading to the start of the Galactic War, the Empire returned to Hoth and triggered a desperate scramble by the Republic to recover whatever remained of the technology and weapons that had been lost during the battle. The Empire's true goal was actually to tie down Republic resources in an unwinnable battle and thereby draw them out into open war, and the Republic obliged by continuing to funnel troops and supplies to the salvage effort.\nNot long after the Empire's arrival, Sergeant Rusk and the 301st Infantry received a special assignment from General Grayne around 3642 BBY. The unit would have been working with the Jedi Knight Leeha Narezz and another Knight—the one known as the Hero of Tython for actions during the recent conflict with the Sith Lord Darth Angral a year prior—in a classified mission about which the Jedi were not willing to share information. What Rusk was allowed to know was that they were searching for the Deference, a Pythar-class Imperial shuttlecraft that had belonged to an Imperial scientist before the man had been shot down during the battle over two decades prior. The two Knights were searching for the plans for the Sith Emperor's space station, a set of which had been aboard the Deference at the time of the crash.\nHowever, by the time the Hero and crew arrived on the planet at Aurek Base, the Republic's main command center, Rusk's unit had been sent on a mission to retrieve Imperial survey maps of the Starship Graveyard, and they had been pursued by the Imperials after securing the files. He and the other five members of his unit had been pinned down in an outpost belonging to Ortolan colonists in Crescent Canyon, with the Imperials using probe droids as weapons against the soldiers. The probe droids rapidly approached the Republic infantry and then detonated when they were close enough, making suicide runs in attempts to kill the entrenched soldiers.\nRusk's unit managed to send a distress signal to Narezz before their communications were jammed, and the Nautolan Jedi sent the recently arrived Hero to their rescue. The Knight and a companion stormed the outpost, quickly cutting through the attacking Imperials and removing the immediate threat to the 301st. The Hero then spoke briefly with Rusk and the only other survivor of his unit, Private Murtag, before the Jedi was forced to fight off a second wave of probe droids while the Chagrian defended his wounded subordinate. After the battle ended, Rusk escorted the injured Murtag to the nearest medcenter and informed the Knight that he would meet back up with the Jedi at Narezz's location with a new squad. Returning to Aurek Base after entrusting Murtag to medical droids, Rusk selected a new five-man squad consisting of Privates Edder, Reico, Vanth, Voshpar, and Dromol. However, on the way to Outpost Cresh to meet with the two Jedi, Rusk was contacted by Narezz with a new assignment. She revealed that an Imperial by the name of Guardsman Lassicar was hunting the two Jedi, planning to capture them, and she wanted to set a trap for him at the site of the shuttle. Narezz ordered Rusk and his men to wait for her signal to enter the caves where the shuttle had crashed.\nNarezz's plan worked perfectly—within moments of Lassicar's men arriving in the caves, Rusk and his men rappelled down through the cavern's ceiling and turned the odds in the two Jedi's favor. Together with the Hero's help, the squad won the fight and left none of Lassicar's troopers standing. However, Rusk's inexperienced squadmates quickly turned to bickering among themselves, causing the Chagrian to order his subordinates to stand down and cease their insubordination. The Hero came to Rusk's aid, reminding the squad how it was their duty to put aside emotion in battle and do their duty to the Republic—a speech with which the sergeant agreed wholeheartedly. Meanwhile, Narezz had discovered an Imperial scientist by the name of Urrisov hiding in the remains of the Deference, and Rusk immediately began to aggressively interrogate the scared, young Human.\nThe Hero intervened and calmly convinced Urrisov to tell the group what they needed to know. The Jedi and the soldiers were dismayed to learn that the White Maw pirates had reached the Deference first and stolen the shuttle's databank—which had contained the fortress plans sought by the Jedi. From his encounters with the pirates during his service on Hoth, Rusk knew that the pirates moved all of their scavenged material through the wrecked dreadnaught Star of Coruscant deep in the Starship Graveyard, a region where many of the ships had crashed.\nThe pirate depot in the wreck was protected by a ray shield that was powered by two generators, and the Hero departed to take out one of the reactors while Rusk's squad traveled to the other facility. Before their attack, Rusk and his men were ordered by General Grayne to eliminate the White Maw's munitions stockpiles nearby, and Rusk contacted the Knight to inform the Jedi of the additional mission. The 301st were successful in completing their assignment, although Vanth and Voshpar sustained minor injuries. They then rendezvoused with Narezz and the Hero at Outpost Zerek near the Graveyard.\nThere, Rusk began to plan the attack with Narezz and the other Knight. The databank for which they were searching was located near the center of the dreadnaught, but there was a problem—Imperial and White Maw forces were battling for control of the ship, so both groups had strike teams at either end of the vessel. Thinking it over, Rusk believed that his men would have a better chance against the pirates—the undisciplined criminals were more likely to panic when under attack than the Imperials. While the two groups engaged their enemies, Narezz and an ME-D droid would retrieve the databank, so the three teams set off through the Graveyard. Fighting through the White Maw forces that controlled the region, Rusk's unit headed to the fore section of the Star and cleared a path through the wrecked dreadnaught to the fore hangar bay. Within the hangar, Rusk and his men fought the White Maw strike force and killed their Gen'Dai leader, Zeshatt, escaping with no casualties.\nRusk and his victorious unit returned to Outpost Zerek, where they took landspeeders back to Aurek Base to meet with a successful Narezz and the Hero. There, the Chagrian was also surprised to learn from Grayne that he was permanently being assigned to the Jedi Knight's squad, as the 301st was being rotated back to the Republic capital of Coruscant. Rusk took his place among the Hero's crew, meeting the other members of the team: the wise-cracking medic Doc, the astromech droid T7-O1, and Kira Carsen, the former Padawan of the Hero.\nHaving completed their assignment on Hoth, the group departed aboard their Defender-class light corvette to return to the Jedi Order's homeworld of Tython, where the Hero met with the Jedi High Council. Rusk and the others joined the Hero's mission to infiltrate the Emperor's space station, but remained on the ship as the Hero and Carsen disembarked to meet the other members of their strike team—Narezz and the Jedi Masters Tol Braga and Warren Sedoru. However, events took a turn when the Emperor dominated the minds of the Jedi, turning them to the dark side and making them his servants.\nCaptured by the Emperor's guards, Rusk spent several months imprisoned with Doc, T7-O1, and Carsen while the Hero underwent training as a Sith. However, when the Knight was freed from the Emperor's control by the Force ghost of the Jedi's former Master, Orgus Din, Rusk was rescued from his cell byLord Scourge, the Emperor's Wrath. Despite being a Sith, the Wrath pledged his loyalty to the Hero, and accompanied the crew back to Tython, where he explained that the Emperor was planning to consume all life in the galaxy through a dark ritual. He had foreseen that only the Hero of Tython would be able to defeat his former Master, for which reason he allied himself with the Knight.\nWith Scourge as an uneasy ally, the Hero and crew traveled to the prison planet of Belsavis, where they worked to stop a fanatical Imperial officer by the name of Executor Krannus from detonating the planet's core and killing everyone on-world. Rusk and the others then accompanied the Knight to the Korriban's Flame space station, where the Jedi fought and redeemed a corrupted Narezz. The group's next mission was to the planet Voss, where the group battled the Sith sorcerer Lord Fulminiss and prevented him from releasing the malevolent entity known as Sel-Makor. After successfully stopping Sel-Makor from unleashing a plague of homicidal madness upon the world, Rusk and the Hero's allies fought the fallen Master Sedoru when he captured the Republic cruiser Valiant.\nWhen the Hero was appointed Supreme Commander of all Jedi forces in the Battle of Corellia, Rusk and the crew accompanied the Knight to the contested world. Joining forces with the Republic Military under General Var Suthra, the Knight led Jedi in battles across the capital of Coronet City as the fallen Master Braga attempted to massacre hundreds of innocents in an attempt to start the Emperor's ritual. Finally defeating and redeeming the Jedi Master in a battle above the city's government district, the group prepared to stage a final assault upon the Emperor while Grand Master Satele Shan and several of the Hero's companions launched an attack on the Imperial capital of Dromund Kaas.\nTogether with T7-O1, the Hero managed to strike down the Emperor in a final duel. Rusk was awarded the Cross of Glory, the Republic's highest honor, along with the rest of the Hero's crew by Grand Master Shan on the Valiant. Although the threat of the Emperor was ended, the galaxy was still consumed in war, so the Hero and crew continued to travel from planet to planet aboard their ship, aiding those in need. During his tenure with the Hero, Rusk investigated the fates of his original squad members, and was dismayed to learn that the Surgeons, as they had renamed themselves, had been arrested for war crimes—instead of simply targeting top Imperial leaders as they had been ordered, the group had begun targeting the Imperials' families as well. As a result, General Garza was forced to imprison them on Berrun, where each member served life sentences.\nRusk continued to serve under the Hero of Tython's command for several years until the Jedi Master disappeared around the year 3636 BBY, the same time that the Eternal Empire of the planet Zakuul invaded both the Empire and the Republic. Like the rest of the Hero's crew, Rusk spent time searching for the missing Jedi, but eventually returned to military service amidst the Sith Empire and Republic's battle with and eventual capitulation to the Eternal Empire.\nBy 3629 BBY, Rusk had been promoted to the rank of Provost Marshal and given command of the Dead Man's Legion, a military police unit that consisted of criminals forcibly conscripted into service. Under the orders of Supreme Chancellor Jebevel Madon, the Dead Man's Legion was deployed on the moon Nar Shaddaa, where they claimed part of the Ternion Building as Republic territory under the Makeb treaty with the Hutt Cartel. Using that area as a base, Rusk's men pursued members of the Black Sun criminal syndicate that had fled the Legion's campaign against them on Coruscant, and he was engaged in that conflict when he was approached by the Outlander, the leader of the Alliance against Zakuul, with the offer of joining the Alliance. The Commander had been informed of Rusk's location by the former Republic admiral Bey'wan Aygo, and arrived just as Rusk was reprimanding his subordinate Merghal.\nA blue-skinned Chagrian male with blue eyes and dark grey lethorns, Fideltin Rusk began to chafe under his family's pacifist ideals when he realized that they allowed others to take advantage of them. At the first chance, he enlisted in the Republic Military and quickly found his calling as a soldier on the front line. Rusk believed that peace was only worth having if it was fought for, and despised the Sith Empire for crushing the liberties of innocent civilians. He viewed that soldiers were meant to be used, and that while their loss did hurt the Republic, not using soldiers to their full potential was a waste of resources. Rusk's view led him to despise insubordination, making him become furious whenever any of his subordinates questioned his orders.\nWhile his determination and drive to defend the Republic was praised by many, Rusk's consistently high casualty rates gave him a bad reputation among the military's leaders. His apparent disregard for the safety of his men was misunderstood by those who did not know him, so he seemed to take reckless and unnecessary risks in his assignments—a trait that only increased after the death of his parents. However, while Rusk was viewed by many as a loose cannon in the field, not even his fellow soldiers could deny that the sergeant's presence on any mission almost certainly guaranteed success. The Chagrian greatly respected his original squad and was dismayed to learn that they had overstepped boundaries during their time in the Republic Special Forces.\nWhile Rusk opposed the Empire with all his might, both him and the Hero agreed that women and children—innocents—should never be targeted. Unlike his former squadmates, he knew where the line was and when to stop. However, in the absence of the Hero of Tython's influence after the Jedi disappeared, Rusk willingly embraced the martial leadership of Chancellor Leontyne Saresh and her successor Madon, and was more than willing to lead a unit of criminals who he forcibly conscripted into service.\nA military man, Rusk applied a mindset of statistical efficiency to much of his life, and frequently referred to things such as combat readiness, casualty rates, and tactical advantages in the form of percentages. He greatly respected the Jedi Order for their devotion to the Jedi Code, and believed that the Republic Military would be far better off if they adopted the Order's teachings on internal peace and setting aside emotions during battle. He also greatly appreciated being given a challenge with seemingly impossible odds, such as the defeat of the Sith Emperor, as he believed that wars were won by meaningful sacrifices on behalf of those fighting for the right causes. Rusk's military mindset often crossed over into his sleeping hours, and Doc occasionally found the sergeant cleaning his weapons while sleepwalking.\nA trained member of the Republic Military, Rusk was officially classified as a heavy-armored ranged artillery specialist, proficient with both standard blaster rifles and many types of heavy weaponry. He was an experienced commander, having spent decades of his career leading squads into battle, although Rusk's superiors had a low opinion of the high casualty rates that his units suffered.\nAs a member of the 301st Infantry on Hoth, Sergeant Rusk wore a standard set of solid white Republic trooper armor with light blue markings over a black jumpsuit, although he would utilize various armor sets in different environments while accompanying the Hero of Tython. His Chagrian physiology prevented him from wearing a standard helmet, so he chose to forgo it and allowed his lethorns to hang freely. Although he was trained to use many types of heavy weaponry, Rusk wielded a standard-issue blaster rifle while assigned to the 301st Infantry. When he was transferred to the Hero of Tython's crew, the sergeant chose to requisition a heavy repeating blaster cannon, which he carried strapped to his back when it was not in use. He also utilized thermal grenades and weapon attachments that allowed him to fire charged beams of energy at opponents.\nFideltin Rusk first appeared in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare and LucasArts in 2011. First mentioned in an entry on the Holonet portion of the game's website, Rusk is a companion character for the Jedi Knight class; he appears in-game as \"Sergeant Rusk\" and is acquired after completion of the class storyline on Hoth during Act II. Rusk is voiced by Ron Yuan. In The Old Republic, players can gain or lose affection with companion characters depending on their actions and decisions. Rusk gains affection when the player kills Imperials, protects the Republic, and motivates others to fight. However, he loses affection when the player avoids fights, shows weakness, or disrespects authority. Rusk was created and written into the Knight storyline by BioWare writer Hall Hood, and Mary Kirby wrote Rusk's companion conversations. Hood was inspired by Michael Ironside's character in the movie Starship Troopers while creating Rusk, and his original idea for the character included Rusk as a Chagrian.\nAs a companion character, Sergeant Rusk is one of six characters that can be utilized by player characters. Unlike companions such as T7-O1 and Kira Carsen, he is not required to accompany the player character on any class missions. Therefore, this article assumes that only one of the companions accompanies the Knight on the class missions but does not specify which one. Also, as a Republic character, the Jedi Knight is assumed to be a light side character, and therefore the Hero of Tython, the in-game title for the character, is assumed to choose only options that result in the maximum light side points.\nThe final mission on Hoth has two possible paths: the first, \"The Imperial Guard,\" has the player fight Lassicar and his men in the aft section of the Star of Coruscant, while the second, \"The White Maw,\" has the Jedi fight Zeshatt and the pirates in the fore section. Whichever mission the player chooses, Rusk will complete the other, but his squadmates will be killed against the highly-trained Imperials, and the Knight will only go after the White Maw out of vengeance. Therefore, this article assumes that the Knight allowed Sergeant Rusk to choose, and that his squad survived.\nAnother game mechanics event occurs in the final mission, \"Doomsday.\" One of the player's companions—Kira Carsen, Doc, or Rusk—will come to the Jedi's aid during the attack on the Dark Temple, and the player can choose to save them for light side points and allow the Emperor to gain strength or ignore the distress call for dark side points to continue onward. If the player chooses to leave the companion to their death, they will later learn that one of the other companions saved them. If Sergeant Rusk is the companion in danger, he will be saved by Carsen, while Rusk will save Doc and Doc will save Kira. Regardless, all companions are present on the Valiant for the end of the class Act.\nRusk later appears in the game's Digital Expansion Knights of the Fallen Empire, which is set several years after the main game and sees him leading a unit of forcibly-enlisted criminals on Nar Shaddaa. The Alliance alert \"Bonds of Duty,\" added in Game Update 4.7.1 in 2016, sees the player character sent to recruit Rusk on Nar Shaddaa, and must reach Rank 10 Influence with him by defeating Black Sun members in the area and retrieving smuggled contraband. Once Rank 10 is reached, Rusk and the player confront the Black Sun leader Skadge—a companion character for the bounty hunter class—and players can choose to make a deal between them to recruit them both, or pick one to kill for dark side points and then recruit the other.\nAs the player character in the expansion can be any of the eight classes, the alignment choices cannot be assumed, so this article does not assume any outcome of the mission. Rusk has additional dialogue if the player character is a Jedi Knight, but otherwise the mission proceeds as normal. The storyline of Game Update 5.10: Jedi Under Siege presents Imperial players with a choice to join the Sith Empire as an ally or a spy, and if Rusk has been recruited by the player at this point, this will trigger a mail from Rusk informing the Commander that he cannot betray the Republic and will depart from the Alliance, but also stating that he can be contacted if any other threat arises.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Mindor/Legends",
  "/wiki/3682_BBY",
  "/wiki/Chagrian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Blue",
  "/wiki/Lethorn/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Fideltin_Rusk%27s_first_squad",
  "/wiki/Surgeons",
  "/wiki/301st_Infantry",
  "/wiki/Dead_Man%27s_Legion",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Republic_soldier",
  "/wiki/Republic_Military/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Reproduction/Legends",
  "/wiki/Chagrian_colony",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Water/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/White_Maw",
  "/wiki/3642_BBY",
  "/wiki/Fideltin_Rusk%27s_squad",
  "/wiki/Nautolan/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Leeha_Narezz",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Mission_to_Hoth_(Hunt_for_the_Sith_Emperor)",
  "/wiki/Tenebrae",
  "/wiki/Emperor%27s_Fortress",
  "/wiki/Squad/Legends",
  "/wiki/Mission_to_the_Emperor%27s_Fortress",
  "/wiki/Emperor/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Jedi_strike_team_(capture_of_the_Sith_Emperor)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_training",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Lord/Legends",
  "/wiki/Scourge",
  "/wiki/Sith_Master/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sith_Emperor%27s_ritual",
  "/wiki/Galaxy/Legends",
  "/wiki/Belsavis/Legends",
  "/wiki/Voss",
  "/wiki/Corellia/Legends",
  "/wiki/Speciecide",
  "/wiki/Capital/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/Astromech_droid/Legends",
  "/wiki/T7-O1",
  "/wiki/Dromund_Kaas_operation",
  "/wiki/Cross_of_Glory",
  "/wiki/Grand_Master/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Eternal_Empire",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Jebevel_Madon",
  "/wiki/Black_Sun/Legends",
  "/wiki/File:Rusk1.ogg",
  "/wiki/Fideltin_Rusk%27s_father",
  "/wiki/Fideltin_Rusk%27s_mother",
  "/wiki/Military_rank/Legends",
  "/wiki/Human/Legends",
  "/wiki/Callan_Grayne",
  "/wiki/Geonosis_campaign",
  "/wiki/Durant",
  "/wiki/General/Legends",
  "/wiki/Republic_High_Command/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Imperial_outpost_(prison_camp)",
  "/wiki/Standard_hour/Legends",
  "/wiki/Attack_on_an_Imperial_outpost",
  "/wiki/Death/Legends",
  "/wiki/Karsim",
  "/wiki/Naja",
  "/wiki/Eckerd",
  "/wiki/Elin_Garza",
  "/wiki/Special_Forces_black_ops_program",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Battle_on_Amador",
  "/wiki/Amador_fortress",
  "/wiki/Amador",
  "/wiki/Imperial_soldier",
  "/wiki/Republic_officer/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Officer/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Time/Legends",
  "/wiki/Medal/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Attack_on_Mindor",
  "/wiki/3650_BBY",
  "/wiki/Atmosphere/Legends",
  "/wiki/Starship/Legends",
  "/wiki/3665_BBY",
  "/wiki/Hoth_system/Legends",
  "/wiki/Battle_of_Hoth_(Great_Galactic_War)",
  "/wiki/Weapon/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Desolator_crisis",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Angral",
  "/wiki/3643_BBY",
  "/wiki/Deference",
  "/wiki/Pythar-class_Imperial_shuttlecraft",
  "/wiki/Unidentified_Imperial_scientist",
  "/wiki/Aurek_Base",
  "/wiki/Starship_Graveyard_(Hoth)",
  "/wiki/Crescent_Canyon_Ortolan_outpost",
  "/wiki/Ortolan/Legends",
  "/wiki/Crescent_Canyon",
  "/wiki/Probe_droid/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Self-destruct_mechanism/Legends",
  "/wiki/Suicide/Legends",
  "/wiki/Distress_signal/Legends",
  "/wiki/Jammer",
  "/wiki/Private/Legends",
  "/wiki/Murtag",
  "/wiki/Medcenter/Legends",
  "/wiki/Medical_droid/Legends",
  "/wiki/Edder",
  "/wiki/Reico",
  "/wiki/Vanth",
  "/wiki/Voshpar",
  "/wiki/Dromol",
  "/wiki/Outpost_Cresh",
  "/wiki/Imperial_Guard",
  "/wiki/Lassicar",
  "/wiki/Hunting/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Cave/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Urrisov",
  "/wiki/Star_of_Coruscant",
  "/wiki/Ray_shield/Legends",
  "/wiki/Power_generator/Legends",
  "/wiki/Outpost_Zerek",
  "/wiki/ME-D1",
  "/wiki/Hangar/Legends",
  "/wiki/Gen%27Dai",
  "/wiki/Zeshatt",
  "/wiki/Landspeeder/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Medic/Legends",
  "/wiki/Archiban_Frodrick_Kimble",
  "/wiki/Kira_Carsen",
  "/wiki/Padawan/Legends",
  "/wiki/Defender-class_light_corvette/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Tol_Braga",
  "/wiki/Warren_Sedoru",
  "/wiki/Q%C3%A2zoi_Kyantuska",
  "/wiki/Sith/Legends",
  "/wiki/Force_ghost",
  "/wiki/Orgus_Din",
  "/wiki/Force_vision/Legends",
  "/wiki/Executor_(Imperial_rank)",
  "/wiki/Krannus",
  "/wiki/Central_power_core",
  "/wiki/Korriban%27s_Flame",
  "/wiki/Realspace/Legends",
  "/wiki/Mission_to_Voss_(Emperor%27s_ritual_crisis)",
  "/wiki/Sith_sorcerer",
  "/wiki/Fulminiss",
  "/wiki/Sel-Makor",
  "/wiki/Battle_of_the_Valiant",
  "/wiki/Cruiser/Legends",
  "/wiki/Valiant_(Valor-class)",
  "/wiki/Supreme_Commander_(Jedi)",
  "/wiki/Battle_of_Corellia",
  "/wiki/Var_Suthra",
  "/wiki/Coronet_City/Legends",
  "/wiki/City/Legends",
  "/wiki/Governmental_Sector",
  "/wiki/Berrun",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/3636_BBY",
  "/wiki/Zakuul",
  "/wiki/3629_BBY",
  "/wiki/Provost_Marshal",
  "/wiki/Moon/Legends",
  "/wiki/Ternion_Building",
  "/wiki/Makeb_treaty",
  "/wiki/Hutt_Cartel",
  "/wiki/Alliance_Commander",
  "/wiki/Eternal_Alliance",
  "/wiki/Admiral/Legends",
  "/wiki/Bey%27wan_Aygo",
  "/wiki/Merghal",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Leontyne_Saresh",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Artillery/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Republic_trooper",
  "/wiki/Jumpsuit/Legends",
  "/wiki/Helmet/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Rifle/Legends",
  "/wiki/Repeating_blaster_cannon",
  "/wiki/Thermal_grenade",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/2011",
  "/wiki/The_Holonet",
  "/wiki/Ron_Yuan",
  "/wiki/Hall_Hood",
  "/wiki/Mary_Kirby",
  "/wiki/2016",
  "/wiki/Skadge",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Category:Audio_files_of_Fideltin_Rusk",
  "/wiki/Category:Images_of_Fideltin_Rusk",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Jedi_Council:_Acts_of_War_1",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Battle_of_Ilum",
  "/wiki/3640_BBY",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/3641_BBY",
  "/wiki/Template:TOR_dates/3",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/3630_BBY",
  "/wiki/3631_BBY"
 ]
}