{
 "name": "Fil",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Vassek 3"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Fil's squad",
      "Fil's squad"
     ]
    }
   ]
  }
 ],
 "content": "\"Fil\" was a Clone Commander in the Grand Army of the Republic who was assigned to recently promoted Jedi Knight Nahdar Vebb during the Clone Wars on their mission to recapture Viceroy Nute Gunray on the third moon of Vassek. He was killed by Grievous's pet Gor.\nFil was born on the planet Kamino, a Clone of the bounty hunter Jango Fett. Fil served as a Clone Commander in the Grand Army of the Republic, during the galaxy wide conflict between the Galactic Republic and the Confederacy of Independent Systems, the Clone Wars. Early into the war, Fil was assigned to the Mon Calamari Jedi Knight Nahdar Vebb, and served under him during several battles in the early Clone Wars. Fil was the leader of a squad that accompanied Vebb to Vassek 3, the third moon of Vassek.\nOn the moons surface, Vebb was reunited with his former master, the Nautolan Jedi Master Kit Fisto, who was joining them on their mission to recapture Trade Federation Viceroy Nute Gunray, who had escaped Republic capture with the aid of Asajj Ventress. Inspecting a Lair that they assumed Gunray was hiding out in, Fil ordered two of his men, Bel and Niner, to remain with the Nu-class attack shuttle they had arrived in. Fisto denied Fil's use of a thermal detonator to open the lair's door, and instead pressed a secret stone that activated the entrance.\nOnce inside the fortress, they took notice of a faint voice, that of Gunray, speaking with B1-series battle droids. Gunray, unbeknownst to the Jedi and clones, was in holographic form in order to lure the Jedi into the trap. The group attacked, quickly destroying the droids, however Vebb used the Force to turn Gunray's chair around, revealing the hologram of the Viceroy. After Gunray activated a homing beacon near his chair, his hologram faded away. Count Dooku contacted the Jedi, telling the group that while Gunray was unavailable for capture, he offered them an unnamed alternative prize. Fisto and Vebb knew that they had been tricked into the lair, and it was some form of a trap. Fil was worried about the current situation after the group walked down a dark hallway.\nUpon exploration of the fortress, it soon became clear is was no ordinary hideaway. Seeing Kaleesh statues and cyborg parts, Fisto came to the realization that they had been tricked into the lair of General Grievous, leader of the Droid Army. The group soon realized that Grievous would arrive at any moment, and that an opportunity to capture the cyborg general—which could turn the tide of the war—had presented itself.\nAfter Grievous landed in the fortress' secret hangar, he was ambushed by the group. Fil and his men drew their blasters, but Grievous did not comply with Fisto's demands for surrender and ignited four lightsabers. The Jedi managed to contain him, severing one of his cybernetic hands. Fil ordered his men to use grappling hooks to hold Grievous, while Vebb and Fisto tried to finish Grievous off. Grievous released himself from the clones, but Fisto severed Grievous's cyborg body in half from the waist down. The cyborg general fled from the area and entered the lair's secret command center. The battle with Grievous had resulted in the loss of two clone troopers, leaving only Fil and one last trooper alongside the Jedi. Fil and the other survivors tried to flee from the castle, but Grievous trapped them by shutting the outer doors. Fil contacted Bel and Niner, who were guarding their shuttle, and ordered them to contact their fleet, which was near the Inner Rim planet of Bestine IV, for more clone trooper reinforcements. However, one of Grievous's IG-100 MagnaGuards, who had been watching the ship,  used a missile launcher to destroy it, killing both Bel and Niner and preventing a call for help.\nAs the Jedi, Fil and the other surviving clone ran through the fortress, Grievous unleashed his next trap, opening up floor beneath their feet, which dropped down to a molten incinerator pit. While the Jedi avoided it, both clones fell, Fil using his grappling hook to save himself. The other clone, however, was not so lucky, and perished in the pit, leaving Fil the last of his squad. Fil was able to climb back out the pit with the help of Fisto and Vebb.\nGrievous then decided to release his pet Roggwart, Gor, to attack the group. Upon the arrival of the best, Fil fired his blaster pistol at its head, which was deflected from Gor's head armor. The roggwart disarmed Fisto, and Vebb ordered Fil to shoot and distract Gor while he himself jumped onto the creature. However, when Vebb stabbed Gor in the back with his lightsaber, Gor used his long tail to grab Fil, and lift the struggling commander off the ground. As Gor held onto Fil with his tail, both of the Jedi tried to save the clone commander, but it was too late. Fisto slashed at the roggwart's face with his lightsaber; Fil was slammed hard onto the floor by Gor and was instantly killed on impact.\nThe two Jedi cut off Gor's tail, which dumped the now lifeless Fil on the ground. Gor was then killed, and Vebb had little time to mourn the loss of the commander, before going to face Grievous, wanting revenge for his comrades deaths. Eventually, Vebb was murdered at the hands of Grievous, and soon the cyborg fought Fisto, though the Jedi Master escaped and departed the moon, the sole survivor.\nBeing a commander in the Clone Army, Fil was a veteran soldier with expert skills in recon, tactics, marksmanship, and hand-to-hand combat. He was the last of the clones in his squadron to fall to deadly traps in Grievous' lair on Vassek.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Fil",
  "/wiki/CC-3714",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Kamino",
  "/wiki/21_BBY",
  "/wiki/Vassek_3",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Fil%27s_squad",
  "/wiki/Niner",
  "/wiki/Bel",
  "/wiki/File:LookAfterTheShips-LoG.ogg",
  "/wiki/Clone_Commander",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi_Knight",
  "/wiki/Nahdar_Vebb",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Vassek_3",
  "/wiki/Viceroy",
  "/wiki/Nute_Gunray",
  "/wiki/Vassek",
  "/wiki/Grievous",
  "/wiki/Gor",
  "/wiki/Planet",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Mon_Calamari",
  "/wiki/Nautolan",
  "/wiki/Jedi_Master",
  "/wiki/Kit_Fisto",
  "/wiki/Trade_Federation",
  "/wiki/Asajj_Ventress",
  "/wiki/Lair_of_Grievous",
  "/wiki/Nu-class_attack_shuttle",
  "/wiki/B1-series_battle_droid",
  "/wiki/Hologram",
  "/wiki/The_Force",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Kaleesh",
  "/wiki/Cyborg",
  "/wiki/General",
  "/wiki/Droid_Army",
  "/wiki/Blaster",
  "/wiki/Lightsaber",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Bestine_IV",
  "/wiki/IG-100_MagnaGuard",
  "/wiki/Roggwart",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Category:Audio_files_of_Fil",
  "/wiki/Category:Images_of_CC-3714",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Rookies",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_I_Am_a_Clone_Trooper",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Blue_Shadow_Virus",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Death",
  "/wiki/Standard_year"
 ]
}