{
 "name": "Filice Ginzork",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arhan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Fair"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "\"The Shield\""
     ]
    }
   ]
  }
 ],
 "content": "Filice Ginzork was a female Arhan. She married Peert Ginzork sometime around 0 BBY and was part of the private security organization \"The Shield.\" She was a skilled slicer and was secretly a member of the Rebel Alliance.\nAround 0 BBY, Filice Ginzork married Peert Ginzork. She worked as a private security specialist for The Shield, a group that protected corporate couriers and executives and had recently branched into counter-espionage. She was also secretly a member of the Rebel Alliance, a fact that was hidden from both the Galactic Empire and the corporations that hired her and her company.\nGinzork was a female Arhan who had a very thin and frail body and very long facial features.\nGinzork was a talented slicer who was highly skilled at computer programming and repair. She was also trained in a variety of skills useful to an operative such as investigation, persuasion, stealth, urban survival, and basic forms of combat.\nGinzork carried a blaster pistol, a comlink, a recording rod a datapad, and a portable computer. She also carried macrobinoculars, a medpac, a chronometer, four computer spikes, a restraining bolt, a lectroticker, a lockpick, and a sabacc cheater chip.\nFilice Ginzork was designed by Rick Olshak for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. She was illustrated by Mike Vilardi.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Arhan",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/The_Shield",
  "/wiki/Peert_Ginzork",
  "/wiki/0_BBY/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Recording_rod",
  "/wiki/Datapad/Legends",
  "/wiki/Portable_computer",
  "/wiki/Macrobinoculars/Legends",
  "/wiki/Medpac/Legends",
  "/wiki/Chronometer/Legends",
  "/wiki/Computer_spike/Legends",
  "/wiki/Restraining_bolt/Legends",
  "/wiki/Lectroticker",
  "/wiki/Sabacc/Legends",
  "/wiki/Cheater",
  "/wiki/Rick_Olshak",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Mike_Vilardi"
 ]
}