{
 "name": "Filia Rossi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Teal"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Olive"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Officer Corps",
      "Imperial Navy",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Filia Rossi was a female human who graduated from the Imperial Academy on Raithal. She later replaced Rik Virgilio as captain of the Gozanti-class cruiser Blood Crow.\nCaptain Filia Rossi graduated from Raithal Academy and had spent most of the following twelve years on Socorro, first based on the ground, then aboard an orbital defense platform by the system's asteroid belts and later spent a year as the first officer aboard an ore freighter escort. She was then promoted to command the Gozanti-class cruiser Blood Crow, replacing its previous captain Rik Virgilio. Although the reasons for the replacement were unclear, it was speculated that Rossi's strong political connections had played an important part. When Rossi was placed in command, she undertook a tour of the ship with several officers, including first weapons officer Lieutenant Thrawn and Ensign Eli Vanto. When she reached the Number Two storage bay and opened the hatch, Nels Deyland and the other officers drifting to the sides of the passageway, foreshadowing Rossi's negative reaction to Thrawn storing Clone Wars antiques.\nWhen Rossi asked Thrawn for an explanation but was not satisfied, she ordered Thrawn to dispose of his artifacts. Thrawn proposed an alternative to which Rossi agreed to listen to, which was that in his collection were two Mark One Pistoeka sabotage droids, which were rare and valuable to collectors, and that since they were property of the vessel and since Rossi was the captain of the vessel, the droids were technically hers. Thrawn indicated that they were valuable to officers in Imperial High Command, which Rossi could use for her advantage. In the end, Rossi agreed to Thrawn's proposal, and she was likely aware of the Doonium contained in the droids, which the Empire was anxious to get a hold of as many as possible.\nIt took Rossi a week to get fully acquainted with her ship and crew, and to Vanto's surprise, was good at her post, however, Vanto was not surprised that Rossi disliked the fact that an alien, Thrawn, had an aide, which was Vanto, and no one else on board did, and soon Thrawn and Vanto were given mediocre chores and duties. The Blood Crow was soon called to assist the Dromedar, yet also received a call for assistance on Moltok, as there was a growing crisis there. While Thrawn, Vanto, and several other crew members stayed behind to repair the Dromedar, they were captured by Nevil Cygni who was posing as part of the crew of the Dromedar. In the end, Thrawn was able to rescue the actual crew of the Dromedar and save several Tibanna gas canisters on board the freighter. When Rossi returned, she suspended Thrawn since he prioritized the lives of the Dromedar's crew instead of recapturing all gas canisters. Thrawn and Vanto were suspended, and were left behind on Ansion in an Imperial base located there to await the results of their suspension.\nFilia Rossi was a younger and relatively inexperienced officer compared to her predecessor. She achieved her rank and assignment owing to her connections, though she did prove to be fairly good at her job, as Vanto noted. She was incredibly petty and had a fiery temper, and acted overtly officious towards her subordinates. She was especially hard on Thrawn and Vanto, whom she treated with nothing but contempt, mainly due to her prejudice towards aliens and anyone from Wild Space.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Raithal_Academy",
  "/wiki/Raithal",
  "/wiki/Rik_Virgilio",
  "/wiki/Captain",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Blood_Crow",
  "/wiki/Standard_year",
  "/wiki/Socorro",
  "/wiki/Unidentified_orbiting_defense_platform",
  "/wiki/Star_system",
  "/wiki/Socorro_asteroid_belts",
  "/wiki/Executive_officer",
  "/wiki/Ore_freighter",
  "/wiki/Imperial_officer",
  "/wiki/First_weapons_officer",
  "/wiki/Lieutenant",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Ensign",
  "/wiki/Eli_N._Vanto",
  "/wiki/Nels_Deyland",
  "/wiki/Officer",
  "/wiki/Clone_Wars",
  "/wiki/Mark_One_Pistoeka_sabotage_droid",
  "/wiki/Collector",
  "/wiki/Starship",
  "/wiki/Imperial_High_Command",
  "/wiki/Doonium",
  "/wiki/Standard_week",
  "/wiki/Alien",
  "/wiki/Aide",
  "/wiki/Dromedar",
  "/wiki/Moltok",
  "/wiki/Crisis_on_Moltok",
  "/wiki/Nevil_Cygni",
  "/wiki/Tibanna",
  "/wiki/Gas",
  "/wiki/Ansion",
  "/wiki/Ansion_Imperial_base",
  "/wiki/Military_rank",
  "/wiki/Assignment",
  "/wiki/Wild_Space",
  "/wiki/Thrawn_(novel)",
  "/wiki/Thrawn_(audiobook)",
  "/wiki/Thrawn_2"
 ]
}