{
 "name": "Filvian  (Brolf)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Barlok"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Brolf"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Filvian, codenamed \"Patriot\", was a male Brolf terrorist and resistance fighter who sought to reclaim full planetary control over mining operations on Barlok. The resistance was obsessed with what they viewed as the Corporate Alliance's attempt to steal their planet's wealth.\nFilvian came into contact with Kinman Doriana, codenamed \"Defender\", who tasked him to assassinate Passel Argente, a leader in the Corporate Alliance, and Guildmaster Gilfrome in 27 BBY. Working for Filvian were several Brolfi underlings  who conspired to build a homemade missile with which to kill Argente and the other negotiators. The weapon would be guided to its target by Doriana.\nEven though Jedi Master Jorus C'baoth successfully foiled the plot through his use of the Force , the assassination attempt had, from the beginning, been rigged to fail by Doriana—in an attempt to give additional prestige to the already impressively powerful Master C'Baoth, who sought to procure the needed Senate funding and desired Jedi crew for his \"Outbound Flight Project.\"\nThe plot's mastermind, Darth Sidious, wanted the extra-galactic exploration project to go forward in order to eliminate not only C'Baoth , but also the many other Jedi Masters and Knights who would accompany him on this unprecedented flight into the Unknown Regions and beyond. Sidious feared also the encroachment of the 'Far Outsiders' and wanted to avoid any contact or entanglements with them which might lead to an extra-galactic invasion of the Republic—certainly not before he could seize control of the Republic and create a standing Imperial army that might stand a fighting chance of dealing with such an ominous external threat.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Filvian",
  "/wiki/Barlok",
  "/wiki/Brolf",
  "/wiki/Gender/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Kinman_Doriana",
  "/wiki/Assassin/Legends",
  "/wiki/Passel_Argente/Legends",
  "/wiki/Corporate_Alliance/Legends",
  "/wiki/Guildmaster",
  "/wiki/Gilfrome",
  "/wiki/27_BBY/Legends",
  "/wiki/Jhompfi",
  "/wiki/Duefgrin",
  "/wiki/Migress",
  "/wiki/Missile/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jorus_C%27baoth",
  "/wiki/The_Force/Legends",
  "/wiki/Force_grip",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Outbound_Flight_Project",
  "/wiki/Palpatine/Legends",
  "/wiki/Outbound_Flight",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Filvian_(Brolf)",
  "/wiki/Outbound_Flight_(novel)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}