{
 "name": "Finis_Valorum",
 "display_name": "Finis Valorum",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Valorum",
      "Galactic Republic",
      "Office of the Chancellor",
      "Office of the Chancellor",
      "Refugee Relief Movement"
     ]
    }
   ]
  }
 ],
 "content": "Finis Valorum was a human male politician from House Valorum who served as the penultimate Supreme Chancellor of the Galactic Republic. His administration was hampered by corruption and bureaucracy in the Galactic Senate, which Valorum was unable to bring under control.\nTowards the end of his administration, Valorum attempted to resolve the Trade Federation's Invasion of Naboo to little effect. As a result of government inaction, Queen Padmé Amidala of Naboo called for a Vote of No Confidence in Valorum's leadership. The Senate scheduled an election for a new Chancellor, and Valorum was replaced by Senator Sheev Palpatine of Naboo; Palpatine was secretly Darth Sidious, the Dark Lord of the Sith, and had orchestrated the Naboo Crisis to become Supreme Chancellor and, ultimately, transform the Republic into the Galactic Empire.\nDuring the Clone Wars, over ten years after his political downfall, Valorum assisted the Jedi Order as they investigated the circumstances surrounding the death of Jedi Master Sifo-Dyas, who, as Chancellor, Valorum had sent on a mission to resolve a dispute with the spice dealers known as the Pyke Syndicate. The Jedi learned Sifo-Dyas had been killed by the Pyke Syndicate at the behest of the Sith—who wanted to control the clone army Sifo-Dyas had secretly commissioned for the Republic—during the mission that Valorum had sent him on. After the rise of the Empire, some Coruscanti continued to have fond memories of the former Supreme Chancellor.\nFinis Valorum was born into the influential House Valorum on Coruscant, the capital of the Galactic Republic, and was a descendant of the Republic's first Supreme Chancellor. For his entire life, Valorum planned to ascend to the Office of the Chancellor. He entered into political life and became a civil servant within the Galactic Republic, in which House Valorum held much prestige and influence. At some point during his political career, he served as an administrator to Supreme Chancellor Skor Kalpana. Along with the Chancellor, Senator Sheev Palpatine of Naboo, and other dignitaries, Valorum attended the commencement and commissioning ceremonies at the Sullust Sector Spacefarers Academy, a piloting academy on Sullust. Later, Valorum himself was elected to the chancellery by the Galactic Senate. During his administration, his political power became hampered by the massive bureaucracies of the government, and he became mired in accusations of corrupt conduct.\nPalpatine believed that Valorum did not care about the lower levels of Coruscant, beneath its surface, and suggested Valorum was happy to pretend they did not exist. At some point during Valorum's chancellorship, however, there was a crisis in the Pyke Syndicate, a criminal organization that dealt spice, that could have resulted in a full-scale crime war beneath Coruscant's surface. In order to stabilize the Pykes, who held almost complete control over raw spice used to create a drug, Chancellor Valorum contacted Jedi Master Sifo-Dyas, a Jedi who had experience with the criminal underworld. Valorum did not, however, inform the Jedi High Council that he was sending Sifo-Dyas or the Chancellor's personal aide, Silman, to the Pyke planet of Oba Diah; the Senate feared that holding open discussions with the Pykes could legitimize their criminal activities and offer opposition leaders in the bureaucracy an opportunity to take down Valorum's administration.\nAfter arriving on Oba Diah, Sifo-Dyas was diverted to Felucia by the Jedi Council, who ordered him to deal with a conflict between Felucian tribes. As the Jedi Master and Silman were leaving the Pyke world, the Pykes—who had been hired by the Sith Lord Darth Tyranus—shot Sifo-Dyas' ship down, killing the Jedi Master and taking Silman as a prisoner. Valorum and the Jedi were left believing that Sifo-Dyas and Silman had been killed on Felucia. At some point before the Invasion of Naboo, Valorum dispatched Jedi Master Mace Windu to Oosalon so he could free several kidnapped Jedi Padawans from Guattako the Grim and end Guattako's threat once and for all, as the fearless warlord was planning to still kidnap children to recruit them into his child army. Valorum once witnessed the acrobatic skill of the Frenk Twazzi, whose skill he praised.\nTowards the end of his chancellery, and against political expectations, Valorum was elected to a second term. According to Palpatine, who presented himself as an ally but—as Darth Sidious, the Dark Lord of the Sith—secretly plotted Valorum's downfall, Valorum was allowed to win by special interest groups who exploited legal loopholes, such as in Republic free trade laws, and needed a Chancellor who would become entangled in the governmental bureaucracies. Despite his reelection, citizens on Coruscant began placing bets on whether Valorum would be able to serve a full term. It was at that time that Palpatine's name was whispered as a potential successor. Valorum's chancellery was furthered hampered when he attempted to investigate the events of a disastrous trade summit on Eriadu, but was stonewalled by Eriadu's planetary governor, Wilhuff Tarkin, at the request of Senator Palpatine. Tarkin himself had been elected governor on Eriadu despite opposition from House Valorum, further weakening the Chancellor's position.\nIn the final months of Valorum's chancellery, work began on the millennial celebrations intended to mark the thousand-year anniversary of the foundation of the Galactic Republic, which followed the last war between the Jedi and the Sith. Valorum and his team spent time exploring logo designs and artwork to commemorate the event, and the chancellor himself was intimately involved in the design process. Valorum rejected 250 different revisions for a millennial invitation for a variety of reasons—such as the warmth of the design as well as its exclusivity—out of concern for his declining public image. He ultimately delegated the responsibility for the design to Senator Palpatine, who finalized a design that featured Sistros Nevet, the ancient lawmaker who helped create the original constitution of the Republic after the fall of the Sith. The concept and layout were created by the artist Naveela Betuine, while the final execution was done by Dashira Dobeq.\nIn 32 BBY, the Republic became involved in a disagreement over the taxation of trade routes to outlying star systems. The Trade Federation, which held a monopoly on shipping in the Outer Rim, blockaded the planet Naboo in an attempt to force the Senate into a resolution favorable to the Federation. The Naboo Crisis was secretly engineered by Senator Palpatine in order to end Valorum's chancellery, and was partly hastened by the events of the trade summit on Eriadu. The blockade cut off essential supplies to Naboo, plunging the Republic into a political crisis that the Senate was unable to resolve.\nTo resolve the blockade, Valorum sent Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, to negotiate with Nute Gunray, the Viceroy of the Trade Federation. The Federation attempted to kill the two Jedi and started an invasion of the planet shortly thereafter. Queen Padmé Amidala of Naboo escaped the planet with the help of the Jedi and traveled to Coruscant, seeking the help of Chancellor Valorum and the Senate. Valorum called for a special Senate session so Amidala could plead her case.\nThe Senate session, which Valorum presided over, proved unproductive for Amidala's cause. Senator Palpatine and Queen Amidala proclaimed that the Federation had invaded Naboo, a claim that Lott Dod, the Senator from the Trade Federation, disputed on the basis that no proof had been provided. Dod recommended to the Chancellor that the Senate appoint a commission to study the allegations, a recommendation that was seconded by the representatives of the planet Malastare. Valorum consulted with his advisors, including Vice Chair Mas Amedda, and ultimately asked Amidala whether she would accept a commission. Amidala refused and, at Palpatine's urging, called for a Vote of No Confidence in Valorum's leadership. Unknown to Valorum was that Amedda was secretly working for Palpatine, and he knew that Valorum's indecision would make him look weak and present an opportunity to oust him from office.\nAmidala's motion led to Valorum's removal from office. A new election was called to replace him, and led to the nominations of Senator Palpatine, Bail Antilles of Alderaan, and Ainlee Teem of Malastare. As Palpatine had predicted, the Invasion of Naboo created a sympathy vote in the Senate, and he was elected Supreme Chancellor in Valorum's place. Due to Valorum and the Senate's inability to act, Queen Amidala also returned to her planet and, with the help of the Jedi that Valorum had first sent to Naboo, ended the invasion.\nValorum's political fall and the liberation of Naboo led to changes within the shipping conglomerates. The Trade Federation's monopoly on the Outer Rim was broken, and Valorum Shipping, controlled by House Valorum, suffered a loss of prestige. As a result, other companies, such as Eriadu Mining and Shipping, found new prosperity.\nValorum maintained an estate on Coruscant for several years after his chancellery. During the Clone Wars, which were partly precipitated by the Naboo Crisis and which were also engineered by Chancellor Palpatine, the Jedi found a lightsaber that had once belonged to Sifo-Dyas, who the Jedi had previously learned was the one who secretly commissioned the creation of the clone troopers comprising the ranks of the Grand Army of the Republic. The Jedi began investigating Sifo-Dyas' disappearance, which led to the uncovering of a file sealed by Valorum's administration regarding the events on Oba Diah. Yoda, the Grand Master of the Jedi Order and an old friend of the former Chancellor's, met with Valorum at Valorum's estate on Coruscant. At Yoda's request, the ex-Chancellor recounted the events that led to the mission on Oba Diah. Valorum's information led Obi-Wan Kenobi and Anakin Skywalker to Oba Diah, where they discovered that Silman was still alive—though he was soon killed by Count Dooku—and that the Sith had helped orchestrate the creation of the clone army.\nAt the end of the war, and thirteen years after Palpatine conspired to remove Valorum from office in order to seize power for himself, Palpatine declared himself Emperor, transformed the Republic into the Galactic Empire, and destroyed the Jedi Order. Despite Valorum's reputation as an ineffective leader, some Coruscanti citizens had fond memories of the former Supreme Chancellor and gossiped about him, particularly after Emperor Palpatine all but removed himself from public life. In 5 BBY, Valorum's name was spoken among the murmur of voices at a dinner party held by Chandrilan senator Mon Mothma. By 3 BBY, the Emperor's Museum on Coruscant remembered the former Chancellor as a \"weak, ineffectual\" leader who had done little to improve the state of the Republic.\nFor his entire life, Valorum prepared for when he could one day become the Supreme Chancellor. Once elected, he enjoyed the privileges that came with being the leader of the Republic, though this attitude was to his detriment as ordinary voters did not respond well to it. Despite this, while his administration was hampered by corruption and the complex bureaucracies of the Republic, as Supreme Chancellor he was nonetheless a well-meaning man and a progressive diplomat.\nValorum held a low opinion of senators who represented companies instead of worlds; however, such an opinion was old fashioned by the time he was Chancellor, resulting in him keeping it private. In fact, he worked to ensure he did not showcase bias towards either type of senator. The final days of his term saw him attempt to resolve the conflict between the Trade Federation and Naboo, but his efforts led to his removal from office.\nValorum was a human male who stood at 1.7 meters. By his chancellorship, he had white hair, blue eyes, and fair skin.\nThough well-intentioned in his approach to governance, Valorum was nonetheless unable to rein in the complex and powerful bureaucracies that the Senate had become entangled in. According to Palpatine, Valorum's reelection was achieved only through the desires of the special interests, who wanted a Chancellor who would be unable to push back on their power and influence. Despite being unable to control them, he was aware of them and could at times counter them. When he assigned Sifo-Dyas to deal with the conflict in the Pyke Syndicate, Valorum and the Senate committee in charge of the situation feared that open negotiations with the Pykes could legitimize the Syndicate's criminal enterprise, as well as strengthen opposition leaders in the bureaucracy. As a result, they chose to keep their discussions with the Pykes a secret.\nThe end of Valorum's chancellery was marked by inaction over the Naboo Crisis, as Valorum deferred to the interests of the Trade Federation, despite wanting to help Naboo during the invasion. His inability to control the bureaucracies allowed Palpatine to exploit Valorum's political weaknesses, which led to Valorum's removal from office.\nValorum wore an ornate blue velvet overcloak.\nSupreme Chancellor Valorum first appeared in Star Wars: Episode I The Phantom Menace, where he was played by Terence Stamp. Stamp, who filmed all of Valorum's scenes against a blue screen, took the role of Valorum because he felt that the character was not a one-dimensional cameo, and he wanted to work with George Lucas, the creator of Star Wars and the writer and director of The Phantom Menace. Stamp did not have much time to prepare for the role and was unable to read the full script, so he felt he did not have much to base his character on. To understand what Valorum was like, Lucas told Stamp that Valorum was similar to then-United States President Bill Clinton, describing Valorum as \"a good man but he's beleaguered,\" though Stamp noted that this was prior to Clinton's impeachment trial. Stamp later expressed disappointment in the role and how it was filmed—despite appearing in scenes with Natalie Portman, the two never acted together on set.\nThe character returned for a second canon appearance in \"The Lost One,\" the tenth episode of The Lost Missions, the sixth and penultimate season of the animated television series Star Wars: The Clone Wars. For the animated appearance, the character was designed by The Clone Wars artist Kilian Plunkett and voiced by Ian Ruskin. The character's full name of Finis Valorum, which was not used in The Phantom Menace or \"The Lost One,\" was introduced into official canon in the 2014 mobile app Star Wars Journeys: The Phantom Menace as well as the novel Tarkin, by James Luceno; the name was previously used in Star Wars Legends, including stories such as Luceno's 2001 novel Cloak of Deception.\nThe name \"Valorum\" has been part of Star Wars since the earliest drafts of Star Wars: Episode IV A New Hope. In The Star Wars: Rough Draft, Valorum was a Sith knight who was demoted to the level of stormtrooper after failing to capture Rebel fighters, before defecting from the Galactic Empire and joining the Rebels; the character bore some similarities to Darth Vader. For The Star Wars: First Draft, the character was renamed Dodana. The name Valorum was again used in a later draft, titled Adventures of the Starkiller, Episode I: The Star Wars. Although he did not physically appear in the story, Prince Espaa Valorum was the Master of the Sith and the ruler of the Galactic Empire on Alderaan. Darth Vader served as his second in command.\nA discrepancy about Valorum arose after the publication of Star Wars Character Encyclopedia: Updated and Expanded in 2016. The Databank on StarWars.com lists Valorum's height as 1.83 meters, while Star Wars Character Encyclopedia: Updated and Expanded lists it as 1.7 meters.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Finis_Valorum",
  "/wiki/Finis_Valorum/Legends",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Announcement",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Master_%26_Apprentice",
  "/wiki/The_Weapon",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Chancellors,_Senators_and_Other_Statesmen_of_the_Republic",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Coruscanti",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/House_Valorum",
  "/wiki/Galactic_Republic",
  "/wiki/Office_of_the_Chancellor",
  "/wiki/Refugee_Relief_Movement",
  "/wiki/Politics",
  "/wiki/Supreme_Chancellor",
  "/wiki/Galactic_Senate",
  "/wiki/Trade_Federation",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Queen",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Vote_of_No_Confidence",
  "/wiki/Senator",
  "/wiki/Darth_Sidious",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Galactic_Empire",
  "/wiki/Clone_Wars",
  "/wiki/Standard_year",
  "/wiki/Jedi_Order",
  "/wiki/Death",
  "/wiki/Jedi_Master",
  "/wiki/Sifo-Dyas",
  "/wiki/Mission_to_Oba_Diah_(pre%E2%80%93Naboo_Crisis)",
  "/wiki/Spice",
  "/wiki/Pyke_Syndicate",
  "/wiki/Sith",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Capital",
  "/wiki/Tarsus_Valorum",
  "/wiki/Administrator",
  "/wiki/Skor_Kalpana",
  "/wiki/Sullust_Sector_Spacefarers_Academy",
  "/wiki/Pilot",
  "/wiki/Sullust",
  "/wiki/Coruscant_Underworld",
  "/wiki/Jedi",
  "/wiki/Jedi_High_Council",
  "/wiki/Silman",
  "/wiki/Planet",
  "/wiki/Oba_Diah",
  "/wiki/Felucia",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/Dooku",
  "/wiki/Jedi_T-6_shuttle_775519",
  "/wiki/Prisoner",
  "/wiki/Mace_Windu",
  "/wiki/Oosalon",
  "/wiki/Padawan",
  "/wiki/Guattako",
  "/wiki/Warlord",
  "/wiki/Youngling",
  "/wiki/Guattako%27s_army",
  "/wiki/Army",
  "/wiki/Frenk",
  "/wiki/Twazzi",
  "/wiki/Eriadu_Conference",
  "/wiki/Eriadu",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Standard_month",
  "/wiki/Jedi-Sith_War",
  "/wiki/Millennial_Celebration_Invitation",
  "/wiki/Sistros_Nevet",
  "/wiki/Artist",
  "/wiki/Naveela_Betuine",
  "/wiki/Dashira_Dobeq",
  "/wiki/32_BBY",
  "/wiki/Star_system",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Nute_Gunray",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Escape_from_the_Saak%27ak",
  "/wiki/Lott_Dod",
  "/wiki/Malastare",
  "/wiki/Vice_Chair",
  "/wiki/Mas_Amedda",
  "/wiki/Bail_Antilles",
  "/wiki/Alderaan",
  "/wiki/Ainlee_Teem",
  "/wiki/Valorum_Shipping",
  "/wiki/Eriadu_Mining_and_Shipping",
  "/wiki/Lightsaber",
  "/wiki/Clone_trooper",
  "/wiki/Yoda",
  "/wiki/Grand_Master",
  "/wiki/Mission_to_Oba_Diah_(Clone_Wars)",
  "/wiki/Anakin_Skywalker",
  "/wiki/Cloning",
  "/wiki/Galactic_Emperor",
  "/wiki/Order_66",
  "/wiki/5_BBY",
  "/wiki/Chandrilan",
  "/wiki/Mon_Mothma",
  "/wiki/3_BBY",
  "/wiki/Emperor%27s_Museum",
  "/wiki/Velvet",
  "/wiki/Clothing",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Terence_Stamp",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars",
  "/wiki/Natalie_Portman",
  "/wiki/The_Lost_One",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Kilian_Plunkett",
  "/wiki/Ian_Ruskin",
  "/wiki/2014",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Tarkin_(novel)",
  "/wiki/James_Luceno",
  "/wiki/Star_Wars_Legends",
  "/wiki/2001",
  "/wiki/Cloak_of_Deception",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/The_Star_Wars:_First_Draft",
  "/wiki/Adventures_of_the_Starkiller,_Episode_I:_The_Star_Wars",
  "/wiki/Espaa_Valorum",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/2016",
  "/wiki/Databank_(website)",
  "/wiki/StarWars.com",
  "/wiki/Master_%26_Apprentice_(audiobook)",
  "/wiki/Age_of_Republic_Special_1",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Obi-Wan_and_Anakin_2",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Brotherhood",
  "/wiki/The_Box",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Andor_(television_series)",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/Leia,_Princess_of_Alderaan_(audiobook)",
  "/wiki/William_Shakespeare%27s_The_Phantom_of_Menace:_Star_Wars_Part_the_First",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Jedi_General",
  "/wiki/Star_Wars_Insider_163",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_68",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Star_Wars_Helmet_Collection_42",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Coruscant_(Star_Wars_Encyclopedia)",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars_-_The_Official_Magazine",
  "/wiki/Star_Wars_-_The_Official_Magazine_101",
  "/wiki/Database",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/The_Separatists",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Kassa_(episode)",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Birthday",
  "/wiki/Stamp_of_Approval",
  "/wiki/Star_Wars_Insider_41",
  "/wiki/TheForce.net",
  "/wiki/July_18",
  "/wiki/2000",
  "/wiki/April_13",
  "/wiki/Star_Wars:_Episode_I_The_Visual_Dictionary",
  "/wiki/Databank_(original)"
 ]
}