{
 "name": "Finn  (bartender)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sakiyan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rik's Cantina"
     ]
    }
   ]
  }
 ],
 "content": "Finn was a Sakiyan male who worked as a bartender for Rik's Cantina in the galactic capital Coruscant's underworld during the Second Imperial Civil War. He also served as the main bouncer of Rik's, which was owned by the Hutt Queen Jool. In 137 ABY, he served drinks to the bounty hunter Cade Skywalker, who was visiting Jool.\nFinn, a Sakiyan male, was born in the decades leading up to the Sith–Imperial War. He eventually became the lead bartender and main enforcer of Rik's Cantina, a bar in the underworld of the galactic capital Coruscant operated by the Hutt Queen Jool. He defended Rik's Cantina from troublemakers using subtle and efficient methods, such as placing tranquilizers in a drink and offering it to a disruptive patron. During this period, he became familiar with the bounty hunter Cade Skywalker, who frequented the cantina with his friends Jariah Syn and Deliah Blue.\nIn the year 137 ABY, during the Second Imperial Civil War, Finn was working in Rik's Cantina when Skywalker came to the bar in order to visit Jool. Skywalker asked the Sakiyan to pour him both a Corellian whiskey and an ale, and Finn was informed by the Hutt that the cantina would cover the cost of the drinks. Finn gave the drinks to Skywalker and continued managing the bar as Skywalker and Jool conversed with each other.\nThe Sakiyan male Finn was a jaded and distant individual, and was unsurprised by any actions performed in Rik's Cantina. However, his demeanor belied his abilities both in unarmed combat and with a blaster. When in a difficult situation, Finn remained calm and would maintain his composure. Finn owned a heavy blaster pistol, a comlink, and tranquilizer drops that he placed in unruly patrons' drinks. He did not question Queen Jool when she told him that the cantina would cover the cost of Cade Skywalker's drinks.\nFinn was created by John Ostrander, the writer of the Star Wars: Legacy comic series. He was first featured in 2006's Legacy  0, a resource comic that gave basic information on some of the characters, locations, and organizations of Legacy. Finn was later featured in the 2008 resource comic Legacy  0½ and received an entry in The Complete Star Wars Encyclopedia in the same year. In 2009, he garnered an entry in the Legacy Era Campaign Guide. Finn's only appearance to date has been in the fourteenth issue of Legacy, in which he was drawn by Jan Duursema.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Finn_(disambiguation)",
  "/wiki/Sakiyan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Rik%27s_Cantina/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Hutt/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Jool",
  "/wiki/137_ABY",
  "/wiki/Alcohol/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Standard_year/Legends",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Cantina/Legends",
  "/wiki/Jariah_Syn",
  "/wiki/Deliah_Blue",
  "/wiki/Corellian/Legends",
  "/wiki/Corellian_whiskey/Legends",
  "/wiki/Corellian_ale/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/2006",
  "/wiki/Legacy_(2006)_0",
  "/wiki/2008",
  "/wiki/Legacy_(2006)_0%C2%BD",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2009",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Legacy_(2006)_14",
  "/wiki/Jan_Duursema"
 ]
}