{
 "name": "Fionna Flannis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 23 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Colonial News Nets",
      "Alliance to Restore the Republic",
      "Alliance Intelligence",
      "Alliance Intelligence",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Fionna Flannis was a female Human, who worked as a reporter during the time of the Galactic Civil War.\nFlannis was a reporter for Colonial News Nets and traveled the Colonies, interviewing socialites, entertainment starlets and Imperial officers. She was known to produce some of the raciest stories for Colonial News Net. She was also an operative for the Alliance to Restore the Republic and would meet with Alliance agents to give them information about Rebel and Imperial activity in the Colonies. Despite working for the same organization she was not aware that Pertaal Shenvehr was also a Rebel operative.\nFlannis was a Human female. She was shrewd and would have superficial conversations until she was certain that she was speaking to an agent of the Alliance. She had blond hair and dressed in expensive and fashionable clothing. Flannis secretly felt bitter towards the upper classes and worked against the Empire so that she could embarrass the Imperial elites.\nFlannis was a skilled reporter and was well versed in handling a variety of social situations. She was also talented at undercover work and was able to sneak or bluff her way past security in order to get a scoop.\nFlannis dressed in the latest and most expensive fashions. She wore a matching purse that concealed her reporter's datapad and a hold-out blaster she kept for protection. She had access to a 100,000-credit expense account from Colonial News.\nFionna Flannis was designed by Peter M. Schweighofer for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. She was illustrated by Mike Jackson.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/23_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Colonial_News_Nets",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/New_Republic/Legends",
  "/wiki/Journalist/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Colonies/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Pertaal_Shenvehr",
  "/wiki/Datapad/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Peter_M._Schweighofer",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Mike_Jackson",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Fists_of_Ion",
  "/wiki/StarWars.com",
  "/wiki/Unbound_Worlds"
 ]
}