{
 "name": "Fir_Kashal",
 "display_name": "Fir Kashal",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Fir Kashal was a male Twi'lek, who worked as a bounty hunter during the waning years of the Galactic Republic.\nKashal was a member of a group of bounty hunters that was led by the Chagrian Koll Jovas. During the time of the Clone Wars, the bounty hunters were hired by a member of the Metatheran Cartel to find whomever was responsible for some attacks on Cartel shipping in the Cularin system, and stop them. The attacks had been caused by the Rock Rogues, a pirate group and when the bounty hunters arrived in the Cularin system in their transport, it was shot down by a Rock Rogues CloakShape fighter. The transport crash-landed on the planet of Cularin and Kashal and the other bounty hunters climbed out of the wreckage, determined to find the pirates.\nShortly afterward, the bounty hunters encountered the Heroes of Cularin, a group of freelance agents who were also investigating the Rock Rogues. Kash, the Rodian Liinu Oran, and the Devaronian Jith Zesjoo hid nearby, while Jovas and two other bounty hunters approached the heroes.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Chagrian/Legends",
  "/wiki/Koll_Jovas",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Metatheran_Cartel",
  "/wiki/Cularin_system",
  "/wiki/Rock_Rogues",
  "/wiki/Pirate/Legends",
  "/wiki/Transport/Legends",
  "/wiki/CloakShape_fighter/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Liinu_Oran",
  "/wiki/Devaronian/Legends",
  "/wiki/Jith_Zesjoo",
  "/wiki/Holes"
 ]
}