{
 "name": "Fird",
 "display_name": "Fird",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alsakan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Fird was a Human male member of the Galactic Senate of the Republic during the Great Peace of the Republic. He acted as the delegate from the Core World of Alsakan in the legislature, and testified on the Matter of Creating an Outer Expansion Zone around the year 700 BBY. The hearings on the proposal ultimately concluded with the approval and creation of an Outer Expansion Zone for Republic colonization in the galaxy's northern quadrant under the administration of the Expansionist Oligarchy. The endeavor later ended in a political crisis that forced the Senate to intervene in the region and reign in the Oligarchy.\nFird was a Human male from the Core World of Alsakan who lived during the Great Peace of the Republic. Around the year 700 BBY, Fird served Alsakan as its legislative delegate in the Senate of the Galactic Republic. During this time, a proposal for the creation of an Outer Expansion Zone of Republic colonization was introduced to the Senate for review and a vote. The effort was supported by several of the galaxy's megacorporations, which were displeased with the Republic's slow pace of expansion into the Inner Rim territories north of the capital planet Coruscant and the Perlemian Trade Route.\nDuring the hearings on the Matter of Creating an Outer Expansion Zone, Senator Fird addressed the Republic Congress, weighing the benefits and drawbacks of continuing to allow only the central government to commission colonies. The initiative to create the Zone was eventually approved, and the Senate delegated the task of administering the new colonies to the Expansionist Oligarchy—a consortium of megacorporations who had been advocating for the creation of the region. The experiment ultimately failed, however, as the Oligarchy began to exploit the resources and native peoples in the Outer Expansion Zone. The resulting scandals and uprisings forced the Senate to step in and relieve the Expansionist Oligarchy of control.\nSenator Fird was a Human with dark brown hair, green eyes, black decorative markings on his face, and facial hair around his jawbone, mouth, and chin. He was an eloquent speaker, and during his testimony on the Matter of Creating an Outer Expansion Zone, Fird asserted that there were two paths that could be pursued as a result of the debate—government-controlled expansion or an effort with more emphasis on local and corporate initiatives. The Alsakan senator disliked both possibilities, but conceded that there may have been no third alternative choice.\nSenator Fird was first mentioned in The Complete Star Wars Encyclopedia, a compendium of information on subjects from the Star Wars universe, released in 2008. The senator's only other canon appearance is found in The Essential Atlas, wherein he was depicted in a portrait by Star Wars artist Chris Trevas.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Alsakan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Great_Peace_of_the_Republic",
  "/wiki/Senator/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Matter_of_Creating_an_Outer_Expansion_Zone",
  "/wiki/Standard_year/Legends",
  "/wiki/700_BBY",
  "/wiki/Outer_Expansion_Zone/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Expansionist_Oligarchy/Legends",
  "/wiki/Outer_Expansion_Zone_scandal",
  "/wiki/Time/Legends",
  "/wiki/Inner_Rim",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Perlemian_Trade_Route/Legends",
  "/wiki/Eye/Legends",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars",
  "/wiki/2008",
  "/wiki/Canon",
  "/wiki/The_Essential_Atlas",
  "/wiki/Chris_Trevas",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/1000_BBY",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends"
 ]
}