{
 "name": "First Guard",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Supremacy",
      "Crait system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "Elite Praetorian Guard",
      "Elite Praetorian Guard"
     ]
    }
   ]
  }
 ],
 "content": "The First Guard was an Elite Praetorian Guard who served as a bodyguard of Supreme Leader Snoke, ruler of the First Order. Equipped with segmented plate armor and an electro-bisento, the First Guard eschewed ranged weapons in favor of melee combat. The First Guard was killed on board the Supremacy when Kylo Ren, Snoke's dark side apprentice, betrayed him with the help of Rey, another Force-sensitive individual. Together they defeated and killed all of the Praetorian Guards in Snoke's throne room.\nThe First Guard was a member of the Elite Praetorian Guard—crimson warriors who served as the personal bodyguards of Supreme Leader Snoke of the First Order. The First Guard was stationed in Snoke's throne room along with the other Praetorian Guards at the time of Kylo Ren's audience with the Supreme Leader in 34 ABY. Angered by Snoke's disapproving appraisal of his defeat on Starkiller Base, the Master of the Knights of Ren took a step in his master's direction, causing the First Guard to snap into a combat stance against the dark apprentice as his fellows.\nThe First Guard was still present in the throne room when Ren returned with the Jedi learner Rey as his prisoner. However, instead of executing the former scavenger as Snoke ordered, Ren chose to assassinate his master—resulting in a confrontation between the two Force-sensitives and the Praetorian Guards. Like the other Praetorians, the First Guard attempted to avenge the slain Supreme Leader, engaging the traitorous apprentice and Rey. Ren stole the other guard's electro-bisento and fought First Guard with both his lightsaber and the other guard's electro-bisento. The other guard then attempted to fight Ren with his armored hands, and was able to parry Ren's lightsaber, but was then stabbed in the back with his own weapon and forced to the ground by Ren, who then turned his lightsaber and impaled him in the neck with one of the smaller blades protruding from the sides. First Guard was then able to wrangle his staff around Kylo Ren's neck. Rey noticed him in danger and threw her lightsaber to him, which he then swiftly ignited, through the Guard's head, instantly killing him.\nServing as Snoke's last line of defense, the First Guard was one of eight elite sentinels entrusted with the security of the Supreme Leader. Like the other Praetorian Guards, the First Guard was equipped with a suit of armor that was painful to the wearer, yet endured it out of unwavering loyalty and duty to the ruler of the First Order. A lethal and ever-vigilant sentry, the First Guard snapped into a combat stance when Ren took a step in Snoke's direction—his rage becoming too strong to contain. The guard resumed a standing posture when signaled by Snoke to stand down, yet nonetheless regarded the Supreme Leader's disciple with wary suspicion. As one of Snoke's guardians, the First Guard's fighting style was a mix of several forms of martial arts such as Teräs Käsi, Bakuuni Hand, Echani unarmed forms, and Nar Kanji \"Blind Alley\" techniques. After Snoke's death, rather than swearing loyalty to his master's murderer, the First Guard perished along with the other Praetorians while attempting to avenge the Supreme Leader.\nAs a member of the Elite Praetorian Guard, the First Guard wore a brilliant red uniform that deliberately evoked the memory of Emperor Sheev Palpatine's Royal Guard. Unlike the Emperor's guards, the First Guard's combat armor was not encumbered by ceremonial robes. Designed for flexibility, the First Guard's segmented plate armor also included large pauldrons to deflect vertical melee strikes. Foregoing ranged weaponry, the First Guard wielded an electro-bisento—a high-tech melee weapon with a tempered metal blade connected to an ultrasonic generator for greater lethality.\nThe First Guard first appeared along with the rest of the Elite Praetorian Guard in the sequel trilogy's 2017 film Star Wars: Episode VIII The Last Jedi, directed by Rian Johnson, and was first identified in Star Wars: The Last Jedi: The Visual Dictionary.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/34_ABY",
  "/wiki/Supremacy",
  "/wiki/Crait_system",
  "/wiki/Human",
  "/wiki/First_Order",
  "/wiki/Elite_Praetorian_Guard",
  "/wiki/Bodyguard",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Armor",
  "/wiki/Electro-bisento",
  "/wiki/Melee_weapon",
  "/wiki/Death",
  "/wiki/Ben_Solo",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Rey_Skywalker",
  "/wiki/Force-sensitive",
  "/wiki/Snoke%27s_throne_room",
  "/wiki/Color",
  "/wiki/Soldier",
  "/wiki/Time",
  "/wiki/Gender",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Starkiller_Base",
  "/wiki/Master_of_the_Knights_of_Ren",
  "/wiki/Knights_of_Ren",
  "/wiki/Throne",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Prisoner",
  "/wiki/Scavenger",
  "/wiki/Assassin",
  "/wiki/Kylo_Ren%27s_lightsaber",
  "/wiki/Crossguard_lightsaber",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Ter%C3%A4s_K%C3%A4si",
  "/wiki/Bakuuni_Hand",
  "/wiki/Echani_(martial_art)",
  "/wiki/Nar_Kanji",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Robe",
  "/wiki/Ultrasonic_generator",
  "/wiki/Sequel_trilogy",
  "/wiki/2017",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Rian_Johnson",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi_Adaptation_5",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_The_Last_Jedi_Activity_Book_with_Stickers",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded"
 ]
}