{
 "name": "First_Witch_of_the_Wyrd",
 "display_name": "First Witch of the Wyrd",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 19 BBY",
      "Cularin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarasin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Wyrd"
     ]
    }
   ]
  }
 ],
 "content": "The First Witch of the Wyrd was a female Tarasin Force witch who commanded the Wyrd witch coven during the latter years of the Galactic Republic. Around 19 BBY, the First Witch directed an unsuccessful attempt to corrupt the ch'hala trees of the planet Cularin and was killed in the process.\nThe First Witch of the Wyrd was a Force-sensitive Tarasin female who led the Wyrd, a coven of dark side Force witches active on the planet Cularin during the later stages of the Clone Wars. The First Witch had no name, having forsaken her given name as one of her first acts upon joining the Wyrd.\nBy around 19 BBY, the Wyrd had suffered various setbacks and the First Witch gathered with the remaining witches at an encampment in the jungles of Cularin. As a final gambit to restore the Wyrd's fortunes, the First Witch schemed to use teachings shared with the Wyrd by Len Markus, the leader of the Believers Sith cult, to turn Cularin's ch'hala trees  to the dark side. The First Witch believed that this would enable the Wyrd to control the ecology of Cularin and if the witches were unsuccessful at corrupting the ch'hala she planned to simply kill the trees instead. The witch Cheelru disagreed with the First Witch's scheme, believing that Wyrd should not risk killing the ch'hala as the damage that would be inflicted to Cularin would leave the coven little to rule over. The First Witch rejected this entreaty and had Cheelru imprisoned as punishment.\nAccompanied by the surviving members of the Wyrd's Inner Circle and elite guard, the First Witch ventured to the ch'hala Heart Tree and commenced a ritual to corrupt the trees. However, after they had been conducting the rite for eleven hours, the First Witch and her companions fell under attack from a group of freelance agents, forcing them to abandon the ritual. The First Witch then initiated her backup option and murdered her second-in-command to invoke the Path of Blood and destroy the ch'hala. However, the Jedi Master Lanius Qel-Bertuk sacrificed himself and merged his consciousness with the Heart Tree to allow it to fight off the First Witch's assault. The power unleashed by the First Witch then reverberated back onto her, causing her to explode. The surviving Wyrd members were defeated by the freelance agents shortly thereafter, resulting in the end of the Wyrd as an established force on Cularin.\nThe First Witch had dark-colored scales covered with twisting purple markings.\nThe First Witch of the Wyrd featured in A Plague of Darkness, a 2005 roleplaying adventure by Ronald A. Heintz that served as the first instalment of the Heart of Evil trilogy of RPGA's Living Force campaign. The 2001 Wizards.com article Liriana: Dark Force Witch of Cularin established the Tarasin female Liriana as leader of the Wyrd; the First Witch's name that she bore prior to joining the Wyrd is not stated in A Plague of Darkness and it is unclear whether she is intended to be Liriana or another Tarasin. The short story Reprieves, published on Wizards.com in 2005 makes reference to the Wyrd adept Kirasha receiving a mission from the leader of the Wyrd to investigate a drain in the Force strength of the followers of the Tarasin leader Dariana. The identity of the Wyrd leader in question is not specified and it unclear whether this individual was either the First Witch or Liriana.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Tarasin",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Wyrd",
  "/wiki/The_Force/Legends",
  "/wiki/Witch/Legends",
  "/wiki/Coven/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ch%27hala_tree",
  "/wiki/Planet/Legends",
  "/wiki/Death/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Wyrd_encampment",
  "/wiki/Jungle/Legends",
  "/wiki/Len_Markus",
  "/wiki/Believers",
  "/wiki/Sith_cult/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Cheelru",
  "/wiki/Inner_Circle",
  "/wiki/Wyrd_elite_guard",
  "/wiki/Heart_Tree",
  "/wiki/Ritual_of_the_Power_of_the_Dark",
  "/wiki/Standard_hour/Legends",
  "/wiki/First_skirmish_at_the_Heart_Tree",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Path_of_Blood",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/A_Plague_of_Darkness",
  "/wiki/2005",
  "/wiki/Ronald_A._Heintz",
  "/wiki/Heart_of_Evil_trilogy",
  "/wiki/RPGA",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/2001",
  "/wiki/Wizards.com",
  "/wiki/Liriana:_Dark_Force_Witch_of_Cularin",
  "/wiki/Liriana",
  "/wiki/Reprieves",
  "/wiki/Kirasha",
  "/wiki/Dariana",
  "/wiki/A_Hero_Seeks_Not_Vengeance",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Galactic_Standard_Calendar"
 ]
}