{
 "name": "Fitz_Roi",
 "display_name": "Fitz Roi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lenniera"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Fitz Roi was a male Human jatz musician from the Tapani sector who lived during the Galactic Civil War.\nRoi was famous because of his mastery with the Faln horn and the stage shows he managed. His career had been initially sponsored by a young female from House Barnaba, who was infatuated with Roi, but later on Roi found success by himself.\nRoi's family was native to Lenniera, but Roi himself was a successful star often touring, and he only visited his family's home rarely, preferring his own home at Esseles. Ever paranoid, Roi even leveled a plagiarism lawsuit at Acme Robopolish, a window-cleaning company, believing that their droids had stolen some of his songs.\nHe was deported from Rimma before he was to perform a concert due to his discharging of his pistols while in the Crystal Room of Teirra Parko. His fans rioted and caused several hundred thousands of credits damage to the city of Recardeon.\nRoi had two slugthrowers stolen from him by the thief known as Tombat. The slugthrowers were relics from the Manderon Period, and had been crafted, if rumors were to be believed, by legendary artisan Andel Tanner. Roi usually shot his guns off during the concert.\nAfter Roi's Summerside Tour was canceled, he chose to play at the Priole Danna Festival, a planetary event from Lamuir IV. During his play, his guns were stolen by the same Tombat who owned them in the first place. Due to his guns, his sponsor, Flangth-2-Go, eventually pulled their support with him.\nWhile performing at the Arcopola Baas Music Festival in Greccia, Roi debuted his new song Tymin' Downband. It was his first public appearance since the Priole Danna Festival two years earlier. He also announced he would start a new tour, beginning on the planet Gambolla.\nLater on, during a concert on Esseles, Roi was known because he went on stage dressed as a Jedi Knight.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lenniera",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jatz/Legends",
  "/wiki/Tapani_sector/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Faln_horn",
  "/wiki/House_Barnaba",
  "/wiki/Esseles/Legends",
  "/wiki/Acme_Robopolish",
  "/wiki/Window/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Rimma",
  "/wiki/Crystal_Room",
  "/wiki/Teirra_Parko",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Recardeon",
  "/wiki/Slugthrower/Legends",
  "/wiki/Tanda_Marelle",
  "/wiki/Manderon_Period",
  "/wiki/Andel_Tanner",
  "/wiki/Summerside_Tour",
  "/wiki/Priole_Danna_Festival",
  "/wiki/Lamuir_IV",
  "/wiki/Flangth-2-Go",
  "/wiki/Arcopola_Baas_Music_Festival",
  "/wiki/Greccia",
  "/wiki/Tymin%27_Downband",
  "/wiki/Standard_year/Legends",
  "/wiki/Gambolla",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Fitz_Roi",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Galaxywide_NewsNets",
  "/wiki/Star_Wars_Adventure_Journal_3",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/Star_Wars_Adventure_Journal_6",
  "/wiki/Star_Wars_Adventure_Journal_11",
  "/wiki/Lords_of_the_Expanse",
  "/wiki/The_New_Essential_Guide_to_Droids",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}