{
 "name": "Fiula Blay",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "28 ABY; Right to Rule",
      "above Borosk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yuuzhan Vong"
     ]
    }
   ]
  }
 ],
 "content": "Fiula Blay was a Yuuzhan Vong female who acted as an undercover agent leading a resistance cell within the Imperial Navy during the Yuuzhan Vong War. Blay utilized an organic cloaking device known as an ooglith masquer to appear Human. Following the Battle of Bastion in 28 ABY, Blay's identity was revealed by modified mouse droids programmed to detect Yuuzhan Vong infiltrators. She, along with other detected infiltrators and Yuuzhan Vong sympathizers, were summoned by Jedi Knight Jacen Solo to a staffing meeting aboard the Imperial Star Destroyer Right to Rule above the planet Borosk. At the meeting, the final infiltrator to arrive, Torvin Xyn, immediately attacked Solo, while Blay was killed by stormtroopers in the skirmish that followed.\nFiula Blay was a Yuuzhan Vong female who served as an undercover operative leading a resistance cell within the Imperial Navy with at least four other members during the Yuuzhan Vong War, in which the extra-galactic Yuuzhan Vong invaded the galaxy. She utilized an ooglith masquer, an organic cloaking device that made her appear as a plain-looking Human woman with gray hair tied up in a bun.\nFollowing the Battle of Bastion in 28 ABY, modified mouse droids programmed to detect disguised Yuuzhan Vong were sent ship-to-ship throughout the Imperial fleet to uncover infiltrators. The droids discovered Blay and two other cloaked Yuuzhan Vong and, by analyzing their communications, uncovered more than a dozen sympathizers. In order to avoid alerting them to their discovery, these infiltrators and sympathizers were summoned to a staffing meeting arranged by Jedi Knight Jacen Solo, who intended to bring their spying to an end. Quietly, the Imperial forces transferred the group to the Right to Rule, an Imperial I-class Star Destroyer stationed above the planet Borosk. First, the sympathizers were brought in individually to prevent them from recognizing their fellow conspirators. Blay arrived five minutes before the final sympathizer, showing no signs of suspicion, followed shortly after by the remaining two Yuuzhan Vong.\nAs they awaited the arrival of Torvin Xyn, the final infiltrator, Blay and her cloaked comrade remained undeterred by the meeting, though several of the sympathizers began to suspect the meeting's true nature. Upon Xyn's arrival, he realized Solo—who was present at the meeting—was a Jedi and immediately removed his masquer and launched an attack, with the other Yuuzhan Vong following suit shortly after. Without their vonduun crab armor and wielding only their amphistaffs, all three infiltrators were quickly killed, with Blay being cut down by stormtroopers and security droids. Afterward, Imperial Grand Admiral Gilad Pellaeon, who witnessed the meeting, lamented the unnecessary deaths of the infiltrators to a skeptical Solo.\nUpon her arrival at the meeting for the discovered Yuuzhan Vong infiltrators, Blay, believing her cover to be intact, remained calm and did not question why she was there. While the other spies present at the meeting began showing signs of concern as they realized why they were there, Blay and her fellow Yuuzhan Vong did not flinch or show any signs of worry. Blay only abandoned her disguise after Torvyn Xyn, a fellow Yuuzhan Vong, burst out of his disguise and launched an attack on Jacen Solo.\nAs an infiltrator, Blay relied on an ooglith masquer to operate in secret within the Imperial forces. Additionally, she was also equipped with an amphistaff and did not wear vonduun crab armor.\nFiula Blay appeared in the 2003 novel The New Jedi Order: Force Heretic I: Remnant, written by Sean Williams and Shane Dix.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/28_ABY/Legends",
  "/wiki/Right_to_Rule",
  "/wiki/Borosk/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cloaker",
  "/wiki/Spy/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Cloaking_device/Legends",
  "/wiki/Human/Legends",
  "/wiki/Battle_of_Bastion",
  "/wiki/YVH-M",
  "/wiki/Programmer/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Torvin_Xyn",
  "/wiki/Death/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Warrior_caste",
  "/wiki/Gene/Legends",
  "/wiki/Yuuzhan_Vong_galaxy",
  "/wiki/The_galaxy/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Fleet/Legends",
  "/wiki/MSE-series",
  "/wiki/Standard_minute/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Vonduun_crab/Legends",
  "/wiki/Vonduun_Skerr_Kyrric",
  "/wiki/Amphistaff",
  "/wiki/Security_droid/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Armor/Legends",
  "/wiki/2003",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_I:_Remnant",
  "/wiki/Sean_Williams",
  "/wiki/Shane_Dix",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}