{
 "name": "Flak_(clone_trooper)",
 "display_name": "Flak  (clone trooper)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "\"Flak\" was the nickname of a clone trooper who served in the Grand Army of the Republic during the Clone Wars. Around 21 BBY, Flak participated in an attempt to recapture the space station Juma 9. Serving with Commander Cody, Commander Ponds, and another trooper, Flak received orders from Jedi Generals Mace Windu and Kit Fisto to repair a group of condensators outside the station. Although they encountered heavy droid resistance, the group was able to repair the condensators and restore the energy inside Juma 9.\n\"Flak\" was the nickname of one of the many clones of the Mandalorian bounty hunter Jango Fett who were born on the planet Kamino and trained to fight in the Grand Army of the Republic during the Clone Wars. Around 21 BBY, the Republic space station Juma 9 was attacked and captured by Separatist forces. Jedi Generals Obi-Wan Kenobi and Plo Koon, who were on the station during the attack, went missing. Flak, along with Jedi Generals Mace Windu and Kit Fisto and Clone Commanders CC-2224 and CC-6454, nicknamed \"Cody\" and \"Ponds,\" respectively, went on a mission to search for the Jedi Masters and recapture Juma 9. While Fisto and Windu went inside the station, Flak and the other clone troopers patrolled outside of the station, using jetpacks to move in space.\nDuring the clones' patrol, Windu contacted them via comlink and ordered them to repair a group of energy condensators. While engaging several B1-Series battle droids, B2 super battle droids, and crab droids, the troopers managed to reconnect the electrical wiring of several consoles and restore the station's energy. Before they could repair the final consoles, however, Flak and the others were attacked by a Vulture droid and spider droids. After defeating the enemy droids with a rocket launcher, the Republic clones repaired the last two consoles and informed Windu of their success. Sometime later, the clones found two lightsabers drifting in space and reported this as well. Eventually, the Republic forces were able to rescue Kenobi and Koon, and retake Juma 9.\nFlak was not pleased with what he believed was an unspectacular mission to Juma 9 due to its distance from the war's main action. He complained about the task in front of his superior officers, as he preferred to spend his time fighting on the front lines, destroying droids. Like all clones of Jango Fett, Flak stood 1.83 meters tall.\nFlak used white Phase I clone trooper armor, a DC-15S, and a jetpack during the fight on Juma 9.\nFlak's first appearance was in the 2009 video game Star Wars: The Clone Wars: Republic Heroes. In the game, he was voiced by Dee Bradley Baker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Flak/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Battle_of_Juma_9",
  "/wiki/Space_station/Legends",
  "/wiki/Juma_9",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-2224/Legends",
  "/wiki/Commander/Legends",
  "/wiki/CC-6454",
  "/wiki/Trooper/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/General/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/B2_super_battle_droid/Legends",
  "/wiki/LM-432_crab_droid/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/DSD1_dwarf_spider_droid/Legends",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Time/Legends",
  "/wiki/Color/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/DC-15S",
  "/wiki/2009",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Clone_Wars:_Republic_Heroes",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Annual_2011"
 ]
}