{
 "name": "Flebek",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Meftian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems",
      "Confederacy military",
      "Confederacy military"
     ]
    }
   ]
  }
 ],
 "content": "Flebek was a Meftian female who served as a general in the military of the Confederacy of Independent Systems during the Clone Wars. Between 22 BBY and 20 BBY, she was sent by the Confederacy's Head of State Count Dooku to the planet Retta in order to discover the secret to the Segredo Kreeda's invisibility, but the Jedi Generals Anakin Skywalker and Yoda intervened in her plans. The Jedi deceived Flebek into believing that the secret was just a Jedi trick and forcing her to flee the planet.\nFlebek was a Meftian female general in the military of the Confederacy of Independent Systems during the Clone Wars. She was sent to the Wild Space planet of Retta in between 22 BBY and 20 BBY, by the Head of State of the Confederacy and Dark Lord of the Sith Count Dooku to find a hidden secret located on the planet. She deployed B1-series battle droids to the surface of the planet to locate this secret. A OOM command battle droid contacted Flebek via a handheld holoprojector and reported to her that the jungle they were investigating was uninhabited with no signs of sentient life forms. Flebek ordered the commander to continue the search and reminded the battle droid that the secret the Confederacy sought must be found and ended the call. The commander noted that the general was being snappy and ordered the battle droids to continue the search.\nShortly after, the Jedi overheard a battle droid reporting lightsaber damage to Flebek. Flebek then came to the conclusion that there were on the planet. Flebek then overheard Skywalker who was wearing a cloaking cap-which was a fake cloaking device that was a Kyuzo war shield- and claimed that it was making him invisible. Flebek fell for the trick and ran after Skywalker but was surprised when he was not invisible. Yoda then secretly eliminated Flebek's battle droids but Skywalker made the Separatist general believe that the droids had vanished. Skywalker then activated his lightsaber and suggested to Flebek that he make her disappear too. She was then contacted over a comlink to report her situation when she aborted the mission, believing that the secret was just a Jedi trick and fled the planet.\nFlebek was a female Meftian with white skin and grey eyes. Flebek gave orders to the battle droids that served under her and was known for being snappy. After being tricked by the Jedi she feared for her safety and fled the planet, being noted as a coward by Skywalker.\nFlebek wore a black and red outfit with black boots along with grey belt and pants. She also wore a cape of red and black. She used a blaster pistol and a comlink.\nFlebek appeared in the comic \"Hide and Seek\", which was published in the twentieth issue of the anthology comic series Star Wars Adventures. The comic was written by Cavan Scott, illustrated by Derek Charm, and published on April 17, 2019",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Meftian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Confederacy_military",
  "/wiki/General",
  "/wiki/Clone_Wars",
  "/wiki/22_BBY",
  "/wiki/20_BBY",
  "/wiki/Head_of_State",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Planet",
  "/wiki/Retta",
  "/wiki/Mission_to_Retta",
  "/wiki/Segredo",
  "/wiki/Kreeda",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Yoda",
  "/wiki/Wild_Space",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/B1-series_battle_droid",
  "/wiki/OOM_command_battle_droid",
  "/wiki/Holoprojector",
  "/wiki/Jungle",
  "/wiki/Sentience",
  "/wiki/Commander",
  "/wiki/Battle_droid",
  "/wiki/Lightsaber",
  "/wiki/Cloaking_cap",
  "/wiki/Cloaking_device",
  "/wiki/Kyuzo_war_shield",
  "/wiki/Droid",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Comlink",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Cape",
  "/wiki/Blaster_pistol",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Hide_and_Seek",
  "/wiki/Star_Wars_Adventures_(2017)_20",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Cavan_Scott",
  "/wiki/Derek_Charm",
  "/wiki/April_17",
  "/wiki/2019",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/The_Clone_Wars:_Season_Four"
 ]
}