{
 "name": "Flesh_Raider_Ravager_Chieftain",
 "display_name": "Flesh Raider Ravager Chieftain",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tython"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Flesh Raider"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark grey and white stripes"
     ]
    }
   ]
  }
 ],
 "content": "The Ravager Chieftain was a Flesh Raider who lived on the Deep Core planet of Tython during the Cold War. A Force-sensitive, the native was killed by the Padawan of Jedi Master Orgus Din in a battle during the Flesh Raider uprising of 3643 BBY.\nA Force-sensitive Flesh Raider, the Ravager Chieftain commanded other Force-wielding Adepts in the Flesh Raider uprising on Tython in 3643 BBY. The Dark Jedi Bengel Morr, who was commanding the natives' invasion in order to destroy the Jedi Order, gave the chieftain a holocron and sent the group to an ancient shrine near the ruins of the temple Kaleth to learn from the device.\nHowever, the Flesh Raider and Adepts were interrupted by the apprentice of Jedi Master Orgus Din, who had been sent to investigate activity in the area. The Jedi was astonished to hear the Flesh Raider speak, as the Order had believed the natives were not sentient. The Ravager Chieftain then blasted the Padawan with the Force, attacking the Jedi with the Adepts. However, the Chieftain and Adepts were killed by the Padawan, and the holocron was recovered off of the Chieftain's corpse by Jedi Master Bela Kiwiiks.\nThe Ravager Chieftain had black eyes and grey skin with white stripes.\nThe Flesh Raider was able to use the Force to push his opponents and to use a sword to attack them.\nThe Ravager Chieftain wore orange and blue armor and brown gloves and boots. The Flesh Raider was also armed with a vibrosword.\nThe Ravager Chieftain appears in the BioWare video game Star Wars: The Old Republic, in the Jedi Knight mission \"Enemy Force.\" There are multiple dialogue options with the Ravager Chieftain that the player can choose, but they do not change the Chieftain's response or player's alignment.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Tython/Legends",
  "/wiki/3643_BBY",
  "/wiki/Flesh_Raider",
  "/wiki/Color/Legends",
  "/wiki/Deep_Core/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Death/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Orgus_Din",
  "/wiki/Skirmish_at_the_ancient_shrine",
  "/wiki/Flesh_Raider_uprising",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Bengel_Morr",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Ancient_shrine",
  "/wiki/Kaleth",
  "/wiki/Sentience/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Bela_Kiwiiks",
  "/wiki/Eye/Legends",
  "/wiki/Sword/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Vibrosword/Legends",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Category:Images_of_Flesh_Raider_Ravager_Chieftain",
  "/wiki/Template:TOR_dates",
  "/wiki/Standard_year/Legends"
 ]
}