{
 "name": "Flim",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Remnant",
      "Sinister Triumvirate",
      "Sinister Triumvirate"
     ]
    }
   ]
  }
 ],
 "content": "Flim was a Human male con artist who played a pivotal role in 19 ABY in Imperial Remnant Moff Vilim Disra's plot to destroy the New Republic, disguising himself as the Chiss Grand Admiral Mitth'raw'nuruodo \"Thrawn,\" who had died during his campaign against the New Republic, as part of Disra's Sinister Triumvirate with Imperial Major Grodin Tierce.\nWhile instilling fear in the New Republic and meeting several New Republic senators and representatives and Imperial Remnant military officers, Flim led the Imperial Starfleet as Thrawn. Eventually, however, shortly before the con artist and Disra attacked the New Republic, Imperial Supreme Commander Gilad Pellaeon, who did not believe Thrawn had returned from the dead, revealed that Flim was a con artist. Subsequently, the Sinister Triumvirate was dissolved, with Flim expressing relief that his acting as Thrawn had come to an end.\nIn 19 ABY, Vilim Disra, a member of the Imperial Remnant's Council of Moffs, proposed a military position to former Royal Guard Grodin Tierce shortly after a meeting with the other Moffs and Imperial Supreme Commander Gilad Pellaeon on the Outer Rim Territories planet Bastion. To convince him to accept, the Moff presented Flim, his ally, who was posing as the Chiss Grand Admiral named Thrawn. The plan called for the exploitation of the Caamas Document Crisis in which Imperial agents spread rumors that the Bothans were guilty of the massacre on Caamas many decades prior. Though some Bothans were to blame for the Caamas incident, the rumors spread made certain that all facts were exaggerated, which prompted a military stand-down between factions within the New Republic in orbit over Bothawui. Flim spent hours studying Thrawn's history to learn all he could to keep the scheme intact. Even Captain Dorja of the Star Destroyer Relentless, an officer who had served under Thrawn's command, was convinced it was really Thrawn. Shortly after allying himself with Disra and Tierce, Flim revealed himself to Lando Calrissian and Diamal Senator Porolo Miatamia. After this was revealed to the Senate, turmoil ensued. Many did not believe the reports, although some, such as Han Solo and his wife, High Councilor Leia Organa Solo believed it all too well. Few Imperials were told that Thrawn had \"returned\".\nWhen Supreme Commander Gilad Pellaeon heard of these rumors, he was unsure if they were true, as he had been present when Rukh had killed his mentor a decade before. Pellaeon, on a visit to Bastion to accuse Moff Disra of treason along with other crimes against the Empire, discovered a set of datacards in the Moff's desk when left alone in his office. He decrypted these and later met with Talon Karrde, who gave him a datacard that he had been given by Jorj Car'das. Along with the ones he took from Disra, they revealed the truth about Flim and Tierce. On Karrde's ship, the Wild Karrde, he traveled to confront Flim, Disra and Tierce at Yaga Minor, where they were battling the Errant Venture. Pellaeon revealed that Flim was an impostor, that Tierce was a clone, and that Disra was indeed guilty of many crimes, including plotting to overthow the Supreme Commander and funneling of money to suit his own purposes. Tierce was killed, and Flim surrendered both himself and his \"command\" without a fight—indeed, he expressed relief that the affair was over.\nFlim was not a Chiss like Thrawn, but a Human or very similar Near-Human who disguised himself using blue makeup, hair dye, and glowing red contact lenses. He demonstrated to Major Tierce and Moff Disra his ability to quickly remove these lenses during a meeting on Yaga Minor.\nThe con man Flim was skilled in posing and acting as others, being able to replicate Thrawn's voice, appearance, and demeanor impeccably.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Sinister_Triumvirate",
  "/wiki/Con_artist/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Vilim_Disra",
  "/wiki/Caamas_Document_Crisis",
  "/wiki/New_Republic/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Core_name/Legends",
  "/wiki/Death/Legends",
  "/wiki/Thrawn_campaign",
  "/wiki/Major/Legends",
  "/wiki/Grodin_Tierce_(clone)",
  "/wiki/Senator/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bastion/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Bothawui/Legends",
  "/wiki/Dorja",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Relentless_(Dorja)",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Diamal",
  "/wiki/Porolo_Miatamia",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/High_Councilor",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Rukh/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Talon_Karrde",
  "/wiki/Jorj_Car%27das",
  "/wiki/Wild_Karrde",
  "/wiki/Yaga_Minor/Legends",
  "/wiki/Errant_Venture/Legends",
  "/wiki/Near-Human",
  "/wiki/Specter_of_the_Past",
  "/wiki/Specter_of_the_Past_(unabridged_audiobook)",
  "/wiki/Vision_of_the_Future",
  "/wiki/Vision_of_the_Future_(unabridged_audiobook)",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Red_Sky,_Blue_Flame",
  "/wiki/Star_Wars_Gamer_7",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_102",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galaxy_at_War",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Hand_of_Thrawn_Duology",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Essential_Atlas"
 ]
}