{
 "name": "Flint_Torul",
 "display_name": "Flint Torul",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "over Belderone"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Flint Torul was a male Human Jedi Knight who served the Jedi Order and the Galactic Republic as a General in the Grand Army of the Republic during the Clone Wars; a conflict in which Torul gave his life. Unbeknownst to the Order, Torul had sired a child who survived him by several decades.\nA Force-sensitive, Flint Torul was discovered by the Jedi Order and inducted into their academy on Coruscant to study the Force. Living in the Jedi Temple for much of his life, Torul went on to pass his Trials of Knighthood and ascended to the rank of Jedi Knight. When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Jedi Torul dutifully answered the Jedi High Council's call to arms and took up the rank of General within the newly formed Grand Army of the Republic.\nIn the final year of the war, Torul was stationed on Belderone when the planet faced an attack from the Confederacy. While aiding in the hasty evacuation, Torul had a secret affair with a local woman named Zana; fathering a child. Not long after their meeting, Torul was flying with 27 other Jedi when General Grievous attacked the evacuation convoy. Unleashing the firepower of his fully armed, modified Providence-class carrier/destroyer named Invisible Hand, Grievous vaporized all of the Jedi and many refugee ships.\nSurvived by his lover and his son Flint, Torul's memory would give his namesake an idol in an increasingly darkening time as the Galactic Empire wiped out all vestiges of the Republic and the Jedi Order. Despite the good influence that his role as a Jedi would play on young Flint, the young man fell to the dark side of the Force when his mother was killed and he went on to become the Dark Lady Lumiya's Sith apprentice. Eventually, however, Flint returned to the light and became a benevolent ambassador to the Firrerreo.\nFlint Torul was mentioned in Star Wars Annual  3, written by Mary Jo Duffy and released in 1983.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Belderone/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Flint",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Coruscant/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Zana",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Providence-class_carrier/destroyer",
  "/wiki/Invisible_Hand/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Lumiya",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Firrerreo/Legends",
  "/wiki/Star_Wars_Annual_(1977)_3",
  "/wiki/Mary_Jo_Duffy",
  "/wiki/1983",
  "/wiki/Star_Wars_Insider",
  "/wiki/Unknown_Soldier:_The_Story_of_General_Grievous",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/StarWars.com",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Alien_Species"
 ]
}