{
 "name": "Floria",
 "display_name": "Floria",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Thracior"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Floria was a Human female bounty hunter from Thracior in the decade before the outbreak of the Clone Wars. She was part Hnsi and Tantt.\nFloria and her brother, Dane, were orphaned when their mother's tribe burned down their house, because their family intermarried.\nThe siblings found work at a café, though their employer treated them cruelly. When they found out that he was wanted on a nearby planet, they tricked him into getting caught. Realizing that manhunting was a more profitable industry than food service, Floria and Dane took up careers in bounty hunting. Granta Omega later hired them, along with four other bounty hunters, to capture Obi-Wan Kenobi and Anakin Skywalker during training on Ragoon VI, but Floria and Dane found themselves assisting the Jedi, instead.\nYears later, they became bodyguards for Samish Kash, and Floria found herself falling in love with the Delalunan leader. When Samish was shot on Null, Dane and Floria were accused of the attempted assassination. Samish survived, though, and his friend, Lorian Nod, informed Floria that he was alive. She and Dane reunited with Kenobi and Skywalker during the events on Null, and the two Jedi were able to prove that the siblings were innocent of the attempted murder charges.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Thracior",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Hnsi",
  "/wiki/Tantt",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Ragoon_VI",
  "/wiki/Dane_(bounty_hunter)",
  "/wiki/Granta_Omega",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Samish_Kash",
  "/wiki/Null/Legends",
  "/wiki/Lorian_Nod",
  "/wiki/Jedi_Quest:_The_Trail_of_the_Jedi",
  "/wiki/Jedi_Quest:_The_Dangerous_Games",
  "/wiki/Jedi_Quest:_The_Master_of_Disguise",
  "/wiki/Legacy_of_the_Jedi",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}