{
 "name": "Flufto",
 "display_name": "Flufto",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Son-tuul"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 3 ABY",
      "Son-tuul"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3 ABY",
      "Skako Minor",
      "c. 3 ABY",
      "Lucrehulk Prime",
      "c. 3 ABY",
      "Hivebase-1"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tooka"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Son-tuul Pride",
      "Chelli Lona Aphra's crew",
      "Chelli Lona Aphra's crew"
     ]
    },
    {
     "name": "Owner(s)",
     "values": [
      "Chelli Aphra"
     ]
    }
   ]
  }
 ],
 "content": "Flufto was the nickname of a batch of cloned and customized male Tookas owned by the rogue archaeologist Doctor Chelli Aphra. Aphra cloned over sixty of them in a laboratory on the Outer Rim planet Son-tuul. Each clone was modified with bio explosives in its genes and would explode in response to the codephrase \"Snugglebum Oogiewoogie.\"\nAphra kept the Tookas shrink frozen in a crate, keeping her own Flufto on her during her mission to the planet Skako Minor. Her first Tooka was detonated to wipe out an Imperial squad that surrounded Aphra's crew. Another was then taken out, but eventually used as a projectile explosve on the cyborg creature known as a Chthonic worm god.\nWhen Aphra's crew visited the Rebel Alliance flight school, the Lucrehulk Prime, her Flufto was allowed to run into the school's control core so that she could chase it inside. The rotation general, Hera Syndulla, shot the Tooka dead. Aphra and her team infiltrated the Imperial complex Hivebase-1 shortly after, where the rogue archaeologist allowed her remaining Tookas to defrost and escape, spreading out through the base before they were detonated thanks for some name changing in the firing registry.\nAround 3 ABY, the rogue archaeologist Doctor Chelli Aphra was forced to work for the Son-tuul Pride syndicate and its most recent leader, the assassin droid 0-0-0. After the droid granted Aphra her own laboratory on the Outer Rim Territories planet Son-tuul, where she used an old splicer rig to clone a male member of the feline Tooka species, the doctor having kept one of the creatures as a pet when she was younger. The new Tooka was modified with bio explosive in his genes so that the feline could explode in response to the codephrase \"Snugglebum Oogiewoogie\" and at least sixty copies of it were made and shrink frozen in a crate.\nAphra carried one of the Tookas around with her, naming him Flufto. When 0-0-0 questioned what she was carrying, calling him a hairy outgrowth, the rogue archaeologist mentioned her work with the Tooka cloning. The doctor was then introduced to a new crew of mercenaries for her new mission to find the assassin droid's lost memories, being required to choose a crewmember to not bring with her. Rexa Go—0-0-0's cyborg muscle and the only other mercenary besides Aphra to know the true target of the mission—suggested leaving behind Flufto, but Aphra raised her blaster at the cyborg, telling Go that she would die if she touched the Tooka. Ultimately, the swordsman Rabael Dir Glorio was left behind while Aphra and her crew voyaged to their first destination, the planet Skako Minor.\nOn Skako Minor, Aphra's crew was guided to the location of the Techno Union foreman Wat Tambor's workshop by the Skakoan guide Hallio Bas. However, the guide was working with the Galactic Empire and a trap was laid for Aphra's crew by an Imperial squad. After the lead Imperial officer ordered the deaths of the mercenaries, Aphra gave Flufto to Bas, asking that he looked after the Tooka. The Skakoan accepted it, believing it would be a worthy meal for his people. That was when Aphra recited Flufto's detonation codephrase, causing an explosion that wiped out the Imperial squad. In the wake of the fireball, Go confirmed with the rogue archaeologist that Flufto had been a customized Tooka.\nGo put down her crate for Aphra to retrieve one of the shrink frozen Tookas, a new Flufto, other members of the crew having assumed the contents of the crate was alcohol. The crew began exploring Tambor's workshop, but were attacked by Imperial forces led by Lieutenant-Inspector Magna Tolvan. The skirmish activated the cyborg creature known as a Chthonic worm god, which attacked both parties. In the chaos, Aphra, carrying Flufto found herself stuck with Tolvan, making the Imperial throw her Tooka at the worm god while she shouted the codephrase to make him a projectile bomb. While the explosive Tooka attack did not defeat the creature, it was ultimately killed by Aphra's crew, which looted and departed Tambor's workshop after.\nAphra took another Flufto out of the crate before her crew disembarked at the Lucrehulk Prime, a Lucrehulk-class Battleship the Rebel Alliance's flight school. Aphra, carrying Flufto, and her crew were given a tour of the school by the Alliance officer Bini, who thought they were recruits. However, the rogue archaeologist was actually intending on kidnapping the Lucrehulk Prime's rotation general, Hera Syndulla, as part of her plan to infiltrate the Empire's Tarkin Initiative research and development complex Hivebase-1, where the doctor had learned 0-0-0's lost memories were stored.\nDuring Bini's tour, Aphra allowed Flufto to get loose and run into the Lucrehulk Prime's control core, being attracted to the high energy field. Although the core was restricted of access, the rogue archaeologist used her Tooka's rogue behaviour as an excuse to run inside after him, much to Bini's distress. The weapons alarm also set off due to Flufto's bio explosive induced genes. Aphra climbed and pretended to try and grab the feline while she bugged the control core's systems with her electric tattoos. That was when Syndulla, who had been using to control core to remotely control some of the flight school's training X-wing starfighters, shot Flufto dead.\nAphra and her crew were successful in capturing General Syndulla and were able to use their possession of the rebel leader to get close to Hivebase-1 while allowing the Lucrehulk Prime to follow them to the complex as a distraction while they infiltrated the base. After covertly landing in the hangar, Aphra's crew began their search for Hivebase-1's database. The cyborg mercenary Caysin Bog asked whether the rogue archaeologist wanted to bring another Flufto, but Aphra turned the option down, claiming that the Tookas' attraction to energy sources might cause a mess. Secretly, that was exactly Aphra's intention, as she gave the crate a hit before she left, allowing the lid to open slightly and affect the shrink-freezing of the remaining Tookas.\nWhile Aphra and her crew made it to Hivebase-1's datacore, the Tookas defrosted and escaped from the crate, running free through the Tarkin Initiative complex. Several of the felines found the idle Dek-Nil, a droid from Aphra's crew, who startled the creatures by springing back to life, going on to use a dataport to change the names in the base's firing registry. As the Tookas continued to spread out through Hivebase-1, the base's Commander Yewl ordered for its weapons to fire on Lucrehulk Prime, which Aphra had used, through her bug, to rip the steal the complex's datacore using a tractor beam. However, the Imperial officer giving the orders read the tampered firing registry, which included \"Snugglebum Oogiewoogie,\" over the comms, detonating all of the Tookas simultaneously and destroying Hivebase-1.\nA male Tooka, each clone of Flufto had black skin, purple fur. A clone's face was white with black eyes encased in purple eye masks, and the feline was customized with bio explosives in his genes. When activated for detonation, Flufto clone's eye masks gave a red glow. The Tooka clones were also attracted to energy sources and fields.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Son-tuul",
  "/wiki/3_ABY",
  "/wiki/Skako_Minor",
  "/wiki/Cloning",
  "/wiki/Lucrehulk_Prime",
  "/wiki/Hivebase-1",
  "/wiki/Tooka",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Son-tuul_Pride",
  "/wiki/Chelli_Lona_Aphra%27s_crew",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Archaeologist",
  "/wiki/Doctor",
  "/wiki/Laboratory",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Mission_to_Skako_Minor_(Son-tuul_Pride)",
  "/wiki/Galactic_Empire",
  "/wiki/Squad",
  "/wiki/Cyborg",
  "/wiki/Chthonic_worm_god",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Death",
  "/wiki/Infiltration_of_Hivebase-1",
  "/wiki/Assassin_droid",
  "/wiki/0-0-0",
  "/wiki/Droid",
  "/wiki/Feline",
  "/wiki/Species",
  "/wiki/Youngling",
  "/wiki/Mercenary",
  "/wiki/Rexa_Go",
  "/wiki/Sword",
  "/wiki/Rabael_Dir_Glorio",
  "/wiki/Techno_Union",
  "/wiki/Foreman",
  "/wiki/Wat_Tambor",
  "/wiki/Wat_Tambor%27s_workshop",
  "/wiki/Skakoan",
  "/wiki/Hallio_Bas",
  "/wiki/Imperial_officer",
  "/wiki/Alcohol",
  "/wiki/Lieutenant-Inspector",
  "/wiki/Magna_Tolvan",
  "/wiki/Sister_Six",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Alliance_officer",
  "/wiki/Bini",
  "/wiki/Tarkin_Initiative",
  "/wiki/X-wing_starfighter",
  "/wiki/Capture_of_Hera_Syndulla",
  "/wiki/Caysin_Bog",
  "/wiki/Dek-Nil",
  "/wiki/Commander",
  "/wiki/Yewl",
  "/wiki/Tractor_beam",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Doctor_Aphra_(2016)_15",
  "/wiki/Doctor_Aphra_(2016)_16",
  "/wiki/Doctor_Aphra_(2016)_17",
  "/wiki/Doctor_Aphra_(2016)_18",
  "/wiki/Doctor_Aphra_(2016)_19",
  "/wiki/Doctor_Aphra_(2016)_38",
  "/wiki/Doctor_Aphra_(2016)_14",
  "/wiki/2016",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Template:Aphra2016Date",
  "/wiki/Darth_Vader_(2015)_7",
  "/wiki/Databank_(website)",
  "/wiki/Doctor_Aphra_(2016)_21"
 ]
}