{
 "name": "Flyby",
 "display_name": "Flyby",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Shadow Squadron",
      "Shadow Squadron"
     ]
    }
   ]
  }
 ],
 "content": "\"Flyby\" was the nickname of a clone trooper pilot who served in Shadow Squadron, a starfighter unit in the Republic Navy. In 22 BBY, during the Clone Wars, Flyby—using the call sign \"Shadow Six\"—and his unit accompanied Jedi General Anakin Skywalker on a mission to destroy the Confederate warship Malevolence. During the mission, Flyby piloted his BTL-B Y-wing starfighter through the Kaliida Nebula, where he evaded massive neebrays with the rest of his squadron. Arriving at the Kaliida Shoals Medical Center, which the Malevolence had taken as its target, the squadron was forced to escape an ion ray launched by the warship's ion cannon. However, Flyby was unable to avoid the ray, and his starfighter was left disabled in space.\nThe clone trooper pilot nicknamed \"Flyby\" served the Galactic Republic in Shadow Squadron—a starfighter unit in the Republic Navy—using the call sign \"Shadow Six.\" Born on the planet Kamino, Flyby was decanted from the Mandalorian bounty hunter Jango Fett. In 22 BBY during the Clone Wars, after the loss of a Republic task force in the Abregado system, the Republic learned about the Malevolence, a Subjugator-class heavy cruiser constructed by Free Dac Volunteers Engineering Corps for the Confederacy of Independent Systems. The warship possessed twin ion cannons that were capable of disabling enemy ships. Jedi General Anakin Skywalker devised a plan to stop the Confederate cruiser from destroying the Kaliida Shoals Medical Center, which the commander of the Malevolence, General Grievous, had taken as his next target. Shadow Squadron, under the command of Skywalker; his Padawan, Ahsoka Tano; and Jedi Master Plo Koon; would take a shortcut to the medical center and attempt to destroy the bridge of the Malevolence to kill Grievous.\nAfter departing from the Venator-class Star Destroyer Resolute in BTL-B Y-wing starfighters, Skywalker contacted Flyby and his squadmates, who checked in with their Jedi General. The squadron jumped to hyperspace and emerged at the Kaliida Nebula. Flyby—along with his astromech droid R5-U8—followed his fellow pilots into the nebula, where they faced massive neebrays inhabiting it. Managing to evade the creatures without any casualties, Flyby and his squadron left the Kaliida Nebula behind them, arriving at the medical center. Soon after their arrival, the Malevolence emerged from hyperspace. Grievous ordered his ship's crew to target the approaching Republic starfighters and launched an ion ray from one of its ion cannons. Skywalker ordered the pilots to take evasive action, but Flyby was among several other pilots who were unable to pilot their BTL-B Y-wing starfighters away in time. With his starfighter's power disabled, Flyby was left in space while the rest of Shadow Squadron continued toward the Malevolence.\nWhen the Malevolence launched an ion ray from one of its ion cannons, Flyby was unable to pilot his BTL-B Y-wing starfighter away from the ray in time, leaving his starfighter disabled.\nFirst appearing in \"Shadow of Malevolence,\" the third episode of the Star Wars: The Clone Wars television series' first season, the clone trooper pilot nicknamed \"Flyby\" was voiced by Dee Bradley Baker, who voices all clone troopers in the show. He remained unnamed in \"Shadow of Malevolence\", but was named in the August 2011 sourcebook Star Wars: The Clone Wars: Incredible Vehicles.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Shadow_Six",
  "/wiki/Flyby",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Shadow_Squadron/Legends",
  "/wiki/Clone_trooper_pilot/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Republic_Navy",
  "/wiki/22_BBY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Call_sign",
  "/wiki/Jedi_General/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Battle_of_the_Kaliida_Nebula/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Malevolence/Legends",
  "/wiki/BTL-B_Y-wing_starfighter",
  "/wiki/Kaliida_Nebula/Legends",
  "/wiki/Neebray/Legends",
  "/wiki/Kaliida_Shoals_Medical_Center/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Battle_of_Abregado/Legends",
  "/wiki/Abregado_system/Legends",
  "/wiki/Subjugator-class_heavy_cruiser/Legends",
  "/wiki/Free_Dac_Volunteers_Engineering_Corps/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Commander/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Balmorra_Run/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Death/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Resolute/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/R5-U8/Legends",
  "/wiki/Nebula/Legends",
  "/wiki/Time/Legends",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Trooper/Legends",
  "/wiki/August",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Clone_Wars:_Incredible_Vehicles",
  "/wiki/Star_Wars:_The_Clone_Wars:_Lightsaber_Duels",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Rising_Malevolence",
  "/wiki/The_Clone_Wars_Campaign_Guide",
  "/wiki/The_Clone_Wars:_Secret_Missions_1:_Breakout_Squad"
 ]
}