{
 "name": "FN-1824",
 "display_name": "FN-1824",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "FN Corps",
      "FN Corps"
     ]
    }
   ]
  }
 ],
 "content": "FN-1824 was a human male stormtrooper who served in the forces of the First Order during the New Republic Era. Following the Battle of Takodana in 34 ABY, FN-1824 was assigned to guard Rey, a Force-sensitive scavenger held captive by Kylo Ren aboard Starkiller Base. Using her latent Force abilities, Rey used a Jedi mind trick on FN-1824 to force him into releasing her from captivity. Her first two efforts failed, but she finally succeeded at using the Jedi ability. FN-1824 unlocked Rey's restraints and, on her command, left his F-11D blaster rifle behind before leaving her. The trooper was eventually located in his quarters and questioned. He was confused and had no memory of what had happened.\nFN-1824 appeared in the 2015 film Star Wars: Episode VII The Force Awakens, in which he was portrayed by Daniel Craig. In both the film's adult and junior novelizations, when Rey's first attempt at a mind trick fails, the guard simply stares at her. Rey succeeds on her second attempt. Additionally, in the novelizations, Rey instructs the guard to return to his quarters and he also promises to speak of the encounter to no one.\nAmong the filming crew, the character was dubbed FN-007. The cameo came about as Craig was at Pinewood Studios preparing for his next James Bond film, and asked if he could be involved. Craig expected his role to merely be in the background a la the stormtrooper who bumps his head in A New Hope, and was surprised to learn he would be in an entire scene. He was even more surprised when, instead of having someone else voice the character, Abrams had him come in for a 3 hour ADR session.\nThis stormtrooper was nicknamed \"JB-007\" by fans, referring to Craig's role as James Bond, agent 007. In the video game LEGO Star Wars: The Force Awakens, he is identified as FN-1824. Despite the game being non-canon, story group member Pablo Hidalgo confirmed on Twitter that the names provided by the game for previously unidentified characters, including FN-1824, were considered canon.\nThe scene featuring the character in William Shakespeare's The Force Doth Awaken: Star Wars Part the Seventh, a retelling of the film The Force Awakens in Shakespearean style, includes nods to Daniel Craig and the James Bond franchise. The first letter of each sentence in his initial dialogue to Rey spells out \"Daniel Craig,\" and in a later line he states \"I'll tighten up thy bonds, make thee a specter,\" a reference to the James Bond film Spectre, which featured Craig as Bond.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/First_Order",
  "/wiki/FN_Corps",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/First_Order_military",
  "/wiki/New_Republic_Era",
  "/wiki/Battle_of_Takodana",
  "/wiki/34_ABY",
  "/wiki/Rey_Skywalker",
  "/wiki/Force-sensitive",
  "/wiki/Scavenger",
  "/wiki/Prisoner",
  "/wiki/Ben_Solo",
  "/wiki/Starkiller_Base",
  "/wiki/The_Force",
  "/wiki/Force_power",
  "/wiki/Jedi",
  "/wiki/Mind_trick",
  "/wiki/F-11D_blaster_rifle",
  "/wiki/Trooper",
  "/wiki/2015",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Daniel_Craig",
  "/wiki/Wanten",
  "/wiki/Video_game",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/Pablo_Hidalgo",
  "/wiki/William_Shakespeare%27s_The_Force_Doth_Awaken:_Star_Wars_Part_the_Seventh",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens:_Finn%27s_Story",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_5",
  "/wiki/Disney_Magic_Kingdoms",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_68",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/2016",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Before_the_Awakening",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Entertainment_Weekly",
  "/wiki/December_17",
  "/wiki/August_10",
  "/wiki/2020",
  "/wiki/J.J._Abrams",
  "/wiki/September_27",
  "/wiki/2021",
  "/wiki/September_28",
  "/wiki/January_3",
  "/wiki/October_1",
  "/wiki/2018",
  "/wiki/March_22",
  "/wiki/File:Pablo_lego_character_name_confirmation.png"
 ]
}