{
 "name": "FN-417",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Takodana"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "FN Corps",
      "FN Corps"
     ]
    }
   ]
  }
 ],
 "content": "The First Order stormtrooper FN-417 was one of many deployed to the planet Takodana in 34 ABY to recover the Resistance astromech droid BB-8. As the First Order's forces attacked the castle of the pirate Maz Kanata, where the droid had been sighted, FN-417 moved into the surrounding woods. While being ordered to hold position, the trooper was spotted by the scavenger Rey, an ally of BB-8. After Rey failed to fire an initial shot from her NN-14 blaster pistol due to the weapon's safety still being on, the stormtrooper fired off one shot before being killed by the scavenger.\nFN-417 was a human who served in the FN Corps, a stormtrooper unit in the First Order's military during their conflict with the New Republic–backed Resistance. In the year 34 ABY, the trooper was amongst many deployed to the planet Takodana in order to recover the Resistance astromech droid BB-8, who had been sighted in the castle of the pirate Maz Kanata. As the attack on the castle began, FN-417 moved into the surrounding forest but was ordered to hold position via radio.\nOverhearing the order from nearby, the scavenger Rey attempted to shoot the stormtrooper, but failed in her first attempt as the safety of her NN-14 blaster pistol was still on. Before she had another chance to shoot, FN-417 turned and opened fire but missed. Rey then fired off two more shots with her pistol, the second of which hit and killed the trooper; however, she was captured shortly thereafter by First Order forces.\nFN-417 wore standard First Order stormtrooper armor and carried an F-11D blaster rifle.\nFN-417 is portrayed by an uncredited extra in the 2015 sequel trilogy film, Star Wars: Episode VII The Force Awakens. FN-417's scene was filmed in a forest called Puzzlewood in Wales.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/34_ABY",
  "/wiki/Takodana",
  "/wiki/Human",
  "/wiki/First_Order",
  "/wiki/FN_Corps",
  "/wiki/File:FN-417.ogg",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Planet",
  "/wiki/Resistance",
  "/wiki/Astromech_droid",
  "/wiki/BB-8",
  "/wiki/First_Order_military",
  "/wiki/Battle_of_Takodana",
  "/wiki/Takodana_Castle",
  "/wiki/Pirate",
  "/wiki/Maz_Kanata",
  "/wiki/Droid",
  "/wiki/Forest",
  "/wiki/Scavenger",
  "/wiki/Rey_Skywalker",
  "/wiki/Gender",
  "/wiki/Rey%27s_NN-14_blaster_pistol",
  "/wiki/NN-14_blaster_pistol",
  "/wiki/Safety",
  "/wiki/Death",
  "/wiki/File:Rey-Saftey.ogg",
  "/wiki/Cold_War",
  "/wiki/New_Republic",
  "/wiki/Standard_year",
  "/wiki/Trooper",
  "/wiki/First_Order_stormtrooper_armor",
  "/wiki/F-11D_blaster_rifle",
  "/wiki/J.J._Abrams",
  "/wiki/2015",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/The_Force_Awakens_Adaptation_4",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Before_the_Awakening",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary"
 ]
}