{
 "name": "Fo Skoolan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Rebel Alliance Navy",
      "Rebel Alliance Navy"
     ]
    }
   ]
  }
 ],
 "content": "Fo Skoolan was a Mon Calamari individual who held the title of captain in the Alliance to Restore the Republic's Navy. At some point, they commanded the modified MC80 Star Cruiser Home One and led his forces during a raid on the warship. However, the assailants destroyed the RZ-1 A-wing interceptors and X-wing starfighters and entered the Mon Calamari cruiser, killing several Rebel troopers and eventuallly reaching Skoolan's position, the ship's briefing room, where more soldiers defended him while he stayed in the \"splash zone,\" a water container.\nFollowing the Rebel soldiers' defeat, Skoolan fought the invaders themself, first fighting them without a firearm, and later using a E-11/S blaster rifle and later a Flamethrower. Eventually, however, the assailants defeat him and capture the Home One. Skoolan has brown skin, wore a Mon Calamari fleet officer uniform and could use blasters, flamethrowers and could engage in physical combat.\nFo Skoolan appears in the non-canon video game LEGO Star Wars: The Skywalker Saga, released in 2022. In the game, the player may find Home One in Endor space, Yavin space or Hoth space, where they must destroy the various starfighters guarding it and later, infiltrate the vessel. Following the player's arrival at the vessel, they must confront hordes of Rebel soldiers as they reach the briefing room, where they confront Skoolan. If the Mon Calamari is defeated by the player, the player gains the ability to purchase the vessel.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Mon_Calamari",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Captain",
  "/wiki/Commanding_officer",
  "/wiki/MC80_Star_Cruiser",
  "/wiki/Home_One",
  "/wiki/Warship",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/X-wing_starfighter",
  "/wiki/Cruiser",
  "/wiki/Death",
  "/wiki/Rebel_trooper",
  "/wiki/Soldier",
  "/wiki/Water",
  "/wiki/E-11/S_blaster_rifle",
  "/wiki/Flamethrower",
  "/wiki/Mon_Calamari_fleet_officer_uniform",
  "/wiki/Blaster",
  "/wiki/Video_game",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/2022",
  "/wiki/Endor_system",
  "/wiki/Yavin_system",
  "/wiki/Hoth_system",
  "/wiki/Starfighter",
  "/wiki/Starship"
 ]
}