{
 "name": "Fodo",
 "display_name": "Fodo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Twisted Rancor Trio"
     ]
    }
   ]
  }
 ],
 "content": "Fodo was a Bith musician that played the kloo horn for the Twisted Rancor Trio.\nThe fifth musician to join the Twisted Rancor Trio, Fodo was hired by the band's manager Gilthos Uksaris upon the recommendation of Loopa another Bith that had newly joined the band. Both served as replacements for the previous two Bith brothers Ujaa and Ujii who left when the lead singer Elinda found Ujaa's lackluster music skills intolerable.\nThis second incarnation of the Twisted Rancor Trio began to rise to fame around the year 3956 BBY, being especially popular on its homeworld of Taris as a result of Elinda's voice. The group's big break seemed to have arrived when they were invited to perform for the local businessman Davik Kang at his estate. However, while Uksaris was ecstatic for this opportunity, Elinda objected on the grounds that Kang was heavily rumored to be connected with the crime syndicate the Exchange. In fears that their lives could be in danger should their performance be unsatisfactory to Kang, Elinda opted out, and Uksaris replaced her with her sister Ashana on the eve of their scheduled performance.\nFodo only appears as a hologram in the video game Star Wars: Knights of the Old Republic as a part of a puzzle that the player, Revan, can solve in order to crack a security crate booby-trapped with a Holo-Sec Corp anti-theft explosive. The player must activate the six holoprojectors of the members of the Twisted Rancor Trio surrounding the crate in order of their recruitment. The solution is given in the datapad lying on a nearby table of Uksaris's Guts and Glory: A Chronicle of The Amazing Story of The Twisted Rancor Trio detailing the history of the band.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/The_Twisted_Rancor_Trio",
  "/wiki/Musician/Legends",
  "/wiki/Kloo_horn/Legends",
  "/wiki/Gilthos_Uksaris",
  "/wiki/Loopa",
  "/wiki/Ujaa",
  "/wiki/Ujii",
  "/wiki/Elinda",
  "/wiki/3956_BBY",
  "/wiki/Planet/Legends",
  "/wiki/Davik_Kang",
  "/wiki/Davik_Kang%27s_estate",
  "/wiki/Exchange",
  "/wiki/Ashana",
  "/wiki/Hologram/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Revan/Legends",
  "/wiki/Holo-Sec_Corp",
  "/wiki/Holo-Sec_Corp_anti-theft_explosive",
  "/wiki/Holoprojector/Legends",
  "/wiki/Datapad",
  "/wiki/Guts_and_Glory:_A_Chronicle_of_The_Amazing_Story_of_The_Twisted_Rancor_Trio"
 ]
}