{
 "name": "Foehorn",
 "display_name": "Foehorn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mustafar"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tulrus"
     ]
    }
   ]
  }
 ],
 "content": "Foehorn was a huge and furious tulrus that lived on the volcanic world Mustafar at the time of the Galactic Civil War. These creatures usually didn't bother anyone unless provoked, but Foehorn was exceptionally aggressive.\nSometime following 0 BBY, the beast attacked several mining crews, leaving several wounded and killed miners behind. The mining crews refused to go out unless the Mensix Mining Company could take care of the problem, so Chief Ulon Glost hired an expert hunter to track down the beast and kill it. The hunter was still searching for the tulrus, when Chief Glost received news of yet another attack on a mining camp. When the hunter arrived at the camp, most of the miners were already dead or dying. After a fierce fight, the hunter killed Foehorn and returned to the Mensix Mining Facility.\nFoehorn was a creature in Trials of Obi-Wan, the third expansion for Sony Online Entertainment's MMORPG Star Wars Galaxies prior to its closure on December 15, 2011. The quest The Man-eater sent the player to kill several tulruses, then Ulon Glost sent a new waypoint to a mining camp. When the player arrived there, Foehorn attacked and had to be killed to complete the quest.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mustafar/Legends",
  "/wiki/Tulrus/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Miner/Legends",
  "/wiki/Mensix_Mining_Company",
  "/wiki/Ulon_Glost",
  "/wiki/Hunting/Legends",
  "/wiki/Dying_miner%27s_camp",
  "/wiki/Mensix_Mining_Facility",
  "/wiki/Star_Wars_Galaxies:_Trials_of_Obi-Wan",
  "/wiki/Sony",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/December_15"
 ]
}