{
 "name": "Follnor_Callat",
 "display_name": "Follnor Callat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alsakan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Follnor Callat was a male Human who, as an academic scholar, used his talents to make a career in treasure hunting during the years of the New Order and early Galactic Civil War.\nFollnor Callat was born on Alsakan, an aspect that made him feel superior to other individuals that did not hail from the Core. He had an early career as a professor and became known for being one of the most intelligent well-read individuals in the field of xenoarchaeology. However, his lack of morals and desire to make claims at archaeological digs, even at the cost of thievery and deception, cost him this position. He was eventually stripped of his academic titles from the University of Sanbra, dismissed from Shafr Center, and banned from the University of Rudrig. However, he kept contact with some of his students, calling them in to assist on hunts for valuable artifacts.\nCallat's demeanor towards xenoarchaeology eventually led to him gaining several warrants for his arrest. He had a notable run-in with Iotran Antiquities Enforcement members regarding his attitude, largely the result of his willful disobedience towards local antiquities laws, his disregard for accepted procedures, and willingness to raid other archaeologist's sites.\nAs an Alsakan native, Callat had an interest in the Alsakan Tessent, a valuable idol that had been lost from Alsakan. In order to claim the artifact, Callat gathered a team of four individuals who were formerly students of his at the University of Rudrig to assist him. In an unorthodox move, Callat hired several mercenaries as well to help him ward off or track down others that might be participating in the same hunt. Among these were Fenn Shysa and an unnamed Blood Carver thief.\nTaking the entire group aboard his Placid-class freighter, Callat made his way to Ast Kikorie and the academic circle located at Kikorie Port's Lon Heights. Callat was chasing rumors of the Tessent coming to the destroyed Ast Kikorie Station by way of an unidentified Guard of Aldera. Callat hoped to search the wreckage of the space station, unaware that the guard had actually met his demise in a shuttle crash that was some distance away from the station's wreckage.\nShysa and the other mercenaries chased a group of explorers who also happened to be pursuing the Tessent, encountering them several times. However, the artifact was eventually discovered first by the rival explorers. Callat and his group descended on the rival group, but the final outcome of the confrontation is unclear. However, Shysa may have betrayed his employer, stealing the artifact for himself, planning to sell the idol to fund the resistance movement on Mandalore.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alsakan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Xenoarchaeology/Legends",
  "/wiki/University_of_Sanbra",
  "/wiki/Shafr_Center",
  "/wiki/University_of_Rudrig/Legends",
  "/wiki/Alsakan_Tessent",
  "/wiki/Fenn_Shysa",
  "/wiki/Blood_Carver",
  "/wiki/Ast_Kikorie/Legends",
  "/wiki/Kikorie_Port",
  "/wiki/Lon_Heights",
  "/wiki/Ast_Kikorie_Station",
  "/wiki/Guard_of_Aldera",
  "/wiki/Mandalore/Legends",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Race_for_the_Tessent",
  "/wiki/Star_Wars_Gamer_9"
 ]
}