{
 "name": "Fomadu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bpfasshi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bpfasshi Dark Jedi"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Unidentified cyborg master"
     ]
    }
   ]
  }
 ],
 "content": "Fomadu was a male Bpfasshi Dark Jedi who lived during the waning years of the Galactic Republic.\nIn 19 BBY, during the Clone Wars, the Bpfasshi were defeated by the Jedi forces led by Grand Master Yoda. The same year, several key members of the Jensaarai cult, known conspirators with the Bpfasshi, were killed on Susevfi by Jedi Obi-Wan Kenobi, Nejaa Halcyon and Ylenic It'kla. On the planet Malo VI, Fomadu joined forces with Mei, whose father, Sukarr, was killed by Kenobi on Susevfi. She saved Fomadu from committing suicide in the wake of his brother Zukao's death, and he transferred the Force-bond he had shared with his Bpfasshi sibling to her. In return, Fomadu gave her purpose, while their new master, a mysterious Force-sensitive cyborg, gave them hope. The cyborg and his followers worshipped the Great Void, which, they believed, was the only truth, as there was no the Dark side nor the Light side.\nLater, Fomadu and Mei tracked down two Jedi Masters, T'ra Saa and Tholme, to Nar Shaddaa, to kill them for their role in slaughtering the Bpfasshi. However, they found Obi-Wan Kenobi there instead, who went to Nar Shaddaa after his duel with Darth Vader to sell the Soulless One before travelling to Tatooine with newborn Luke Skywalker. Two Dark Jedi tried to chase Kenobi down. Fomadu finally caught up with Kenobi in the waste shaft and they started dueling. During the duel, Fomadu's fleet blade intercepted Obi-Wan's kill stroke, bashing the lightsaber aside. Obi-Wan instantly grabbed Fomadu's lightsaber-wielding wrist, and they started grappling. As the Jedi was still weak and tired after his duel with Vader, Obi-Wan allowed Luke's singular Force signature to course into him and reached for an image, protected at the edge of the Bpfasshi's mind. Then, for one brief moment, Obi-Wan created a Force illusion, turning himself into Fomadu's fallen brother, Zukao. Fomadu was startled for a moment, and Kenobi bent back the darksider's wrist, thus beheading the Bfasshi with his own lightsaber.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Bpfasshi",
  "/wiki/Gender/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Unidentified_cyborg_master",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Bpfassh_Uprising",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Jensaarai/Legends",
  "/wiki/Duel_on_Susevfi",
  "/wiki/Susevfi",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Nejaa_Halcyon",
  "/wiki/Ylenic_It%27kla",
  "/wiki/Planet/Legends",
  "/wiki/Malo_VI",
  "/wiki/Mei_(Dark_Jedi)",
  "/wiki/Sukarr",
  "/wiki/Suicide/Legends",
  "/wiki/Zukao",
  "/wiki/Force-bond",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Chaos",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/T%27ra_Saa",
  "/wiki/Tholme/Legends",
  "/wiki/Duel_on_Mustafar/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Soulless_One/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Lone_Wolf:_A_Tale_of_Obi-Wan_and_Luke",
  "/wiki/The_New_Essential_Chronology"
 ]
}