{
 "name": "Fondo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Torani Kulda"
     ]
    }
   ]
  }
 ],
 "content": "Fondo was a Rodian thug who worked for the Hutt Space-based Rodian assassin Torani Kulda alongside two other thugs. Fondo and the others were eventually brought by Kulda to participate in a potentially deadly competition known as a Granee Noopa.\nFondo was, along with Tyss and Plaado, one of three thugs in the service of the Hutt Space-based assassin Torani Kulda. During the reign of the Galactic Empire, Fondo and the others were brought by Kulda to a Granee Noopa in Wheeta Palace on Nal Hutta, the adopted homeworld of the Hutts. The event was a potentially deadly competition between three separate groups, including Kulda's and one led by the disgraced noble Shalo Sherin.\nFondo was present in the palace's foyer when the attendees were introduced to one another and allowed to assess each other. After the introductions, the attendees were taken to a bar and served drinks, half of which were poisoned. The three Hutt representatives at the Granee Noopa—known as boddahs—were each given the identities of one-third of the poisoned drinks, information that the attending groups could choose whether or not to share with one another. Each of the attendees was required to take a drink, which they then used to toast their rivals.\nFondo was a member of the reptilian Rodian species. Fondo's appearance was extremely similar to the other thugs in Kulda's employ, and all three were extremely loyal to her.\nFondo and the other thugs in Kulda's employ all wore a heavy leather jacket and used a low-slung holster to store weapons, including a combat knife, the blade of which Fondo touched in a threatening manner whenever possible. Fondo also possessed a blaster pistol.\nFondo was introduced in the 2015 Star Wars Roleplaying sourcebook Lords of Nal Hutta, a part of the Star Wars: Edge of the Empire roleplaying game system published by Fantasy Flight Games. In the book, Fondo is described as a non-player character in the \"Rubbing Slimy Elbows\" modular encounter.\nLords of Nal Hutta suggests that during certain parts of the encounter the game-master player should cinematically describe those actions—and their consequences—of non-player characters that do not directly affect the player-characters, as opposed to rolling dice to individually determine whether each of them manages to overcome the challenges of the competition. During the third stage of the encounter's Granee Noopa event, known as the Dinner, the number of opponents faced by the participants depends on the number of the latter, which may include Fondo if the character has survived both the toasting scene and the second stage, the Dance.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Rodian/Legends",
  "/wiki/Torani_Kulda",
  "/wiki/Hutt_Space/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Granee_Noopa",
  "/wiki/Tyss",
  "/wiki/Plaado",
  "/wiki/Imperial_Period",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Wheeta_Palace/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Shalo_Sherin",
  "/wiki/Cantina/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Boddah",
  "/wiki/Reptile/Legends",
  "/wiki/Species/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Leather/Legends",
  "/wiki/Jacket/Legends",
  "/wiki/Holster/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/2015",
  "/wiki/Star_Wars_Roleplaying",
  "/wiki/Lords_of_Nal_Hutta",
  "/wiki/Star_Wars:_Edge_of_the_Empire",
  "/wiki/Roleplaying_game",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Dinner",
  "/wiki/Dance",
  "/wiki/The_New_Essential_Guide_to_Alien_Species"
 ]
}