{
 "name": "Fortris Gall",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Orgus Din"
     ]
    }
   ]
  }
 ],
 "content": "Fortris Gall was a male human Jedi Knight at the time of the Great Galactic War, a conflict fought between the Galactic Republic and the reconstituted Sith Empire. He was an apparent practitioner of Jar'Kai, utilizing two lightsabers when a situation called for it.\nAfter the Treaty of Coruscant was signed, Gall was present at Republic Base 11A on Balmorra with several other Jedi, discussing the troop withdrawal orders given after the signing of the Treaty of Coruscant. Gall had been planning a rescue mission to liberate Demolitions Squad 419 from captivity by the Sith Empire . Though discouraged from attempting a rescue by Togruta General Buryn, Gall left the room, claiming to merely be going outside to look at the stars.\nIn point of fact, Gall departed for the Troida Military Workshop where Squad 419 was being held. While attempting to gain access to the workshop, he was confronted by a Sith who engaged him in a duel. The Sith boasted that Gall's lightsaber was no match for the power of the dark side, at which point he drew a second lightsaber from his belt and succeeded in decapitating the Sith warrior.\nGall and the liberated Republic prisoners then launched an attack on the Imperial Forward Outpost XT-23, wiping out all resistance including a complement of Sith war droids. He was joined by Jedi Master Orgus Din who cautioned him, telling him to end the conflict on Balmorra. Gall responded by remarking that the Sith Treaty was a trick. Din responded by saying it was the duty of the Jedi to establish peace in the galaxy.\nThe older man reiterated that Gall's presence on Balmorra would only worsen tensions with the Sith. He then informed him of recent developments on Dantooine where Republic troops had refused to depart with their commander and were still engaging Sith forces; in violation of the Treaty. Din ordered Gall to assist Satele Shan and Harron Tavus in suppressing the mutiny.\nWhen Gall arrived ahead of Tavus and Shan, however, he decided to support the mutiny and help continue the battle against the Sith. He later called Tavus to the ruins of the Jedi Enclave where he revealed his participation in the plot that was responsible for the bombing of the Senate Building on Coruscant. Later the \"deceased\" Master Dar'Nala resurfaced in the Enclave ruins to reveal her participation in the bombing plot. Master Dar'nala revealed she was setting up Sith Lord Darth Baras to take the blame for sabotaging the Treaty. Gall and Dar'nala persuaded Tavus to join their cause as Lord Baras was on his way to Dantooine.\nTraveling to the Crystal Caves, the party attacked Darths Baras and Angral. Satele soon joined up and aided the party. But then Baras revealed that Dar'Nala was behind all the violence aimed at destroying the treaty in an attempt to sway her to the Sith. Satele refused, but at the same time refused to support Dar'Nala, and convinced Tavus to do the same. Dar'Nala was furious at this, and moved to kill Tavus  to punish her former apprentice.\nThis move turned Gall against her as well. Gall saw that Dar'Nala had gone too far, and defended Tavus. Dar'Nala wounded the Jedi Knight, and ordered Dalborra to finish him. The Wookiee responded by killing the rogue Jedi Master. With Dar'Nala dead, Satele led Gall and Tavus out of the caves. When they reported back to Din, Gall, who had apparently seen the error of his ways, said there would be no more attempts to disrupt the treaty.\nGall was committed to his troops and refused to withdraw and leave Troop 419 in captivity. He was also stubborn and refused to follow orders that he did not believe in. On Balmorra, he refused to withdraw and further sided with the commander on Dantooine when he was ordered to convince the troops there to disengage.\nHowever, he also did not follow all the principles of the Jedi, as demonstrated by his part in the bombing of the Senate building to assassinate suspected Sith spies. But despite this, he did stop Dar'Nala from murdering Tavus, indicating that he had some sense of where to draw the line.\nGall was first introduced in the Star Wars: The Old Republic web comic where in two separate issues, he was identified as Fortis Gall. With the issue released on September 18, 2009 his name was changed to Fortris Gall, and the first two issues were updated to reflect the name change.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Orgus_Din",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Balmorra/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Base_11A",
  "/wiki/Demolitions_Squad_419",
  "/wiki/Togruta/Legends",
  "/wiki/General/Legends",
  "/wiki/Buryn",
  "/wiki/Star/Legends",
  "/wiki/Troida_Military_Workshop",
  "/wiki/Sith/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Utility_belt/Legends",
  "/wiki/Imperial_Forward_Outpost_XT-23",
  "/wiki/Sith_war_droid_Mark_II",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Harron_Tavus",
  "/wiki/Jedi_Enclave",
  "/wiki/Senate_Building",
  "/wiki/Coruscant/Legends",
  "/wiki/Dar%27Nala",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Angral",
  "/wiki/September_18",
  "/wiki/2009",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_2:_New_Galactic_Order",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_3:_Uncertain_Surrender"
 ]
}