{
 "name": "Foul Moudama",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alzoc III"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Talz"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Foul Moudama was a male Talz from Alzoc III who served the Jedi Order as a Jedi Master during the last years of the Galactic Republic.\nBorn on the isolated, uncharted planet Alzoc III, Foul Moudama was discovered to be Force-sensitive near birth and taken to the Jedi Temple on Coruscant; one of the only members of his species to leave his mysterious homeworld during the era. While knowledge of his species and culture were limited even within the Temple's vast archives, Moudama managed to adapt to life on Coruscant and passed through the Temple academy after years of training. Selected by a Jedi Master to train as a Padawan, Moudama continued to seek knowledge wherever he could and grow stronger in the ways of the Force. Crafting for himself a blue-bladed lightsaber, Moudama emerged from his Trials of Knighthood as a fully ranking Jedi Knight.\nDuring his independent studies as a Knight, Moudama continued to hone his skills with a lightsaber. Despite his hulking size, he was quite agile and swift of foot, a trait that often caught adversaries off-guard. A firm devotee of the Living Force, Moudama's serene nature garnered the respect of the Jedi he worked closely with; though he was not especially well known throughout the Order, even by members of the Jedi High Council. Serving during the Separatist Crisis that was brewing between the Galactic Republic and the Confederacy of Independent Systems, Moudama was active when the Clone Wars erupted across the galaxy. Reporting to Coruscant to receive the rank of General within the Grand Army of the Republic, Moudama led many battles throughout the war as a Jedi Master.\nAs the end of the war drew near, Moudama was stationed at the Coruscant Temple when General Grievous launched a surprise assault on the capital planet. On the orders of Grand Master Yoda, Jedi Moudama joined fellow Knights Roron Corobb, B'ink Utrila, and Roth-Del Masona in heading to the bunker that was to house Supreme Chancellor Palpatine during the assault. When the four Jedi arrived, they met with Masters Shaak Ti and Stass Allie who had thus far been responsible for safeguarding the leader of the Republic. Under Ti's command, the four Knights took the Chancellor and his Red Guardsmen down into the bunker while Ti and Allie remained behind to defend the entrance. While Ti and Allie were distracted Grievous led a group of MagnaGuards into the bunker and attacked Moudama and his companions. While the Red Guards were all slain by the MagnaGuards, the four Jedi engaged the cyborg General in lightsaber combat. While Grievous toyed with them for a few moments, he decapitated Jedi Masona before cutting down Jedi Corobb, leaving Moudama and Utrila alone. Putting forth his best effort, Moudama charged the General but lost his lightsaber arm and then his left leg before being disemboweled. Utrila died shortly after, and Grievous escaped with the Chancellor. Not long after their deaths, Master Allie came upon the bodies, noticing that all of the Jedi were missing their lightsabers.\nWise and powerful, Jedi Foul Moudama had enhanced eyesight thanks to his dual set of eyes. An accomplished swordsman and respected for his fluid lightsaber technique, he was quite strong, able to carry Chancellor Palpatine in one arm while fending off MagnaGuards and Grievous himself with the other.\nFoul Moudama was created in response to a poll conducted by cartoonnetwork.com. The poll inquired whether Moudama, Roron Corobb or Voolvif Monn should be featured in Clone Wars. Though Voolvif Monn was the winner, all three were eventually created. However, his appearance sparked some controversy as his species, the Talz, were previously established to have not been discovered by the galactic population until the reign of the Galactic Empire. To rectify this, Moudama's entry in the Databank explains that his origins were mysterious and few knew where it was he came from.\nHis name, inspired by Foul Moudamas , a Middle-Eastern fava bean dish, according to the Clone Wars DVD commentary, does not appear in the book, Labyrinth of Evil, though it has been retconned that he does appear in this novel. Within these pages, Moudama's death appears as it does in this article. However, the Star Wars: Clone Wars cartoon provides a different look at the confrontation between Moudama and Grievous. Instead of fleeing into the bunker with Jedi Utrila and Masona, Moudama stands with Corobb and Master Shaak Ti while carrying the Chancellor under his arm. After a long chase to the bunker and an extended duel with the cyborg, Moudama is cut down alongside his Ithorian counterpart.\nAn action figure of Foul Moudama was created as part of the 2006 Hasbro Saga Collection. A re-mold of the POTF2 Muftak figure, but given a Jedi tunic and boots, as well as a slight variation on the paint job.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Labyrinth_of_Evil",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Alzoc_III/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Great_ReSynchronization",
  "/wiki/Coruscant/Legends",
  "/wiki/Talz/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Padawan/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Living_Force/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Roron_Corobb/Legends",
  "/wiki/B%27ink_Utrila",
  "/wiki/Roth-Del_Masona",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Stass_Allie/Legends",
  "/wiki/Red_Guard",
  "/wiki/IG-100_MagnaGuard/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Voolvif_Monn",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Databank_(original)",
  "/wiki/Ithorian/Legends",
  "/wiki/2006",
  "/wiki/Muftak/Legends",
  "/wiki/Reversal_of_Fortune",
  "/wiki/Clone_Wars_Chapter_23",
  "/wiki/Clone_Wars_Chapter_24",
  "/wiki/Clone_Wars_Chapter_25",
  "/wiki/Star_Wars_Insider",
  "/wiki/Unknown_Soldier:_The_Story_of_General_Grievous",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}