{
 "name": "Fra Raida",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Netalych"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "204th Imperial Fighter Wing",
      "204th Imperial Fighter Wing"
     ]
    }
   ]
  }
 ],
 "content": "Fra Raida was a human female who served as a TIE fighter pilot in the Galactic Empire's 204th Imperial Fighter Wing. She formally posed a rival to Lieutenant Yrica Quell prior to her desertion from the unit two weeks after the Battle of Endor in 4 ABY, but made amends with Quell after she returned to the fighter wing around 5 ABY, developing feelings for the fellow pilot. Raida approached Quell multiple times, at one point offering her spice following a funeral and later leading her away to change from their flight suits.\nWhile the 204th fought at the planet Chadawa, Raida joined Quell and four others on a mission to the planet Netalych. On the way, Raida overheard a message from the New Republic pilot Chass na Chadic aimed at Quell, revealing to her that Quell had worked for the New Republic. There, they visited the droid occupied outpost DN-949A to carry out a task for Colonel Soran Keize, the 204th's commanding officer, which only Quell, the team leader, had the knowledge of. Raida escorted Quell and two other team members to visit the droid engineer known as the Surgeon. Who took up Quell's task in exchange for the 204th pilot Nord Kandende pledging to work for him for a year.\nThe group argued about Kandende, Raida wishing to forcefully free him from his service, but Quell ultimately decided that they would leave him behind. Sickened of the sacrifice and Quell's apparent affiliation with the New Republic, Raida told the rest of the group what she had heard and they chose to have a mutiny on the lieutenant when she returned from collecting the Surgeon's findings. The group incapacitated Quell before questioning her for \"the truth.\" The engineer Alchor Mirro led them into a separate argument while Quell was locked away, but they were interrupted when Chadic arrived and opened fire. Raida attempted to escape, but was gunned down by the New Republic pilot.\nDuring the Galactic Civil War, Fra Raida served as a TIE fighter pilot in the Galactic Empire's 204th Imperial Fighter Wing. When the girl Yrica Quell joined the unit as a pilot, Raida became low-key competition to the new member. Two weeks after the Battle of Endor in 4 ABY, Quell, since promoted to lieutenant, deserted the 204th, along with the ace Major Soran Keize. However, with the New Republic's apparently unforgiving approach on Imperials and ex-Imperials, Keize rejoined the fighter wing by around 5 ABY and became its commanding officer. Quell also returned to the unit around that year, but chose to work with the ground crew instead of immediately returning to serve with the pilots.\nDuring that year,the 204th carried out a string of genocides on the planets Dybbron III, Kortatka and Fedovoi End. One recruit the fighter wing had taken in from Dybbron III claimed to Raida that the New Republic was pardoning pirates to run worlds post-Imperial-rule. Later on, the pilots of the 204th gathered in the ready room of the Yadeez, the fighter wing's flagship and carrier at that time, to celebrate the birthday of the late Colonel Shakara Nuress, the 204th's commander before the since promoted Colonel Keize. Officially, the pilots celebrated the Feast of Lord-Protector Jarmanidath, an obscure holiday approved by the Empire's Culture Ministry. Raida went to fetch Quell for the occasion once the 204th's Squadron Five had returned to the Yadeez from a trip and the other attendees were ready.\nSometime after the celebration, the Yadeez and its escorts were pursued by New Republic forces led by General Hera Syndulla. Following an engagement with the enemy in the Ghonoath system, a funeral was held for Flight Commander Garl Lykan, who had been lost in the battle, at the Yadeez's hangar. Following the 204th's traditional gathering, Raida offered to share a thumbnail-sized bag of spice with Quell. Quell turned it down, believing Raida could want to entrap her and turn her in for spice possession. Raida cried as a result, and awkwardly hugged with Quell, claiming she was glad that the latter was alive. Quell left the hangar quickly after.\nThe 204th later fled from Syndulla's forces in the G'Tep'Noi system, where Raida and Quell helped in the skirmish against the New Republic fighters. When the pilots returned to the Yadeez's hangar after, complementing the fellow pilot's flying out in the battlefield. As Quell made excuses, pilots were ordered to clear the hangar. After a number of TIE pilots left, Raida remained with Quell, rolling her foot over a fuel pipe, and commented on her comrade's messy nature. Quell blamed her low-gravity childhood and a recent injury, and so Raida led her away to get her changed. The pair went to the showers and dressed into civilian clothing before Quell departed.\nAs the 204th moved in on is next target, the planet Chadawa, Raida, Quell and four other personnel were selected for a mission to the planet Netalych to investigate the databanks of an Imperial sentinel droid which had become notorious among the 204th until its destruction, which was kept secret from other personnel besides Keize and Quell. The true nature of the mission was only known to Quell, the team leader. The other team members included the pilots Nord Kandende and Jeela Brebtin and the engineers Agias Rikton and Alchor Mirro.\nThe team split from the rest of the 204th aboard a nameless starship while the fighter wing made its initial attack on Chadawa. As the vessel made its escape, the New Republic pilot Chass na Chadic called out threats to Quell over the comm channels. Listening through a headset until Quell jammed the comms on the ship, Raida realized that her team leader had been affiliated with the New Republic during her desertion, and Quell jammed the comms before more could be picked up by the ship. While Quell did not know whether her team had heard Chadic's threats, Raida chose to keep it secret from the others for the time being as she cared for the team leader.\nAfter the vessel arrived in the Netalych system, Quell approached Raida and the rest of the team, briefing them on their destination, the oupost DN-949A on Netalych, explaining how it had been taken over by its droid populous which had formed its own society. With details of the mission classified to the rest of the group, the team leader called the situation an \"engineering problem\" which DN-949A may have a specialist to solve to provide insights the 204th. When Rikton asked what they would do if Quell was killed, she claimed that they would fail, causing Raida to chuckle and shake her head. Landing at a pier at DN-949A, the team disembarked in civilian clothes, Raida and Kandende armed only with pistols while the rest carried different equipment.\nAs they walked through the outpost the group passed a painted message saying \"NO MEAT NO MASTERS,\" which Raida sarcastically called charming, although Mirro believed that it was technically correct. Moving into the indoors of DN-949A, they was soon approached by a Houk traveler who begged for work, credits or transport offworld due to his starship's repairs failing. Raida almost shot the Houk before Mirro talked the traveler down, suggesting a fix for his ship's engines. After witnessing the situation of the organic residents and travelers at the outpost, Quell and Rikton discussed how it compared with the state of the rest of the galaxy, Raida chiming in with the rumor about the New Republic pardoning pirates.\nRikton, Mirro and Brebtin got into a debate after about whether the droid's apparent treatment of the organic residents was justified, Mirro claiming it was only natural for the droids to treat anyone who treated them harshly the same way. Raida subsequently remarked that if the droids were acting naturally, then she would hate to see how the it compared with people of the New Republic, glancing at Quell at that moment knowing she had been among them. Quell stopped and gave a plan of action: while Brebtin and Mirro acquired lodging for the group, Raida was to follow Quell, Kandende and Rikton at a distance to watch their backs.\nQuell, Kandende and Rikton visited a droid named the Surgeon, who took in sentinel's databank for examination. However, because the price of the Surgeon's service was a human servant, Kandende pledged a year of service without Quell's say. When the rest of the group reconvened in a rented apartment Brebtin and Mirro had found, they argued about their lost member, Raida wishing to go and rescue him before they left Netalych. Quell was more interested in completing their mission, the rest of the team accepting her statement on it.\nAfter, Raida and Quell sat beside one another in the washroom, saying nothing. Quell eventually returned to the rest of the group, where Brebtin expressed her displeasure of being away from the rest of the 204th. Rikton and Mirro misinterpreted her sentiment, and Raida remarked that they did not understand because they were not pilots. Raida believed that the rest of the 204th should not have been attacking Chadawa without her and the other pilots in Quell's team.\nThe next day, Quell returned to the Surgeon and retrieved the data she needed. Meanwhile, Raida, sickened of the sacrifice of Kandende and formerly finding out that Quell had served the New Republic, told the rest of the team of Chass na Chadic's message to Quell. The group thus arranged a mutiny, and Raida and Mirro waited at the apartment while Rikton and Brebtin met with Quell and made sure the team leader made it back there. When Quell arrived at the apartment, her team incapacitated her. Quell, sprawled on the floor of the apartment, eventually regained consciousness to find her team surrounding her, Raida standing closest. As one of them asked for \"the truth,\" Raida kicking Quell in her side before stepping back as her captive shouted back.\nQuell demanded that they trust in Keize, believing that the matter was about the secrecy of the mission. Raida, calling Quell filth, explained that she had heard Chadic's message to Quell and had kept it secret until they had lost Kandende to the Surgeon. Cutting her sentence, she admitted that she had kept the secret because she had liked Quell. Mirro advised the group into a separate discussion from Quell, Brebtin locking their prisoner in the bathroom in the meantime. The group argued in the main room, Raida debating passionately while not directly suggesting killing Quell, although Mirro did.\nHowever, they were soon interrupted when they realized a visitor was at the apartment. The group asked if Kandende had arrived, but with no reply, Brebtin suggested getting the door slowly. The visitor was Chadic, who had tracked the team from Chadawa in search of Quell. When the door opened the New Republic pilot open fired on the group, leading to a firefight. The group made to escaping the apartment, but Chadic charged in as Raida was making for an exit. Raida turned and fired on her attacker, but narrowly missed. Chadic then proceeded to shoot the pilot in the chest, Raida dropping to the floor, dead.\nFollowing Raida's death, the rest of the group made for their ship, engaging DN-949A's security along the way. Quell escaped the apartment through a small window and found Rikton separated from the remainder of the team, choosing to spare the engineer's life. Brebtin and Mirro successfully returned to the 204th at Chadawa and gave Keize the information that he required, leading the colonel to learn that there was a databank on the Imperial capital planet Coruscant which had logged all the atrocities of the 204th through the since destroyed sentinel droid. Keize attempted to destroy the databank, but was stopped by Quell. The colonel mentioned Raida in an attempt to sway his adversary into agreeing with him, but failed and perished soon after.\nA human female, Fra Raida was initially competitive with Yrica Quell, but later developed feelings for her, paying the other pilot compliment expressing how much she had missed her after she had left for some time. She cried and hugged Quell at one point after her offer of spice was turned down. After learning that Quell had been affiliated with the New Republic, Raida chose to give the fellow pilot the benefit of the doubt and hide the revelation from the rest of the group, speaking uneasily with Quell after. Raida believed that she should have shared the 204th's burden of wiping out Chadawa's populous. When Alchor Mirro and Agias Rikton failed to understand the sentiment, she put it down to them not being pilots like her, Quell and Jeela Brebtin. After Quell chose to leave behind Nord Kandende, Raida ran out of excuses to cover for the pilot she cared for and turned on her.\nAs a pilot, Raida wore a flight suit and flew a TIE fighter. On Netalych, she wore civilian clothing and was armed with a blaster pistol and carried a comlink.\nFra Raida appeared in the 2021 novel Victory's Price, the final installment of the Star Wars: Alphabet Squadron trilogy which was written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/5_ABY",
  "/wiki/Netalych",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Lieutenant",
  "/wiki/Yrica_Quell",
  "/wiki/Standard_week",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Fighter_wing",
  "/wiki/Pilot",
  "/wiki/Spice",
  "/wiki/Lykan%27s_funeral",
  "/wiki/Battle_at_Chadawa",
  "/wiki/Planet",
  "/wiki/Chadawa",
  "/wiki/Mission_to_Netalych",
  "/wiki/New_Republic_pilot",
  "/wiki/Chass_na_Chadic",
  "/wiki/New_Republic",
  "/wiki/Droid",
  "/wiki/DN-949A",
  "/wiki/Colonel",
  "/wiki/Soran_Keize",
  "/wiki/Commanding_officer",
  "/wiki/Engineer",
  "/wiki/Surgeon",
  "/wiki/Nord_Kandende",
  "/wiki/Standard_year",
  "/wiki/Alchor_Mirro",
  "/wiki/Galactic_Civil_War",
  "/wiki/Ace",
  "/wiki/Major",
  "/wiki/Dybbron_III",
  "/wiki/Kortatka",
  "/wiki/Fedovoi_End",
  "/wiki/Pirate",
  "/wiki/Yadeez",
  "/wiki/Flagship",
  "/wiki/Carrier",
  "/wiki/Shakara_Nuress",
  "/wiki/Feast_of_Lord-Protector_Jarmanidath",
  "/wiki/Culture_Ministry",
  "/wiki/Squadron_Five_(Shadow_Wing)",
  "/wiki/Barma_Battle_Group",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Battle_in_the_Ghonoath_system",
  "/wiki/Ghonoath_system",
  "/wiki/Flight_Commander",
  "/wiki/Garl_Lykan",
  "/wiki/G%27Tep%27Noi_system",
  "/wiki/Skirmish_in_the_G%27Tep%27Noi_system",
  "/wiki/Limb",
  "/wiki/Gravity",
  "/wiki/Clothing",
  "/wiki/Sentinel_(Contingency)",
  "/wiki/Jeela_Brebtin",
  "/wiki/Agias_Rikton",
  "/wiki/Netalych_system",
  "/wiki/Pistol",
  "/wiki/Houk",
  "/wiki/Unidentified_Houk_(Netalych)",
  "/wiki/Starship",
  "/wiki/The_galaxy",
  "/wiki/Prisoner",
  "/wiki/Hall_of_Imperial_Register",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Attack_on_Coruscant%27s_Verity_District",
  "/wiki/Comlink",
  "/wiki/2021",
  "/wiki/Victory%27s_Price",
  "/wiki/Star_Wars:_Alphabet_Squadron",
  "/wiki/Alexander_Freed",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Standard_month",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Jakku",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Death",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/TIE_line",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Shadow_Fall",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_61",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)"
 ]
}