{
 "name": "Francis",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Renegade Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Francis, nicknamed \"Francis the pink Wookiee\" for his uniquely decorated armor, was a male Wookiee bounty hunter who joined Renegade Squadron—an elite fighting unit of the Alliance to Restore the Republic created by former smugglers and composed of fringers with Rebel sympathies—during the Galactic Civil War. In his tenure with the Rebellion, he fought at the Battle of Endor and flew a T-65 X-wing starfighter that was also painted pink.\nFrancis, a male Wookiee bounty hunter, joined Renegade Squadron during the Galactic Civil War—the war between the Galactic Empire and the Alliance to Restore the Republic—sometime between 0 BBY and 4 ABY. Renegade Squadron was a recently created Alliance elite fighting unit made up of criminals and pirates, which was co-led by General Han Solo and Commander Col Serra, a pair of smugglers-turned-Rebel officers.\nFrancis was given the nickname \"Francis the pink Wookiee\" due to the fact that his armor was painted pink. While a member of Renegade Squadron, in which he engaged in battles both in and out of a cockpit, he flew a T-65 X-wing starfighter and fought in the Battle of Endor. After the battle and the death of Galactic Emperor Palpatine aboard the second Death Star, Renegade Squadron was disbanded by its members so that they could return to their underworld lives.\nDuring his tenure with Renegade Squadron, Francis used a DL-44 heavy blaster pistol in firefights. He also flew a T-65 X-wing starfighter—which was also painted pink—in space battles. Francis wore a pink eye patch of his right eye, similar to that of fellow Wookiee bounty hunter, Snoova.\nIn the video game Star Wars Battlefront: Renegade Squadron, it is possible to play as Francis through the game's character personalization feature. Francis was created by Jeff Pena, the producer of Star Wars Battlefront: Renegade Squadron. He was one of Pena's favorite customizable characters in the game, and was so popular with the development team that he was incorporated in Renegade Squadron's press demo and Electronic Entertainment Expo presentation.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Francis_(disambiguation)",
  "/wiki/Easter_egg_(virtual)",
  "/wiki/Canon",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Renegade_Squadron/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/General/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Col_Serra",
  "/wiki/Cockpit/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/DL-44_heavy_blaster_pistol/Legends",
  "/wiki/Lightfight",
  "/wiki/Starfighter/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Eye_patch",
  "/wiki/Eye/Legends",
  "/wiki/Snoova",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Battlefront:_Renegade_Squadron",
  "/wiki/Star_Wars_Battlefront:_Elite_Squadron",
  "/wiki/October_13",
  "/wiki/2008"
 ]
}