{
 "name": "Frantis_Griss",
 "display_name": "Frantis Griss",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "35 ABY",
      "Steadfast",
      "Exegol"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "Steadfast battlegroup",
      "Supreme Council",
      "Steadfast battlegroup",
      "Supreme Council"
     ]
    }
   ]
  }
 ],
 "content": "Frantis Griss was a human male who served as an admiral in the armed forces of the First Order as a member of First Order High Command. He also was the senior fleet officer of the Steadfast and its battlegroup.\nAlthough born during the time of the Empire, Frantis Griss was too young to serve within its ranks by the time of its collapse. Nevertheless, he did end up gaining valuable experience by taming the Unknown Regions for exploitation by the then-newly formed First Order.\nGriss served during the conclusive stages of the Order's campaign against the Resistance following the battle of Crait. During this time, he came to serve as aide to Allegiant General Enric Pryde, rival to the nepotistic General Armitage Hux. As such, he acted as one of the few individuals who held the complete trust of Pryde. While acting as Pryde's aide, he assessed operational reports of naval activity within First Order territory, and also carefully apportioned various First Order technology, including hyperspace tracking, in a manner that was in benefiting the overall fleet.\nFollowing the apparent resurrection of the late Galactic Emperor Sheev Palpatine, Griss attended a convening of the Supreme Council by Supreme Leader Kylo Ren. During this meeting, the latter discussed his ambition to turn the First Order into a \"true Empire\" by augmenting their forces with the Final Order, that a spy was hidden among their ranks and that his hunt for the errant scavenger Rey and her allies would continue. Griss also witnessed General Quinn dismissing Sidious' Sith Eternal as a \"cult\" and consequently being strangled through the Force by an enraged Ren to prevent anyone from learning what the Sith Lord was after as Supreme Leader Ren planned to betray him.\nShortly after this meeting, Griss was present aboard the Steadfast during its brief stay above Kijimi. A skirmish that resulted from Rey and her associates attempting to infiltrate the ship and liberate Chewbacca, a prominent Resistance member, ultimately led to a confrontation between Pryde and Hux, the latter of whom had been apparently wounded in the rebels' escape from the flagship. In reality, the spy earlier discussed was none other than Hux himself, the injury being a deception organized as part of his cover. As Griss observed, his superior saw through Hux's deceptions and, taking a blaster from a nearby stormtrooper, the elder officer executed Hux and calmly ordered another officer to inform Ren that the spy had been found.\nHowever, shortly after the incursion above Kijimi, Ren faced a crisis of faith and ultimately, at the behest of his dying mother, returned to the light side of the Force. As a result of this, Pryde became de facto head of the First Order and fully aligned with the Sith Eternal in readiness for uniting into a new Sith Empire. After the Allegiant General had personally pledged servitude under his old master and handed control of the First Order over to him, Griss accompanied his superior aboard the Steadfast to Exegol, bastion of the Sith Eternal.\nA short time after this official alliance, a handful of Resistance ships led by Acting General Poe Dameron arrived at Exegol. This token force initiated a desperate holding action against the expansive Sith fleet, hoping to buy time for other members to marshal a greater fleet. Griss observed these proceedings alongside Pryde from the bridge of the Steadfast as the number of Resistance ships steadily dwindled.\nHowever, at the final moment, a ramshackle fleet came out of hyperspace above Exegol: the promised Resistance reinforcements, led by General Lando Calrissian and Chewbacca. Pryde, appalled as he observed the new arrivals begin to decimate his navy around him, demanded to know where the Resistance navy had obtained so many craft. Griss quietly remarked that they weren't part of any navy, but \"just... people.\"\nSidious was able to briefly halt the renewed Resistance assault with Force lightning that disabled the armada, but after his permanent death at the hands of Rey, his granddaughter, the defenses of the Sith Eternal were swiftly overwhelmed. Shortly after, a turbolaser turret commandeered by traitorous stormtroopers General Finn and Jannah fired on the bridge of the Steadfast, killing both Pryde and Griss.\nGriss was portrayed by British actor Geff Francis in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker. His surname was revealed in the film's credits, where he is listed as \"Admiral Griss,\" while his forename was first revealed in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo. The character's name is partially based on the actor's name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/The_First_Order",
  "/wiki/35_ABY",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Exegol",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/First_Order",
  "/wiki/Steadfast_battlegroup",
  "/wiki/Supreme_Council",
  "/wiki/Enric_Pryde",
  "/wiki/Battle_of_Exegol",
  "/wiki/Admiral",
  "/wiki/First_Order_military",
  "/wiki/First_Order_High_Command",
  "/wiki/Fleet",
  "/wiki/Officer",
  "/wiki/Imperial_Era",
  "/wiki/Military_rank",
  "/wiki/Unknown_Regions",
  "/wiki/Aide",
  "/wiki/Allegiant_General",
  "/wiki/General",
  "/wiki/Armitage_Hux",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Supreme_Leader",
  "/wiki/Ben_Solo",
  "/wiki/Final_Order",
  "/wiki/Rey_Skywalker",
  "/wiki/Domaric_Quinn",
  "/wiki/Sith_Eternal",
  "/wiki/Sith_Lord",
  "/wiki/Kijimi",
  "/wiki/Resistance",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Exegol_air_team",
  "/wiki/Poe_Dameron",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Chewbacca",
  "/wiki/Force_lightning",
  "/wiki/Turbolaser",
  "/wiki/Finn",
  "/wiki/Jannah",
  "/wiki/Geff_Francis",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Tuckerization",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY"
 ]
}