{
 "name": "Frazznik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3963 BBY",
      "Jebble"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Vulkars",
      "Mandalorian Neo-Crusaders"
     ]
    }
   ]
  }
 ],
 "content": "Frazznik was a male Zabrak who lived on the Outer Rim world of Taris during the era of the Mandalorian Wars. A member of the Lower City swoop gang known as the Black Vulkars, Frazznik worked under the Vulkar leader Benno along with his friend and constant companion, the hulking Drovian Wargo. In 3964 BBY, Frazznik and Wargo were two of the first to find wanted fugitives Zayne Carrick and Marn Hierogryph in the Lower City, but were convinced to let them go in exchange for a tip from Hierogryph on a place to find some hidden spice—a hint that turned out to be a lie and earned the two Vulkars a beating from some Wookiees. After the Mandalorians laid siege to Taris in one of the early campaigns of the Mandalorian Wars, Frazznik and Wargo abandoned Taris and signed up with the Mandalorian Neo-Crusader army. The pair were sent to a staging point on the ice world Jebble in advance of a planned Mandalorian invasion of Alderaan, but were eventually killed after an outbreak of the rakghoul plague destroyed the Mandalorians gathered on Jebble.\nA male Zabrak, Frazznik was a member of the notorious swoop gang known as the Black Vulkars, who were active in the Lower City of the planet Taris during the era of the Mandalorian Wars. By 3964 BBY, Frazznik worked for the Vulkar leader known as Benno, and was often seen with his Drovian friend and fellow Vulkar Wargo. That year, the graduating class of the Jedi Tower in the Upper City was Padawan Massacre, and blame fell on surviving Padawan Zayne Carrick and Snivvian criminal Marn Hierogryph, who became highly wanted fugitives. The pair fled into the Lower City, where Frazznik and Wargo happened across the pair as they attempted to flee from justice. Frazznik initially targeted Carrick for a mugging because of his Upper City clothes, but Wargo recognized the two outsiders from their wanted holos, and the pair prepared to take the two to Benno to cash in on their lucrative bounties. However, playing off Frazznik's fear of Benno's anger at having to deal with Upper City bureaucracy in order to complete the process of turning in the fugitives, Hierogryph managed to convince Frazznik to let them go by promising Frazznik a different, more lucrative score.\nHierogryph pointed Frazznik and Wargo to a group of Wookiees running a nearby trash cart, alleging that they had sewn stashes of illegal spice into their pack animal's harness. In truth, this was a lie made up by Hierogryph on the spot, but Frazznik and Wargo fell for the trick, and went off to steal the purported spice. The shakedown didn't go well for Frazznik and Wargo, as the Wookiees beat them badly, costing Frazznik's Drovian friend several teeth. Soon after the incident, the rampaging army known as the Mandalorian Neo-Crusaders invaded and besieged Taris as one of the main early offensives of their nascent war with the Galactic Republic—unlike many of the swoop gangs on Taris, Frazznik and Wargo elected to join the Mandalorians instead of fighting against them, and were sent to a staging point on the ice world of Jebble along with thousands of other new recruits from the Outer Rim. Frazznik thus became part of a rapidly expanding Mandalorian army that was aiming at greater conquests toward galaxy's Core.\nDuring their introduction to the Mandalorian ranks, Frazznik and Wargo were confronted with a pair of familiar faces: Carrick and Hierogryph, who had found their way to Jebble after stowing away on a Mandalorian ship coming from Taris. Wargo was beaten by a Mandalorian Rally Master after attempting to assault Hierogryph, and afterward, Frazznik and his friend learned their purpose for being on Jebble: to prepare for an assault on one of the Republic's crown jewels, the peaceful Core planet of Alderaan. That invasion would never come to pass, as the ancient Sith artifact known as the Muur Talisman—which had been brought to Jebble from Taris on the same ship that transported Carrick and Hierogryph—began to wreak its dark influence on the Mandalorian world, turning many warriors into the diseased mutants known as rakghouls. Frazznik and Wargo, who were familiar with rakghouls from their presence on Taris, attempted to rally their new comrades-in-arms against the monsters. However, they were powerless to stop the mutants from sweeping through the remaining uninfected Mandalorians, and soon afterward Mandalorian strategist Cassus Fett laid waste to Jebble with a round of nuclear bombs.\nWhile his friend Wargo was the muscle of the pair, the comparatively lithe knife-wielding Zabrak Frazznik was the talker, and had a tendency to refer to targets like Zayne Carrick as \"little cuss.\" Frazznik had a great deal of fear and respect for his boss in the Black Vulkars, Benno, and was willing to give up major paydays in order to avoid his ire. Although he was an active member of the Black Vulkars, Frazznik held no special loyalty to the gang or the planet Taris, as he abandoned them to serve with the Mandalorians after the warriors invaded the planet. Frazznik had red skin, white horns on his head and white eyes.\nFrazznik first appeared in Knights of the Old Republic 3, the third installment of the Star Wars: Knights of the Old Republic comic book series, written by John Jackson Miller and released in 2006. Frazznik later appeared in two issues in the 2008 story arc Star Wars: Knights of the Old Republic: Vector. In his comic appearances, Frazznik was illustrated by Brian Ching and Scott Hepburn. According to Miller, Frazznik was originally intended to appear in one of The Adjudicator in-universe news items that were featured in several Knights of the Old Republic issues, but had to be cut for space.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3963_BBY",
  "/wiki/Jebble",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Black_Vulkars/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/Lower_City",
  "/wiki/Swoop/Legends",
  "/wiki/Benno",
  "/wiki/Drovian",
  "/wiki/Wargo",
  "/wiki/3964_BBY",
  "/wiki/Zayne_Carrick",
  "/wiki/Marn_Hierogryph",
  "/wiki/Spice/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Taris_Siege",
  "/wiki/Alderaan/Legends",
  "/wiki/Death/Legends",
  "/wiki/Rakghoul_plague",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_Tower",
  "/wiki/Upper_City",
  "/wiki/Padawan_Massacre",
  "/wiki/Padawan/Legends",
  "/wiki/Snivvian/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Tooth/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Mar%27eyce",
  "/wiki/Rally_Master",
  "/wiki/Sith/Legends",
  "/wiki/Muur_Talisman",
  "/wiki/Rakghoul",
  "/wiki/Cassus_Fett",
  "/wiki/Nuclear_bomb",
  "/wiki/Knife/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Knights_of_the_Old_Republic_3",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_(comic_series)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/John_Jackson_Miller",
  "/wiki/2006",
  "/wiki/Knights_of_the_Old_Republic_26",
  "/wiki/Knights_of_the_Old_Republic_27",
  "/wiki/2008",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic:_Vector",
  "/wiki/Brian_Ching",
  "/wiki/Scott_Hepburn",
  "/wiki/The_Adjudicator",
  "/wiki/Knights_of_the_Old_Republic_22",
  "/wiki/Knights_of_the_Old_Republic_28"
 ]
}