{
 "name": "Freck",
 "display_name": "Freck",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Condluran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Freck was a Condluran male who worked as a transport driver for the Galactic Empire on the mining planet Mapuzo, gaining rapport with the local stormtroopers. In 9 BBY, the driver came across the Jedi Obi-Wan Kenobi and the youngling Leia Organa, who were trying to find a spaceport. The alien offered them a ride and drove them towards a port, transporting some stormtroopers along the way.\nThe transport soon reached an inspection point, where Freck advised the stormtroopers on duty to check his passengers out. After the troopers did a scan of Kenobi, he attacked the soldiers, using Freck as a shield to shoot one of them. The Jedi then incapacitated the Condluran and soon escaped with Organa.\nDuring the time of the Galactic Empire, the Condluran Freck worked as an Imperial transport driver on Mapuzo, a once flourishing planet in the Mid Rim Territories which had been reduced to a mining wasteland by the Empire. He notably ferried around passengers like stormtroopers, who he came to get along with well. In 9 BBY, he was driving his repulsorcraft transport towards a spaceport after a standard transport run by a quarry when he encountered two stray civilians, the younger of them waving for his vehicle. The pair were the fugitive Jedi Obi-Wan Kenobi and the ten-year-old Alderaanian noble Leia Organa, the latter have been rescued by Kenobi after being kidnapped.\nFreck stopped for Kenobi and Organa, the latter introducing them as farmers from Tawl named Orden and Luma, and claiming that she and her \"father\" had gotten lost on a trip, which the Condluran called a weird story. When Kenobi explained that they were looking for the nearest spaceport, Freck offering them a ride there. The \"farmer\" was reluctant to accept, but Organa took up Freck's offer and thanked him. The driver assured them that they would be at the port in no time as they climbed in. While he drove down the road, Freck had his two passengers remind him that they were from Tawl. He complemented Tawl's people for listening to the Empire. \"Luma\" professed her and \"Ordan's\" love for the Empire, the alien agreeing and saying that there was nothing wrong with a bit of order.\nFreck's transport came across a group of stormtroopers whose transport was late and offered them a ride to their base. The driver introduced the troopers to \"Ordan\" and \"Luma,\" and asked the where the soldiers had come from. One stormtrooper explained that they were being moved around to search for a Jedi. The Condluran hoped that they were not in danger, but another trooper was confident that they would find the fugitive, unbeknownst that the Jedi was sat in the transport with them. The vehicle continued moving, one stormtrooper questioning \"Ordan\" and \"Luma\" in the meantime. When the transport passed the troopers' base, one of them had Freck stop and thanked him as the group disembarked.\nFreck's transport approached an Imperial inspection point, and a nervous Kenobi asked if he could get off beforehand. Freck reassured his passengers that it was just a standard inspection and stopped at the laser-gate guarded by stormtroopers. The driver got out of his transport and told one trooper about his transport run. The stormtrooper asked about the two passengers, and Freck told the soldier that they might want to inspect the pair.\nQuestioning Kenobi, the troopers had an Imperial viper probe droid so a facial scan of the Jedi when he drew a blaster pistol and began gunning down the probe droid and stormtroopers. Freck panicked and stuck close to his vehicle until Kenobi grabbed the Condluran and used him as a living shield to shoot another stormtrooper. Once the soldier was killed, the Jedi knocked Freck out with a pistol whip, escaping with Organa not long after.\nA Condluran male with light skin and black eyes, Freck was a supporter of the Empire, appreciating the order they kept in the galaxy and displaying the Imperial crest on his transport. The driver kept an amicable relationship with the Imperial stormtroopers on Mazupo and offered them transport when they needed it. He was also easygoing with strangers like Obi-Wan Kenobi and Leia Organa, not hesitating to give them a ride. However, Freck was suspicious of the pair and Organa's story and suggested the stormtroopers check them out.\nFreck donned brown and gray attire including trousers, a belt with compartments, fingerless gloves, and a leather jacket.\nFreck first appeared in \"Part III\" of the Disney+ television series Obi-Wan Kenobi, directed by Deborah Chow and released on June 1, 2022. The character was portrayed in costume by John Rosengrant and voiced by Zach Braff, known for his role in the television series Scrubs. Freck's costume included an animatronic head that functioned on what Braff stated was seventy motorized servos. with additional head movement features being controlled by two puppeteers using remotes. In a practice run with the head set, the actor recited lines meant for when Kenobi used him as a shield. Those lines did not make it into the finished episode.\nA lot of Obi-Wan Kenobi was shot on a set known as the volume, which Braff was shown around by Chow. The scenes with Freck, though, were filmed in a desert ranch, where the actor, by his own account, remarked to the director that the show's viewers would think the set was still the volume. According to Braff, Rosengrant, while in costume for the character, had to have cool air pumped into the suit due to the hot weather. During the shooting of Freck's scenes, the actor would recite his lines behind cameras with the headpiece on as part of the animatronic's choreography and a microphone was attached to his head piece to project his speech for the filmed interaction with Kenobi, Organa and the stormtroopers.\nBraff was surprised that, because of the secrecy behind Obi-Wan Kenobi's production, his \"sides\"—scripts he used for his part in the episode and hoped to take with him as a souvenir—were taken away by staff at the end of the day. After the release of \"Part III,\" fans reportedly mistook Braff's voice of Freck as that of the actor Seth Rogan. Braff himself discussed his role on his podcast with fellow Scrubs actor Donald Faison, who was also part of Star Wars as the character Hype Fazon in the 2018 animated show Star Wars Resistance. Expressing his joy about being in the show, he wished for there to be an action figure or LEGO set including him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Condluran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Transport",
  "/wiki/Mining",
  "/wiki/Planet",
  "/wiki/Mapuzo",
  "/wiki/Stormtrooper",
  "/wiki/9_BBY",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Youngling",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Spaceport",
  "/wiki/Trooper",
  "/wiki/Battle_on_Mapuzo",
  "/wiki/Soldier",
  "/wiki/Imperial_Era",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Repulsorcraft",
  "/wiki/Standard_year",
  "/wiki/Alderaanian",
  "/wiki/Alderaanian_monarchy",
  "/wiki/Mission_to_Daiyu",
  "/wiki/Kidnapping_of_Leia_Organa",
  "/wiki/Tawl",
  "/wiki/Unidentified_stormtrooper_1_(Mapuzo_truck)",
  "/wiki/Hunt_for_Obi-Wan_Kenobi",
  "/wiki/Unidentified_stormtrooper_2_(Mapuzo_truck)",
  "/wiki/Laser",
  "/wiki/Unidentified_stormtrooper_(Mapuzo_checkpoint)",
  "/wiki/Viper_probe_droid",
  "/wiki/Blaster_pistol",
  "/wiki/Probe_droid",
  "/wiki/Pistol",
  "/wiki/Eye",
  "/wiki/The_galaxy",
  "/wiki/Imperial_crest",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Glove",
  "/wiki/Leather",
  "/wiki/Part_III",
  "/wiki/Disney%2B",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Deborah_Chow",
  "/wiki/June_1",
  "/wiki/2022",
  "/wiki/John_Rosengrant",
  "/wiki/Zach_Braff",
  "/wiki/Donald_Faison",
  "/wiki/Star_Wars",
  "/wiki/Hype_Fazon",
  "/wiki/2018",
  "/wiki/Star_Wars_Resistance",
  "/wiki/LEGO",
  "/wiki/StarWars.com",
  "/wiki/Obi-Wan_Kenobi:_A_Jedi%27s_Return",
  "/wiki/Databank_(website)",
  "/wiki/Part_I",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Part_II",
  "/wiki/June_15",
  "/wiki/July_29",
  "/wiki/August_4"
 ]
}