{
 "name": "Freja_Covell",
 "display_name": "Freja Covell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corulag"
     ]
    },
    {
     "name": "Born",
     "values": [
      "29 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "9 ABY",
      "Wayland"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Army",
      "Imperial Army",
      "Thrawn's ConfederationThrawn's Army",
      "Thrawn's Army"
     ]
    }
   ]
  }
 ],
 "content": "Freja Covell was a Human male from Corulag who served as a general in the Imperial Army. One of Grand Admiral Thrawn's chief army commanders during his offensive against the New Republic, Covell led the takeover of the abandoned headquarters of Talon Karrde's organization on Myrkr. He was later killed by the insane clone Joruus C'baoth not long before the Battle of Bilbringi of 9 ABY.\nCovell had freshly graduated from the Academy when he was made a junior officer in an Army regiment commanded by Colonel Maximilian Veers. Under the colonel's tutelage, Covell learned to command ground forces and grew to love the AT-AT divisions as much as Veers did. They both understood the power of walkers and the fear they generated in the enemy. To sit in the cockpit of a walker satisfied Covell like nothing else could. Veers saw himself reflected in the younger officer, so that when Veers was promoted to general and given command of Darth Vader's ground forces in 3 ABY, he brought Covell with him, where Covell's excellent performance earned him the rank of colonel in charge of one of Veers' battlegroups.\nLieutenant Colonel Freja Covell managed to get the backing of the Assassin's Guild to fight three Rebel SpecForces units on Archais. The battle of Archais put both the Shroud and Eclipse Teams on the ropes. At that same moment, Rebel officer Mosara Thiirn deserted, surrendering her ship and herself to Covell, which led to an increasingly bad situation for the Rebel forces. Unfortunately for the Empire, Thiirn did not know any information they were unaware of.\nIn the Battle of Hoth, in which Veers' assault force routed the Rebel troops defending Echo Base, High Colonel Covell served as Veers' \"first officer,\" and personally commanded one of the AT-ATs assigned to Blizzard Force. The Rebel tactics brought down his walker, wounding him in the process, but he made a good showing of himself and his command abilities. Despite his wounds, he got to safety and took charge of a stormtrooper group, which routed a larger number of Rebel troops before they could dig into defensive positions.\nLater, Captain Gilad Pellaeon promoted Covell to the rank of Major General and placed him in command of the ground forces aboard the Chimaera. Subsequently, Grand Admiral Thrawn advanced Covell, now a general to a position of senior leadership in the Army. During Thrawn's campaign, General Covell commanded numerous ground assaults—often leading from the front—and was finally assigned to the protection of Wayland. At Wayland, Joruus C'baoth took control of his mind with the Force, and in fact replaced parts of Covell's mind with his own. However, a group of ysalamiri created interference with the Force that severed the connection. Covell's mind was compromised severely—while he lived for a short time inside the ysalamiri's bubble, long enough to relay some \"special orders\" given to him by C'baoth, he was dead before the next morning.\nCovell was a brilliant ground tactician. Like Veers, Covell mastered the commanding of the AT-AT and AT-ST units in battle during the post-Endor campaigns, ensuring that they would continued to be used by Imperial ground forces for years to come. Many of Covell's innovative ground battle tactics were adopted by later Imperial Army commanders.\nCovell disliked Imperial Navy officers, thinking them to be afraid to leave their ships and enter real combat.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corulag/Legends",
  "/wiki/29_BBY/Legends",
  "/wiki/9_ABY/Legends",
  "/wiki/Wayland",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Thrawn%27s_confederation",
  "/wiki/Thrawn%27s_army",
  "/wiki/General/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Thrawn_campaign",
  "/wiki/New_Republic/Legends",
  "/wiki/Myrkr_Base",
  "/wiki/Talon_Karrde",
  "/wiki/Myrkr/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Joruus_C%27baoth",
  "/wiki/Battle_of_Bilbringi_(9_ABY)",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Maximilian_Veers/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Assassin%27s_Guild/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Archais",
  "/wiki/Battle_of_Archais",
  "/wiki/Shroud_Team",
  "/wiki/Eclipse_Team",
  "/wiki/Mosara_Thiirn",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Blizzard_Force/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Major_General/Legends",
  "/wiki/Chimaera/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Ysalamir",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Star_Wars:_Rebellion_(video_game)",
  "/wiki/Dark_Force_Rising",
  "/wiki/Dark_Force_Rising_(unabridged_audiobook)",
  "/wiki/The_Last_Command",
  "/wiki/The_Last_Command_(unabridged_audiobook)",
  "/wiki/Dark_Force_Rising_Sourcebook",
  "/wiki/The_Last_Command_Sourcebook",
  "/wiki/The_Thrawn_Trilogy_Sourcebook",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Communiqu%C3%A9s",
  "/wiki/Star_Wars_Galaxy_Magazine_6",
  "/wiki/Star_Wars:_Rebellion:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}