{
 "name": "Freyyr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rwookrrorro"
     ]
    }
   ]
  }
 ],
 "content": "Freyyr  was a Wookiee Chieftain, the father of Zaalbar and Chuundar, from the village of Rwookrrorro on Kashyyyk.\nAfter Freyyr's son Zaalbar was exiled from Kashyyyk for being a madclaw after attacking his other son Chuundar for dealing with slavers, the latter began to spread rumors about his father's increasing state of instability. This allowed Chuundar to eventually oust Freyyr from his position, exiling him to the Shadowlands by branding him, too, as a madclaw.\nSome time later when Zaalbar, accompanied by Revan and his companions arrived on Kashyyyk, Chuundar asked Revan to kill \"a mad Wookiee\" who lurked in the Shadowlands. Upon further investigation in the dangerous Lower Shadowlands, Revan learned the true story. Freyyr was indeed feral by the time they met him and, not recognizing the ex-Jedi Jolee Bindo who had helped him to escape slavery at the hands of the Czerka Corporation, attacked them both. In the ensuing melee Freyyr was subdued, but instead of killing him, Revan managed to reason with him enough to learn the truth of both his and Zaalbar's exile.\nAfter discussing the current matters, Revan agreed to help Freyyr by retrieving the blade part of Bacca's Ceremonial Blade, which was eventually found in the hide of a terentatek that had been lurking nearby. However, since Chuundar still possessed the hilt of the sword, he still held some measure of legitimacy among the Wookiees of Rwookrrorro. Bacca's Ceremonial Blade was a sacred relic to the Wookiees and the symbol of authority for all chieftains since Bacca himself. With the blade in their possession Freyyr, Revan and his companions ascended back to the village, after a brief confrontation with some of Chuundar's lackeys, and then led a revolt against Chuundar and his backers, the Czerka Corporation, killing Chuundar.\nFreyyr once again became chieftain of the village, and upon his son's request, gave Zaalbar the blade in gratitude and as a sign of repentance for exiling him years before.\nIn the alternative dark side ending, Revan can kill him and help Chuundar. He can also pretend to be helping Freyyr by bringing him to Chuundar's court and then kill him with Chuundar, Zaalbar, Wookiees loyal to Chuundar, and Czerka guards.\nFreyyr's warblade can be found by the Jedi Exile in Star Wars: Knights of the Old Republic II: The Sith Lords.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Freyrr",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Rwookrrorro/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Jolee_Bindo",
  "/wiki/Wookiee_Chieftain",
  "/wiki/Zaalbar",
  "/wiki/Chuundar",
  "/wiki/Madclaw",
  "/wiki/Slavery/Legends",
  "/wiki/Shadowlands/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Bacca%27s_Ceremonial_Blade",
  "/wiki/Terentatek/Legends",
  "/wiki/Bacca",
  "/wiki/Rebellion_on_Kashyyyk",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Freyyr%27s_warblade",
  "/wiki/Meetra_Surik",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Star_Wars:_Tiny_Death_Star",
  "/wiki/Canon",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Rothrrrawr",
  "/wiki/3956_BBY"
 ]
}