{
 "name": "Freyta Smyth",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Starlight Squadron",
      "Starlight Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Freyta Smyth was a Twi'lek pilot who served in the Alliance to Restore the Republic during the Galactic Civil War. Smyth became a member of Starlight Squadron, serving as a T-65B X-wing starfighter pilot during Operation Starlight against the Galactic Empire.\nAround 3 ABY, Freyta Smyth was recruited into Starlight Squadron as a T-65B X-wing starfighter pilot, as part of the Fourth Division's Operation Starlight. Smyth and rest of the Starlight Squadron took part in their first mission, led by Starlight Leader Lieutenant Shara Bey, upon which they were tasked by General Leia Organa with finding the scattered divisions of the Alliance Fleet following the Battle of Hoth, to warn them that the Galactic Empire had cracked Alliance communications and to deliver a new Trawak security code that C-3PO and his team had developed. During their search, the squadron discovered wreckage of the Sixth Division near Felucia. Shortly after, they encountered Imperial probe droids waiting nearby. The probe droids latched onto the X-wing astromech droids and attempted to access their archives by drilling into their conical domes. Fearing the probe droids might get the coordinates of the other rendezvous points, Wedge Antilles suggested shooting them off, however Bey questioned his ability to actually pull it off. Instead, Bey ordered all pilots to set their astromech's self-destruct and eject them. However, doing this would mean losing their nav data that would make it difficult getting back to the fleet. With no other choice, the droids ejected and detonated, saving their valuable data from the Empire.\nWith no time to catch their breath, the Imperial II-class Star Destroyer Tarkin's Will arrived and ambushed the squadron. The Star Destroyer launched TIE fighters, which outnumbered the Rebel starfighters three to one. Mart Mattin  suggested the A-wings leave while they still had a chance, as there was no way they could coordinate a hyperspace jump during a dogfight without their astromechs. However, Bey made it clear that she was staying to fight. After studying the TIE's tactics, Captain L'ulo L'ampar  noticed the TIEs were not ganging up on individual starfighters, per the Imperial Tactical Manual when outnumbering the enemy, and quickly realized they were being herded. The Tarkin's Will engaged its tractor beams, catching the squadron's starfighters to bring them in for interrogation. Evaan Verlaine and Antilles agreed that using brute force to try to escape would not work. Antilles then suggested a maneuver that the Rebel pilots war-gamed back in Rogue Squadron but was untested. The maneuver involved accelerating full throttle and riding the tractor beam toward the Star Destroyer. As they did this, the Imperials aboard the Tarkin's Will remained unphased, as the starfighter tactics gave the impression the Rebels were planning to ram the Star Destroyer in a last-ditch suicide mission. As soon as the shields dropped to pull the starfighters in, the squadron targeted the tractor beam projectors and fired their concussion missiles and proton torpedoes, destroying it. With the tractor beam offline, and the Star Destroyer's targeting computers unable to lock on due to their speed, the Starlight starfighters raced into the hangar, and fired upon the TIE fighters and stormtroopers within. This prevented anymore TIEs from scrambling from the Tarkin's Will.\nMattin and Verlaine's X-wings stood guard to keep the TIEs that were chasing them, out of the hangar, while L'ampar's A-wing covered the interior access door from stormtroopers. With the hangar temporarily locked down from further Imperial threats, the rest of the pilots landed and disembarked their ships. Getting close to the tractor beam generators had fried the A-wings' navigational memory banks, so Bey and Smyth scrambled to a group of Imperial astromech droids sitting idle nearby, while Antilles provided cover fire. Smyth sliced into one of the astromechs, and was surprised that it wasn't using tough encryption. Bey ordered Smyth to get the astromech back to an X-wing and start running the hyperspace calculations, while she stayed behind to do something. Just as L'ampar destroyed an AT-ST walker, more entered the hangar.\nAntilles urged Bey to hurry as the Imperial astromech in his X-wing had almost finished the nav calculations and all their ships were linked and ready to go. Bey explained that she was able to steal all kinds of valuable intelligence from the other Imperial droids in the hangar, which they could take back to the fleet. As Bey raced back to her A-wing, it was destroyed by an AT-ST, leaving her stranded. On witnessing this, L'ampar told Bey not to give up, as Starlight would continue to fight the AT-STs and steal her a ship. However, Bey recognised the foolishness of these actions, as staying to help would lose them their only chance to get back to the fleet, and so she issued a direct order to L'ampar to go, along with a request for him to tell her husband, Kes Dameron, that she loved and have him kiss her son, Poe, for her. L'ampar reluctantly acknowledged the order, and the squadron left without her.\nOn the way back to the fleet, L'ampar, now Starlight Two, sent a transmission to the division, stating the mission was unsuccessful. He mentioned finding the remains of the Sixth Division, the ambush by the same Star Destroyer that had been hunting them across the galaxy, and fighting on it that resulted in leaving Starlight Leader behind. He finished off with the only bit of good news, regarding the capture of an Imperial astromech droid with memory banks full of useful navigational data, which was Bey's idea. Later, Smyth's squadron leader Bey, who everyone thought had been caught, had managed to evade capture, and escape the Star Destroyer hangar deck. Bey had found a hiding place somewhere on the big, city-sized starship and managed to dismantle an Imperial astromech droid and slice into the Imperial systems to obtain valuable information. Bey raised comms with the Fourth Division and talked to her husband, Kes Dameron, and then debriefed General Leia Organa on the intelligence she had gathered while in hiding.\nFreyta Smyth was a Twi'lek with purple skin and lekku head-tails, and light blue eyes. Smyth was good with technology and was capable of slicing encryption used on Imperial astromech droids.\nFreyta Smyth wore an orange flight suit and flew a T-65 X-wing starfighter for the Rebel Alliance during the Galactic Civil War.\nFreyta Smyth first appeared in Star Wars  10, a comic written by Charles Soule, illustrated by Jan Bazaldua, and published by Marvel Comics on January 6, 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Operation_Starlight",
  "/wiki/Star_Wars_(2020)_15",
  "/wiki/Star_Wars_(2020)_21",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Twi%27lek",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Starlight_Squadron",
  "/wiki/Pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Operation_Starlight",
  "/wiki/Galactic_Empire",
  "/wiki/3_ABY",
  "/wiki/Fourth_Division",
  "/wiki/Starlight_Leader",
  "/wiki/Lieutenant",
  "/wiki/Shara_Bey",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Battle_of_Hoth",
  "/wiki/Trawak",
  "/wiki/C-3PO",
  "/wiki/Sixth_Division",
  "/wiki/Felucia",
  "/wiki/Ambush_near_Felucia",
  "/wiki/Viper_probe_droid",
  "/wiki/X-wing_starfighter",
  "/wiki/Astromech_droid",
  "/wiki/Wedge_Antilles",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Tarkin%27s_Will",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Mart_Mattin",
  "/wiki/Starlight_Four",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Captain",
  "/wiki/L%27ulo_L%27ampar",
  "/wiki/Starlight_Three",
  "/wiki/Imperial_Tactical_Manual",
  "/wiki/Evaan_Verlaine",
  "/wiki/Rogue_Squadron",
  "/wiki/Tractor_beam_projector",
  "/wiki/Concussion_missile",
  "/wiki/Proton_torpedo",
  "/wiki/Tractor_beam",
  "/wiki/Stormtrooper",
  "/wiki/TIE_line",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Shara_Bey%27s_A-wing",
  "/wiki/Kes_Dameron",
  "/wiki/Starlight_Two",
  "/wiki/The_galaxy",
  "/wiki/Lekku",
  "/wiki/Flight_suit",
  "/wiki/Star_Wars_(2020)_10",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Charles_Soule",
  "/wiki/Jan_Bazaldua",
  "/wiki/Marvel_Comics",
  "/wiki/January_6",
  "/wiki/2021",
  "/wiki/Category:Images_of_Freyta_Smyth",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/Star_Wars_(2020)_12",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/StarWars.com"
 ]
}