{
 "name": "Freya Fenris",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Yir Tangee"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.70 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pale blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ace Squadron",
      "Team Colossus"
     ]
    }
   ]
  }
 ],
 "content": "Freya Fenris was a human female pilot who served with Ace Squadron, a team of starship racers that also flew defense for the Colossus platform. Fenris' personal starfighter was the Red Ace.\nFreya Fenris was a skilled racing pilot from Yir Tangee and, by 34 ABY, her skills had earned her a place among the Ace Squadron of the Colossus platform on the ocean planet Castilon, flying her ship, the Red Ace. Besides racing, Fenris and her fellow Aces defended the platform from pirate attacks and also escorted convoys.\nWhen Kragan Gorr's Warbird gang attacked the station, she led fellow Aces Torra Doza, Hype Fazon and Bo Keevil in fighting off the pirates. They fought well, despite being outnumbered. When the pirates retreated, Fenris attributed the victory to the Aces' skill, although Doza had doubts, suspecting another factor. Unbeknownst to both women, Doza was correct, as Kazuda Xiono, a Resistance spy recently sent to the Colossus, had covertly aided the pilots by broadcasting feedback over the pirates' communications channel.\nSome time later, she led Keevil and Griff Halloran in escorting in a fuel freighter while the Colossus was under a power outage. This freighter was carrying a First Order delegation led by Major Elrik Vonreg, who had come to discuss a First Order protection offer with Captain Imanuel Doza, the ruler of the Colossus. Unknown to everyone, the First Order was behind the pirate attacks on the Colossus.\nWhile Fenris and her fellow Aces were escorting a fuel shipment, the Warbirds launched a second raid on the Colossus. Though the pirates were rebuffed by Team Fireball and the undercover pirate Synara San, the pirate raid led Captain Doza to reconsider the First Order's \"protection offer.\"\nFenris and her fellow Aces took part in the Platform Classic against galactic racing champion Marcus Speedstar and his estranged older brother Jarek Yeager. After Griff's racer crashed into the sea, Fenris was able to move up fifth place. Ultimately Yeager allowed Speedstar to win the race so that Speedstar could pay a ransom freeing his friend Oplock from the Guavian Death Gang.\nPrior to a visit by First Order Commander Pyre, Fenris and Griff covered Torra Doza's patrol shift since her father Captain Doza wanted to keep her safe for the duration of the visit. Later, Fenris was socializing with the other Aces at the Aces' Lounge in Doza Tower when Torra entered with her mechanic friend Xiono. Unknown to everyone, Xiono was an undercover Resistance spy who was spying on Captain Doza's dealings with the First Order.\nLater, Freya and her fellow Aces took part in a race. Though Torra initially had the lead, she burned up all her booster fuel too early, allowing Hype to take the lead.\nFenris later accompanied her fellow Aces on a mission to escort an incoming shipment. When the ship was unable to slow down due to damage from a pirate attack, the Aces under Hype's leadership worked together to slow down the ship's descent.\nDuring the Bibo incident, Freya Fenris and her fellow Aces flew their racers in the defense of the Colossus against Bibo's mother, a rokkna sea monster. Despite being helped by Kaz, the Aces were unable to drive away the sea monster. When Freya reported their cannons were not working, Kaz's friend Neeku Vozo managed to convince the Aces to hold their fire. Neeku managed to bring an end to the siege by returning Bibo to its mother.\nFollowing the kidnapping of their fellow Ace Torra Doza, Freya and her fellow pilots were dispatched in pursuit of her pirate kidnappers. Torra was rescued by Major Elrik Vonreg, who convinced Captain Pyre to accept First Order protection.\nDuring the First Order's occupation of the Colossus, Commander Pyre cancelled all races, and banned the Aces from flying. When Captain Doza broke the news to them, Freya was the first of the Aces to protest against it. When Hype Fazon stormed off, Torra Doza tried to follow him, but Freya told her to let him go, saying he just needed to \"blow off some steam.\"\nWhen tensions escalated between the Colossus and the First Order, Freya and the other Aces were captured and imprisoned in the Colossus' brig. While First Order forces were distracted elsewhere, Captain Doza came and freed them, telling them to get to their ships and defend the station. The Aces, along with Jarek Yeager and Kazuda Xiono, engaged the TIE fighters patrolling the station's airspace, with the help of the Colossus' turbolasers, and later Kragan Gorr's pirates. When a Resurgent-class Star Destroyer appeared in Castilon's atmosphere, Freya and the other Aces quickly retreated to the Colossus, and stood watching in the hangar as the station escaped into hyperspace.\nWhile a salvage team from the Colossus was searching the wreckage of the Dreadnought Fulminatrix above the planet D'Qar, Commander Pyre and Agent Tierny's Resurgent-class Star Destroyer found them, and TIE fighters were sent to attack the station. Captain Doza ordered Freya and the other Aces to defend the Colossus in order to buy time. Freya expressed concern that the Aces were outnumbered, but they successfully held off the First Order long enough for the salvage team to secure a canister of coaxium. The Aces were ordered to retreat, and Freya announced that they would have to come in hot, as the station was in motion while they were trying to land. All of the Aces made it into the hangar, and the Colossus jumped to hyperspace shortly afterward.\nAfter the Colossus's narrow escape from D'Qar, Freya, Torra, Griff and Bo were demoralized, feeling that they were outmatched by the First Order. Captain Doza's solution to this problem was to add Kazuda Xiono to the Aces, and to appoint Jarek Yeager to be their Squadron Leader, as both pilots had military experience. Freya was visibly shocked by this announcement, but seemed to agree with Torra's assessment that they should give Yeager a chance.\nThe newly expanded Ace squadron met in Yeager's hangar to discuss the plan for their training, although Freya wondered why they couldn't hold the briefing in a nicer location. Yeager announced that they would be having a skirmish on a nearby ice moon with two teams- Kaz and himself, versus all of the other Aces. Despite being outnumbered, Kaz and Yeager quickly overpowered the other Aces. Freya briefly managed to lock onto Kaz, but was flanked by Yeager before she could successfully land a hit.\nFor their second training exercise, Yeager split the Aces into pairs. Freya teamed up with Bo, but before they could join the skirmish, the Aces were attacked by a jakoosk, which grabbed Yeager's ship and began pulling it towards its mouth. Freya and the other Aces managed to rescue Yeager using Hype's idea to knock an ice pillar down onto the creature. Later, Freya joined the Aces and some other residents of the Colossus at Aunt Z's to celebrate their success.\nFreya was present when Captain Doza tried to reassure the residents of the Colossus when the stations' food supplies ran out, and watched as many of the inhabitants announced their intention to leave. She also watched as the engineer Nenavakasa Nalor performed repairs in the Aces' Lounge, and celebrated that they would be able to have \"Hologame nights\" again.\nWhen the Colossus made a stop at the planet Ashas Ree, Captain Doza assigned Freya, Torra and Kaz the task of going on a supply run there. Unbeknownst to Freya and Torra, Kaz allowed Kel and Eila to sneak on board the supply shuttle. As they approached the planet, Freya observed that she was unable to contact anyone at the trade outpost. Upon landing, they discovered that the marketplace had been abandoned, and its residents had left behind warnings about some unnamed \"evil\" written on the walls. Freya was slightly unnerved, but decided they shouldn't let the abandoned supplies go to waste, and proposed they split up and meet back up in an hour.\nFreya and Torra regrouped at the shuttle on time, but Kaz and CB-23 were nowhere to be seen. Adding to their worries, Freya noticed that additional ships had appeared on the shuttle's sensors, and Torra confirmed that her father hadn't sent anyone else from the Colossus. The ships turned out to be First Order Raiders, who captured Freya, Torra and their droids, and began interrogating them. When questioned, Freya lied that no one else had come to Ashas Ree with them. However, the troopers quickly discovered and captured Kaz, CB-23, and the children, who had just exited the temple near the marketplace.\nJust as the First Order Raiders began to question Kaz, the archaeologist Mika Grey shouted from the top of the temple, revealing that she had the Sith artifact the troopers were after. They threatened to kill their hostages if she didn't hand it over, so Mika activated the artifact and threw it at them, calling out a warning which allowed Freya and the others to narrowly avoid the resulting blast by hiding in the temple. Once the coast was clear, they left the temple, and CB-23 removed the restraints from Freya and Torra's wrists.\nFreya raised no objection when Eila proposed that Mika should come live on the Colossus, but told Kaz she thought Mika seemed like trouble. The group then took off and returned to the Colossus.\nFreya Fenris was a human female with blonde hair, blue eyes, and light skin. She had a cold personality, and rarely smiled.\nAs one of the Aces, Freya Fenris was one of the most skilled pilots on the Colossus. Her personal ship was the Red Ace.\nFreya Fenris is a character created for Star Wars Resistance. She is voiced by Mary Elizabeth McGlynn, who voiced Governor Arihnda Pryce in Star Wars Rebels.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Fenris_(disambiguation)",
  "/wiki/All_Aces_Battle_Royale_(comic)",
  "/wiki/Star_Wars_Resistance_Season_Two",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Special:Upload",
  "/wiki/Yir_Tangee",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Ace_Squadron",
  "/wiki/Team_Colossus",
  "/wiki/Pilot",
  "/wiki/Squadron",
  "/wiki/Starship",
  "/wiki/Racer",
  "/wiki/Colossus",
  "/wiki/Starfighter",
  "/wiki/Red_Ace",
  "/wiki/34_ABY",
  "/wiki/Ocean",
  "/wiki/Planet",
  "/wiki/Castilon",
  "/wiki/Pirate",
  "/wiki/Kragan_Gorr",
  "/wiki/Warbird_gang",
  "/wiki/Raid_on_the_Colossus",
  "/wiki/Torra_Doza",
  "/wiki/Hype_Fazon",
  "/wiki/Bo_Keevil",
  "/wiki/Kazuda_Xiono",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Mission_on_the_Colossus_platform",
  "/wiki/Griff_Halloran",
  "/wiki/Fuel",
  "/wiki/Freighter",
  "/wiki/First_Order",
  "/wiki/Major",
  "/wiki/Elrik_Vonreg",
  "/wiki/Captain",
  "/wiki/Imanuel_Doza",
  "/wiki/Second_raid_on_the_Colossus",
  "/wiki/Team_Fireball",
  "/wiki/Synara_San",
  "/wiki/Platform_Classic",
  "/wiki/Marcus_Speedstar",
  "/wiki/Jarek_Yeager",
  "/wiki/Oplock",
  "/wiki/Guavian_Death_Gang",
  "/wiki/Commander",
  "/wiki/Pyre",
  "/wiki/Aces%27_Lounge",
  "/wiki/Second_mission_to_Doza_Tower",
  "/wiki/Bibo_incident",
  "/wiki/Bibo%27s_mother",
  "/wiki/Neeku_Vozo",
  "/wiki/Bibo",
  "/wiki/Kidnapping_of_Torra_Doza",
  "/wiki/Battle_of_Castilon",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Turbolaser",
  "/wiki/Thunderer",
  "/wiki/Hyperspace",
  "/wiki/Mandator_IV-class_Siege_Dreadnought",
  "/wiki/Fulminatrix",
  "/wiki/D%27Qar",
  "/wiki/Agent",
  "/wiki/Tierny",
  "/wiki/Coaxium",
  "/wiki/Jarek_Yeager%27s_Repair_Station",
  "/wiki/Celsor_3",
  "/wiki/Jakoosk",
  "/wiki/Aunt_Z%27s_Tavern",
  "/wiki/Engineer",
  "/wiki/Nenavakasa_Nalor",
  "/wiki/Hologame",
  "/wiki/Ashas_Ree",
  "/wiki/Kel",
  "/wiki/Eila",
  "/wiki/Star_Commuter_2000",
  "/wiki/Unidentified_trading_outpost",
  "/wiki/CB-23",
  "/wiki/First_Order_Raider",
  "/wiki/Ashas_Ree_Temple_of_the_Force",
  "/wiki/Archaeologist",
  "/wiki/Mika_Grey",
  "/wiki/Unidentified_Sith_relic",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Mary_Elizabeth_McGlynn",
  "/wiki/Governor",
  "/wiki/Arihnda_Pryce",
  "/wiki/Star_Wars_Rebels",
  "/wiki/The_Recruit",
  "/wiki/The_Triple_Dark",
  "/wiki/Fuel_for_the_Fire",
  "/wiki/The_High_Tower",
  "/wiki/Synara%27s_Score",
  "/wiki/The_Platform_Classic",
  "/wiki/Secrets_and_Holograms",
  "/wiki/The_Need_for_Speed",
  "/wiki/Sixty_Seconds_to_Destruction",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_16",
  "/wiki/Bibo_(episode)",
  "/wiki/The_Doza_Dilemma",
  "/wiki/The_Disappeared",
  "/wiki/Descent_(episode)",
  "/wiki/No_Escape:_Part_2",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/Live_Fire",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/The_Engineer",
  "/wiki/The_Relic_Raiders",
  "/wiki/Rendezvous_Point_(episode)",
  "/wiki/The_Voxx_Vortex_5000",
  "/wiki/Kaz%27s_Curse",
  "/wiki/Breakout",
  "/wiki/The_Mutiny",
  "/wiki/The_New_World",
  "/wiki/No_Place_Safe",
  "/wiki/The_Escape",
  "/wiki/Star_Wars_Resistance_Racer",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Resistance:_Meet_the_Pilots",
  "/wiki/2019_Topps_Star_Wars_Resistance_Surprise_Packs",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Star_Wars_Book",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ace_Squadron_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars_Resistance_Season_One",
  "/wiki/Standard_month",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Mission_to_Megalox_Beta",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/C.R.C.",
  "/wiki/Galactic_standard_calendar"
 ]
}