{
 "name": "Frid_Kelio",
 "display_name": "Frid Kelio",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lothal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Junior Academy of Applied Sciences",
      "AppSci SaberCats",
      "AppSci SaberCats"
     ]
    }
   ]
  }
 ],
 "content": "Frid Kelio was a male Rodian who played striker for the Junior Academy of Applied Sciences' grav-ball team, the AppSci SaberCats. Kelio was eventually transferred to the Technical Institute for Agricultural Research by Athletic Director Janus Fhurek, who claimed that being nonhuman gave the SaberCats an unfair advantage. During the summer holidays, Frid helped his former team player Zare Leonis to get back in contact with Beck Ollet, another former grav-ball player who had joined a resistance cell on Lothal.\nFrid Kelio was a student at the Junior Academy of Applied Sciences in Lothal's Capital City. He served as a striker in the school's grav-ball team, the AppSci SaberCats. Along with the Aqualish Hench Sina, he was one of the two alien players in the SaberCats. Kelio had a good relationship with Zare Leonis, the team's center-striker who had recently migrated to Lothal. Leonis was an effective and well-liked leader who guided the SaberCats to victory against other school teams.\nDuring the winter, the Junior AppSci's athletic director, Janus Fhurek, attempted to get Leonis to remove Frid and Hench from the SaberCats on the grounds that fans would complain their alien physiognomies gave them an unfair advantage. Realizing that Fhurek was xenophobic, Leonis refused to comply with Fhurek's orders and kept the two alien players on his team for the final match of the season. In response, Fhurek arranged for Frid and Hench to be transferred to the Technical Institute for Agricultural Research, effectively preventing them from participating in the final tournament.\nFrid later met his former classmate Leonis at Capital City's market place during the summer holidays. Delighted to see Leonis, Frid gave Zare a friendly clout on the shoulder and complimented the former center-striker for giving Fhurek a black eye. Earlier, Fhurek had insulted Leonis by labeling his missing sister Dhara Leonis a deserter and suggested that treason ran in the Leonis family. At Leonis' request, Frid contacted another former grav-ball player named Beck Ollet to inform him that Leonis wanted to contact him. Two days later, Ollet met Leonis and revealed that he had joined a resistance cell on Lothal.\nAs a grav-ball striker in the AppSci SaberCats, Frid Kelio had \"good hands\" for catching the ball. He looked up to the team's center-striker Zare Leonis, who was an effective and popular leader. Frid disliked the xenophobic athletic director Janus Fhurek for removing him from the AppSci SaberCats by transferring him to a different school.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lothal",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Junior_Academy_of_Applied_Sciences",
  "/wiki/AppSci_SaberCats",
  "/wiki/Grav-ball",
  "/wiki/Technical_Institute_for_Agricultural_Research",
  "/wiki/Athletic_director",
  "/wiki/Janus_Fhurek",
  "/wiki/Zare_Leonis",
  "/wiki/Beck_Ollet",
  "/wiki/Capital_City",
  "/wiki/Aqualish",
  "/wiki/Hench_Sina",
  "/wiki/Winter",
  "/wiki/Alien",
  "/wiki/Xenophobia",
  "/wiki/Summer",
  "/wiki/Dhara_Leonis",
  "/wiki/Leonis_family",
  "/wiki/Servants_of_the_Empire:_Edge_of_the_Galaxy"
 ]
}