{
 "name": "Friggy Squig",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gungan society"
     ]
    }
   ]
  }
 ],
 "content": "Friggy Squig was a male Gungan bongo racer alive during the build up to the Clone Wars on the planet Naboo.\nSquig was one of a large number of Gungans who raced during bongo racing's rise in popularity after the Battle of Naboo, due to off-worlder tourist interest. Early in his career, he supported his fellow racer Zak Quiglee's attempt, along with Tup Tup Grizbain, to get their reckless competitors, Neb Neb Goodrow and Spleed Nukkels, banned from the sport. This was based on accusations of collusion, greatly endangering the lives of others and giving the sport a bad name with their reckless driving. However, their charges were thrown out by the Gungan race commissioner and never reached the Gungan High Council.\nSometime after the battle of Naboo, he took part in the Otoh Gunga Challenge, where he drove a monobubble Bongo, along with a large number of contestants including Grizbain, Quiglee, Goodrow, Nukkels and veteran racer Brooboo Seep, along with twenty six other vessels, including the Opee Fleer. The race had a large number of spectators, including Boss Rugor Nass and the Ithorian ambassador, as well as large number of tourists and Gungans. Once the race began, the Opee Fleer took the lead, with Tup Tup, Friggy and Quiglee close behind it in their respective vessels. However, Spleed, Neb Neb and Brooboo quickly caught up to the Opee Fleer, much to Tup Tup, Friggy and Zak's annoyance. In an attempt to stop Nukkels overtaking the trio, Friggy Squig performed a 'twisty', rolling his bongo to prevent her passing. disappeared Brooboo Seep went on to win the race, after Grizbain drove into the Opee Fleer. Neb Neb Goodrow and Spleed Nukkels ended up colliding, while trying to overtake Seep, leading to the crash of Zak Quiglee and unexpectedly going missing.\nSquig was a fairly skilled bongo racer, but was over eager and driven by his dislike of Goodrow and Nukkels, as shown by his attempt to block Spleed, despite her dangerous reputation and extreme driving style.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gungan_society",
  "/wiki/Bongo",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Zak_Quiglee",
  "/wiki/Tup_Tup_Grizbain",
  "/wiki/Neb_Neb_Goodrow",
  "/wiki/Spleed_Nukkels",
  "/wiki/Gungan_High_Council/Legends",
  "/wiki/Otoh_Gunga_Challenge",
  "/wiki/Brooboo_Seep",
  "/wiki/Opee_Fleer",
  "/wiki/Rugor_Nass/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Deep_Spoilers",
  "/wiki/Star_Wars_Gamer_4"
 ]
}