{
 "name": "Frobb",
 "display_name": "Frobb",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Frobb was a human male Second Lieutenant of the Galactic Empire who was stationed at the Citadel Tower on Scarif in 0 BBY. Responsible for overseeing starships launching and landing on pad nine, Frobb was present for the arrival of the stolen Imperial cargo shuttle SW-0608, which was carrying a team of Rebel Alliance soldiers aiming to steal the Death Star plans.\nFrobb summoned an inspection team to board the shuttle, but the rebels incapacitated the Imperials and stole their uniforms, allowing them to enter the tower unnoticed. Other rebels then sneaked off the shuttle and detonated a series of explosives, initiating the Battle of Scarif. The Death Star obliterated the tower shortly thereafter once the rebels successfully transmitted the plans to their fleet.\nThe human male Frobb served the Galactic Empire as a Second Lieutenant. In the year 0 BBY, Frobb was stationed at the Empire's Citadel Tower on the planet Scarif as the deck officer of Landing Platform Nine. He was responsible for cataloging shuttle landings and takeoffs, ensuring that vessels were stocked with enough fuel, life support, and victuals, and ordering ship inspections should something seem unusual.\nFrobb, Lieutenant Tobix Chasser, and a stormtrooper were present at one of pad nine's control panels when the Imperial cargo shuttle SW-0608 was directed to land there. SW-0608 had originally been stationed on the planet Eadu but, unbeknownst to Frobb and the Empire, had been stolen by the Rebel Alliance and was now carrying a group of rebel soldiers who planned to steal the plans to the Empire's Death Star superweapon from the Citadel Tower's data vault.\nFrobb ordered an inspection team to board the shuttle and messaged the crew of SW-0608 to warn them that the team was approaching. The rebels then incapacitated the boarding team and stole their uniforms, allowing rebel agents Jyn Erso and Cassian Andor to disguise themselves and disembark the shuttle with their droid, K-2SO. Chasser opened the blast door to the landing pad for the disguised rebels, who then mounted a railspeeder up to the Citadel Tower.\nA large number of rebel soldiers then sneaked off the shuttle without Frobb or Chasser noticing and moved to other landing pads to set explosives. They detonated these charges as a distraction to draw the Imperial forces away from Erso and Andor, and fighting soon erupted between rebels and Imperials outside the tower, including on pad nine. Eventually, the rebels successfully transmitted the Death Star plans to the Alliance Fleet above Scarif, shortly after which the Death Star itself fired upon the Citadel Tower, destroying it and annihilating the surrounding area.\nFrobb had light skin; red hair, including a beard; and green eyes.\nFrobb wore a black Imperial military uniform, including a hat and a utility belt, with both bearing officer's disks, during his service at the Citadel Tower on Scarif.\nFrobb was portrayed by actor Geoff Bell in the 2016 Anthology film, Rogue One: A Star Wars Story. His name and rank were revealed in the film's credits despite never being spoken in the film.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/File:Frobb.ogg",
  "/wiki/Second_Lieutenant",
  "/wiki/Citadel_Tower",
  "/wiki/Scarif",
  "/wiki/0_BBY",
  "/wiki/Starship",
  "/wiki/Landing_Platform_Nine",
  "/wiki/Mission_to_Eadu",
  "/wiki/Zeta-class_Heavy_Cargo_Shuttle",
  "/wiki/SW-0608",
  "/wiki/Rogue_One",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_trooper",
  "/wiki/Death_Star_plans",
  "/wiki/Shuttle",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Battle_of_Scarif",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Standard_year",
  "/wiki/Planet",
  "/wiki/Deck_officer",
  "/wiki/Fuel",
  "/wiki/Life_support",
  "/wiki/Foodstuff",
  "/wiki/Lieutenant",
  "/wiki/Tobix_Chasser",
  "/wiki/Stormtrooper",
  "/wiki/Eadu",
  "/wiki/Thief",
  "/wiki/Superweapon",
  "/wiki/Scarif_vault",
  "/wiki/Agent",
  "/wiki/Jyn_Erso",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/KX-series_security_droid",
  "/wiki/K-2SO",
  "/wiki/Blast_door",
  "/wiki/Railspeeder",
  "/wiki/Soldier",
  "/wiki/Imperial_Military",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Imperial_kepi",
  "/wiki/Utility_belt",
  "/wiki/Officer%27s_disk",
  "/wiki/Geoff_Bell",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Military_rank",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Rogue_One_Adaptation_5",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}