{
 "name": "Frosif",
 "display_name": "Frosif",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Agbui"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark red and off-white"
     ]
    }
   ]
  }
 ],
 "content": "Frosif was a female Agbui \"mid-ager\" aboard the Agbui starship on Celwis. She was Shimkif's daughter, and posed as the daughter of Haplif.\nWhile living among the Chiss on Celwis, Frosif became friends with Lakphro's daughter, Lakris. One day, Lakris wanted to convince Frosif that she had the telepathic ability to summon growzers. Unbeknownst to Lakris, Frosif and other Agbui actually possessed such abilities. Lakris had trained her growzer to come when called by the sound of a brass zipper, which the young Chiss claimed on many occasions to be a telepathic ability.\nWhen Lakris performed the \"telepathic call\" trick with her growzer for Frosif, the Agbui girl had an unexpected post-traumatic episode. Frosif's panic attack led Lakphro to become suspicious of the Agbui's origins. Lakphro asked Senior Aide Lakjip to investigate the girl's trauma response. It turned out that the brass zipper's sound was similar to the explosion of flat-blast artillery shells. Unbeknownst to any of the Chiss, Frosif's traumatic episode was a flashback to the time the Agbui had spent on Sunrise, where Haplif had instigated a disastrous civil war. Haplif pushed both sides of the war into using that kind of artillery shells, thus giving his alleged daughter a traumatic trigger.\nIn the aftermath of Frosif's panic attack, Haplif gave Lakris and her mother Lakansu nyix brooches to apologize, and to thank the family for hosting them. This led Lakphro to become even more suspicious of the Agbui, perceiving the valuable gifts as a bribe.\nLike other Agbui, Frosif possessed a touch-based form of telepathy. Frosif was frequently able to read the emotional state of Lakris, but rarely able to read the girl's father Lakphro. This led Haplif to become angry with Frosif.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Agbui",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Starship",
  "/wiki/Celwis",
  "/wiki/Shimkif",
  "/wiki/Haplif",
  "/wiki/Chiss",
  "/wiki/Xodlak%27phr%27ooa",
  "/wiki/Lakris",
  "/wiki/Telepathy",
  "/wiki/Growzer",
  "/wiki/Senior_Aide",
  "/wiki/Xodlak%27ji%27iprip",
  "/wiki/Flat-blast_artillery_shell",
  "/wiki/Sunrise",
  "/wiki/Sunrise%27s_civil_war",
  "/wiki/Parent",
  "/wiki/Lakansu",
  "/wiki/Nyix",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)"
 ]
}