{
 "name": "Fsir",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Watith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Watith leaders"
     ]
    }
   ]
  }
 ],
 "content": "Captain Fsir was a male Watith who served as the captain of his freighter, the Saltbarrel. He was hired by the Grysk agent Jixtus to stop Chiss Senior Captain Mitth'raw'nuruodo  from joining a battle and therefore preventing a civil war. Later, when Fsir encountered Thrawn's Chiss heavy cruiser, the Springhawk, he simulated he was being attacked by \"evil marauders\", which in reality were being controlled by the captain remotely, he then Thrawn to help him, receiving help and an interrogation before Thrawn and Fsir traveled to the \"Vagaari pirate base\" that Fsir had guided Thrawn to, there, the Watith attempted to destroy Thrawn. However, he was unsuccesful, and later captured and interrogated by the Chiss.\nIn 18 BBY, Captain Fsir was hired by an over-confident alien, the Grysk Jixtus to destroy, or delay Chiss Senior Captain Mitth'raw'nuruodo  and his Chiss heavy cruiser, the Springhawk.\nLater, during the Hoxim incident at the planet of Hoxim, Fsir traveled across several sectors in an attempt to find Thrawn and his warship. Eventually, he found the Chiss and began with some \"theatrics,\" Fsir, with his freighter Saltbarrel sent several Watith gunboats being controlled by his freighter to attack him, making it appear he was being attacked. As Thrawn, was looking for information on the Vagaari pirates, Thrawn opened comm with Fsir, when Fsir alerted Thrawn that he was being attacked and he needed urgent help, Thrawn replied that he could not help the Watith as he was in a more important mission—preventing a civil war from happening—and that he could not help the Captain.\nThen, one of the gunboats attacked the Springhawk before it was shot down by the Springhawk, after Thrawn disabled 4 of the gunboats, and destroyed the rest, or rather, made them useless, Thrawn contacted the Chiss. Then, he asked Fsir to report on his status, which the Watith did, and asked Thrawn what he could do to repay him. Thrawn then demanded Fsir's purpose, point of origin and species. Fsir then evaded the point of origin, and stated that he was a Watith, and that his leaders had asked him to establish a long-range triad transmitter, as the only one in the region was controlled by the Paataatus, which kept it for themselves. Thrawn then inquired the captain on what group Fsir's attackers where from. Fsir then stated that he assumed they were Vagaari, as they were close to the Vagaari pirate base. Then, Fsir informed the Chiss that he could guide the Chiss to the pirate base. Although Thrawn was initially hesitant, the Watith convinced the Chiss.\nThen, Thrawn informed the mercenary that he was going to study the battle debris, although Fsir was confused, he accepted it. And then, engaged in a conversation with Thrawn on the Watith's legends of the Chiss and their future attack on the Vagaari. When they arrived on the \"Vaagari pirate base,\" Fsir told Thrawn that he was a fool, and that there was a weapons platform ready to destroy them both. However, Thrawn, who was aware of Fsir's plot, disabled all of the Watith's forces, including his freighter with plasma spheres, ending their threat. Thrawn and the Chiss then interrogated the Watith, obtaining information of his true purpose and employer. However, the captain was sent to the ice planet of Csilla for further interrogation.\nLater, Thrawn looked for more Watith and their point of origin across the Chaos, eventually arriving at Zyzek. Where the leader of the Kilji Illumine, Generalirius Nakirre attempted to obtain \"Watith prisoners\" from Thrawn, being unsuccesful as was not able to provide the location of the home of the Watith to Thrawn.\nFsir was a male Watith, he was a foolish commander and actor.\nFsir appeared in the 2021 novel Thrawn Ascendancy: Greater Good, the second volume in the Star Wars: The Ascendancy Trilogy written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Watith",
  "/wiki/Gender",
  "/wiki/Watith_leaders",
  "/wiki/Captain",
  "/wiki/Saltbarrel",
  "/wiki/Grysk",
  "/wiki/Jixtus",
  "/wiki/Chiss",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Core_name",
  "/wiki/Hoxim_incident",
  "/wiki/Agbui_attempt_to_precipitate_a_Chiss_Ascendancy_civil_war",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Springhawk",
  "/wiki/Watith_gunboat",
  "/wiki/Vagaari_pirate_base",
  "/wiki/18_BBY",
  "/wiki/Mercenary",
  "/wiki/Alien",
  "/wiki/Death",
  "/wiki/Skirmish_against_the_Watith",
  "/wiki/Planet",
  "/wiki/Hoxim",
  "/wiki/Warship",
  "/wiki/Freighter",
  "/wiki/Vagaari_pirates",
  "/wiki/Civil_war",
  "/wiki/Communications_triad",
  "/wiki/Paataatus",
  "/wiki/Vagaari",
  "/wiki/Plasma_sphere",
  "/wiki/Water",
  "/wiki/Csilla",
  "/wiki/Chaos",
  "/wiki/Zyzek",
  "/wiki/Kilji_Illumine",
  "/wiki/Generalirius",
  "/wiki/Nakirre",
  "/wiki/Prisoner",
  "/wiki/Unidentified_system_(Watith)",
  "/wiki/Commander",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Clone_Wars",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Ahsoka_Tano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Standard_year",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Attack_on_the_Paataatus"
 ]
}