{
 "name": "Fud Sang",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "A short pudgy species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  }
 ],
 "content": "A male member of a diminutive species, Fud Sang was an inmate at a maximum-security detention center known as Desolation Alley, located on the fourth moon of the Outer Rim planet Oovo. While incarcerated around 32 BBY, during the final decades of the Galactic Republic, Sang was considered a mediocre pilot at best. Nevertheless, the prison warden, Fenn Booda, occasionally granted Sang the opportunity to participate in Podraces that Booda hosted in the prison, which provided the inmates a form of entertainment. Piloting a BRE Block6 Tri-Ram Podracer, Sang managed to garner intimate knowledge of one of the moon's courses and became quite successful there. Sang's success eventually led him to being allowed to race on the ice world Ando Prime, where his improving piloting skills also acquired him popularity.\nFud Sang was a male member of a non-Human species of small stature. Despite his meek appearance, Sang landed four consecutive life sentences and was sent to the maximum-security prison Desolation Alley on the fourth moon of the Outer Rim planet Oovo, known as Oovo IV, sometime before 32 BBY. There, he was placed under the watchful eye of the prison warden Fenn Booda. The warden was known to occasionally entertain the inmates with Podraces, and at some point Sang proved his worth as a pilot, prompting Booda to offer the diminutive fast-talker a chance to race the courses with the off-world pilots that came to compete on the barren moon. Well through his prison sentence, Sang accepted the offer and was presented an old Bokaan Race Engineering BRE Block6 Tri-Ram. The Block6 was not in pristine condition, and Sang often found himself maintaining it with scrap and outdated parts. Nevertheless, with the customizations it proved to be a formidable craft due to its high-end traction, above-average turning, and acceptable cooling, which compensated for the vehicle's slow acceleration and a low overall top speed. Ultimately, the vehicle's attributes often did not matter, as Sang was not considered much of a pilot.\nDesperate to counter the professional off-world pilots regardless of his lack of skill, Fud Sang did everything possible to push his machine to its limits. Booda even hinted at the possibility of granting Sang his freedom if the prisoner performed well. Although he was not considered a threat on the course by some, Sang managed to acquire thorough knowledge of a track known simply as Vengeance; he more or less memorized the layout of the course as it swung in and around Desolation Alley, and his victories there earned him the status of track favorite. In fact, it was a thorough knowledge of the Oovo IV courses in general that gave him an edge during races, sometimes making up for his mediocre piloting skills. He even scored a record race time of 03:51.921 minutes for the Vengeance course. Sang was occasionally allowed to race off of Oovo IV, and he gained some fame on the frozen world of Ando Prime, where he became a favored racer on one of the planet's drag courses. Sang even challenged other racers to compete against him. Fud Sang gained enough racing popularity that a small statue was made in his image. One such statue was collected by fellow Podracer pilot Anakin Skywalker.\nWhenever the Troig race announcer Fode Annodue spotted Sang on Oovo IV, Fode generally commented on Sang's prison sentence. By the year 24 BBY, Sang's black and purple flag could be found on a racecourse located on the planet of Mon Calamari. The course was located in the city of Orotoru G'am, and the flag was located near the Hall of Heroes.\nFud Sang, despite meek outer appearances, was saddled with four consecutive life sentences on Oovo IV. Energetic and known for his gratuitous conversing, Sang was desperate to defeat any off-worlders that arrived on his turf. He constantly upgraded his Podracer with whatever parts he could find, whether they were of quality or not. He sometimes taunted competitors before races.\nFud was short, with a round fat body. His arms were much longer than his legs; indeed, each arm was nearly the size of his entire body. Sang also had two white eyes on bulbous stalks, and a narrow snout. His skin was purple.\nWhen given his chance to race on Oovo IV, Warden Booda presented Fud Sang with an old Bokaan Race Engineering BRE Block6 Tri-Ram Podracer. The engine's primary color was black, with the front ends of the engines painted light blue. The exhaust tubes on the back of the engines were also blue. The cockpit had a similar color combination, with the rear end of the cockpit painted black and the front end painted the same blue as the engines. The vehicle was constantly in disrepair, and Sang often had to fix it with scrap and outdated parts. Still, despite low speed and weak acceleration, the vehicle had very good traction and overall handling, granting Sang a good amount of control over his racer.\nFud Sang was designed for use in the 1999 film Star Wars: Episode I The Phantom Menace. Fud Sang made it as far as conceptual art and a conceptual sculpt. Ultimately, only the sculpt appeared during scenes in Anakin Skywalker's bedroom.\nFud Sang received a far more substantial appearance as a playable character in the 1999 video game Star Wars Episode I: Racer, which was released on the same day as The Phantom Menace. Sang could be unlocked during the first circuit of races, his track introducing players to Oovo IV. Sang could only be unlocked if the player could place ahead of him. Fud Sang was voiced by Jim Ward in Racer, the same voice actor who portrayed Mars Guo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Podracer_(profession)/Legends",
  "/wiki/Remel_Fud",
  "/wiki/Unidentified_pudgy_species",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/File:Fud_Sang-taunt.ogg",
  "/wiki/Prisoner/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Desolation_Alley",
  "/wiki/Oovo_IV/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Oovo",
  "/wiki/32_BBY/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Warden/Legends",
  "/wiki/Fenn_Booda",
  "/wiki/Podracing/Legends",
  "/wiki/BRE_Block6_Tri-Ram",
  "/wiki/Podracer/Legends",
  "/wiki/Vengeance_(Oovo_IV)",
  "/wiki/Water/Legends",
  "/wiki/Ando_Prime/Legends",
  "/wiki/File:Fode-Fud_Sang.ogg",
  "/wiki/Eye/Legends",
  "/wiki/Bokaan_Race_Engineering",
  "/wiki/Ando_Prime_drag_course_2",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Troig/Legends",
  "/wiki/Fodesinbeed_Annodue/Legends",
  "/wiki/24_BBY/Legends",
  "/wiki/Dac",
  "/wiki/City/Legends",
  "/wiki/Orotoru_G%27am",
  "/wiki/Hall_of_Heroes_(Dac)",
  "/wiki/Limb/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Cockpit/Legends",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Episode_I:_Racer",
  "/wiki/May_19",
  "/wiki/Jim_Ward",
  "/wiki/Mars_Guo/Legends",
  "/wiki/Star_Wars:_Episode_I:_Racer:_The_Official_Nintendo_Player%27s_Guide",
  "/wiki/Star_Wars:_Episode_I_Racer:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide",
  "/wiki/Databank_(original)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Standard_year/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Jar_Jar_Binks/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_Racer_Revenge",
  "/wiki/Boonta_Eve_Classic/Legends",
  "/wiki/StarWars.com"
 ]
}