{
 "name": "Furan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Salmon-pink with black tattoos"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Furan's social club"
     ]
    }
   ]
  }
 ],
 "content": "Furan was a Mon Calamari male criminal of ill repute who operated just prior to the Second Galactic Civil War. However, the unsavory dealings of his social club were brought to an end by Jedi Knight Tahiri Veila, and the Mon Calamari was sentenced to a prison term in the Armand Isard Correctional Facility. In 44 ABY, following the civil war, Furan chanced upon an opportunity to avenge himself when Veila was sentenced to the same prison. Alongside several comrades, Furan confronted Veila but was soundly beaten by the former Jedi Knight.\nFuran was a Mon Calamari male active as a criminal in the years before the Second Galactic Civil War that started in 40 ABY. Members of his social club also engaged in criminality and joined the Mon Calamari in the theft of army hospital shuttles, the parts of which they stripped and sold illegally. Their lawlessness was brought to an end by the efforts of Jedi Knight Tahiri Veila, who discovered evidence that implicated Furan and an accomplice in the heists. The gangsters were charged with grand vehicle theft and were found guilty on the strength of the incriminating account given by Furan's partner, who died soon afterward. Sentenced to prison, Furan was committed to a term in the Armand Isard Correctional Facility on the planet Coruscant. He made the acquaintance of many other criminals while incarcerated, among them two fellow killers: Gaharrag, an imposing Wookiee; and a massive Hutt named Leurm.\nIn 44 ABY, an opportunity for vengeance arose for Furan when Tahiri Veila, who was no longer a Jedi, was herself sentenced to a term in the Armand Isard Correctional Facility for her own crimes during the civil war. The Mon Calamari enjoyed a time of recess when Veila was mistakenly brought to the same exercise yard occupied by the majority of the prison's male population—Furan included. He was the first of them to confront her, with accusations of evidence fabrication against his social club, only to be reminded of his late confederate's damning testimony. When it became apparent that she would not be intimidated, Furan summoned Gaharrag, Leurm, and several other prisoners to join him in the ex-Jedi's slaughter. Taunting ensued as the inmates prepared to attack her, but Veila preceded them with a perfectly-landed kick to the center of Furan's head, a deadly maneuver so sudden he was unable to cry out in pain before he collapsed. All of his allies were subsequently defeated by Veila, who was herself finally brought down with a high-intensity stun bolt. Both Gaharrag and Leurm suffered broken limbs, while Furan regained consciousness sometime later, the recipient of a violent concussion.\nFuran was a pink-skinned Mon Calamari male with prominently-displayed gang tattoos and kill silhouettes about his head and neck. He preferred to socialize with other unsavory beings and made no qualms about his inherent delinquency. However, Furan was not one to take responsibility for his actions and was instead quick to reassign blame to beings other than himself, even going as far as making accusations of fabricated evidence against his social club. The felonious inclinations of his crime mob earned the ire of, and a bad reputation with, Tahiri Veila, a Knight of the New Jedi Order. When the two reconnected in the exercise yard of the Armand Isard Correctional Facility, it had been several years since their last encounter, and Furan still harbored much of the animosity he had initially felt for Veila when her intervention resulted in his arrest and ultimate conviction. Still, his desire for vengeance betrayed him, as Veila was more than a match for him in unarmed combat, a fact which was brought into sharp relief as the ex-Jedi made short work of Furan and his yard mates.\nFuran's appears in Aaron Allston's 2011 novel Fate of the Jedi: Conviction, the seventh installment of the nine-part Fate of the Jedi series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Furan%27s_social_club",
  "/wiki/Gangster/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Tahiri_Veila",
  "/wiki/Prison/Legends",
  "/wiki/Armand_Isard_Correctional_Facility",
  "/wiki/44_ABY",
  "/wiki/Trial_of_Tahiri_Veila",
  "/wiki/Standard_year/Legends",
  "/wiki/40_ABY",
  "/wiki/Army/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Furan%27s_buddy",
  "/wiki/Starship/Legends",
  "/wiki/Death/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Gaharrag",
  "/wiki/Wookiee/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Leurm",
  "/wiki/Jedi/Legends",
  "/wiki/Armand_Isard/Legends",
  "/wiki/Time/Legends",
  "/wiki/Stun/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Unarmed_combat",
  "/wiki/Aaron_Allston",
  "/wiki/2011",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Legacy_of_the_Force:_Betrayal"
 ]
}