{
 "name": "Furgan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Carida"
     ]
    },
    {
     "name": "Died",
     "values": [
      "11 ABY",
      "Anoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Caridan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Crimson Empire"
     ]
    }
   ]
  }
 ],
 "content": "Furgan was an ambassador for his home planet of Carida, home to the Imperial Military Academy, despite his second-class status as a non-human. Like the Empire and many of his fellow Caridans, Ambassador Furgan also looked past his second-class status and was extremely loyal to Emperor Palpatine and his New Order.\nAfter the destruction of Byss and the death of the last of Palpatine's clones, Furgan felt it was time for him to strike a grievous blow upon the leadership of the New Republic and place control of what remained of the Empire under the rule of another Force-sensitive Emperor.\nTo fulfill the first objective, Furgan had a batch of nano-destroyers produced. They were then attuned to the New Republic Chief of State Mon Mothma's genetic structure. When he came to Coruscant under the guise of a pilgrimage to Imperial City, Furgan splashed a drink into Mothma's face. It contained the nano-destroyers, which were quickly absorbed into her skin. However, Mothma had no clue as to the degree of danger she was actually in until weeks later.\nWell before his visit to Coruscant, Furgan had forced a Mon Calamari prisoner named Terpfen to submit to brain surgery. The surgery resulted in the removal of certain sections of Terpfen's brain and the replacement of those sections with synthetic computer imitations that allowed Furgan to control Terpfen's actions. The only evidence that remained of the surgery was the scars on Terpfen's head, it was impossible to detect any of the implants. Terpfen was eventually released and found his way into a position as Admiral Gial Ackbar's chief engineer.\nSome weeks after the incident where Furgan poisoned Mon Mothma, Admiral Ackbar volunteered to fly Minister of State Leia Organa Solo to Vortex in his personal B-wing, so that she could attend the Vors' celebration of the beginning of the storm season at the Cathedral of Winds. Terpfen sabotaged Ackbar's B-wing so that it would crash into the Cathedral once it entered the atmosphere of Vortex. While the sabotage did not result in the deaths of either Ackbar or Organa Solo, the destruction of the Cathedral of Winds and the death and maiming of many Vors caused Ackbar to resign his commission in embarrassment.\nWhile the New Republic started to squabble amongst itself in the absence of Ackbar and Mothma's leadership, Furgan began the second phase of his plan. About the only Force-sensitive people he was aware of were Luke Skywalker, his students, Leia Organa Solo, and her children. He knew that it would be difficult to influence Skywalker, his students, or Organa Solo, because all of them were adults. So he decided to focus on kidnapping Organa Solo's children, with the bulk of his efforts focused on Anakin Solo, who was still an infant at the time.\nUnlike his siblings, who were living on Coruscant, Anakin was still living on the planet Anoth, under the watchful eye of Organa Solo's childhood friend and aide, Winter. While he didn't know the location of Anoth, Furgan knew what kind of terrain his forces would encounter once the location of the hidden planet was found and a mission was launched to kidnap Anakin Solo. He had the MT-AT developed and manufactured on Carida specifically for Anoth's mountainous terrain.\nWhen Ackbar left from Coruscant for Mon Calamari, he made a side trip to the hidden planet. Unbeknownst to him, Terpfen had hidden a tracking device aboard Ackbar's ship and upon receiving Anoth's coordinates, relayed them to Ambassador Furgan. Furgan immediately loaded Carida's only capital ship, the Dreadnaught Vendetta, with MT-ATs and stormtroopers who had graduated from the Imperial Military Academy. His departure aboard the Dreadnaught was made all the more urgent when Kyp Durron, in command of the Sun Crusher superweapon, and under the influence of the spirit of the long-dead Sith Lord Exar Kun, fired a resonance torpedo into Carida's sun. The Vendetta set course for Anoth and entered hyperspace well before Carida's sun exploded.\nUpon the Vendetta's arrival in the orbit of Anoth, Furgan decided that he would personally oversee the kidnapping of Anakin Solo. He descended from orbit inside one of the MT-ATs, alongside a reluctant stormtrooper sergeant who silently suffered Furgan's screams of panic.\nOnce on the ground, the eight MT-ATs emerged from their pods, searching for weak spots in the walls of the stronghold with their blaster cannons. They eventually found a pair of heavy blast doors and began making their way towards them. When they began to test the strength of the blast doors, one of the fortress's defense systems—the Foreign Intruder Defense Organism —destroyed four of the MT-ATs before succumbing to the fire of the rest of the spider walkers.\nThe threat destroyed, the MT-ATs began a new assault upon the blast doors. A split eventually began to form and one of the MT-ATs used its front claws to rip open what remained of the blast doors. They walked into the indoor chamber. Several minutes and several stormtrooper deaths later, Furgan finally found Anakin Solo under the supervision of a TDL nanny droid that protested Furgan's decision to kidnap Anakin.\nFurgan scoffed at the droid and ordered the stormtrooper that accompanied him to fetch the baby for him. The stormtrooper was then summarily dispatched by the nanny droid's four hidden blasters. Despite the fact that he was only an ambassador, Furgan's reflexes were good enough that he blasted the nanny droid before it could kill him. He then encountered a newly reinstated Ackbar, Organa Solo, and Terpfen. He held Anakin up in front of him, threatening to snap the baby's neck.\nHe eventually collided with a power droid, and Terpfen, who was now free from his mental slavery at the hands of Furgan, grabbed Anakin and returned him to Organa Solo. Furgan took this opportunity to make his escape and ran for the entrance where the MT-ATs were still sitting. Terpfen followed close behind, revenge on his mind.\nFurgan scrambled into one of the waiting MT-ATs and Terpfen took control of another as well. A running gunfight between the two MT-ATs ensued, and eventually turned into a physical fight between the two walkers, eventually ending with Furgan's walker taking a long dive over the cliff, where he was killed.\nAmbassador Furgan was created by Kevin J. Anderson.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Carida/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Anoth/Legends",
  "/wiki/Caridan_(species)",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Crimson_Empire",
  "/wiki/Ambassador/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Academy_of_Carida",
  "/wiki/Non-human",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Byss/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Nano-destroyer",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Galactic_City",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Terpfen",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Minister_of_State",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Vortex/Legends",
  "/wiki/A/SF-01_B-wing_starfighter/Legends",
  "/wiki/Vor",
  "/wiki/Cathedral_of_Winds/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Anakin_Solo",
  "/wiki/Mountain_Terrain_Armored_Transport",
  "/wiki/Winter_Celchu",
  "/wiki/Dac",
  "/wiki/Homing_beacon/Legends",
  "/wiki/Dreadnaught-class_heavy_cruiser",
  "/wiki/Vendetta_(Dreadnaught-class)",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Kyp_Durron",
  "/wiki/Sun_Crusher",
  "/wiki/Superweapon/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Resonance_torpedo",
  "/wiki/Hyperspace/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Foreign_Intruder_Defense_Organism",
  "/wiki/Blaster_cannon/Legends",
  "/wiki/TDL_nanny_droid",
  "/wiki/Droid/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Power_droid/Legends",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Jedi_Search",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Champions_of_the_Force",
  "/wiki/Tyrant%27s_Test",
  "/wiki/The_New_Rebellion",
  "/wiki/The_New_Jedi_Order:_Destiny%27s_Way",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/Cracken%27s_Threat_Dossier",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_3",
  "/wiki/The_Official_Star_Wars_Fact_File_74",
  "/wiki/The_Official_Star_Wars_Fact_File_94",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Imperial_Icons",
  "/wiki/Star_Wars_Insider_148"
 ]
}