{
 "name": "Fuzzel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "9 months ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Commander Fuzzel was a member of the Imperial Armed Forces and stationed on Tatooine during the Galactic Civil War. Fuzzel managed to arrange a deal with Jabba Desilijic Tiure, in which Jabba turned over certain criminals to Fuzzel for their rewards. More often than not, Jabba provided dead criminals, but he still managed to find those beings Fuzzel could not.\nHe was one of the many officers hunting for the criminal Karkas, and Fuzzel intercepted Mammon Hoole upon his arrival, after learning that Hoole's ship had left Koda Space Station at the same time Karkas had fled. He let Hoole and his young charges, Tash and Zak Arranda, go free after thoroughly searching their ship. Fuzzel later received Karkas' body, although Jabba had removed his brain and stored inside the brain spider droid of a B'omarr monk.\nShortly thereafter, Fuzzel was found murdered in a Mos Eisley alleyway, with the letter 'K' carved into ihs forehead. Zak Arranda discovered the body, and believed that his sister, Tash, was responsible for the crime. However, it had just been Tash's body, as Jabba had arranged to have Karkas's brain placed into the girl's body.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Karkas",
  "/wiki/Mammon_Hoole",
  "/wiki/Koda_Space_Station",
  "/wiki/Tash_Arranda/Legends",
  "/wiki/Zak_Arranda/Legends",
  "/wiki/Brain_spider",
  "/wiki/B%27omarr_Order/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Galaxy_of_Fear:_The_Brain_Spiders",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}