{
 "name": "Fyric Fel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "2 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Fyric Fel was the son of Todr Fel and Ajai Fel and the nephew of Baron Soontir Fel. Born in late 2 ABY, he was kidnapped by Ilir Post nearly five years after the Battle of Yavin when Soontir Fel defected to the New Republic. Post and his Imperial Intelligence handlers hoped to use Fel to pressure the other Fels into giving up the location of Soontir's wife, which would allow them to pressure Soontir Fel himself. Fel's parents refused to comply, and Todr Fel tracked down Post and killed him himself. Fel and his parents then took refuge with the New Republic.\nFyric Fel was born to Todr and Ajai Fel around late 2 ABY. He was raised with the rest of the Fel family on the estate of his uncle, Baron Soontir Fel, an Imperial fighter ace. The Fels believed strongly in family loyalty and duty, and Fel was raised among an extended clan that included Wynssa Starflare, Soontir Fel's wife, and her sons Davin and Chak.\nStarflare was secretly the sister of Wedge Antilles, a pilot in Rogue Squadron. She knew that Director of Imperial Intelligence Ysanne Isard was willing to use this information against her, and when Soontir was captured by the New Republic nine months after the Battle of Endor, Starflare fled into hiding, taking Fel's cousins with her.\nOne month later, Fel was kidnapped by Ilir Post, an old rival of Soontir's, with the backing of Imperial Intelligence. The kidnappers left a note demanding a meeting, looking for the Fels to turn over Starflare's location. While Corellian Security Force officers Corran Horn and Iella Wessiri were assigned to the investigation, Fel's parents kept the note to themselves, looking to solve the situation on their own.\nAjai convinced three Rogue Squadron pilots whom Antilles had sent to take Starflare to safety to meet with the kidnappers and placed a tracking device on them. Based on that signal, Todr proceeded to Post's hideout. The pilots, working with Horn and Wessiri, stormed the compound, but Post emerged on a balcony, holding Fel and a blaster. He demanded that the attackers leave, but Todr, realizing that Fyric would end up dead if Post were not stopped, took the risk of his dying in a fall and shot Post from within the woods. Fel tumbled from the balcony, but Isplourrdacartha Estillo made a diving catch that saved his life.\nThe Rogues took Fel away from the hideout, where they found Todr waiting. They returned Fel to him as he explained why he had made the shot, and they offered the Fels save haven in the New Republic, to which Soontir had defected. After some thinking, Todr and Ajai accepted the offer, taking Fel to safety with the Rogues. They were nearly killed again when mercenaries working for Imperial Intelligence attacked their starship on their way off Corellia, but timely intervention by Horn defeated the attacking fighters.\nFyric Fel was created by Michael A. Stackpole, who wrote Star Wars: X-Wing Rogue Squadron: Family Ties, the story arc in which Fel appears. The comic gives two conflicting images of Fel. There is a hologram of Fel as a baby with black hair, while Fel himself appears in the story as a blond.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Corellia/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Todr_Fel",
  "/wiki/Ajai_Fel",
  "/wiki/Baron_of_the_Empire/Legends",
  "/wiki/Soontir_Fel/Legends",
  "/wiki/Ilir_Post",
  "/wiki/5_ABY/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Syal_Antilles_Fel",
  "/wiki/Fel_dynasty",
  "/wiki/Fel_estate",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Ace/Legends",
  "/wiki/Davin_Fel",
  "/wiki/Chak_Fel",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Ysanne_Isard",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Mission_to_Corellia_(Rogue_Squadron)",
  "/wiki/Corellian_Security_Force",
  "/wiki/Corran_Horn",
  "/wiki/Iella_Wessiri_Antilles",
  "/wiki/Blaster/Legends",
  "/wiki/Death/Legends",
  "/wiki/Isplourrdacartha_Estillo",
  "/wiki/Mercenary/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Michael_A._Stackpole",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Family_Ties",
  "/wiki/Hologram/Legends",
  "/wiki/X-Wing_Rogue_Squadron_26",
  "/wiki/X-Wing_Rogue_Squadron_27",
  "/wiki/Star_Wars_Handbook_1:_X-Wing_Rogue_Squadron",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Official_Star_Wars_Fact_File_122"
 ]
}