{
 "name": "Fyzen Gor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Utapau"
     ]
    },
    {
     "name": "Died",
     "values": [
      "7 ABY",
      "Mesulan Remnants Belt"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pau'an"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Prasteen Braak",
      "Brotherhood of Wire and Bone"
     ]
    }
   ]
  }
 ],
 "content": "Fyzen Gor was a Pau'an male gangster who was the creator of the Phylanx Redux Transmitter. He was a medical student at Prasteen Braak, the most esteemed med school in Pau City on the planet Utapau. He and fellow medical student Greesto Ftrak were planning to open their own surgical center in the Preevow Sector of Pau City.\nTwo weeks from opening, a group of Pau'an gunners entered and took the two hostage with a class 1 medical droid. Gor, Ftrak, and the droid were taken far into the plains on a speeder. When Ftrak asked if their captors were members of the Wandering Star, a powerful group of Pau'an gangsters, Gor saw his friend shot in the chest in response. As they approached a roadblock, Gor and the others were attacked by a group of Utai raiders, who killed the Pau'ans. Gor grabbed a blaster and used it on seven of the Utai raiders, taking the lone surviving raider hostage. The droid hauled the prisoner to a nearby cave with Gor dragging his mortally wounded friend Ftrak behind him. Gor eventually experimented on his friend, who had since died in a coma, combining his flesh with the droid.\nEventually, he became obsessed with droids and the biomechanical union of flesh and circuits. On two separate occasions, the crew of the Millennium Falcon attempted to claim the transmitter, firstly when Lando Calrissian and the droid L3-37 claimed the device, and then when Han Solo along with Sana Starros cheated Gor out of his device. After the Galactic Empire had been destroyed, Gor hunted Calrissian, placing Cloud City in danger of being annihilated. In response, Calrissian turned to Solo and they put a team together including the Wookiee Chewbacca, the young hotshot pilot Taka Jamoreesa, the Ugnaught technician Florx Biggles, and the Ewok slicer Peekpa to stop Gor.\nGor fled the Phylanx Redux Transmitter after it was destroyed by Calrissian. After a brief battle during the fleeing of the Phylanx, he was killed by Solo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Utapau",
  "/wiki/7_ABY",
  "/wiki/Mesulan_Remnants_Belt",
  "/wiki/Pau%27an",
  "/wiki/Gender",
  "/wiki/Prasteen_Braak",
  "/wiki/Brotherhood_of_Wire_and_Bone",
  "/wiki/Gangster",
  "/wiki/Phylanx_Redux_Transmitter",
  "/wiki/Pau_City",
  "/wiki/Planet",
  "/wiki/Greesto_Ftrak",
  "/wiki/Preevow_Sector",
  "/wiki/Medical_droid",
  "/wiki/Droid",
  "/wiki/Wandering_Star",
  "/wiki/Utai",
  "/wiki/Blaster",
  "/wiki/Millennium_Falcon",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/L3-37",
  "/wiki/Han_Solo",
  "/wiki/Sana_Starros",
  "/wiki/Galactic_Empire",
  "/wiki/Cloud_City",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Pilot",
  "/wiki/Taka_Jamoreesa",
  "/wiki/Ugnaught",
  "/wiki/Florx_Biggles",
  "/wiki/Ewok",
  "/wiki/Slicer",
  "/wiki/Peekpa",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Fyzen_Gor",
  "/wiki/Last_Shot",
  "/wiki/Last_Shot_(audiobook)",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/Death",
  "/wiki/StarWars.com"
 ]
}