{
 "name": "G%27hinji_Dros",
 "display_name": "G'hinji Dros",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shalyvane"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Em'liy"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Argwin"
     ]
    }
   ]
  }
 ],
 "content": "G'hinji Dros was a male Em'liy who served as Eldest of the Argwin caste on Shalyvane during the era of the Galactic Civil War. A resident of the city of Chinshassa, Dros survived the Imperial destruction of his home in 0 ABY, surviving with many others of his people in a nomadic existence among the ruins. As an esteemed elder, Dros was the one to meet with Rebel agents Luke Skywalker and Chewbacca when they visited Chinshassa in 3 ABY, investigating the background of Imperial double agent Shira Brie.\nAn Em'liy native of the city of Chinshassa on the planet Shalyvane, G'hinji Dros found himself embroiled in intrigues between the Galactic Empire and Rebel Alliance in 3 ABY. Already quite old by the time of the Galactic Civil War, Dros held the title of Eldest of the Argwin caste. Dros lived in a modern, prosperous city until Chinshassa was suddenly destroyed by Imperial forces in 0 ABY—the act was done merely to provide cover for an Imperial agent named Shira Brie, who posed as a Human survivor of Em'liy aggression as she infiltrated the Rebels as a deep-cover agent with the task of either killing or ruining Rebel hero Luke Skywalker. From that point on, Dros and his clan lived as nomads, subsisting in the ruins of their former home. Brie ultimately achieved her goal during Operation Earplug, when Skywalker mistakenly shot her down in what appeared to be a friendly-fire incident, resulting in Skywalker becoming a pariah. At a loss to explain why the Force had guided him to attack Brie, Skywalker traveled to Chinshassa to investigate Brie's background.\nIt was there Dros met both Skywalker and his Wookiee companion—as the Em'liy spoke passable Basic, Dros was assigned to test the visitors in a traditional Em'liy \"trial by ordeal\" before deciding whether or not they would be allowed to live—upon their arrival, a horde of Em'liy warriors charged and herded Skywalker and Chewbacca into a ruined building Dros was hiding in, where he established contact. Skywalker impressed Dros by using the Force to find a novel solution to the trial by ordeal, convincing the Em'liy to introduce the Rebels to the rest of his people and grant Skywalker's request to travel to the Circle of Kavaan, an Em'liy holy site that Skywalker had previously witnessed Brie perform a strange ritual at. At the Circle, Skywalker uncovered a hidden hologram from the Sith Lord Darth Vader revealing Brie's status as an Imperial agent, prompting the Rebels to go off on a wider investigation.\nA good-natured Em'liy with a strong sense of humor, G'hinji Dros was already elderly by the era of the Galactic Civil War, but spoke good enough Basic that he became the ideal choice to be the Em'liy's emissary to their Rebel visitors. Dros was a pious believer in the Em'liy gods, but was impressed by Luke Skywalker's use of the Force—to Dros, it simply meant that Skywalker had strong gods of his own.\nG'hinji Dros first appeared in Star Wars  62, written by David Michelinie and released in 1982. Originally just named \"G'hinji,\" the character's last name was later given in a Star Wars Gamer article written by Rich Handley and Joseph Bongiorno in 2000. During his comic appearances, Dros was illustrated by Walter Simonson and Tom Palmer.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Shalyvane",
  "/wiki/Em%27liy",
  "/wiki/Gender/Legends",
  "/wiki/Argwin",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Chinshassa",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Lumiya",
  "/wiki/Planet/Legends",
  "/wiki/Human/Legends",
  "/wiki/Death/Legends",
  "/wiki/Operation_Earplug",
  "/wiki/The_Force/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Circle_of_Kavaan",
  "/wiki/Hologram/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Star_Wars_(1977)_62",
  "/wiki/David_Michelinie",
  "/wiki/1982",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Marvel_Series",
  "/wiki/Rich_Handley",
  "/wiki/Joseph_Bongiorno",
  "/wiki/2000",
  "/wiki/Walter_Simonson",
  "/wiki/Tom_Palmer",
  "/wiki/Star_Wars_(1977)_63",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}