{
 "name": "Gaan",
 "display_name": "Gaan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ragmar V"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic left eye"
     ]
    }
   ]
  }
 ],
 "content": "Gaan was a Human male who led a small settlement of pariahs on the Outer Rim planet Ragmar V during the final year of the Clone Wars. During the war, he and his group fought the forces of the Galactic Republic.\nIn 19 BBY, the Jedi Padawan Joc Sah and his squad of clone troopers arrived on the planet in order to capture Gaan's village, where they confronted Gaan and the other outcasts. However, Sah's clone sergeant then received Order 66 from Supreme Chancellor Palpatine, labeling the Jedi Knights traitors to the Republic, and attacked Sah. Gaan and Sah combined their forces and eliminated the Padawan's former allies. As Sah attempted to contact his Jedi Master, Gaan informed the Jedi that he had been betrayed and offered him a place in his group. Sah accepted, and the two led the outcasts against the detachment of clones that were dispatched to ensure Sah's demise.\nGaan, a Human male, was born during the final decades of the Galactic Republic. During the Clone Wars, he became the leader of a group of outcasts on the Outer Rim world of Ragmar V. In 19 BBY, the Galactic Republic sought to establish an outpost on Ragmar V, which was considered an essential staging planet for their planned assault of a Separatist base. When a Republic Low Altitude Assault Transport/infantry gunship landed on a cliff near Gaan's settlement, the leader instructed two of his men to use a rocket launcher and destroy the ship. After the gunship was destroyed, Gaan told his men to prepare for the coming battle with approaching Republic forces and ordered his group to leave the Jedi for him to eliminate.\nGaan met the Jedi Padawan Joc Sah and his squad of clone troopers in the settlement, informing the Jedi that the Republic was not welcome on the planet. As Gaan prepared to do battle with Sah's forces, one of the clones, Sergeant Remy, received a command instructing him to execute Order 66, which labeled the Jedi traitors to the Republic who needed to be killed immediately. The clone sergeant and the troopers opened fire on Sah, much to Gaan's surprise. The leader exclaimed that the Jedi was his to kill and shot one of the clones, causing the rest to return fire at him. Gaan took cover in the same building that Sah was in as his group attacked the clones. After Sah attempted to contact his Jedi Master, Sev, Gaan offered him the option of either fighting alongside him and his people, or staying in the building and getting killed. Sah agreed to temporarily ally with Gaan, and the two eliminated Sah's former clone allies.\nWhen Sah tried one last time to contact his Jedi Master, Gaan noted that the Padawan had been betrayed and was now in Gaan and his group's position of being a pariah, with a common enemy. The Padawan accepted a place in Gaan's group and warned him that the Republic would send an overwhelming number of troops to fight them. Shortly afterward, Gaan and Sah led their fellow pariahs against the troopers from Sev's Venator-class Star Destroyer, who were sent to make sure that Sah was eliminated. Both men survived and orchestrated a number of hit-and-run attacks against the clones.\nGaan was not sympathetic to the Republic and its forces, and sought to fight their troops in retaliation for bringing the war to his and his group's homeworld. Gaan was also eager to fight Joc Sah, instructing his men during the battle to leave the Jedi to him. He even went so far as to shoot one of the clone troopers when they attacked the Jedi in accordance with Order 66. After the clones attacked Sah, Gaan was willing to allow the Jedi to temporarily ally with him, and when they defeated the clones together, Gaan recognized that Sah had been betrayed, offering his friendship to the Jedi.\nGaan had light skin, brown hair and a beard. He had a green right eye, but his left eye was covered by a red cybernetic device.\nGaan wore a green jacket and a brown holster. He had a yellow earring in his right ear. Gaan owned a comlink and a blaster pistol.\nGaan first appeared in the short story The Order of Outcasts, which was one of four stories compiled in the fifth volume of the Star Wars: Clone Wars Adventures trade paperbacks published on April 26, 2006. The character was created by Matt Jacobs and drawn by Matthew and Shawn Fillbach. However, the character was not identified by name until he received an entry in The Complete Star Wars Encyclopedia. Joc Sah's entry in The Complete Star Wars Encyclopedia states that Gaan, the Padawan, and the other criminals fled into the desert after fleeing Remy and his troops. This contradicts the information given in The Order of Outcasts, which depicts the characters staying in the village after defeating Remy's clones, and then preparing for the clone detachment sent to eliminate Sah.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ragmar_V",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Joc_Sah",
  "/wiki/Squad/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Remy_(clone_trooper)",
  "/wiki/Order_66/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Battle_of_Ragmar_V",
  "/wiki/Death/Legends",
  "/wiki/Sev_(Jedi)",
  "/wiki/Cloning/Legends",
  "/wiki/Time/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Gunship/Legends",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Clone_trooper_sergeant",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Sergeant/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Sev%27s_Venator-class_Star_Destroyer",
  "/wiki/Homeworld/Legends",
  "/wiki/Holster/Legends",
  "/wiki/Ear/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/The_Order_of_Outcasts",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_5",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/April_26",
  "/wiki/2006",
  "/wiki/Matt_Jacobs",
  "/wiki/Matthew_Fillbach",
  "/wiki/Shawn_Fillbach",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Category:Images_of_Gaan",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Dark_Horse_Comics"
 ]
}