{
 "name": "Gaartatha",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Gaartatha was a male Wookiee who worked as a scout during the Galactic Civil War. His partner was captured by Imperial slavers, a fate that the Wookiee barely escaped himself. Gaartatha dealt with this loss by finding solace in alcohol, all the while hoping to find companions who could assist him in rescuing his partner. For a time, he joined up with fledgling Rebel Stannik Nhaa.\nGaartatha was a hulking, shaggy, male Wookiee. He worked as a scout, freelance pilot, and shipper during the Galactic Civil War, alongside a close friend. The two companions had an altercation with an Imperial press gang that was hunting for slaves for a work colony. Gaartatha's partner was captured in the encounter, while Gaartatha only barely escaped himself. Affected by grief, Gaartatha turned to alcohol, while also looking for a lead and help to rescue his companion. During his time of mourning, he visited a cantina and consumed several Dentarian Ripples until he began to smell of the drink's odour. Also present in the cantina on that occasion was D'Voras Brin, a smuggler extraordinare. While the Wookiee was waiting near the entrance of the cantina, Stannik Nhaa, a young member of the Alliance to Restore the Republic, entered, searching for Brin and hoping to find transportation offworld. Gaartatha allied with Nhaa and traveled with the Rebel for some time.\nGaartatha worked as a scout, gaining mechanical proficiency alongside knowledge of alien species, planetary systems and astrogation. He was a seasoned brawler, but was also capable with both a blaster and bowcaster, the latter a traditional Wookiee weapon. He wore an armless vest that had numerous pockets.\nGaartatha was deeply affected by the capture of his companion by Imperial slavers. While he hoped for a rescue, the Wookiee knew that he was incapable of saving his partner on his own. In his grief, Gaartatha consumed copious amounts of alcohol. Translated into Galactic Basic Standard, the prefix \"Gaar\" meant meant \"brave/bold/fearless\" and the suffix \"tatha\" meant \"bite/biter/claw.\"\nSteven H. Lorenz created Gaartatha for the Star Wars Gamemaster Handbook, a guidebook that was published in 1993 for the second edition of the West End Games Star Wars roleplaying game. The Wookiee appeared in the chapter titled \"Gamemaster Characters,\" which illustrated how to create characters to flesh out adventures. Lorenz described the Wookiee as being intended to function as an ally of Nhaa for an extended period of time. The chapter was accompanied by an image of Gaartatha and Brin in the cantina illustrated by Mike Jackson. Gaartatha also received an entry in The Complete Star Wars Encyclopedia, published in 2008.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Gaartatha%27s_companion",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/Time/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Stannik_Nhaa",
  "/wiki/Pilot/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Dentarian_Ripple",
  "/wiki/D%27Voras_Brin",
  "/wiki/Smuggler/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Blaster/Legends",
  "/wiki/Bowcaster/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Steven_H._Lorenz",
  "/wiki/Star_Wars_Gamemaster_Handbook",
  "/wiki/1993",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game,_Second_Edition",
  "/wiki/Mike_Jackson",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Callsigns:_Names_of_Kashyyyk",
  "/wiki/Star_Wars_Gamer_10"
 ]
}