{
 "name": "Gable_Karius",
 "display_name": "Gable Karius",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "During the battle on Mustafar",
      "Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic right arm",
      "left half of the face",
      "part of chin and jawline"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Imperial Navy",
      "Fortress Vader Imperial garrison",
      "Imperial Officer Corps",
      "Imperial Navy",
      "Fortress Vader Imperial garrison"
     ]
    }
   ]
  }
 ],
 "content": "Gable Karius was a human male who served the Galactic Empire as an officer of the Imperial Navy, holding the rank of admiral. A cyborg, Karius had replaced both his right arm and the left half of his face with cybernetic replacements.\nGable Karius was an officer of the Galactic Empire who at some point in his life received cybernetics on half of his face and his right arm. He was also eventually made an admiral of the Imperial Navy. During the Imperial Era, Admiral Karius commanded an Interdictor-class Star Destroyer and was assigned to Mustafar. During his time there, he captured the starship Windfall, and once it was brought to Fortress Vader, Karius and two stormtroopers breached and captured the crew. Eventually, after the smuggler captain of the Windfall awoke in a holding cell, Karius briefly informed them of Darth Vader and an upcoming task. After Vader entered, he gave the smuggler a device to unlock. After the captain was successful, Vader was impressed and was satisfied that the smuggler was the individual he was searching for. Admiral Karius and Vader then left the room, with Vader stating that he would send for the captain.\nAfter ZO-E3, Vylip F'alma, and the smuggler escaped their cells, then ZO-E3 managed to imitate Karius' voice to fool the security system and escape the prison room. After becoming alert of the security breach, Karius informed all personnel and locked down the fortress. When it was discovered that ZO-E3 and the smuggler were in the castle's excavation level, Karius dispatched all units to their location to secure the area. ZO-E3, Vylip, and the smuggler escaped to Lady Corvax's sanctum, however.\nEventually, Darth Vader retrieved what he was looking for, the Bright Star. The smuggler, however, unlocked secrets of Mustafar and the sanctum, and along with a Priestess, had activated Lady Corvax's The Marching Horde droid army to attack Fortress Vader and regain the Bright Star. Karius alerted the Fortress of the unidentified enemies, and reported that all forces converge on the hangar. After the smuggler and ZO-E3 managed to open the hangar doors from the control center to let their army inside and engage Imperial stormtroopers, Karius ambushed them and stated that he told Vader they shouldn't have been trusted, but was electrocuted by ZO-E3 and was pushed over a guardrail. During the battle, the smuggler and ZO-E3 attacked stormtroopers but were soon attacked again by Karius, this time while he piloted a TIE fighter. After a brief attack, Karius's starfighter was critically damaged and crashed and exploded in the hangar, killing him.\nGable Karius is a character created for Vader Immortal: A Star Wars VR Series, a three-part virtual reality series created by ILMxLAB. He was voiced by Star Wars veteran voice actor Steve Blum, and stunt actor Darren Bailey performed the motion capture. The character was designed by Lucasfilm Ltd. senior content and asset specialist Phil Szostak, whose concept art for Karius was inspired on by the early concepts of Arnold Ernst Toht, the Gestapo agent from the 1981 film Raiders of the Lost Ark, who was initially envisioned by Ron Cobb as a cyborg.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Battle_on_Mustafar",
  "/wiki/Mustafar",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Cybernetics",
  "/wiki/Limb",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Imperial_Navy",
  "/wiki/Fortress_Vader_Imperial_garrison",
  "/wiki/Imperial_officer",
  "/wiki/Military_rank",
  "/wiki/Admiral",
  "/wiki/Cyborg",
  "/wiki/Officer",
  "/wiki/Imperial_Era",
  "/wiki/Interdictor-class",
  "/wiki/Star_Destroyer",
  "/wiki/Starship",
  "/wiki/Windfall",
  "/wiki/Fortress_Vader",
  "/wiki/Stormtrooper",
  "/wiki/Smuggler",
  "/wiki/Captain",
  "/wiki/Anakin_Skywalker",
  "/wiki/ZO-E3",
  "/wiki/Vylip_F%27alma",
  "/wiki/Corvax_Fortress",
  "/wiki/Darth",
  "/wiki/Bright_Star",
  "/wiki/Priestess_(Mustafarian)",
  "/wiki/Lord",
  "/wiki/Corvax",
  "/wiki/The_Marching_Horde",
  "/wiki/Droid",
  "/wiki/Army",
  "/wiki/Hangar",
  "/wiki/Pilot",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Starfighter",
  "/wiki/Death",
  "/wiki/Vader_Immortal:_A_Star_Wars_VR_Series",
  "/wiki/ILMxLAB",
  "/wiki/Star_Wars",
  "/wiki/Steve_Blum",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Phil_Szostak",
  "/wiki/1981",
  "/wiki/Ron_Cobb",
  "/wiki/Vader_Immortal:_A_Star_Wars_VR_Series_%E2%80%93_Episode_I",
  "/wiki/Vader_Immortal:_A_Star_Wars_VR_Series_%E2%80%93_Episode_III",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Databank_(website)"
 ]
}