{
 "name": "Gaden-Ko",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Voss"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Voss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Azure"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Voss Mystics",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Gaden-Ko was a male Voss Mystic in training at the time of the Cold War.\nGaden-Ko was the son of a sculptor and a former Voss commando who was maimed by the Gormak when Gaden-Ko was small. As was Voss custom, he was raised by his grandfather, Dajan-Ko, who soon noticed the young Gaden-Ko's uncanny intuition. This insight allowed him to aid Voss commandos by predicting where Gormak patrols would be. Thus marked as a potential Mystic visionary, he had spent years at the Tower of Prophecy, studying and preparing to go on his pilgrimage.\nA Jedi Consular known as the Barsen'thor, in search of an alliance with the Voss, decided to help Gaden-Ko in his training and found him along the Holy Path of Mir, just starting his pilgrimage, but having lost all his bodyguards, and offered to protect him on his pilgrimage. Grateful for the help of the Barsen'thor, Gaden-Ko succeeded and became a Mystic and his first vision showed him that his destiny was to help his new friend and the Republic in the Galactic War with the Sith Empire. The Three, the government of Voss, lamented that though they gained a Mystic, they were now losing him to the off-worlders. Gaden-Ko assured the Three that he was not lost to them. He explained that by working with the Barsen'thor, he had seen that the Republic showed wisdom and kindness, and advocated allying Voss with them. Gaden-Ko later gained a small entourage of Voss Commandos, healers, and interpreters as he joined the Barsen'thor's crew. After the defeat of the First Son, Gaden-Ko suggested to the Barsen'thor, Master Jaric Kaedan, and Satele Shan that they could send Jedi to Voss so they could gain wisdom from one another.\nGaden-Ko's generation was the first to grow up in a Voss-Ka where alien outsiders were a common sight. He had always had an interest in these foreigners, even developing a friendship with the Republic ambassador. Gaden-Ko was seen to be rather impulsive and impatient compared to other Voss.\nIn the flashpoint \"The Nathema Conspiracy\", if the Outlander is a Jedi Consular aligned with the dark side of the Force, Gaden-Ko will seek to stop the player and join the Order of Zildrog led by Vinn Atrius, only to be sacrificed as fuel to awaken Zildrog by GEMINI 16 on Nathema. If the Jedi Consular remained on the light side, the player will encounter Sophia Farash instead, while the other classes face antagonists from their own class stories.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Voss",
  "/wiki/Voss_(species)",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Voss_Mystics",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Voss_commandos",
  "/wiki/Gormak/Legends",
  "/wiki/Dajan-Ko",
  "/wiki/Tower_of_Prophecy",
  "/wiki/Jedi_Consular",
  "/wiki/The_Barsen%27thor",
  "/wiki/Holy_Path_of_Mir",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Three",
  "/wiki/Syo_Bakarn",
  "/wiki/Jaric_Kaedan",
  "/wiki/Satele_Shan",
  "/wiki/Voss-Ka",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Alliance_Commander",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Order_of_Zildrog",
  "/wiki/Vinn_Atrius",
  "/wiki/Zildrog",
  "/wiki/GEMINI_16",
  "/wiki/Nathema",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Sophia_Farash",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Javelin_(Harrower-class)"
 ]
}