{
 "name": "Gadon Thek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3956 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown",
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic eyes"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hidden Beks",
      "Taris Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Gadon Thek was leader of the Hidden Beks, a swoop gang operating in the Lower City of Taris. He had run-ins with Marn Hierogryph, whom he referred to as a \"rodent\".\nDespite his ties to the criminal underworld of Taris, Gadon was generally considered a good man amongst lower city citizens who protected those who were loyal to him, and was known to assist the poor. Still, he resented the Sith presence and was labeled a menace.\nDuring the Mandalorian occupation of Taris, Gadon led the Hidden Beks in resistance to the invaders. He recognized that he led a gang, though, not an army and had hopes to ally with the Taris Resistance. The Resistance was reluctant to work with a group they considered to be inferior to them, however, a feeling that solidified when Taris' constable Sowrs joined them. Believing that the Beks were to blame for her children's kidnapping, she refused to negotiate with Gadon.\nWith the arrival of Zayne Carrick, however, Gadon saw a chance to meet with the constable, using the wanted \"Jedi killer\" as leverage. This proved to be unneeded, however, when Zayne, Gryph, and Mission Vao discovered that the constable's children had been captured by gang member Brejik and were being cared for by Griff Vao. Though angry with the two, they had an even better way to get into the Resistance's good graces, Gadon led the Beks to the Resistance headquarters to negotiate a temporary alliance.\nClaiming that it was Zayne who found the constable's children, Gadon succeeded in convincing the Resistance's leader, Taris Senator Haydel Goravvus to work with them. Also, he further protected the fugitive from Raana Tey, as Carrick was one of the Beks.\nLater, Gadon helped plan the bombing of the Jedi Tower in hopes of taking out Mandalorian leader Cassus Fett. Gadon led the group to the foundation of the Tower, using the tunnels below to reach it, and helped rig the area with explosives. The mission soon went south, however, as Fett had already vacated the building and the Mandalorians had discovered and attacked the Resistance headquarters. While the rest of the Beks fell back to the Pit, Gadon and Gryph stayed behind in hopes of rescuing Zayne and Shel Jelavan, who were both still inside the Tower. Dropping a line to Zayne and Shel, Gadon managed to narrowly escape the pursuing Mandalorians.\nThek would later lose his sight in a swoop bike accident. However, this was partially restored through ocular implants.\nAfter the crash it was assumed that Gadon's most apt follower and adopted son Brejik would assume leadership of the gang due to Gadon's accident. However, Gadon believed that Brejik wasn't ready to take over and that he was still well enough to lead the gang. This act of public humiliation angered Brejik and in a rage he along with younger members of the Hidden Bek gang broke off and joined their arch rivals the Black Vulkars. It wasn't long until Brejik and his followers took over the Black Vulkar gang and started a gang war to wipe out the Beks and take over the Lower City, unlike the Beks, the Vulkars dealt more openly and unashamedly in illicit drugs and slavery. The resulting gang war created problems for the citizens of the Lower City since the Vulkars were not only killing Hidden Beks, but also anyone else they came across.\nWhen Revan crashed on Taris, he sought Gadon's aid and retrieved a prototype accelerator that had been stolen by the Vulkars. Gadon mentioned that the accelerator would be in their base. Traveling through the Undercity Revan made his way to the base and retrieved the accelerator. Using the accelerator, Revan won the freedom of Bastila Shan, who had been captured and held prisoner by the Vulkars.\nTaris was later destroyed by Darth Malak via orbital bombardment.\nGadon Thek was voiced by Phil LaMarr.\nWhen retrieving the accelerator, a member of the Vulkars, Kandon Ark, makes the player character, Revan, an offer. If Revan assassinates Gadon, the player can race for the Vulkars and earn 500 credits. Revan would gain a dark side point as a result, but there are no changes in the following events.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/3956_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Hidden_Beks",
  "/wiki/Taris_Resistance",
  "/wiki/Swoop_gang/Legends",
  "/wiki/Lower_City",
  "/wiki/Marn_Hierogryph",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Mandalorian_Wars",
  "/wiki/Mandalorian/Legends",
  "/wiki/Noana_Sowrs",
  "/wiki/Zayne_Carrick",
  "/wiki/Mission_Vao",
  "/wiki/Brejik",
  "/wiki/Griff_Vao",
  "/wiki/Haydel_Goravvus",
  "/wiki/Raana_Tey",
  "/wiki/Jedi_Tower",
  "/wiki/Cassus_Fett",
  "/wiki/Shel_Jelavan",
  "/wiki/Black_Vulkars/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Rescue_of_Bastila_Shan",
  "/wiki/Revan/Legends",
  "/wiki/Prototype_accelerator",
  "/wiki/Bastila_Shan",
  "/wiki/Destruction_of_Taris",
  "/wiki/Darth_Malak",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Phil_LaMarr",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Kandon_Ark",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Knights_of_the_Old_Republic_11",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic:_Knights_of_Suffering",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_Handbook"
 ]
}