{
 "name": "Gael Kinner",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Blood Raptors"
     ]
    }
   ]
  }
 ],
 "content": "Gael Kinner was a Human male pilot and member of the Blood Raptors gang.\nIn 32 BBY, Kinner was selected to race his G-59 Cannibalizer through the Eskaron tunnels against Teeloo. The Raptors had impounded Teeloo's cargo in punishment for him accidentally crashing with one of their ships. They also humiliated him with a mandatory race through Eskaron, betting his cargo against his ship, the Neeva-Beelo — although the Raptors tried to keep the cargo plus the ship, no matter the result of the race, and some of them attempted to sabotage the ship.\nIn the middle of the race, Kinner's and Teeloo's path crossed with that being used by another race. Kinner shot at and destroyed the lead ship of the other race to avoid colliding with it. That ship was one of Nirama's, and the crime lord was most displeased to lose his pilot Arraxx, his ship, and the race.\nAfter Kinner's race against Teeloo was finished, Nirama's lieutenant Len Markus collected Teeloo's crew, Kinner, and some of his fellow Blood Raptors. They were taken to Nirama's headquarters in Mikish. After sorting out what had happened, Nirama released Teeloo and his crew, deeming that the Raptors were the guilty party. Nirama fed one of the Blood Raptors to the rancor at the Bollin Exotic Animal Emporium. Being the one that destroyed Nirama's ship, it might have been Gael that suffered that fate.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Blood_Raptors",
  "/wiki/Tolea_Biqua",
  "/wiki/Pilot/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/G-59_Cannibalizer",
  "/wiki/Eskaron",
  "/wiki/Teeloo",
  "/wiki/Neeva-Beelo",
  "/wiki/Nirama",
  "/wiki/Crime_lord/Legends",
  "/wiki/Arraxx",
  "/wiki/Len_Markus",
  "/wiki/Mikish",
  "/wiki/Rancor/Legends",
  "/wiki/Bollin_Exotic_Animal_Emporium",
  "/wiki/The_Price_of_Business"
 ]
}