{
 "name": "Gaharrag",
 "display_name": "Gaharrag",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Gaharrag was an adult male Wookiee who indulged in a life of crime prior to the Second Galactic Civil War. His spree of murder was brought to an end by the Jedi Tahiri Veila, and Gaharrag earned a prison term at the Armand Isard Correctional Facility. In 44 ABY, he and several other inmates attempted to overwhelm the newly incarcerated Veila, but all—Gaharrag included—were severely thrashed by the former Jedi Knight.\nIn the years before the Second Galactic Civil War, an adult male Wookiee named Gaharrag enjoyed life as a criminal with a tendency toward homicide. He donned markings reflective of the gang to which he belonged, and carved his own niche as a notorious killer—a reputation that was brought to an end through the efforts of Jedi Knight Tahiri Veila. Following his arrest, trial, and subsequent conviction, the murderous Wookiee was remanded to galactic penal service in the Armand Isard Correctional Facility on Coruscant. While incarcerated, Gaharrag made the acquaintance of many other criminals, among them a Hutt and fellow killer named Leurm, and the Mon Calamari vehicle thief Furan.\nIn 44 ABY, an opportunity for Gaharrag to avenge himself arose when Tahiri Veila, the same Jedi responsible for his own incarceration, was herself subjected to confinement within the walls of the Armand Isard Correctional Facility for her own crimes during the recent civil war. The Wookiee gangster was enjoying a time of recess when Veila was mistakenly brought to the same exercise yard occupied by the majority of the prison's male population—Gaharrag included. Furan was the first of them to confront her; when it became apparent that she would not be intimidated, Gaharrag, Leurm, and several other prisoners were summoned by the Mon Calamari to partake in her imminent demise. Taunting ensued as inmates prepared to attack, but Veila preceded them by assaulting Leurm and breaking his arm. The Wookiee charged and, as Veila faced him, swung, only to pummel Leurm as she ducked. With a great roar Gaharrag charged again as the Hutt fell and Veila eliminated a Bothan opponent. He attempted to seize the evasive Human woman but was felled when she kicked and broke his right leg. Veila's victory was short-lived, however; while the battered tended to their injuries, prison staff dropped the former Jedi with a stun bolt, one especially designed for the incapacitation of Wookiees like Gaharrag.\nGang tattoos occupied shaved patches of Gaharrag's coat, and he preferred to socialize with others who shared his proclivity for lawlessness. A well-known killer, Gaharrag earned a reputation with Jedi Tahiri Veila as one of the most dangerous criminals in whose conviction she was influential. His was an intimidating presence in combat, and he bellowed ceremonial Wookiee war cries designed to paralyze enemies with fear. Those with experience against Wookiee opponents recognized the fatality in failing to swiftly eliminate the threat Gaharrag posed and felt inclined to attack him first among a group of adversaries. While Veila's placement in the all-male exercise yard was expected by Gaharrag, who much desired to inflict bodily harm upon her, he was unprepared for the extent of her battle prowess and was repeatedly confounded by her evasive maneuvers. Despite his tremendous strength, considerable reach, and overall killing ability, Gaharrag was ultimately betrayed by his age, which was evidenced in the weak knee that Veila exploited to defeat him.\nGaharrag's first and only canon appearance is in Aaron Allston's Fate of the Jedi: Conviction, the seventh novel in the nine-part Fate of the Jedi series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Death/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Tahiri_Veila",
  "/wiki/Prison/Legends",
  "/wiki/Armand_Isard_Correctional_Facility",
  "/wiki/44_ABY",
  "/wiki/Trial_of_Tahiri_Veila",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Leurm",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Furan",
  "/wiki/Gangster/Legends",
  "/wiki/Time/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Stun/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Canon",
  "/wiki/Aaron_Allston",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)"
 ]
}