{
 "name": "Gal-Stod Slagistrough",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nuknog"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Agricultural Corps",
      "Agricultural Corps"
     ]
    }
   ]
  }
 ],
 "content": "Gal-Stod Slagistrough was a male Nuknog, and a leading member of the Jedi Service Corps branch, the Agricultural Corps, during the years proceeding the implementation of the Ruusan Reformations of the Galactic Republic. Among his contributions to the Jedi Order during his years of service with the AgriCorps was his authorship of a chapter of the Jedi Temple guidebook titled, The Jedi Path: A Manual for Students of the Force. Jedi Slagistrough detailed the inner workings of the Service Corps and its connection with the Council of Reassignment, helping to prepare Jedi Initiates for a possible assignment to the life of a service worker.\nWhen it came time for Initiate Slagistrough to take his final trials to graduate from the Jedi academy on Coruscant, he attempted and failed to pass the tests presented to him and was reassigned to serve in the Agricultural Corps. Working his way up in the Corps, Slagistrough was eventually appointed to the Council of AgriCorps Masters. Unlike most Jedi of the era, Jedi Slagistrough did not serve in the Army of Light in the crusades against the Brotherhood of Darkness. Instead, Slagistrough continued to maintain order within the Service Corps, aiding worlds devastated by the New Sith Wars and providing food for soldiers on the front lines. When his brother and sister Jedi within the Order proposed that a guidebook to the life of the Jedi be written, Jedi Slagistrough agreed to work on the project, contributing a chapter describing the inner workings of the Service Corps.\nWhile it did not make it into the finished edition, Daniel Wallace, author of The Jedi Path: A Manual for Students of the Force, released a list detailing the genders and species of each of the authors of the in-universe The Jedi Path: A Manual for Students of the Force. Master Slagistrough is revealed to be a male Nuknog.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nuknog/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Agricultural_Corps/Legends",
  "/wiki/Jedi_Service_Corps/Legends",
  "/wiki/Ruusan_Reformation",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force",
  "/wiki/Council_of_Reassignment/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Jedi_academy",
  "/wiki/Coruscant/Legends",
  "/wiki/Council_of_AgriCorps_Masters",
  "/wiki/Army_of_Light/Legends",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Daniel_Wallace",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/StarWars.com",
  "/wiki/Jedi_Council_Forums"
 ]
}