{
 "name": "Galasett",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kerestian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "Galasett was a Kerestian male bounty hunter who tracked outlaw bounty hunters. He started doing so when two overzealous bounty hunters brutally killed his friend Reglis Taal's brother. When he discovered it, he decided that he would become a vigilante for other hunters. As Galasett himself was an overkill, he eventually went to jail and paid fines for the collateral damage he caused during the hunts.\nGalasett met and fought Baraduk, a Barabel bounty hunter. Both of them were injured in the fight, and Baraduk escaped Galasett. Galasett developed a personal hatred toward Baraduk.\nGalasett, a Kerestian male, was an old friend of Reglis Taal. Taal's brother, Philo, was brutally murdered by two bounty hunters who believed him to be a wanted criminal; if they had checked their sources, they would have known that there was no bounty on Philo's head. Nineteen-year-old Taal tracked and killed the bounty hunters himself. Galasett, knowing of his friend's story, decided that it was unfair and that someone should deal with overzealous bounty hunters; those who exceeded in their job to the point of breaking the law.\nGalasett decided to do so himself, becoming a bounty hunter to track other bounty hunters. Although the Bounty Hunters' Creed prohibited this situation, it did not apply if there was a bounty on the head of the prey. Galasett then started tracking outlaw bounty hunters and capturing them. He became a vigilante for his colleagues. During his career, he was fined for damaging the environment and was also sent to jail for a short time, for hunting in an area where it was forbidden to do so.\nAt one point, Galasett discovered that the Barabel bounty hunter, Baraduk, was technically a fugitive slave—albeit pardoned—and that Baraduk sometimes worked as a bodyguard for figures of organized crime. Labeling Baraduk as an outlaw hunter, Galasett fought the Barabel while he was working for a criminal. During this first encounter, Baraduk, an expert in night attacks due to his natural infrared vision, took his chance to attack Galasett from darkness. They both were severely wounded in the encounter, but Baraduk managed to leave the planet.\nGalasett despised bounty hunters that had broken the law. He tracked them eagerly and sometimes causing great collateral damage. Whenever he found proof of a bounty hunter committing a crime, Galasett quickly acted so that a bounty on the hunter's head could be posted, and then the Kerestian tried to capture his victim before the other hunter even knew someone wanted him. After his first encounter with Baraduk, Galasett developed a hatred for the Barabel—and vice versa. Both hunters expected to meet again at a later point and fight until one of them was dead.\nGalasett carried several weapons, including a heavy blaster pistol, a blaster rifle, a neurostaff, a knife and several grenades, including a thermal detonator. His less offensive gear included a comlink, a datapad, a glowrod, a medpac and syntherope. He also wore a suit of customized armor.\nGalasett was mentioned in several sections of the roleplaying book Galaxy Guide 10: Bounty Hunters , by Rick D. Stuart, including an image of Galasett by Mike Vilardi. One of these listed his role-playing stats and a comprehensive list of the gear he carried with him. Most of the other bounty hunters in the book are specified to have an Imperial Peace Keeping Certificate , except for Galasett, Baraduk, Reglis Taal and Dengar.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kerestian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Reglis_Taal",
  "/wiki/Baraduk",
  "/wiki/Philo",
  "/wiki/Bounty/Legends",
  "/wiki/Bounty_Hunters%27_Creed",
  "/wiki/Barabel/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Infrared/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Neurostaff",
  "/wiki/Knife/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Glowrod/Legends",
  "/wiki/Medpac/Legends",
  "/wiki/Syntherope",
  "/wiki/Roleplaying_game",
  "/wiki/Galaxy_Guide_10:_Bounty_Hunters",
  "/wiki/1994",
  "/wiki/Rick_D._Stuart",
  "/wiki/Mike_Vilardi",
  "/wiki/Imperial_Peace-Keeping_Certificate/Legends",
  "/wiki/Dengar/Legends",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}