{
 "name": "Galen_(SIS)",
 "display_name": "Galen  (SIS)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "68.3 percent of cybernetics and synthetic materials",
      "including eye and cheek implants"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Strategic Information Service",
      "Power Guard Project",
      "Republic Strategic Information Service",
      "Power Guard Project",
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Sadic"
     ]
    }
   ]
  }
 ],
 "content": "Galen was a Human male Republic Strategic Information Service agent during the Cold War.\nA human male, Galen became an agent in the Republic Strategic Information Service—the primary intelligence agency of the Galactic Republic—sometime during the Cold War with the Sith Empire. Around 3643 BBY, he was stationed on the Republic capital of Coruscant, and headed the SIS base in the Senate Tower.\nWhen the design files for the Planet Prison superweapon were stolen by a team of thieves, the Mon Calamari General Var Suthra placed Galen and his team in charge of the investigation. Galen coordinated his search efforts with the Coruscant Security Force, but the SIS agent led the investigation and reported directly to General Suthra.\nGalen's investigation soon proved fruitful, as his agents were able to identify one of the thieves from a security recording— a Rodian named Vistis Garn. Galen then went straight to Suthra, who was speaking with the Jedi Masters Bela Kiwiiks and Orgus Din, Orgus' former Padawan, Kiwiiks' current Padawan Kira Carsen, and Doctor Eli Tarnis, the creator of the Planet Prison. Learning that Galen had a lead, Din ordered his former Padawan—now a Jedi Knight—to work directly with Galen, while the Jedi Masters and Suthra went to speak with the Supreme Chancellor Dorian Janarus. Kiwiiks also suggested that Carsen remain behind, as her security expertise could prove useful. Galen then explained his lead to the two young Jedi and Doctor Tarnis: Garn, who was known to work with the criminal Migrant Merchants' Guild, had recently been spotted raiding a military warehouse for high-grade munitions and weapons.\nThe Knight and the astromech droid T7-O1 headed to the Guild-controlled Old Galactic Market to recover the weapons and design files, while Galen remained at the Senate Tower and worked with Carsen to distract the criminals with Coruscant's security network. However, while the Knight and T7 were successfully recovering the stolen files and weapons, Galen and Carsen encountered a security breach. Somehow, members of the Black Sun criminal syndicate infiltrated the Senate Tower's security and kidnapped Doctor Tarnis right under the SIS's noses. When the Knight contacted Galen to report success, the agent brusquely ordered the Jedi back to the Senate Tower to aid in the search for Tarnis. Galen was disturbed to learn that Garn had been in fact hired by Black Sun to steal the files in the first place, and handed the recovered files off to his subordinate Krand for decryption\nJust as Galen was explaining the situation to the Knight, he received a holocall from Carsen, who had pursued the kidnappers to the nearby spaceport with CSF forces. She and the security team had pinned down the kidnappers in Docking Bay 84, but they were unable to make any more progress. Galen ordered the Knight to go aid Carsen, and together the two Jedi were able to defeat the Black Sun members and discover that Tarnis had been taken to Black Sun territory.\nTracking the Black Sun operatives who had supposedly kidnapped Doctor Tarnis, the Jedi Knight discovered that Tarnis was in fact a Sith Lord and the son of Darth Angral. With this revelation all of the Republic's superweapon projects were in danger. Galen left Coruscant shortly after that to secure the Power Guard Enhancement System on Nar Shaddaa.\nAs soon as he settled down on Nar Shaddaa and began his work, Galen was captured by the Sith Lord Sadic. Sadic then turned Galen into a Mark III Power Guard and forced Galen to obey his commands by punishing him with extreme pain if he refused. In a final act of defiance, Galen turned on Sadic and the other Power Guards. However, they were too powerful and Galen was severely wounded. Galen would survive, however, and learned how to control his implants with help from the SIS. Using his new abilities, Galen would go deep undercover into Sith space. He contacted the Knight who had saved him and told them about his assignment, thanking the Jedi for showing Galen that he still had something to live for.\nGalen was a competent and dedicated SIS agent. He was determined to protect the Republic at all costs, including his life.\nHowever, his personality drastically changed after being transformed into a Power Guard. He became miserable and depressed not only due to being Sadic's slave, but also because of his unwilling transformation. Even with Sadic gone, he still preferred to die rather than live like a machine, even willing to go as far as commit suicide. However, he still retained some humanity and loyalty, as he helped the Hero of Tython defeat Sadic. When Sadic was defeated, he preferred to stay and die, but when the SIS urged him to come along he obliged.\nAfterwards, Galen would learn to control his implants, and accept his condition. He would later send a message to the Jedi, thanking them for showing him that he still had something to live for.\nGalen first appears in Star Wars: The Old Republic as part of the main story quests for the Jedi Knight story arc. At the end for the dark side option, when Galen is a Power Guard cyborg, the Republic player can choose to kill him instead of letting him live and letting him sacrifice himself.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Galen",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Galen_(SIS)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Cybernetics/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Power_Guard_Enhancement_System",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sadic",
  "/wiki/Agent/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/3643_BBY",
  "/wiki/Coruscant/Legends",
  "/wiki/Senate_Building",
  "/wiki/Planet_Prison",
  "/wiki/Superweapon/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/General/Legends",
  "/wiki/Var_Suthra",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Vistis_Garn",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Bela_Kiwiiks",
  "/wiki/Orgus_Din",
  "/wiki/Hero_of_Tython",
  "/wiki/Padawan/Legends",
  "/wiki/Kira_Carsen",
  "/wiki/Doctor/Legends",
  "/wiki/Tarnis_(Sith_Lord)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Dorian_Janarus",
  "/wiki/Jedi/Legends",
  "/wiki/Migrant_Merchants%27_Guild",
  "/wiki/Astromech_droid/Legends",
  "/wiki/T7-O1",
  "/wiki/Old_Galactic_Market",
  "/wiki/Raid_on_the_Migrant_Merchants%27_Guild_warehouse",
  "/wiki/Black_Sun/Legends",
  "/wiki/Krand",
  "/wiki/Coruscant_Spaceport",
  "/wiki/Docking_Bay_84",
  "/wiki/Black_Sun_territory",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Angral",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith/Legends",
  "/wiki/Mark_III_Power_Guard"
 ]
}