{
 "name": "Galen_Walton_Erso",
 "display_name": "Galen Walton Erso",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Grange"
     ]
    },
    {
     "name": "Born",
     "values": [
      "56 BBY",
      "Grange"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Eadu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Futures Program",
      "Republic Futures Program",
      "Galen Erso's field team",
      "Zerpen Industries",
      "Helical HyperCom",
      "Galactic Empire",
      "Tarkin Initiative",
      "Tarkin Initiative",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Galen Walton Erso was a human male scientist and leading galactic authority on crystallography and energy enrichment. Born on the planet Grange, an agricultural backwater world, Erso was drafted into the Republic Futures Program, where his skill and intelligence ultimately led him to becoming a critical component, though reluctant, in the development of the DS-1 Death Star Mobile Battle Station. One of the most renowned polymaths in the galaxy, Galen was a gifted theoretician, mathematician, and experimental physicist. Galen was a recipient of the Kuat Systems Engineering Medal, the Ashgad Prize and the Roche Foundation Prize.\nAfter leaving the Galactic Empire's ambitious Death Star project and hiding out on the planet Lah'mu, he was eventually discovered and forcibly brought back into the fold by his old friend and colleague Orson Krennic, whose death troopers killed Erso's wife Lyra. His daughter Jyn meanwhile fled and was taken in by Saw Gerrera. Erso was instrumental in the project's completion over the next several years, but he secretly built a hidden weakness into the battle station.\nAttempting to send word of it to the Rebellion against the Empire, Erso enlisted the help of Imperial cargo pilot Bodhi Rook, who eventually got the message to Gerrera when he was captured by Gerrera's Partisans. The message was eventually seen by Jyn, who had been rescued from Imperial prison on Wobani by the Rebellion in an attempt to get close to Gerrera. A Rebel force including Erso that was captained by Cassian Andor traveled to Eadu, where Krennic, having learned of Erso's deception, confronted him and his team. Erso admitted to his deception but was then mortally wounded by bombs dropped by the Alliance's Blue Squadron. Erso lay dying as Jyn finally reunited with him, and Erso died in his daughter's arms.\nGalen Walton Erso was born on the agricultural backwater planet Grange to a human mother and father as an only child in 56 BBY. Growing up in a poor neighborhood, Galen demonstrated high intelligence from an early age. His mother, first to recognize her son's genius, supplied him with whatever he needed to keep his mind busy when credits weren't tight; first providing him a music synthesizer, chemistry set, and later whatever datacrons she could find. Upon entering primary school, Galen outlearned his fellow classmates and quickly grew bored. Galen's mother, eager for Galen to learn of the broader galaxy, subscribed him to a HoloNet service. By secondary school, Galen's teachers described him as a \"prodigy.\" Galen excelled in the mathematics and the sciences. He also learned numerous languages and magic tricks out of pure curiosity, and built his own primitive HoloNet transceiver.\nIn school, Galen won the Grange subadult science and engineering fair scholarship. Often coming up with academic formulas and theories that surpassed his understanding and mystified his instructors, one of his solutions was eventually submitted offworld by a mentor. This submission brought Galen into the attention of the Republic Futures Program, a program designed to collect the \"best and brightest\" students from across the stars to become the Republic's next generation of leaders, scientists, and citizens.\nAt the urging of his mother, Galen wound up in the Futures Program on Brentaal in 40 BBY. While enrolled, he received word that his mother had died of a short illness, and, only a few years later, that his father had died in a vehicular accident. Following these losses, he soon became best friends with architecture student Orson Krennic in 36 BBY. By graduation, Galen graduated with top honors in the Brentaal Futures Program materials competition. Following graduation, Galen wound up taking advanced studies, research internships, and teaching positions. During this time, Krennic helped Galen land a visiting professorship at the Institute of Applied Science on Coruscant, which came with a good stipend and free apartment. By twenty-five, Galen had published prolifically and had earned a reputation for himself in the fields of crystallography and energy enhancement.\nGalen traveled the galaxy on research missions searching for rare crystals to use to supply power. By the time Krennic has helped him get the professorship at the Institute of Applied Science, his focus had become kyber crystal research. In 26 BBY during an expedition on Espinar in search of rare crystals, such as kyber crystals, Galen met his future wife, Lyra. By the end of the six month expedition, the two were lovers. A year later in 25 BBY, Galen married Lyra on Coruscant. Sometime later, the two were trapped in a crystal cave on Chandrila, where Lyra's knowledge of the wilderness led to their survival.\nWhile many of Galen's colleagues pursued government research, Galen refused to pursue military research because of his pacifistic principles, and instead took a contract with Zerpen Industries to continue his studies into crystal synthesis and energy enrichment. Born to hardworking parents and seeing the wealth disparity in the galaxy, Galen sought to examine the very structures of existence to see if he could unlock unlimited energy and even the divide between the have's and have not's. Galen hoped to find a way to provide clean, safe, and nearly unlimited power to developing worlds by unlocking the secrets of the kyber crystal. Months before the outbreak of the Clone Wars, Galen and Lyra relocated to the Outer Rim world of Vallt, where Zerpen Industries had arranged a deal with Vallt's King Chai, who allowed the construction of a research facility to grow synthetic crystals in the hopes of creating a new source of inexpensive power.\nBy the start of the Clone Wars in 22 BBY and before leaving for Vallt, Lyra was already pregnant with their future daughter, Jyn. Shortly afterward, Vallt's Republic-aligned King Chai was overthrown in a coup by forces loyal to Marshal Phara, who received military support from the Separatist Alliance. Galen and Lyra were hunted down by the Iron Gauntlet Legion, and Galen was imprisoned in a Vallt security complex after their failed escape attempt from the Valltii riders. Lyra was kept in nicer quarters in the northern wing of Vallt's Keep. While imprisoned, Galen was offered a chance to serve the Separatists for their freedom. Galen refused but was willing to accept their offer if his wife willed it. The same year, Jyn was born on Vallt, and Galen was released from his cell to see his child with Lyra, who both chose the name Jyn in agreement. Galen did grow close to his captors, and they considered the scientist as one of their own. Members of Vallt's government like Chiefian Gruppe even wanted to keep Galen on Vallt instead of handing him over to the Separatists.\nBy roughly 21 BBY, Galen Erso was rescued in a prisoner exchange by Krennic, his longtime friend and compatriot. Unbeknownst to Galen, his earlier signal to Zerpen Industries regarding his capture and seizure of the facility was indeed heard, but ignored at request of Krennic, who was a part of the Republic Special Weapons Group and responsible for the development of the Death Star. Krennic sought to manipulate Galen and place him in his debt to coerce him into working on the Death Star's superlaser, which relied on kyber crystals; a topic in which no other galactic authority was as well versed in as Galen. Ultimately, through Galen's work, Krennic hoped to curry favor with high-ups and attain the position of rear admiral. Upon his and his families' rescue, Krennic ordered the bombing of Vallt to allow pro-Republic forces to reclaim power, despite both Galen and Lyra's pleas to save the lives of those they had lived with for the past year. Instead of reverting to Coruscant, Krennic jumped into orbit above Grange, where a space battle had erupted over Galen's home planet. Krennic hoped to show Galen the chaos the galaxy had descended into since the start of the Clone Wars, and of course, manipulate Galen to ultimately weaponize his research to promote \"peace and security\" throughout the galaxy.\nBack on Coruscant, the Erso's soon realized the sweeping changes brought about by the war. Many of their colleagues, drafted into wartime research, welcomed Galen back from imprisonment. However, Galen's refusal to weaponize his genius led to him being ostracized by his colleagues, many of whom refused to meet with him. Only Prof. Reeva Demesne agreed to see Galen. For a few months, Galen was unemployed but continued living in his apartment at the Institute of Applied Science in Coruscant's Central District. During a reunion of Futures Program students at 500 Republica, Galen was publicly accused of being a Separatist spy and collaborator by drunk patron Dagio Belcoze. Defending himself from punches thrown by Belcoze, Krennic stepped in to help defend Galen in an effort to further earn his trust.\nDuring his period of unemployment, Galen became increasingly restless. He was questioned several times by Republic Intelligence and COMPOR as to his imprisonment on Vallt, and was prohibited from traveling offworld Coruscant. Ostensibly, this was for security reasons and because Zerpen was profiteering from both sides in the conflict. Galen also became a casual acquaintance with Adjutant General Wilhuff Tarkin, who was willing to drop the case leveled against him by the Justice Department. Around this time, Galen offered Krennic an opportunity to quit his job at the Corps of Engineers—Krennic's public title—and join him in designing a new energy facility. Krennic politely refused Galen's offer. Eventually, Krennic offered Galen a job working for Helical HyperCom, a company that was attempting to produce crystal arrays to better serve remote areas where communications arrays had fallen prey during the war. While not as prestigious or befitting his intelligence, Galen accepted the offer, as it would allow him something to do and allow them to flee Coruscant for a while.\nWhile employed at HH, Galen quickly annoyed his superior, Roman Herbane, who disliked Galen's inquisitiveness and suggestions for improving workplace efficiency, even if it cost him credits. This was, in reality, a part of Krennic's plan, who knew that HH would be a terrible posting for Galen. During his time there, Krennic hoped that Galen would become more and more miserable, making him more likely to suggestions offered by himself. By 19 BBY, HH's facility on Lokori was subject to occasional Separatist raids on the civilian population. On the last day of the Clone Wars, Separatist forces broke through the Republic blockade and landed forces on the planet's surface. A fierce battle erupted, and in the chaos Galen sought to protect his family from harm. Backed into a corner by B1-series battle droids, Galen was almost killed before the droids suddenly shut down. While Galen believed this was because of the destruction of a Droid Control Ship, in reality, the Clone Wars had ended.\nTraumatized by his near death-encounter at the hands of the Separatists, and increasingly worried for the safety of his family, Galen quickly fell under the influence of Krennic, who now served under the auspices of the First Galactic Empire. Lyra was suspicious of Krennic and continually acted as Galen's moral conscience. Before returning to Coruscant from Lokori, Galen briefly stopped on Kanzi at behest of Krennic, who offered him a position in Project Celestial Power in 19 BBY. Galen was misled into believing that Celestial Power represented the Emperor's dream of reconstructing the galaxy devastated during the Clone Wars by providing nearly unlimited energy. In addition to supposedly reducing poverty and aiding developing worlds, Galen was led to believe it would also deter growing Separatist holdouts from gaining new members dissatisfied at the pace of Imperial reconstructive efforts.\nGalen soon became enamored in kyber research in Celestial Power's central facility on Coruscant. Lyra worried over Galen's increasing remoteness and dedication to his work. Realizing that Lyra's morality was a danger to his plans, Krennic offered her a job scouting a possible network of kyber crystal caves on Alpinn. By Lyra's return at the end of the six month period, Galen was a different man. Lyra worried that she had lost her husband in his mad pursuit of knowledge, being providing nearly unlimited resources to aid in his research, and seemingly echoing propaganda rhetoric spoken by Krennic. Furthermore, Galen had become distanced to his daughter, Jyn, and rarely spoke with Lyra except for when she transcribed his notes. Galen consciously regretted this, knowing that he was no longer allowed to due to his swearing of multiple security oaths. However, he firmly believed that what he was doing was for the ultimate good of the galaxy.\nEventually, Galen became suspicious of Krennic's inability to provide him with examples of the implementation of his research. In 17 BBY, following his wife, Lyra's telling of Galen that his knowledge was, in fact, being weaponized by Krennic, Galen sought to escape his Imperial service. Angered at being lied to by Krennic, Galen and Lyra escaped in the chaos of Coruscant's All-Species Week, a holiday event that saw the streets and skylanes of Coruscant jammed with party-goers. In the chaos, Galen and his family escaped with the aid of known rebel Saw Gerrera, whom Lyra had heard of through Has Obitt, the pilot who initially rescued them from Vallt along with Krennic, and had become good friends with the Ersos. Saw helped purchase 65 hectares of land on Lah'mu, a remote world unspoiled by the Empire for the Erso's to hide on. Knowing that deleting his research would only quicken Krennic's soon-to-be mad search for himself, Galen left his notes unspoiled, instead hoping that his insanely complicated notes would hamper Celestial Power's scientists' ability to understand the progress he was making.\nFor several years, Galen eked out a peaceful existence on Lah'mu, living on its less popular eastern side in a modest homestead. There, Galen and his droids utilized hardy Pretormin Environmental GX-8 condenser units to distill water vapor from the air, becoming simple farmers not interested in off-world trade. Galen was content to live out the rest of his life on Lah'mu, near the loving company of his wife and daughter. However, in 13 BBY, Krennic traveled to Lah'mu aboard his personal Delta-class T-3c shuttle with a complement of death troopers. Galen confronted Krennic, who offered him reentry into the Empire's service. Galen attempted to lie to Krennic, pretending that his memory was \"not as it used to be.\" Despite this, Krennic saw through Galen's lie. Simultaneously, Galen's wife, Lyra, pulled a blaster on Krennic, demanding that he leave them and their daughter alone. After refusing to lower her blaster, Krennic ordered his death troopers to kill Lyra, which they did in front of Galen's eyes, while Krennic took a mild glancing shot to the shoulder from Lyra's blaster.\nGalen was then pressed into the service of the Tarkin Initiative, an Imperial think tank. There, he was responsible for the fusing of crystal shards into larger forms, and the creation and redirection of a controlled chain reaction as the head of the kyber crystal research team. Galen, realizing that Krennic already possessed the ability to complete the station without him, decided to play the part of a defeated and obedient man. Knowing that whether or not he quit would not deter the completion of the station, Galen delayed the research as long as he could and made himself indispensable. Unknown to the Empire and to Krennic, who legitimately believed that he was helping Galen achieve his greatness, he never became truly loyal, and instead deliberately engineered a fatal weakness at the center of the space station in the form of a reactor module. Any pressurized explosion to the component would set off a chain reaction that would completely destroy the station. Hoping that his daughter was still alive and safe from Krennic, Galen codenamed the Death Star's structural readouts \"Stardust,\" the name he called Jyn as a child.\nStationed on Eadu, Galen eventually convinced Imperial pilot Bodhi Rook of the true horrors of the Death Star. Overcome with a crisis of conscience, Galen entrusted Bodhi with a message to be delivered to the Rebellion, and hopefully his daughter, informing them of the station's vulnerability.\nBy 0 BBY, rumors soon began to spread throughout the galaxy of a new Imperial superweapon. Shortly before the Battle of Yavin, the Rebel Alliance received word that Gerrera had a message from Galen pertaining to the superweapon. Recruiting Galen's estranged daughter, the Rebellion tasked Jyn with traveling to the Force-sacred world of Jedha to secure a meeting with Gerrera, a former friend of hers, and retrieve the message.\nAfter traveling to Imperial-occupied Jedha and watching her father's message, Jyn was led to believe that the Rebellion sought to extract her father from Imperial custody, while in reality, Intelligence officer Cassian Andor was under direct orders to assassinate Galen at his first opportunity by General Davits Draven, who was fearful of what other weapons Galen could create for the Empire. While on a covert mission to Eadu to assassinate Galen, Andor lost the will to pull the trigger after seeing Galen defend his fellow comrades from execution after Krennic realized a transmission had been sent from the facility. Threatening to shoot all researchers if the traitor did not reveal themselves, Galen announced that it was he who had sent the coded transmission, leaving his place by Krennic's side to plead for his colleagues' lives. Galen's words were met with deaf ears, as Krennic ordered researchers Rasett Milio, Vlex Onopin, Ames Uravan, Sirro Argonne, and Feyn Vann executed. Angered by Galen's betrayal, Krennic hit Galen across the face. Before any further action could be taken, a Rebel Alliance strike force assaulted Eadu owing to a communications blackout from Andor and his forces on the planet, with Draven fearing the worst had occurred. A proton bomb from a passing BTL-A4 Y-wing assault starfighter/bomber struck the platform where both Galen and Krennic were standing, sending them flying to the ground. Jyn, who had watched the exchange from a distance, ran to the platform where her father lay dying, revealing herself to him in his final moments. She told him she had seen the message, to which Galen replied that it must be destroyed. After telling his daughter he had so much to tell her, Galen died from his wounds in Jyn's arms. Her eyes filling with tears, Jyn was hesitant to leave her father. She later confronted Andor about going to Eadu to kill Galen, though Andor argued that he had orders and disobeyed them.\nHowever, Galen's sacrifice was not in vain: the Rebel Alliance eventually learned of his sabotage from the Death Star plans, which they procured at great cost. With that knowledge, the Rebels were able to exploit that vulnerability to destroy the Death Star, dealing a powerful blow against the Empire.\nGalen Walton Erso was a highly intelligent, humble, and kind man. Noted for his intricate scribbles illegible to nearly everyone except himself, Galen was a noted perfectionist. As a child, Galen never fit in with other schoolchildren, often staying to himself when he could. Galen was noted to talk a good game, albeit it was his innate shyness talking. Galen held a greater fear of attention than he did of failure. Upon meeting Orson Krennic in the Republic Futures Program, the two instantly bonded despite their personality differences. With Galen being shy and composed, and Krennic charismatic and known for his nocturnal prowling. Despite this, the two shared a close bond, with Galen declaring Krennic as \"bright and talented as anyone in the Futures Program.\" Other classmates also referred to him as \"a master of the invisible connection between things.\" Galen later mentioned that \"mathematics is our efforts to crystallize the unglimpsed connections between things.\" Krennic even defended Galen from the bullies that picked on him during his time on Brentaal.\nAs Galen entered puberty, he found himself confused and perplexed by the changes occurring to his body. After meeting Lyra on Espinar, Lyra had to be the one to make the first move, but Galen and Lyra quickly fell in love, sharing an extremely strong bond and a stable, healthy relationship. From this relationship, Galen realized for the first time that he was not the cold, mathematical man he thought himself, but that he had a heart as well. Lyra admired Galen's ability for a breath of knowledge, facility for sustained attention and his ability to seemingly become lost in deep thought, seemingly leaving the world for a few moments and returning to it with answers and insight no one could have expected. Despite this, Galen felt no need to demonstrate his gifts or to be groomed as an academic or scientist. Unlike some others, Galen would have been content to simply be a merchant, content to explore life and the material world in his own fashion, allowing his mind to wander where it would without being beholden to anyone. Additionally, Galen felt no initial desire to attend the Futures Program at all, feeling that he already held the entire galaxy in his thoughts.\nGalen was not one to hold a grudge, as noted toward his response to Roman Herbane during his time employed by Helical HyperCom. Despite frequent arguments, Galen felt sympathy for the man, knowing that he was simply a victim of his own stubbornness, lack of foresight, and limited intelligence. Deeply loving and caring for his family, Galen was willing to work for the Separatists while imprisoned on Vallt if his wife willed it, valuing her safety and comfort above his own. Galen would frequently converse with his wife as to the nature of his current research, simplifying and simplifying it until she could understand what he was so excited about.\nWith the rise of the Galactic Empire, Galen began to isolate himself once more in his work, becoming distant from Lyra and his daughter. Galen initially believed the Emperor's story of a \"Jedi Rebellion\" having occurred, and believed that his research into kyber crystals was not dishonorable to the Jedi, but allowing the galaxy to learn of some of the secrets it had held secret for centuries. An ardent pacifist, Galen refused to have any of his research weaponized, whether it be for the Republic or the Empire. Despite this, he was fooled into joining Project Celestial Power believing that the Emperor sought to create a source of clean, renewable energy for developing worlds. However, Galen ultimately became suspicious of Krennic's motives and listened to Lyra's warnings about him. Angered that his research had been weaponized, Galen retreated to Lah'mu, where he strove to eke out a simple existence. When his family was threatened once more by Orson Krennic, Galen reluctantly joined the Tarkin Initiative to protect Jyn. Engineering a weakness into the Death Star, Galen hoped his sacrifice would allow the Rebel Alliance to destroy the thing he unwillingly spent half his life to build.\nDuring his work on Valt, he ulitized Assis, a TDK-160 research-assistant. As a project leader, Erso maintained at least two uniforms during his service to the Empire. One such uniform was an Imperial development project uniform that included two code cylinders and a research division rank plaque. Another uniform was the project lead uniform with two code cylinders and a Tarkin Initiative symbol on the right arm.\nGalen Walton Erso, portrayed by Mads Mikkelsen, is a character created and developed for the 2016 film Rogue One: A Star Wars Story. The character was created by writer Gary Whitta, who named him after Star Wars creator George Lucas. Mikkelsen's involvement was announced on August 15, 2015. Mikkelsen revealed on Sky News that he would be portraying Jyn Erso's father. Mikkelsen later revealed that her father would be portrayed when Jyn is a child, and stated that the film would \"jump forward and backward in time.\" His name was revealed by Entertainment Weekly on June 22, 2016. The first photo of the character was revealed at Star Wars Celebration Europe on July 15, 2016.\nGalen Walton Erso was one of the main protagonists for the 2016 tie-in novel Catalyst: A Rogue One Novel. Author James Luceno envisioned him as a brilliant researcher who lacked the ability to communicate with others, instead, relying on his wife Lyra to act as an anchor to the world. Luceno described Galen as a \"conscientious objector,\" willing to reject any research that was directly tied to politics or warfare. In an interview, Mikkelsen noted that his role character bore real-life similarities to the famous 20th century physicists J. Robert Oppenheimer, Albert Einstein and Niels Bohr.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Galen",
  "/wiki/Darth_Vader_Annual_2",
  "/wiki/Rebel_Rising",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One_Adaptation_1",
  "/wiki/Star_Wars_(2020)_7",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Grange",
  "/wiki/56_BBY",
  "/wiki/0_BBY",
  "/wiki/Eadu",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_Futures_Program",
  "/wiki/Galen_Erso%27s_field_team",
  "/wiki/Zerpen_Industries",
  "/wiki/Helical_HyperCom",
  "/wiki/Galactic_Empire",
  "/wiki/Tarkin_Initiative",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Scientist",
  "/wiki/Galaxy",
  "/wiki/Crystallography",
  "/wiki/Reproduction",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Kuat_Systems_Engineering_Medal",
  "/wiki/Ashgad_Prize",
  "/wiki/Roche_Foundation_Prize",
  "/wiki/Planet",
  "/wiki/Lah%27mu",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Death_trooper",
  "/wiki/Lyra_Erso",
  "/wiki/Jyn_Erso",
  "/wiki/Saw_Gerrera",
  "/wiki/Standard_year",
  "/wiki/Pilot",
  "/wiki/Bodhi_Rook",
  "/wiki/Partisans",
  "/wiki/Imperial_Detention_Center_%26_Labor_Camp_LEG-817",
  "/wiki/Wobani",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Blue_Squadron_(Rebel_Alliance)",
  "/wiki/Death",
  "/wiki/Galen_Walton_Erso%27s_mother",
  "/wiki/Galen_Walton_Erso%27s_father",
  "/wiki/Parent",
  "/wiki/Credit",
  "/wiki/Music",
  "/wiki/Datacron",
  "/wiki/HoloNet",
  "/wiki/Teacher",
  "/wiki/Language",
  "/wiki/HoloNet_transceiver",
  "/wiki/Grange_subadult_science_and_engineering_fair_scholarship",
  "/wiki/Star",
  "/wiki/Brentaal_Futures_Program",
  "/wiki/Brentaal_IV",
  "/wiki/40_BBY",
  "/wiki/Architect",
  "/wiki/36_BBY",
  "/wiki/Time",
  "/wiki/Institute_of_Applied_Science",
  "/wiki/Coruscant",
  "/wiki/The_galaxy",
  "/wiki/Crystal",
  "/wiki/Kyber_crystal",
  "/wiki/26_BBY",
  "/wiki/Espinar",
  "/wiki/Marriage",
  "/wiki/Standard_month",
  "/wiki/25_BBY",
  "/wiki/Wedding_of_Lyra_and_Galen_Erso",
  "/wiki/Cave",
  "/wiki/Chandrila",
  "/wiki/Clone_Wars",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Vallt",
  "/wiki/King",
  "/wiki/Chai_(king)",
  "/wiki/Vallt_Experimental_Fusion_Facility",
  "/wiki/Synthetic_kyber_crystal",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/22_BBY",
  "/wiki/Marshal",
  "/wiki/Phara",
  "/wiki/Confederacy_military",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Capture_of_Galen_Erso_(Vallt)",
  "/wiki/Iron_Gauntlet_Legion",
  "/wiki/Prison",
  "/wiki/Tambolor_prison",
  "/wiki/Keep",
  "/wiki/Prisoner",
  "/wiki/Vallt%27s_government",
  "/wiki/Chief",
  "/wiki/Gruppe",
  "/wiki/21_BBY",
  "/wiki/Rescue_of_Galen_Erso",
  "/wiki/Republic_Special_Weapons_Group",
  "/wiki/Project_Stardust",
  "/wiki/Superlaser",
  "/wiki/Rear_Admiral",
  "/wiki/Erso_family",
  "/wiki/Orbit",
  "/wiki/Realspace",
  "/wiki/Siege_of_Grange",
  "/wiki/Homeworld",
  "/wiki/Professor",
  "/wiki/Reeva_Demesne",
  "/wiki/Central_District",
  "/wiki/500_Republica",
  "/wiki/Spy",
  "/wiki/Dagio_Belcoze",
  "/wiki/Republic_Intelligence",
  "/wiki/Commission_for_the_Protection_of_the_Republic",
  "/wiki/Adjutant_General",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Republic_Corps_of_Engineers",
  "/wiki/Communications_array",
  "/wiki/Roman_Herbane",
  "/wiki/19_BBY",
  "/wiki/Helical_HyperCom_production_facility",
  "/wiki/Lokori",
  "/wiki/Standard_day",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Blockade",
  "/wiki/Battle_on_Lokori",
  "/wiki/B1-series_battle_droid",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Mas_Amedda",
  "/wiki/Kanzi",
  "/wiki/Project_Celestial_Power",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Emperor",
  "/wiki/Dream",
  "/wiki/Separatist_holdouts",
  "/wiki/Project_Celestial_Power_complex",
  "/wiki/Scout",
  "/wiki/Alpinn",
  "/wiki/17_BBY",
  "/wiki/All-Species_Week",
  "/wiki/Skylane",
  "/wiki/Has_Obitt",
  "/wiki/Stormtrooper",
  "/wiki/Erso_homestead",
  "/wiki/Droid",
  "/wiki/Pretormin_Environmental",
  "/wiki/GX-8_water_vaporator",
  "/wiki/Farmer",
  "/wiki/13_BBY",
  "/wiki/Capture_of_Galen_Erso",
  "/wiki/ST_149",
  "/wiki/Delta-class_T-3c_shuttle",
  "/wiki/Blaster",
  "/wiki/Trooper",
  "/wiki/Eye",
  "/wiki/Kyber_crystal_research_team",
  "/wiki/Space_station",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Reactor",
  "/wiki/Superweapon",
  "/wiki/Battle_of_Yavin",
  "/wiki/The_Force",
  "/wiki/Jedha",
  "/wiki/Battle_on_Jedha",
  "/wiki/Intelligence_officer",
  "/wiki/Assassin",
  "/wiki/General",
  "/wiki/Davits_Draven",
  "/wiki/Mission_to_Eadu",
  "/wiki/Eadu_Energy_Conversion_Laboratory",
  "/wiki/Rasett_Milio",
  "/wiki/Vlex_Onopin",
  "/wiki/Ames_Uravan",
  "/wiki/Sirro_Argonne",
  "/wiki/Feyn_Vann",
  "/wiki/Proton_bomb",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Death_Star_plans",
  "/wiki/Heart",
  "/wiki/Merchant",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Jedi",
  "/wiki/Standard_century",
  "/wiki/Assis",
  "/wiki/TDK-160_research-assistant",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Code_cylinder",
  "/wiki/Division",
  "/wiki/Gary_Whitta",
  "/wiki/Mads_Mikkelsen",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars",
  "/wiki/George_Lucas",
  "/wiki/August_15",
  "/wiki/2015",
  "/wiki/June_22",
  "/wiki/July_15",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/James_Luceno",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volume_2",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volumes_1_%26_2",
  "/wiki/Catalyst:_A_Rogue_One_Novel_(audiobook)",
  "/wiki/Rebel_Rising_(audiobook)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_2",
  "/wiki/Rogue_One_Adaptation_3",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Rogue_One_Adaptation_5",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Verge_of_Greatness",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/Disney_Magic_Kingdoms",
  "/wiki/Category:Audio_files_of_Galen_Walton_Erso",
  "/wiki/Category:Images_of_Galen_Walton_Erso",
  "/wiki/StarWars.com",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Art_of_Coloring:_Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Where_in_the_Galaxy_Are_the_Worlds_of_Rogue_One%3F",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Forces_of_Destiny:_Tales_of_Hope_%26_Courage",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Star_Wars_Helmet_Collection_42",
  "/wiki/Star_Wars_Helmet_Collection_43",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_1",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Helmet_Collection_55",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_56",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_False_Economies_of_Scale",
  "/wiki/Star_Wars_Insider_192",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/The_Star_Wars_Book",
  "/wiki/The_Heroes_of_Rogue_One",
  "/wiki/Explosives,_Heavy_Weapons_and_Unstable_Elements",
  "/wiki/Naval_Armament_and_Equipment",
  "/wiki/Star_Wars_Inside_Intel:_The_Death_Star",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_14",
  "/wiki/The_Battle_of_Yavin",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/December_16",
  "/wiki/December_22",
  "/wiki/File:SkyNews_Mads_Mikkelsen_Rogue_One.png",
  "/wiki/April_26",
  "/wiki/January_6",
  "/wiki/2019",
  "/wiki/March_24",
  "/wiki/2017",
  "/wiki/March_25"
 ]
}