{
 "name": "Galliwig",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galliwig's Cantina"
     ]
    }
   ]
  }
 ],
 "content": "Galliwig was a Human male who owned and ran Galliwig's Cantina. Sometime prior to 8 ABY, Galliwig encountered the Twi'lek Loh'khar the Finder, a free-trader who was in possession of three seemingly worthless eggs. Galliwig offered Loh'khar twenty-five credits for the eggs, but the Twi'lek refused the offer. Galliwig watched as the three eggs hatched into baby Turazzas.\nGalliwig, a Human male, owned and managed Galliwig's Cantina. At some point prior to the Battle of Kal'Shebbol in 8 ABY, the Twi'lek free-trader Loh'khar the Finder used Galliwig's cantina to conduct business in. One day, Galliwig approached Loh'khar, who had recently acquired three fist-sized eggs in a business transaction, and commented that the Twi'lek appeared to have gotten the worse end of the deal. Loh'khar replied that, to him, there were no bad ends to any deal, since every one he engaged in was designed to bring in maximum profit for himself. Confused by the free-trader's statement, Galliwig offered Loh'khar twenty-five credits for the eggs, which Loh'khar refused. While Galliwig looked on perplexed, the eggs hatched, producing three Turazza sisters. Loh'khar bonded with the infant sentients, eventually naming them Nizzal, Vizzal, and Rizzal.\nGalliwig had a swarthy look to him and spoke with a drawl. He wore an apron while working in his cantina. Galliwig was confused at Loh'khar's views that obtaining three seemingly worthless eggs did not constitute a bad deal.\nGalliwig appeared in the short text story Turazza Eggs by Peter M. Schweighofer, which appeared in The DarkStryder Campaign, published by West End Games in 1995. The story served as a backstory showing how Loh'khar had acquired the three Turazza sisters who served him.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galliwig%27s_Cantina",
  "/wiki/8_ABY/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Loh%27khar",
  "/wiki/Free-trader",
  "/wiki/Egg/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Turazza",
  "/wiki/Battle_of_Kal%27Shebbol",
  "/wiki/Cantina/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Nizzal",
  "/wiki/Vizzal",
  "/wiki/Rizzal",
  "/wiki/Turazza_Eggs",
  "/wiki/Peter_M._Schweighofer",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/West_End_Games",
  "/wiki/1995",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/The_DarkStryder_Campaign,_Deluxe"
 ]
}