{
 "name": "Gallin_Crae",
 "display_name": "Gallin Crae",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sixth Kin",
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "Gallin Crae was a human male lieutenant in the Sixth Kin criminal organization, led by Wen Delphis. Highly loyal to Delphis, Crae was also the mentor of both Just Lucky and Ariole Yu, having trained them since they were young. Delphis' growing paranoia led Crae to perceive the Sixth Kin as a lost cause, and he abandoned the organization to join the Crimson Dawn criminal syndicate, meeting its leader, Qi'ra. After his betrayal, Delphis sent Lucky and Yu to kill Crae. The former lieutenant had escaped the Sixth Kin to the Vermillion, Crimson Dawn's fortress and flagship, where he attended Qi'ra's auction of the carbonite-frozen smuggler Han Solo.\nDuring the auction, Crae was confronted by his former students. Crae clashed with Lucky and Yu, who he easily overpowered, as the two were not fighting as a team. Crae explained why he had betrayed the Sixth Kin, offering Lucky and Yu a chance to join him. Their confrontation was cut short by the Crimson Dawn assassin Deathstick, whose intervention forced Crae's students to surrender. With Lucky and Yu imprisoned, Crae hoped they would change their minds about his offer. However, Crae was tricked by the rogue archaeologist Doctor Chelli Lona Aphra, who had been held in the same cell; slicing into a security droid, Aphra demanded Crae to tell her how to escape the Vermillion. Crae refused to answer, and Aphra shot him with the security droid's cannon. Though Lucky and Yu believed Crae to be dead, he had survived; alongside Deathstick and Qi'ra, he halted his protégés before they could escape.\nDuring the Imperial Era, Gallin Crae served as a lieutenant within the Sixth Kin, a criminal syndicate led by Wen Delphis that operated out of the city of Canto Bight on the planet Cantonica. A loyal member of the organization, Crae was the mentor of both Just Lucky and Ariole Yu, who he had trained from a young age. Crae taught Lucky and Yu to fight as a team, and the three became close, considering each other as family.\nAs the Sixth Kin became more powerful, however, Delphis became more paranoid. Having watched Delphis eliminate those close to her, Crae believed that the organization would collapse in time and knew that he would eventually be targeted himself. At some point between the years 3 ABY and 4 ABY, Crae betrayed the Sixth Kin to instead work for the Crimson Dawn criminal syndicate, which, unknown to the galaxy, had made its resurgence under the leadership of Lady Qi'ra. Meeting Qi'ra himself, Crae came to believe that Crimson Dawn would be the future. Crae told stories of his former protégés to Qi'ra, speaking highly of them.\nCrae eventually fled Canto Bight for Crimson Dawn's fortress-flagship Vermillion on Jekara, where the syndicate was hosting an auction for the block of carbonite containing the smuggler Han Solo. After Crae's departure, Delphis, learning of his treachery and his destination, dispatched Lucky and Yu to eliminate the former lieutenant and his point of contact. Despite Lucky questioning the reasoning of Crae's betrayal and Yu's sentimentalism over their past, the two set out to undertake the task.\nOn the Vermillion in the leadup to the auction, Crae met with Xet, a Black Sun operative who was secretly a spy for Crimson Dawn. Xet expressed surprise at Crae having made it safely out of Canto Bight, noting Delphis' attitude. However, their conversation was interrupted by the rogue archaeologist Doctor Chelli Lona Aphra, who, having infiltrated the event with the smuggler Sana Starros, attempted to steal Xet's valuable necklace made of data crystals by spilling her drink on Xet's clothing. Crae watched in silence as Xet stormed off after threatening Aphra and her companion.\nAfter Lucky and Yu arrived at the party, Crae noticed their presence, walking away from the crowd and leading them into an area of backstage hallways as the auction began. When Lucky and Yu followed him, Crae ambushed them from around a corner, greeting his former students and confronting them with an electrostaff. He swung the electrostaff at Yu, who was surprised that he had known he was being followed. Crae acknowledged how much Lucky had grown since they last met, but provoked Yu by saying he had not. While Crae attempted to tell Lucky and Yu that he only wanted to talk, he correctly assumed that the two would not believe him. With his former mentees set on fighting him, Crae leapt at them with his staff, challenging them to show him what they had learned.\nCrae evaded Yu's punches and struck Lucky's sniper rifle with his staff, demonstrating the rifle's vulnerability at a close range. After kicking Lucky into a nearby wall, Crae was attacked by Yu, who grabbed his electrostaff and held it to his neck. Crae overpowered Yu, throwing him on top of Lucky. Ordering his students to stand down, Crae declared that they were outmatched, but the two refused, resuming their fight.\nAs they fought, Crae expressed his disappointment in Lucky and Yu, noting that despite his training, his former students were instead fighting like enemies. Lucky deduced that Crae was working for Crimson Dawn due to his knowledge of the ship's layout, and Yu accused him of betraying both the Sixth Kin and them, saying he thought they had been family. Crae was amused by Yu's untold sentiment before turning around to stop Lucky from reaching for his rifle, pointing out his habit of looking to exploit openings. As Crae dodged a strike from Yu and swung his staff in retaliation, he told his students that while their strengths should complement one another, they were being held back by their weaknesses.\nCrae knocked Yu down, detailing his reasoning for abandoning the Sixth Kin for Crimson Dawn. He extended an offer for Lucky and Yu to join him, hoping to be a family once again. Lucky, aiming his rifle at Crae's back, refused, claiming he already had a family. Crae mentioned Lucky's younger brother and his gambling debts to Delphis, asserting that Delphis would eventually have him killed to keep Lucky in line. Before Lucky could act, the Crimson Dawn assassin Deathstick, who was hiding in wait in the ceiling above them, stepped in, using poison-tipped throwing stars to knock Lucky down and slice his weapon in two. Deathstick told Crae that he was taking too long, and he insisted that he wanted both Lucky and Yu alive. As Yu stepped in front of Lucky, Deathstick suggested killing him, but Crae repeated his demand. Despite her reservations, Deathstick struck Yu with a poison dart, declaring that they would only receive the antidote and survive if they surrendered.\nHaving been defeated, Lucky and Yu were imprisoned within the brig of the Vermillion, where they were joined by Aphra and Starros, who had been caught sneaking around the ship. Accompanied by a Crimson Dawn security droid, Crae visited their cell, stopping Aphra in her attempt to slice the door's control panel. He then turned to his students, asking them whether they had considered his offer and telling them that his boss would not wait much longer. Lucky claimed that they were thinking it over, and Crae turned to leave, stating that the event would soon be over and that he wanted them to accept by that time.\nAphra, devising a plan to escape, attacked Lucky, whose screams alerted Crae. Rushing back to the cell, Crae found himself suddenly turned against by Lucky and Yu. Crae was disappointed, concluding that the two would not accept his offer. Once again, Crae fought with his former students, who were still weakened by their previous injuries, and targeted Yu because of his open wound. Aphra, however, had sliced into the security droid while the three fought; revealing that Yu had been the bait, Aphra turned the droid's cannon on Crae. Holding Yu in front of him, Crae doubted that Aphra would shoot, but the archaeologist declared that she would, having no attachment to Yu. Crae turned to Lucky, assuming he would not let Yu die, but Lucky stated that there was no way to stop Aphra from doing anything.\nAtop the primed security droid, Aphra ordered Crae to tell her where their belongings were, including the necklace that she had successfully stolen from Xet after a second attempt, and how to escape the Vermillion without notice. Instead, Crae told Aphra that it was foolish to think she could escape quietly from Crimson Dawn. At Crae's refusal, Aphra fired the security droid's cannon, ricocheting the beam around the cell to strike Crae in the back. Yu stared at Crae's body, speechless, but Lucky insisted that they needed to escape the cell.\nBelieving Crae to be dead, his protégés fled the prison with Aphra and Starros. However, Crae had survived, pursuing Lucky and Yu. Flanked by Deathstick and several Crimson Dawn enforcers, Crae caught up to his students, who had been abandoned by their brief allies, in a hangar of the Vermillion. Confronting Lucky and Yu, he ordered them to surrender before they worsened their own situation. Qi'ra approached from behind, introducing herself and inviting Lucky and Yu to have a discussion.\nLucky and Yu eventually returned to Canto Bight, speaking to Delphis individually. When Lucky visited Delphis, he claimed that they had killed Crae at the auction as they had been ordered, though Delphis alleged that Yu had told her otherwise.\nCrae was a human male who had brown eyes, light skin, and hair that was gray by the time of his betrayal of the Sixth Kin. Before his betrayal, Crae had been highly loyal to Delphis, with Lucky stating that he used to worship the ground she walked on. He was also close with his students, Lucky and Yu, whom he had trained since they were children, and considered them to be his best work. However, after Delphis' paranoia led her to turn against those close to her, Crae, believing that he could be next and that the Sixth Kin was doomed, abandoned the organization. Crae described Crimson Dawn's leader, Qi'ra, as a visionary; he believed that the syndicate would be the future, hoping that his former mentees would accept his offer of joining him.\nWhen confronted by Lucky and Yu, Crae wished to talk rather than fight; however, with his former students determined on killing him, Crae did not hold back from fighting them. Crae was disappointed when seeing Lucky and Yu's dysfunction in combat, having taught them to fight as a team. Even whilst fighting, Crae pointed out the pair's weaknesses, hoping they would learn to work together.\nAfter Lucky and Yu answered Crae's offer by turning on him in the prison cell as part of Aphra's escape plan, Crae was disappointed, but continued to fight the two, even targeting Yu because of his existing injury. When faced by Aphra and the security droid that she took control of, Crae shielded himself behind Yu, assuming that Aphra would not want to risk shooting him or that Lucky would not let her harm Yu. The incorrect assumption, combined with his confidence in Crimson Dawn, led to his momentary defeat at Aphra's hands.\nA seasoned killer, Crae was a skilled combatant even in his old age. He was able to utilize an electrostaff in hand-to-hand combat, even against two opponents. Crae easily outmatched his former students when facing them aboard the Vermillion, leaping and dodging Yu's strikes as well as disarming Lucky of his sniper rifle. Crae noted Lucky and Yu's strengths and weaknesses while dueling the pair, utilizing their lack of teamwork against them.\nCrae wore a dark gray tunic over a green shirt and dark blue pants, also sporting a brown belt, brown boots, and brown gloves with wrist plating. He also wore a tan cape attached to an armor plate around his shoulders. Crae wielded an electrostaff in combat, and additionally used a similar weapon while training Lucky and Yu.\nGallin Crae first appeared as a hologram in the tenth issue of the comic series Star Wars: Doctor Aphra, which was written by Alyssa Wong, penciled by Ray-Anthony Height, and published by Marvel Comics on May 26, 2021. His forename of Gallin was provided in the series' thirteenth issue, also written by Wong and published on August 25, 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Doctor_Aphra_(2020)_21",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sixth_Kin",
  "/wiki/Crimson_Dawn",
  "/wiki/Lieutenant_(criminal)",
  "/wiki/Wen_Delphis",
  "/wiki/Just_Lucky",
  "/wiki/Ariole_Yu",
  "/wiki/Qi%27ra",
  "/wiki/Death",
  "/wiki/Vermillion_(Crimson_Dawn)",
  "/wiki/Fortress",
  "/wiki/Flagship",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Assassin",
  "/wiki/Deathstick",
  "/wiki/Prison",
  "/wiki/Archaeologist",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Slicer",
  "/wiki/Unidentified_Crimson_Dawn_droid_model",
  "/wiki/Security_droid",
  "/wiki/Cannon",
  "/wiki/Imperial_Era",
  "/wiki/City",
  "/wiki/Canto_Bight",
  "/wiki/Planet",
  "/wiki/Cantonica",
  "/wiki/Standard_year",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/The_galaxy",
  "/wiki/Lord",
  "/wiki/Jekara",
  "/wiki/Xet",
  "/wiki/Black_Sun",
  "/wiki/Spy",
  "/wiki/Sana_Starros",
  "/wiki/Necklace",
  "/wiki/Data_crystal",
  "/wiki/Clothing",
  "/wiki/Electrostaff",
  "/wiki/Staff",
  "/wiki/Sniper_rifle",
  "/wiki/Rifle",
  "/wiki/Pak",
  "/wiki/Gambling",
  "/wiki/Dathomirian_poison",
  "/wiki/Poison",
  "/wiki/Antidote",
  "/wiki/Brig",
  "/wiki/Droid",
  "/wiki/Hangar",
  "/wiki/Hair",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Belt",
  "/wiki/Cape",
  "/wiki/Armor",
  "/wiki/Doctor_Aphra_(2020)_10",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Doctor_Aphra_(2020)",
  "/wiki/Alyssa_Wong",
  "/wiki/Ray-Anthony_Height",
  "/wiki/Marvel_Comics",
  "/wiki/May_26",
  "/wiki/2021",
  "/wiki/Doctor_Aphra_(2020)_13",
  "/wiki/August_25",
  "/wiki/Category:Images_of_Gallin_Crae",
  "/wiki/Doctor_Aphra_(2020)_11",
  "/wiki/Doctor_Aphra_(2020)_12",
  "/wiki/Doctor_Aphra_(2020)_14",
  "/wiki/Doctor_Aphra_(2020)_15",
  "/wiki/Doctor_Aphra_(2020)_16",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}