{
 "name": "Galon Lor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Sith Academy"
     ]
    }
   ]
  }
 ],
 "content": "Galon Lor was a Human male student at the Sith Academy on Korriban during the Jedi Civil War. During his absence from the academy, he was working on translating the ruins of some of the tombs of Korriban. When Revan arrived to enter the Tomb of Ajunta Pall, Galon Lor was polite when he introduced himself to the former Dark Lord and explained about the ruins that the Sith first formed. Galon was quite excited to learn the history as an archaeologist where he wanted to learn about the existence of Ajunta Pall. However, he was too nervous to enter the tomb since it had traps and machines that were still active. When Revan left the tomb with the Sword of Ajunta Pall, Lor asked Revan to tell him who gave it to him. After learning that Revan encountered Ajunta Pall as a spirit, Lor was really interested and went off to inform Master Uthar about the story. It is possible that Galon continued to study and translate the other tombs that he wanted to see while the Sith Academy discovered Revan's treachery over Uthar Wynn's death.\nFor dark side points, it is possible to kill Galon Lor after the Sith Academy realize the player's treachery.\nGalon Lor was voiced by Ethan Phillips, better known for his role as Neelix on Star Trek: Voyager. Phillips also provided additional voices for several other characters throughout the game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Sith/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Korriban",
  "/wiki/Jedi_Civil_War",
  "/wiki/Burial/Legends",
  "/wiki/Tomb_of_Ajunta_Pall",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Archaeology/Legends",
  "/wiki/Ajunta_Pall",
  "/wiki/Sword_of_Ajunta_Pall",
  "/wiki/Force_ghost",
  "/wiki/Uthar_Wynn",
  "/wiki/Ethan_Phillips",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}