{
 "name": "Galus_Vez",
 "display_name": "Galus Vez",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Besalisk"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Galus Vez was a Besalisk starship parts dealer who owned the space outpost Osisis Station during the reign of the Galactic Empire. He often worked with a group of rebels from the planet Lothal, but after Imperial inspections of his facility increased, he no longer wished to be associated with them. Upon the group's next visit to his station, Vez refused to sell them the parts they needed, instead challenging the group's pilot, Hera Syndulla, to a race around his own private course, Fool's Run.\nShould Syndulla win the race, Vez promised to hand over the parts, but should he win, then Vez would take the rebels' ship. Syndulla agreed and managed to beat him in the race, causing the Besalisk to retract his offer and attempt to capture the rebels anyway. Prepared for his betrayal, the group destroyed one of Vez's cargo vessels with explosives and used the distraction to disarm him and take out his men, forcing the Besalisk to hand over what they needed.\nGalus Vez lived during the reign of the Galactic Empire and owned the space facility Osisis Station, which was located in the Regani sector and served as a hangout for local lowlifes. Vez used discrete channels to obtain parts for starships, which he would then sell to those visiting his station. Thousands of visitors also raced Vez on his personal race course, known as Fool's Run, which ran between the asteroids that comprised the nearby planet's rings. Vez won every race, though sometimes with the aid of secret asteroid thrusters he had installed in the course, which he could use to drive asteroids into his opponent's ship. One group he often dealt with was a rebel cell active on the planet Lothal, maintaining a relationship with its members for a long period of time.\nAbout five years before the Battle of Yavin, Imperial inspections of Osisis Station doubled following a visit from the Lothal rebels. Each time the Imperials arrived, Vez had to make sure that no traces of the rebels remained on the station to avoid suspicion. Unaware of the trouble they were causing Vez, the rebels made another trip to Osisis Station following a raid on an Imperial supply yard, during which their ship, the VCX-100 light freighter Ghost, suffered damage. Hoping to buy parts from Vez, the rebels found the doors aboard the station left open, which was unusual for Vez, but continued with the meeting and provided their host with a list of what they needed.\nVez greeted the group but refused their request, informing the rebels of the increased Imperial patrols. He considered handing the group over to the Empire, before thinking better of it and challenging the rebels' pilot, Hera Syndulla, to a race around Fool's Run. If the rebels won, Vez would hand over the supplies, but should he win, the Besalisk would keep the Ghost and the rebels would lose everything. Syndulla accepted, much to the surprise of the rest of her crew, but stipulated that no weaponry was to be used, terms to which Vez agreed.\nVez took to the course in his starship, the Splendour, while Syndulla piloted the Ghost alone with the astromech droid C1-10P. The Besalisk began the race in the lead but was overtaken after Syndulla employed a series of fancy maneuvers. To retake first place, Vez activated his asteroid thrusters, which rammed a large rock into the Ghost and caused the VCX-100's stabilizers to malfunction. Seeing the use of the asteroid thrusters from aboard Osisis Station, the Jedi Kanan Jarrus and his Padawan, Ezra Bridger—two members of Syndulla's crew—used the Force to drive asteroids into Vez's ship to even the odds. After C1-10P boosted the Ghost's engines, Syndulla piloted the damaged ship past the Splendour to claim victory.\nOnce back on the station, Vez reneged on his deal and had his men draw their weapons on the rebels, declaring that he would hand them over to the Imperials. However, before he could act, an explosion rocked the station and distracted the Besalisk, allowing Jarrus to disarm Vez while the other rebels shot his men. With the rebels now in control, Vez was forced to hand over the parts they needed and watch them escape. Once the Ghost was gone, the Besalisk had all footage and evidence of the group's visit edited or destroyed so that the Imperials would find nothing on their next inspections; however, unbeknownst to Vez, Sabine Wren—another of the rebels—had painted the group's starbird insignia on the exterior of the station before leaving.\nDespite a long working relationship with the Lothal rebels, Galus Vez was unwilling to continue business with them after Imperial inspections of his space station increased. However, due to their history together, Vez decided not to hand the rebels over to the Empire as long as they accepted his racing challenge, but he cheated during the race in an attempt to assure his victory.\nAfter losing, the angered Besalisk betrayed the group and tried to capture them, planning to turn them over to the Empire, as he declared he should have done originally. Upon meeting the fourteen-year-old Ezra Bridger for the first time, Vez commented that the rebels must be getting desperate if they were hiring children. Vez was a brown-skinned Besalisk with a brown beard, which he wore tasseled, and yellow eyes.\nGalus Vez used two blaster pistols in combat and piloted the Kom'rk-class fighter/transport Splendour while racing. He wore blue pants and a green jacket, with silver rings in his beard.\nGalus Vez was created for the canon comic story Ring Race, which was written by Martin Fisher and illustrated by Bob Molesworth. The strip was published in the first issue of Star Wars Rebels Magazine, released on January 21, 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Besalisk",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Starship",
  "/wiki/Space_station",
  "/wiki/Osisis_Station",
  "/wiki/Galactic_Empire",
  "/wiki/Spectres",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Pilot",
  "/wiki/Hera_Syndulla",
  "/wiki/Fool%27s_Run",
  "/wiki/Ghost",
  "/wiki/Transport",
  "/wiki/Regani_sector",
  "/wiki/Asteroid",
  "/wiki/Asteroid_thruster",
  "/wiki/Time",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Raid_on_an_Imperial_supply_yard",
  "/wiki/Unidentified_Imperial_supply_yard",
  "/wiki/VCX-100_light_freighter",
  "/wiki/Splendour",
  "/wiki/C1-series_astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Stabilizer",
  "/wiki/Jedi",
  "/wiki/Kanan_Jarrus",
  "/wiki/Padawan",
  "/wiki/Ezra_Bridger",
  "/wiki/The_Force",
  "/wiki/Engine",
  "/wiki/Sabine_Wren",
  "/wiki/Starbird_(symbol)",
  "/wiki/Youngling",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Blaster_pistol",
  "/wiki/Kom%27rk-class_fighter/transport",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ring_Race",
  "/wiki/Martin_Fisher",
  "/wiki/Bob_Molesworth",
  "/wiki/Star_Wars_Rebels_Magazine_1",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/January_21",
  "/wiki/2015",
  "/wiki/Leland_Chee",
  "/wiki/File:Leland_Chee_Canon_Years.png",
  "/wiki/In-universe",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars_Rebels_Season_One",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/The_Lost_Commanders",
  "/wiki/August_31",
  "/wiki/2021"
 ]
}