{
 "name": "Gamine",
 "display_name": "Gamine",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Constancia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Constancian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Flaming orange"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellowish-gold"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Gamine was a telepathic Constancian female who served in the Rebel Alliance during the Galactic Civil War.\nGamine was on her way back home with Luke Skywalker after she discovered a way to save her people from the Empire. Unfortunately, when they popped out of hyperspace, the Imperials blasted their ship, but not before Luke jettisoned C-3PO and R2-D2 where he knew Han would find them.\nWhile Gamine was away, the Empire came to her planet and discovered that the Constancians had telepathic powers. They threatened to destroy their planet if they did not put their ability to their disposal.\nLuke and Gamine escaped the exploding craft in a lifepod. A person named Sharlee who was in Outpost 8 at the time, tractor beamed Luke and Gamine to the Outpost. She agreed to help put Gamine's plan into action.\nWhen Han Solo, Chewbacca, C-3PO, R2-D2, and Gyla Petro landed in Outpost 8, Gamine begged Han to help fight off the Empire. He agreed to help, but only because it was convenient for him. Han and Sharlee took a lifepod and made sure it was boarded by Imperials. Then, they fought them off with battle armor.\nOn the Millennium Falcon, Luke, Gamine, C-3PO, R2-D2, and Gyla fought off the Imperials guarding the planet while Han and Sharlee took a TIE/sa bomber and began to shoot down the rest. Two ships made it past Han and close to the Falcon, but Luke got into Gunport 2 and shot down one while Planetary defenses got the other. Gamine then commented on the hero's welcome she would receive when she got home.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Constancia/Legends",
  "/wiki/Constancian",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Telepathy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Sharlee",
  "/wiki/Outpost_8",
  "/wiki/Chewbacca/Legends",
  "/wiki/Gyla_Petro",
  "/wiki/Battle_armor",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/TIE/sa_bomber/Legends",
  "/wiki/The_Constancia_Affair",
  "/wiki/Star_Wars_Special:_The_Constancia_Affair",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}