{
 "name": "Gammack",
 "display_name": "Gammack",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dac"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Calamari Defense ForceThird Battalion",
      "Third Battalion",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Gammack was a Mon Calamari Captain who served in the Third Battalion during the Battle of Calamari in the Galactic Civil War.\nDuring the battle, Captain Gammack ordered evac shuttles to the frontlines to carry out the wounded before the World Devastators could overrun their positions. He also protested the decision to pull back to a location far from the main battle, but was told it was to avoid getting caught in a wedge formation by the Devastators.\nAfter a brief discussion, he was granted time to send a message to the Republic base on the moon of Da Soocha V. His message was only partially sent, as the World Devastators reached his position before he could finish.\nWhen Lando Calrissian's task force reached Dac, Green Leader contacted Gammack, telling him to prepare his troops for evacuation. Gammack expressed his relief and informed the squadron leader that his battalion was the only unit left in the sector of the battle.\nWhen the Devastators released the TIE/D automated starfighters, he informed Green Leader of the fighters on his tail, but was unable to prevent his death.\nAfter the battle turned against the New Republic, he attempted to shore up his soldiers' remaining Amphibion attack boats for a boarding attempt of the nearest Devastators.\nWhen the ships were affected by the overriding command signal, Gammack's troops boarded the Devastators and fought their way onto their decks, only to be told by the Millennium Falcon to leave the craft as they were about to be destroyed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Calamari_Defense_Force",
  "/wiki/Third_Battalion_(Calamari_Defense_Force)",
  "/wiki/New_Republic/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Battle_of_Calamari",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/World_Devastator",
  "/wiki/Pinnacle_Base",
  "/wiki/Da_Soocha_V",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Green_Leader/Legends",
  "/wiki/TIE/D_automated_starfighter",
  "/wiki/Amphibion",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Dark_Empire_(audio)"
 ]
}