{
 "name": "Gamma Two",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicGamma Squad",
      "Gamma Squad"
     ]
    }
   ]
  }
 ],
 "content": "Gamma Two was a clone commando, who served the Galactic Republic during the Clone Wars.\nGamma Two was a member of Gamma Squad and during the Clone Wars, the squad was sent on a mission to infiltrate a droid factory on the planet Cularin. The clones entered the facility and destroyed all of the droids and defenses surrounding the installation's command center. However, they were unable to enter the command center because their explosives weren't powerful enough to destroy the center's blast doors. Gamma One, the squad's commander, ordered Gamma Two and Gamma Five to try and slice the door open, while the other clone covered them.\nTwo and Five began ripping open the metal walls of the factory corridor, in an attempt to slice the doors open. However, five minutes later, they still hadn't got the doors open when some droids arrived, opening fire on the commandos. Gamma One destroyed the droids with a grenade and shortly afterward, Two and Five finally got the doors open. The clones attacked the droids inside the command center and one of the droids slashed at Two's head, piercing his helmet and scarring him. Five then used the facility's communications array to send out a coded signal that placed all of the droids ever produced in the facility under covert Republic control. Gamma One then ordered Gamma Two and the rest of the squad to return to their transport.\nGamma Four, another member of Gamma Squad, later commented that Gamma Two's scar made him look \"all tough and masculine\".",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Gamma_Squad_(Galactic_Republic)",
  "/wiki/Clone_commando/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Mission_to_Cularin",
  "/wiki/Droid/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Blast_door/Legends",
  "/wiki/Gamma_One",
  "/wiki/Gamma_Five",
  "/wiki/Grenade/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Gamma_Four",
  "/wiki/Wizards.com",
  "/wiki/Closed_Circuits"
 ]
}