{
 "name": "Gamut_Key",
 "display_name": "Gamut Key",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kaller"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kalleran"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Gamut Key was a Kalleran who lived on the planet Kaller during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems.\nDuring the Clone Wars, the Confederacy of Independent Systems took control of the planet Kaller and began imposing on Kalleran villages for supplies and labor, with Separatist General Kleeve and his staff billeting on the world at Key's expense. The Galactic Republic then fought for control of Kaller, and, under the leadership of Jedi Master Depa Billaba and Padawan Caleb Dume, were able to defeat the Separatist forces. Gamut Key and Kleeve viewed the final moments of the battle together, before the General informed Key that he was leaving and escaped in his Separatist command shuttle.\nAfter the battle's end, Billaba and Dume, along with two clone troopers, visited Key and informed the Kalleran that the Separatists would no longer trouble. Key suspected life under the Republic would be no different to life under the Separatists, a point which another Kalleran made clear to the Jedi. Dume became angry at the comparison, but Billaba remained calm and informed Key she and her men would sleep in the fields nearby, meaning they would not being billeting at the Kallerans' expense.\nFollowing Order 66, Key caught smuggler Janus Kasmir and his partner, former Jedi Padawan Caleb Dume, stealing IG-RM droids from him. However he spared Kasmir when he revealed Dume was a Jedi. Key recognized Dume, but saw that he looked different. He then took to a cell and contacted Commander Grey and Captain Styles to identify him. Key then left Dume alone to make his peace. He then attempted to stop Kasmir and his droids from rescuing Dume, but failed. Key was then named provincial Governor of Kaller and given full Imperial authority.\n14 years later, Key was then tipped off about a drop point for smuggler. He and his found a group of \"smugglers\" with empty crates. His men then searched their ship, but found nothing. Key then found Kanan Jarrus in a warehouse following a fight with Tápusk and his men.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Kanan_Book_I:_The_Last_Padawan",
  "/wiki/Kaller",
  "/wiki/Kalleran",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Planet",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/General",
  "/wiki/Kleeve",
  "/wiki/Conquest_of_Kaller",
  "/wiki/Jedi_Master",
  "/wiki/Depa_Billaba",
  "/wiki/Padawan",
  "/wiki/Kanan_Jarrus",
  "/wiki/Separatist_command_shuttle",
  "/wiki/Clone_trooper",
  "/wiki/Janus_Kasmir",
  "/wiki/Jedi",
  "/wiki/Order_66",
  "/wiki/IG-RM_bodyguard_and_enforcer_droid",
  "/wiki/CC-10/994",
  "/wiki/Styles",
  "/wiki/Spectres",
  "/wiki/Ghost",
  "/wiki/T%C3%A1pusk",
  "/wiki/Kanan_1",
  "/wiki/Kanan_3",
  "/wiki/Kanan_4",
  "/wiki/Kanan_6",
  "/wiki/Kanan_12",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_69",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Fugitives_and_Collaborators_Squadron_Pack"
 ]
}