{
 "name": "Gana Lavin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Gana Lavin was a Human female who grew up in the Upper City of Taris. In 3956 BBY, she ordered drinks at the Upper City Cantina with a friend. When her order was delayed, she mistook Revan, a Galactic Republic soldier, for a waiter. This sparked a short argument that ended when her drinks finally arrived.\nGana Lavin was a Human female from the Outer Rim city world of Taris. She grew up in the luxury of the Upper City, and her actions led many to consider her spoiled. She would occasionally use enforcers employed by her father to harass others. She continued to live on Taris during the Jedi Civil War between the Galactic Republic and the Sith Empire, who had occupied and blockaded the planet. In 3956 BBY, shortly after the attack on the Republic Hammerhead-class cruiser Endar Spire above the planet, Lavin was present in the Upper City Cantina, buying drinks for herself and a noble.\nFormer Dark Lord of the Sith Revan, who had lost his memory and believed himself to be a Republic soldier, entered the cantina after surviving the battle overhead. Despite ordering the drinks some time before, Lavin and the noble had not yet received them. When Revan approached Lavin, she mistakenly believed him to be a waiter, insulting his choice of clothing and demanding to know why her order had not yet arrived.\nRevan apologized and attempted to explain that he was not an employee of the cantina, but Lavin refused to listen and threatened to use her father's influence to have Revan fired. Revan persuaded her not to become upset and agreed to bring Lavin her order. At that point, a waiter arrived bearing Lavin's and the noble's drinks, defusing the situation and allowing Revan to leave.\nGana Lavin was a Human female with brown eyes, brown hair, and light skin. When Lavin's drink order at the Upper City Cantina was late, she grew impatient and called the cantina staff incompetent. Lavin bluntly expressed her dislike of Revan's clothing and insulted him. She often relied on her father's power, threatening Revan's job when she believed he was a waiter. She was considered by many to be a spoiled brat and often used her father's enforcers to rough up those she met.\nLavin wore a beige and yellow tunic with grey pants, brown gloves and boots, and a beige utility belt.\nLavin first appeared as a non-player character in the 2003 video game Star Wars: Knights of the Old Republic, developed by BioWare. Interactions with her are optional and do not progress any plot, quest, or change the player's alignment.\nThe player may avoid talking to Lavin completely and will never encounter her or her enforcers. During the initial encounter, if the Republic Soldier Carth Onasi is in the player's party, he will warn Revan to be careful with their words, feeling like it might result in trouble if he said something wrong.\nIf the player decides to interact with her, they have several dialogue choices. If the player fails to persuade Lavin or chooses any other dialogue option, she will run out of the cantina and claim that she will speak to her father. When the player leaves that cantina, they will be confronted by Lavin and two vibroblade-wielding Rodian thugs near Kebla Yurt's Equipment Emporium. After the player defeats the thugs, Lavin will yell for her \"Daddy\" and run away. During this encounter, Lavin is portrayed with black hair and a different face model.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Taris/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Upper_City",
  "/wiki/3956_BBY",
  "/wiki/Upper_City_Cantina",
  "/wiki/Revan/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Waiter/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Ecumenopolis/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Gana_Lavin%27s_father",
  "/wiki/Jedi_Civil_War",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Blockade/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Attack_on_the_Endar_Spire",
  "/wiki/Hammerhead-class_cruiser",
  "/wiki/Endar_Spire",
  "/wiki/Noble/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Amnesia/Legends",
  "/wiki/Republic_soldier",
  "/wiki/Cantina/Legends",
  "/wiki/Time/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Unidentified_Human_waiter",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Utility_belt/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Carth_Onasi",
  "/wiki/Vibroblade/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Kebla_Yurt%27s_Equipment_Emporium",
  "/wiki/Category:Images_of_Gana_Lavin",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas"
 ]
}