{
 "name": "Gandin_T%27Noull",
 "display_name": "Gandin T'Noull",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ace Entertainment Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Gandin T'Noull was a Human male who served as the manager of the Ace of Sabres during the Galactic Civil War. He was a slick smooth businessman able to talk fast and often without saying anything of real substance.\nGandin started out as a used landspeeder dealer. It was rumored that he tricked the owner into signing over the business to him after only two weeks. He ran countless confidence schemes, often defrauding entire communities before they even realized it and before they could stop him he skipped town with all his ill-gotten gains.\nAfter years of being a con artist he decided to move on to more legitimate ways of conning people and attended Savvlock's School of Big Business where he \"earned\" his business degree. He plunged into the markets and managed many small companies where he increased their profits and skimmed off the top for himself. He attracted the attention of the owner of the Ace of Sabres and was quickly hired to manage the place.\nHe proved to be extremely successful at running the Ace of Sabres casino so the owners, the Ace Entertainment Corporation, gave him tremendous freedom in running the day-to-day operations of the casino.\nA con artist to whom lying was far easier to tell the truth, Gandin would say anything to seal a deal. He was a true professional when it came to lying, cheating and swindling. One quirk he had was that he was obsessed with having an immaculate appearance and he believed that looking successful was half the con.\nGandin was a middle-aged Human male. He wore his black hair smartly cut and had a perfectly trimmed goatee. He was obsessed with having an immaculate image of being successful.\nGandin was highly skilled at fast talking, being able to outbargain and con even the best of marks. Despite getting his degree at a less-than-reputable university he was a genius at business and economics. In addition he was skilled at gambling and had tremendous knowledge of black market dealings. Finally if a deal went sour he was very quick with his hold-out blaster.\nBesides expensive clothes and a jeweled chronometer, Gandin carried a voice-locked datapad and had two customized hold-out blasters hidden on him. The blasters were modified to be more powerful than regular hold-out blasters.\nGandin T'Noull was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997.\nHe was designed to be the frontman and friendly face of the Ace of Sabres casino.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Ace_Entertainment_Corporation",
  "/wiki/Ace_of_Sabres",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Landspeeder/Legends",
  "/wiki/Savvlock%27s_School_of_Big_Business",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Chronometer/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997"
 ]
}