{
 "name": "Ganda Kaitoova",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Ganda Kaitoova was a green-skinned, gray-eyed male Twi'lek who lived in the City of Anchorhead on the Outer Rim desert world of Tatooine during the Jedi Civil War. He was a fan of the swoop races, and visited a swoop track owned by Motta the Hutt.\nIn 3956 BBY, Revan visited Tatooine during his search for the ancient Rakatan Star Maps. During his time on the planet, he visited the swoop track that Kaitoova frequented. After several races, Revan became the new champion of the track, dethroning Zoriis Bafka. Kaitoova waited outside the track, and when Revan emerged, he approached the new champion and asked for his autoprint. Initially, Revan was confused, but agreed to give his autoprint to Kaitoova. He thanked Revan, and told him that they would see eachother again. Despite this, Kaitoova did not speak to Revan again during his time on Tatooine.\nGanda Kaitoova appeared as a non-player character in the 2003 roleplaying game Star Wars: Knights of the Old Republic. He appears only in a cutscene, which will always be triggered if the player becomes the Tatooine swoop champion. There are multiple dialogue options within the cutscene, although none of them change alignment, and the player can refuse to give out an autoprint. If the player does not become the champion, then Kaitoova is not present in any capacity.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/City/Legends",
  "/wiki/Anchorhead/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Swoop_racing/Legends",
  "/wiki/Motta",
  "/wiki/Hutt/Legends",
  "/wiki/Canon",
  "/wiki/3956_BBY",
  "/wiki/Revan/Legends",
  "/wiki/Search_for_the_Star_Maps",
  "/wiki/Rakata/Legends",
  "/wiki/Star_Map",
  "/wiki/Time/Legends",
  "/wiki/Swoop_track",
  "/wiki/Zoriis_Bafka",
  "/wiki/Autoprint",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/2003",
  "/wiki/Roleplaying_game",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/StarWars.com"
 ]
}