{
 "name": "Ganne",
 "display_name": "Ganne",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "32 BBY",
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ankura Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gungan society",
      "Rellias",
      "Rellias"
     ]
    }
   ]
  }
 ],
 "content": "Ganne was the Ankura Gungan Boss of Rellias city during the Battle of Naboo.\nGanne was a green-skinned male Ankura Gungan born on Naboo and as of 32 BBY, the Boss of the city of Rellias. That year, after the invasion of Naboo's capital, Theed, a captured marine from Harte Secur told the Trade Federation of a savage tribe on Naboo known as the Gungans. Trade Federation Viceroy Nute Gunray sent battle droid commander OOM-9 to pacify the Gungans. Darth Sidious, the Dark Lord of the Sith, sent his Sith apprentice, Darth Maul, to assist OOM-9.\nAs the Trade Federation's Droid Army drew closer to Ganne's city they found a hidden Gungan farming base. Maul laughed as they destroyed the base and left nothing but rubble, and continued the mission. The droids eventually found Rellias and destroyed it. The last building left standing was the command center, and when the Trade Federation destroyed it, they found Boss Ganne in the building, atop his kaadu. When Maul ordered Ganne to lead them to the Rellias Straits, the Boss refused. Darth Maul used a mind trick on Ganne, who then led the Federation army to Rellias. As they reached Rellias, there were several gates blocking the way. Maul used another mind trick on Ganne, who opened the gates and led the army to the Rellias channel.\nWhen the the Federation forces reached Lake Paonga, Maul tied Ganne to the front of the S-DST to prevent other Gungan forces from attacking the craft. After Otoh Gunga was found abandoned, Maul used his lightsaber to torture the Boss to discover where the other Gungans were hiding. Although Ganne gave up the information, Maul thought that his resistance showed honor. After his death, Maul pushed the Ankura Gungan's blistered body into the lake.\nGanne was voiced by Neil Kaplan in the during a mission 2001 video game Star Wars: Galactic Battlegrounds. The campaign was later included in the game's 2002 expansion pack, Star Wars: Galactic Battlegrounds: Clone Campaigns. In the mission, the Trade Federation army may destroy a small Gungan farming settlement or leave it. This article assumes 100% completion of bonus objectives. Ganne also appeared in the 2012 short story \"End Game,\" written by James Luceno and included in the re-release of the Star Wars: Episode I The Phantom Menace novelization.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Ankura/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Gungan_society",
  "/wiki/Rellias",
  "/wiki/Boss/Legends",
  "/wiki/City/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Fall_of_Theed",
  "/wiki/Capital/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Marine",
  "/wiki/Harte_Secur",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Trade_Federation_Viceroy",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Commander/Legends",
  "/wiki/OOM-9/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Canon",
  "/wiki/Trade_Federation_Droid_Army/Legends",
  "/wiki/Farm/Legends",
  "/wiki/Command_center",
  "/wiki/Kaadu/Legends",
  "/wiki/Rellias_Straits",
  "/wiki/Mind_trick/Legends",
  "/wiki/Lake_Paonga/Legends",
  "/wiki/S-DST",
  "/wiki/Otoh_Gunga/Legends",
  "/wiki/Darth_Maul%27s_lightsaber",
  "/wiki/Torture/Legends",
  "/wiki/Neil_Kaplan",
  "/wiki/2001",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/2002",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/2012",
  "/wiki/End_Game",
  "/wiki/James_Luceno",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}