{
 "name": "Ganodi",
 "display_name": "Ganodi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.19 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "A clan",
      "A clan"
     ]
    }
   ]
  }
 ],
 "content": "Ganodi was a female Rodian Jedi initiate during the Clone Wars. She attended a Gathering on Ilum, where, along with other Jedi initiates, she would find her lightsaber crystal in Ilum's Crystal Caves. After they found their crystals, they boarded the Crucible to fashion their lightsabers under the guidance of Huyang.\nAs the younglings were assembling their lightsabers, Weequay pirates boarded their ship. Under the supervision of Padawan Ahsoka Tano, Ganodi accompanied Zatt to secure the cockpit with R2-D2. When pirates captured Tano, Ganodi, and the other initiates went on a rescue mission to save her, following the pirates to the planet Florrum.\nWhile the other younglings plotted a heist to free Tano from the pirate base, Ganodi stayed with R2-D2 to work on repairing their ship. When the younglings attempted to leave the planet, Ganodi and the others faced the cyborg Jedi killer and Separatist leader General Grievous, proving herself to be a brave young Jedi.\nGanodi was sent to Ilum along with the other members of her clan to attend at their Gathering. Escorted by Padawan Ahsoka Tano, they arrived on Ilum and used the Force to open the portal of the planet's Jedi Temple, discovering Jedi Master Yoda sitting inside waiting for them. Yoda told them to go inside of the Crystal Cave, the deepest part of the temple, to find their kyber crystals, which were necessary for Ganodi and the other younglings to construct their own first personal lightsabers. Ahsoka informed that they had to locate their crystals before the cave's ice door closed at the end of the daytime, blocking them inside for an entire rotation. Inside the cave, Ganodi, despite being opposed to Katooni's idea to split up, decided to follow the path her instinct advised. She was accompanied by Gungi until he found his crystal. Ganodi continued on but grew impatient, starting to complain about not finding her crystal, until she fell into another, smaller cavern filled with shining objects, similar to crystals. She fell into despair as she couldn't understand which one was hers, but, after a moment of resolution, she used the Force to find her crystal, which flew directly in her hand. She exited the Crystal Cave, and waited along with Byph, Zatt, and Gungi for the return of the remaining younglings, Petro and Katooni. After they returned, Yoda told them to return to Jedi Temple on Coruscant.\nOn their way to Coruscant aboard the Paladin-class corvette the Crucible, Ganodi and her fellow younglings met Professor Huyang, who then assisted them in the creation of their own lightsabers. Ganodi, contemptuously, pointed out he was a droid and responded he had taught many Jedi before her and would teach many Jedi after her. While the younglings were building their lightsabers, the Crucible was attacked by the pirate Hondo Ohnaka and his crew in their ship, the Acushnet. Professor Huyang asked the younglings to give him their crystals to hide them, and Ganodi obeyed along with others, except for Petro, who kept the crystal with him. Then they went into hiding in the ventilation system as Ahsoka told them to split up. Ganodi went with Zatt to the cockpit and found the astromech droid R2-D2, who they were instructed to help keep safe. A pirate tried to enter in the room, but R2 managed to knock him down. Tano managed to force the pirates out of the ship through a vacuum caused by the Crucible breaking away from the pirates' ship, but she was sucked out too and captured by the pirates.\nShortly after the pirate attack, the younglings managed to contact Jedi General Obi-Wan Kenobi to inform him of the status of their ship and Ahsoka's abduction. Kenobi promised to send help and to take care of Ahsoka's rescue and told the children to stay safe and not to attempt the rescue themselves. Shortly after, Ganodi and Zatt warned their friends that the filtering system was broken, meaning that if they did not land the ship will explode. Petro then convinced the others to land on Florrum and go save Ahsoka themselves.\nGanodi successfully landed the Crucible in a valley. About to leave to rescue Ahsoka, Petro told Ganodi to stay with the ship. Ganodi retorted that he was not the leader of the group, but once Petro brought up her flight simulator training at the Jedi Temple, Ganodi agreed with his plan, staying onboard and ready to make a quick evacuation if the group needed her. The next day, Ganodi finished reassembling Huyang's decapitated head on his body before receiving an emergency call from Petro. Ganodi was excited to hear Ahsoka's voice, who prompted her to turn on the engines and fly to her precise coordinates. Flying over the speeder tank in which her friends were being chased by three pirates, Ganodi and Huyang made their way to the ramp while R2 held the ship steady. The Rodian only managed to grab Byph when the speeder swerved sharply, causing the two vehicles to separate. Gungi leapt towards the ship as well as was caught by Ganodi, who continued to hold the Ithorian and the Wookiee as the remaining Jedi tried to steer the tank back towards the ship. However, the pirates shot one of the Crucible's engines, causing multiple explosions and forcing Ganodi, Huyang, and R2 to abandon ship. They landed on the speeder, where they were all violently knocked down as the Crucible crashed into them. The pirates then captured the group.\nHandcuffed and taken away by the pirates with her friends, Ganodi unsuccessfully tried to free herself by shaking her handcuffs, moments before battle droids led by Grievous invaded the pirate base. As the base was being looted, Ahsoka convinced their captors that they needed to work together against the Separatists, prompting Gwarm to reluctantly free them. The group snuck into the base through a diversion from R2 and fought their way to the cell where Ohnaka was being held prisoner. Ohnaka told the group that he had a private fleet that would allow them to escape from Florrum. Ohnaka asked the younglings to show him their lightsabers, and Ganodi successfully ignited her green lightsaber and congratulates Katooni as the Tholothian youngling finally completed hers.\nAfterwards, the young Jedi and the freed pirates launched an assault on the droids to reach the transport vehicles, with the Jedi riding in the speeder tank with R2 piloting. Pursued by Grievous into a gorge, Ganodi and the others were separated from the pirates and soon accosted by the vicious General until R2 drove the tank up the side of and out of the gorge, crashing but evading Grievous. Grievous returned to fight, and Ganodi ignited her lightsaber with her friends, ready to defend themselves. Just then, Katooni arrived aboard Slave I and Ahsoka ordered the children to board right away while she held off Grievous.\nReturning to Kenobi's cruiser, the Jedi Master was delighted to see Ahsoka and the younglings safe and sound. Huyang began to compare their adventure with the time when Yoda went in search of his kyber crystal, much to Ganodi's fascination. Kenobi declared that story would be for another time because the younglings can already consider themselves proud to have endured such an ordeal at their ages. He then welcomed them into the Jedi Order.\nAs Ganodi and her comrades practiced their lightsaber skills with Tera Sinube outside the Jedi Temple, they witnessed the clash between Anakin Skywalker and the traitorous Jedi Barriss Offee. The younglings stood at a distance as Anakin got the upper hand and finally subdued Offee.\nGanodi used a green-bladed lightsaber, which was constructed by her on the Crucible.\nGanodi first appeared in the Star Wars: The Clone Wars episode \"The Gathering,\" the sixth episode of the fifth season of the show. She was voiced by Georgina Cordova.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ganodi",
  "/wiki/Ganodi/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/Rodia",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Unidentified_Clan_(The_Gathering)",
  "/wiki/Jedi",
  "/wiki/Youngling",
  "/wiki/Clone_Wars",
  "/wiki/The_Gathering",
  "/wiki/Ilum",
  "/wiki/Kyber_crystal",
  "/wiki/Crystal_Caves",
  "/wiki/Crucible",
  "/wiki/Huyang",
  "/wiki/Weequay",
  "/wiki/Pirate",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Zatt",
  "/wiki/R2-D2",
  "/wiki/Rescue_on_Florrum",
  "/wiki/Florrum",
  "/wiki/Cyborg",
  "/wiki/Jedi_hunter",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/The_Force",
  "/wiki/Jedi_Temple_(Ilum)",
  "/wiki/Jedi_Master",
  "/wiki/Yoda",
  "/wiki/Crystal_Cave",
  "/wiki/Jedi_Initiate",
  "/wiki/Lightsaber",
  "/wiki/Katooni",
  "/wiki/Gungi",
  "/wiki/Hand",
  "/wiki/Byph",
  "/wiki/Petro",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant",
  "/wiki/Paladin-class_corvette",
  "/wiki/Professor",
  "/wiki/Droid",
  "/wiki/Raid_on_the_Crucible",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Ohnaka_Gang",
  "/wiki/Acushnet",
  "/wiki/Astromech_droid",
  "/wiki/Unidentified_Weequay_pirate_(Crucible)",
  "/wiki/Vacuum",
  "/wiki/Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/WLO-5_battle_tank",
  "/wiki/Ithorian",
  "/wiki/Wookiee",
  "/wiki/Battle_droid",
  "/wiki/Gwarm",
  "/wiki/Tholothian",
  "/wiki/Slave_I",
  "/wiki/Tera_Sinube",
  "/wiki/Anakin_Skywalker",
  "/wiki/Barriss_Offee",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Gathering_(episode)",
  "/wiki/The_Clone_Wars:_Season_Five",
  "/wiki/Georgina_Cordova",
  "/wiki/A_Test_of_Strength",
  "/wiki/Bound_for_Rescue",
  "/wiki/A_Necessary_Bond",
  "/wiki/Almost_a_Jedi",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Destiny_(episode)",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Ahsoka_(audiobook)",
  "/wiki/Pirate%27s_Price",
  "/wiki/Pirate%27s_Price_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_72",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Convergence_(Star_Wars:_Destiny)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)"
 ]
}