{
 "name": "Gaor_Tembon",
 "display_name": "Gaor Tembon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sullust"
     ]
    },
    {
     "name": "Born",
     "values": [
      "39 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    }
   ]
  }
 ],
 "content": "Gaor Tembon was a Sullustan smuggler who operated in the Borderland Regions during the first years of the New Republic. His base of operations was in the Nexer system and he traveled in Nestt-class freighter called the Miv'rah Firestorm.\nGaor Tembon was born on the planet Sullust in 39 BBY. A renowned smuggler in the Borderland Regions, Tembon was never captured by any authorities, although several operatives of his were. The Sullustan had a reputation for never refusing a customer or cargo, including the transportation of slaves. Tembon was popular with several organizations, including the Riders of the Maelstrom, the Galactic Empire, and criminal organizations including Hutt kajidics.\nThe operatives captured by the New Republic indicated that Tembon had a change of heart, and was willing to cut of all ties to the Empire and to no longer transport slave cargo. The change in attitude was reportedly due to the Empire's attempts to forcibly acquire some of his starships, a move that infuriated Tembon. While the New Republic considered the information suspect, the information from Tembon's operatives indicated that he was operating out of the Nexer system. The New Republic posted a reward for Tembon's capture; 30,000 credits on the charges of smuggling, transportation of slaves, conspiracy to deprive sapients of their freedom, and manslaughter.\nGaor Tembon was a Sullustan male who stood 1.7 meters tall. He was an effective con man, shrewd bargainer, and gambler.\nTembon was skilled in the use of a blaster, melee weapons, and stealth techniques. He had knowledge of bureaucratic procedures, languages, and planetary systems, and a number of underworld contacts. Tembon was a pilot, adept at flying starfighters and smaller vessels, navigating through hyperspace, and operating starship weapons and deflector shields. He was also adept at repairing starfighters and bypassing security systems.\nTembon was armed with a blaster pistol, and owned a highly modified Nestt-class light freighter named the Miv'rah Firestorm. It had concealed quad laser cannons.\nGaor Tembon was profiled in Wanted by Cracken, published by West End Games in 1993 for use with Star Wars: The Roleplaying Game. Mike Jackson provided Tembon's illustration.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullust/Legends",
  "/wiki/39_BBY/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Trans-Hydian",
  "/wiki/New_Republic/Legends",
  "/wiki/Nexer_system",
  "/wiki/Nestt-class_light_freighter",
  "/wiki/Miv%27rah_Firestorm",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Riders_of_the_Maelstrom",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Kajidic/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Gambler/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Quad_laser_cannon/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/West_End_Games",
  "/wiki/1993",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Mike_Jackson",
  "/wiki/Ya_Never_Can_Tell_%E2%80%A6",
  "/wiki/Galaxy_Guide_10:_Bounty_Hunters"
 ]
}