{
 "name": "Gar_(Dantooine)",
 "display_name": "Gar  (Dantooine)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dantooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Gar was a Human farmer on Dantooine.\nGar and his wife Rilka owned one of the northern farms on the vicinity of the Jedi Enclave. He was friendly to the Jedi, but impatient with their inaction when it came to defending the Dantooinian farmers. Because of the increasing hostility of the native kath hounds and attacks by Mandalorian raiders, Gar finally set out to present a petition personally at the Enclave, entreating the Jedi to deal with both problems.\nIt is possible that he met Revan during his time on Dantooine outside the Jedi Enclave.\nGar was a sensible person, treating the Jedi with respect and kindness. While impatient for the Council to take action, he did think about nearly every context of the situation such as Darth Malak's attempts to exterminate the Jedi. When Gar told Revan about what happened to Jon's daughter Ilsa, and Canderous Ordo commented that Jon should have protected her better, Gar reacted angrily, calling Ordo a beast.\nOn the Xbox version of Star Wars: Knights of the Old Republic, Gar appears as an old, gray haired man, yet on the PC version, he appears as a younger, red headed man.\nThe player has the option of telling Gar that the Jedi Council has sent for him. This option will result in no alignment change, and Gar will not be seen afterwards.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/May_the_Force_be_with_you/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Farmer/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Rilka",
  "/wiki/Jedi_Enclave",
  "/wiki/Jedi/Legends",
  "/wiki/Kath_hound/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Jon_(farmer)",
  "/wiki/Ilsa",
  "/wiki/Canderous_Ordo",
  "/wiki/Xbox",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Personal_computer"
 ]
}