{
 "name": "Garfield",
 "display_name": "Garfield",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dathomirian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Roan Novachez"
     ]
    }
   ]
  }
 ],
 "content": "Mr. Garfield was a male Dathomirian Jedi Master serving as an instructor at the Jedi academy at the Jedi Temple on Coruscant during Roan Novachez's time of attendance there. Mr. Garfield was a skilled Jedi, adept in lightsaber construction, lightsaber combat and the piloting of starfighters. He taught courses in these subjects to students at the academy and demanded a high level of performance, and also oversaw extracurricular activities involving lightsaber combat. He also taught extracurricular home economics, but in Roan's second year was replaced in this subject area by the chef Gammy, who taught this as a regular subject.\nMr. Garfield's personality was somewhat cruel and sarcastic at times, and Roan came to believe that he had it in for him, even before classes officially started. He often criticized Roan's answers in class and marked him low on papers and examinations for reasons that Roan didn't believe were fair. Despite this, Roan still achieved passing marks in all of Mr. Garfield's courses, ranging from A to C+, though in at least one instance, Mr. Garfield initially gave a mark of C-, but was persuaded by Jedi Grand Master Yoda to change it. At the end of his second year at the Jedi academy, Roan was horrified to learn that Mr. Garfield had been assigned as his personal Jedi Master and he was to train the next term as his apprentice. He displayed a soft side at the school's Satine Hawkins dance, dancing with the Wookiee gym teacher Kitmum, though he seemed reluctant to accept at first. As Novachez progressed under Mr. Garfield, he began to show recognition of Novachez's skills, and it became evident that he was pushing his student to show his best effort.\nMr. Garfield's personality was inspired by the character of Severus Snape from the Harry Potter book series, but also in large part by a teacher of Jedi Academy series author Jeffrey Brown named Mr. H. who was stern and had a dry sense of humor. His criticisms of Brown's artwork were often a deflation to his ego, but at times would have a big smile upon seeing his artwork. The character's name is a tribute to Garfield, the titular cat of the comic Garfield, written and drawn by Jim Davis.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Dathomirian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color",
  "/wiki/Tattoo/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Roan_Novachez",
  "/wiki/Blue_Leader/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Chef/Legends",
  "/wiki/Gammy",
  "/wiki/Jedi_Grand_Master",
  "/wiki/Yoda/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Satine_Hawkins_dance",
  "/wiki/Wookiee/Legends",
  "/wiki/Kitmum",
  "/wiki/Jedi_Academy_(novel)",
  "/wiki/Jeffrey_Brown",
  "/wiki/Jedi_Academy:_Return_of_the_Padawan",
  "/wiki/Jedi_Academy:_The_Phantom_Bully",
  "/wiki/Jedi_Academy:_Attack_of_the_Journal",
  "/wiki/Wookieepedia:Interview/Jeffrey_Brown"
 ]
}