{
 "name": "Garindan ezz Zavor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kubindi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kubaz"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.85 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Garindan ezz Zavor's clan",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Garindan ezz Zavor, sometimes referred to as Long Snoot, was a male Kubaz who had been forced to work as a spy for the Galactic Empire. In private, Garindan loathed his Imperial overlords and sought to return to his clan and free his homeworld of Kubindi from Imperial rule. Prior to the Battle of Yavin, Garindan received news that his family was in danger. In an attempt to buy passage home, Garindan provided information about the location of Obi-Wan Kenobi, Luke Skywalker, C-3PO, and R2-D2 to the Galactic Empire during a battle on the desert world of Tatooine. Despite the failure of that job, Garindan accepted another job to help Derrida the Ketton spy on the Rebel Alliance.\nBorn on the planet Kubindi, Garindan ezz Zavor came from a respectable Kubaz clan that was known for breeding and farming a sought-after strain of succulent picolet beetles. He had a wife and several children who were well-known senators, orators, and artists. Garindan also had at least one daughter. He also had several grandchildren who attended creches and academies.\nDuring the Imperial Era, the Galactic Empire used polished protocol droids to win over the Kubaz elders and lead the people into the belly of their grand vessel. Garindan was one of the chosen students picked from his academy to study under the Empire as a diplomat and return to his mate and hive with new accolades. However, Garindan and his fellow students were instead indentured and forcibly trained as spies. The Empire wanted to exploit the Kubaz for their ability to read body languages, smell pheromones and weapons, and to hear long distances. Garindan and the other students were put in manacles and forced to endure propaganda, indoctrination, and brainwashing.\nDisillusioned with the Empire, Garindan slipped away while on a job and attempted to return to Kubindi, only to find its orbit guarded by Imperial firepower. Unable to return to his homeworld, Garindan spend the next several years working as a spy in order to raise the necessary credits to hire a ship to travel back to Kubindi. Garindan also accumulated a datapad with the most current information, diagrams, and manuals on advanced technology and hyperspace travel. Garindan was determined to reveal the truth of the Empire's \"exploitation\" to his people and provide them with the necessary technology to claim their right to self determination.\nDuring the early stages of the Galactic Civil War, Garindan was stationed in the port city of Mos Eisley on the desert world of Tatooine. Garindan dwelled in a hovel that had previously served as a stable for livestock. He hated Tatooine, regarding the planet as a barren world bereft of arts, decorum, and education. Garindan encountered xenophobic hostility from the local human population, who regarded him as an unscrupulous spy. On one occasion, Garindan stole a leather bag of credits belonging to a human man who had insulted him.\nAround the time of Princess Leia Organa's secret mission to Tatooine, Garindan received a garbled comm message from Kubindi. Having not heard his own language for years, Garindan paid the robed female emissary all the money in his account. Garindan learned from his daughter that his wife was dead and that the family was in trouble. With his family in danger, Garindan resolved to take on a job and earn enough money to hire a ship to return to Kubindi.\nUsing his spy network, Garindan arranged for his human informant to supply the codes that he needed to return home. The informant told Garindan that the codes would last for a few days and advised him not to hire a rebel ship. Embarking on his mission to get home, Garindan accepted a job from the Empire to search for two droids, C-3PO and R2-D2, who had escaped from Imperial forces during a battle in orbit. The search was primarily to find the stolen plans for the Death Star, which R2-D2 was carrying for the Rebel Alliance. The droids were under the protection of Obi-Wan Kenobi and Luke Skywalker.\nGarindan waited in Chalmun's Spaceport Cantina listening for any chatter related to the fugitive droids. He smelled the scent of Skywalker's X-34 landspeeder. Garindan overheard Ponda Baba and Cornelius Evazan fighting with Kenobi with the former losing his arm to Kenobi's lightsaber. Garindan also overheard Kenobi and Skywalker negotiating passage to Alderaan with the ship's captain, Han Solo, and its co-pilot, Chewbacca. While waiting in the dark corner between the cantina and Solo's starship, the Millennium Falcon, in Docking Bay 94, Garindan caught sight of the men walking with the two fugitive droids.\nThe Kubaz promptly informed Imperial stormtroopers that the droids were at Docking Bay 94 in Mos Eisley's spaceport. Confident that he would be paid for his work, Garindan ordered a second drink at Chalmn's Cantina and conversed with the Devaronian Labria. Garindan was dismayed when he received a message on his datapad that the bounty had been forfeited since the droids had escaped. However, Labria then offered Garindan a job on behalf of Derrida the Ketton, who needed a companion for a job that night. Labria explained that this job was against the Alliance. Determined to help his family and liberate the Kubaz from Imperial rule, Garindan accepted the job. When Labria complimented Garindan's skills as a spy and asked about his motives, Garindan merely replied that he was \"very far from home.\"\nGarindan ezz Zavor was a male Kubaz. While working as a spy on Tatooine, he wore a long black robe and hood. Goggles covered Garindan's eyes, and a metallic device covered Garindan's long snout. During the Imperial Era, Garindan initially had an optimistic view of the Galactic Empire and hoped to train a diplomat. However, Garindan became disillusioned with the Empire when he and his fellow Kubaz were forced to work as spies. As a result, Garindan harbored a deep hatred of the Empire and sought to free his people from Imperial rule.\nGarindan was part of a respectable clan and had a wife and several children and grandchildren. Garindan loved and deeply missed his family. He hated his posting on Tatooine, which he regarded as a desolate place bereft of arts, decorum, and education. Garindan endured considerable hostility form the local human population, who regarded him as an unscrupulous spy and alien outsider. Garindan in return held a negative view of humans, the galaxy's dominant species. He regarded them as an arrogant species who had inflated view of their place in the galaxy. Garindan's love for his family led him to accept any job including spying on the Alliance.\nAs a Kubaz, Garindan was able to read body languages, smell pheromones and weapons, and hear chatter from long distances. Garindan was also sensitive to the pheromones that people and animals secreted, allowing him to read their thoughts and feelings. Garindan spoke both his native language Kubazian and Galactic Basic Standard.\nGarindan was played by Sadie Eddon in A New Hope. According to Star Wars Insider 110, his voice was a processed version of John Wayne's voice.\nGarindan appeared in several Star Wars Legends works including Daniel Keys Moran's 1995 short story \"Empire Blues: The Devaronian's Tale,\" which was published as part of the volume Tales from the Mos Eisley Cantina. Garindan's backstory was further developed in Delilah S. Dawson's \"The Secrets of Long Snoot,\" which was published as part of the 2017 anthology From a Certain Point of View. Dawson gave a more sympathetic appraisal of the character's motives, depicting him as a victim of the Empire as opposed to an opportunistic spy. However, this contradicts the digital card game Star Wars: Force Collection, in which Garindan's card stated that he was greedy and was hired by the Empire to spy on Solo's friends rather than being forced to do it.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Garindan_ezz_Zavor",
  "/wiki/Garindan",
  "/wiki/Bounty_Hunt",
  "/wiki/Born_in_the_Storm",
  "/wiki/Kubindi",
  "/wiki/Kubaz",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Garindan_ezz_Zavor%27s_clan",
  "/wiki/Galactic_Empire",
  "/wiki/Spy",
  "/wiki/Blockade_of_Kubindi",
  "/wiki/Battle_of_Yavin",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Luke_Skywalker",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Derrida",
  "/wiki/Ketton",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Reproduction",
  "/wiki/Farm",
  "/wiki/Picolet_beetle",
  "/wiki/Garindan_ezz_Zavor%27s_wife",
  "/wiki/Senator",
  "/wiki/Artist",
  "/wiki/Garindan_ezz_Zavor%27s_daughter",
  "/wiki/Imperial_Era",
  "/wiki/Protocol_droid",
  "/wiki/Diplomat",
  "/wiki/Language",
  "/wiki/Propaganda",
  "/wiki/Brain",
  "/wiki/Orbit",
  "/wiki/Homeworld",
  "/wiki/Standard_year",
  "/wiki/Credit",
  "/wiki/Starship",
  "/wiki/Datapad",
  "/wiki/Hyperspace",
  "/wiki/Galactic_Civil_War",
  "/wiki/City",
  "/wiki/Mos_Eisley",
  "/wiki/Xenophobia",
  "/wiki/Human",
  "/wiki/Leather",
  "/wiki/Currency",
  "/wiki/Time",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Kubazian",
  "/wiki/Emissary",
  "/wiki/Marriage",
  "/wiki/Death",
  "/wiki/Information_broker",
  "/wiki/Standard_day",
  "/wiki/Droid",
  "/wiki/Imperial_Military",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/X-34_landspeeder",
  "/wiki/Ponda_Baba",
  "/wiki/Cornelius_Evazan",
  "/wiki/Dismemberment",
  "/wiki/Limb",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Alderaan",
  "/wiki/Captain",
  "/wiki/Han_Solo",
  "/wiki/Pilot",
  "/wiki/Chewbacca",
  "/wiki/Cantina",
  "/wiki/Millennium_Falcon",
  "/wiki/Docking_Bay_94",
  "/wiki/Stormtrooper",
  "/wiki/Spaceport",
  "/wiki/Devaronian",
  "/wiki/Kardue%27sai%27Malloc",
  "/wiki/Bounty",
  "/wiki/Color",
  "/wiki/Robe",
  "/wiki/Goggles",
  "/wiki/Eye",
  "/wiki/Alien",
  "/wiki/Species",
  "/wiki/The_galaxy",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Sadie_Eden",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars_Insider_110",
  "/wiki/John_Wayne",
  "/wiki/Star_Wars_Legends",
  "/wiki/Daniel_Keys_Moran",
  "/wiki/1995",
  "/wiki/Empire_Blues:_The_Devaronian%27s_Tale",
  "/wiki/Tales_from_the_Mos_Eisley_Cantina",
  "/wiki/Delilah_S._Dawson",
  "/wiki/The_Secrets_of_Long_Snoot",
  "/wiki/2017",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_Commander",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Duel_of_Destiny",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Tatooine_Rhapsody",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Allies_of_Necessity_(Star_Wars:_Destiny)",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_Outer_Rim",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Databank_(website)"
 ]
}