{
 "name": "Garl_Lykan",
 "display_name": "Garl Lykan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Ghonoath system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Squadron Four",
      "Squadron Four"
     ]
    }
   ]
  }
 ],
 "content": "Garl Lykan was a human male TIE fighter pilot in the 204th Imperial Fighter Wing of the Galactic Empire. He saved the life of fellow pilot Armenauth shortly after the Battle of Endor. Some weeks after Endor, Lykan participated in a hunt for the New Republic EF76 Nebulon-B escort frigate Hellion's Dare and its escort squadrons. The pilot favored a maneuver the New Republic pilots called the Needle and used it to kill the A/SF-01 B-wing starfighter pilot Rawn. The New Republic pilots also nicknamed Lykan \"Snapper.\"\nLykan's forces destroyed the Hellion's Dare and killed all but two of the New Republic pilots. Multiple weeks later, General Hera Syndulla's New Republic battle group defeated the 204th at their base of operations in the Pandem Nai system. The survivors of the fighter wing fled aboard the Quasar Fire-class cruiser carrier Aerie. Around 5 ABY, Lykan was part of the 204th's attack on Syndulla's battle group in the Cerberon system. While the fighter wing was operating on the planet Troithe, they were faced with a counter attack, during which Lykan used the Needle to killed the New Republic pilot Ubellikos.\nThe 204th was forced to flee the Cerberon system. Later in 5 ABY, the fighter wing carried out a string of genocides until Syndulla's battle group arrived to hunt the unit. The 204th was attacked through multiple systems, being tracked by a communications signal burst from the flagship. While the fighter wing was hampering the enemy in the Ghonoath system, Lykan's port stabilizer lost power and he was killed by a trio of X-wing starfighters. He received a funeral that evening, led by Captain Armenauth, who lamented the late pilot alongside Colonel Soran Keize.\nDuring the Galactic Civil War between the Galactic Empire and the Rebel Alliance, Garl Lykan served as an Imperial TIE fighter pilot in the Empire's 204th Imperial Fighter Wing. Shortly after the Battle of Endor in 4 ABY, he saved the life of fellow pilot Armenauth, and reminded the man of the rescue many times. Following Endor, the Alliance became the New Republic and the Imperial Military became splintered and the 204th was soon left without orders from the higher echelons of the Empire, ultimately digging in at the planet Pandem Nai.\nA number of weeks after the Battle of Endor, Lykan was deployed aboard the 204th's Quasar Fire-class cruiser-carrier Aerie to hunt down the New Republic EF76 Nebulon-B escort frigate Hellion's Dare, which was carrying out reconnaissance, as part of an effort coordinated by the 204th's commanding officer, Colonel Shakara Nuress, to maintain the secrecy of the fighter wing's new base of operations at Pandem Nai. Comprising of thirty-two TIE fighters making up two squadrons, the Aerie's complement drove the Dare and the frigate's RZ-1 A-wing interceptor and A/SF-01 B-wing starfighter squadrons, Riot Squadron and Hound Squadron respectively, out of the Jiruus system.\nThe Aerie's squadrons chased the Hellion's Dare through the Oridol Cluster, tracking the New Republic forces by picking off enemy starfighters when they were preparing to enter hyperspace to collect their jump coordinates. Lykan engaged twice with Hound Three, the B-wing pilot Chass na Chadic before she eventually killed Hirodin Nasli, the first of the Aerie's pilots to be lost. He also favored a combat maneuver involving pinning down and destroying his enemy. The Riot and Hound Squadron pilots named the maneuver the Needle and nicknamed Lykan \"Snapper.\" Lykan and a flight of TIEs used the Needle to kill the B-wing pilot Rawn.\nThe New Republic pilots discussed \"Snapper\" and the other 204th pilots, pointing out that the Imperials had gotten sloppier over time. During a later battle, Lykan later attempted a variant of the Needle, and Riot Five Sata Neek moved to disrupt. Both the Aerie and the Hellion's Dare were damaged in that engagement, each losing their hyperspace capabilities. Each parties then got to repairing their vessels until the 204th's cruiser-carrier finished first. The TIEs subsequently engaged the Dare and its remaining starfighter escort until the New Republic forces were destroyed, only Chadic and Riot Three Wyl Lark escaping.\nMultiple weeks later, a New Republic battle group deployed to the Pandem Nai system to attack the 204th at the planet Pandem Nai. Spearheaded by the New Republic Intelligence working group Alphabet Squadron, which Lark and Chadic had joined, the attack forced surviving members of the Imperial fighter wing to retreat aboard the Aerie, with Colonel Nuress being lost during the battle. Lykan continued with the 204th, and by around 5 ABY, the fighter wing was led by the field promoted Colonel Soran Keize and used the salvaged Imperial II-class Star Destroyer Edict.\nLykan participated when the 204th attacked Syndulla's battle group in the Cerberon system. The battle resulted in the loss of both the Edict and the Aerie, along with the New Republic forces' flagship, the Acclamator-class transgalactic military assault ship Lodestar. Stranded at the planet Troithe, the 204th fought New Republic aligned forces and eventually established a temporary base at the Core Nine mining megafacility.\nA small New Republic strike force soon led an attack on Core Nine with the New Republic's 61st Mobile Infantry. As the entirety of the 204th scrambled to fend off the invaders, Lykan managed to kill one of the New Republic pilots, named Ubellikos, with the Needle maneuver, where the New Republic pilot was pinned to the ground and left with nowhere to go. Shortly after, the 204th, Lykan included, made their escape from the battle, in a bulk freighter given to them by Troithe's acting Imperial governor, Fara Yadeez. As they were then pursued by New Republic reinforcements, the bulk freighter fired missiles toward the planet below, which created the diversion necessary to escape Troithe and into hyperspace.\nLater that year, the 204th, under orders from Grand Moff Randd, carried out a string of genocides on worlds which had not remained loyal to what was left of the Empire. By that time, Lykan served as a Flight Commander in the 204th's Squadron Four, led by Captain Armenauth, and the 204th's acquired bulk freighter had been named the Yadeez, matching names with Fara Yadeez. However, due to communications signal bursts from the Yadeez orchestrated from within by the New Republic sympathizer Yrica Quell, Syndulla's battle group traced the 204th to the Ciaox Verith system and attacked the unit. The New Republic forces then continued to track the 204th through more comm bursts and harry the fighter wing.\nWhen the 204th stopped in the Ghonoath system to refuel a support ship, a Raider-class corvette, the Yadeez and its escorts lured Syndulla's forces into the atmosphere of a radioactive planet to hamper the enemy. During the fighting Lykan fell back due to loss of power in his TIEs pot stabilizer. As a result, he was singled out and killed by a trio of X-wing starfighters while the rest of Squadron Four shouted for him.\nThe evening after the battle, Lykan received a funeral in the Yadeez's hangar bay, led by Armenauth. The captain announced that Lieutenant Nord Kandende was promoted to flight commander in Lykan's place and eulogized the late flight commander to the rest of the pilots until Keize stepped in, giving his own word on Lykan to conclude the eulogy. After, the colonel told Lieutenant Yrica Quell during a discussion that Lykan had understood the new rules of war the 204th had to play by to survive.\nGarl Lykan was a human male, who was a TIE fighter pilot of the Galactic Empire. He was sure to constantly remind Armenauth that he had saved the pilots life, going as far as to humiliate his comrade. Lykan also favored a combat maneuver, named the Needle by New Republic pilots, in which one or more TIEs would pin and demolish an enemy starfighter after it had nowhere to go. The flight commander also understood that the rules of war had altered, but, having assumed his TIE fighter was running at optimal efficiency, did not foresee his port stabilizers failure, which led to his demise.\nThe pilot first appeared in a TIE fighter in the 2019 novel Alphabet Squadron, written by Alexander Freed, under the nickname \"Snapper\". He was first identified as Garl Lykan in the finale of Freed's Alphabet Squadron trilogy, the 2021 novel Victory's Price.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/5_ABY",
  "/wiki/Ghonoath_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Squadron_Four_(Shadow_Wing)",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Pilot",
  "/wiki/Armenauth",
  "/wiki/Battle_of_Endor",
  "/wiki/Standard_week",
  "/wiki/Endor",
  "/wiki/Attack_on_the_Hellion%27s_Dare",
  "/wiki/New_Republic",
  "/wiki/EF76_Nebulon-B_escort_frigate",
  "/wiki/Hellion%27s_Dare",
  "/wiki/Squadron",
  "/wiki/New_Republic_pilot",
  "/wiki/Needle_(maneuver)",
  "/wiki/Death",
  "/wiki/A/SF-01_B-wing_starfighter",
  "/wiki/Rawn",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Barma_Battle_Group",
  "/wiki/Pandem_Nai_system",
  "/wiki/Fighter_wing",
  "/wiki/Quasar_Fire-class_cruiser-carrier",
  "/wiki/Aerie",
  "/wiki/Attack_on_Cerberon",
  "/wiki/Battle_group",
  "/wiki/Cerberon_system",
  "/wiki/Planet",
  "/wiki/Troithe",
  "/wiki/Attack_on_Troithe",
  "/wiki/Ubellikos",
  "/wiki/Star_system",
  "/wiki/Yadeez",
  "/wiki/X-wing_starfighter",
  "/wiki/Lykan%27s_funeral",
  "/wiki/Captain",
  "/wiki/Colonel",
  "/wiki/Soran_Keize",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/4_ABY",
  "/wiki/Imperial_Military",
  "/wiki/Pandem_Nai",
  "/wiki/Commanding_officer",
  "/wiki/Shakara_Nuress",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Frigate",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Riot_Squadron",
  "/wiki/Hound_Squadron",
  "/wiki/Jiruus_system",
  "/wiki/Oridol_Cluster",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Starfighter",
  "/wiki/Hyperspace",
  "/wiki/Hound_Three",
  "/wiki/Chass_na_Chadic",
  "/wiki/Hirodin_Nasli",
  "/wiki/TIE_line",
  "/wiki/Riot_Five",
  "/wiki/Sata_Neek",
  "/wiki/Starship",
  "/wiki/Cruiser",
  "/wiki/Carrier",
  "/wiki/Riot_Three",
  "/wiki/Wyl_Lark",
  "/wiki/Attack_on_Pandem_Nai",
  "/wiki/New_Republic_Intelligence",
  "/wiki/Alphabet_Squadron",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Edict",
  "/wiki/Acclamator-class_transgalactic_military_assault_ship",
  "/wiki/Lodestar",
  "/wiki/Core_Nine_mining_megafacility",
  "/wiki/Wyl_Lark%27s_squadron",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Governor",
  "/wiki/Fara_Yadeez",
  "/wiki/Standard_year",
  "/wiki/Grand_Moff",
  "/wiki/Randd",
  "/wiki/Flight_Commander",
  "/wiki/Bulk_freighter",
  "/wiki/Yrica_Quell",
  "/wiki/Ciaox_Verith_system",
  "/wiki/Skirmish_in_the_Ciaox_Verith_system",
  "/wiki/Raider-class_corvette",
  "/wiki/Atmosphere",
  "/wiki/Radiation",
  "/wiki/Lieutenant",
  "/wiki/Nord_Kandende",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alexander_Freed",
  "/wiki/Star_Wars:_Alphabet_Squadron",
  "/wiki/2021",
  "/wiki/Victory%27s_Price",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Standard_month",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Jakku",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_61",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)"
 ]
}