{
 "name": "Garmen_Naadra",
 "display_name": "Garmen Naadra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 5 ABY",
      "Troithe"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Academy",
      "Imperial Navy's officer corps",
      "Squadron Three",
      "Imperial Academy",
      "Imperial Navy's officer corps",
      "Squadron Three"
     ]
    }
   ]
  }
 ],
 "content": "Garmen Naadra was a human female TIE fighter pilot who joined the Galactic Empire's 204th Imperial Fighter Wing after graduating from the Imperial Academy. Being mentored by Major Soran Keize, she rose to the rank of lieutenant. Around 5 ABY, after the 204th devastated an New Republic battle group at the planet Troithe, Naadra and her squadron, Squadron Three, searched for a remnant which was active at the surface.\nThe lieutenant located the remnant while it traveled through a tunnel system towards another continent and was pursued by the New Republic pilot Wyl Lark. During the chase, Naadra tried to collapse the roof of a tunnel on Lark, but fell victim to her own tactic. As the first pilot lost since the 204th's initial attack on the battle group, the late lieutenant received a memorial service, and Keize told stories about her with her squadron.\nDuring the time of the Galactic Empire, Garmen Naadra attended an Imperial Academy before graduating and becoming a TIE fighter pilot of the Empire's 204th Imperial Fighter Wing. Shortly after arrival to the fighter wing, she was mentored by Major Soran Keize, who complied with her interest in tactical planning and custom simulator drills over a number of months until she became a confident member of the 204th. Around 5 ABY, by which Naadra had risen to the rank of lieutenant, the 204th attacked a New Republic battle group above the planet Troithe in the Cerberon system, led by the field promoted Colonel Keize. Naadra's squadron, Squadron Three, took part in the attack, which saw the devastation of the battle group's fleet and the loss of the 204th's own capital ships. Naadra's possessions were lost with the fighter wing's Quasar Fire-class cruiser-carrier Aerie.\nThe fighter wing then attacked the New Republic's 61st Mobile Infantry on the surface, forcing the infantry from their positions. Squadron Three, Naadra included, searched for a large remnant formed from some of the scattered New Republic forces, which was reported to have limited air support as well as transport. Naadra, flying a TIE/ln space superiority starfighter, scouted through some tunnels which led towards the Scar of Troithe, a heavily mined continent on the planet. During her surveying, she encountered the reported remnant, which moved through the tunnels as a caravan of repulsorcraft carrying troops with a small number of starfighters and airspeeders as support.\nThe caravan's air support detected Naadra, and the RZ-1 A-wing interceptor pilot Wyl Lark gave chase as she passed the repulsor vehicles, some of the infantry in them shooting at her TIE fighter. Naadra then flew into a narrow tunnel branch, her foe following behind her. Once both reached a larger passage, she tried to force Lark to pass her into her firing range. The A-wing pilot retained his position and contacted Naadra, demanding her surrender. The lieutenant instead fired at the roof of the tunnel, attempting to collapse it onto Lark. Her foe, however, returned fire, evading destruction from the falling rubble. Naadra's TIE was destroyed in the process, the lieutenant perishing with it.\nFollowing Naadra's demise, the rest of Squadron Three attempted to pursue the caravan. Lark considered using the late TIE pilot's tactic of collapsing the roof of the tunnel, and Carver, the assumed unit-commander of the remnant, had a repulsorcar detonate to block a tunnel entrance while the TIE squadron killed one of the airspeeder pilots. Naadra's death marked the first of the 204th's pilot losses since their initial assault on the New Republic battle group at the Cerberon System, and a memorial service was held for the lieutenant took place in the Taa Complex of Troithe's ecumenopolis, led by Squadron Two's Captain Darita. Keize, since field promoted to colonel as the 204th's commanding officer, was among the attendees and told stories about Naadra with the members of Squadron Three.\nThe colonel later dreamed about going on a mission to avenge the lieutenant, although she soon turned into another of his colleagues during the dream. During the Battle of Jakku, months later, the 204th fought head to head with a New Republic starfighter wing led by Lark, which had many pilots who had fought the Imperial fighter wing before. As each side continued to slaughter one another, they began calling out names of their lost comrades, mourning Naadra's name.\nA human female, Garmen Naadra was assumed to be a male by the improvised airspeeder pilot Gorgeous Su. The lieutenant had originally enlisted to improve her piloting ability and overcome her fears in the process. She also held a desire for custom simulator drills and tactical planning. While being pursued by Wyl Lark, Naadra attempted to get the former pilot to pass into her firing range before resorting to collapsing the roof of the tunnel in an attempt to crush him, resulting in her own death.\nGarmen Naadra first appeared in a fighter in the 2020 novel Shadow Fall, the second installment of the Star Wars: Alphabet Squadron trilogy which was written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/5_ABY",
  "/wiki/Troithe",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Academy",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Squadron_Three_(Shadow_Wing)",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Major",
  "/wiki/Soran_Keize",
  "/wiki/Military_rank",
  "/wiki/Lieutenant",
  "/wiki/Attack_on_Cerberon",
  "/wiki/New_Republic",
  "/wiki/Barma_Battle_Group",
  "/wiki/Planet",
  "/wiki/Squadron",
  "/wiki/Scar_of_Troithe",
  "/wiki/New_Republic_pilot",
  "/wiki/Wyl_Lark",
  "/wiki/Battle_group",
  "/wiki/Imperial_Era",
  "/wiki/Fighter_wing",
  "/wiki/Standard_month",
  "/wiki/Cerberon_system",
  "/wiki/Colonel",
  "/wiki/Fleet",
  "/wiki/Capital_ship",
  "/wiki/Quasar_Fire-class_cruiser-carrier",
  "/wiki/Aerie",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Infantry",
  "/wiki/Wyl_Lark%27s_squadron",
  "/wiki/Transport",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Repulsorcraft",
  "/wiki/Starfighter",
  "/wiki/Airspeeder",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/TIE_line",
  "/wiki/Pilot",
  "/wiki/Death",
  "/wiki/Carver",
  "/wiki/Commanding_officer",
  "/wiki/Gorgeous_Su",
  "/wiki/Taa_Complex",
  "/wiki/Ecumenopolis",
  "/wiki/Squadron_Two_(Shadow_Wing)",
  "/wiki/Captain",
  "/wiki/Darita",
  "/wiki/Fara_Yadeez",
  "/wiki/Battle_of_Jakku",
  "/wiki/Deliverance%27s_starfighter_wing",
  "/wiki/2020",
  "/wiki/Shadow_Fall",
  "/wiki/Star_Wars:_Alphabet_Squadron",
  "/wiki/Alexander_Freed",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_61",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}