{
 "name": "Garrick_Versio",
 "display_name": "Garrick Versio",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vardos"
     ]
    },
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Eviscerator",
      "Jakku"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Navy's officer corps",
      "Imperial Security Bureau",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Garrick Versio was a human male who held the title of Inspector General and later the military rank of admiral in the Imperial Security Bureau, a law enforcement and intelligence agency of the Galactic Empire. He and his wife Zeehay had a daughter named Iden before divorcing when Iden was five years old. It was Versio who brought the planet Vardos into the Empire, and as a result was known as the \"Hero of Vardos\" and had a statue dedicated to him outside of the Archive.\nPrior to his promotion to admiral, Garrick Versio served as an Inspector General in the secretive Imperial Security Bureau. Convinced that Imperial strength was necessary to maintain order in the galaxy, Admiral Versio extended that conviction into his relationship with his daughter, mercilessly pushing her and constantly testing her limits. Eventually, Iden became the commander of Inferno Squad, an Imperial Special Forces commando unit assembled by Garrick, which included Agents Gideon Hask, Del Meeko, and Seyn Marana, in response to the destruction of the Death Star. He first tasked them in infiltrate and destroy the Dreamers, a mission that resulted in an Imperial victory though saw the death of Marana.\nGarrick commanded the Star Destroyer Eviscerator and partook at the Battle of Endor in 4 ABY, witnessing the death of Fleet Admiral Firmus Piett, whom he called a fool after the Super Star Destroyer Executor crashed into the second Death Star and was destroyed. Shortly afterwards, the second Death Star exploded, destroyed by the attacking Rebel forces. Vice Admiral Rae Sloane, the highest ranking commanding officer to survive the battle, ordered for a full retreat. Garrick and the Eviscerator waited for Inferno Squad to evacuate Endor.\nAbove Vardos, Garrick confirmed that Emperor Palpatine was dead to his daughter aboard the Eviscerator and shared with her the Messenger droid he received because he wanted her to have that honor as well, which communicated the final orders of the Emperor: to begin Operation: Cinder at once. He sent Iden and Inferno Squad to Fondor to protect Moff Raythe, who transported satellites crucial to Operation: Cinder aboard his Star Destroyer Dauntless. Though a battle erupted at the Imperial shipyards above Fondor when Rebel Alliance forces attempted to hijack the ship, they were eventually destroyed, and Operation: Cinder was secured.\nMoff Raythe's satellites and the Dauntless were in fact sent to target the loyal Imperial world of Vardos itself. Despite the planet being his own homeworld and teeming with Imperial loyalists, Garrick ordered the satellites turned online per the posthumous order of the Emperor, and commanded his daughter to extract Protectorate Gleb. However, during the mission, Iden and Meeko went rogue after deciding that it was not moral to leave loyal Imperial citizens to die. They escaped aboard the Corvus with their crew and some survivors, but Hask turned on them and returned to Garrick with Protectorate Gleb and her agent, prompting Garrick to promote Hask to Commander.\nGarrick went on to run operations on Bespin and Sullust, procuring fuel and weapons for the shattering Empire, while he and Hask were hunted down by Iden and Meeko, now members of Inferno Squad in the New Republic. At some point in the final year of the Galactic Civil War, Garrick fell under the command of Counselor Gallius Rax, who was secretly in charge of executing the clandestine Contingency, and partook in the Battle of Jakku.\nAs commanded by Counselor Rax, Admiral Versio went aboard the Eviscerator to the Battle of Jakku. During the battle, however, the Eviscerator was badly damaged in the battle and soon began to lose its structural integrity; as it burnt in the skies of Jakku, Iden made an attempt to rescue her father after shooting down Hask. Though Rax also intended for Garrick to leave, he declined his daughter's rescue attempt. Looking out over the battle and his rapidly disintegrating starship, Garrick bitterly lamented having dedicated his entire life to an Empire which was indeed weak and flawed whilst Iden tried to convince him to leave. In their final moments together, he made peace with his daughter and urged her to leave and live a good life, something which he did not regard himself worthy of. Iden reluctantly left him on the bridge and evacuated in an escape pod, while Garrick remained on the Eviscerator as it crashed onto the sandy deserts of Jakku, perishing in the collision.\nIn the following years, Garrick posthumously gained a son-in-law when Iden married Del and later became a grandfather with the arrival of Zay, their daughter. The family would go on to fight in the war between the First Order and the Resistance, a conflict in which both Iden and Del lost their lives. By this time, Garrick was remembered by General Leia Organa as one of the most notorious admirals of the Imperial Navy.\nGarrick Versio was fanatically loyal to the Empire. He worked to make Iden stronger and a \"true Versio.\" He did have some empathy as he went to Iden's mother Zeehay to tell her that Iden was no traitor and that she was on a mission, since she was unhealthy and he didn't want her to die thinking her daughter a traitor. However, his fanatical loyalty led to him having no problem unleashing the fury of Operation: Cinder on Vardos, a planet where he was seen as a leader to those who lived there. He even ordered his daughter to be executed if she resisted. Despite all of this, in the end, he realized the Empire was corrupt and decided to go down with his ship after telling Iden to live in peace.\nGarrick Versio was portrayed by Anthony Skordi in Star Wars Battlefront II.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Garrick_Versio",
  "/wiki/Special:Upload",
  "/wiki/Vardos",
  "/wiki/5_ABY",
  "/wiki/Eviscerator",
  "/wiki/Jakku",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Inspector_General",
  "/wiki/Military_rank",
  "/wiki/Admiral",
  "/wiki/Law_enforcement_agency",
  "/wiki/Marriage",
  "/wiki/Zeehay_Versio",
  "/wiki/Iden_Versio",
  "/wiki/Divorce",
  "/wiki/Standard_year",
  "/wiki/Planet",
  "/wiki/Archive",
  "/wiki/The_galaxy",
  "/wiki/Commander",
  "/wiki/Inferno_Squad",
  "/wiki/Imperial_Special_Forces",
  "/wiki/Commando",
  "/wiki/Agent",
  "/wiki/Gideon_Hask",
  "/wiki/Del_Meeko",
  "/wiki/Seyn_Marana",
  "/wiki/Battle_of_Yavin",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Infiltration_of_the_Dreamers",
  "/wiki/Dreamers",
  "/wiki/Death",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Fleet_Admiral",
  "/wiki/Firmus_Piett",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Executor",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Vice_Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Commanding_officer",
  "/wiki/Endor",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Sentinel_(Contingency)",
  "/wiki/Droid",
  "/wiki/Operation:_Cinder",
  "/wiki/Fondor",
  "/wiki/Moff",
  "/wiki/Raythe",
  "/wiki/Climate_disruption_array",
  "/wiki/Star_Destroyer",
  "/wiki/Dauntless_(Imperial_II-class)",
  "/wiki/Attack_on_Fondor",
  "/wiki/Fondor_Shipyards",
  "/wiki/Protectorate_(title)",
  "/wiki/Gleb",
  "/wiki/Bespin",
  "/wiki/Sullust",
  "/wiki/Inferno_Squad_(Resistance)",
  "/wiki/New_Republic",
  "/wiki/Galactic_Civil_War",
  "/wiki/Counselor_to_the_Empire",
  "/wiki/Gallius_Rax",
  "/wiki/Contingency",
  "/wiki/Battle_of_Jakku",
  "/wiki/Escape_pod",
  "/wiki/Desert",
  "/wiki/Zay_Versio",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Imperial_Navy",
  "/wiki/Anthony_Skordi",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/Resistance_Reborn",
  "/wiki/Resistance_Reborn_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Heading_into_Battle",
  "/wiki/Star_Wars_Insider_177",
  "/wiki/The_Fist_of_the_Empire",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Emperor_Palpatine",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Electronic_Arts"
 ]
}