{
 "name": "Garreth_Holtz",
 "display_name": "Garreth Holtz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Garreth Holtz was a male Human Admiral who served in the Imperial Navy during the Galactic Civil War.\nGarreth Holtz commanded the Imperial II-class Star Destroyer Corrupter during the Galactic Civil War. His ship participated in the Battle of Hoth, where it sustained massive damage due to the Rebel planetary ion cannon. Holtz would later take the ship, which now lacked a sensor dome, on several missions in the name of the Galactic Empire, including the destruction of a Rebel hospital and the seizure of Twin Suns Transport Services.\nFollowing this mission, he was assigned the task of locating the Alliance fleet commanded by the Mon Calamari Star Cruiser Defiance. After failing to eliminate the Defiance task force, Holtz was assigned to monitor and quell pirate activity in the Outer Rim Territories as punishment.\nDuring this time, he encountered Rebel activity once again when he interfered with an Alliance-smuggler meeting, during which the Alliance struck a critical trade and supply deal with the smuggler Dunari in preparation for the eventual Battle of Endor. This trap failed, but Holtz was tipped off on the deal by the Hurrim, a pirate faction formerly aligned with Dunari which prompted Holtz to assault and subsequently occupy Dunari's Casino.\nEventually, after a prolonged campaign Dunari and the Alliance moved in to attack the Hurrim directly, prompting an intervention by Holtz and his task force to prevent this from happening. Vowing to crush the Rebel force, Holtz and the Corrupter moved in to defend the Hurrim facility, but the Alliance counterattacked with Dunari's help. After routing Holtz's forces, the Admiral declared they would not win the fight but perished moments latter when the rebels finally destroyed the Corrupter ending Holtz's failing career along with his life.\nGarreth Holtz was voiced by Charles Martinet in the game Star Wars: X-Wing Alliance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Corrupter_(Imperial-class)",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/V-150_Planet_Defender/Legends",
  "/wiki/Twin_Suns_Transport_Services/Legends",
  "/wiki/Mon_Calamari_Star_Cruiser",
  "/wiki/Defiance/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Dunari",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Hurrim",
  "/wiki/Dunari%27s_Rest",
  "/wiki/Charles_Martinet",
  "/wiki/Star_Wars:_X-Wing_Alliance"
 ]
}