{
 "name": "Gars_Croft",
 "display_name": "Gars Croft",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Gars Croft was a male Cerean who was the brother of the Office of Peace and Security lieutenant Hanes Croft. During the waning years of the Galactic Republic, Croft became a resident of the Blue Star Centre, a philosophical retreat that was located in the city Gadrin on the planet Cularin. In about 31 BBY, members of a criminal organization known as the Intarsa League entered the Blue Star Centre and took Croft and the center's other occupants hostage. Lector Amin Galingal, the director of the center, was struck down by extreme terror as a result of his staffs' capture, forcing Croft to assume a leadership role among the hostages. Croft ordered his fellow hostages to move all of the Blue Star Centre's books to the center's main meditation chamber and he appealed to Dersa Welles, the leader of the Intarsa League, to ensure that no fighting took place in the meditation chamber, so as to ensure that the books were preserved. While many of her League colleagues scoffed at Croft's request, Welles agreed to his demand. The center was eventually raided by a group of freelance agents who attempted to free the hostages and during the climax of the agents' assault, Welles grabbed hold of Croft and held a blaster to his head.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Office_of_Peace_and_Security",
  "/wiki/Lieutenant/Legends",
  "/wiki/Hanes_Croft",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Blue_Star_Centre",
  "/wiki/City/Legends",
  "/wiki/Gadrin",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Intarsa_League",
  "/wiki/Lector",
  "/wiki/Amin_Galingal",
  "/wiki/Dersa_Welles",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Blaster/Legends",
  "/wiki/Operation_Blue_Star"
 ]
}