{
 "name": "Garsa Fwip",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sanctuary",
      "Fett gotra"
     ]
    }
   ]
  }
 ],
 "content": "Garsa Fwip was the Twi'lek female owner of the Sanctuary, a cantina in Mos Espa during the New Republic Era. When former bounty hunter Boba Fett established a new criminal empire on Tatooine, he paid a visit to Fwip at the Sanctuary to ensure the longevity of her business. Fwip thanked Fett and entrusted the cantina to his authority. When the Twins sought to take over Fett's territory, the cantina owner relayed their intentions to the crime lord.\nAround 9 ABY during the New Republic Era, Garsa Fwip was the owner of the Sanctuary, a cantina in Mos Espa, which was a city on the desert planet Tatooine. After Boba Fett had become the new leader of his criminal empire in an attack on Jabba's Palace, formerly ruled by Bib Fortuna and before that by Jabba Desilijic Tiure, the Daimyo and his lieutenant Fennec Shand travelled to the Sanctuary to greet Fwip and conduct business with her.\nUpon meeting Fett, Fwip extended her welcome and offered the products and services of the establishment to him. When the Daimyo replied that he wanted to discuss business, she complied, but asked whether he wished to allow his Gamorrean guards to be washed and fed. Fett denied the request, stating that the matter would be completed quickly, before introducing Shand and himself and reporting how he had replaced Fortuna. Fwip apologetically remarked that she did not see the man's litter, as Hutt crime lords were often carried on one, to which Fett responded that he preferred to walk by himself. The Daimyo commented that the purpose of his visit was only to introduce himself and guarantee that the Sanctuary would continue to thrive in his empire. Expressing her gratitude, Fwip briefly bowed to Fett, glanced back toward the bar, and clapped to signal her attendants, and then further thanked him for crossing a long distance to come to her cantina. She assigned the establishment to Fett's command, patting his arm before departing. Her tribute to him was paid in profits from her business itself.\nNot long after a thwarted attempt on Fett's life, in which an assassin was captured, claiming to have been sent by Mayor of Mos Espa Mok Shaiz, Fett questioned the mayor on his involvement. Though Shaiz denied this, he advised the Daimyo to go to the Sanctuary to find more answers. When Fett, Shand and the two Gamorrean guards arrived inside, the female Twi'lek server whispered to Fwip to note their arrival, and the owner greeted them with a tense expression. She thanked Fett for his patronage and offered a seat at the bar and a drink, but Fett demanded to know what was happening.\nFwip initially seemed puzzled, to which the crime lord stated that he had been tipped off by Shaiz, asserting that she was sweating like a gumpta on Mustafar. After Fwip remarked that Fett had not heard the latest news and he further queried, the Twi'lek revealed that two of the late Jabba's cousins had laid claim to the criminal empire. While Fett countered that the Twins were too preoccupied with other Hutt affairs to care about Tatooine, the sound of drums approached, and Fwip looked past him towards the street outside. With the whole cantina falling silent, the gangsters exited the establishment to meet the Hutt litter and listen to their demands. Although Lord Fett refused to yield to the Twins, bloodshed was kept away from Mos Espa at that time.\nAt some point after the Wookiee mercenary Krrsantan had been captured and released by Fett's forces in a failed assassination attempt, he was having drinks at the Sanctuary on one evening. Krrsantan attacked five Trandoshans who were gambling, holding one in the air. Fwip interceded and chuckled, recalling the Wookiee's gladiatorial career and speaking highly of his skill and reputation as she walked towards him. Attesting to Krrsantan's legendary name that had attracted thousands, as well as to how his brass knuckles were more feared than blasters, Fwip suggested that he had already won everything and that it was beneath him to dismember the Trandoshan. She held out her arm to his and stated that such a display was no longer suitable for more \"civilised\" circumstances, labelling the violence of fighting pits as horror and cruelty.\nWhen Krrsantan appeared to pause, Fwip sighed and asked if the Wookiee felt better, before claiming that he, a champion above pettiness, had nothing left to prove. The owner reminded him of his bar tab and told him to release the Trandoshan, promising to cancel his debt. Krrsantan glanced at her but did not obey, instead roaring and tearing off the victim's left arm, much to the onlookers' shock. Fwip let out a sigh and scowled, feeling disgusted, while the Wookiee dropped some credits into the hands of the Twi'lek female server. As Krrsantan exited the building, he growled and stared at Fett, who had observed the altercation from the doorway. The crime lord said to Fwip that her effort had been justified, who shrugged her arms and rolled her eyes, before he left to seek the Wookiee. After Fwip instructed Max Rebo to continue playing music, the cantina attendees resumed their activities. Fett eventually enrolled Krrsantan into his criminal empire.\nAfter experiencing interruptions in their smuggling and ready for war against Boba Fett, the Pyke Syndicate sent two Pykes into Fwip's cantina. Fwip noticed the pair while she spoke to other patrons, and her servers offered to wash their helmets, only to be turned down. The two Pykes then left without having their drinks, leaving a camtono behind without a word. Fwip watched them depart before the camtono suddenly exploded, killing her and the cantina's patrons.\nAs a result of the Sanctuary's bombing, Fett concluded that war had begun. Meanwhile, at the Pyke Syndicate's headquarters on Tatooine, Mayor Mok Shaiz condemned the attack to the syndicate's boss on the planet, stressing that he had only agreed to surgical strikes. The Pyke boss subsequently apologized for crossing the line with his deal with the mayor.\nA Twi'lek female, Garsa Fwip had tan skin and brown eyes. When making the acquaintance of Fett and Shand, Fwip was quick to promote the offerings of her cantina to the new arrivals, and did the same upon their second visit. Fwip did not desire violence in her cantina. When Krrsantan disrupted the cantina in a fight, she condemned the \"horror and cruelty\" of the fighting pits, claiming that her time and place were \"more civilized\", and was disgusted at the sight of dismemberment.\nWhile greeting the new crime bosses at the Sanctuary, Fwip wore a shimmering gown with robes, a necklace, and a headdress. During Krrsantan's brawl, she wore a white and tan outfit.\nGarsa Fwip first appeared in \"Chapter 1: Stranger in a Strange Land,\" the first episode of the live-action television series The Book of Boba Fett, where she was played by Jennifer Beals. According to Beals, she and director Robert Rodriguez talked about Fwip being like the character Rick Blaine from the film Casablanca. Since Fwip was of the opposite gender, she had to step into that power in a different way to how Rick did in his respective film, earning it over gaining it by virtue. Fwip's outfit was designed by costume designer Shawna Trpcic. Beals sent images to Trpcic related to things she saw during meditations, which the designer incorporated into the outfit. The lekku prosthetics that the actress wore were designed to be lightweight, and were perfectly balanced for her skull; they were easy to keep on and could be taken off if she needed a break.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Twi%27lek",
  "/wiki/Gran",
  "/wiki/Garsa",
  "/wiki/Special:Upload",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sanctuary_(cantina)",
  "/wiki/Fett_gotra",
  "/wiki/Cantina",
  "/wiki/Mos_Espa",
  "/wiki/New_Republic_Era",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/The_Twins_(Hutts)",
  "/wiki/Crime_lord",
  "/wiki/City",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Attack_on_Jabba%27s_Palace_(Boba_Fett)",
  "/wiki/Bib_Fortuna",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Daimyo",
  "/wiki/Fennec_Shand",
  "/wiki/Gamorrean",
  "/wiki/Hutt",
  "/wiki/Ambush_outside_of_the_Sanctuary",
  "/wiki/Unidentified_Night_Wind_assassin",
  "/wiki/Mayor_of_Mos_Espa",
  "/wiki/Mok_Shaiz",
  "/wiki/Gumpta",
  "/wiki/Mustafar",
  "/wiki/Drum",
  "/wiki/Wookiee",
  "/wiki/Mercenary",
  "/wiki/Krrsantan",
  "/wiki/Assassination_attempt_on_Boba_Fett",
  "/wiki/Trandoshan",
  "/wiki/Unidentified_Trandoshan_gambler",
  "/wiki/Brass_knuckles",
  "/wiki/Blaster",
  "/wiki/Fighting_pit",
  "/wiki/Max_Rebo",
  "/wiki/Camtono",
  "/wiki/Desert_Survey_Office",
  "/wiki/Unidentified_Pyke_boss",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Jennifer_Beals",
  "/wiki/Robert_Rodriguez",
  "/wiki/Shawna_Trpcic",
  "/wiki/Lekku",
  "/wiki/Category:Images_of_Garsa_Fwip",
  "/wiki/The_Book_of_Boba_Fett_Junior_Novel",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_212",
  "/wiki/Star_Wars_Insider_214",
  "/wiki/Databank_(website)",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Death",
  "/wiki/The_Mandalorian",
  "/wiki/Disney%2B",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/January_4",
  "/wiki/2022",
  "/wiki/January_5",
  "/wiki/November_13"
 ]
}