{
 "name": "Garven_Dreis",
 "display_name": "Garven Dreis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Virujansi"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Yavin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Virujansi Rarified Air Cavalry",
      "Alliance to Restore the Republic",
      "Red Squadron",
      "Red Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Garven \"Dave\" Dreis, dubbed \"Old Man\" by the other pilots at Base One, was a male human and ace pilot from Virujansi who served as a commander in the Alliance to Restore the Republic during the Galactic Civil War. During the war, Dreis flew a T-65B X-wing starfighter as leader of Red Squadron in the Rebellion's support of Rogue One's incursion at the Battle of Scarif, and in the Rebellion's attack on the Galactic Empire's first Death Star in the Battle of Yavin. During the latter battle, he was killed by Darth Vader.\nGarven Dreis was born on the planet Virujansi prior to the Clone Wars. After making a name for himself during the Clone Wars, he joined the planetary defense force known as the Virujansi Rarified Air Cavalry on his homeworld. After the formation of the Galactic Empire, Virujansi experienced a political transformation when an Imperial governor displaced the ruling Virujansi council. This resulted in the forced disbanding of local military forces loyal to the ruling council. Dreis's commanding officer, Antoc Merrick, rejected an offer extended to pilots of the Rarified Air Cavalry to join the Imperial Navy, seeing it as hollow. Seeing that the Rebel Alliance's starfighter squadrons demonstrated greater unit coherence and piloting ability than those of the Empire, Dreis and Merrick opted for early retirement, left Virujansi, and sought membership with the Rebel Alliance.\nSometime after joining the Rebel Alliance, Dreis attained the rank of Commander and was given command of Red Squadron. As Red Leader, Dreis flew a mix of starfighters, that ranged from Aggressive ReConnaissance-170 starfighter to the T-65B X-wing starfighter.\nDreis was posted at the Alliance's base on Dantooine, but was later transferred to Yavin 4's Great Temple sometime before the Battle of Yavin. At some point prior to 0 BBY, Dreis was scheduled for Shift Cycle 1 of an X-wing flight patrol mission along with Major Ralo Surrel . Their mission was to route from Yavin to Gordian Trace Relays, perform a flyby of surrounding space, then after verifying visual and sensor all clear, perform close uplink of passive relay recordings.\nIn 0 BBY, Dreis led Red Squadron as part of the Rebel Alliance's forces supporting the Rogue One team, which had attacked the planet Scarif in an attempt to obtain schematics for the Empire's Death Star. As part of Admiral Raddus' plans during the early phase of the engagement, Red Squadron and Blue Squadron were assigned to cover the Rebel capital ships and Gold Squadron, a Y-wing bomber group. Fighters under Dreis' command also engaged the large TIE fighter detachment guarding the Scarif Shield Gate.\nX-wings under Dreis' command, including Red Eight and Red Twelve, attempted to penetrate the shield proper of the Scarif gate with repeated proton torpedo bombing runs in conjunction with Gold Squadron's attacks on the aperture itself. Despite their continued bombardment throughout the engagement, the Rebel ships were unable to break through the powerful Imperial shield.\nAs a result of these runs, the TIE fighter complement directly intercepted the Rebel fighter and bomber forces, including Dreis' squadron. Dreis chided Pedrin Gaul, a cadet pressed into active service with the squadron under the callsign Red Five, for splitting off from the main group. Despite Dreis' instruction for Gaul to return, the latter was shot down, along with several other Red Squadron members. Dreis survived Scarif, and his pilots were a direct cause for the Rebel Alliance victory that resulted from this attack.\nShortly after the costly victory over Scarif, Dreis and his remaining pilots were summoned to a briefing at Base One by General Jan Dodonna. Princess Leia Organa of Alderaan, a Rebel sympathizer who had taken possession of the plans for the monolithic Death Star battle station as a result of the battle over Scarif, had briefly fallen into Imperial custody, while the plans had been secreted within a droid, R2-D2, which eventually found its way to Luke Skywalker, a Tatooine moisture farmer. Motivated by a message from Organa which guided him to Obi-Wan Kenobi, a hidden Jedi, Skywalker had hired a Corellian smuggler, Han Solo, and, through a series of events, rescued Organa from imprisonment and returned the plans to her, although Kenobi was killed shortly before the group escaped the Death Star. Their means of escape was Solo's freighter, the Millennium Falcon, which had, unbeknownst to Organa and her compatriots, been tagged with an Imperial tracking device. The Death Star and its ruthless commander, Grand Moff Wilhuff Tarkin, had been guided to the Rebel stronghold on Yavin 4, and had arrived in-system shortly before the briefing.\nDreis, along with most of those assembled, were skeptical that the handful of fighters remaining could have any effect on the Death Star. Dodonna explained, however, that there was a key flaw in the designs of the station: a thermal exhaust port, only two meters wide. A proton torpedo fired down this shaft would impact the main reactor, causing critical failure and, ultimately, the destruction of the Death Star.\nReturning to the hangar, Dreis met with Skywalker, who had volunteered to join the squadron and bolster their numbers. Dreis was initially skeptical of the young man's piloting skills; however, Biggs Darklighter, a childhood friend of Skywalker and already a pilot under Dreis' command, personally vouched for his piloting skills, boasting that Luke was the best bush pilot in the entire Outer Rim Territories. Dreis accepted Skywalker and assigned him to the position of Red Five, left vacant after cadet Pedrin Gaul's death over Scarif.\nThe squadron, scrambled alongside Captain Jon Vander's Y-wings once again, rose from Yavin 4's jungles and flew to the Death Star, along the way confirming readiness and checking in. Arcing toward the trench and their target, the squadrons quickly began suffering losses to the turbolaser batteries and deflection towers across the surface of the moon-sized battle station. Dreis' X-wings initially served as cover while the bombers of Gold Squadron peeled off in groups of three to attempt the trench run; however, as squadrons of TIE fighters poured from the Death Star's hangar bays to engage the rebel ships, these early runs were annihilated to the last man.\nDarth Vader, a Dark Lord of the Sith, emerged from the station in a TIE Advanced x1 to aid in the Imperial defense. He was responsible for the deaths of several of Dreis' subordinates in Red Squadron as well as three separate members of Gold Squadron, including Captain Vander, in dogfights. Despite this danger, Dreis, Theron Nett, and Puck Naeco attempted the trench run.\nAlthough Vader shot down both of Dreis' wingmen, Dreis reached the end of the trench and fired two proton torpedoes at the exhaust port. Initially believing he was successful, Dreis disappointingly realized that his torpedoes missed their mark, only impacting the surface. While arcing out of the trench to recover from his failed attack, Dreis was targeted by Vader. Skywalker, seeing the Imperial fighters, told Dreis that he would come to his aid for another trench run; the squadron leader dissuaded him from this, as his starboard engine had been damaged, and ordered him to make a run on the trench himself. He then led Vader as far from the trench as he could before he was finally shot down by the Dark Lord. Letting out one final defiant yell, Dreis' X-wing spiraled into the surface of the Death Star, and he was killed on impact.\nAs a pilot of the rebellion, Garven Dreis wore an orange flight suit and flight helmet with red and yellow markings, while piloting a T-65B X-wing starfighter known as Red One, manufactured by Incom Corporation. His astromech droid was R5-K6.\nGarven Dreis was portrayed in 1977's Star Wars: Episode IV A New Hope by British actor Drewe Henley . A pre-battle scene in which Dreis discusses Luke's piloting ability with Luke and Biggs was cut from the original release, but partially restored in 1997 for the Special Edition.\nHenley passed away on February 14, 2016. His role in A New Hope was his final acting role on film; shortly after the movie was released, he was diagnosed with manic depression and retired. Henley posthumously reprised the role in 2016's Rogue One: A Star Wars Story through the use of archival footage.\nOn page 46 of the 2016 reference book Star Wars: Rogue One: The Ultimate Visual Guide, Dreis' last name was misspelled \"Dries.\"\nDreis' helmet used in the film was carried by a pilot on Hoth in The Empire Strikes Back  and on Home One in Return of the Jedi. The film prop was reused for the character Ina Rece in Legends video game Rebel Assault II: The Hidden Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Garven_Dreis",
  "/wiki/Garven_Dreis/Legends",
  "/wiki/Dave_(disambiguation)",
  "/wiki/Duty_Roster",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Virujansi",
  "/wiki/0_BBY",
  "/wiki/Yavin_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Virujansi_Rarified_Air_Cavalry",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Pilot",
  "/wiki/Great_Temple",
  "/wiki/Ace",
  "/wiki/Rebel_pilot",
  "/wiki/Commander",
  "/wiki/Galactic_Civil_War",
  "/wiki/Red_One_(T-65B_X-wing_starfighter)",
  "/wiki/Red_Leader",
  "/wiki/Rogue_One",
  "/wiki/Battle_of_Scarif",
  "/wiki/Galactic_Empire",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Death",
  "/wiki/Anakin_Skywalker",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Clone_Wars",
  "/wiki/Planetary_defense_forces",
  "/wiki/Homeworld",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Governor",
  "/wiki/Virujansi_council",
  "/wiki/Commanding_officer",
  "/wiki/Antoc_Merrick",
  "/wiki/Imperial_Navy",
  "/wiki/Starfighter",
  "/wiki/Squadron",
  "/wiki/Military_rank",
  "/wiki/Aggressive_ReConnaissance-170_starfighter",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Major",
  "/wiki/Ralo_Surrel",
  "/wiki/Red_Eleven",
  "/wiki/Yavin_Prime",
  "/wiki/Gordian_Reach",
  "/wiki/Alliance_Military",
  "/wiki/Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/Blue_Squadron_(Rebel_Alliance)",
  "/wiki/Capital_ship",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Bomber",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Shield_Gate",
  "/wiki/Red_Eight",
  "/wiki/Red_Twelve_(Rebel_Alliance)",
  "/wiki/Proton_torpedo",
  "/wiki/Starship",
  "/wiki/Pedrin_Gaul",
  "/wiki/Cadet",
  "/wiki/Callsign",
  "/wiki/Red_Five",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Alderaan",
  "/wiki/Death_Star",
  "/wiki/Battle_station",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/Luke_Skywalker",
  "/wiki/Tatooine",
  "/wiki/Moisture_farmer",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi",
  "/wiki/Corellian",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Rescue_of_Princess_Leia",
  "/wiki/Prison",
  "/wiki/Freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Homing_beacon",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Yavin_4",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Meter",
  "/wiki/Reactor",
  "/wiki/Biggs_Darklighter",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Captain",
  "/wiki/Jon_Vander",
  "/wiki/BTL_Y-wing_starfighter",
  "/wiki/Jungle",
  "/wiki/Meridian_trench",
  "/wiki/XX-9_heavy_turbolaser_battery",
  "/wiki/Moon",
  "/wiki/X-wing_starfighter",
  "/wiki/Black_Squadron_(Galactic_Empire)",
  "/wiki/Hangar",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Vader%27s_TIE_Advanced",
  "/wiki/TIE_Advanced_x1",
  "/wiki/Theron_Nett",
  "/wiki/Puck_Naeco",
  "/wiki/Wingmate",
  "/wiki/Engine",
  "/wiki/Flight_suit",
  "/wiki/Flight_helmet",
  "/wiki/Incom_Corporation",
  "/wiki/Astromech_droid",
  "/wiki/R5-K6",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Drewe_Henley",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/2016",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Hoth",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Nichos_Panib",
  "/wiki/Star_Wars_Legends",
  "/wiki/Home_One",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Ina_Rece",
  "/wiki/Star_Wars:_Rebel_Assault_II:_The_Hidden_Empire",
  "/wiki/Category:Audio_files_of_Garven_Dreis",
  "/wiki/Category:Images_of_Garven_Dreis",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Luke_vs._the_Death_Star_-_X-wing_Assault",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_Battle_Pod",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Desert_Son",
  "/wiki/Grounded",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Rebel_Alliance_Conversion_Kit",
  "/wiki/T-65_X-Wing_Expansion_Pack",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_1",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_25",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Databank_(website)",
  "/wiki/Samala_Loen%C3%A9",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Arhul_Narra",
  "/wiki/0_ABY",
  "/wiki/3_ABY",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/LucasArts",
  "/wiki/Star_Wars_Battlefront",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/The_Weapon_of_a_Jedi:_A_Luke_Skywalker_Adventure",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Battle_of_Vrogas_Vas",
  "/wiki/Star_Wars_Helmet_Collection_3",
  "/wiki/Databank_A-Z",
  "/wiki/Wedge_Antilles",
  "/wiki/Echo_Base",
  "/wiki/Battle_of_Hoth",
  "/wiki/Lost_Stars",
  "/wiki/Standard_month"
 ]
}