{
 "name": "Gasgano",
 "display_name": "Gasgano",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Troiken"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Xexto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.22 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White",
      "brown",
      "purple"
     ]
    }
   ]
  }
 ],
 "content": "Gasgano was a Xexto male podracer pilot who participated in the Boonta Eve Classic podrace on the desert planet Tatooine during the Invasion of Naboo. Gasgano wanted nothing more than to win the race, piloting his green Ord Pedrovia podracer. For the majority of the race, Gasgano tailed the leaders, but ended up losing to the human Anakin Skywalker.\nA Xexto male, Gasgano performed as a professional podracer pilot, flying a green Ord Pedrovia podracer. Gasgano raced for high-speed thrills, and his four spindly arms made him perfectly suited for racing, able to use all of his arms at once to pilot his pod. Extremely competitive, he disliked the prospect of losing, and joined the Boonta Eve Classic podrace, racing for Gardulla the Hutt on the desert planet Tatooine, which took place ten years prior to the intergalactic Clone Wars, in order to beat the local champion, the Dug Sebulba. Gasgano's competition also included two-time Boonta winner Boles Roor, returning Boonta competitor Dud Bolt, and the Er'Kit Ody Mandrell, who employed a team of record setting pit droids. Gasgano also had it in his mind to beat the human competitor Anakin Skywalker. The Boonta was held at the Mos Espa Grand Arena, and the Ord Pedrovia was placed in the middle of the third role, next to Roor's podracer, and directly behind Bolt's and Skywalker's racers.\nThe Troig race announcer Beed, speaking in Huttese, introduced Gasgano and his podracer shortly before the race's host, Jabba the Hutt, announced the official start of the race. The podracers darted off with the exception of two: Skywalker and Ben Quadinaros, both having stalled. It wasn't long before Gasgano was behind the leaders, having overtaken Mandrell, Roor, Bolt, and several other racers. Eventually, Skywalker repaired his podracer and entered the course, and overtook the pilots behind Gasgano. The crafty Xexto attempted to block Skywalker's attempts at passing, but was bested when the Human flew over the Ord Pedrovia following a cliff drop. Gasgano attempted to retake lost ground, and briefly overtook Skywalker after the Human lost a scuffle to Sebulba. However, the lead over Skywalker didn't last long, and Gasgano was trapped behind the two leaders. During the final stretch of the third lap, Sebulba crashed after a second tangle with Skywalker, allowing Gasgano to gain ground and beat at least one more competitor, albeit his last. Ultimately, Skywalker won the Boonta and Gasgano finished in second place.\nGasgano's four arms granted him an amount of dexterity that pilots with fewer limbs could not achieve. With greater control over his podracer, Gasgano's biology was uniquely suited for podracing. Gasgano was also very competitive and did what he could to make sure other pilots would not pass him. A Xexto, he stood 1.22 meters tall, and exhibited brown and white skin, with some splotches of purple around his face. His large eyes were solidly black.\nGasgano piloted an Ord Pedrovia podracer that was green in color. The cockpit had a camera installed on the back of it, which fed to a holoscreen on the dash. This device allowed Gasgano to monitor activity behind him. He used it to great affect throughout the race, including a moment where he was able to block all of Skywalker's attempts to pass. When racing, Gasgano wore goggles to protect his eyes.\nGasgano was created for the 1999 film Star Wars: Episode I The Phantom Menace, but first appeared in the film's novelization, written by Terry Brooks. In the novel, Gasgano not only participated in the Boonta, but in a race that took place before it as well. Detailed concept art of Gasgano was illustrated by Terryl Whitlatch, Jay Shuster, and Iain McCaig, while a detailed sculpture was created by the film's art department. In the film, Gasgano was rendered wholly with CGI.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gasgano",
  "/wiki/Gasgano/Legends",
  "/wiki/Troiken",
  "/wiki/Xexto",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Fodesinbeed_Annodue",
  "/wiki/Podracer",
  "/wiki/Pilot",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Podracing",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Ord_Pedrovia",
  "/wiki/Human",
  "/wiki/Anakin_Skywalker",
  "/wiki/Gardulla_Besadii_the_Elder",
  "/wiki/Hutt",
  "/wiki/Standard_year",
  "/wiki/The_galaxy",
  "/wiki/Clone_Wars",
  "/wiki/Dug",
  "/wiki/Sebulba",
  "/wiki/Boles_Roor",
  "/wiki/Dud_Bolt",
  "/wiki/Er%27Kit_(species)",
  "/wiki/Ody_Mandrell",
  "/wiki/DUM-series_pit_droid",
  "/wiki/Mos_Espa_Grand_Arena",
  "/wiki/Troig",
  "/wiki/Huttese",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Ben_Quadinaros",
  "/wiki/Eye",
  "/wiki/Cockpit",
  "/wiki/Camera",
  "/wiki/Viewscreen",
  "/wiki/Goggles",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Terry_Brooks",
  "/wiki/Terryl_Whitlatch",
  "/wiki/Jay_Shuster",
  "/wiki/Iain_McCaig",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Race_on_Tatooine",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Star_Pilot_(2015)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Databank_A-Z",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars_Inside_Intel:_Holidays_of_the_Galaxy",
  "/wiki/Star_Wars_Inside_Intel:_Podracing",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide",
  "/wiki/Databank_(original)"
 ]
}