{
 "name": "Gatha_Elbaphay",
 "display_name": "Gatha Elbaphay",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "A sentient species"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  }
 ],
 "content": "Gatha Elbaphay was an alien patron of the Canto Casino in the coastal city of Canto Bight on the planet Cantonica in 34 ABY. Elbaphay brought a pet Sheffi named Awgree to the casino and was stood with the pet in hand by one of the game tables when the Resistance agents Finn and Rose Tico passed by while searching for the Master Codebreaker. The patron had pink skin and black eyes and wore a black dress while at the casino.\nGatha Elbaphay was portrayed by creature performer Paul Warren in the 2017 film Star Wars: Episode VIII The Last Jedi, the second installment of the Star Wars sequel trilogy. Chris Clarke remotely controlled Elbaphay's animatronic face and Daisy Beattie remotely controlled Awgree while communicating with Warren via an earpiece. Warren also had a monitor inside the suit linked up to a small camera on the front of the costume that helped him to navigate. According to Nick Kellington, he was originally considered to play the patron alongside Warren during the Canto Casino sequence, but ultimately he was given the character of Snook Uccorfay and Warren performed the patron himself.\nCreature concept designer Luke Fisher designed Gatha Elbaphay and Michael Kaplan created the costume. The patron is not named in the film, but its production name was creature K010, and on set Elbaphay was refered to as the \"Dowager alien\" or \"Duchess\". In 2021, Lucasfilm Story Group member Pablo Hidalgo revealed that the name assigned to the character was Gatha Elbaphay, which he had derived from the character's placeholder name, \"Ms Elbowface\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_species_(Canto_Bight)",
  "/wiki/Color",
  "/wiki/Canto_Casino_and_Racetrack",
  "/wiki/City",
  "/wiki/Canto_Bight",
  "/wiki/Planet",
  "/wiki/Cantonica",
  "/wiki/34_ABY",
  "/wiki/Sheffi",
  "/wiki/Awgree",
  "/wiki/Casino",
  "/wiki/Limb",
  "/wiki/Resistance",
  "/wiki/Finn",
  "/wiki/Rose_Tico",
  "/wiki/Mission_to_Canto_Bight",
  "/wiki/Master_Codebreaker",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Paul_Warren",
  "/wiki/2017",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/Chris_Clarke",
  "/wiki/Nick_Kellington",
  "/wiki/Snook_Uccorfay",
  "/wiki/Luke_Fisher",
  "/wiki/Michael_Kaplan",
  "/wiki/2021",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/January_12",
  "/wiki/2018"
 ]
}