{
 "name": "Gatterweld",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Zsinj's Empire"
     ]
    }
   ]
  }
 ],
 "content": "Gatterweld was an Imperial stormtrooper, and later an Ensign in the forces of Warlord Zsinj.\nA tall and muscular Human with a black hair just a little longer than regulation allowed, Gatterweld was adept at hand-to-hand combat. He was generally solemn and non-conversational. As a stormtrooper, Gatterweld was assigned to the security detail of the Executor-class Star Dreadnought Razor's Kiss when it was under construction at Kuat Drive Yards. He was present when Zsinj made his attempt to capture the warship.\nAfter Zsinj's infiltration team got the ship under way, Gatterweld took control of the auxiliary bridge to try to regain command of the ship. But as Razor's Kiss was being pounded by the New Republic fleet, Gatterweld decided that he'd rather see Zsinj take command of the ship than let the Rebels destroy it. He contacted Iron Fist to offer Zsinj his assistance, and Zsinj tried to have his crew talk Gatterweld through the process of slaving the navigation computer of Razor's Kiss to Iron Fist.\nGatterweld was unsuccessful in his attempt to save Razor's Kiss, but he somehow escaped the destruction of the ship and was recovered by Zsinj's forces. Zsinj accepted Gatterweld into his fleet, and commissioned him as an Ensign on Iron Fist. He learned how to pilot some shuttles, but didn't have quick enough reflexes to be a starfighter pilot.\nEnsign Gatterweld was assigned to escort Gara Petothel after she \"defected\" to the Warlord's side. He followed Petothel like a shadow, until she made her escape from Iron Fist at the Battle of Selaggis. Petothel and her group of Project Chubar escapees subdued and bound Gatterweld and General Melvar, and left them on the flight deck as they departed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Zsinj%27s_Empire",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Ensign/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Razor%27s_Kiss",
  "/wiki/Kuat_Drive_Yards/Legends",
  "/wiki/Warship/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Solo_Fleet",
  "/wiki/Iron_Fist_(Executor-class)",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Gara_Petothel",
  "/wiki/Battle_of_Selaggis",
  "/wiki/Project_Chubar",
  "/wiki/General/Legends",
  "/wiki/Melvar",
  "/wiki/X-Wing:_Iron_Fist",
  "/wiki/X-Wing:_Solo_Command",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}