{
 "name": "Gauron_Nas_Tal",
 "display_name": "Gauron Nas Tal",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Saurin"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Gauron Nas Tal was a snarling Saurin combat trainer who worked for the Hutt crime lord Jabba Desilijic Tiure. Despite this, the trainer aimed to hunt down its employer by 4 ABY. Having accompanied him to the Great Pit of Carkoon for the execution of several prisoners, the Saurin was present for the shootout aboard Jabba's sail barge, the Khetanna. Guaron Nas Tal did not have a chance to take action against his quarry by the downfall of both the Hutt and the Khetanna at the battle's end.\nGauron Nas Tal was a snarling Saurin combat trainer who worked for the Hutt crime lord Jabba Desilijic Tiure, but planned to kill him. In 4 ABY, Nas Tal stood just outside the doorway to the throne room of Jabba's Palace on the planet Tatooine and lent in to listen as the droids R2-D2 and C-3PO played a hologram of their master, the Jedi Luke Skywalker, for the crime lord. In the message, Skywalker stated that he wished to bargain for the freedom of his friend Han Solo, whom Jabba held as a captive frozen in carbonite, and gifted Jabba the two droids as a sign of good will. The Hutt, however, declared that he had no interest in losing Solo and sent the droids to work.\nNas Tal later sat beside the Ugnaught Yoxgit in one of the throne room's booths when the Max Rebo Band performed the song \"Jedi Rocks\" for the court. After the band finished the song, Jabba demanded it be repeated, but during the second performance he tried to pull the enslaved dancer Oola closer to him. When she resisted him, the Hutt dropped her into the pit beneath the throne room, halting the band's performance. The Saurin rushed from his seat to a grating looking down into the pit, gleefully gesturing along with other cheering courtiers at the fate of the dancer. As they watched, Jabba's pet rancor, Pateesa emerged and devored the screaming Oola.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gauron_Nas_Tal",
  "/wiki/Gauron_Nas_Tal/Legends",
  "/wiki/Saurin",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/4_ABY",
  "/wiki/Gender",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Death_penalty",
  "/wiki/Prisoner",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Death",
  "/wiki/Throne",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Hologram",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Ugnaught",
  "/wiki/Yoxgit",
  "/wiki/Max_Rebo_Band",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Slavery",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}