{
 "name": "Gaya",
 "display_name": "Gaya",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  }
 ],
 "content": "Gaya was a Twi'lek female singer who rose to the heights of a galactic superstar during the First Order-Resistance War. She was a highly skilled performer who commanded respect and attention from those she met. In addition to her musical career, the superstar also fought for the integrity and freedom of the Twi'lek people and sometimes operated within the criminal underworld to achieve her goals.\nAt some point, she performed aboard the MPO-1400 Purgill-class star cruiser Halcyon, where she encountered Togruta aspiring musician Sandro Alimander who held her in high regard. While performing on the ship she was accompanied by Rodian keyboardist Ouanni. She performed the song \"Oola Shuka,\" which was played at Oga's Cantina in Black Spire Outpost on Batuu.\nThe concept for the ultimately canceled Kalikori Club venue intended for Star Wars: Galaxy's Edge included a Twi'lek proprieter and performer named Gaya, who may have also had ties to the underworld. Her ties to the underworld were later transferred to the character of Oga Garra, owner of Oga's Cantina. One of the songs played at Oga's Cantina since the opening of Galaxy's Edge was credited to a character named Gaya.\nEarly press information for Star Wars: Galactic Starcruiser, an upcoming hotel and entertainment experience set to open in 2022 at the Walt Disney World Resort, mentioned a \"galactic superstar\" that would perform at the hotel. According to audition material posted by The Walt Disney Company, the singer was conceptualized as a Mezzo Soprano and catergorized her musical style as a \"neo-soul, jazzy, funk\" hybrid. The audition form suggested that applicants for the role perform the song \"Abracadabra\" by Judith Hill.\nConcept art labeled \"Gaya\" was included in the book The Art of Star Wars: Galaxy's Edge with two pieces of artwork in the section dedicated to Star Wars: Galactic Starcruiser, though it did not confirm that she was the still-unnamed female Twi'lek entertainer that would appear at that hotel. Artist Brian Matyas posted the art to Instagram referring to Gaya as, \"Vocalist in a band that would play in the park and in the hotel.\" A presentation that was part of Disney's Destination D23 event on November 20, 2021 confirmed that Gaya was the performer at the hotel and revealed a photo of the character. A promotional video released on November 28 featured Gaya performing aboard the Halcyon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ryloth",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Katlock",
  "/wiki/Julen_Rakab",
  "/wiki/The_galaxy",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Music",
  "/wiki/MPO-1400_Purgill-class_star_cruiser",
  "/wiki/Halcyon",
  "/wiki/Togruta",
  "/wiki/Sandro_Alimander",
  "/wiki/Rodian",
  "/wiki/Ouanni",
  "/wiki/Oola_Shuka",
  "/wiki/Oga%27s_Cantina",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Batuu",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Gaya",
  "/wiki/Kalikori_Club",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Oga_Garra",
  "/wiki/Star_Wars:_Galactic_Starcruiser",
  "/wiki/2022",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/The_Art_of_Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Brian_Matyas",
  "/wiki/November_20",
  "/wiki/2021",
  "/wiki/November_28",
  "/wiki/Resistance_Reborn",
  "/wiki/Resistance_Reborn_(audiobook)",
  "/wiki/A_Crash_of_Fate",
  "/wiki/A_Crash_of_Fate_(audiobook)",
  "/wiki/Star_Wars:_Galaxy%27s_Edge_Oga%27s_Cantina:_R3X%27s_Playlist_1",
  "/wiki/Star_Wars:_Datapad_(Galactic_Starcruiser)",
  "/wiki/StarWars.com",
  "/wiki/Ships_of_the_Galaxy:_The_Halcyon_Starcruiser",
  "/wiki/May_17"
 ]
}