{
 "name": "Gaza",
 "display_name": "Gaza",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Herdessa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Herdessan Guild",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Gaza was a Human male who was one of the foremost members of the Herdessan Guild on the planet Herdessa during the Galactic Civil War.\nAlongside Brylin, the spokesman, and Tof, his aide, the three ruled over the planet's populace. Their oppressive government relied on the use of their security forces, led by the cyborg Lumiya. Lumiya, a member of the Galactic Empire, brought an Imperial presence to the world sometime after the Battle of Endor. Since a large percentage of the population was afraid to stand up to the government for fear of losing their homes, the guild was able to easily oppress the poor members of society, selling them into slavery and using torture if they attempted to resist.\nEventually, the Alliance of Free Planets visted Herdessa to negotiate a possible membership into the new growing government. However, Herdessa, already allied with the Empire, was not interested. Gaza and the other guild members entertained the Alliance delegation, which included Princess Leia Organa and Mon Mothma, but refused to discuss political matters. At the end of the day, they took most of the Alliance prisoner, intent on selling them into slavery. Organa, who had escaped capture, was able to rally the oppressed citizens, and they rose up against the guild and their allies. Gaza and the other guild members were taken into Alliance custody and held answerable for their crimes.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Herdessa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Herdessan_Guild",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Brylin",
  "/wiki/Tof_(Human)",
  "/wiki/Herdessan_shocktrooper",
  "/wiki/Cyborg/Legends",
  "/wiki/Lumiya",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Battle_of_Herdessa_(Nagai%E2%80%93Tof_War)",
  "/wiki/Star_Wars_(1977)_88"
 ]
}