{
 "name": "Ged",
 "display_name": "Ged",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Teth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Torrent Company",
      "Torrent Company"
     ]
    }
   ]
  }
 ],
 "content": "\"Ged\" was the nickname of a clone trooper who served in the Grand Army of the Republic during the Clone Wars. Ged was a member of the 501st Legion's Torrent Company, and served in the battles of Christophsis and Teth before he was killed in action on the Outer Rim planet Teth during the Republic's attempt to rescue Rotta, the child of Jabba Desilijic Tiure.\nIn 22 BBY, seven weeks after the First Battle of Geonosis, the Grand Army of the Republic's 501st Legion was deployed to the Outer Rim planet Christophsis. The Confederacy of Independent Systems had taken control of the strategically-valuable world, which was vital for its position in the Corellian Run hyperlane. After the Republic breached through the blockade around the planet, Jedi Generals Obi-Wan Kenobi and Anakin Skywalker led elements of the Thirteenth Army and the 501st into battle against the Confederacy forces in the capital city Chaleydonia, better known as the Crystal City. Although the beginning of the Battle of Christophsis was ridden with failure for the 501st, the clone soldiers of the 501st prepared their offensive against droid forces led by Confederacy General Whorm Loathsom.\nAfter the initial stages of the Battle of Christophsis concluded, the Confederacy launched a counterattack on the 501st's forces, whose only remaining hope was a battery of AV-7 Antivehicle Cannons. Although the 501st had lost all of its armor in the early days of the battle, the clone infantry prepared a defense against the overwhelming Confederacy forces. Ged, among his comrades in Torrent Company, was on the front line of this offensive. Although he managed to survive the counterattack before the droids retreated, Ged was injured on the shoulder by jagged shrapnel that had penetrated the gap between his backplate and shoulder armor, and reported back to the forward aid station for treatment.\nShortly after having his arm tended to by clone Sergeant Coric, the Confederacy attacked a second time. Ged once again entered the battle, this time following Skywalker and clone Captain CT-7567, \"Rex\" against a trio of octuparra droids encroaching on the Republic's AV-7 cannons. The clone forces took position above the main droid force and rappelled down into the fray, led by Skywalker. Led by the Jedi Knight, the clones were able to repel the droid attack once again, although they continued to sustain heavy casualties.\nAfter repelling the counterattack, the Republic was able to enjoy a lull in the previously relentless combat. However, the peace was not to last, as the Confederacy attacked once again, this time using an energy shield to guard their approach on the Republic's position. Led by Jedi General Obi-Wan Kenobi and clone Commander CC-2224 \"Cody\", the 501st—including Ged—once again engaged the droid forces once they entered the perimeter of the energy shield. As they were pushed back, Skywalker and his new padawan, Ahsoka Tano, desperately attempted to shut down the energy shield to allow the Republic's cannons to fire upon the droids. After the defeat of the Confederacy forces, Ged and the rest of Torrent Company were recalled for a new assignment to the Outer Rim world of Teth.\nThe 501st was given little time to recover from the meat-grinder of Christophsis, and was deployed directly to Teth, an Outer Rim planet bordering on the Wild Space region. The unit was assigned to recapture Rotta, the offspring of Jabba Desilijic Tiure. According to intelligence, the Huttlet was being held inside a former B'omarr Order monastery on the planet. Ged was assigned to the mission along with the men of Torrent Company, disregarding his wounds. His unit sustained heavy casualties as they were forced to scale the sheer walls of the monastery, but Ged was able to survive the ascent. Once they arrived at the monastery, the surviving members of Torrent Company prepared to defend the entrance while Skywalker and Tano retrieved the Hutt.\nOnce the Hutt was recaptured, the Republic force once again came under attack from at least one squadron of Confederacy vulture starfighters and battle droids. The survivors of Torrent Company assumed positions at the entrance of the monastery, preparing traps for the oncoming onslaught of enemy forces. Ged was one of the forty-two combat-ready soldiers left in the company as the clones prepared to defend the monastery, buying time for the Jedi to escape with the Hutt. Preparing for an overwhelming assault, Ged readied a tripwire in front of the door, while the rest of the unit laid ordinance in the alcoves of the monastery walls and even in their backpacks. Torrent Company was prepared to defend till the last man, and would force the droids to walk over their dead bodies to reach the Jedi.\nThe droid forces, led by Sith Assassin Asajj Ventress, made short work of the heavy door guarding the monastery entrance. As the droids marched through the doorway, Ged's charges detonated, and the clone troopers opened fire. Ged was gunned down by the onslaught of battle droids entering the monastery, along with most of his comrades. However, the soldiers were able to hold off the Confederacy long enough for Skywalker to complete the mission, but at a great cost. In the aftermath of the battle, just six members of Torrent Company would remain.\nAs a male Human clone of bounty hunter Jango Fett, Ged stood 1.83 meters tall. Ged was a competent clone soldier, and was eager to fight on Christophsis, and subsequently Teth, even after being injured.\nGed was equipped with a set of phase I clone trooper armor, and also carried supplies to create a tripwire during the Battle of Teth.\nGed first appeared in the 2008 novelization of the Star Wars: The Clone Wars film by Karen Traviss.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Teth/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Torrent_Company/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Battle_of_Christophsis/Legends",
  "/wiki/Battle_of_Teth/Legends",
  "/wiki/Death",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Rotta/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/501st_Legion",
  "/wiki/Outer_Rim_(quadrant)",
  "/wiki/Christophsis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Corellian_Run/Legends",
  "/wiki/Hyperlane",
  "/wiki/Jedi_General/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Thirteenth_Army",
  "/wiki/Chaleydonia/Legends",
  "/wiki/Droid_Army",
  "/wiki/General",
  "/wiki/Whorm_Loathsom/Legends",
  "/wiki/AV-7_Antivehicle_Cannon",
  "/wiki/Battle_droid/Legends",
  "/wiki/Forward_aid_station",
  "/wiki/Star_Wars:_The_Clone_Wars_(novelization)",
  "/wiki/Sergeant/Legends",
  "/wiki/Coric",
  "/wiki/Captain/Legends",
  "/wiki/CT-7567/Legends",
  "/wiki/Octuptarra_magna_tri-droid",
  "/wiki/Cannon/Legends",
  "/wiki/Rappel_line",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Energy_shielding",
  "/wiki/Jedi/Legends",
  "/wiki/Commander/Legends",
  "/wiki/CC-2224/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Teth",
  "/wiki/All_Terrain_Tactical_Enforcer/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/B%27omarr_Monastery_(Teth)",
  "/wiki/Monastery/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Trap_(tactic)",
  "/wiki/Sith/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/2008",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Karen_Traviss",
  "/wiki/Star_Wars:_The_Clone_Wars_(audiobook)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Cloning",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones_(novelization)",
  "/wiki/Clone_trooper",
  "/wiki/Battle_of_Teth",
  "/wiki/Standard_year/Legends",
  "/wiki/The_Clone_Wars:_Wild_Space",
  "/wiki/The_Essential_Atlas"
 ]
}