{
 "name": "Geezum",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Snivvian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Geezum was a Snivvian male who in 4 ABY was present in the palace of the crime lord Jabba Desilijic Tiure when the Jedi Luke Skywalker killed Jabba's rancor Pateesa. While the Snivvian watched, the crime lord sentenced Skywalker and his allies Han Solo and Chewbacca to death, ordering they be fed to the sarlacc.\nGeezum traveled to view the executions on board the sail barge Khetanna, conversing with the Ugnaught Yoxgit and a human guard en route. Upon reaching the pit, Skywalker managed to defeat the guards accompanying him while the slave Leia Organa plunged Geezum and the other passengers of the barge into darkness by closing its shutters. She then killed Jabba, and together with Skywalker, destroyed the barge.\nThe Snivvian male Geezum was present in the palace of the Hutt crime lord Jabba Desilijic Tiure on the planet Tatooine in the year 4 BBY, during a performance of the song \"Jedi Rocks\" by the Max Rebo Band. The Snivvian sat in one of the throne room's booths with the bounty hunter Amanaman while the band performed for the court, after which Jabba demand it be played again.\nThe second performance was however interrupted when the enslaved dancer Oola refused the Hutt's advances, causing the crime lord to drop her into the pit beneath the throne room. Many court members then eagerly watched her be devored by Jabba's pet rancor, Pateesa, after which blaster fire in the throne room entry way drew their attention. The source was revealed to be Princess Leia Organa, who was disguised as the bounty hunter Boushh and entered with the Wookiee Chewbacca as her prisoner. After negotiating with Jabba over the bounty on Chewbacca using a thermal detonator, Organa agreed to a price, but was later captured by Jabba herself after freeing the smuggler Han Solo from carbonite.\nHe was later present when the Jedi Knight Luke Skywalker killed the criminal's pet rancor, Pateesa, after Jabba tried to feed the Jedi to the beast. Geezum stood in the palace's throne room as Skywalker was dragged from the rancor's pit before Jabba alongside his Rebel allies Han Solo and Chewbacca, who had been being held in the Hutt's dungeons.\nJabba sentenced the three prisoners to death, declaring they would be fed to the sarlacc that lived in the Dune Sea. Geezum then accompanied Jabba and much of his court onboard the Hutt's personnel sail barge Khetanna to witness the executions. While the barge traveled, Geezum stood at one of its windows conversing with the Ugnaught Yoxgit and one of Jabba's human henchmen. As the trio conversed, the protocol droid C-3PO, who was serving as the Hutt's translator, bumped into the astromech droid R2-D2 in front of them, spilling several of the drinks the astromech had been serving to the barge's passengers.\nUpon reaching the Great Pit of Carkoon where the sarlacc dwelt, Geezum stood behind Jabba and his slave Princess Leia Organa while the Hutt offered Skywalker and his allies a final chance to plead for their lives. Before he could be pushed into the pit, the Jedi managed to overpower the guards on the Bantha-II cargo skiff he was being transported on using his lightsaber, which R2 had been secretly carrying for him. Organa used the distraction to close the barge's shutters, plunging Geezum and the other passengers into darkness.\nAs the Snivvian dashed around the barge in a panic with the other members of the court, Organa strangled Jabba using her chains. Skywalker then managed to board the Khetanna and together with Organa destroyed it before escaping with the rest of his allies.\nGeezum was a sociopathic Snivvian who had fair skin, brown hair and black eyes.\nWhile on Tatooine, Geezum wore a white shirt and pants with a brown scarf, gloves and boots. He wore a black belt and an orange Bandolier.\nGeezum was portrayed by Peter Allen in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The palace throne room scenes were filmed between January 25 and February 8, 1982 on Stage 8 at Elstree Studios and the sail barge interior shots filmed on Stage 9 between February 9 and February 11. In the current Star Wars canon, the character was first identified in the 2017 reference book Star Wars: The Visual Encyclopedia. The name Geezum originated in the Star Wars Legends continuity, where if first appeared on a card in the 1998 \"Jabba's Palace Limited\" set of cards for the Star Wars Customizable Card Game released by Decipher, Inc..",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Geezum",
  "/wiki/Geezum/Legends",
  "/wiki/Snivvian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/4_ABY",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Death",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Sarlacc",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Ugnaught",
  "/wiki/Yoxgit",
  "/wiki/Human",
  "/wiki/Slavery",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Hutt",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Standard_year",
  "/wiki/4_BBY",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Max_Rebo_Band",
  "/wiki/Bounty_hunter",
  "/wiki/Amanaman",
  "/wiki/Oola",
  "/wiki/Blaster",
  "/wiki/Prince",
  "/wiki/Boushh",
  "/wiki/Wookiee",
  "/wiki/Prisoner",
  "/wiki/Bounty",
  "/wiki/Thermal_detonator",
  "/wiki/Smuggler",
  "/wiki/Carbonite",
  "/wiki/Jedi_Knight",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Dune_Sea",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Translator",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Bandolier",
  "/wiki/Peter_Allen",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/January_25",
  "/wiki/February_8",
  "/wiki/1982",
  "/wiki/Elstree_Studios",
  "/wiki/February_9",
  "/wiki/February_11",
  "/wiki/Star_Wars",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Legends",
  "/wiki/1998",
  "/wiki/Jabba%27s_Palace_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/The_Making_of_Return_of_the_Jedi"
 ]
}