{
 "name": "Gehren_Rand",
 "display_name": "Gehren Rand",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Kybuck Clan",
      "Kybuck Clan"
     ]
    }
   ]
  }
 ],
 "content": "Gehren Rand was a human female Jedi Initiate who was part of the Kybuck Clan during her time at the Jedi Temple. The night before Rand and her fellow Jedi Initiate Obi-Wan Kenobi were supposed to leave for Ilum to participate in the Gathering, she left the Jedi Temple to go help her father, whom she had been seeing in danger in Force visions. She eventually made a deal with the Black Sun Lieutenant Nodrus Cay to be taken offworld in exchange for Eadun silver.\nKenobi eventually caught up with Rand and after being introduced to Cay and her underlings, decided to accompany Rand on her journey as he could not imagine a life without her kinship and comfort. Cay, having learned the two were Jedi, decided that she wanted to take them into her service and had them cuffed. \nThe two Initiates eventually managed to escape, though Rand did not return to the Temple with Kenobi, and instead left to help her father. Years later, Kenobi wrote in his journal that he never saw Rand again, and that he did not know what became of her or if she was able to save her father. Kenobi also noted that his only hope was that she had not succumbed to her fear.\nGehren Rand was a human female with blond hair and blue eyes.\nGehren Rand was created for the Star Wars: Obi-Wan comic series by Christopher Cantwell, and appeared in flashbacks in its first issue, illustrated by Ario Anindito and published by Marvel Comics on May 4, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Kybuck_Clan",
  "/wiki/Jedi_Initiate",
  "/wiki/Time",
  "/wiki/Imperial_Palace",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Ilum",
  "/wiki/The_Gathering",
  "/wiki/Force_vision",
  "/wiki/Black_Sun",
  "/wiki/Lieutenant_(criminal)",
  "/wiki/Nodrus_Cay",
  "/wiki/Stuncuffs",
  "/wiki/Standard_year",
  "/wiki/The_Journals_of_Ben_Kenobi",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Gehren_Rand",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Star_Wars:_Obi-Wan_(comic_series)",
  "/wiki/Christopher_Cantwell",
  "/wiki/Obi-Wan_1",
  "/wiki/Ario_Anindito",
  "/wiki/Marvel_Comics",
  "/wiki/May_4",
  "/wiki/2022",
  "/wiki/StarWars.com"
 ]
}