{
 "name": "Gel",
 "display_name": "Gel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Between 67 BBY and 62 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Dalicron-4"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Gel was a male Human Jedi who fought for the Galactic Republic during the Clone Wars, Following the rise of the Galactic Empire, Gel went into hiding on the planet Dalicron-4 and settled as a farmer. In 3 ABY, Gel sent a message to the Rebel Alliance requesting that the Rebels take to safety the boy Caeleb, a child strong in the Force who lived on Dalicron-4 close to Gel's farm. However, the Whiphid Dark Jedi came to Dalicron-4 seeking Caeleb and interrogated Gel for information concerning the child's location. The Jedi was fatally injured and subsequently died from his injuries.\nGel was Force-sensitive male Human who was born between 67 BBY and 62 BBY and served the Jedi Order during the waning years of the Galactic Republic. Within the Order he trained as a Jedi Guardian, a combat-orientated Jedi specialization. Following the outbreak of the Clone Wars in 22 BBY, a tumultuous conflict between the Republic and the separatist Confederacy of Independent Systems, Gel took up arms on the side of the Republic.\nIn the aftermath of the Clone Wars, the Jedi were outlawed and hunted by the Republic's successor, the Galactic Empire. Gel went into hiding on the sparsely-populated planet Dalicron-4 in the Outer Rim Territories and settled as a farmer on a farm several hours travel from the settlement Dalia. He became a grandfather to the Force-sensitive female Jhara, who dwelled with him at his farm, and he also came to watch over the Caeleb, the prophesied \"Child of Light,\" a boy strong in the Force who lived in a nearby homestead. Gel on occasion spoke to Jhara of the place where Caeleb resided, a spot created by the ancient Jedi Master Duumas that was devoid of the Force, though he never took her there.\nGel came to fear that the Empire and the Dark Lord of the Sith Darth Vader would learn of Caeleb and seek to exploit the boy for their own ends. In 3 ABY, the elderly Jedi sent a message to the Rebel Alliance, an anti-Imperial resistance movement, to request that the Rebel Jedi Luke Skywalker come to Dalicron-4 and escort Caeleb and Caeleb's mother and father to a safer location. Gel then dispatched Jhara to Dalia to await Skywalker's arrival, with instructions to escort the Rebel Jedi to Gel's farm. However, Skywalker was unavailable to travel to Dalicron-4 and he assigned a group of Rebel agents to make contact with Gel in his stead.\nAround this time, the Dark Jedi Thaum Rystra plotted to apprehend Caeleb and dispatched his apprentice, the Whiphid Tol Skaros, to capture the child. Skaros confronted Gel at the Jedi's farm and the Whiphid's nek battle dogs assaulted the Jedi. In a bedroom of the farm, Skaros tortured Gel and threatened to feed Jhara to the neks if the Jedi did not reveal Caeleb's location. Though Gel attempted to resist, he was not strong enough to fend off the Dark Jedi's assault and through the Force Skaros discerned Caeleb's location from the Jedi's mind. The Whiphid stabbed Gel in the chest and departed to hunt Caeleb, leaving the Jedi for dead. Fatally injured, Gel retained partial consciousness despite loosing large amounts of blood; his body was shattered by the assault: his arms were broken in several places, his legs were twisted at odd angles and his face was bruised.\nIn the wake of the attack, Jhara and the Rebels arrived at the farm and found the dying Gel. The Jedi expressed gratitude that his granddaughter was still alive and provided the Rebels details of Caeleb's location. With his last breaths, Gel pleaed that the Rebels save Caeleb, then passed away as a result of his wounds. Jhara wept uncontrollably at her grandfather's passing and placed his boy on a bed and covered it up. Jhara and the Rebels subsequently confronted Skaros and rescued Caeleb.\nAfter settling on Dalicron-4, Gel came to believe that he had failed as a Jedi. He was concerned for Caeleb's wellbeing and when Skaros forced the boy's location from the elderly Jedi, Gel believed that he had failed the Force again. He cared deeply for Jhara and was relieved to see her in the moments before his passing, having been concerned that she may have came to harm at Skaros' hands. He regarded his Whiphid assailant as pure evil.\nGel was proficient in the power See Force and in the use of the Force to dissipate energy and conceal his presence.\nAt his farm on Dalicron-4, Gel was equipped with a green-bladed lightsaber and a blaster carbine that he had retained from his Clone Wars service. He also carried on his person a bottle of fruit liquor.\nGel featured in Child of Light, a 2000 roleplaying adventure set within Star Wars Legends continuity and written by Lee Pickler as the opening instalment of RPGA's Child of Light saga. He was subsequently referenced in the second and third adventures of the saga, Soulsaber and Light and Dark, published in 2001 and 2002 respectively.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/67_BBY",
  "/wiki/62_BBY/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Dalicron-4",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Farmer/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Caeleb",
  "/wiki/The_Force/Legends",
  "/wiki/Farm/Legends",
  "/wiki/Whiphid/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Death/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Dalia_(township)",
  "/wiki/Jhara",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Duumas",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Caeleb%27s_mother",
  "/wiki/Caeleb%27s_father",
  "/wiki/Time/Legends",
  "/wiki/Thaum_Rystra",
  "/wiki/Tol_Skaros",
  "/wiki/Nek/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Sense_Force",
  "/wiki/Tutaminis",
  "/wiki/Force_stealth",
  "/wiki/Color/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Blaster_carbine/Legends",
  "/wiki/Fruit/Legends",
  "/wiki/Liquor/Legends",
  "/wiki/Child_of_Light",
  "/wiki/2000",
  "/wiki/Roleplaying_game",
  "/wiki/Lee_Pickler",
  "/wiki/RPGA",
  "/wiki/Child_of_Light_saga",
  "/wiki/Soulsaber_(adventure)",
  "/wiki/Light_and_Dark_(adventure)",
  "/wiki/2001",
  "/wiki/2002",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Star_Wars_Roleplaying_Game_Revised_Core_Rulebook",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}