{
 "name": "Gelune Blankuna",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Desilijic kajidic"
     ]
    }
   ]
  }
 ],
 "content": "Gelune Blankuna was a Twi'lek agent of the Desilijic Hutt clan. She was married to Jer Blankuna.\nAt some point, the Desilijic clan were competing against newcomer crime lord Kaeline Ungasan and his minion, a young Twi'lek by the name of Ree, for the control of podracing in Ando Prime. The Desilijic family ordered the Blankunas to pretend to be Ree's parents and hire some independent agents to track Ree. The Hutts forged some records of the previous family history, including a rags-to-riches tale of shipping industry, and placed the Blankunas in a mansion in the orbit of Alderaan where they were supposed to live, surrounded by Human servants.\nThe Blankunas conducted a job interview with the candidates in their presumed home, sending a YT-1300 light freighter, the Fleen, to collect them. The Twi'leks made a convincing performance as worried parents, with Mrs. Blankuna retiring to a different room to cry. They hired the candidates; talked about a Tatooinian Dug, Benkudi, who had supposedly contacted the Blankunas to negotiate the sale of information on Ree; and provided their new employees with a datapad including images of Ree. The datapad included a tracking device so that the Desilijic Gamorrean mercenaries and their leader Davon Gitta could find these agents as soon as they find Ree.\nAs soon as the interview was over, the Desilijic moved the Blankunas and changed their names. The orbital mansion was re-sold to Alderaanian Humans Sumda and Jylle Tend.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Desilijic/Legends",
  "/wiki/Kajidic/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Jer_Blankuna",
  "/wiki/Kaeline_Ungasan",
  "/wiki/Ree",
  "/wiki/Podracing/Legends",
  "/wiki/Ando_Prime/Legends",
  "/wiki/Alderaan_orbital_mansion",
  "/wiki/Alderaan/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Fleen",
  "/wiki/Tatooine/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Benkudi",
  "/wiki/Datapad/Legends",
  "/wiki/Homing_beacon/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Davon_Gitta",
  "/wiki/Sumda_Tend",
  "/wiki/Jylle_Tend",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Gelune_Blankuna",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Snow_Job",
  "/wiki/Star_Wars_Gamer_2"
 ]
}