{
 "name": "Gen_Tiraan",
 "display_name": "Gen Tiraan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chandrila"
     ]
    },
    {
     "name": "Born",
     "values": [
      "30 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.5 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Incom Corporation",
      "A shipping company"
     ]
    }
   ]
  }
 ],
 "content": "Gen Tiraan was a Human male who was born on the planet Chandrila in 30 BBY. He worked as a starship engineer for Incom Corporation and was a member of the team that developed the X-wing starfighter. He left Incom after the Battle of Endor, relocated to the Corellian system, and developed a new sublight engine, which in 7 ABY attracted the attention of both the Galactic Empire and the New Republic.\nBy that same year, the New Republic had posted a reward of 5,000 credits for his capture, even though he had committed no crimes against the fledgling government. A description of Tiraan, including his past, was included in General Airen Cracken's datapad dossier \"Wanted by Cracken.\"\nIn 30 BBY, Gen Tiraan was born on Chandrila, a planet in the Bormea sector. From an early age, he developed a talent for starship engineering and commenced employment with the Incom Corporation in that capacity. There, he joined a design team that created the X-wing starfighter, which later became a hallmark of the Rebel Alliance. When the Galactic Empire nationalized the Incom Corporation, Tiraan was forced to continue working for the company, even when members of Incom's senior design staff defected to the Alliance with plans and prototypes of the starfighter.\nShortly after the Battle of Endor in 4 ABY, Tiraan left Incom. Knowledge of his availability for employment spread, and he was sent multiple job offers from various companies, but he refused most of them. He chose to work for a shipping company in the Corellian system and, by 7 ABY, he designed an innovative engine that was more efficient than other models of the time. This drew the attention of both the Empire, who sought skilled engineers to rebuild their military, and the New Republic, who wished to prevent Tiraan's skills from falling into the Empire's employ.\nBy that same year, the New Republic had issued a small bounty of 5,000 credits to capture Tiraan. New Republic General Airen Cracken included the engineer in the \"Special Cases\" section of his dossier \"Wanted by Cracken\", a datafile containing details for individuals of interest to the New Republic. In it, Cracken advised New Republic agents that in approaching Tiraan, they should warn him that a warrant for arrest may be issued if he was uncooperative. From one of the Corellian system's planets, Tiraan sent a scrambled transmission containing technical specifications of the engine he had designed. A New Republic agent intercepted the transmission, although the New Republic struggled to decipher it.\nA group of New Republic agents were tasked with finding and recovering Tiraan before the Empire could kidnap him entered the Corellian system. The agent who intercepted the transmission provided them a copy as they arrived in-system and advised the group that the Imperials were trying to force him to their service.\nA Human male, Tiraan stood 1.5 meters tall and had facial hair styled as a goatee, while the hair on his head was straight and parted down the middle. He was a hardworking, smart, and ambitious individual, becoming the youngest member of Incom's X-wing design team. Tiraan also knew his capabilities, refusing offers from several companies after leaving Incom.\nWhile a compliant citizen of the Empire who did not take the opportunity to defect, the engineer still had to be forced to continue working for Incom when the Empire nationalized the company. After developing the new sublight engine, he similarly did not take to the Empire's efforts to recruit him, prompting the Empire to hound him in an attempt to force him to their service. Tiraan was not prone to breaking the law, attracting no charges or warrants for arrest by the New Republic.\nTiraan was skilled in engineering of starships, including starfighters and transports. This was developed even in his early years, and he was the youngest member of the X-wing development team. He also had technical abilities, capable of programming, repairing, and maintaining droids, such as his own R2-series astromech droid. The engineer had the acumen and capability to scramble a transmission containing sensitive schematics prior to transmitting, such that it required much effort by the New Republic to unscramble it.\nTiraan wore a short sleeve shirt with an apron on top to protect the shirt from stains. He had fingerless gloves and a belt that could have tools and a pouch attached to it. The pants Tiraan wore had long and round pockets on the thighs that could hold smaller hand tools, and he wore flat-soled shoes on his feet. The engineer often carried a pocket computer, datapad, and comlink alongside his various tools. Tiraan also had his own R2-series astromech droid that accompanied him.\nGen Tiraan was introduced in Wanted by Cracken, a 1993 sourcebook for West End Games' Star Wars Roleplaying Game written by Louis J. Prosperi. An image of Tiraan accompanied his entry in the book, illustrated by Mike Jackson, who had modeled the engineer on an uncredited Mike Fitzpatrick. For the game, Tiraan has high boosts to his technical skills, particularly \"space transports repair\" and \"starfighter repair.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Chandrila/Legends",
  "/wiki/30_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Incom_Corporation/Legends",
  "/wiki/Unidentified_shipping_company",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/X-wing_development_team",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Corellian_system",
  "/wiki/Sublight_drive",
  "/wiki/7_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Wanted_by_Cracken",
  "/wiki/Bormea_sector/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Time/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Datafile/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Unidentified_New_Republic_agent_(Gen_Tiraan)",
  "/wiki/Roleplaying_game",
  "/wiki/Hair/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Gen_Tiraan%27s_R2-series_astromech_droid",
  "/wiki/Shirt",
  "/wiki/Clothing/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Pocket_computer",
  "/wiki/Comlink/Legends",
  "/wiki/R2-series_astromech_droid",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/1993",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Louis_J._Prosperi",
  "/wiki/Mike_Jackson",
  "/wiki/Mike_Fitzpatrick",
  "/wiki/Realspace/Legends",
  "/wiki/Category:Images_of_Gen_Tiraan",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}