{
 "name": "Gendar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Outcasts"
     ]
    }
   ]
  }
 ],
 "content": "Gendar was a male Human native to the Undercity of Taris.\nGendar was the village leader, like his father and grandfather before him, and maintained some semblance of decency in the impoverished community.\nSometime before the attack on the Endar Spire, Igear, the village shopkeeper, planned to usurp Gendar's role. Igear had much different ideas about survival within the Undercity. He believed that his ability to make deals and his running of the shop meant he deserved all the profits, regardless of those people who would bring salvage to him in the first place, whereas Gendar believed that all the Outcasts should look out for each other.\nJealous of Gendar's position as leader, Igear planned to become leader by hoarding his inventory until supplies and food became scarce. Then, when everyone became desperate, he would give such supplies to the Outcasts in hopes they would become loyal to him, allowing him to take over as village leader. Gendar discovered Igear's plans before they came to fruition, and never trusted him again. However, he chose not to banish Igear because of his skillful ability to make deals.\nGendar had always been skeptical of the tales that elderly outcast Rukil always told of the Promised Land. When an amnesiac Revan, a former Sith Lord arrived at the village, Gendar greeted the upworlder, and gave him directions and knowledge of recent events which consisted of Sith troopers, mercenaries and swoop gang members and where he last saw Mission Vao and Zaalbar; whom Revan was looking for.\nRevan then saved Hendar from a rakghoul attack, and then returned with a cure for the rakghoul disease for the Outcasts that were infected. This pleased Gendar. When Revan gave Rukil the journals of his descendants, Rukil then managed to locate the Promised Land and notified Gendar.\nWhen Rukil showed him journals that revealed the location of the Promised Land, Gendar was shocked and amazed. Though he realized that the journey to the Promised Land would take weeks, or perhaps months, and that they'd have to cross many rakghoul infested areas, he noted that the Promised Land offered much better lives for him and his people. The knowledge that their supplies were also high helped cement Gendar's decision to leave the Undercity in search of the Promised Land.\nUnlike many Outcasts Gendar was kind, and greeted Revan calmly. When Revan cured the infected outcasts he was proud of Revan, and regretted to have nothing of a reward, save the kindness of his people. He also believed that individuals should look out for each other and stick together, and also share with supplies equally.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/Outcast_village",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Iolan_Gendarr",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Outcasts_(Taris)",
  "/wiki/Revan/Legends",
  "/wiki/Undercity_(Taris)",
  "/wiki/Gendar%27s_father",
  "/wiki/Gendar%27s_grandfather",
  "/wiki/Attack_on_the_Endar_Spire",
  "/wiki/Endar_Spire",
  "/wiki/Igear",
  "/wiki/Rukil",
  "/wiki/Promised_Land",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith_trooper_(Sith_Empire)",
  "/wiki/Mercenary/Legends",
  "/wiki/Swoop_gang/Legends",
  "/wiki/Mission_Vao",
  "/wiki/Zaalbar",
  "/wiki/Hendar",
  "/wiki/Rakghoul",
  "/wiki/Rakghoul_serum",
  "/wiki/Rakghoul_disease",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/3956_BBY"
 ]
}