{
 "name": "Geode",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vint"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vintian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Byne Guild"
     ]
    }
   ]
  }
 ],
 "content": "Geode was a Vintian male who acted as the navigator of the transport starship Vessel alongside the pilot Leox Gyasi and copilot Affie Hollow. His appearance resembled a tall, dark gray, flinty, flaky rock. According to Gyasi, Geode's true name could only be pronounced by those without a mouth. The Vessel was transporting Jedi to the Starlight Beacon for its dedication when the Great Hyperspace Disaster struck.\nAround the year 232 BBY, Geode acted as the navigator of the transport starship Vessel alongside his crewmates, the pilot Leox Gyasi and copilot Affie Hollow. The Vessel was assigned to transport four Jedi to the Starlight Beacon for its dedication. The Padawan Reath Silas was confused by Geode's nature, but Jedi Knight and Wayseeker Orla Jareni gave him a friendly greeting. Geode was motionless as he produced the coordinates to navigate the ship away from Coruscant. As the Vessel traveled through hyperspace, Silas was startled to see Geode in the mess hall and wondered how the Vintian had moved or been moved from the cockpit to that location. Geode was present as Silas and Hollow discussed the Jedi and celibacy. Later in the cockpit, Gyasi received explanations about the Jedi from Hollow and Geode, specifically their interpersonal relationships.\nAs the journey continued, Gyasi noticed that something was wrong with hyperspace traffic and the directions in which other ships were travelling. When Gyasi asked Geode if he had also noticed the readouts, Geode was ominously silent. A disaster struck when the transport freighter Legacy Run collided with a Nihil Stormship deliberately placed in its path by Marchion Ro, the Eye of the Nihil. The Vessel had to act quickly as they tried to avoid the debris spread across the hyperlanes, but the ship was struck despite their best efforts. When Gyasi realized it had come from a passenger craft, he said in his frustration he wished it had been \"any damn rock out there in space,\" then quickly told Geode that he meant no offense, and Geode silently indicated that none was taken.\nGeode possessed the appearance of a tall, dark gray rock, with a flinty and flaky surface that sparkled slightly in the light of hyperspace. Hollow described Geode as initially shy before he got to know a being, while Gyasi describe Geode as a wild man and a party animal except when it came to the business of navigation.\nGeode frequently flirted with women of various species, having a reputation as being \"on the prowl\" to Leox Gyasi and Affie Hollow. Despite anatomical incompatibility between Vintians and humans, Geode flirted with Pikka Adren aboard Starlight Beacon even in front of her husband Joss Adren.\nGeode first appeared in the 2021 young-adult novel The High Republic: Into the Dark, written by Claudia Gray. In the live stream launch event for Star Wars: The High Republic on January 4, 2021, Gray provided a brief introduction to the character prior to his debut appearance. He was first pictured in the Leox Gyasi episode of Characters of Star Wars: The High Republic, which was released on March 5, 2021.\nOn March 7, 2021, Forbes.com published a contributor article about Geode by geologist David Bressan.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Geode_(rock)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Geode",
  "/wiki/Vint",
  "/wiki/Vintian",
  "/wiki/Gender",
  "/wiki/Byne_Guild",
  "/wiki/Navigator",
  "/wiki/Transport",
  "/wiki/Starship",
  "/wiki/Vessel",
  "/wiki/Pilot",
  "/wiki/Leox_Gyasi",
  "/wiki/Affie_Hollow",
  "/wiki/Color",
  "/wiki/Mouth",
  "/wiki/Jedi",
  "/wiki/Starlight_Beacon",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Standard_year",
  "/wiki/232_BBY",
  "/wiki/Padawan",
  "/wiki/Reath_Silas",
  "/wiki/Jedi_Knight",
  "/wiki/Wayseeker",
  "/wiki/Orla_Jareni",
  "/wiki/Coruscant",
  "/wiki/Reproduction",
  "/wiki/Class_A_modular_freight_transport",
  "/wiki/Legacy_Run",
  "/wiki/Nihil",
  "/wiki/Stormship",
  "/wiki/Marchion_Ro",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Hyperspace_route",
  "/wiki/Hyperspace",
  "/wiki/Pikka_Adren",
  "/wiki/Joss_Adren",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/Claudia_Gray",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/January_4",
  "/wiki/Characters_of_Star_Wars:_The_High_Republic",
  "/wiki/March_5",
  "/wiki/March_7",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_6",
  "/wiki/The_High_Republic_Adventures_(2021)_7",
  "/wiki/No_Stone_Unturned",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/The_Art_of_Star_Wars:_The_High_Republic_(Phase_One)",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/March_12"
 ]
}