{
 "name": "Geonosian_spy",
 "display_name": "Geonosian spy",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Geonosis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Geonosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "This Geonosian spy, a male being, was a member of the Confederacy of Independent Systems during the Clone Wars. He was sleeping in the catacombs below a droid foundry, which was surrounded by the Galactic Republic forces during the Second Battle of Geonosis. After being accidentally awakened by Jedi Padawans Barriss Offee and Ahsoka Tano, who were trying to destruct the foundry by destroying its main generator, the spy started to follow their track. After spotting them and hearing about their plan to destroy the generator, he swiftly informed Geonosian Archduke Poggle the Lesser about it. The Archduke then confronted the Jedi with his warriors, but they were unsuccessful to prevent the destruction of the generator, and the foundry was destroyed.\nThe Geonosian spy, a male individual, was a member of the Confederacy of Independent Systems during the Clone Wars, and served under the command of Warlord Poggle the Lesser, the Archduke of Geonosis. During the Second Battle of Geonosis around 22 BBY, the Geonosian was located in a droid foundry, which manufactured battle droids to the Separatist Droid Army, when it was surrounded by Galactic Republic forces. The spy was sleeping in a small hall in the catacombs beneath the foundry, when the Jedi Padawans Ahsoka Tano and Barriss Offee stumbled across the hall. The pair was tasked with destroying the main generator of the foundry, which would cause the whole factory to collapse.\nWhen the Padawans tried to sneak past the hall, the sleeping Geonosian spy unknowingly placed his hand on Offee's head, who quickly halted. The Jedi managed to escape and the pair continued their journey, but the Geonosian awoke only seconds after. Unsure about the situation, he armed himself with a Geonosian sonic blaster and started to follow the Jedi. He soon caught up with them, and, staying unseen, spied on the Padawans and heard them speaking about their mission to destroy the generator. The spy then quickly ran to report to Poggle the Lesser, who was conferring with his T-series tactical droid TX-21. After the Geonosian spy revealed the presence of the Jedi duo to the Warlord and the droid, TX-21 questioned how the Jedi managed to get past the security of the foundry. Poggle the Lesser nonetheless ordered the Jedi to be stopped, and left to confront Offee and Tano with TX-21, couple of Geonosian warriors and a super tank. Despite this, the generator was eventually destroyed by the Jedi, and the factory was ruined by the following explosion.\nAfter being accidentally awakened by the Jedi, the Geonosian spy, uncertain about the trespassers, chose to investigate the catacombs. When he found the intruders, correctly identifying them as Jedi, and heard about their plan to destroy the foundry, he was seemingly angered, and rushed to report to his superiors rather than trying to eliminate the Jedi by himself. Before giving his report to Poggle the Lesser, the Geonosian hastily bowed his head.\nThis Geonosian appeared in \"Weapons Factory\", the sixth episode in the second season of the Star Wars: The Clone Wars television series, which aired on November 13, 2009. While the Geonosian was not identified in the episode, he is called a \"Geonosian spy\" in the episode's accompanying online guide.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Geonosian_spy",
  "/wiki/Geonosian_spy",
  "/wiki/Geonosis/Legends",
  "/wiki/Geonosian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Geonosian_catacombs/Legends",
  "/wiki/Geonosis_primary_droid_foundry/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Second_Battle_of_Geonosis/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Barriss_Offee/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Archduke/Legends",
  "/wiki/Poggle_the_Lesser/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Geonosian_sonic_blaster/Legends",
  "/wiki/T-series_tactical_droid",
  "/wiki/TX-21/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Warrior_caste_(Geonosian)/Legends",
  "/wiki/Super_tank/Legends",
  "/wiki/Weapons_Factory",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/November_13",
  "/wiki/2009",
  "/wiki/The_Clone_Wars_Episode_Guides",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Clone_Wars_(novelization)",
  "/wiki/Galaxy_at_War"
 ]
}