{
 "name": "Geriel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nar Shaddaa refugees"
     ]
    }
   ]
  }
 ],
 "content": "Geriel was a Human male refugee from the Mandalorian Wars and the Jedi Civil War. He lived in the Refugee Sector on the moon of the planet Nal Hutta, Nar Shaddaa, during the last days of the Dark Wars in 3951 BBY. During this time, he became gravely ill with an ailment that the other refugees referred to as a contagious plague. While visiting the moon, the former Jedi Knight Meetra Surik used her medical skills to heal Geriel of his illness. Geriel was immensely grateful and rewarded Surik with a lightsaber component.\nGeriel was a Human male who lived in the Refugee Sector on the moon of the planet Nal Hutta, Nar Shaddaa, during the final stages of the Dark Wars in 3951 BBY. He came to the moon as a refugee from the Mandalorian and the Jedi Civil Wars. During this time, he began suffering from an illness. The other refugees insisted that he had contracted some kind of contagious plague.\nDuring her visit to the moon in search of Jedi Master Zez-Kai Ell, Meetra Surik, a former Jedi Knight, spoke with Geriel. He begged her to stay away from him, as he did not want to infect anyone else with his grave illness. He told Surik that he did not know how he became sick, but that he had felt just fine the day before. Surik could almost immediately tell that his condition was not serious and used her medical knowledge to cure his sickness. Geriel was overjoyed to be feeling better and rewarded Surik with a lightsaber part. Surik used Geriel's illness to convince the Exchange criminal organization overseer of the sector, Saquesh, to ease up on the refugees.\nGeriel had red hair, green eyes, and light skin. He sported a beard.\nThe Human wore beige clothing.\nGeriel appears in the 2004 video game Star Wars: Knights of the Old Republic II: The Sith Lords. The reward the player receives for helping Geriel is a random lightsaber upgrade item. The player can alternatively convince Geriel to kill himself, resulting in the player receiving dark side points. Additionally, the player can tell Saquesh, the Exchange crime organization's overseer of the Refugee Sector, that Geriel's illness is contagious, which Saquesh will answer by having him killed. This also results in dark side points. The player can also use Geriel's illness to convince Saquesh to ease his pressure on the refugees, under the condition that the player deals with Geriel's sickness by himself or herself.\nThe Complete Star Wars Encyclopedia states that the Exile used the Force to heal Geriel, while the game depicts the Exile using the \"Treat Injury\" skill, as in medicine.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Refugee/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/Jedi_Civil_War",
  "/wiki/Refugee_Sector",
  "/wiki/Moon/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Dark_Wars",
  "/wiki/3951_BBY",
  "/wiki/Time/Legends",
  "/wiki/Plague",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Zez-Kai_Ell",
  "/wiki/Exchange",
  "/wiki/Saquesh",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/2004",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Suicide/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Death/Legends",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Force/Legends",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide"
 ]
}