{
 "name": "Gern Zott",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Yellow-brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rise of the Empire era"
     ]
    }
   ]
  }
 ],
 "content": "Gern Zott, also known by the nickname Gerzott, was a male near-Human smuggler who lived during the latter years of the Galactic Republic. Gott operated from the modified YT-1760 transport The Panada's Kiss, and aboard the starship he carried a hollow enforcer droid shell called N4, which he rigged to a small power supply to give the illusion that the droid was fully-functional. Circa 31 BBY, Zott was hired by the Cerean Krol-Pek to transport the Sullustan Salld Nrump—who was on the run from mercenaries hired by the Red Fury Brotherhood pirate group—from the city Varna Biqua on the planet Genarius to the nearby world Cularin. However, Nrump was killed by the mercenaries and the Heroes of Cularin, a group of freelance agents who were investigating his death, arrived at Zott's berth in hangar 12C and negotiated with Zott to be transported to Cularin in Nrump's place. The hangar was subsequently attacked by the mercenaries, and Zott and the agents fled aboard The Panada's Kiss. The vessel headed for Cularin and after a five hour journey, the starship arrived on the world and Zott rendezvoused with Krol-Pek.\nGern Zott was of average height and he had bright purple eyes, yellow-brown hair that was tied into a single braid, and a long scar that ran down the length of his face. Over the years, Zott's name was shortened by those around hin to \"Gerzott,\" and he was quick to adopt and perpetuate the use of the nickname, because he believed that it gave him a degree of anonymity.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Rise_of_the_Empire_era",
  "/wiki/Smuggler/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/YT-1760_transport",
  "/wiki/The_Panada%27s_Kiss",
  "/wiki/Starship/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/N4",
  "/wiki/Droid/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Krol-Pek",
  "/wiki/Sullustan/Legends",
  "/wiki/Salld_Nrump",
  "/wiki/Mercenary/Legends",
  "/wiki/Red_Fury_Brotherhood/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/City/Legends",
  "/wiki/Varna_Biqua",
  "/wiki/Planet/Legends",
  "/wiki/Genarius",
  "/wiki/Cularin/Legends",
  "/wiki/Death/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Hangar_12C",
  "/wiki/Hair/Legends",
  "/wiki/Quarters"
 ]
}