{
 "name": "Gerran",
 "display_name": "Gerran",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Doan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "980 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Doan Royal House"
     ]
    }
   ]
  }
 ],
 "content": "Gerran was a Human male prince of the planet Doan. Sometime after the New Sith Wars he contracted Idolian fever, from which he was cured by the healer Serra. Gerran fell in love with Serra and the two married, albeit against his father's wishes. However, around that time the Doan Royal Family came into conflict with the planet's mining caste, and in 980 BBY the miners destroyed Gerran's airspeeder while attempting to capture the prince, accidentally killing him.\nThe Human male Gerran was born into the Royal Family of Doan around the time of the New Sith Wars. He became the prince of the planet Doan, and sometime after the end of the war in 1000 BBY Gerran contracted a mysterious illness. His father hired the healer Serra to cure him, and she instantly recognized Gerran's symptoms, diagnosing him with Idolian fever. Serra nursed the prince back to health over the course of the next three months, and Gerran began to fall in love with her. When at last he was completely cured, Gerran proposed marriage to Serra, who accepted on the condition that her loyal friend and bodyguard, Lucia, would be allowed to remain at her side.\nGerran's father initially disapproved of the marriage, and his efforts to discover anything about Serra's past were unsuccessful due to the actions of Serra's father, Caleb. Caleb was a healer who had refused to take sides during the New Sith Wars, but after a Sith Lord threatened to kill Serra if Caleb didn't heal him, Caleb forced his daughter to change her name and move offworld so that she couldn't be tracked down and used as leverage again. Serra kept her past a secret, even from Gerran, although he accepted that her past was unimportant. Eventually, Gerran's father reluctantly consented to Serra's request, allowing Gerran to marry her and permitting Lucia to became a member of the Doan Royal Guard.\nAround that time, however, the Royal House came into conflict with the planet's lower-class mining caste, and the miners began to rise up against the powerful Royal Family. In 980 BBY, Gelba, the leader of the mining caste, ordered that Gerran's airspeeder be forced into an emergency landing in an attempt to capture the prince. During the attack, however, the airspeeder was accidentally destroyed and Gerran was killed.\nAfter Gerran's death, Serra became very depressed, so Lucia decided to hire the Iktotchi assassin known as the Huntress to assassinate Gelba in retaliation. However, a Jedi Knight, Medd Tandar, was also killed during Gelba's assassination. Serra believed that Gerran would have wanted her to ensure the Jedi knew that the Royal Family had not been behind Tandar's death, so she traveled to the Jedi Temple on Coruscant to do so.\nGerran was very popular among the nobility of Doan. He saw several valuable qualities in Serra, and the two deeply loved each other. Although his father's efforts to learn anything about Serra's past turned up no information, Gerran accepted that Serra's past was unimportant. After Gerran's death and the assassination of Gelba, Serra traveled to the Jedi Temple to ensure the Jedi knew that the death of Medd Tandar was not the intention of the Royal Family, as she believed that Gerran would have wanted her to do so.\nGerran was mentioned in the final novel of the Darth Bane Trilogy, Darth Bane: Dynasty of Evil, written by Drew Karpyshyn and released December 8, 2009.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Doan",
  "/wiki/980_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Doan_Royal_House",
  "/wiki/Prince/Legends",
  "/wiki/Planet/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Idolian_fever",
  "/wiki/Serra",
  "/wiki/Gerran%27s_father",
  "/wiki/Time/Legends",
  "/wiki/Mining_caste",
  "/wiki/Miner/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Death/Legends",
  "/wiki/1000_BBY",
  "/wiki/Marriage/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Lucia_(soldier)",
  "/wiki/Caleb",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Doan_Royal_Guard",
  "/wiki/Gelba",
  "/wiki/Mining/Legends",
  "/wiki/Iktotchi/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Darth_Cognus",
  "/wiki/Massacre_on_Doan",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Medd_Tandar",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Star_Wars:_Darth_Bane_Trilogy",
  "/wiki/Darth_Bane:_Dynasty_of_Evil",
  "/wiki/Drew_Karpyshyn",
  "/wiki/December_8",
  "/wiki/2009",
  "/wiki/Darth_Bane:_Dynasty_of_Evil_(audiobook)"
 ]
}