{
 "name": "Gersolik",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ugnaught"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  }
 ],
 "content": "Gersolik was an Ugnaught female sous-chef on the gas giant Bespin, working for the Devaronian chef Torro Sbazzle there. In 3 ABY, the Galactic Empire came to Bespin, and Dark Lord of the Sith Darth Vader was Sbazzle and Gersolik's guest, which their boss, Baron Administrator Lando Calrissian, told them early in the day, greatly frightening them both.\nUnsure what to cook for a Sith Lord, the Devaronian and Ugnaught pair made dumplings and dessert, but halfway through, thinking of all the atrocities that the Empire had committed, Gersolik tried very hard to convince Sbazzle to poison Vader, claiming that they would be seen as heroes for doing so. Sbazzle refused to do it—even after Gersolik suggested a method and further reasoning for the radical move—thinking of the risk and potential consequences, which infuriated the Ugnaught.\nGersolik was an Ugnaught female who worked as a sous-chef for Torro Sbazzle, a famous Devaronian cook in Cloud City of the gas giant of Bespin. By that time, she possessed faint scars on her forehead. In 3 ABY, she worked with Sbazzle to prepare the food for a group of rowdy shipping barons, a meal that included cuttle-tick. Sbazzle was worried that the carapace of the cuttle-tick, which was venomous, would be mistaken as edible by the barons.\nThe next day, Bespin's Baron Administrator, Lando Calrissian, had Sbazzle and Gersolik come in to work early as he had unexpected guests. When Sbazzle arrived, she saw only Gersolik there—who looked very nervous—which surprised her as her staff was usually much larger. The Devaronian initially assumed that she had been called in due to complaints from her guests the night before, but Calrissian, sweating nervously, explained that his unexpected guests required refreshments. When Sbazzle, unhappy that a job that small required her presence, began arguing with Calrissian, Gersolik determinedly asked the administrator to show Sbazzle so that she would understand. Calrissian used a mirror that turned transparent on the kitchen's side to reveal the guests in the Rinetta dining room: Darth Vader, Dark Lord of the Sith, accompanied by Imperial stormtroopers, for the Empire had come to Bespin.\nAlthough Sbazzle did not recognize Vader right away, once Calrissian identified the Sith Lord, she understood the stakes and immediately refused. Calrissian convinced her to do it, explaining that the food just had to look impressive; he then informed her that she had just an hour, leading her to banish him from the kitchen so that she and Gersolik could begin. The Ugnaught promptly stepped forward and awaited instructions; Sbazzle, thinking of bite-sized, neatly consumed foods, asked for ten cans of denta beans to be roasted, steeped with boiled whilk milk and thalassa seeds for the drink component. Next, she wanted Gersolik to peel and finely dice three jogan fruits for dumplings. At the Ugnaught's questioning, she explained that she believed that everyone in the galaxy liked dumplings.\nHalfway in, after finishing the dumplings, Sbazzle called Gersolik over, making sure that she had finished whipping the frella-fish roe. The Ugnaught had, but she trailed off while confirming so. Confused, Sbazzle guessed that she had tasted too much of the sense-dulling roe, but Gersolik was instead thinking about what the effects of the roe combined with the flavor of the meringue could mask: meeting the Devaronian's gaze, she suggested that they create a situation similar to that of the previous night's venemous carapace, directed at Vader. Sbazzle was completely shocked by her sous-chef's words, running over to her and whispering that the Empire would do awful things to them if they went through with Gersolik's plan.\nShaking with anger at the Empire, Gersolik insisted since they had destroyed the planet Alderaan, the monsters that were the Empire had to be stopped. Indicating the mostly empty kitchen, Gersolik further noted the Empire's thoughts on nonhumans: unthinking, mindless animals. Sbazzle pointed out that that notion was exactly why poisoning Vader would not work, for the stormtroopers would make the kitchen staff test every bit of food. Not caring, the Ugnaught proposed using something that required time to go into effect. Sbazzle listened but still refused, feeling that it was too high a risk seeing as there was no guarantee that Vader would even eat anything.\nGersolik still felt that the risk was worth it for a cause greater than their own lives; she opined that they would be heroes. Although she still found the plot ludicrous, Sbazzle considered how it would play out in her mind. She felt that she could brew the right poision were Vader to partake in the food, but then she thought of her family and had no intention of risking the consequences for them. She then told Gersolik a story of a Jedi temple on her homeworld of Devaron, where formerly Galactic Republic fighters had tried and failed to defend themselves from the Empire. Sbazzle's point was that heroes like those no longer existed; Gersolik responded that the only way for them to exist once again was to fight back.\nIt was then that the doors to the dining room opened, and Vader's awaited guests—the rebels Han Solo, Leia Organa, and Chewbacca—arrived; Gersolik tried to reach for the access panel to the room, only to be stopped by Sbazzle. Following quick blasterfire, Vader spoke to his guests, chilling Sbazzle to the bone. Gersolik then tried to continue their discussion but was shot down by Sbazzle, who ordered her to immediately get back to work. The Ugnaught complied, furious and bitter.\nGersolik was nicknamed \"Gers\" by her head chef, Torro Sbazzle. She was very scared when Darth Vader was for whom she had to cook, her whiskers trembling and her skin going pale. Motivated by anger for the Galactic Empire's wrongdoings, Gersolik implored Sbazzle to poison Vader's food. Sbazzle, however, was driven by fear of punishment for such a crime and refused, unwilling to take the risk while the Ugnaught readily would. The Ugnaught was furious with Sbazzle for her inaction. She had pink skin.\nGersolik appeared in \"But What Does He Eat?,\" a short story authored by S.A. Chakraborty and published in the 2020 anthology From a Certain Point of View: The Empire Strikes Back.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Featured_article_nominations/Gersolik",
  "/wiki/Ugnaught",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sous-chef",
  "/wiki/Gas_giant",
  "/wiki/Bespin",
  "/wiki/Devaronian",
  "/wiki/Chef",
  "/wiki/Torro_Sbazzle",
  "/wiki/3_ABY",
  "/wiki/Galactic_Empire",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Baron_Administrator",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Standard_day",
  "/wiki/Sith_Lord",
  "/wiki/Dumpling",
  "/wiki/Foodstuff",
  "/wiki/Death",
  "/wiki/Cloud_City",
  "/wiki/Baron",
  "/wiki/Cuttle-tick",
  "/wiki/Diet",
  "/wiki/Administrator",
  "/wiki/Rinetta_dining_room",
  "/wiki/Stormtrooper",
  "/wiki/Standard_hour",
  "/wiki/Denta_bean",
  "/wiki/Whilk_milk",
  "/wiki/Thalassa_seed",
  "/wiki/Denta_bean_beverage",
  "/wiki/Jogan_fruit",
  "/wiki/The_galaxy",
  "/wiki/Frella-fish_roe",
  "/wiki/Meringue",
  "/wiki/The_Disaster",
  "/wiki/Planet",
  "/wiki/Alderaan",
  "/wiki/Alien",
  "/wiki/Time",
  "/wiki/Temple_of_Eedit",
  "/wiki/Homeworld",
  "/wiki/Devaron",
  "/wiki/Galactic_Republic",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Han_Solo",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Chewbacca",
  "/wiki/Blaster",
  "/wiki/Bone",
  "/wiki/Darth",
  "/wiki/Hair",
  "/wiki/But_What_Does_He_Eat%3F",
  "/wiki/S.A._Chakraborty",
  "/wiki/2020",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars"
 ]
}