{
 "name": "Gethzerion",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "8 ABY",
      "over Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dathomirian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Singing Mountain Clan",
      "Nightsisters"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Djo family",
      "Singing Mountain Clan",
      "Nightsisters",
      "Zsinj's Empire"
     ]
    }
   ]
  }
 ],
 "content": "Gethzerion was the founder and leader of the Nightsisters from the planet of Dathomir. She was the daughter of Clan Mother Augwynne Djo and sister of Barukka, Kara'Teel and Allaya Djo. A ruthless and tyrannical matriarch, Gethzerion ruled the Nightsisters with an iron fist and terrorized the other Dathomiri for years.\nBorn on the planet of Dathomir many centuries before the start of the Galactic Civil War, Gethzerion belonged to the Daughters of Allya, a society of Force-sensitive females who used \"magic\" to control the Force, with the male population serving as servants and mates. Her mother was none other than Augwynne Djo, respected matriarch of the Singing Mountain Clan. Unlike her mother, who was a full-blooded Human, Gethzerion belonged to the Dathomirian species, which resulted from the hybridization of Humans and Zabraks.\nOne of four sisters, Gethzerion was by far the most talented with the channeling of the Force. During her formative years, she realized that she could use the Force without the ritual chantings prescribed by her people's customs and traditions, a feat only Mother Augwynne and Clan Protector Tannath had achieved until then. Because of such exceptional skills, Gethzerion was openly adored not only by her younger siblings, Allaya and Kara'Teel, but also by her older sister Barukka.\nTraditionally, those who broke their laws and codes were exiled to live out their lives in the wilderness in solitude and contemplation. Some of those clans who were devoted to the dark side were known as Nightsisters. However, at some point during the waning days of the Galactic Republic, Gethzerion and another sister named Baritha were exiled after attempting to assassinate Mother Augwynne. The two exiles began to gather together other outcasts to form their own clan, which eventually became the Nightsisters.\nThe Nightsisters did not fear the dark powers forbidden by the ancients, but reveled in them and raised their daughters in the dark side, although they did not understand it as the Jedi did. During the reign of Gethzerion, many of the Dathomiri were killed or captured by her clan, which grew ever more powerful and was aided by the other Witches' indecision in dealing with them.\nAt some point Gethzerion noted that a fellow Nightsister Kyrisa had showed exceptional promise in her ability to control the beasts of Dathomir. However, Kyrisa became so convinced in her own superiority, that she choose to directly confront Gethzerion in combat. During the fierce clash for leadership, Kyrisa openly declared her intent to slay the Clan Mother and to take her place as the leader of the Nightsisters. However, her challenge of Gethzerion failed and for her attempt Gethzerion banished Kyrisa not only from the Nightsisters, but from the planet itself.\nWhile the Nightsisters believed that they had to perform rituals to unleash their Force powers, only Gethzerion realized the true power that she could control. Emperor Palpatine knew of her power while he was alive and ordered that she be kept trapped on Dathomir where she could still rule but not use her power elsewhere. Zsinj, who would later become a ruling Imperial warlord, was assigned to keep an eye on Dathomir.\nWhen Han Solo crash-landed the Millennium Falcon on Dathomir, Gethzerion was contacted by Zsinj and the two of them managed to capture Han Solo and Leia Organa.\nGethzerion finally met her match in Luke Skywalker and Teneniel Djo  when they turned up to rescue their friends. Gethzerion fled in a space carrier but was killed when two of Zsinj's Star Destroyers opened fire under his orders. With the ship's destruction along with its occupant, the Dathomirians were free of Gethzerion's tyranny.\nGethzerion was extremely powerful in the Force, to the point that even Emperor Palpatine, a Dark Lord of the Sith, was wary of her, stranding her on Dathomir and allowing no ships to land in an effort to isolate her. She was able to generate weather-based Force storms merely through anger, had very advanced telekinetic abilities, killed General Melvar along with 100 Stormtroopers effortlessly, and near-fatally injured Luke Skywalker using Force Lightning. In addition she could perform Telepathy and had a decent ability in Force Jump and speed despite her advanced age. Furthermore, Gethzerion was a fierce and deadly combatant and was also one of several Nightsisters known to use a red lightsaber.\nIt was believed that at some point Gethzerion wrote the Book of Shadows, containing details of the spells and rituals of her Nightsisters.\nThe Essential Guide to Characters mistakenly lists Gethzerion as \"Gethzerionb\" in the title for her entry, likely a typography error, although other instances of her name are correct.\nGethzerion appeared as a non-player character in the video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011.\nWhile the 1995 guidebook The Essential Guide to Characters listed Gethzerion's species as Human, she was retconned into a Dathomirian following the release of The Essential Reader's Companion in 2012.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Nightsisters/Legends",
  "/wiki/Mount_Gethzerion",
  "/wiki/Dathomir/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Dathomirian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Singing_Mountain_Clan",
  "/wiki/Djo_family",
  "/wiki/Zsinj%27s_Empire",
  "/wiki/Planet/Legends",
  "/wiki/Augwynne_Djo",
  "/wiki/Barukka",
  "/wiki/Kara%27Teel",
  "/wiki/Allaya_Djo",
  "/wiki/Reproduction/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Witches_of_Dathomir",
  "/wiki/The_Force/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Magic",
  "/wiki/Maleling",
  "/wiki/Parent/Legends",
  "/wiki/Clan_mother",
  "/wiki/Blood/Legends",
  "/wiki/Human/Legends",
  "/wiki/Hybrid/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Tannath",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Baritha",
  "/wiki/Kyrisa",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Zsinj",
  "/wiki/Warlord/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Teneniel_Djo",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Force_storm_(weather)",
  "/wiki/Telekinesis/Legends",
  "/wiki/Melvar",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Telepathy/Legends",
  "/wiki/Force_Jump",
  "/wiki/Force_speed",
  "/wiki/Lightsaber/Legends",
  "/wiki/Book_of_Shadows",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/December_15",
  "/wiki/1995",
  "/wiki/Retcon",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/2012",
  "/wiki/The_Courtship_of_Princess_Leia",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/The_Deadly_Dozen",
  "/wiki/Star_Wars_Galaxy_Magazine_8",
  "/wiki/Use_the_Force",
  "/wiki/Communiqu%C3%A9s",
  "/wiki/Star_Wars_Galaxy_Magazine_12",
  "/wiki/The_Women_Of_Star_Wars",
  "/wiki/Cracken%27s_Threat_Dossier",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Star_Wars_Galaxies",
  "/wiki/Star_Wars_Insider_65",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Galactic_Hunters",
  "/wiki/Template:SWGTCG",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jedi_Academy_Training_Manual",
  "/wiki/The_Shadow_Syndicate",
  "/wiki/Sony",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Everything_You_Always_Wanted_to_Know_about_the_Nightsisters_but_Were_Afraid_to_Ask",
  "/wiki/Star_Wars_Insider_122",
  "/wiki/StarWars.com",
  "/wiki/The_Nightsisters_from_Dathomir:_A_History",
  "/wiki/Book_of_Sith:_Secrets_from_the_Dark_Side"
 ]
}