{
 "name": "Gev_Hessan",
 "display_name": "Gev Hessan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Gev Hessan, pilot number 45236, was a male Devaronian smuggler who owned the HH-87 Starhopper Rover. He was a friend of Lando Calrissian and was reported to have died in the custody of the Galactic Empire.\nGev Hessan was a smuggler and pilot who lived during the Age of the Empire. He owned and operated the HH-87 Starhopper Rover. Hessan was a friend of Lando Calrissian, another smuggler, and aided him in building the tibanna mining platform Cloud City on the planet Bespin by smuggling goods for him. Hessan was later captured by the Galactic Empire and reported to have died in Imperial custody. Several months after the Battle of Endor, the pilot Wedge Antilles flew the Rover to a number of planets in the Outer Rim Territories in search of Imperial remnants following the Battle of Endor. Upon arriving at the planet Akiva, Antilles encountered two Imperial Star Destroyers who assumed it was Hessan in the Rover despite their records stating he had died. Imperial Admiral Rae Sloane saw through the deception and had the Rover pulled in by her Imperial-class Star Destroyer Vigilance's tractor beam.\nGev Hessan was a Devaronian male.\nGev Hessan was first mentioned in Aftermath, a novel released on September 4, 2015, written by Chuck Wendig.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Devaronian",
  "/wiki/Gender",
  "/wiki/Pilot",
  "/wiki/Smuggler",
  "/wiki/HH-87_Starhopper",
  "/wiki/Rover",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Death",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Era",
  "/wiki/Tibanna",
  "/wiki/Mining",
  "/wiki/Cloud_City",
  "/wiki/Planet",
  "/wiki/Bespin",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Endor",
  "/wiki/Wedge_Antilles",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Endor",
  "/wiki/Mission_to_Akiva",
  "/wiki/Akiva",
  "/wiki/Star_Destroyer",
  "/wiki/Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Vigilance_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Tractor_beam",
  "/wiki/Aftermath_(novel)",
  "/wiki/September_4",
  "/wiki/2015",
  "/wiki/Chuck_Wendig",
  "/wiki/Aftermath_(audiobook)"
 ]
}