{
 "name": "Gevion captain",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "This Human male was the captain of the combine-reaper Gevion, used by the Human settlers of the planet Leritor as a habitat and means of living. Under this man's command, the Gevion farmed plains to the south of the mountain range of the Bleaks and near the eastern coast of the main continent of Leritor—although, as he would break the Settlement Pact among the settlers and the native Sauvax species by going nearer than 100 kilometers of the coastal line, the captain avoided that.\nA Dark Side Adept known as Profex Rynalla raided both a Sauvax village  and combine-reaper Nellist to recruit slaves, also hoping to incite a war among the Sauvax and the settlers. The Gevion captain erroneously believed that the Nellist had been attacked by Sauvax, and that the remains of it and maybe prisoners were in Sauvax lands.\nSoon afterwards, another Sauvax kuuvan, believing that Humans were behind the attack to the Sauvax, surrounded the Gevion and camped in a fertile crop. The Sauvax, behind threatening but not warlike, did not initiate any hostile action; but stopped the Gevion from harvesting a crop that could rot there and, without that income, the Gevion crew could go bankrupt and lose their combine-reaper.\nThe Sauvax tevelor required an envoy to parlay face to face; however, the Gevion crew was afraid of the Sauvax, who reportedly had attacked unprovoked the Nellist, and nobody volunteered. Under the captain's orders, the Gevion crew attempted to shout from a lower maintenance hatch, unwittingly insulting the Sauvax by doing so.\nThe captain then sent a distress signal, which was answered by some nearby offworlders. The offworlders offered to mediate among the groups, which eventually led to the Gevion returning unharmed to her previous activities.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Combine-reaper",
  "/wiki/Gevion",
  "/wiki/Planet/Legends",
  "/wiki/Leritor/Legends",
  "/wiki/Bleaks",
  "/wiki/Settlement_Pact",
  "/wiki/Sauvax",
  "/wiki/Species/Legends",
  "/wiki/Dark_Side_Adept",
  "/wiki/Professor/Legends",
  "/wiki/Rynalla",
  "/wiki/Kuuvan",
  "/wiki/Nellist",
  "/wiki/Unidentified_tevelor",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Standoff_on_Leritor",
  "/wiki/Star_Wars_Gamer_10"
 ]
}