{
 "name": "Gha_Nachkt",
 "display_name": "Gha Nachkt",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Trandosha"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Skytop Station"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "Gha Nachkt was a Trandoshan salvage ship captain who worked for the Confederacy of Independent Systems during the intergalactic Clone Wars. After the battle over the planet Bothawui, Nachkt recovered a damaged Jedi interceptor, and claimed the surviving occupant: R2-D2, an R2 series astromech droid. As R2-D2 contained vital information pertaining to the Galactic Republic, he planned to sell the droid to the confederate commander, General Grievous. However, Nachkt was intercepted by the droid's owner, Jedi Knight Anakin Skywalker. The Trandoshan hid R2-D2 while Skywalker investigated the salvage ship. When Skywalker's search proved inconclusive and left, Nachkt traveled to the Separatist held Skytop Station. There, Nachkt demanded payment from Grievous—more than they previously agreed upon—and was promptly stabbed in the back by the general's lightsaber.\nA Trandoshan male, Gha Nachkt picked up work as a salvage ship captain sometime before or during the the galaxy-wide conflict known as the Clone Wars. At some point during the war, the fleets of the Galactic Republic and the Confederacy of Independent Systems collided over the planet Bothawui. The Republic forces were led by the Jedi Knight Anakin Skywalker, who piloted a Delta-7 Aethersprite-class light interceptor alongside his R2 series astromech droid co-pilot R2-D2. However, during the battle, Skywalker's ship was critically damaged and Skywalker was ejected from his ship and recovered. R2-D2 and the interceptor remained behind, however.\nAfter both forces finally withdrew, Nachkt arrived to the field of wreckage in his ship, Vulture's Claw, and began to salvage what he could. He eventually found the damaged interceptor and brought R2-D2 aboard his ship. Believing that the droid could be worth something to the Confederacy due to R2-D2's library of Republic intel, Nachkt contacted General Grievous, the commander of the Separatist droid armies, and agreed to sell R2-D2 to the general. Nachkt was to take R2-D2 to Skytop Station, a listening post, and drop the droid off there and then collect his payment.\nHowever, before Nachkt could depart Bothawui space, Skywalker returned in search of R2-D2. Along with his Padawan Ahsoka Tano, Skywalker boarded the Vulture's Claw and began to search for his droid. Nachkt feigned assistance, and attempted to sell the Jedi other droids on his ship. Eventually, he left them alone to browse. However, the Jedi's newly issued droid, R3-S6, who was secretly a Separatist spy, tried to kill the Jedi by activating two dormant IG-86 sentinel droids. The Jedi destroyed the droids and then left the ship, leaving an unhappy Trandoshan salvage ship captain behind, who was displeased with the damage done to his droids. However, with the Jedi gone and R2-D2 still onboard the Vulture's Claw, Nachkt was finally able to leave for Confederate space.\nWhile en route to the listening post, R2-D2 tried to escape the Vulture's Claw, removing his restraining bolt and jettisoning another IG-86 droid into space. However, R2-D2 was soon recaptured by Nachkt, but not before the droid was able to transmit information regarding his whereabouts back to Skywalker. Realizing this, Nachkt knocked the droid out of commission.\nAfter arriving at Skytop, Nachkt disassembled R2-D2 on Grievous' orders, where they discovered that R2-D2 held even more Republic intel than they had previously believed. However, their investigation became hurried, as Skywalker had launched a rescue mission for R2-D2, in order to stop the Confederacy from obtaining the droid's intel. However, despite the impending rescue as Skywalker's clone troopers battled their way through the listening post, Nachkt decided to demand a larger payment from Grievous, citing that the droid was suddenly worth more than previously thought because of the droid's amount of information. Finally tired of the salvage ship captain, Grievous used one of his lightsabers to stab Nachkt through the back, mockingly referring to the action as the Trandoshan's \"bonus.\" After Nachkt's death, R2-D2 was successfully recovered, and Skytop Station was destroyed by the Republic troopers.\nA bloated, over-weight Trandoshan, Gha Nachkt believed in the all-mighty credit. After making his deal with Grievous, Nachkt was careful to follow through on this deal, and was sure to hide R2-D2 from his master in order not to lose valuable merchandise. Nachkt, however, was also a greedy individual, as he flippantly demanded more money from Grievous after handing the droid over to him, going back on their previous arrangement.\nPhysically, Nachkt had an unmistakable asymmetry to his face, with a fold of flesh drooping over his right eye. Nachkt had brown skin and eyes, large round feet, and had four fingers on each hand.\nGha Nachkt was created for the television series Star Wars: The Clone Wars, and made his first on-screen appearance in the episode \"Downfall of a Droid,\" in which he was voiced by Ron Perlman. He later appeared in the follow up episode \"Duel of the Droids.\" According to series supervisor Dave Filoni, Nachkt was created because Filoni liked Trandoshans, but decided that instead of using Bossk, that he would make an older and out of shape character like Nachkt based on a suggestion from his friend Giancarlo Volpe. Nachkt's digitally created model was later reused and retextured in order to be used for the character Nack Movers, who later appears in the episode \"Lightsaber Lost.\" The model appears with its original texture in the Star Wars: The Clone Wars theatrical film, but this has yet to be officially confirmed as Gha Nachkt himself.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gha_Nachkt",
  "/wiki/Gha_Nachkt/Legends",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon",
  "/wiki/Trandosha",
  "/wiki/22_BBY",
  "/wiki/Skytop_Station",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/File:There%27sYourBonus-DotD.ogg",
  "/wiki/Starship",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/The_galaxy",
  "/wiki/Clone_Wars",
  "/wiki/Battle_of_Bothawui",
  "/wiki/Planet",
  "/wiki/Bothawui",
  "/wiki/Jedi",
  "/wiki/Delta-7_Aethersprite-class_light_interceptor",
  "/wiki/R2-D2",
  "/wiki/R2_series_astromech_droid",
  "/wiki/Galactic_Republic",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Droid",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Death",
  "/wiki/Lightsaber",
  "/wiki/File:SneakyLittleScrapPile-DotD.ogg",
  "/wiki/Pilot",
  "/wiki/Vulture%27s_Claw",
  "/wiki/Listening_post",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/R3-S6",
  "/wiki/IG-86_sentinel_droid",
  "/wiki/File:MoreThanMyFee-DotD.ogg",
  "/wiki/Restraining_bolt",
  "/wiki/Mission_to_Skytop_Station",
  "/wiki/Clone_trooper",
  "/wiki/Eye",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Downfall_of_a_Droid",
  "/wiki/Ron_Perlman",
  "/wiki/Duel_of_the_Droids",
  "/wiki/Dave_Filoni",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Giancarlo_Volpe",
  "/wiki/Nack_Movers",
  "/wiki/Lightsaber_Lost",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Category:Audio_files_of_Gha_Nachkt",
  "/wiki/Category:Images_of_Gha_Nachkt",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_62",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Covert_Missions",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Supply_Lines",
  "/wiki/Bombad_Jedi",
  "/wiki/Standard_year",
  "/wiki/The_Art_of_Star_Wars:_The_Clone_Wars"
 ]
}