{
 "name": "Ghal Tarpfen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ghal Tarpfen's family",
      "Mon Calamari monarchy",
      "Mon Calamari Guard",
      "Mon Calamari Guard",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ghal Tarpfen was a Mon Calamari female who held the rank of Chief as Head of Security at the Galactic Republic-Jedi space station Starlight Beacon. She formerly served in the Mon Calamari Guard on her homeworld of Mon Cala. Tarpfen expressed concern to Controller Rodor Keen that the Beacon's medcenter was going to be the cause of a diplomatic incident because members of various warring species had been placed in close proximity to each other. Administrator Velko Jahen thought that she resembled a caged targon in her movements. Tarpfen served with competence on the station until she was kidnapped by the Nihil pirates after they made a failed attempt to blackmail her with the assistance of traitors within the Galactic Senate. Awakening on a starship in No-Space, Tarpfen took control of the vessel but lacked the piloting skills to turn it off its set course. Knowing that Nihil ships which her abductors had intended to rendezvous with would destroy the ship when they received no response, Tarpfen sent a message back to Starlight Beacon warning of the Nihil spies.\nGhal Tarpfen was a Mon Calamari female from a low standing family on the planet Mon Cala, born to Rhal and Gera. As a child, she enjoyed sitting just outside her house and watching the flotsam from up-current, well-to-do families drift by; at one point, this included a gruesome, dead jara fish. Her mother used to sing her a lullaby when she was a child. She joined the Mon Calamari Guard, rising to the rank of Captain Third Class. During that time, Tarpfen met Shenrick, a member of the royal family and third son of the reigning monarch. The two became lovers, keeping their relationship secret as it went against the mores of Mon Cala society. During their relationship, Tarpfen and Shenrick became fans of a holodrama which told the story of a Mon Calamari guard who ran away with a princess, feeling it was their story.\nShenrick was suddenly propelled to the throne as King of Mon Cala when his predecessor and older siblings were killed in a tragedy. With his new responsibilities, he abruptly spurned Tarpfen, dismissing her from the service of the crown without warning after summoning her to an audience with him; he pretended that Tarpfen had requested the removal. Tarpfen chose to leave the planet entirely as she did not want to see him marry another, but both kept their past relationship secret as it could ruin both Shenrick and Tarpfen's family.\nEventually she came to serve as the Head of Security on the Galactic Republic Starlight Beacon space station in 232 BBY. She was a new arrival at the same time as Administrator Velko Jahen. When she met Jahen, she was introduced to the Soikan by Jedi Master Estala Maru, who had been discussing improvements to station security protocols that Tarpfen was interested in. Maru intended to run his recommendations by Chief Tarpfen, which he expected would take an hour or two.\nBarely acknowledging Jahen, Tarpfen turned to Controller Rodor Keen, her boss on Starlight Beacon, informing the human that there was an issue with patients who had been injured during the Great Hyperspace Disaster, as individuals from warring territories were all being treated in the same place. Tarpfen was concerned as to what they would do to each other when they regained consciousness. Maru responded instead of Keen, reminding them sarcastically that the Disaster had paid little attention to politics. Keen then left, followed by Maru and his droid, KC-78, with Maru noting to Tarpfen that he looked forward to talking with her. He then wished for the Force to be with the Mon Calamari, who agreed that she would need it.\nTarpfen then turned to Jahen, giving her a cold look despite Jahen's smile. She asked the administrator if she had served as a soldier, as she was a Soikan, and Jahen confirmed that she used to be. Tarpfen assumed that she was part of the Livtak Union due to her coloring, but Jahen had in fact been part of the Gagic Alliance, as her father had been Livtak and her mother Gagic. Tarpfen guessed that that had made things difficult, but Jahen explained that her father had defected as soon as he learned of Livtak's plans. Tarpfen then instructed her to help out in a room nearby.\nHowever, when Jahen went there, she was told to act as a bodyguard for Ambassador Ceeril of Rion, which was not what she expected her role to be. As she tried to figure out the situation, she heard a comotion in the ward, where a Medoslean was having a reaction to her treatment that caused her to try to strangle the necks of Nurse Okana and the doctor Gino'le. Tarpfen unclipped her blaster and prepared to fire, but Gino'le explained that the Medoslean was unable to control herself due to the reaction. Jahen found a hypo on the floor that could be used to sedate the patient, which Tarpfen tried to dive for but was unsuccessful, as one of the Medoslean's tentacle's struck her sharply in the head, with Tarpfen slumping on the floor.\nJahen was able to grab the injector and give it to the patient, with the Medoslean loosening its grip on the doctors' necks. Jahen then checked on the Mon Cal, who needed to grab hold of Jahen in order to stay steady. She complimented the Soikan on what she had done. Doctor Gino'le then diagnosed Tarpfen with a level nine concussion, informing her that she would need to spend time in the rejuvenator. Tarpfen insisted that she was being relied on, and that there was too much to do for her to take a break. Jahen told the Mon Calamari that she thought she could look after the place, and she thanked her for sending her to Ambassador Ceeril. Tarpfen smiled at that, but it was then that a scream rang out and Ceeril's bodyguard droid was found sprawled on the floor, along with Ceeril lying motionless on his bed with a blaster burn at the center of his chest.\nA party of Jedi that included Avar Kriss, Nib Assek, Estala Maru, and Burryaga Agaburry, along with Rodor Keen, later arrived on the scene. When Maru asked what exactly had happened to the ambassador's droid, Tarpfen explained that its head was taken clean off of its shoulders, indicating the shrapnel from its processors that was embedded in the wall. The group then reviewed the security footage, which did not reveal much, as the image turned to static just when the assassination was about to happen. Assek then asked for clarification on what the situation at hand had been, so Tarpfen told her of the Medoslean's losing control and attacking staff members. She noted that if not for Jahen, it could have been much worse, a remark that surprised Keen, who reminded them of the large swaths of survivors who were being treated on Starlight Beacon at that time.\nIt was then that Ceeril arrived, having survived his ordeal. The ambassador immediately began complaining about his people's rival Hassarians, asserting that they were the ones who had tried to kill him. Despite some of the Jedi being skeptical of Ceeril's claims, Kriss asked to see the two Hassarians on board Starlight. Tarpfen obliged her request and led the way. Jahen was disappointed to miss out on the action, as she was tasked with writing up a report for the Galactic Senate, but she and Maru went to gather more evidence instead, leading Tarpfen to hypothesize that Ceeril had committed the \"assassination attempt\" himself in an attempt to frame the Hassarians.\nWhile Jahen was researching, Tarpfen was being berated by Ceeril, who demanded justice for the threat of the Hassarians. Jahen then entered the room, informing everyone that the threat had in fact already passed, and the culprit was dead—she presented the severed head of the bodyguard droid. Ceeril acted confused at the display, as did Tarpfen, who reminded Jahen that the droid head was evidence. Jahen explained that the bodyguard was the real offender and had detonated due to the detonite that had been planted inside its head.\nTarpfen was surprised that the detonite had been inside the droid, but before it could be discussed further, Ceeril used his tongue to try and grab Tarpfen's blaster from her hip. The Mon Calamari grabbed the ambassador's tongue firmly, but she released it when Keen, Kriss, and Maru arrived, with Keen inquiring as to the situation. Tarpfen explained that Ceeril had attempted to disarm her, with Jahen noting that his assassination had actually been faked. As Jahen once again explained what Ceeril had done, Tarpfen added that the Hassarian DNA was the kind left over when one stashed fake evidence in one's chest.\nJahen also held up a blaster gas canister, which Tarpfen pointed out was not powerful enough to kill someone, though Jahen felt that the Mon Cal looked like she was willing to finish the job. Ceeril tried to protest, calling the theory nonsense, but Kriss believed Jahen, with Maru agreeing that the evidence was substantial. He then offered to send it the Republic security service on the planet Coruscant, with Tarpfen asking amusedly if that was his job. Tarpfen then offered Jahen the honor of locking up the ambassador in a detention center, but Jahen declined, as Tarpfen was Head of Security.\nAround 231 BBY, the annual meeting of the Galactic Agricultural Alliance, Tarpfen was watching several different monitors that were providing many views of Starlight Beacon. The image on the monitors scrolled quickly, making Velko Jahen feel dizzy. She joked that she was amazed at Tarpfen's ability to keep track of it all, but the Mon Cal sipped her green drink in silence. After a long moment, she questioned if Jahen had come there to check on her, as the Agricultural Alliance had, in her opinion, done nothing more exciting than smell flowers.\nShe also noted that the flowers were blooming per Jahen's request, which Jahen said aloud that she would have to thank Castor for. It was then that one of the sceens began to ping and flash. Tarpfen explained that one of the camera droids had flagged an infraction—the droids were able to recognize thousands of types of aggression responses. The two then saw an Ithorian and an Amani fighting each other on the screen. Tarpfen followed Jahen out of the room, running to the scene.\nThe two ran down the hallway to an elevator, using to get to the conflict as quickly as possible. Jahen wondered if there was enough time to get there before anyone got hurt; Tarpfen only hoped so. When they stepped out of the elevator, the Ithorian and Amani were in full conflict, hissing and clicking at each other before a crowd. Without hesitating, Tarpfen stunned the two with her blaster, which shocked Jahen. Despite Tarpfen's explaining that she had only fired a stun shot, Jahen felt it was unwise to shoot guests. The crowd quickly dispersed, with Tarpfen asking Jahen rhetorically if it would have been better for them to pound each other into protein paste.\nA Siniteen named Sh'nar Qwasba then arrived, demanding to know why her colleagues had been fired at. Tarpfen tried to explain that the two scientists had been fighting, but Jahen cut in, introducing herself. Qwasba then did the same, telling the administrator that she had just heard of the brawl that had occured. Jahen confirmed her story, adding that the two subdued instigators were to be taken to a medcenter. Tarpfen then interjected, promising that they would be detained for violating the zero-tolerance policy for fighting of Starlight Beacon. Qwasba, like Jahen, was unsure that shooting civilians was a bit of an extreme measure, but Tarpfen stood her ground, maintaining that it was the best choice for the moment.\nQwasba again questioned the Mon Cal, asking if security droids could have not handled the situation. Tarpfen argued that such droids were often unsuccessful at assessing such situations and that taking a stun blast was best for the scientists. Tarpfen and Jahen then received emergency updates on their comm units from Estala Maru, informing them that a riot was in progress in the dining facility. Tarpfen was the first to run toward the facility, with Jahen hurrying after her.\nTarpfen burst into the dining facility, followed a few seconds later by Jahen. They found scientists of all species brawling each other just like the Amani and Ithorian had. Tarpfen drily asked Jahen if she still felt it would be rude to shoot the guests, with Jahen then realizing that it was an efficient way to calm the chaos. She told the Head of Security that she felt it was their best option unless there was another solution at hand. Several Jedi then arrived, offering their assistance. Jahen accepted, asking that the scientists be restrained without anyone getting hurt. The presence of the Jedi paused the fighters for a brief moment, but it broke out again, with the Jedi doing their best to calm the combatants.\nTarpfen felt that it was too late to prevent all injuries, but she told the Jedi that she would be able to handle it, calling over a security droid called Ateseven. At Tarpfen's instructions, the droid deployed non-lethal crowd suppression. Tarpfen also had the air filtration to the dining hall be cut off, and she motioned for the group at the doorway to step aside from so as not to be supprssed by the foam. The doors closed, and after some time, they reopened to reveal close to a hundred scientists sound asleep.\nAfter the Jedi had walked away, Jahen sighed and told Tarpfen that all of the brawlers would need to be examined, as they had acted in ways that civilized scientists generally did not. Sarcastically, Tarpfen asked the administrator if it could have been an argument over the proper way to irrigate khema; Jahen responded that it was vital to find out what it was before anyone was killed.\nHowever, Doctor Gino'le reported that all readings were completely normal. Tarpfen questioned the report, finding it odd. She had suspected the cause to be a kind of toxin, but the med teams she had dispatched found nothing in their sensor sweeps. Gino'le theorized that if the brawlers had been exposed to something, it would have been a type of organism that broke down quickly in the circulatory system. However, she was unsure and unable to give a solid explanation, which frustrated Tarpfen. The original two fighters then woke up, allowing Tarpfen and Jahen to question them. The two split up, with Tarpfen taking the Amani and Jahen the Ithorian.\nAfter the two finished their interviews, they met up in the medcenter lobby, where Tarpfen sighed, feeling that it had been a waste of time. Jahen was not as certain, asking if the Ithorian the Mon Calamari had spoken with remembered anything but visiting the gardens. Tarpfen shook her head, skeptical that a simple plant could cause all the trouble that had ocurred. Jahen then spoke of a young girl she had seen the day before, Avon Starros, who had brought in the plant they were suspicious of. They found the plant after walking through three different gardens, finding it wrapped around several other trees and greenery.\nTarpfen then questioned if Jahen had fallen behind on her fitness regime; the Soikan defended that she had been busy. Tarpfen then studied the vines, noting their extensive growth for a short amound of time. Jahen agreed, adding that it could have been the murderous Drengir if not for the fact that they had not been eaten in the minutes since they had arrived. Jahen then went closer to examine the plant, with Tarpfen warning her to be careful. The smell caused her to hallucinate, making her think that she was back on Soika, fighting in a battle.\nTarpfen tried to suppress Jahen, who was attacking anyone in sight, unaware that she was on Starlight Beacon. She punched Tarpfen in the face and was eventually thrown against a column, which knocked her out of the hallucination. Tarpfen stood nearby, bemused, checking her jaw to make sure it was intact. She was impressed with Jahen's punching abilities. Professor Glenna Kip then arrived, the scientist behind the hybrid plant. She explained that the plant was a johto flower, which had been spliced with a strain of the Drengir. Jahen was enraged, as was Tarpfen. Kip tried to tell Jahen all about the positive traits of the flower, but she was unconvinced, reminder the professor of the riot, who apologized. She then had Starros use salt to kill the flower.\nTarpfen then asked what would stop others from breeding Drengir with other crops now that Kip had, noting that it would be worrisome if they were abel to seed themselves. Kip dismissed his worries, explaining that all data pointed to the Drengir never seeding themselves. Jahen was unconvinced, but her headache left her in no condition to argue the point further. Tarpfen offered to go for a drink Jahen, notably one other than tarine tea. As they walked away, Tarpfen told the Soikan that she was interested to see her punch again, which made Jahen wince. She once again apologized, but Tarpfen declined, noting that it was the first time she liked Jahen. Around that year, Tarpfen was set to give an update on Nihil tactics during a briefing, but due to an attack in the Galov system, the briefing was interrupted. Also around that time, Tarpfen provided info for the Jedi High Council on Nihil activity in the Soola system, which was intercepted in comms by her team.\nAround that same year, what Tarpfen called a \"fracas\" took place on Starlight Beacon; unable to deal with it due to her being behind in processing Nihil prisoners, Tarpfen called in Jahen, instructing her to head to Hangar Bay Four. Though the Mon Cal was less behind than she was the day before, Jahen was in the next section and able to get there quicker. The Soikan agreed, but Jahen felt that Tarpfen was now in her debt.\nThe \"fracas\" turned out to be a Vuman by the name of Vane, a former lover of Jahen. The two reconnected, but the Trandoshan Jedi Sskeer, however, looked into Vane and found evidence of him running Nihil weaponry. Tarpfen apprehended him and put him in handcuffs. Later, around 230 BBY, Jahen later tried to apologize for the incident, though Tarpfen was past it.\nAlso around 231 BBY, Tarpfen was responsible for interrogating \"Prisoner Forty-Two,\" who had been identified as \"Sal Krost\" but was secretly the Twi'lek Tempest Runner Lourna Dee of the Nihil. A guard brought the prisoner into a small room, where Tarpfen asked the Nihil to take a seat. Dee rhetorically asked if the chief was referring to her or the guard; Tarpfen shot down that attitude, assuring Dee that they would get on fine without it. Dee was surprised when the Mon Calamari sent the guard away, but Tarpfen told her she could handle herself. Based on the way her interrogator was sitting, Dee guessed that she had been a part of the Mon Cala Royal Guard.\nIgnoring her, Tarpfen asked permission to record the interview, explaining that she was going to regardless but allowed for the prisoner to register protest. Dee had no issue with it, so Tarpfen began, giving her own name and then confirming the Nihil's as Sal Krost. She then began inquiring about Dee's role in the Nihil, even discussing Lourna Dee as though she was a different Twi'lek. They then got to the topic of the prisoner's teeth, which were sharpened in a manner that was traditionally male. Dee mentioned that she did not always appear as she did then—before the Nihil, she was different.\nPushing further, Tarpfen got Dee to talk about her family. As she continued the questioning, Dee accused Tarpfen of repeating what she said as an interrogation tactic to make it seem like she cared; Tarpfen claimed that she was indeed curious and that what she wanted from her prisoner was the truth—to know why someone would turn their back on the galaxy for the Nihil. Dee rejected the idea and maintained that she loved the galaxy and its riches—Tarpfen then deduced that Dee was in it for the money. The pair continued talking about Dee's past and her history with her family, which pained her to recall.\nAfter a while, including brief questions from Tarpfen, Jahen called the chief to informher that she was needed in the Hub, so the Mon Cal ended the recording, ordered the guard—who had re-entered—to take Dee back to her cell, and informed Dee of her sentence: Tarpfen gave her ten years on the correctional vessel Restitution. Dee was surprised at the length, but Tarpfen wanted her to have an opportunity for a second chance and to rebuild her life—the Republic way. Although Tarpfen was unsure if \"Krost\" deserved it, she was taking a leap of faith with her.\nThat time saw an increased workload for Tarpfen and the space station's staff, with several weeks featuring Nihil prisoners and their processing. At that time, Tarpfen experienced a dream that had became common to her during her service on Starlight Beacon: back on Mon Cala, she relived the moment that Shenrick relieved her of her duties. One of those times occurred while she was trying to finish up a report; she only woke up due to Velko Jahen calling her name. As that was the third time she had fallen asleep, Jahen suggested a break that the Mon Cal quickly declined. Jahen had come to Tarpfen to alert her to the presence of Vice President Hackrack Bep of the planet Dalna. A routine procedure, Tarpfen suggested placing Bep in the same secured wing as Senator Ghirra Starros, but Jahen had an issue: corridor sixteen's security suite displayed an error on the security system.\nTarpfen was able to correct it, bringing the cameras back online. After stops at the refresher and springs, she took a rest break, forcing her to look upon Shenrick's eyes once more. She awoke earlier than intended but knew that there was no chance of getting back to sleep, so Tarpfen got up to see if Rodor Keen was available to discuss the camera error. He was not, but Jahen was; the Soikan had an urgent code from the Republic that only Tarpfen could access.\nThe Mon Cal reluctantly opened up the holo, quickly realizing that it was no normal Republic message: a masked human figure commanded Tarpfen to disable three corridors' camera systems, warning that they would spill her secrets if she did not comply. The individual then shouted a Nihil war-cry through their low-signal connection and signed off. The combination of Tarpfen's recent Shenrick-related dreams; that one of the named corridors, number sixteen, already had an issue; and the message made her feel ill. The messaging encryption seemed to be legitimate, so Tarpfen was able to deduce that these Nihil had friends in high places. She was also able to connect the odd holos that had come her way in the past months, including Mon Calamari gossip sites, documentary excerpts, and the holodrama that she and Shenrick had enjoyed together, to realize that she was the target of blackmail.\nThe threat of her past life being revealed scared Tarpfen to her core, and it worried her that her and Shenrick's affair could ruin both Shenrick and her own family back on Mon Cala. Jahen brought the Mon Calamari a cup of her preferred kelp tea, asking her to check on Senator Starros, who had been constantly sending in requests for assistance. With a sigh, Tarpfen conceded that she would. At that point, Jahen noticed something amiss with her friend; though Tarpfen insisted that all was fine, the fact that she had just been blackmailed to allow a senator to be less protected made everything not fine in her book. Left with no choice, she complied. She had an early meal with Jahen that morning.\nTasking a security droid with scanning the feeds, Tarpfen hurriedly went to the senator's suite, only to find a door open in an odd way. Now on high alert, Tarpfen, with a blaster in hand, crept in. She quickly noticed a Theelin man—Vice President Bep—on the ground and heard her name spoken in poor Mon Calamari; a dark-skinned, familiar-looking human lamented that Tarpfen should have listened to the Nihil. The Mon Cal tried to draw her blaster but was hit from behind. As she fell to the floor, she realized that the woman was in fact Senator Starros.\nSince the cams near Bep's room had been disabled prior to the attack on him, there was no way to check the footage. The Nihil responsible for knocking the Mon Calamari unconscious had also removed her from Starlight Beacon, leading Tarpfen to become a primary suspect in the Bep attack. Master Estala Maru hoped to ask Jahen questions regarding the security chief's disappearance, though the administrator was not aware of any new information—indeed, Tarpfen had only vanished in the past hour. Jedi Knight Lyssa Votz speculated that Tarpfen could be involved with the Nihil, which worried the others about how much influence the pirates truly had on the Republic.\nWhen Bep was asked about the incident, he revealed that he did not remember his attacker nor did he ever know Ghal Tarpfen. Three days later, Tarpfen was still not heard from. Jahen began to fear that her colleague was indeed a traitor to the Republic, though despite the overwhelming evidence, the Soikan had a gut feeling that Tarpfen was innocent.\nAfter her abduction, Tarpfen awoke bound to a chair aboard a ship she was unfamiliar with. She speculated that it had to have been around a day since she was knocked out, and her body ached, by her guess due to knockout gas. Tarpfen tested the bindings but found them tight, choosing to preserve her strength. A while later, an Aqualish woman came in the room, informing her that they would soon land at their destination in No Space. Tarpfen noticed the Aqualish's key fob and concocted a plan, tricking her captor into thinking that her Mon Calamari skin was in desperate need of water. The Nihil gave in, but as she brought over a sprayer, Tarpfen gave a powerful kick that knocked her unconscious, before using her foot to tap the fob and unlock her restraints.\nNow free of that particular barrier, Tarpfen got up to get some water for herself, realizing that she was in fact thirsty. She ordered from the food unit—enough for both drinking and pouring over her head, not trusting the Aqualish's sprayer. Once that was completed, she exited her prison to find out what other Nihil were on the ship. It seemed empty, and even though she was listening closely, Tarpfen could find anyone else onboard. She even checked various compartments but found nothing.\nTarpfen ultimately entered the craft's cockpit, finding a Chagrian at the helm. She tried to use the element of suprise but alerted the Chagrian to her presence, allowing the Nihil to block the Mon Cal's punch and return one of her own to Tarpfen's midsection. The Chagrian was surprised that Tarpfen had escaped the ship's galley, and her next attempt to kick the Mon Calamari allowed Tarpfen to pin the Chagrian to the ground, kneeling on her chest and twisting her lethorns. She then recognized the Nihil: Jeni Wataro, an aide to Republic Senator Izzet Noor. Wataro laughed at the accusation, for she worked for whomever she saw fit.\nThe ship then alerted the sparring pair of another craft nearby. Wataro again laughed—she explained the signal and guaranteed that it would not be a Republic vessel. Tarpfen subdued the Chagrian until she no longer struggled back, dragging her and locking her out of the cockpit. The Mon Cal was at a piloting disadvantage: she had not flown for years, and the controls were not labeled in Basic. Swearing loudly as her hope dissipated, she then realized that the setting were locked, and she was unable to gain control. Her feeling of helplessness only grew when she saw that three enemy ships faced her, and when the comm unit received an incoming transmission, she simply ignored it. She felt that she had lost.\nAfter collecting herself, Tarpfen realized that she could at least warn the Republic of the data she had gathered. She sent a voice message detailing which Republic individuals were compromised to as many channel frequencies as she could—mostly Republic but some Mon Cal. She repeated it a few times until Wataro started trying to bang down the cockpit doors, screaming at Tarpfen to unlock the escape shuttles for her. When she declined to do so, the Chagrian reminded her of their grim fate; Tarpfen countered by bringing up the deadly attack on Valo, where she had had family. The Mon Calamari leaned back and sang a lullaby from her childhood. Tarpfen reflected that it was a better death than she had hoped to have.\nTarpfen's message was able to partly reach Starlight Beacon. It was received by Estala Maru, who had Padawan Imri Cantaros alert Jahen so that she could listen. Maru played the snippets of the recording that they had been able to recover and informed Jahen of his plans to investigate if more existed. Tarpfen's end left a sinking feeling in the Soikan, who reflected that even as Tarpfen was well outside of Republic-controlled space, her last act was to send them a warning. Maru forwarded the message to Jahen and consoled her for her loss; the Soikan was lost in though.\nJahen walked about Starlight, thinking about Tarpfen's warning and about how the Mon Cal could have even learned of the information in the first place. Her loss brought up many emotions, for Tarpfen had taught her more than she had ever realized. Jahen considered Tarpfen to have been an ally—more than just a friend—and Jahen decided to both try and find out the details of Tarpfen's demise and vow to guide Starlight Beacon through the upcoming troubles in the Mon Calamari's memory.\nGhal Tarpfen was created for the Star Wars: The High Republic serialized fiction, first appearing in Cavan Scott's \"Starlight: First Duty,\" the first part of which was published in the 201st issue of the Star Wars Insider magazine on March 30, 2021. Tarpfen first received illustration in the subsequent story, \"Starlight: Hidden Danger,\" which was written by Justina Ireland, illustrated by Louie De Martinis, and published in Insider's 203rd issue on June 22, 2021. She continued to be a main character for the rest of the Starlight Beacon–focused short stories for The High Republic.\n\"Starlight: Shadows Remain\", the final entry in the Starlight short stories, depicts Ghal Tarpfen discovering Vice President Hackrack Bep just after he has been attacked, while Senator Ghirra Starros and her accomplice are still on the scene. Tarpfen is subsequently abducted by the perpetrators. The High Republic: Mission to Disaster, conversely, mentions that Tarpfen is working with Velko Jahen to search for the culprit in the aftermath of Imri Cantaros' discovery of the crime scene, before disappearing the day after the attack. Both the novel and the short story were written by Ireland. This article has the short story take precedence where the two sources differ.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Starlight:_Shadows_Remain",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Mon_Cala",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Mon_Calamari_monarchy",
  "/wiki/Mon_Calamari_Guard",
  "/wiki/Galactic_Republic",
  "/wiki/Chief",
  "/wiki/Head_of_Security",
  "/wiki/Jedi",
  "/wiki/Space_station",
  "/wiki/Starlight_Beacon",
  "/wiki/Homeworld",
  "/wiki/Controller",
  "/wiki/Rodor_Keen",
  "/wiki/Medcenter",
  "/wiki/Administrator",
  "/wiki/Velko_Jahen",
  "/wiki/Targon",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Treason",
  "/wiki/Galactic_Senate",
  "/wiki/Starship",
  "/wiki/No-Space",
  "/wiki/Pilot",
  "/wiki/Spy",
  "/wiki/Planet",
  "/wiki/Reproduction",
  "/wiki/Rhal",
  "/wiki/Gera",
  "/wiki/Youngling",
  "/wiki/Death",
  "/wiki/Jara_fish",
  "/wiki/Parent",
  "/wiki/Music",
  "/wiki/Captain_Third_Class",
  "/wiki/Shenrick",
  "/wiki/Unidentified_Mon_Calamari_holodrama",
  "/wiki/Prince",
  "/wiki/Throne",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Marriage",
  "/wiki/232_BBY",
  "/wiki/Soikan",
  "/wiki/Jedi_Master",
  "/wiki/Estala_Maru",
  "/wiki/Standard_hour",
  "/wiki/Human",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Politics",
  "/wiki/Droid",
  "/wiki/KC-78",
  "/wiki/May_the_Force_be_with_you",
  "/wiki/The_Force",
  "/wiki/Soldier",
  "/wiki/Velko_Jahen%27s_father",
  "/wiki/Velko_Jahen%27s_mother",
  "/wiki/Bodyguard",
  "/wiki/Ambassador",
  "/wiki/Ceeril",
  "/wiki/Rion",
  "/wiki/Unidentified_Medoslean",
  "/wiki/Nurse",
  "/wiki/Okana",
  "/wiki/Doctor",
  "/wiki/Gino%27le",
  "/wiki/Blaster",
  "/wiki/Medoslean",
  "/wiki/Hypo",
  "/wiki/Concussion",
  "/wiki/Time",
  "/wiki/Juvan",
  "/wiki/Ceeril%27s_bodyguard_droid",
  "/wiki/Avar_Kriss",
  "/wiki/Nib_Assek",
  "/wiki/Burryaga_Agaburry",
  "/wiki/Bodyguard_droid",
  "/wiki/Processor",
  "/wiki/Assassin",
  "/wiki/Limb/Legends",
  "/wiki/Hassarian",
  "/wiki/Detonite",
  "/wiki/Tongue",
  "/wiki/DNA",
  "/wiki/Coruscant",
  "/wiki/231_BBY",
  "/wiki/Galactic_Agricultural_Alliance",
  "/wiki/Computer_monitor",
  "/wiki/Flower",
  "/wiki/Cam_droid",
  "/wiki/Yomo",
  "/wiki/Prot_Xan",
  "/wiki/Turbolift",
  "/wiki/Ithorian",
  "/wiki/Amani",
  "/wiki/Stun",
  "/wiki/Nutrient_paste",
  "/wiki/Siniteen",
  "/wiki/Sh%27nar_Qwasba",
  "/wiki/Scientist",
  "/wiki/Security_droid",
  "/wiki/Second",
  "/wiki/Species",
  "/wiki/Ateseven",
  "/wiki/Crowd_suppression",
  "/wiki/Atmosphere",
  "/wiki/Sleep",
  "/wiki/Poison",
  "/wiki/Plant",
  "/wiki/Standard_day",
  "/wiki/Avon_Starros",
  "/wiki/Tree",
  "/wiki/Vine",
  "/wiki/Drengir",
  "/wiki/Diet",
  "/wiki/Standard_minute",
  "/wiki/Professor",
  "/wiki/Glenna_Kip",
  "/wiki/Johto_flower",
  "/wiki/Salt",
  "/wiki/Tarine_tea",
  "/wiki/Battle_of_Galov",
  "/wiki/Galov_system",
  "/wiki/Jedi_High_Council",
  "/wiki/Soola_system",
  "/wiki/Prisoner",
  "/wiki/Vuman",
  "/wiki/Vane",
  "/wiki/Trandoshan",
  "/wiki/Sskeer",
  "/wiki/Stun_cuffs",
  "/wiki/230_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Twi%27lek",
  "/wiki/Tempest_Runner",
  "/wiki/Lourna_Dee",
  "/wiki/Tooth",
  "/wiki/The_galaxy",
  "/wiki/Galaxy",
  "/wiki/Prison",
  "/wiki/Standard_decade",
  "/wiki/Prison_ship",
  "/wiki/Lourna_Dee_(prison_ship)",
  "/wiki/Standard_week",
  "/wiki/Dream",
  "/wiki/Vice_President",
  "/wiki/Hackrack_Bep",
  "/wiki/Dalna",
  "/wiki/Senator",
  "/wiki/Ghirra_Starros",
  "/wiki/Camera",
  "/wiki/Refresher",
  "/wiki/Eye",
  "/wiki/Hologram",
  "/wiki/Standard_month",
  "/wiki/Holodrama",
  "/wiki/Theelin",
  "/wiki/Mon_Calamari_(language)",
  "/wiki/Jedi_Knight",
  "/wiki/Lyssa_Votz",
  "/wiki/Knockout_gas",
  "/wiki/Aqualish",
  "/wiki/Water",
  "/wiki/Cockpit",
  "/wiki/Chagrian",
  "/wiki/Lethorn",
  "/wiki/Jeni_Wataro",
  "/wiki/Aide",
  "/wiki/Izzet_Noor",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Comm_unit",
  "/wiki/Escape_pod",
  "/wiki/Attack_on_Valo",
  "/wiki/Padawan",
  "/wiki/Imri_Cantaros",
  "/wiki/Realspace",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/Star_Wars:_The_High_Republic:_Starlight",
  "/wiki/Cavan_Scott",
  "/wiki/Starlight:_First_Duty",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars_Insider",
  "/wiki/March_30",
  "/wiki/2021",
  "/wiki/Starlight:_Hidden_Danger",
  "/wiki/Justina_Ireland",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/June_22",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Starlight:_Past_Mistakes",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/The_High_Republic:_Tempest_Runner_(script)",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/The_High_Republic:_Mission_to_Disaster_(audiobook)",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/Star_Wars",
  "/wiki/Prize_Giveaway!",
  "/wiki/Star_Wars_Insider_214",
  "/wiki/Databank_(website)",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/32_BBY",
  "/wiki/Republic_Fair",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Battle_of_Grizal",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Titan_Magazines"
 ]
}