{
 "name": "Ghenli",
 "display_name": "Ghenli",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  }
 ],
 "content": "Ghenli was a human male who resided on the astronomical object Hon-Tallos. During the High Republic Era, Ghenli bullied the Nautolan girl Vroma after he accused her of stealing durga berries from one of the groves that he claimed was his. Ghenli's bullying was stopped with the help of Nihil member Deva Lompop, who scared Ghenli. He then admitted to trying to steal and ran off.\nGhenli was a human male who resided on Hon-Tallos. During the High Republic Era, he accused the Nautolan girl Vroma of stealing a durga berry from one of the groves where they grew and chased her throughout the city in order to stop her. He shoved her to the ground and told her that \"tentacle-heads\" like Vroma were not allowed in the groves, such as the one he claimed was his. Ghenli usually did this to Vroma when she possessed something he wanted.\nVroma then enlisted the help of Nihil marauder Deva Lompop to stop Ghenli's bullying. The two developed a plan to stop him at the groves. The plan was then put into motion with Vroma wandering the groves with a durga berry. Ghenli and his friends soon confronted her and he warned her that he already told her to leave. Vroma told him that he should stop because the Grove Guardians would not be happy. Ghenli did not believe in the Grove Guardians and the chase began.\nGhenli and his friends chased Vroma throughout the groves, proclaiming the berries were only for them. But each of Ghenli's friends were picked off, causing him to worry where they went. Vroma tried to warn Ghenli about the Grove Guardians but he had now made them angry. Ghenli still did not believe in them, but he was interrupted by a loud voice, wanting to know who disturbed the groves. A large figure named the Guardian of the Groves appeared and was going to punish Ghenli for not sharing the groves. He was scared but still did not believe it was real, but the figure then announced it would devour him. It jumped at Ghenli and revealed itself to be Lompop, causing Ghenli freaked out and promised to not steal again. He then quickly ran out of the groves.\nGhenli had pale skin with brown hair, a unibrow, and black eyes. He was a bully with a rude attitude towards others. He was willing to use physical force to get his way, as seen when he pushed down Vroma.\nGhenli wore a stitched up grey shirt and brown jacket. He also wore black pants with light grey boots.\nGhenli appeared in \"Tales of Villainy: A Very Nihil Interlude\" the backstory of the fourteenth and final issue of the 2020 Star Wars Adventures anthology Star Wars comic book series. The comic story was written by Justina Ireland, illustrated by Nick Brokenshire and published by IDW Publishing on February 9, 2022",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Hon-Tallos",
  "/wiki/High_Republic_Era",
  "/wiki/Nautolan",
  "/wiki/Youngling",
  "/wiki/Vroma",
  "/wiki/Durga_berry",
  "/wiki/Hon-Tallos_groves",
  "/wiki/Nihil",
  "/wiki/Deva_Lompop",
  "/wiki/City",
  "/wiki/Marauder",
  "/wiki/Grove_Guardians",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Boot",
  "/wiki/Tales_of_Villainy:_A_Very_Nihil_Interlude",
  "/wiki/Star_Wars_Adventures_(2020)_14",
  "/wiki/2020",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Justina_Ireland",
  "/wiki/Nick_Brokenshire",
  "/wiki/IDW_Publishing",
  "/wiki/February_9",
  "/wiki/2022"
 ]
}