{
 "name": "Ghes Orade",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Fett",
      "Vevut"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians"
     ]
    }
   ]
  }
 ],
 "content": "Ghes Orade was a Human male and a member of the Mandalorians, serving as a soldier under the leadership of Mand'alor Boba Fett during the time of the Second Galactic Civil War.\nOrade was orphaned at a young age, though he would be taken in by his neighbor and friend to his late parents, Novoc Vevut. Despite knowing one another for nearly all of the boy's life, Orade and Vevut did not get along well during the first years they spent together, although their relationship would come to be quite close over time.\nIn 40 ABY, Orade was present at Zerria's Bar on the planet Drall, during a meeting called by Boba Fett in which he discussed an offer by Corellian President Thrackan Sal-Solo to defend Centerpoint Station, with Orade and several other Mandalorian Protectors. It was there that he first met Fett's granddaughter, Mirta Gev, whom he played against in a friendly game of Cheg.\nUpon his return to Mandalore, Orade's relationship with Mirta turned quickly toward romance. He met Boba Fett again while he accompanied Mirta to her mother's grave, whereupon the Mand'alor gave the two his approval with the addendum that should Orade break Mirta's heart, Fett would break his legs. Orade didn't doubt the bounty hunter's promise. He was one of the few who knew of Boba Fett's deteriorating health and was present at the Beviin-Vasur farm when the cure delivered by Venku Skirata was administered.\nIn 41 ABY, Orade was part of the team of Mandalorian Supercommandos—including his father, and Mirta, to whom he was now betrothed—put together by Fett as backup for Admiral Natasi Daala during the Second Battle of Fondor. Following the battle, Orade married Mirta on Mandalore, and the two held a celebration in Keldabe.\nOrade later participated during the Second Battle of Roche along with his wife and fellow Mandalorians Roegr and Vatok Tawr. During the battle, Orade was grievously injured, and Gev told the Jedi Jaina Solo that he would survive provided they could get him to a Tra'kad. While Gev was fighting Darth Caedus, she was badly injured and captured by Caedus. After the Battle of Uroro Station, during which Gev was freed from Alliance clutches, Leia Organa Solo told Jaina that both Gev and Orade were recovering, though not on Mandalore, due to a Nanovirus targeting the Fett genome.\nThe images show Orade and his stepfather, Vevut. The image shows Orade as a child, but in Legacy of the Force: Bloodlines, he is grown, with a beard, short hair and a broken nose. The first image appeared in Star Wars Insider 86, the second image was an earlier, but rejected version of it, from a different angle. Both images are by Tom Hodges.\nHis last name is derived from the Mando'a word orar, meaning \"thunder.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Clan_Fett",
  "/wiki/Clan_Vevut",
  "/wiki/Mandalorian/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Mandalore_(title)",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/File:MandoFatherSon.jpg",
  "/wiki/Novoc_Vevut",
  "/wiki/40_ABY",
  "/wiki/Zerria%27s_Bar",
  "/wiki/Planet/Legends",
  "/wiki/Drall_(planet)",
  "/wiki/Corellian/Legends",
  "/wiki/President_of_Five_Worlds",
  "/wiki/Thrackan_Sal-Solo",
  "/wiki/Centerpoint_Station",
  "/wiki/Mandalorian_Protectors/Legends",
  "/wiki/Mirta_Gev",
  "/wiki/Cheg",
  "/wiki/Mandalore/Legends",
  "/wiki/Ailyn_Vel",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Beviin-Vasur_farm",
  "/wiki/Venku_Skirata",
  "/wiki/41_ABY",
  "/wiki/Mandalorian_Supercommando",
  "/wiki/Admiral/Legends",
  "/wiki/Natasi_Daala",
  "/wiki/Second_Battle_of_Fondor",
  "/wiki/Wedding_of_Ghes_Orade_and_Mirta_Gev",
  "/wiki/Keldabe/Legends",
  "/wiki/Second_Battle_of_Roche",
  "/wiki/Roegr",
  "/wiki/Vatok_Tawr",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Tra%27kad-class_transport",
  "/wiki/Darth_Caedus",
  "/wiki/Battle_of_Uroro_Station",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Nanovirus",
  "/wiki/Legacy_of_the_Force:_Bloodlines",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/Tom_Hodges",
  "/wiki/Mando%27a/Legends",
  "/wiki/File:MandoFatherSon02.jpg",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/Legacy_of_the_Force:_Invincible",
  "/wiki/The_Mandalorians:_People_and_Culture",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}