{
 "name": "Ghez_Hokan",
 "display_name": "Ghez Hokan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Qiilura"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Trade Federation of Planets",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Ghez Hokan was a Human male Mandalorian mercenary who rented his services to the Confederacy of Independent Systems during the Clone Wars.\nSome time before the Clone Wars, the Mandalorian mercenary Ghez Hokan found work as the primary enforcer for Neimoidian Lik Ankkit, the Trade Federation's representative on the remote world of Qiilura. He wasn't fond of the job, however, as his own men gave him more trouble than the share-croppers he terrorized. The dregs of the underworld, his 'army' was composed of Weequays, Ubese, and whoever else his employer recruited, and the mercenary despised them. Hokan personally killed Jedi Master Kast Fulier with the latter's own lightsaber, which Hokan kept because it made a convenient tool for executing lieutenants. When the Confederacy of Independent Systems built a top-secret research facility on Qiilura, the mercenary jumped at the chance for a career change.\nHokan made a deal with the Confederacy that cut Ankkit out of the picture and gave him military control of the planet, with him being assigned the provisional rank of major. He was assigned by the Separatists to protect the bioweaponry research bunker on Qiilura and more specifically, Doctor Ovolot Qail Uthan and her research team. When Omega Squad arrived on the planet, the Confederacy supplemented Hokan's militia with one hundred B1 battle droids and a handful of organic lieutenants. Hokan led the search for Omega Squad, not knowing he was facing only four men until it was too late.\nFulier's Padawan, Etain Tur-Mukan, managed to escape Hokan, and was on the run when she met a sole member of the newly joined Omega Squad. She was horribly upset at her Jedi Master's death, and immediately tried to kill the clone, mistaking the clone for Hokan because the commando's Katarn armor was visually similar to Mandalorian armor, despite the difference in paint schemes. When Omega Squad destroyed the clone-killing virus and captured Dr. Uthan, Atin and Darman brought both back to a waiting LAAT/i gunship, but Hokan's second in command came with a speeder bike and shot Atin with a high-powered Verpine weapon.\nMeanwhile, Niner and Fi faced Hokan by themselves. Niner tricked Hokan by lying on the ground and pretended he was horribly wounded, screaming not for his mother, like most organic men, but for his training sergeant, Kal Skirata. Hokan was about to kill Niner with a vibroblade out of pity, but Etain Tur-Mukan attacked Hokan from behind and decapitated him.Fi kept Hokan's armor as a souvenir, and wore it as his own when later living on Mandalore. Uthan, seeing Hokan's armor, thought he had survived when she too was brought to Mandalore by Fi's father, Kal Skirata, but was relieved when she realized it was only Fi in his armor. Hokan's helmet was eventually given to Venku Skirata as a gift from his uncle Fi.\nHokan was seen by many as an unpleasantly violent figure, and was rumored to have been kicked out of Death Squad for \"enjoying his work too much.\" He was ruthless and efficient, seen in when he would kill off his former militia for being ineffective against the clone squads assaulting Dr. Uthan's lab.\nHe also had some degree of honor, when he refused to use a lightsaber to strike down a clone of Jango Fett, as he though it would be degrading.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Ghez_Hokan",
  "/wiki/22_BBY/Legends",
  "/wiki/Qiilura",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Ovolot_Qail_Uthan",
  "/wiki/Mercenary/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Lik_Ankkit",
  "/wiki/Planet/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Ubese/Legends",
  "/wiki/Kast_Fulier",
  "/wiki/Lightsaber/Legends",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Doctor/Legends",
  "/wiki/Omega_Squad",
  "/wiki/B1_battle_droid",
  "/wiki/Padawan/Legends",
  "/wiki/Etain_Tur-Mukan",
  "/wiki/Atin_Skirata",
  "/wiki/Darman_Skirata",
  "/wiki/Low_Altitude_Assault_Transport/Legends",
  "/wiki/Gunship/Legends",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Verpine/Legends",
  "/wiki/Verpine_shatter_gun",
  "/wiki/Niner_Skirata",
  "/wiki/Fi_Skirata",
  "/wiki/Kal_Skirata",
  "/wiki/Mandalore/Legends",
  "/wiki/Venku_Skirata",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Republic_Commando:_Hard_Contact",
  "/wiki/Republic_Commando:_Triple_Zero",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}