{
 "name": "Ghitsa_Dogder",
 "display_name": "Ghitsa Dogder",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Besadii kajidic"
     ]
    }
   ]
  }
 ],
 "content": "Ghitsa \"Ghits\" Dogder was a female Coruscanti Human, con artist, smuggler, and partner of Fenig \"Fen\" Nabon, with whom she traveled with on the ship the Star Lady. She had short, spiked blonde hair, was self-described as having a great fashion sense, and had a tendency towards wearing outfits with large shoulder pads.\nGhitsa spent several years working as a Hutt counselor for the Besadii kajidic, negotiating multimillion credit deals on behalf of the clan.\nGrowing tired of service to the Hutts and wishing to avoid the lethal end that claimed most counselors, she devised an elaborate scheme in 8 ABY involving Mistryls Shada D'ukal and Dunc T'racen by which she maneuvered Durga the Hutt into dismissing her from his employ, while collecting a hefty payoff in the process. Although no longer officially connected to the Hutt Empire, she still had an insider's knowledge of the organization.\nWhile posing as a Jedi Knight  in 12 ABY on the planet Prishardia, she was kidnapped by Desilijic representatives seeking information about one of Durga's operations. She was beaten and questioned, but having been several years since her service to the Hutts, she had no knowledge of this recent venture. A timely rescue from the kidnappers' ship, the Rook, by Fen and the young Jedi Kyp Durron  prevented her demise.\nGhits and Fen returned Kyp to the Jedi Praxeum on Yavin 4, where Kyp, who had earlier indicated that the Force had directed him to Prishardia, hinting that Ghitsa may have Force sensitivity. Ghitsa, acting uncharacteristically timid, declined to leave the ship, but later destroyed her Jedi disguise, possibly showing a newfound respect for the Jedi Order. After departing the planet, Ghitsa produced a datacard she acquired from the Rook, which contained information on Orko SkyMine, Durga's mysterious operation. Suspecting the importance, and credit value, of the datacard, Ghitsa decided to sell it to Talon Karrde, to which she had earned the distrust of, and his information network. It would later lead to the discovery of the Darksaber project.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Besadii/Legends",
  "/wiki/Kajidic/Legends",
  "/wiki/Coruscanti/Legends",
  "/wiki/Con_artist/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Fenig_Nabon",
  "/wiki/Starship/Legends",
  "/wiki/Star_Lady",
  "/wiki/Hair/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Hutt_counselor",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/8_ABY/Legends",
  "/wiki/Mistryl_Shadow_Guard",
  "/wiki/Shada_D%27ukal",
  "/wiki/Dunc_T%27racen",
  "/wiki/Durga_Besadii_Tai",
  "/wiki/Hutt_Empire",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/12_ABY/Legends",
  "/wiki/Prishardia",
  "/wiki/Desilijic/Legends",
  "/wiki/Rook_(Class_720_freighter)",
  "/wiki/Jedi/Legends",
  "/wiki/Kyp_Durron",
  "/wiki/Zeth_Fost",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yavin_4/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Orko_SkyMine_Asteroid_Processing_Corporation",
  "/wiki/Talon_Karrde",
  "/wiki/Darksaber_(superweapon)",
  "/wiki/Category:Images_of_Ghitsa_Dogder",
  "/wiki/Star_Wars_Gamer",
  "/wiki/A_Credit_for_Your_Thoughts",
  "/wiki/Star_Wars_Gamer_2",
  "/wiki/Hutt_and_Seek",
  "/wiki/Tales_from_the_New_Republic",
  "/wiki/Simple_Tricks",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}