{
 "name": "Gial_Ackbar",
 "display_name": "Gial Ackbar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Prior to 52 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Raddus",
      "Oetchi system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow-orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Salmon"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Calamari monarchy",
      "Mon Calamari Guard",
      "Mon Calamari Guard",
      "Galactic Republic",
      "Galactic Empire",
      "Alliance to Restore the Republic",
      "Rebel Alliance Navy",
      "Alliance High Command",
      "Rebel Alliance Navy",
      "Alliance High Command",
      "New Republic",
      "New Republic High Command",
      "New Republic Defense Fleet",
      "New Republic High Command",
      "New Republic Defense Fleet",
      "Resistance",
      "Resistance High Command",
      "Fleet Command",
      "Resistance High Command",
      "Fleet Command"
     ]
    }
   ]
  }
 ],
 "content": "Gial Ackbar was a veteran male Mon Calamari soldier and strong revolutionary leader during the Clone Wars, the Galactic Civil War, the Cold War, and the war between the Resistance and the First Order. Throughout his sixty years of service, Ackbar was regarded as a brilliant tactician.\nAckbar hailed from the planet Mon Cala and served as the captain of the Mon Calamari Guard. During the Clone Wars, Ackbar fought in the Battle of Mon Cala, in which he helped to secure Prince Lee-Char's ascent as King of Mon Cala and repel the Confederacy of Independent Systems. After the rise of the Galactic Empire, Ackbar became the foremost military commander in the Alliance to Restore the Republic, emerging as a symbol of defiance against the Empire's subjugation of non-humans. His presence attracted Mon Calamari support for the Alliance, thus supplying the Mon Calamari star cruisers that made up a bulk of the Alliance Fleet.\nFrom his command ship of Home One, supreme commander Ackbar acted as the fleet commander during the Battle of Endor, in which the Alliance successfully mounted an attack that led to the destruction of the Empire's second Death Star and the death of Emperor Palpatine. After the Battle of Endor, the Alliance formed the New Republic. Ackbar became a fleet admiral of the New Republic Defense Fleet and led the Republic to its victory over the Empire during the Battle of Jakku. After the battle on Jakku ended, the Empire retreated into the Unknown Regions and Ackbar retired to Mon Cala.\nBy 34 ABY, the emerging threat of the First Order, which arose from the ashes of the Empire, led Princess Leia Organa to form the Resistance without the support of the Republic that had turned a blind eye to the First Order. Organa, the general of the Resistance, coaxed Ackbar out of his retirement to serve in the Resistance. After reclaiming his commission as an Admiral, Ackbar served in the Resistance base on D'Qar, where he helped oversee the battle to destroy the First Order superweapon known as Starkiller Base.\nAckbar was later present on the bridge of the Resistance's flagship the Raddus when the Resistance evacuated from D'Qar, but he was killed when two First Order TIE/sf space superiority fighters attacked the ship after it exited hyperspace.\nGial Ackbar was born on the aquatic planet Mon Cala during the final years of the Galactic Republic. Mon Cala was a part of the Republic, ruled by Supreme Chancellor Sheev Palpatine, and Ackbar eventually enlisted into military service to the Mon Calamari Guard, which was tasked with protecting Mon Cala's monarchs and dignitaries. Ackbar eventually worked his way through the ranks of the guard, and became its captain; therefore, he also became the chief military advisor to the leader of the ocean world.\nKing Yos Kolina ruled Mon Cala during the Clone Wars, between the Confederacy of Independent Systems and the Galactic Republic. The war subsequently came to Mon Cala when Separatist Riff Tamson assassinated Kolina. Members of the Quarren Isolation League, however, which was led by Chieftan Nossor Ri, took credit for the crime in order to provoke a civil war on the planet, thereby preventing the rightful heir to the throne, the young Prince Lee-Char, from ascending to it. Ackbar, as the captain of the Mon Cal Knights, became Lee-Char's protector. In the Mon Calamari capital, a meeting was soon held, where Jedi Knight Anakin Skywalker and senator Padmé Amidala of Naboo attended as representatives to the Republic.\nHowever, the Quarren isolationists ensured Tamson—one of Count Dooku's many Separatist enforcers—was present as well. The Quarren dignitaries voiced that they did not want Lee-Char as their king because he was too young and inexperienced. As the debates went on, what the Quarren did want became clear: a Quarren king, not another Mon Calamari ruler. Lee-Char assured the Quarren that he was dedicated to serving both races in a mutually beneficial way, Tamson, however, ordered him to cease speaking, as he had not \"earned the right.\" Ackbar rushed in and reminded the Karkarodon that he had no say, as he was just an observer for the Confederacy. Ri then said that the Quarren, their argument not agreed to, were done with the negotiations and exited.\nAckbar, Skywalker, and Amidala reported in to the Jedi Council, specifically Jedi Master Yoda, aboard a Republic frigate, where Ackbar informed the council that a civil war on Mon Cala was inevitable. Yoda, therefore, in order to keep Mon Cala aligned with the Republic, dispatched a company of clone SCUBA troopers, Jedi Kit Fisto, and Skywalker's Padawan Ahsoka Tano, to bolster the defenses of the Mon Calamari. Ackbar then met with Mon Cala's senator in the Galactic Senate, Meena Tills, who officially assigned Ackbar to protect Lee-Char during the forthcoming battle. Ackbar, however, thought it foolhardy to take the prince onto the battlefront, as he was too inexperienced in combat, though, he gave in, as it was a longstanding tradition for the monarch of Mon Cala to lead the soldiers into battle.\nLater, Lee-Char addressed the gather troops, telling them he did not believe the Quarren intended to attack, but before he finished, the Quarren army attacked, along with Separatist AQ-series battle droids led by Tamson; prompting Ackbar to proclaim \"It's an attack.\" Ackbar and Skywalker quickly rallied their forces to defend the city, and held true to Till's will and took the prince to the front lines. Ackbar then led the charge into the enemy ranks and ordered his troops not to let their homeworld fall to the confederacy. The fighting continued, and soon thereafter, Yoda came through: The Republic's reinforcements arrived. Ackbar moved back to the prince's position, handed him a blaster, telling him to earn the respect of the people; he had to lead the fight. Lee-Char, realizing the wisdom in Ackbar's words, began to rally their forces.\nThe gamble soon paid off when the droids and Quarren retreated to their transports. Ackbar voiced to the Jedi that they had won the first assault. Tills, thinking they had completely defeated the Separatists, told Lee-Char to start dictating for the Separatists' surrender. Ackbar halted Till's hasty assumptions; the first wave had been beaten, not the battle. However, just then, dozens of massive cyborg Hydroid Medusas descended upon the city. The seemingly invincible jellyfish swept their tentacles through the clone troopers and Mon Calamari, electrocuting many. More droids materialized from behind, and as they were outmatched, Ackbar told the prince it was time to retreat. The pair agreed that the caves on the ocean floor were the safest place, so they fled to the caves. Once there, Lee-Char expressed his concern that his father would have been disappointed in him for the failures that he had befallen during the day's events. Ackbar, however, assured the young prince that Kolina would have been proud of his son.\nWhile regrouping in the caves, the Jedi Council was contacted in order to arrange the deployment of more Republic soldiers. However, before an agreement could be reached, the Council's signal was jammed, leaving Ackbar and the others unsure if the council planned to send reinforcements. Ackbar and Skywalker agreed that it was likely troops would be sent, but Lee-Char believed they would arrive too late to do any good against the Confederacy. Taking the lead, Lee-Char devised a way to escape the planet: take the Republic frigate on the water's surface to Coruscant, the Republic's capital. The plan was agreed on, so the group began the ascent to the surface. A plethora of enemy troops stood in their path, so Fisto diverted the enemy forces and sent down several One Man Submersible Devilfish to expedite the ascent.\nHowever, as they neared the ship, it exploded and the debris rained down over Ackbar and the others. Skywalker told the others to grab onto the debris so it could pull them back down to the ocean floor. Ackbar did so, and as they fell, he voiced that they should split up into two teams to better protect the true location of the prince. Lee-Char agreed, and Ackbar told him to be careful, as he was Mon Calamari's last hope. The prince then went with Tano, Fisto, and the clones, while Ackbar's group, Amidala, Skywalker, and Tills, planned to disrupt the city's communications, which would prevent Tamson from knowing that Republic reinforcements were incoming until it was too late for him to mount a proper counterattack.\nAckbar, Skywalker, and Tills headed to the city's central planetary scanner mast to topple it. Skywalker used the Force to cause it to collapse while Ackbar defended him from aqua droids. The group retreated after the mission succeeded. However, Tamson correctly deduced that the scanner mast alone had been targeted because Republic reinforcements were forthcoming. Therefore, he launched another attack. Ackbar and the others fought the Separatist soldiers in order to keep their attention on them, rather than searching for the prince. Ackbar and the others were soon surrounded by Hydroid Medusas, but were saved when the Republic reinforcements arrived: A Venator-class Star Destroyer deployed members of the Gungan Grand Army from Naboo—who, like the Mon Calamari and Quarren, were amphibians.\nThe Gungans attacked using their traditional weapons—boomas and atlatls—whose plasma-based technologies disabled the Hydroid Medusas, droids and Quarren alike, and freed Ackbar, Tills, and Skywalker, who joined the turning tide of the battle. A Separatist Trident-class assault ship soon arrived and began spinning; creating a vortex that confused the battlefront and scattered soldiers on both sides. Ackbar grabbed on to Skywalker, swam him to the gunship, and threw him up to it. Skywalker severed one of its legs with his lightsaber, causing the craft to spin out of control and crash. However, with their surge in forces nullified, the Republic-aligned troops were taken prisoner by the Separatists.\nAckbar, his troops and the clones were taken to a prison camp on the ocean floor, while Skywalker, Amidala and Fisto were personally interrogated by Tamson. Tano and the prince, however, managed to elude capture again, but Lee-Char thought to rally the forces—Mon Calamari, Gungan, clone, Jedi, and even Quarren—to all together overwhelm Tamson and his droids. He infiltrated the prison camp Ackbar was detained in to ask his guidance. Ackbar and Tills rejoiced when they saw the prince alive, but were confounded when Lee-Char explained his daring plan to reunify the citizens of Mon Cala against the Separatist invaders. Ackbar was shocked that the prince would ally himself with the people who had killed his father, but Lee-Char told Ackbar that he knew for fact that Tamson had done so. Tano added that she had seen similar occurrences of Dooku manipulating a planet's people to start a civil war, so the prince said that he would find and show Ri the truth. Ackbar agreed to the prince's noble plan and said he would marshal the Mon Calamari troops for battle. Lee-Char also gave the captain his signal of when to attack: when a Quarren attacked a Separatist. Just then, a legion of aqua droids appeared and put the prince under arrest. Lee-Char willingly went with his captors in order to confront Ri and show him the truth.\nLater, Lee-Char was sentenced to death by Tamson, and ordered that all the prisoners be taken to the capital to witness the execution. Tamson's Karkarodon enforcers surrounded the prince while Tamson read aloud the prince's crimes against the Separatist state. Meanwhile, Ackbar and the other prisoners watched from the side. One of Ri's aides materialized and handed Ackbar his baton and informed him that Lee-Char's boldness had worked: Ri and the Quarren had agreed to expel to Confederates and reclaim Mon Cala. Ackbar looked across the plaza and nodded to Ri. The Quarren soldiers quietly distributed arms to the clones and troops, while Ri swam across the plaza, created an ink cloud, and grabbed the prince. Ackbar's troops opened fire on the Separatists and the battle raged once more. Ackbar charged the aqua droids, leading the battle from his side, while Lee-Char proved himself by leading the rest of the forces and killing Tamson, a fearsome warrior—thereby freeing Mon Cala. Ackbar, the Jedi, and Ri, rushed to the young prince and congratulated him.\nSome time later, Ackbar attended Lee-Char's coronation as the king of Mon Cala, like his father had once done. Ackbar stood to the right of the ceremonial throne, witnessing Ri's pledge of allegiance of the Quarren to King Lee-Char, and Lee-Char likewise pledged his loyalty to all the people of Mon Cala.\nAround 18 BBY, Ackbar held the rank of commander as the Chief of Security for King Lee-Char. During the first year of the Imperial Era, Lee-Char had come under the influence of a Jedi Padawan named Ferren Barr. Barr helped Lee-Char defy the Empire in their trade negotiations, which garnered the attention of Emperor Palpatine. Palpatine sent Darth Vader to handle the Jedi, and he had Moff Wilhuff Tarkin park the Sovereign above Mon Cala.\nAs the negotiations in Dac City with Tarkin's ambassador Telvar went nowhere, Darth Vader, five Inquisitors, and a squad of elite clone troopers arrived at Dac City. Upon their arrival, Ackbar stopped the Inquisitors and demanded their business. The Ninth Sister gave Ackbar an Imperial writ legally stopping anyone from bringing any harm to her and the other two inquisitors. Commander Ackbar, thinking it to be outrageous, refused to give any ground, even when Darth Vader stepped in. Vader told him that he was looking for an enemy of the Empire. Ackbar continued to insist that King Lee-Char was involved in peaceful negotiations, nothing more. However, Telvar's shuttle, which had been taking off nearby, exploded. Vader used this to accuse Ackbar of the attack being the fault of the Mon Calamari. Above the planet, Tarkin informed Major Rantu that the deployment of landing craft would commence immediately.\nVader then took his Inquisitors to find King Lee-Char, whom he expected would know where the Jedi was. A battle broke out in Dac City. Meanwhile, Lee-Char, Ackbar, Raddus, and a few other Quarren and Mon Calamari observed how the battle was going. Ackbar reported that the defenders were holding their own, but that the Empire had landed substantial forces on all of the above-ground land. He also noted that the Mon Calamari were not at their best above the waves. Lee-Char hoped to hold the Imperials until the evacuation was complete, although it only fifty percent of civilians had been moved below water by that point.\nLee-Char then spoke with Governor Tarkin, begging him to withdraw the attack. Tarkin maintained that it was the Mon Calamari who had provoked the Empire with the murder of Telvar, and that they would only cease the violence if Lee-Char allowed for him to \"investigate.\" Lee-Char, knowing that an investigation was closer to an invasion, threatened Tarkin with an aggressive defense. Tarkin warned the king to stop fighting, and then ended the call.\nLee-Char then got on a call with Ackbar and Raddus, instructing the former to defend the northern hemisphere and the latter the southern. Ackbar inquired what the king would do, and Lee-Char answered that he planned to make an address to his people. However, just as he signed off with Ackbar and Raddus, Vader and his Inquisitors arrived. Right as Vader began to use the Force on Lee-Char to get him to reveal the location of the Jedi, many creatures emerged from the sea and destroyed the above-ground cities. The waves produced by this destruction even caused Vader to fall into the sea, and he was not able to respond to Tarkin's comm requests.\nVader was eventually able to escape the ocean and was rescued by his Inquisitors, although he insisted to them that he never needed rescue. Lee-Char was rescued, by a group of Quarren in a submarine. Above the ground, Colonel Bergon reported to Tarkin that they were making progress, but just as Tarkin warned her not to underestimate Raddus, Commander Ackbar and a number of Mon Calamari rode in on aquatic vehicles with Ackbar leading the charge, crying out \"For the King! For Mon Cala!\" Bergon sent in her TIE Fighters. Ackbar waited for the TIEs to get closer, and then gave the signal to emerge out of the water.\nThe vehicles' missiles fired at the TIEs and Bergon's platform, penetrated the shields, and destroyed the platform. Ackbar was taken to where Lee-Char was. The both of them thought that Lee-Char would have died. Ackbar explained that they had been able to take down one of the sky-bases, but the Empire would bring more. Lee-Char told Ackbar that they would fight until the Empire withdrew, and that he would save his people. Ackbar, skeptical of this, asked if this was Lee-Char's words or the Jedi's. This reminded him of Barr, who in the meantime was being hunted by Vader and his Inquisitors. Vader, at this point, took his Inquisitors and purge troopers to confront Barr, who was eventually killed. Raddus was able to launch a group of Star Cruisers to help evacuate Mon Calamari. The cruisers, which had originally been merchant vessels, had been refitted for combat.\nNevertheless, the result of the battle ended up being a victory for the Empire. After the invasion, Commander Ackbar fled Mon Cala to serve the Rebellion against the Empire, which he did loyally. At some point, Ackbar was enslaved by Grand Moff Tarkin, but was later saved by the rebels.\nAfter the destruction of Alderaan, a fleet under the command of Ackbar, received a distress signal from Alderaanian refugees attempting to flee from the Empire. In response, Ackbar first sent Echo Squadron, but ended up sending three CR90 corvettes, a Nebulon-B frigate, and the MC80 Liberty Type Heavy Star Cruiser Aurora to help the refugees after he was convinced by Lindon Javes that they needed more help.\nFollowing the Battle of Yavin, the Empire set out to attack the Rebel base. Ackbar was among the Rebel leaders in charge of getting the fleet together to help with the evacuation. Colonel Anj Zavor made contact with Ackbar and what remained of the fleet after the Battle of Scarif, although Ackbar later said in 34 ABY that they were \"Shorthanded, behind schedule, underequipped, and hardly in a position to supplant Raddus and bolster the rebel fleet.\"\nHe helped organize the troops and gather the supplies on the planet for evacuation. During the chaos, Ackbar ran into Princess Leia. He gave his condolences regarding the Destruction of Alderaan while at the same time ordering troops where to bring supplies. He informed her where General Jan Dodonna was, whom she had been looking for.\nAround 0 ABY, Ackbar sent Lieutenant Luke Skywalker along with R2-D2 on a mission to Rodia. Although the objective of the mission was to open new supply lines for the rebellion, Ackbar was uncomfortable with calling it smuggling. The mission had been the idea of Princess Leia, who suggested that the Chekkoo clan would be open to working with them. While Mon Mothma was at first unsure of the idea, when Ackbar supported it, the decision was made. Skywalker noted while he was on the mission that no one seemed to want to challenege Ackbar.\nWhen Skywalker returned, Admiral Ackbar and Princess Leia took a shuttle to the commmand ship Redemption. He began to explain how the mission went, but Ackbar cut him off, uninterested. He was more curious about what happened to Skywalker in the Llanic system, where he had shot down two TIE fighters. Organa revealed that Organa began to explain a new mission, which would have the goal of extracting the cryptologist Drusil Bephorin and bringing her to see her family on Omereth, which Ackbar explained was out past Hutt Space. Ackbar commented that it was an ocean planet, which looked delightful to him, if not for the large and hungry native fish. When Skywalker inquired why he was the one being assigned the mission, Organa explained that a talented pilot would be needed.\nThe Kupohan he had saved had been carrying valuable information that revealed the whereabouts of a Givin cryptologist named Drusil Bephorin who the rebellion wished to extract. Skywalker, who had been planning to use the Desert Jewel, asked for it to receive a weapons upgrade, but Ackbar told him that the Alliance was low on money, and had to focus its resources on maintaining the fleet, and not upgrading it. Skywalker suggested that he ask Nakari Kelen for help as her father was very rich, and was told by Ackbar that she had returned from her training mission. Ackbar did not object to this plan.\nOnce Kelen had returned, she began to converse with Skywalker, with Admiral Ackbar standing nearby. She told him of her father's plan to investigate a new moon his scouts had discovered. Although Kelen did not think that her father would give money for upgrades for nothing, she speculated that he might exchange the funds for a scouting report on the moon, which Kelen thought she and Skywalker could do. Ackbar then cut in, asking if the Empire knew about Fex and the planet it orbited, Sha Qarot, as well as if any sentient species lived there. Kelen was unsure about the former, but told Ackbar there were no sentient species that she knew of. Ackbar gave them permission to go, but also asked that they keep a lookout to see if the moon would make a good base for the Alliance. Skywalker then bade farewell to Ackbar.\nWhen Skywalker returned, the fleet was still hiding in the Orto Plutonia system. When he and Kelen met Ackbar in the Promise, Ackbar was disappointed to hear that Fex would never be able to house a rebel base, but he was encouraged to hear that the Desert Jewel had been upgraded. He then began to brief the pair on their new mission. He explained that their contact ran a noodle hut on the planet Denon as a front for her spywork. They would go to this restaurant and order something strange to indicate what they were looking for.\nUpon Ackbar's forgetting of the strange dish, the protocol droid C-3PO reminded him that it was the Corellian buckwheat noodles with rancor sauce. Ackbar and Kelen both found this dish apalling. Organa assured them that they would not need to eat it, just order it. Sakhet, the shop's owner, would have files ready for them when they arrived. Ackbar told them that their target, Bephorin, wanted to be taken to Omereth, where the Alliance was arranging for her family to be brought. Ackbar warned that she would be heavily guarded, and that the guards may need to be \"taken care of.\" The mission ended up being successful, but Kelen, to the great regret of Skywalker, was killed.\nShortly after the Mission on Denon, Rebel forces managed to bomb an Imperial supply base on Imdaar and a shipyard on Kuat. Ackbar informed Leia Organa of this sometime after the events occurred.\nSometime later, on an Alliance warship, Rebel commanders received a distress signal from R2-D2. Ackbar, Mon Mothma, and General Dodonna learned that Skywalker had been captured by a Hutt crime lord. Ackbar inquired how they could rescue Skywalker, although Mon Mothma regretfully stated that she was unwilling to put out the resources to rescue him. Mothma also began to say that she had no idea who would even volunteer for such a task, but she was interrupted by a growl from Chewbacca, which was translated by C-3PO to mean that the pair would leave at once.\nBetween 0 ABY and 1 ABY, the planet Tureen VII came under siege by the Empire for scretly providing aid to the Rebel Alliance. When Ackbar, Mothma, and Dodonna learned of these events, Ackbar suggested that the Alliance return the favor by providing help to their people, who were starving. When Princess Leia and Lieutenant Skywalker suggested taking such action, Mothma explained that three previous attempts had been unable to penetrate the planet's blockade or its swarms of TIE fighters. Skywalker suggested that they would need something big to barrel through, but this was shot down by Mothma, who explained that the Rebel fleet could not be spared.\nSkywalker clarified, saying he didn't mean the fleet, but in fact a Star Destroyer. Organa thought that he was crazy, and Dodanna felt the plan to be preposterous, but Ackbar thought that it could work, suggesting that a crew as well as an Admiral to take command. Mothma gave them permission to proceed, and the mission would be carried out. The attempt was successful.\nAfter the battle for Jedha, Leia, Luke, Han Solo, C-3PO, R2-D2, Chewbacca and Ackbar met with Regent Dors Urtya to discuss the possibility of the Mon Cala Mercantile Fleet rebelling against the Empire and joining the Rebel navy. Urtya declined out of fear for the people of Mon Cala.\nAckbar was present on a Mon Calamari Star Cruiser when he and the rest of the fleet received a message from the dying King Lee-Char asking his people to join the Alliance before he was killed by stormtroopers. Ackbar led the fleet along with Rebel Alliance support to mutiny against the Imperial forces sent to stop them. Ackbar contacted Captain Pysk Lila of the Aurora Flare and asked if she would volunteer to crash her cruiser full of coaxium into a Star Destroyer in order for the fleet to escape, knowing that she would loss her life in the process. Lila agreed to the tactic, and Ackbar told her that he wished he could have gotten to know her more. The Aurora Flare crashed into the Star Destroyer causing a hole to form in the Imperial blockade and for the Mon Calamari cruisers to escape. Ackbar and the rest of the Mercantile Fleet fled to Mako-Ta Space Docks where they would be outfitted into warships for the Rebel Navy.\nAckbar was present at Mako-Ta Space Docks when the Rebel Alliance tried to start a party to celebrate their new fleet. But their party was cut short by the arrival of Darth Vader's Death Squadron who were secretly contacted by Queen Trios. Because the cruisers had been sabotaged by Trios, Death Squadron started to pick off each cruiser one by one. Luke Skywalker did manage to get passed the Shu-Torun codes used to shut down the cruisers, and launches the rebel starfighters. Luke uses the light trail from his ship to signal to Ackbar that the bay doors are open. Ackbar orders all his fighters to launch and spread the word. After getting the codes needed to bring all the ships online, Ackbar order the Home One to launch into hyperspace.\nShortly after, Ackbar was present when Valance offered a datacard that held the plans to a shield generator.\nAfter an attack on an Imperial Impound Yard, Skywalker offered Tula Markona and her clan if they want to go up to Home One and meet Admiral Ackbar, but Tula refused to because she was still upset that Skywalker and his team indirectly caused the deaths of her parents.\nThe team traveled to the Kaliida Nebula in the Volt Cobra and were initially worried that they were in a trap when Ackbar and Home One did not come by to pick them up. Home One eventually arrived to pick them up when Ackbar's voice was heard over the comlink, relieved to know that they had survived the assault on Mako-Ta Space Docks. Princess Leia went up to the bridge to talk with the Admiral, who was very delighted to see her. After greeting her, the Princess told Ackbar that she has several documents that would allow them to destroy Shu-Torun, the homeworld of Queen Trios. Ackbar was very reluctant and skeptical to have use a large rebel force to allow Leia to pursue her personal vendetta against the Queen of Shu-Torun. The Mon Calamari admiral asked how she planned to do this, to which Leia told him that she has a plan they would never expect.\nAfter the attack in the Cilpar system, ambitious rebel pilot Ibti Myrak was placed on comms duty by Skywalker for her actions during the attack. While Rogue Squadron went to aid in an ambush in the Valo system, Myrak stayed back with Ackbar to work on comms. But when she realized that something was not right, she sprinted off as Ackbar called to her figure out where she was going.\nBut Ackbar caught up to Myrak in the hangar bay and called her out for attempting to leave and thus disobeying Commander Skywalker's orders. Myrak tried to plead her case but the annoyed admiral was not having it and ordered her to report back to the flight deck. But the reckless pilot insulted the admiral and shoved the chief technician Garn Stewer into Ackbar, knocking him down. Myrak apologized but jumped into and x-wing and took off anyway.\nC-3PO then attempted to alert Ackbar but he ignored the droid and asked for a report from Stewer. Stewer reported that they could not track Myrack because she was in hyperspace and Ackbar ordered him to get the admiral in contact with Skywalker. But Stewer was unable to because Rogue Squadron because of the ongoing battle in the Valo system.\nAs the battle raged on, R2 tried to reach contact with Ackbar's fleet but to no avail. But after Myrak rescued Skywalker, the battle turned to the rebel's favor when the Rebel Fleet arrived, causing the Empire to retreat. Skywalker thanked Ackbar for arriving to save them, but Ackbar believed that Skywalker should thank Myrak for discovering encoded messages a spy had been sending to the Empire for months.\nAlthough Admiral Ackbar was not present at the Battle of Hoth, he did receive a call to come and assist with the evacuation. However, there was not enough time to scramble the rebel fleet. The evacuation was completed in a matter of hours, but the Alliance suffered major losses.\nAfter the battle, Ackbar implemented a new hyperspace jump schedule for the fleet: Jump coordinates would be transmitted from the Home One to all of the nearby ships in the fleet, with the coordinates then being given to other outposts and vessels. As a safeguard, Ackbar had every gunner in the fleet fire on any craft that came out of hyperspace on an incorrect reversion vector. When X-wing pilots Wedge Antilles and Wes Janson rendezvoused with the Home One, Antilles speculated that the reason for the lateness of Luke Skywalker could be because of Ackbar having high-security rebels take extra hyperspace jumps.\nAfter the Rebel Alliance managed to escape a Battle on Ab Dalis, Ackbar, Mothma, and the rest of the Eleventh Division grouped up with the Fourth and Seventh Divisions. They were rescued by the Fourth Division's Starlight Squadron and Commander Skywalker and given a new security transmission code based on the lost language of Trawak.\nIn 3 ABY, Alliance Intelligence introduced Operation Ringbreaker, a series of coordinated assaults which had the goal of shutting down the naval shipyards at the Kuat Drive Yards. Once its defenses were stretched to the tipping point, naval and infantry forces would attack. General Madine sent the Phase 1 overview of Ringbreaker, which detailed how the 61st Mobile Infantry would secure multiple targets.\nThe Operation was planned to culminate with the sabotage of the Kuat Drive Yards. However, the operation came to a halt at the Siege of Inyusu Tor when Imperial resistance was more than the rebel forces could handle. Ackbar said in 34 ABY that Operation Ringbreaker was brilliantly planned, but was brought low by undetectable circumstances. Commander Mothma said that another attempt to take Kuat would not be attempted.\nAround 4 ABY, many rebel leaders rendezvoused at the planet Zastiga. During a top clearance meeting, a hologram was shown of an incomplete Death Star. Many present, including Princess Leia, were confused, assuming that it was the Death Star from the Battle of Yavin. Ackbar then revealed that the Empire had begun construction on a second Death Star, with a larger diameter and many advanced specifications such as an advanded superlaser. The other leaders at the meeting began to discuss what the Alliance's next move would be, and how they would go about destroying it. General Airen Cracken and Ackbar explained that the flaw that had allowed the first Death Star to be destroyed at the hand of Skywalker would have been removed. He and Mon Mothma agreed that the Rebellion would have to make their attack before the battle stations completion.\nThe next day, the leaders returned to the briefing room, many of whom were exhausted. When Mothma motioned for him to begin, Ackbar once again brought up the holo of the second Death Star. He explained that the Death Star would be vulnerable as long as its main reactor was exposed. When Admiral Massa dejectedly said that the entire rebel fleet would not be enough to defeat the Imperial Fleet, Ackbar fired back, explaining that they would not be able to win the battle ship to ship, but rather by creating time for their starfighters. Ackbar also revealed that they had learned that the station was protected by an energy field generated from the surface of a nearby moon. Madine's commandos would steal an Imperial shuttle, get to the moon, and knock out the generator.\nOne admiral pointed out that it would be difficult for the fleet to assemble without the Empire noticing. Ackbar explained, as he had previously told Mon Mothma, that Sullust was the only realistic fleet staging area if the Alliance was to take advantage of the Sanctuary Pipeline, which was a closely guarded Imperial secret until rebel agents were able to discover it. The fleet would gather there, the commando team would go and bring down the shield, and the fleet would follow, traveling down the Sanctuary Pipeline. Princess Leia then offered a strategy to distract the Empire from the discovering what they were up to: Leia would lead a fake recruiting run with a supposed rendezvous point, while the real fleet gathered at Sullust. Leia's suggestion of Nien Nunb to be her pilot on the mission was supported by Ackbar. Organa assumed that since Ackbar did not object to her plan, he approved of it. Although the plan was not immediately vetoed, it did take some more consideration from Mothma.\nWhen Madine volunteered himself for the mission, Ackbar shot this down, saying that Madine was required to stay to help plan for Endor. Ackbar also mentioned that since the Rebellion had already struck Sullust during Operation Ringbreaker, it would be believable that they would do so again. He promised Mothma that after the Battle of Endor, the fleet would return to liberate Sullust. In 34 ABY, Ackbar said that this was accomplished, but months after Endor as opposed to the planned days.\nDuring Commander Iden Versio's escape from the Invincible Faith, she snuck passed a room where Ackbar was debriefing rebel personnel to join the rest of the Rebel fleet who were to join together at Sullust to launch a surprise attack on the second Death Star.\nWhen Mothma asked who Ackbar had chosen to lead the starfighter attack on the second Death Star, she suggested Luke Skywalker. Ackbar, on the recommendations of the Sullustan Nien Nunb and Ensign Deltura, suggested Lando Calrissian. In order to conivince Calrissian, Ackbar first tried appealing to his honor, but after a failure through that approach, went straight to money. Ackbar later stated in 34 ABY that he was disappointed that Calrissian did not remain in service.\nAckbar, by this point the supreme commander of the Alliance Fleet, was one of the commanders of the Battle of Endor. By this time he was already an admiral in the Rebel fleet. At the pre-mission briefing, Gial told the plan of how the Rebels would attack the Death Star. He explained that a ground team led by General Han Solo would go to the surface of the forest moon of Endor and take out the shield generator, and that a fighter squadron led by General Lando Calrissian would then enter the battle station's superstructure and take it out from the inside. He commanded the fleet from the bridge of his ship, Home One. Once the battle commenced, however, between the fleet's sensors being jammed and an Imperial fleet cutting off their escape, Ackbar realized that they had been led into a trap—the Empire was leading them to their demise. Ackbar was reluctant to continue the battle after the Rebels saw that the Death Star's superlaser was operational. However, Calrissian convinced him otherwise. Once Han Solo's squad took out the shield generator, Ackbar's fleet held off the rest of the Imperial forces while Calrissian and his fighters, along with Wedge Antilles, flew inside the Death Star to take it out. Ackbar especially told his forces to concentrate their firepower on the Executor, which was ultimately destroyed by an A-wing. Ackbar was devestated by the loss of life that took place at the battle.\nDespite the Empire's defeat at Endor, they continued to fight, launching Operation: Cinder, a contingency plan issued posthumously by the Emperor. Over three months after the Battle of Endor, the Alliance officially reorganized into a New Republic, continuing to defend against the Imperial attacks. As Admiral, Ackbar commanded the New Republic Defense Fleet in its campaign against the remnants of the Empire. In his free time, Ackbar honed his mind by practicing with his kar-shak against simulated stormtroopers. He stated in a public HoloNet address that he knew the fighting had not yet come to a close.\nAdmiral Ackbar's military campaign against the Empire was aided by a mysterious Imperial informant known as the Operator, who leaked intelligence about Imperial military movements. While Ackbar was practicing with his kar-shak, he was visited by Ensign Deltura who informed the Admiral that Captain Wedge Antilles had ceased communicating with them after his scouting mission to Raydonia. Ackbar ordered Deltura to send scouts to five nearby planets including Mustafar, Geonosis, Dermos, Akiva, and Tatooine. As a precaution, Ackbar ordered Deltura to dispatch two scouts to Akiva.\nDeltura then informed him that they had received new information from the Operator. When Ackbar expressed surprise that an Ensign was privy to classified information, Deltura reassured him that Commander Kyrsta Agate had given him clearance. Deltura dispatched two A-wing scout ships to Akiva but the ships were shot down by an Imperial Star Destroyer commanded by Admiral Rae Sloane. The Empire was hosting an emergency summit on the planet and Antilles had been captured by Imperial forces there.\nFollowing the downing of the scout ships, Admiral Ackbar corresponded with several New Republic leaders and officials via hologram including Commander Agate Captain Saff Melor, General Crix Madine, and the newly-appointed Chancellor Mon Mothma. When Agate suggested they could trust the Operator, Ackbar warned that the Battle of Endor showed that the Empire had the ability to play the long game. When Melor advocated sending in a fleet to Akiva, Mothma urged caution to avoid creating the impression that the New Republic were invaders.\nWhile Melor and Mothma debated the merits of aiding a strategically marginal planet like Akiva, Ackbar sided with the Chancellor and urged his comrades to be ready for Imperial traps. He then asked General Madine whether he could send a small strike team of New Republic Special Forces soldiers to investigate Akiva. Madine replied that was possible and Ackbar agreed to send a small scouting party to Akiva. This party was attacked by Imperial turbolasers but one member Sergeant Jom Barell survived and played a role in the subsequent rebellion on Akiva. Ackbar was informed about the attack on Barell's scouting parting by Ensign Deltura and Science officer Niriian.\nDuring the summit, Antilles managed to break free for a short duration and send an emergency transmission to Ackbar, explaining the dire situation. In response, Ackbar prepared a small fleet to attack the Imperial presence on Akiva. Ackbar assigned Commander Agate with leading the attack on Akiva. Agate's small fleet destroyed two Star Destroyers while the New Republic pilot Norra Wexley, her son Temmin and a small rebel cell engineered an uprising that overwhelmed the meager Imperial garrison and the collaborationist Satrapy of Myrra. Akiva became one of the first Outer Rim worlds to join the New Republic.\nAdmiral Ackbar's victory on Akiva was aided by the Operator, who sent intelligence about the position of the orbiting Star Destroyers. Despite finding his information useful, Ackbar did not fully trust the Operator, who later turned out to be Fleet Admiral Gallius Rax. A month later, Ackbar presented a medal to Norra Wexley for her service in rescuing Antilles and helping the New Republic to liberate Akiva from the Empire.\nOne year after the Alliance's victory at Endor, the now-Fleet Admiral Ackbar led the New Republic Starfleet's campaign against the remnants of the Empire. While Ackbar's work took him into space, the Admiral still visited the New Republic capital of Chandrila to consult with Chancellor Mon Mothma and other leaders. On one such trip, Admiral Ackbar met with the New Republic starfighter pilot Norra Wexley at Skygarden above Hanna City. He ordered her to cease her mission to rescue the missing Han Solo and to resume her hunt for Imperial commissions. Norra refused to comply with this order and resigned her commission in the New Republic Navy. She, her son Temmin, the B1-series battle droid Mister Bones, the former Imperial loyalty officer Sinjir Rath Velus, the Zabrak bounty hunter Jas Emari, and the New Republic soldier Jom Barell then embarked on a quest to find Solo.\nDuring a later meeting with Chancellor Mothma and her advisers, Ackbar opined that the New Republic was not doing enough to win former Imperial systems to the New Republic. Mothma concurred and agreed to embark on a campaign to entice prospective members by giving them a place in the reconstituted Galactic Senate. Shortly later, Princess Leia entered the room and argued with Chancellor Mothma about not enough being done to aid the enslaved Wookiees of the planet Kashyyyk. Following a brief argument, a frustrated Leia stormed out of the meeting despite Ackbar's efforts to call out to her.\nLater, Admiral Ackbar commanded a successful campaign to capture the planet Kuat and the strategically important Kuat Drive Yards. The sector governor Moff Pollus Maksim and the guild head of Kuat Drive Yards capitulated. During the battle, Ackbar's forces lost fewer ships than their Imperial opponents. The loss of Kuat dealt a serious blow to the Galactic Empire.\nFollowing the battle, Princess Leia contacted Admiral Ackbar by hologram to congratulate him for his role in securing the New Republic's victory. Shortly later, Chancellor Mon Mothma interrupted the conversation to inform her comrades that she had received communication from the Operator, who wanted to meet with the New Republic leadership. Ackbar ordered his comm officer Toktar to open the Old Alliance frequency Zeta Zeta Nine. The guest turned out to be Grand Admiral Sloane, the public face of the Galactic Empire. Despite Sloane's claims that she was the Operator, Ackbar did not believe her.\nWhen Sloane addressed Ackbar as Grand Admiral, the Mon Calamari responded that Grand Admiral was an Imperial ranking and accused her of seizing the title for herself. Ackbar's colleague Commodore Agate soon joined the holo-conversation and accused Sloane of deceiving them. After exchanging some barbs, the New Republic commanders and Grand Admiral Sloane settled down to business. When Sloane revealed that she was interested in initiating peace talks with the New Republic, Ackbar curled his chin tendrils to express skepticism. Nevertheless, he acceded to Chancellor Mothma's decision to raise the matter of the peace talks with the Galactic Senate.\nIn reality, the peace talks were a ruse for the Empire to stage an attack on Chandrila. Rax who had manipulated Grand Admiral Sloane into approaching the New Republic for peace talks as part of his plot to use the liberated prisoners from Ashmead's Lock to assassinate the New Republic leadership. For this plot, Rax had inserted each of the prisoners with an inorganic bio-chip which allowed him to transmit signals into their brains. This turned the former prisoners into unwilling assassins.\nLater, Admiral Ackbar and other New Republic officials greeted the liberated prisoners from Ashmead's Lock when they arrived at Hanna City Spaceport. After Han Solo and Chewbacca managed to stage a Wookiee uprising on Kashyyyk, Admiral Ackbar traveled on his ship Home One to support Princess Leia and Captain Wedge Antilles' Phantom Squadron in their attack on the orbiting Imperial Star Destroyers. After Solo and Chewbacca hijacked the Dominion and destroyed the Star Destroyer Vitiator, the third Star Destroyer Neutralizer surrendered to Admiral Ackbar. Despite the liberation of Kashyyyk, the New Republic forces soon received news of the attack on Chandrila.\nFollowing the events on Chandrila, Rax took control of the Imperial fleets and ordered them to assemble above the planet Jakku for a showdown with the New Republic. Several months later, Temmin and Rath Velus discovered that the Empire had relocated to Jakku. They informed Chancellor Mothma and Princess Leia but the information was leaked to the press by Chancellor Mothma's rival Senator Tolwar Wartol. After Wartol publicly attacked Mothma's leadership, Admiral Ackbar reassured Chancellor Mothma that she had made the right decision to withhold the information since she had only obtained it less than a standard day. After Mon Mothma indicated she would issue a statement to the press, Admiral Ackbar added that he would send a scout ship and probe droids to Jakku to investigate.\nAdmiral Ackbar dispatched Ensign Deltura on the scout ship Oculus and several probe droids to investigate. After the scouting team confirmed that most of the Imperial remnants had relocated to Jakku, Chancellor Mothma convened an emergency session of the Galactic Senate and urged the Senate to support her resolution to send military forces to the planet. However, the resolution failed by five votes. Following the vote, Admiral Ackbar visited Chancellor Mothma to inform her that the vote had failed. He remarked that this meant that the fleet would not depart for Jakku and that the Empire would remain there.\nAfter Rath Velus managed to convince the five senators to change their votes, the New Republic was able to send its military forces to Jakku. Prior to the battle, Admiral Ackbar managed to convince Commodore Kyrsta Agate to return to her command board the Starhawk-class battleship Concord. Agate had been disfigured during the Attack on Chandrila and had been despondent. He also visited Agate aboard her flagship and praised her as one of his best and brightest officers. When Agate remarked that some of the light had gone out of her, Ackbar complimented her for recognizing the burden of war and for not giving in to anger.\nWhen Agate expressed doubts about her ability to captain the Concord, Ackbar reassured her that none of them were truly ready for what. He added that the best they could was to meet it with forward faces and clear hearts. Ackbar also recognized that the Empire was aware of their presence and added that he would be ready for a full-scale fleet battle. When Agate opined that Jakku could be a ruse, Ackbar reassured her that they would be ready. When Agate asked if they were going to win, Ackbar responded that it would be an honor to fight alongside regardless of whether it was their final battle or the first of many to come. The two then parted company and assumed their battle positions.\nDuring the Battle of Jakku, Admiral Ackbar commanded the New Republic fleet. Despite outnumbering the Empire, the New Republic fleet was unable to break through the Imperial defensive lines. The Imperial Star Destroyers had formed a defensive perimeter around the Super Star Destroyer Ravager, the Imperial flagship. During the battle, the Star Destroyers would periodically open flank to allow the Ravager to fire its turbolasers and torpedoes at the New Republic fleet. As a result, several New Republic warships and starfighters were destroyed.\nWhile commanding the space battle, Ackbar also liaised with General Tyben, who was commanding the ground assault via hologram from Chandrila. When Tyben opined that he should be on Jakku with Lieutenant General Brockway, Ackbar countered that they needed to maintain reserve forces on Chandrila and the new capital Nakadia in case Jakku turned out to be a ruse. Ackbar then witnessed the Star Destroyer Punishment break formation with the Imperial fleet and ram the Starhawk Amity, destroying both ships. Realizing that Agate's ship Concord lay in the gap, Ackbar opened the channel to contact Commodore Agate.\nBelieving they were in danger, Admiral Ackbar ordered the Commodore and her crew to abandon ship. Agate ordered her crew to comply but stayed behind. She realized that the Punishment's destruction had created a gap that would allow her ship to attack the Ravager. As the Concord exchanged fire with the Ravager, Ackbar ordered her to abandon her ship. However, Agate convinced Ackbar to send starfighters and CR90 corvettes to attack the Super Star Destroyer's exposed flank engines. Despite some arguing, Ackbar finally accepted Agate's sacrifice and prayed that the Force would be with them all.\nThe Concord was crippled by the Ravager and plummeted towards Jakku's surface. However, Agate then activated her ship's powerful tractor beam and proceeded to drag the Super Star Destroyer down with her. As the two ships descended into Jakku's orbit, Ackbar grabbed the intercom and warned all New Republic soldiers and pilots that the Ravager had been downed and to take cover and beware of falling debris. While Ackbar's crew cheered behind him, the Admiral did not cheer but prayed for the Force to protect those below and to accept Agate as one of its own.\nThe downing of the Ravager turned the tide of the Battle of Jakku in the New Republic's favor. Meanwhile, Grand Admiral Sloane joined forces with her New Republic adversaries Brentin Lore Wexley and Norra Wexley to stop Gallius Rax, the Counselor to the Empire, from detonating Jakku and the orbiting Imperial and New Republic fleets. Following the battle, the New Republic and Galactic Empire signed the Galactic Concordance which ended the Galactic Civil War. The Galactic Concordance demilitarized and imposed harsh sanctions on the remnants of the Empire. With the war's end, the New Republic turned its attention to restructuring the galactic order. After the Empire's final defeat, Ackbar retired to his homeworld of Mon Cala. At some point, Ackbar fathered a son, Aftab.\nAckbar realized that the T-70 X-wing starfighter was overdue for technical and mechanical upgrades having been in service of the New Republic Defense Fleet for more than two decades. He proposed that the New Republic Navy should commission the Incom-FreiTek Corporation to design a prototype for a new model. The result was the next generation of X-wing, the T-85 X-wing starfighter.\nFollowing the revelations of Organa's parentage as the birth daughter of Darth Vader, Ackbar along with several other rebel veterans sent messages of support to the embattled New Republic senator. He and several rebel veterans and New Republic personnel later attended a meeting on Hosnian Prime where Leia formally established the Resistance, a paramilitary group dedicated to protecting the New Republic.\nAfter Ackbar had already been with the Resistance for a brief time, his son Aftab begged him to come back into retirement.\nAt some point after his recruitment, Ackbar was captured by the First Order and held hostage on the Subjugator, a Resurgent-class Star Destroyer. Afraid that the First Order would execute him, the Resistance assembled a team led by Captain Hoff to locate Ackbar. Hoff's team eventually captured a First Order droid named O-MR1, who they believed knew the location of Ackbar. On their way back to the Resistance base, the team's ship crashed on Taul, with the only survivors being a group of droids, including O-MR1, led by C-3PO. The droids began following a signal they received from a First Order vessel, but on their way they were attacked by spice spiders and later by can-cell, resulting in the destruction of all of the droids, except C-3PO and O-MR1. The two droids found the vessel, but before they could contact the Resistance, it began raining acid. They took cover under another ship's wing, but knew that if they didn't contact help soon, the control panel would melt. O-MR1, who now saw C-3PO as his friend, told 3PO the location of Ackbar, before sacrificing himself to contact Poe Dameron for help. Some time after O-MR1 had melted, Dameron arrived to pick up C-3PO. After his rescue, Ackbar was with Vice Admiral Amilyn Holdo when Rose Tico and her older sister Paige joined the Resistance.\nIn 34 ABY, the The Rebel Files were recovered on the planet Durkteel. The files were given to General Leia and the Resistance. Many of the Resistance leaders wrote notes in the files. Ackbar wrote that he wondered if the Home One could be Meeta Cors' MC80 Star Cruiser the Nautilian in combat. Fellow Resistance Admiral, Ushos O. Statura wrote that Ackbar was correct.\nAfter Ackbar's rescue from the First Order he sent J-Squadron on a scavenging mission to Vodran as punishment for an incident on D'Qar that endangered starfighters returning to the Resistance Base on D'Qar.\nAfter the Battle of Takodana, Ackbar was asked to question Finn on everything he knew about Starkiller Base. The Resistance then began to plan their attack on the base after that they would be the next target. During the planning session, Ackbar inquired how a weapon the size of Starkiller Base could even be powered. Finn explained that it drained its power from a nearby star, and Admiral Statura stated that it would have to have a thermal oscillator to contain such power. This was confirmed by Finn, a former employee of the base. Ackbar also pointed out that Starkiller Base would be fitted with shields that no Resistance ship could penetrate. Han Solo, whom Ackbar had worked with during the Galactic Civil War, offered to diable the shields, via a plan that he knew General Organa wouldn't like.\nDuring the battle he told the rest of the Resistance command that the oscillator was damaged but still functional. He was then interrupted by a worried Resistance officer who said the base will fire in two minutes. Dameron had managed to destroy Starkiller Base before it could fire on the Resistance Base. He was present when R2-D2 and BB-8 revealed the location of Master Skywalker, whom Ackbar also had been acquainted with. Before Rey left to go train with Skywalker, she sat down to talk with Leia, during which Ackbar was behind them deliberating with other Resistance members at a holotable. Following the victory at Starkiller Base, Ackbar attended the funeral of Han Solo, who died at Starkiller at the hands of Kylo Ren, his and Leia's son.\nFollowing the Battle of Starkiller Base, Ackbar aided the rest of the Resistance in evacuating their base. When the First Order caught the Resistance during their evacuation, Admiral Ackbar confirmed to the rest of the Resistance crew onboard the MC85 Star Cruiser, the Raddus that the First Order had a flotilla of ships. He also stated that the First Order dreadnought had more firepower than a dozen destroyers and was designed for large-scale planetary assault. The admiral felt that they had no time left to spare and must jump to hyperspace now, but General Leia Organa insisted they buy as much time for the remaining Resistance forces to evacuate as they can. After destroying the dreadnought, he commanded the fleet, and ordered it to jump to hyperspace and escape the First Order. However, unknown to the Resistance, the First Order had developed technology that allowed them to track ships through hyperspace. Ackbar ordered the ship be turned around and to concentrate power on the rear shields. The First Order fleet pursued the Resistance and initiated an attack on the bridge of the Raddus. Kylo Ren and his two other wingmates destroyed the hangar of the Raddus and made their way to the primary bridge of the MC85 Star Cruiser, where the majority of Resistance command was present. Though Ren could not bring himself to fire on the bridge after sensing his mother's presence there, his wingmates, Poldin LeHuse and a second TIE fighter had no such qualms and fired missiles upon the primary bridge.\nAs one of Ackbar's Mon Calamari aides notified him of the inbound torpedoes, the gruff admiral looked to the crew of the bridge, embracing the fact that his fate had been sealed and there was no chance for escape, and declared his respect for them in the face of death before the missiles struck the adjacent viewport. In a huge explosion, Ackbar, the most esteemed military commander of his generation, was gone. Only Organa survived the ordeal, calling on the Force to pull herself back to the bridge's exposed corridor to use as an airlock. Ackbar's death was later confirmed by Commander Larma D'Acy and that Vice Admiral Holdo would take command as leader of the Resistance while Leia recovered from her vacuum exposure.\nAfter the Battle of Crait, Organa, Chewbacca, C-3PO, Rose Tico, and Rey traveled to Mon Cala in an attempt to gather potential allies for the Resistance. Once they arrived at Dac City, Organa met with Aftab, and she expressed her condolences for Gial's death, assuring Aftab that she was with Gial when he died and she wished she could have brought his corpse with her. Aftab replied that while his father's remains were lost in the space, his soul was with them. They paid their respects at the Mourning Shrines, where a statue of Ackbar was located. Gial's death came as a deep loss to Aftab, who greatly admired his father. Aftab had implored his father to return to his retirement, and after his staying with the Resistance movement until the very end, Aftab had to live up to that legacy.\nWhen Temmin and Karé Kun informed the retired Wedge Antilles and Norra Wexley about the Resistance losses since the Battle of Crait, Antilles couldn't accept that Ackbar was gone after surviving the Battles of Endor and Jakku, having come to believe that the Mon Calamari admiral was going to live forever. Likewise, Leia still remembered Ackbar not only as a leader but as a friend while she lamented the fact that he was gone, having known him for most of her life, which led Rey to express her condolences even though she never met him.\nGial Ackbar was a seasoned and accomplished military commander who served with the Mon Calamari Guard, the Rebel Alliance, and its successors the New Republic and Resistance. Ackbar was a mentor to the young Mon Calamari Prince Lee-Char and strove to protect the young prince's life. He believed that Lee-Char was the right claimant to the Mon Cala throne who had the interests of both the Mon Calamari and Quarren in mind. Ackbar taught the young Prince how to lead his people in combat. Despite his valor, Ackbar was also pragmatic enough to order a retreat when the Quarren and their Separatist allies unleashed cyborg Hydroids-Medusa.\nAfter being driven into hiding, Ackbar advised Lee-Char and his Jedi and Republic allies to split up to avoid capture. Despite his distrust of the Quarren for their connivance with the Separatists, Ackbar acceded to Lee-Char's plan to reunite the Mon Calamari and Quarren against the Separatist leader Karkarodon. Ackbar worked with his former Quarren adversary Nossor Ri to distribute weapons to the Mon Calamari and Republic captives and expel the Separatist invaders from Mon Cala.\nBy the time of the Galactic Civil War, Ackbar had become an Admiral in the Alliance Navy. He led the successful effort to evacuate the rebel base on Yavin IV following the Battle of Yavin. Ackbar was also a skilled tactician who devised the successful attack on the second Death Star using plans that had been stolen by Bothan spies. As a commander, Ackbar also knew how to delegate duties and assigned Han Solo with leading the strike team to deactivate the shield generator on Endor. During the Battle of Endor, Ackbar played an important role in saving many Alliance ships by sending them to attack the Imperial fleet in order to stop the second Death Star from firing on them.\nFollowing the events on Endor, Admiral Ackbar commanded a string of New Republic victories which saw the taking of numerous worlds including Akiva, Kuat, and Kashyyyk. His skills and military victories won him the admiration of several of his Imperial foes including Grand Admiral Rae Sloane. While Ackbar found the Imperial informant Operator's information useful, he did not trust the mysterious leaker. Despite his martial accomplishments, Ackbar still believed in the Force and often included it in his greetings.\nAdmiral Ackbar was suspicious of Grand Admiral Sloane's peace offer. His suspicions were confirmed when the peace offer was used by Fleet Admiral Gallius Rax to launch a sneak attack on the New Republic. Ackbar encouraged Chancellor Mothma during her difficult times and reassured her that she had been wise not to immediately disclose information regarding Imperial forces on Jakku to the public. Ackbar also mentored Commodore Agate and encouraged her not to give up her command despite being disfigured during the Liberation Day attacks. He also cared for his crew but respected Agate's decision to sacrifice her life during the Battle of Jakku.\nIn the years after the Galactic Civil War, Ackbar maintained a deep respect for his former comrade Senator Leia Organa. He along with Mon Mothma, Han Solo, Chewbacca, Nien Nunb, and C-3PO remained loyal to Leia despite revelations that she was the daughter of Darth Vader. Ackbar was stirred by Organa's words and also shared her view that the New Republic lacked the strength to safeguard the galaxy and joined the Resistance. Resistance members such as Poe Dameron were honored to serve by him after hearing tales of his legendary military career.\nAt the time of Ackbar's death aboard the bridge of the Resistance's main cruiser, upon realizing that he would not survive the missile strike that would take his life, he demonstrated his courage, devotion to their rebellion and respect for his comrades as he took the opportunity to acknowledge them in his final words. Ackbar's loss was felt by many, including Leia, who regretted not being able to recover his corpse for a proper burial on his Mon Cala, remembering Ackbar as a hero until the very end.\nAckbar had salmon skin and yellow-orange eyes. He stood 1.8 meters tall, or 5 feet and eleven inches.\nAftab Ackbar was the son of Admiral Ackbar, who the admiral fathered at some point during his retirement. Aftab only saw his father once after his spawning where he begged him to return to retirement after he joined the Resistance. Although he never saw his father after that he felt that he knew him through his service to the galaxy during the Galactic Civil War. Aftab felt a great personal loss after the death of his father and took it upon himself to carry on his legacy.\nLeia Organa worked alongside Ackbar throughout the Galactic Civil War, with the New Republic and until his death with the Resistance. She was a friend of the Mon Calamari. Leia helped convince the Mon Calamari people to mutiny against the Galactic Empire and Ackbar helped Leia during the evacuation of the Yavin 4 base. After his death Leia visited the Mourning Shrines with Aftab to pay her respects to the late admiral, only wishing that she could have brought the body home.\nAfter ascending to the throne on Mon Cala, Prince Lee-Char was put in the protection of Captain Gial Ackbar who was captain of the Mon Cal Knights at the time. Ackbar was willing to break the tradition of the monarch of Mon Cala leading his troops into battle in order to protect the prince. When the Mon Calamari forces were forced to retreat Ackbar led the prince to the caves for protection. Prince Lee-Char also looked up to Ackbar and asked him for guidance. When Ackbar was captured by the Separatist, Lee-Char broke into the prison in order to ask for advice from the captain and to tell him of the plan.\nA few years later, Ackbar was promoted to Chief of Security for King Lee-Char.\nThough Admiral Ackbar was an accomplished military commander, he also kept his mind sharp and his body flexible by regularly practicing kar-shak against simulated stormtroopers. He was not Force-sensitive, but did possess above-average intelligence, diplomacy, strength, speed, and fighting abilities. Of those skills, his strongest was intelligence.\nDuring the Clone Wars, when the Mon Calamari fought against the Separatist-aligned Quarren, Ackbar used a baton in combat.\nDuring the Galactic Civil War, Admiral Ackbar wore a traditional naval Mon Calamari fleet officer uniform which had a utility belt. It was made of a fabric that retained moisture. The feature helped prevent his skin from drying out, which was a concern for a member of a species more used to being in water than a sterile starship. He wore such a uniform on several occasions, including during the Battle of Endor. Around the time prior to the Battle of Jakku, Ackbar practiced fighting with a kar-shak in case he ever needed to use it. Ackbar would also arm himself with a blaster pistol.\nAdmiral Ackbar was created for the 1983 film Star Wars: Episode VI Return of the Jedi, the final installment of the Star Wars original trilogy. Ackbar's first appearance, however, was in Archie Goodwin's comic strip Revenge of the Jedi, published in the Los Angeles Times Syndicate from November 1982 to January 1983. In the second draft of the script for Return of the Jedi, the Ackbar was slate to be a non-human with pale blue skin. The article \"The Ultimate Return of the Jedi Insider's Guide,\" published in Star Wars Insider 67, noted that as a connection with Grand Admiral Thrawn. During pre-production of the film, George Lucas allowed the Return of the Jedi's director, Richard Marquand to pick from a selected 50 drawings for the look of aliens to play as Ackbar. Marquand went with a drawing by Nilo Rodis-Jamero which he called, \"Calamari man.\" The drawing had no backstory or personality to it. In Return of the Jedi, Ackbar was played by puppeteer Tim Rose and voiced by voice actor Erik Bauersfeld who also voiced Bib Fortuna in the film. In the Star Wars: The Clone Wars television series, Ackbar was voiced by Artt Butler. Both Rose and Bauersfeld reprised Ackbar in the 2015 film Star Wars: Episode VII The Force Awakens, the first installment of the sequel trilogy, being Bauersfeld's final film role before his death in 2016. In the 2017 sequel Star Wars: Episode VIII The Last Jedi, Rose portrayed the character once more, while voice actor Tom Kane voiced Ackbar. Kane had portrayed Ackbar in previous Star Wars media, such as LEGO Star Wars: Droid Tales.\nThe Gran, Ree-Yees was originally set to play the role of Admiral Ackbar, but when reviewing the sculpts of the creature, the filmmakers decided to go with the Mon Calamari admiral instead.\nIn the Return of the Jedi, Admiral Ackbar was realized as a combination slip-on mask and half-body puppet. All close-up shots involving dialogue used an extraordinarily detailed puppet controlled by Rose, who puppeteered Salacious B. Crumb too. From Jim Henson, Rose was loaned to Lucasfilm Ltd. during Episode VI's production and was assigned to puppeteer Crumb and Sy Snootles. Rose asked visual effects supervisor Phil Tippett, however, if he could also perform Ackbar. Rose was familiar with the controls and had already designed much of the puppet by that point, but the only thing that he knew about Ackbar was that he was a background character who was to appear later after the appearance of both Snootles and Crumb at Jabba's Palace, wearing Ackbar's mask during scenes that didn't require a puppet too.\nWhile the character's surname was created by George Lucas during the production of Jedi after seeing the mask in the creature shop, Ackbar's first name wasn't coined until the release of the Star Wars Legends reference book The Essential Guide to Warfare, written by both Jason Fry and Paul R. Urquhart and released on April 3, 2012, which established Ackbar's first name as \"Gial.\" The name was upheld in canon with the release of the reference book Star Wars: Absolutely Everything You Need to Know, published on September 4, 2015.\nDuring development of the 2005 film Star Wars: Episode III Revenge of the Sith, the final installment of the prequel trilogy, Lucas was so impressed with the animatronic capabilities of the Mon Calamari Meena Tills that he briefly considered replacing Ackbar's footage from Episode VI with Tills's mask, as Lucas always felt that the result of Ackber's puppetry technology was a compromise in spite of achieving the latest technology available in 1983. Nevertheless, the original footage was ultimately left unaltered. Ackbar was present in the original script for the 2016 Star Wars Anthology film Rogue One: A Star Wars Story, appearing to lead the rebel fleet during the Battle of Scarif in the film's climax, but after J.J. Abrams featured Ackbar in Episode VII, the part of Admiral Raddus was created to replace Ackbar as the crew believed that Ackbar shouldn't appear in two films released together so closely.\nAdmiral Ackbar's line \"It's a trap!\" in Return of the Jedi has developed into an Internet meme, viral and popular at websites like 4chan, LUELinks.net, SomethingAwful, and You're the Man Now Dog. The phrase was even used in a sketch of the first Robot Chicken: Star Wars special of the satirical TV stop-motion show Robot Chicken. Tim Rose has even signed autographs with the trademark line to his fans. After completing his scenes for The Last Jedi, the crew asked Rose to say \"It's a wrap!\"\nAckbar has appeared in several forms of non-canon media:\nAdmiral Ackbar made several appearances during LEGO Star Wars: The Freemaker Adventures, primarily on the Home One while the Freemakers were stationed there. In the episode Return of the Kyber Saber, Ackbar appears in a hologram asking for the Empire's 27th \"Most Wanted\" fugitive, Rowan Freemaker. Ackbar then recruits the Freemakers into the Rebel Alliance with a job offer. In the episode \"Home One,\" Ackbar met with the Freemaker family in person for the first time. He then sends them on a mission to find a Type A vector coil promising them a permanent job with the Alliance if they succeed. During the episode \"Thrown Into Battle,\" Admiral Ackbar sounded an alarm over the comms, alerting the rebels that the Empire had found the Fleet. Ackbar ordered the Rebel starfighters to scramble. Ackbar awarded a medal to Roger for his services during the battle.\nIn \"Zander Freemaker, Superstar Pilot Guy!,\" Zander Freemaker tried to convince Admiral Ackbar to let him fly a fighter. Ackbar told him to ask Lieutenant Colvett Valeria. Ackbar then alerted the fleet of an Imperial attack. When the battle was finished, Ackbar and his crew looked on in horror as Zander's starfighter was destroyed. In the episode \"Beware, the Gamorrean Flu!,\" The Freemaker family pay the admiral a visit. Ackbar tells them that two rebel agents are trapped behind an Imperial blockade. The Freemakers volunteer for the mission. After the mission, Lando Calrissian, one of the rebel agents trapped, thanked Ackbar for recruiting them.\nAt the beginning of the episode \"Trouble on Tibalt,\" Ackbar ordered the rebel personnel on the Home One to report to their battle stations, as the Empire had located the fleet. The rebel starfighters managed to punch a hole in the Imperial offensive, and Ackbar ordered the Rebel Fleet to escape to hyperspace. During a rebel briefing in the episode \"The Tower of Alistan Nor,\" Kordi Freemaker proposed five minute showers in order to conserve water. Everyone was surprised, and turned to look at Ackbar, a water planet native, who questioned why everyone was looking at him.\nIn the episode \"The Storms of Taul,\" Ackbar received a transmission from Major Bren Derlin which stated that he was heading to the junk fields of the planet Taul. Ackbar sent the Freemakers to rescue him. After their successful rescue, Ackbar congratulated them via hologram. Ackbar made an appearance at the end of the episode \"Return to the Wheel\" via a hologram congratulating them on their mission, but he got worried when they told him that Darth Vader was looking for kyber crystals. Ackbar then told his fellow Rebel leaders to summon the Bothans to find out if the Empire was building a second Death Star. In the episode \"Flight of the Arrowhead\" Ackbar contacted Quarrie during a battle, asking if the Arrowhead was ready. However, Quarrie's answer did not reassure him and Ackbar was left in disbelief. The Arrowhead was eventually fixed and saved the Rebel fleet; Ackbar gave the Freemaker family medals and promotions for their bravery in battle.\nDuring their celebration after defeating the Empire on Kashyyyk in the episode \"A Perilous Rescue,\" Ackbar and the other Rebel leaders congratulated the Freemakers on their hard earned victory. Later on aboard the Home One Admiral Ackbar briefs the rebels about their upcoming attack on Dubrillion. He also agreed with Kordi's plan and had her brief Lieutenant Valeria, calling Kordi \"commander\" for the first time. In the episode Escape from Coruscant Zander and Kordi come running to the rebel leaders in order to tell them what had happen to Rowen, but Ackbar has trouble hearing them before Roger clarifies for him. He also denied them permission to rescue him. He is interrupted by a rebel officer who tells him that the Empire is building a second Death Star. He instantly ran off saying they have to stop it. Later on, Ackbar watched from the command bridge as the Freemakers defied his orders and went to go rescue Rowen.\nRight after the Battle of Endor, R2-D2 and C-3PO planned to go with Admiral Ackbar to liberate the lost battle droids of Mandalore with Admiral Ackbar in the episode \"Exit from Endor.\"After the story finished a mysterious figure kidnapped R2 and took off in Ackbar's Daisy Mae. This prompts 3PO and Ackbar to take another ship to find the kidnapper. In the episode Crisis on Coruscant, Ackbar and C-3PO traveled to Coruscant to find RD-D2 and the Daisy Mae. Ackbar located his ship by smelling it underneath a pile of paper. After 3PO finished his story, Ackbar had to deal with a tow truck towing the Daisy Mae away while 3PO continues his journey to find R2.\nIn the episode \"Gambit on Geonosis,\" Ackbar appeared during C-3PO's story of how the Rebel Alliance blew up the second Death Star. Ackbar gave a briefing on how to destroy the space station to the Rebels. In Lando Calrissian's story, Ackbar celebrated the destruction of the second Death Star by crossing out both Death Star's created by the Empire on a chalkboard.\nIn the LEGO Star Wars: The Resistance Rises episode \"Poe to the Rescue,\" Admiral Ackbar is held captive by the First Order. Poe Dameron and C-3PO snuck aboard the Subjugator to rescue him. After their escape they went to an asteroid field where Ackbar's ship the Daisy Mae was hiding.\nDuring the Life Day celebration aboard the Millennium Falcon in The LEGO Star Wars Holiday Special, Ackbar gave Lando Calrissian a present for Life Day. Calrissian, hoping that it was a cape, opened the gift, to which Ackbar exclaimed, \"It's a wrap!\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gial_Ackbar",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Gial",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars_(2015)_4",
  "/wiki/Star_Wars_Book_X:_Mutiny_at_Mon_Cala",
  "/wiki/Star_Wars_Book_XI:_Hope_Dies",
  "/wiki/Star_Wars_(2015)_61",
  "/wiki/Two_Sides_to_Every_Sortie",
  "/wiki/Star_Wars_(2020)_15",
  "/wiki/Star_Wars_(2020)_19",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Star_Wars_(2020)_23",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/Star_Wars_(2020)_27",
  "/wiki/Star_Wars_(2020)_28",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Aftermath_(novel)",
  "/wiki/Shattered_Empire_4",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Victory%27s_Price",
  "/wiki/Bloodline_(novel)",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/The_Last_Jedi_Adaptation_1",
  "/wiki/Poe_Dameron_28",
  "/wiki/Star_Wars:_Allegiance",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_89",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Rebel_Starfighters_Owners%27_Workshop_Manual",
  "/wiki/Star_Wars:_Join_the_Resistance",
  "/wiki/Databank_(website)",
  "/wiki/Mon_Cala",
  "/wiki/52_BBY",
  "/wiki/34_ABY",
  "/wiki/Raddus_(MC85_Star_Cruiser)",
  "/wiki/Oetchi_system",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Mon_Calamari_monarchy",
  "/wiki/Mon_Calamari_Guard",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Alliance_High_Command",
  "/wiki/New_Republic",
  "/wiki/New_Republic_High_Command",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Resistance",
  "/wiki/Resistance_High_Command",
  "/wiki/Fleet_Command_(Resistance)",
  "/wiki/File:Force_be_with_us.ogg",
  "/wiki/Soldier",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Civil_War",
  "/wiki/Cold_War",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Standard_year",
  "/wiki/Planet",
  "/wiki/Captain",
  "/wiki/Battle_of_Mon_Cala",
  "/wiki/Prince",
  "/wiki/Lee-Char",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Commanding_officer",
  "/wiki/Human",
  "/wiki/MC80_Star_Cruiser",
  "/wiki/Home_One",
  "/wiki/Supreme_fleet_commander",
  "/wiki/Battle_of_Endor",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Death",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Endor",
  "/wiki/Fleet_Admiral",
  "/wiki/Battle_of_Jakku",
  "/wiki/Jakku",
  "/wiki/Unknown_Regions",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Eye",
  "/wiki/General",
  "/wiki/Admiral",
  "/wiki/Resistance_base",
  "/wiki/D%27Qar",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Superweapon",
  "/wiki/Starkiller_Base",
  "/wiki/Flagship",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/TIE/sf_space_superiority_fighter",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Hyperspace",
  "/wiki/Ocean",
  "/wiki/Supreme_Chancellor",
  "/wiki/Advisor",
  "/wiki/King",
  "/wiki/Yos_Kolina",
  "/wiki/Riff_Tamson",
  "/wiki/Quarren_Isolation_League",
  "/wiki/Chief",
  "/wiki/Nossor_Ri",
  "/wiki/Mon_Cala_city",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Karkarodon",
  "/wiki/Jedi_High_Council",
  "/wiki/Jedi_Master",
  "/wiki/Yoda",
  "/wiki/Consular-class_cruiser_(Charger_c70_retrofit)",
  "/wiki/Clone_SCUBA_trooper",
  "/wiki/Kit_Fisto",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Galactic_Senate",
  "/wiki/Meena_Tills",
  "/wiki/AQ-series_battle_droid",
  "/wiki/Homeworld",
  "/wiki/Blaster_spear",
  "/wiki/Transport",
  "/wiki/Cyborg",
  "/wiki/Hydroid_Medusa",
  "/wiki/Jellyfish",
  "/wiki/Clone_trooper",
  "/wiki/Signal_jammer",
  "/wiki/Coruscant",
  "/wiki/Capital",
  "/wiki/One_Man_Submersible_Devilfish",
  "/wiki/Mon_Cala_central_planetary_scanner_mast",
  "/wiki/The_Force",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Gungan_Grand_Army",
  "/wiki/Gungan",
  "/wiki/Booma",
  "/wiki/Atlatl",
  "/wiki/Plasma",
  "/wiki/Trident-class_assault_ship",
  "/wiki/Gunship",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Prisoner",
  "/wiki/Coronation_of_Lee-Char",
  "/wiki/18_BBY",
  "/wiki/Commander",
  "/wiki/Chief_of_Security",
  "/wiki/Imperial_Era",
  "/wiki/Jedi",
  "/wiki/Ferren_Barr",
  "/wiki/Emperor",
  "/wiki/Darth",
  "/wiki/Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Sovereign",
  "/wiki/Dac_City",
  "/wiki/Ambassador",
  "/wiki/Telvar",
  "/wiki/Inquisitorius",
  "/wiki/Purge_Trooper",
  "/wiki/Ninth_Sister",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Major",
  "/wiki/Rantu",
  "/wiki/Battle_of_Dac_City",
  "/wiki/Raddus",
  "/wiki/Unidentified_Mon_Cala_creature",
  "/wiki/Colonel",
  "/wiki/Bergon",
  "/wiki/Unidentified_Mon_Calamari_aquatic_vehicle",
  "/wiki/Attack_on_Bergon%27s_sky-base",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Star_Cruiser",
  "/wiki/Slavery",
  "/wiki/The_Disaster",
  "/wiki/Gial_Ackbar%27s_fleet",
  "/wiki/Distress_signal",
  "/wiki/Alderaanian_refugee_convoy",
  "/wiki/Battle_at_Fostar_Haven",
  "/wiki/Echo_Squadron",
  "/wiki/MC80_Liberty_Type_Heavy_Star_Cruiser",
  "/wiki/Aurora_(MC80_Star_Cruiser)",
  "/wiki/Lindon_Javes",
  "/wiki/Battle_of_Yavin",
  "/wiki/Anj_Zavor",
  "/wiki/Battle_of_Scarif",
  "/wiki/Jan_Dodonna",
  "/wiki/0_ABY",
  "/wiki/Luke_Skywalker",
  "/wiki/R2-D2",
  "/wiki/Mission_to_Rodia_(Luke_Skywalker)",
  "/wiki/Rodia",
  "/wiki/Smuggler",
  "/wiki/Chekkoo_clan",
  "/wiki/Redemption",
  "/wiki/Llanic_system",
  "/wiki/Mission_on_Denon",
  "/wiki/Cryptologist",
  "/wiki/Drusil_Bephorin",
  "/wiki/Drusil_Bephorin%27s_husband",
  "/wiki/Omereth",
  "/wiki/Hutt_Space",
  "/wiki/Pilot",
  "/wiki/Sakhet%27s_son",
  "/wiki/Givin",
  "/wiki/Desert_Jewel",
  "/wiki/Nakari_Kelen",
  "/wiki/Fayet_Kelen",
  "/wiki/Mission_to_Fex",
  "/wiki/Fex",
  "/wiki/Moon",
  "/wiki/Sha_Qarot",
  "/wiki/Pantora_system",
  "/wiki/Promise",
  "/wiki/Sakhet",
  "/wiki/Sakhet%27s_Noodles",
  "/wiki/Denon",
  "/wiki/Restaurant",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Corellian_buckwheat_noodles",
  "/wiki/Rancor_sauce",
  "/wiki/Bombing_of_an_Imperial_supply_base",
  "/wiki/Imdaar",
  "/wiki/Bombing_of_the_Kuat_shipyards",
  "/wiki/Kuat",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Shyriiwook",
  "/wiki/Rescue_of_Luke_Skywalker",
  "/wiki/1_ABY",
  "/wiki/Tureen_VII",
  "/wiki/Siege_on_Tureen_VII",
  "/wiki/Blockade",
  "/wiki/Star_Destroyer",
  "/wiki/Hijacking_of_the_Harbinger",
  "/wiki/Special:EditPage/:Gial_Ackbar",
  "/wiki/Battle_for_Jedha",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Regent",
  "/wiki/Dors_Urtya",
  "/wiki/Mon_Cala_Mercantile_Fleet",
  "/wiki/MC-series_star_cruiser",
  "/wiki/Stormtrooper",
  "/wiki/Pysk_Lila",
  "/wiki/Aurora_Flare",
  "/wiki/MC80A_Home_One_Type_Heavy_Star_Cruiser",
  "/wiki/Coaxium",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Death_Squadron",
  "/wiki/Queen",
  "/wiki/Trios",
  "/wiki/Shu-Torun",
  "/wiki/Valance",
  "/wiki/Datacard",
  "/wiki/Deflector_shield_generator",
  "/wiki/Attack_on_an_Imperial_Impound_Yard",
  "/wiki/Imperial_Impound_Yard",
  "/wiki/Tula_Markona",
  "/wiki/Clan_Markona",
  "/wiki/Heroes_of_Yavin",
  "/wiki/Parent",
  "/wiki/Kaliida_Nebula",
  "/wiki/Volt_Cobra",
  "/wiki/Comlink",
  "/wiki/Attack_in_the_Cilpar_system",
  "/wiki/Cilpar_system",
  "/wiki/Ibti_Myrak",
  "/wiki/Rogue_Squadron",
  "/wiki/Ambush_in_the_Valo_system",
  "/wiki/Valo_system",
  "/wiki/Technician",
  "/wiki/Garn_Stewer",
  "/wiki/Lyle_Kullan",
  "/wiki/Battle_of_Hoth",
  "/wiki/Wedge_Antilles",
  "/wiki/Wes_Janson",
  "/wiki/Battle_on_Ab_Dalis",
  "/wiki/Eleventh_Division",
  "/wiki/Fourth_Division",
  "/wiki/Seventh_Division",
  "/wiki/Starlight_Squadron",
  "/wiki/Trawak",
  "/wiki/3_ABY",
  "/wiki/Operation_Ringbreaker",
  "/wiki/Kuat_Drive_Yards",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Siege_of_Inyusu_Tor",
  "/wiki/4_ABY",
  "/wiki/Zastiga",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superlaser",
  "/wiki/Airen_Cracken",
  "/wiki/Battle_station",
  "/wiki/Reactor",
  "/wiki/Massa",
  "/wiki/Imperial_Navy",
  "/wiki/Time",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/Unidentified_Mon_Calamari_admiral",
  "/wiki/Sanctuary_Pipeline",
  "/wiki/Operation_Yellow_Moon",
  "/wiki/Iden_Versio",
  "/wiki/Escape_from_the_Invincible_Faith",
  "/wiki/Sullust",
  "/wiki/Nien_Nunb",
  "/wiki/Currency",
  "/wiki/File:ItsATrap-ROTJ.ogg",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Executor",
  "/wiki/Operation:_Cinder",
  "/wiki/Kar-shak",
  "/wiki/HoloNet",
  "/wiki/Gallius_Rax",
  "/wiki/Ensign",
  "/wiki/Ardin_Deltura",
  "/wiki/Raydonia",
  "/wiki/Mustafar",
  "/wiki/Geonosis",
  "/wiki/Dermos",
  "/wiki/Akiva",
  "/wiki/Tatooine",
  "/wiki/Kyrsta_Agate",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Rae_Sloane",
  "/wiki/Emergency_summit_on_Akiva",
  "/wiki/Hologram",
  "/wiki/Saff_Melor",
  "/wiki/Crix_Madine",
  "/wiki/Chancellor_(New_Republic)",
  "/wiki/Mon_Mothma",
  "/wiki/New_Republic_Special_Forces",
  "/wiki/Turbolaser",
  "/wiki/Sergeant",
  "/wiki/Jom_Barell",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/Science_officer",
  "/wiki/Niriian",
  "/wiki/Norra_Wexley",
  "/wiki/Temmin_Wexley",
  "/wiki/Satrapy_of_Myrra",
  "/wiki/Outer_Rim_Territories",
  "/wiki/5_ABY",
  "/wiki/Chandrila",
  "/wiki/Skygarden",
  "/wiki/Hanna_City",
  "/wiki/B1-series_battle_droid",
  "/wiki/Mister_Bones",
  "/wiki/Loyalty_officer",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/Zabrak",
  "/wiki/Bounty_hunter",
  "/wiki/Jas_Emari",
  "/wiki/New_Republic_Senate",
  "/wiki/Kashyyyk",
  "/wiki/Battle_for_Kuat_Drive_Yards",
  "/wiki/Pollus_Maksim",
  "/wiki/Toktar",
  "/wiki/Grand_Admiral",
  "/wiki/Commodore",
  "/wiki/Imperial%E2%80%93Republic_peace_talks",
  "/wiki/Ashmead%27s_Lock",
  "/wiki/Spaceport",
  "/wiki/Phantom_Squadron",
  "/wiki/Dominion",
  "/wiki/Vitiator",
  "/wiki/Neutralizer",
  "/wiki/Attack_on_Chandrila",
  "/wiki/Tolwar_Wartol",
  "/wiki/Standard_day",
  "/wiki/Probe_droid",
  "/wiki/Oculus",
  "/wiki/Starhawk-class_battleship",
  "/wiki/Concord",
  "/wiki/Super_Star_Destroyer",
  "/wiki/Ravager",
  "/wiki/Tyben",
  "/wiki/Lieutenant_General",
  "/wiki/Brockway",
  "/wiki/Nakadia",
  "/wiki/Punishment",
  "/wiki/Amity",
  "/wiki/CR90_corvette",
  "/wiki/Tractor_beam",
  "/wiki/Intercom/Legends",
  "/wiki/Brentin_Lore_Wexley",
  "/wiki/Counselor_to_the_Empire",
  "/wiki/Galactic_Concordance",
  "/wiki/Reproduction",
  "/wiki/Aftab_Ackbar",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Standard_decade",
  "/wiki/Incom-FreiTek_Corporation",
  "/wiki/T-85_X-wing_starfighter",
  "/wiki/Hosnian_Prime",
  "/wiki/Subjugator_(Resurgent-class)",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Hoff_(Resistance_captain)",
  "/wiki/O-MR1",
  "/wiki/Sterdic_Star",
  "/wiki/Mission_to_Taul",
  "/wiki/Taul",
  "/wiki/Spice_spider",
  "/wiki/Can-cell",
  "/wiki/Acid_rain",
  "/wiki/Poe_Dameron",
  "/wiki/Vice_Admiral",
  "/wiki/Amilyn_Holdo",
  "/wiki/Rose_Tico",
  "/wiki/Paige_Tico",
  "/wiki/The_Rebel_Files",
  "/wiki/Excavation_on_Durkteel",
  "/wiki/Durkteel",
  "/wiki/Meeta_Cors",
  "/wiki/Ushos_O._Statura",
  "/wiki/J-Squadron",
  "/wiki/Mission_to_Vodran",
  "/wiki/Vodran",
  "/wiki/Starfighter",
  "/wiki/Battle_of_Takodana",
  "/wiki/Finn",
  "/wiki/Star",
  "/wiki/Thermal_oscillator",
  "/wiki/BB-8",
  "/wiki/Rey_Skywalker",
  "/wiki/Holotable",
  "/wiki/Funeral_of_Han_Solo",
  "/wiki/Ben_Solo",
  "/wiki/MC85_Star_Cruiser",
  "/wiki/Flotilla",
  "/wiki/Mandator_IV-class_Siege_Dreadnought",
  "/wiki/Poldin_LeHuse",
  "/wiki/TIE_line",
  "/wiki/Airlock",
  "/wiki/Larma_D%27Acy",
  "/wiki/Battle_of_Crait",
  "/wiki/Mission_to_the_Outer_Rim",
  "/wiki/Mourning_Shrines",
  "/wiki/Kar%C3%A9_Kun",
  "/wiki/Crait",
  "/wiki/Immortality",
  "/wiki/Bothan",
  "/wiki/Burial",
  "/wiki/Force-sensitive",
  "/wiki/Gial_Ackbar%27s_baton",
  "/wiki/Mon_Calamari_fleet_officer_uniform",
  "/wiki/Utility_belt",
  "/wiki/Blaster_pistol",
  "/wiki/Bib_Fortuna",
  "/wiki/Ben_Burtt",
  "/wiki/George_Lucas",
  "/wiki/Randy_Thom",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Archie_Goodwin",
  "/wiki/Revenge_of_the_Jedi",
  "/wiki/Los_Angeles_Times_Syndicate",
  "/wiki/November",
  "/wiki/1982",
  "/wiki/January",
  "/wiki/The_Ultimate_Return_of_the_Jedi_Insider%27s_Guide",
  "/wiki/Star_Wars_Insider_67",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Richard_Marquand",
  "/wiki/Nilo_Rodis-Jamero",
  "/wiki/Tim_Rose",
  "/wiki/Erik_Bauersfeld",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Artt_Butler",
  "/wiki/2015",
  "/wiki/Sequel_trilogy",
  "/wiki/2016",
  "/wiki/2017",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Tom_Kane",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Gran",
  "/wiki/Ree-Yees",
  "/wiki/Salacious_B._Crumb",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Sy_Snootles",
  "/wiki/Phil_Tippett",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Star_Wars_Legends",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Jason_Fry",
  "/wiki/Paul_R._Urquhart",
  "/wiki/April_3",
  "/wiki/2012",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/September_4",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/J.J._Abrams",
  "/wiki/Robot_Chicken:_Star_Wars",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Freemakers/LEGO",
  "/wiki/Return_of_the_Kyber_Saber",
  "/wiki/Rowan_Freemaker/LEGO",
  "/wiki/Home_One_(episode)",
  "/wiki/Thrown_Into_Battle",
  "/wiki/R0-GR/LEGO",
  "/wiki/Skirmish_with_an_Imperial_Star_Destroyer",
  "/wiki/Zander_Freemaker,_Superstar_Pilot_Guy!",
  "/wiki/Zander_Freemaker",
  "/wiki/Lieutenant",
  "/wiki/Colvett_Valeria",
  "/wiki/Beware,_the_Gamorrean_Flu!",
  "/wiki/Mission_to_rescue_Lando_Calrissian_and_Chewbacca",
  "/wiki/Trouble_on_Tibalt",
  "/wiki/The_Tower_of_Alistan_Nor",
  "/wiki/Kordi_Freemaker/LEGO",
  "/wiki/The_Storms_of_Taul",
  "/wiki/Bren_Derlin",
  "/wiki/Rescue_of_Bren_Derlin",
  "/wiki/Return_to_the_Wheel",
  "/wiki/Mission_to_obtain_an_energy_matrix_activator",
  "/wiki/Kyber_crystal",
  "/wiki/Flight_of_the_Arrowhead",
  "/wiki/Quarrie",
  "/wiki/Mission_to_save_the_Rebel_Fleet",
  "/wiki/Arrowhead_(Freemakers)",
  "/wiki/Skirmish_on_Kashyyyk_(Freemakers)",
  "/wiki/A_Perilous_Rescue",
  "/wiki/Dubrillion",
  "/wiki/Escape_from_Coruscant",
  "/wiki/Rescue_of_Rowan_Freemaker",
  "/wiki/Mandalore",
  "/wiki/Exit_from_Endor",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/Paper",
  "/wiki/Gambit_on_Geonosis",
  "/wiki/LEGO_Star_Wars:_The_Resistance_Rises",
  "/wiki/Poe_to_the_Rescue",
  "/wiki/Subjugator",
  "/wiki/Life_Day",
  "/wiki/The_LEGO_Star_Wars_Holiday_Special",
  "/wiki/Cape",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Water_War",
  "/wiki/Gungan_Attack",
  "/wiki/Prisoners",
  "/wiki/Darth_Vader_(2017)_13",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/Darth_Vader_(2017)_15",
  "/wiki/Lost_Stars",
  "/wiki/Lost_Stars_(audiobook)",
  "/wiki/Lost_Stars_(webcomic)",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/The_Adventures_of_Luke_Skywalker,_Jedi_Knight",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_Battle_Pod",
  "/wiki/Star_Wars_Battlefront",
  "/wiki/A_Leader_Named_Leia",
  "/wiki/Princess_Leia_1",
  "/wiki/Heir_to_the_Jedi",
  "/wiki/Heir_to_the_Jedi_(audiobook)",
  "/wiki/Star_Wars_(2015)_9",
  "/wiki/Star_Wars_(2015)_23",
  "/wiki/Star_Wars_(2015)_44",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars_(2015)_48",
  "/wiki/Star_Wars_(2015)_49",
  "/wiki/Star_Wars_(2015)_50",
  "/wiki/Star_Wars_(2015)_53",
  "/wiki/Star_Wars_(2015)_54",
  "/wiki/Star_Wars_(2015)_55",
  "/wiki/Star_Wars_(2015)_56",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Squad_Goals,_Part_One",
  "/wiki/Star_Wars_Adventures_(2020)_11",
  "/wiki/Squad_Goals,_Part_2",
  "/wiki/Star_Wars_Adventures_(2020)_12",
  "/wiki/Empire_Ascendant_1",
  "/wiki/Rendezvous_Point_(short_story)",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_(2020)_2",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure_(audiobook)",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blade_Squadron_(short_story)",
  "/wiki/Star_Wars_Insider_149",
  "/wiki/Star_Wars_Insider_150",
  "/wiki/Shattered_Empire_1",
  "/wiki/Blade_Squadron:_Zero_Hour",
  "/wiki/Star_Wars_Insider_160",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Blade_Squadron:_Jakku",
  "/wiki/Star_Wars_Insider_172",
  "/wiki/Hyperspace_Mountain",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/The_Legends_of_Luke_Skywalker",
  "/wiki/The_Legends_of_Luke_Skywalker_(audiobook)",
  "/wiki/Before_the_Awakening",
  "/wiki/Age_of_Resistance_-_Rose_Tico_1",
  "/wiki/Star_Wars_Special:_C-3PO_1",
  "/wiki/C-3PO%27s_New_Arm",
  "/wiki/Galactic_Adventures_Storybook_Collection",
  "/wiki/Poe_Dameron_11",
  "/wiki/Join_the_Resistance",
  "/wiki/Join_the_Resistance:_Books_1-3",
  "/wiki/Join_the_Resistance:_Escape_from_Vodran",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens:_Finn%27s_Story",
  "/wiki/The_Force_Awakens_(Golden_Book)",
  "/wiki/The_Force_Awakens_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_5",
  "/wiki/Join_the_Resistance:_Attack_on_Starkiller_Base",
  "/wiki/Age_of_Resistance_-_Rey_1",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi:_Rose_and_Finn%27s_Secret_Mission",
  "/wiki/The_Last_Jedi_Adaptation_2",
  "/wiki/Poe_Dameron_29",
  "/wiki/Resistance_Reborn",
  "/wiki/Resistance_Reborn_(audiobook)",
  "/wiki/Allegiance_1",
  "/wiki/Allegiance_2",
  "/wiki/Allegiance_3",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Tales_from_Wild_Space:_Mattis_Makes_a_Stand",
  "/wiki/Star_Wars_Adventures_(2017)_4",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars_Joke_Book",
  "/wiki/A_New_Home",
  "/wiki/Rowan%27s_Secret_Adventure",
  "/wiki/The_Embersteel_Blade",
  "/wiki/Return_of_the_Return_of_the_Jedi",
  "/wiki/LEGO_Star_Wars:_Droid_Tales_Episodes_I-III",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/From_Trenches_to_Wrenches:_The_Roger_Story_(episode)",
  "/wiki/The_Prisoner_of_Tatooine",
  "/wiki/The_Droid_Rescue_Gambit",
  "/wiki/Minecraft_Star_Wars",
  "/wiki/LEGO_Star_Wars_Summer_Vacation",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Gial_Ackbar",
  "/wiki/Category:Images_of_Gial_Ackbar",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Ships_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Force_Awakens:_New_Adventures",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Episode_VII:_The_Force_Awakens",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/50_Things_to_Notice_in_Star_Wars:_The_Force_Awakens",
  "/wiki/Star_Wars_Insider_165",
  "/wiki/Star_Wars:_ABC-3PO",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Star_Wars:_X-Wing_Deluxe_Book_and_Model_Set",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Awakenings",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_7",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_20",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/The_Last_Jedi:_Bomber_Command",
  "/wiki/Star_Wars:_The_Last_Jedi:_Ultimate_Sticker_Collection",
  "/wiki/Star_Wars:_The_Last_Jedi:_Heroes_of_the_Galaxy",
  "/wiki/2017_Topps_Star_Wars_Galactic_Files_Reborn",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Star_Wars_Helmet_Collection_39",
  "/wiki/Star_Wars_Helmet_Collection_42",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Star_Wars_Helmet_Collection_68",
  "/wiki/Star_Wars_Helmet_Collection_75",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2020",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/The_Star_Wars_Book_of_Monsters,_Ooze_and_Slime",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/A_Galaxy_for_Everyone",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/The_Eyes_Have_It",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Naval_Armament_and_Equipment",
  "/wiki/StarWarsKids.com",
  "/wiki/LEGO_Star_Wars_Character_Encyclopedia:_New_Edition",
  "/wiki/Del_Rey",
  "/wiki/File:New_Republic_Bloodline_Twitter_Post.jpg",
  "/wiki/28_ABY",
  "/wiki/Invasion_of_Mon_Cala",
  "/wiki/19_BBY",
  "/wiki/Darth_Vader_(2017)_16",
  "/wiki/In-universe",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/0_BBY",
  "/wiki/Star_Wars_(2015)_1",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Darth_Vader_(2015)_4",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Yavin_Prime",
  "/wiki/Star_Wars_(2015)_22",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/October_24",
  "/wiki/2018",
  "/wiki/March_20",
  "/wiki/Databank_(original)",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Star_FX",
  "/wiki/Star_Wars_Galaxy_Magazine_3",
  "/wiki/March_24",
  "/wiki/December_3",
  "/wiki/June_11",
  "/wiki/2020",
  "/wiki/August_7",
  "/wiki/June_24",
  "/wiki/January_23",
  "/wiki/May_31",
  "/wiki/2019",
  "/wiki/February_20"
 ]
}