{
 "name": "Gideon",
 "display_name": "Gideon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Security Bureau",
      "Gideon's Imperial remnant"
     ]
    }
   ]
  }
 ],
 "content": "Gideon was a human male Moff during the era of the New Republic, and had prior served as an officer during the Imperial Era in the Imperial Security Bureau. As a warlord following the Galactic Civil War, he led a Imperial remnant of the Galactic Empire in the Outer Rim. Gideon valued power and knowledge and was a patriot of the Galactic Empire and worked for its restoration, while also being imposing and ruthless, even willing to kill others to achieve his goals.\nGideon took part in the Great Purge of Mandalore, where he was responsible for killing millions, and acquired the legendary Mandalorian weapon known as the Darksaber. He was widely believed to have been executed for war crimes in the aftermath.\nBy around 9 ABY, the Galactic Empire ceased to exist, however many soldiers, officials and other loyalists rallied around its banner. Gideon, who was in fact alive, was amongst these and lead an Imperial remnant, where he sought out a high-value asset known as Grogu, a Force-sensitive youngling necessary as a blood donor for his experiments. After Din Djarin, a Mandalorian bounty hunter, went rogue and rescued Grogu from a detachment of Gideon's forces on Nevarro, the moff took an active role in acquiring the child. He was eventually successful, when his Dark Troopers captured Grogu on Tython. Upon Djarin's effort to rescue Grogu, he was defeated in combat and attempted suicide, but was knocked out and detained, leaving the Darksaber to Din.\nAfter the assault on his cruiser, Gideon was sent off to the New Republic for interrogation and trial.\nGideon was an officer in the Imperial Security Bureau of the Galactic Empire. During the Imperial Era, he took part in the Great Purge of Mandalore of the Mandalorians, and was responsible for killing millions of them. In the aftermath of the fall of Mandalore, Gideon came into possession of the Darksaber, the legendary weapon and significant symbol of House Vizsla that had previously been used by Lady Bo-Katan Kryze as leader of the Mandalorians. Having lost the ancient lightsaber, Kryze hunted Gideon in the hope of regaining the symbol of Mandalorian leadership.\nBy circa 9 ABY, Gideon had attained the rank of moff and led a remnant of Imperial forces, having faked his execution for war crimes after the fall of the Empire. He wished to acquire a valuable asset from Arvala-7, tasking \"the Client\" and Doctor Pershing with bringing it alive by any means necessary. This asset was a Force-sensitive infant, Grogu, and Gideon used the remains of the Imperial Army in an attempt to acquire it.\nUpon contacting the Client on Nevarro, he informed Gideon that they had Grogu in their custody. Gideon, however, told him to recheck Grogu's pram. Soon after, Gideon's squad of death troopers opened fire on the Client and the stormtroopers accompanying him in the cantina. Moments later, a K79-S80 Imperial Troop Transport arrived, deploying stormtroopers to supplement the death troopers and secure the area outside the cantina. Shortly after, Gideon landed his Outland TIE fighter, behind the mass of troopers. As he climbed out from his ship and approached the broken cantina window, he confronted the mercenaries inside, the Mandalorian Din Djarin, Greef Karga, and ex-Rebel Carasynthia Dune. He told them that they did not understand Grogu at all and described how much he needed it. As he said this, two of Gideon's scout troopers intercepted and killed the Ugnaught Kuiil, who was taking Grogu back to Djarin's ship, the Razor Crest.\nAs the scout troopers were making their way back to Nevarro, they were informed that they would have to wait, as Gideon had wiped out a dozen of his own men. The troopers became impatient and asked for an update, only to be informed by the same person that he had an officer killed for interrupting him before they were subdued by IG-11. Gideon's men set up an E-Web heavy repeating blaster cannon. Upon hearing Djarin and his crew desperately trying to escape through the vents, Gideon began to speak to the group. Gideon introduced his E-Web turret and described how it had mowed down many of Dune's ranks as well as many Mandalorian recruits at the Night of a Thousand Tears during the Great Purge of Mandalore, which he refers as the siege of Mandalore. Gideon revealed both their full names in the process—Carasynthia Dune and Din Djarin. Lastly, he called out Karga as a disgraced magistrate and telling him to lay down his weapon and to come outside.\nGideon finished off by saying that the E-Web would soon destroy the cantina. After hearing this, Karga called out to Gideon to ask the moff what he was proposing. Gideon answered by offering reasonable negotiation. Karga further asked what assurance he offered, who told Karga that they couldn't trust him. Gideon continued by remarking how Karga broke their earlier arrangement and stated how he would gladly break any promise he made to them, and would happily watch the former magistrate die, and that all that Gideon could offer was that he would act in his self-interest. After he had finished, Gideon left his troopers to watch over the cantina. He turned around to tell Djarin and his crew that they had until nightfall to cooperate. Otherwise, he would order the E-Web to open fire.\nAfter Gideon walked off, IG-11 began a rescue effort, giving Djarin, Karga, and Dune a chance to escape. A battle ensued, and amongst all of the chaos, Gideon watched the battle around him. He eyed Djarin while the Mandalorian utilized the E-Web. Before long, Gideon raised his blaster and shot Djarin in the back of the head. Before Mandalorian could fire back, Gideon took his time to adjust his aim and fire at the E-Web's power pack. It exploded, sending Djarin flying backward. His injuries forced him and the others to fall back into the cantina. Dune dragged Djarin into the cantina while Karga and IG-11 retreated inside. Frustrated with the lack of progress, Gideon ordered an incinerator trooper to burn them out. The trooper set the building alight but was overpowered and killed when Grogu used the Force to push back the flames.\nAs Djarin and his team escaped through the sewer vents, Gideon sent in more stormtroopers to stop them. When their efforts had failed, Gideon dispatched another platoon to wait at the end of a lava river. Upon anticipating his troops' failure, Gideon hopped into his Outland TIE fighter to deal with Djarin himself. After IG-11 detonated, killing off the entire platoon, Gideon swooped in and began to fire at the Mandalorian and his team. He swerved his TIE back around and met Djarin. The Mandalorian flew up into the air on his new jetpack and grappled onto the back of his TIE fighter. Gideon tried his best to shake him off but was unsuccessful. After climbing on top of the TIE fighter, Djarin tried to shoot him from the roof of the cockpit, but was protected by the blast-proof glass, allowing him to continue shaking off the Mandalorian.\nGideon spun his TIE fighter and darted in multiple directions to lose Djarin, but the latter managed to plant a grav charge on the TIE. By the time Gideon discovered them, the left-wing blew off, and a fire started inside of the cockpit. After he crashed, the Mandalorian and the rest of his crew assumed he was dead. Djarin parted ways with his comrades and flew off-world with Grogu. Sometime later, a group of Jawas attempted to salvage the wreckage of Gideon's TIE fighter. Gideon, alive and still sitting in the rubble, carved his way out of the TIE using the Darksaber. The Jawa scavengers had been scared off before Gideon stepped out and climbed on top of the TIE fighter, scanning his surroundings.\nOn the estuary moon of Trask, Kryze arranged a heist for weapons on an Imperial Gozanti-class cruiser leaving Trask. Kryze worked with Djarin to infiltrate the ship and was also helped by two other Mandalorians, Axe Woves and Koska Reeves. As they were successful in taking much of the ship, the vessel's captain contacted Gideon in need of reinforcements. Gideon asked the captain how far the Mandalorians had breached. When the captain told him they had taken most of the ship, Gideon stated that it was too late to send reinforcements and cryptically told him he knew what to do. Only the captain was aware of his meaning, upon which he shut off the hologram and killed both pilots, pushing the ship straight into the waters of Trask. He was unsuccessful however, and was stopped by Djarin and was then interrogated by Kryze for the Darksaber. Knowing that Gideon would kill him for his failure, he chose to commit suicide by biting an electric suicide pill in his mouth.\nAround the same time, Gideon had received a hologram message from Dr. Pershing, who was apologizing to him for failing an experiment involving Grogu and Strand-Casts. He also reported that he had exhausted their supply of Grogu's blood samples, and that he required more genetic material from the donor in order to continue his work.\nThree days later, Djarin went back to Nevarro in need of repairs and was recruited by Karga, Dune, and a Mythrol to join them on their own mission first to destroy an Imperial base. As the four of them went on this mission, a Mimbanese worker started working on Djarin's ship, who was installing a tracking device on his ship. Djarin and the others viewed the hologram of Pershing and realized that the Imperials were performing experiments. Gideon was later informed that the worker had installed the device on the Razor Crest. He smiled to himself and continued to supervise the work of his scientists on his dark troopers.\nGideon's forces tracked Djarin's ship to Tython. From high atmosphere, two Imperial transports carrying stormtroopers launched from Gideon's light cruiser, to combat Djarin and his allies, Boba Fett and Fennec Shand. After the stormtroopers' defeat, Gideon's cruiser fired on Djarin's ship, the Razor Crest, and destroyed it. Afterwards, four dark troopers were launched from the cruiser and landed near the seeing stone where Grogu had been meditating. There, one of the dark troopers seized Grogu and flew upwards back to the cruiser with the other three dark troopers while Fett pursued them from his ship. Upon seeing the cruiser, Fett remarked in disbelief that the Empire was back. Once the trooper droids returned to the cruiser with the captured child, Gideon's cruiser jumped to hyperspace. While still in hyperspace, Gideon briefly talked to the child in his prison cell, walking in on the child attacking two stormtroopers. Gideon showed Grogu the Darksaber before having his stormtroopers stun him and place him in shackles to prevent him from using his powers on them. Gideon then ordered his comms officer to send an encrypted message to Pershing informing him that they had their donor for his experiments once they exited hyperspace.\nDin Djarin and his crew infiltrated Gideon's cruiser, and they split, Bo-Katan searching for Gideon, and Djarin searching for the child. Gideon had appeared to anticipate this and was waiting in Grogu's cell when Djarin confronted him. He claimed that he no longer had any need for Grogu; as Djarin approached Grogu, Gideon attempted to strike him from behind and proceeded to battle the Mandalorian, who fought back with his beskar spear, while telling him about the Darksaber. Despite his best efforts, Djarin ultimately defeated Gideon in battle and took both him and the Darksaber to the bridge. When Djarin attempted to give the Darksaber to Bo-Katan, she refused and Gideon laughed, telling Djarin that she had to best him in combat to rightfully claim it.\nThe dark troopers, who Djarin had ejected, activated their rocket boosters and flew back to Gideon's cruiser, making their way to the bridge. As Djarin had struggled against one trooper, Gideon was confident that everyone besides himself and Grogu would be killed. As the droids pummeled through the blast doors, they suddenly stopped, much to everyone's confusion. Elsewhere, an X-wing starfighter had landed and a Jedi came out of the fighter. Gideon could only watch in horror as the Jedi, Luke Skywalker, destroyed the droids with ease. Realizing that he was defeated, he managed to take a blaster from his distracted captors and attempted to shoot Bo-Katan but her armor protected her. However, it was enough to force her out of the way to give Gideon a clear shot at Grogu, only for Djarin to throw himself in front of the child, shielding him from Gideon. Gideon's other captors then trained their blasters on him, ordering him to surrender, so he tried to kill himself, but was disarmed and knocked unconscious by Dune before he could do so.\nAfter the assault on his cruiser, Moff Gideon was placed under the arrest of the New Republic. Paz Vizsla and the Armorer believed that only death would have been justice for his atrocities. According to Din Djarin, it was very likely that he would be executed for his crimes by the New Republic Tribunal, although the Armorer doubted that.\nA clever and formidable member of the Galactic Empire, Gideon valued knowledge and power. In particular, he was fiercely determined to capture a specific quarry, an infant member of Yoda's species known as Grogu. He believed that the infant meant more to his plans than Din Djarin, a Mandalorian bounty hunter and caretaker of the infant, and his allies would ever know.\nGideon was a patriot of the Galactic Empire who considered his cause just, and would not hesitate to rebuild it from scratch. He yearned for order in the galaxy, considering Grogu's power the key to that end, this gives some redeeming qualities to him and shows that he ultimately had good intentions but was willing to do horrible things to achieve them.\nHe was imposing and ruthless, willing to kill fellow Imperials to achieve his goals, as he showed no hesitation in killing the Client and his stormtroopers, and then an officer for only interrupting him. He was also an adept tactician and skilled at both psychological warfare and personal combat. He was willing to reveal information that would have infuriated his enemies just to taunt and destabilize them. He ordered an officer to commit suicide to prevent him and his ship from being captured. Confident in his army's capabilities, especially the dark troopers, it shattered when he saw Luke Skywalker cut his dark troopers with ease. In desperation, he tried to shoot both Bo-Katan and Grogu, but when both of these failed, he attempted to kill himself, refusing to become a Republic captive. Right before being captured, he tried to kill Grogu before Djarin saved him, showing he has no moral standards whatsoever.\nGideon lied and tried to trick Djarin before attacking him.\nGideon was a human male. He had dark eyes, skin, and black hair that was greying by the time of the New Republic Era.\nAs an Imperial officer of high rank, Gideon wore an outfit similar to an Imperial uniform with dark-colored battle armor and a cape. It is clear that Gideon was a seasoned warrior and has participated in many battles. He wielded a blaster pistol and flew an outland TIE fighter, and was also in possession of the Darksaber, which he used to duel Din Djarin until he was disarmed. He also used the weapon to escape his TIE fighter when it crashed on Nevarro.\nGideon first appeared in Chapter 7 of Jon Favreau's 2019 Disney+ television series The Mandalorian, directed by Deborah Chow, which aired on December 18, 2019. He was first indirectly mentioned in the show in Chapter 3, which aired on November 22, 2019. He was portrayed by Giancarlo Esposito.\nA longtime Star Wars fan of the franchise's early movies, having been always fascinated with the Darth Vader character, Esposito was excited upon being asked by Favreau to appear in the show. Strongly affected by Peter Cushing's performance as Grand Moff Wilhuff Tarkin as well, Esposito tried to do some research for the role. From Esposito's point of view, he does believe that Gideon genuinely wants to bring order and security to ultimately allow the universe to survive and thinks of him as the galaxy's \"top warden,\" who oversees that people don't overrun or take out each other.\nGideon's costume was designed by Brian Matyas, designer of various characters in the series. The costume itself was created by Joseph Porro and Frank Ippolito, as part of Ippolito's company Thingergy Inc.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Gideon_(disambiguation)",
  "/wiki/Chapter_15:_The_Believer",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Emperor_Palpatine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Moff",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Imperial_officer",
  "/wiki/Imperial_Era",
  "/wiki/Warlord",
  "/wiki/Galactic_Civil_War",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Great_Purge_of_Mandalore",
  "/wiki/Mandalorian",
  "/wiki/Darksaber",
  "/wiki/9_ABY",
  "/wiki/Soldier",
  "/wiki/Hunt_for_Grogu",
  "/wiki/Grogu",
  "/wiki/Force-sensitive",
  "/wiki/Youngling",
  "/wiki/Blood",
  "/wiki/Din_Djarin",
  "/wiki/Bounty_hunter",
  "/wiki/Incident_on_Nevarro",
  "/wiki/Nevarro",
  "/wiki/Third-generation_design_Dark_Trooper",
  "/wiki/Skirmish_on_Tython",
  "/wiki/Tython",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Officer",
  "/wiki/Mandalore",
  "/wiki/House_Vizsla",
  "/wiki/Lord",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Mand%27alor",
  "/wiki/Lightsaber",
  "/wiki/File:TheClientPayment-TMCh3.png",
  "/wiki/Arvala-7",
  "/wiki/The_Client",
  "/wiki/Doctor",
  "/wiki/Pershing",
  "/wiki/Imperial_Army",
  "/wiki/File:Gideon-EWeb-TS1C8.ogg",
  "/wiki/Death_trooper",
  "/wiki/Stormtrooper",
  "/wiki/Nevarro_school",
  "/wiki/K79-S80_Imperial_Troop_Transport",
  "/wiki/Outland_TIE_fighter",
  "/wiki/Mercenary",
  "/wiki/Greef_Karga",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Carasynthia_Dune",
  "/wiki/Scout_trooper",
  "/wiki/Ugnaught",
  "/wiki/Kuiil",
  "/wiki/Razor_Crest",
  "/wiki/File:GideonTroops-TMS01E07.jpg",
  "/wiki/IG-11",
  "/wiki/E-Web_heavy_repeating_blaster_cannon_(Gideon%27s_Imperial_remnant)",
  "/wiki/Night_of_a_Thousand_Tears",
  "/wiki/Magistrate",
  "/wiki/Incinerator_trooper",
  "/wiki/The_Force",
  "/wiki/Nevarro_sewer",
  "/wiki/Underground_lava_river",
  "/wiki/Gideon%27s_Outland_TIE_fighter",
  "/wiki/Jetpack",
  "/wiki/File:GideonDarksaber-MandalorianCh8.png",
  "/wiki/Grav_charge",
  "/wiki/Jawa",
  "/wiki/File:TraskOfficersMakeACall-THCh11.png",
  "/wiki/Moon",
  "/wiki/Trask",
  "/wiki/Imperial_Gozanti-class_cruiser",
  "/wiki/Axe_Woves",
  "/wiki/Koska_Reeves",
  "/wiki/Unidentified_Imperial_captain",
  "/wiki/Hologram",
  "/wiki/Death",
  "/wiki/Water",
  "/wiki/Suicide",
  "/wiki/Suicide_pill",
  "/wiki/Mouth",
  "/wiki/Strand-Cast",
  "/wiki/The_Mythrol",
  "/wiki/Nevarro_Imperial_base",
  "/wiki/Mimbanese",
  "/wiki/Unidentified_Mimbanese_worker",
  "/wiki/File:The-Mandalorian-dark-troopers.png",
  "/wiki/Imperial_transport",
  "/wiki/Light_cruiser",
  "/wiki/Boba_Fett",
  "/wiki/Fennec_Shand",
  "/wiki/Cruiser",
  "/wiki/Seeing_stone",
  "/wiki/Slave_I",
  "/wiki/Hyperspace",
  "/wiki/Unidentified_Imperial_comms_officer",
  "/wiki/File:GideonGrogu-TMCh14.png",
  "/wiki/Beskar_spear",
  "/wiki/File:DjarinDeliversGideon-TMCh16.png",
  "/wiki/Rocket_booster",
  "/wiki/Blast_door",
  "/wiki/X-wing_starfighter",
  "/wiki/Luke_Skywalker",
  "/wiki/Paz_Vizsla",
  "/wiki/The_Armorer",
  "/wiki/New_Republic_Tribunal",
  "/wiki/File:GideonTIE-TMS01E08.jpg",
  "/wiki/Yoda%27s_species",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Military_rank",
  "/wiki/Clothing",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Imperial_officer_battle_armor",
  "/wiki/Cape",
  "/wiki/Blaster_pistol",
  "/wiki/File:Gideon-Remnant-Concept.png",
  "/wiki/Chapter_7:_The_Reckoning",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Deborah_Chow",
  "/wiki/December_18",
  "/wiki/Chapter_3:_The_Sin",
  "/wiki/November_22",
  "/wiki/Giancarlo_Esposito",
  "/wiki/Star_Wars",
  "/wiki/Anakin_Skywalker",
  "/wiki/Peter_Cushing",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Brian_Matyas",
  "/wiki/Joseph_Porro",
  "/wiki/Frank_Ippolito",
  "/wiki/Category:Images_of_Gideon",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/The_Mandalorian:_Season_1:_Volume_1",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/The_Mandalorian_3",
  "/wiki/Chapter_8:_Redemption",
  "/wiki/The_Mandalorian_8",
  "/wiki/The_Mandalorian:_A_Clan_of_Two",
  "/wiki/The_Mandalorian:_Magnetic_Fun",
  "/wiki/The_Mandalorian:_This_is_the_Way",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/The_Mandalorian:_The_Path_of_the_Force",
  "/wiki/Chapter_11:_The_Heiress",
  "/wiki/Chapter_12:_The_Siege",
  "/wiki/Chapter_14:_The_Tragedy",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/The_Mandalorian:_The_Rescue",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/The_Mandalorian_Season_Three",
  "/wiki/LEGO_STAR_WARS:_Celebrate_the_Season",
  "/wiki/Trick-or-Treat",
  "/wiki/Ghost_Ship",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Happy_Celebration_45th_Anniversary_A_New_Hope",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Man_from_Mandalore",
  "/wiki/Star_Wars_Insider_193",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Technology",
  "/wiki/Practical",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Lightsabers_and_Jedi_Equipment",
  "/wiki/The_Mandalorian:_Allies_%26_Enemies",
  "/wiki/Topps_Star_Wars_Living_Set",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/TIE_Fighters",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Mando_Mania",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Sixth_Scale_Figures",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars:_The_Mandalorian:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Mandalorian",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Worldwide",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_9",
  "/wiki/History_of_the_Ship",
  "/wiki/Pilots_and_Crew",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/The_Fett_Family%27s_Finest",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Protocol_and_Service_Droids",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/Bo-Katan_Kryze:_Leader_in_Waiting",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_Two)",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Chapter_13:_The_Jedi",
  "/wiki/July_29",
  "/wiki/June_25",
  "/wiki/2021",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020",
  "/wiki/December_28",
  "/wiki/August_24",
  "/wiki/September_21"
 ]
}