{
 "name": "Gideon_Hask",
 "display_name": "Gideon Hask",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kuat"
     ]
    },
    {
     "name": "Born",
     "values": [
      "27 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Retribution"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Royal Imperial Academy",
      "Imperial Starfighter Corps",
      "Inferno Squad",
      "Royal Imperial Academy",
      "Imperial Starfighter Corps",
      "Inferno Squad",
      "Dreamers",
      "First Order",
      "First Order military",
      "First Order military"
     ]
    }
   ]
  }
 ],
 "content": "Gideon Hask, nicknamed \"Gid,\" was a human male native of the planet Kuat. During the Galactic Civil War, Hask served as a soldier and starfighter pilot before joining the ranks of Inferno Squad—an elite commando unit of the Galactic Empire. After witnessing the destruction of the second Death Star at the Battle of Endor in 4 ABY, Hask and his team were reassigned to Operation: Cinder, a plan devised by Emperor Sheev Palpatine to devastate several worlds in the event of his death. His support for the late Emperor's plan brought Hask into direct conflict with his teammates, Commander Iden Versio and Del Meeko, both of whom defected to the New Republic as a result of the execution of Operation: Cinder on Vardos—a planet noted for its loyalty to the Empire. Promoted to the rank of Commander by Admiral Garrick Versio, Iden's father, Hask supported the Imperial forces led by Counselor Gallius Rax against the forces of the Republic at the Battle of Jakku in 5 ABY. Although Hask survived an encounter with his former commanding officer, the Empire was ultimately defeated and compelled to capitulate to the Republic, ending the war as well as the reign of the Empire.\nIn the years that followed the conclusion of the Galactic Civil War, Hask went on to become an officer of the First Order, a military junta founded in the Unknown Regions by a group of Imperials who rejected the war's outcome and the subsequent rise of the New Republic. In addition to serving as commander of the Resurgent-class Star Destroyer Retribution by 34 ABY, he was also a participant in Project Resurrection—a clandestine operation which aimed to conscript children for the purpose of training them to become stormtroopers. In the same year, the Republic capital world of Hosnian Prime was destroyed by the First Order's Starkiller superweapon, although Hask was killed shortly afterward during a final confrontation between himself and Iden Versio.\nA native of the planet Kuat, Hask was orphaned at ten years old, when a rebel infiltrator detonated a bomb within the Kuat shipyards. Following this, Hask's new legal guardian, who felt school was an acceptable substitute for parents, enrolled him at the Future Imperial Leaders Military Preparatory School on the planet Vardos in the Jinata system. Hask later studied at the Coruscant Imperial University, where he came to know Iden Versio, a fellow student with whom he developed a healthy sense of competition. By the time of his graduation, Hask had risen to the top of his class.\nAfter leaving the Imperial Academy, Hask eventually came to serve aboard the Mandate and earned the Crimson Star for exceptional performances against his enemies along with a promotion. After the Battle of Yavin, Hask, along with Senior Lieutenant Iden Versio, Del Meeko and Seyn Marana, was drafted into Inferno Squad, a Special Forces unit in the Imperial Military, by Admiral Garrick Versio. Hask participated in Inferno's first mission: to infiltrate and destroy the Dreamers, which was a success, though it also brought the death of Marana.\nHask went on to participate with Inferno in conducting special operations throughout the Galactic Civil War, and, in 4 ABY, he commanded the Corvus while Iden went on important infiltration mission and he arrived to extract her and he then fought at the Battle of Endor, which saw the death of Emperor Palpatine and the destruction of the second Death Star, however Inferno Squad all made it out alive. Hask flew alongside Iden at the battle of Fondor, fighting against a Rebel attack on Moff Raythe, whose Star Destroyer transported satellites to be used as part of Operation: Cinder. In the battle he and Iden played a crucial role in ensuring an imperial victory and the safety of the satellites and the Dauntless as well as leaving the rebel cruiser vulnerable to attack . However, when this climate disruption array attacked the Versio homeworld of Vardos, Iden and Meeko both went rogue, though Hask remained loyal to the Empire, succeeding in their original mission to extract Protectorate Gleb to Admiral Versio, who promoted Hask to Commander.\nWhile Iden and Meeko reformed Inferno Squad in the New Republic, Hask continued to serve Admiral Versio and the shattering Empire in the last year of the Galactic Civil War. Promoted to commander, Hask oversaw fueling operations on Chinook Station at Bespin and evaded capture when Iden and Meeko undertook a mission to the station. Hask went on to fight at the Battle of Jakku, where he took to the skies in a TIE interceptor and engaged in a dogfight with Iden. Iden shot him down, however, seemingly killing him.\nThe Empire went on to lose the battle and was forced to surrender to the Republic and sign the Galactic Concordance. Secretly, however, a select group of Imperial officers and loyalists were able to flee into the Unknown Regions of the galaxy, Hask among them, as part of the secret Contingency. There, they formed the First Order, and Hask became an officer within the new faction.\nTwenty-nine years after the Battle of Jakku, Meeko and the Corvus were captured by Jinata Security, which was in league with the First Order. Hask confronted his former squad mate one last time before killing him personally. He ordered Protectorate Gleb to bury the bodies of Meeko and his crew, but to leave the Corvus alone, hoping to lure Iden into a trap and kill her as well.\nSometime later, Resistance member and friend of Iden, Shriv Suurgav, found the Corvus empty. Concerned by this, he contacted Iden. After they seemingly found out Del was on Vardos being held by Gleb, they returned there to find him and Gleb, but when they arrived, they found Gleb had been executed by Hask and the First Order. Hask later revealed to them that he killed Meeko in revenge for when he and Iden defected thirty years prior. He then ordered the Corvus destroyed in an attempt to kill Iden and Del's daughter, Zay Versio, but Zay had survived in an escape pod. He then ordered to have Vardos burned and have Iden and Shriv interrogated for information on the Resistance and then executed, but a battle erupted between J-Sec and First Order forces.\nHask returned to the Retribution, but Iden, Zay, and Shriv followed him in stolen TIE fighters. They boarded the ship just as it entered hyperspace and went to destroy the hyperdrive with charges. Predicting this, Hask snuck up on them and held Zay at gunpoint just as she had armed the last charge, and began taunting Iden to shoot him, but she dropped her weapon as she didn't want to risk hitting Zay. Disappointed in her cowardice, he berated her and aimed his pistol to kill her, but Zay broke free of Hask's grip and tossed a blaster to Iden, who shot him off the catwalk and down into the pit of the hyperdrive core, killing him.\nIden and Zay succesfully pulled the Star Destroyer from hyperspace, stopping it from defending Starkiller Base. They also retrieved schematics for a First Order dreadnought that could be brought to the Resistance. However, Hask did leave Iden fatally wounded, and she died shortly after him, leaving Zay and Shriv alone to take the stolen plans to D'Qar.\nUnlike the rest of his comrades in Inferno Squad, because of the tragic events that happened to his family when he was still but a small boy, Gideon Hask was completely devoted to the Galactic Empire and later the First Order, thinking the Rebels as traitors to the Empire and never once questioning the intentions of both factions. He enjoyed killing rebels, as shown on multiple occasions where he disobeyed orders to do so. However, as an Imperial he was not remorseless and was saddened when he thought Iden had died on the Death Star and later worried on Fondor when Iden was almost sucked into space. He also admired stormtroopers and said that they had discipline and fearlessness. However, he had no problem with the Empire attacking the loyal world of Vardos. Also following Iden and Del's \"betrayal\" and defection to the Rebellion, he did not hesitate to hunt and kill either of them. As a First Order officer, he did not have any problem kidnapping children.\nWhen he discovered Del three decades later, he had been disillusioned by Del and his wife's weakness after the Galactic Civil War and was willing to make sure that they both paid the price for betraying the Empire at all cost. He willingly murdered Gleb for falling behind with Project Resurrection. He even joked about it later and enjoyed watching the destruction of the New Republic capital. He enjoyed making Iden watch her daughter seemingly die on the Corvus. He taunted Iden to shoot him in their final confrontation and insulted her for not shooting him as he was holding her daughter.\nGideon Hask was portrayed by Paul Blackthorne in Star Wars Battlefront II.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gideon_(disambiguation)",
  "/wiki/Hask_(disambiguation)",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Gideon_Hask",
  "/wiki/Special:Upload",
  "/wiki/Kuat",
  "/wiki/27_BBY",
  "/wiki/34_ABY",
  "/wiki/Retribution",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Royal_Imperial_Academy",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Inferno_Squad",
  "/wiki/Dreamers",
  "/wiki/First_Order",
  "/wiki/First_Order_military",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Galactic_Civil_War",
  "/wiki/Soldier",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Special_forces",
  "/wiki/Commando",
  "/wiki/Squad",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Operation:_Cinder",
  "/wiki/Contingency",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Climate_disruption_array",
  "/wiki/Death",
  "/wiki/Skirmish_on_Vardos",
  "/wiki/Commander",
  "/wiki/Iden_Versio",
  "/wiki/Del_Meeko",
  "/wiki/Inferno_Squad_(Resistance)",
  "/wiki/New_Republic",
  "/wiki/Vardos",
  "/wiki/Military_rank",
  "/wiki/Admiral",
  "/wiki/Garrick_Versio",
  "/wiki/Parent",
  "/wiki/Counselor_to_the_Empire",
  "/wiki/Gallius_Rax",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/Battle_of_Jakku",
  "/wiki/5_ABY",
  "/wiki/Officer",
  "/wiki/Imperial_Instruments_of_Surrender",
  "/wiki/Imperial_Era",
  "/wiki/Standard_year",
  "/wiki/Galactic_Concordance",
  "/wiki/The_galaxy",
  "/wiki/First_Order_officer",
  "/wiki/Unknown_Regions",
  "/wiki/New_Republic_Era",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Project_Resurrection",
  "/wiki/Youngling",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Capital",
  "/wiki/Hosnian_Prime",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Starkiller_Base",
  "/wiki/Superweapon",
  "/wiki/Skirmish_on_the_Retribution",
  "/wiki/Unidentified_rebel_infiltrator",
  "/wiki/Bombing_at_the_Kuat_shipyards",
  "/wiki/Kuat_shipyards",
  "/wiki/Gideon_Hask%27s_legal_guardian",
  "/wiki/Future_Imperial_Leaders_Military_Preparatory_School",
  "/wiki/Jinata_system",
  "/wiki/Imperial_Academy",
  "/wiki/Mandate",
  "/wiki/Crimson_Star",
  "/wiki/Battle_of_Yavin",
  "/wiki/Senior_Lieutenant",
  "/wiki/Seyn_Marana",
  "/wiki/Imperial_Special_Forces",
  "/wiki/Imperial_Military",
  "/wiki/Infiltration_of_the_Dreamers",
  "/wiki/Corvus_(Raider_II-class)",
  "/wiki/Escape_from_the_Invincible_Faith",
  "/wiki/Attack_on_Fondor",
  "/wiki/Fondor",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Moff",
  "/wiki/Raythe",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Satellite",
  "/wiki/Versio_family",
  "/wiki/Protectorate_(title)",
  "/wiki/Gleb",
  "/wiki/Chinook_Station",
  "/wiki/Bespin",
  "/wiki/Mission_to_Chinook_Station",
  "/wiki/TIE/IN_interceptor",
  "/wiki/Imperial_officer",
  "/wiki/Xi-class_light_shuttle",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Jinata_Security",
  "/wiki/Mission_to_Pillio_(First_Order)",
  "/wiki/Resistance",
  "/wiki/Shriv_Suurgav",
  "/wiki/Zay_Versio",
  "/wiki/Mandator_IV-class_Siege_Dreadnought",
  "/wiki/D%27Qar",
  "/wiki/Paul_Blackthorne",
  "/wiki/Category:Audio_files_of_Gideon_Hask",
  "/wiki/Category:Images_of_Gideon_Hask",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/Revelations_1",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Star_Wars_Insider",
  "/wiki/Heading_into_Battle",
  "/wiki/Star_Wars_Insider_177",
  "/wiki/The_Fist_of_the_Empire",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Galactic_Empire_Conversion_Kit",
  "/wiki/TIE/ln_Fighter_Expansion_Pack",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Spark_of_Hope",
  "/wiki/Xi-class_Light_Shuttle_Expansion_Pack",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_61",
  "/wiki/Creating_a_Starship_Fleet",
  "/wiki/Skystrike_Academy_Squadron_Pack",
  "/wiki/Databank_(website)",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_ABY",
  "/wiki/Reproduction",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens"
 ]
}