{
 "name": "Gil Jaretto",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Gil Jaretto was a human male Jedi Master who was stationed on the waterworld of Dubraib. Around 231 BBY, he visited the Starlight Beacon space station and helped its staff handle a large brawl that was taking place. When he and other Jedi were unsuccessful in fully stopping the fighting, a security droid used crowd suppression to knock out all of the brawlers. After the conflict ceased, he and other Jedi patrolled the hallways, ensuring no more violence broke out.\nGil Jaretto was a Jedi Master of the Jedi Order who was stationed on the waterworld of Dubraib, located on the Galactic Frontier, during the High Republic Era. Around 231 BBY, he was visiting the Galactic Republic's Starlight Beacon space station when a large brawl broke out among a group of scientists of the Galactic Agricultural Alliance. The scientists had been exposed to a johto flower that had been bred with the Drengir, a carnivorous, plant-like species, which caused unusual aggression. While the station's administrator, Velko Jahen, and Head of Security, Ghal Tarpfen, were discussing how to handle the situation, Jaretto and five other Jedi approached, with Jaretto offering their assistance. Jahen accepted it on the condition that the Jedi kept injuries to a minimum. Jaretto bowed his head, accepting the terms, with the half-dozen Jedi moving toward the group of fighters.\nThe Jedi's presence caused the brawlers to pause for a moment. However, just as Jahen began to relax, the fighting continued, with the Jedi doing their best to calm down the fighters. Tarpfen then called over a security droid to deploy non-lethal crowd suppression, which it spewed into the dining facility where the brawl was taking place. Tarpfen had Jahen and the group of Jedi step back so as to not be affected by the substance. The doors to the facility closed, leaving a short moment of awkward silence as the group waited for the correct amount of time to pass, after which the doors opened to reveal all of the dozens of scientists sleeping peacefully. Jahen then thanked Jaretto for his help, asking that he and the other Jedi patrol the hallways to make sure no more violence broke out while she and Tarpfen handled clean-up of the situation. Jaretto confirmed that he could do so, and the Jedi walked away.\nGil Jaretto respected Jahen's request for none of the scientists to be harmed in the Jedi's attempts to subdue the brawl, bowing his head at her. He was a human male with dark skin.\nGil Jaretto appeared in the second installment of the short story \"Starlight: Hidden Danger,\" which was written by Justina Ireland and published in the 204th issue of the Star Wars Insider magazine as part of the Star Wars: The High Republic: Starlight serialized fiction on August 10, 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Gil",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Master",
  "/wiki/Waterworld",
  "/wiki/Dubraib",
  "/wiki/231_BBY",
  "/wiki/Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/Jedi",
  "/wiki/Ateseven",
  "/wiki/Crowd_suppression",
  "/wiki/Galactic_Frontier",
  "/wiki/High_Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Scientist",
  "/wiki/Galactic_Agricultural_Alliance",
  "/wiki/Johto_flower",
  "/wiki/Drengir",
  "/wiki/Diet",
  "/wiki/Plant",
  "/wiki/Species",
  "/wiki/Administrator",
  "/wiki/Velko_Jahen",
  "/wiki/Head_of_Security",
  "/wiki/Ghal_Tarpfen",
  "/wiki/Time",
  "/wiki/Sleep",
  "/wiki/Starlight:_Hidden_Danger",
  "/wiki/Justina_Ireland",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_High_Republic:_Starlight",
  "/wiki/August_10",
  "/wiki/2021",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Valo_Republic_Fair",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Standard_year",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/232_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)",
  "/wiki/Titan_Magazines"
 ]
}