{
 "name": "Gilas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Wasskah"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White and brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Garnac's hunting guild"
     ]
    }
   ]
  }
 ],
 "content": "Gilas was a male Trandoshan big game hunter who was a member of a hunting guild helmed by the Trandoshan Garnac during the year 20 BBY. The guild's prey at times consisted of sentient prey kidnapped from around the galaxy which were then taken to the moon of Wasskah. There, the prey was mercilessly hunted by the Trandoshan guild. However, one capture, the Jedi Padawan Ahsoka Tano, managed to form a small resistance movement with other captured individuals and brought the fight back to the Trandoshans.\nGilas investigated a starship the Padawan's group managed to crash, and later partook in the defense of Garnac's floating fortress. Although Gilas and the other hunters managed to briefly subdue Tano and her allies, they received unexpected help from Wookiee soldiers. Gilas was killed by the Wookiee leader General Tarfful in the ensuing firefight, which overall ended with a Wookiee victory.\nA Trandoshan male, Gilas was a member of a hunting guild led by fellow Trandoshan Garnac. Based on the moon of Wasskah, the guild kidnapped sentient beings and brought them back to Wasskah where they were hunted by the guild for sport.\nDuring the year 20 BBY, Garnac's son Dar had reached the age where he would be allowed to partake in the guild's hunting trips. Gilas partook in a hunt the day of Dar's initiation ceremony, which featured brand new prey that included a Jedi Padawan, the Togruta Ahsoka Tano. Alongside the other Trandoshan hunters, Gilas took up arms upon Garnac's endorsement of the hunt and piloted a hover pod to Wasskah's Island Four alongside the hunter Ramy.\nLater that night, Gilas was present for Dar's induction ceremony on the guild's floating fortress base. Along with the other hunters, Gilas chanted Dar's name as the young Trandoshan's father accepted him into the guild. However, Dar was killed the very next day by Tano when Dar attempted to kill her and another stranded Jedi.\nA few days later, Tano joined forces with two other Jedi younglings, O-Mer and Jinx, and together they forced a Trandoshan drop ship to crash on Island Four's beach, freeing the sole Wookiee prisoner, Chewbacca. Gilas and the other Trandoshans found the freighter the following day. While Gilas patrolled the area in a hover pod, it was discovered that the freighter pilots Clutch and Goron had been killed during the altercation. Gilas later returned to the floating fortress.\nTano's survivors captured the hunter Smug the next day and forced him to call for another hover pod to pick him up. Once the hover pod arrived, Tano's group hijacked it and flew it to the fortress in order to mount an attack. Their initial ambush saw the death of the hunter Lagon, which caused Ramy to call for backup. Gilas, who had been standing by alongside Ratter, quickly joined the fray.\nGilas and Ratter opened fire on the attackers, but were forced to take cover when the Jedi used the Force the throw a hover pod at them. While Ratter brawled Chewbacca in hand-to-hand combat, Gilas attempted to shoot the Jedi attackers with his blaster pistol. Tano used the Force to throw off his aim which forced Gilas into a melee brawl with her and Jinx. The Jedi overcame Gilas and pinned him to the ground. Meanwhile, O-Mer, who had been flying the stolen hover pod, was shot down by Garnac, which threw off the attacker's momentum. Gilas, now free, turned his blaster on the defeated O-Mer and Chewbacca.\nWith the Jedi team at his men's mercy, Garnac applauded their efforts. Before he could eliminate them, though, Wookiee reinforcements arrived thanks to a transmitter Chewbacca had built earlier. The battle renewed and Gilas refocused his fire on the attacking Wookiee soldiers. The Wookiees' leader, General Tarfful, jumped between Gilas and Ramy to fight them personally. After throwing Ramy off the side of the floating fortress, Tarfful knocked Gilas to the ground and stomped in Gilas' head, quickly but brutally killing the Trandoshan hunter.\nThe Wookiees secured total victory over the hunting guild when Tano killed Garnac in combat, ending the guild's bloody agenda.\nGilas was a stocky Trandoshan with brown and white-colored scales and orange eyes. Gilas quickly jumped into the fight against Tano's team upon Ramy's call for backup and fought Jedi and Wookiees alike in hand-to-hand combat, although he lost both of his direct duels with them.\nThe prospect of a new hunt excited Gilas, and while preparing for the hunt before Dar's initiation, Gilas celebrated by roaring. During Dar's initiation ceremony, Gilas chanted the young hunter's name with the others in anticipation of Dar's induction, and celebrated as it happened.\nDuring his final activities on Wasskah, Gilas clothing consisted of a turquoise shirt covered by a brown vest. Gilas also wore a belt with pouches and had dark colored pants with lashes of a dull orange. In addition, Gilas wore two electronic gauntlets, one on each wrist.\nGilas also carried two identical blaster pistols during the Jedi/Wookiee skirmish, one of which he lost after his skirmish with Jinx and Tano. He was relieved of the second pistol when he battled General Tarfful. Gilas was also known to utilize one of the guild's three hover pods for various occasions.\nCreated for the Star Wars: The Clone Wars television series, Gilas first appeared as a background character in the episode \"Padawan Lost\" before having a slightly expanded role in the subsequent episode \"Wookiee Hunt.\" Both episodes were aired on April 1, 2011, serving as the show's season three finale. Outside of some growling, Gilas does not speak in either episode, nor is he named on onscreen. However, Gilas was identified by name in \"Padawan Lost\"'s episode guide.\nLike all of the Trandoshans, Gilas was designed by concept artist Pat Presley. Gilas' stocky build was a result of of creating more varied body types for the Trandoshans to make them all physically unique from the more iconic Bossk, a Trandoshan that appeared earlier in the series. Coined by series lead Dave Filoni, Gilas' name is derived from two sources, the first being Angilas—more commonly known as Anguirus—, a character from the Godzilla franchise; and the second being the 1959 film The Giant Gila Monster.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gilas",
  "/wiki/Gilas/Legends",
  "/wiki/20_BBY",
  "/wiki/Wasskah",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Garnac%27s_hunting_guild",
  "/wiki/Big_game_hunter",
  "/wiki/Garnac",
  "/wiki/Standard_year",
  "/wiki/Sentience",
  "/wiki/The_galaxy",
  "/wiki/Moon",
  "/wiki/Hunting",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/O-Mer",
  "/wiki/Jinx",
  "/wiki/Chewbacca",
  "/wiki/Starship",
  "/wiki/Skirmish_on_Wasskah",
  "/wiki/Ubrikkian_floating_fortress",
  "/wiki/Wookiee",
  "/wiki/Soldier",
  "/wiki/General",
  "/wiki/Tarfful",
  "/wiki/Dar",
  "/wiki/Togruta",
  "/wiki/Pilot",
  "/wiki/MSP80_Pteropter_hover_pod",
  "/wiki/Island_Four",
  "/wiki/Ramy",
  "/wiki/Parent",
  "/wiki/Death",
  "/wiki/Kalifa",
  "/wiki/Youngling",
  "/wiki/Prisoner",
  "/wiki/Freighter",
  "/wiki/Clutch",
  "/wiki/Goron",
  "/wiki/Smug",
  "/wiki/Lagon",
  "/wiki/Ratter",
  "/wiki/The_Force",
  "/wiki/Force_push",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Blaster_pistol",
  "/wiki/Blaster",
  "/wiki/Transmitter",
  "/wiki/File:Dar_Dar_Dar.ogg",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Gauntlet",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Padawan_Lost",
  "/wiki/Wookiee_Hunt",
  "/wiki/April_1",
  "/wiki/2011",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Pat_Presley",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Dave_Filoni",
  "/wiki/1950s",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Databank_(website)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Category:Images_of_Gilas",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Second_Battle_of_Felucia",
  "/wiki/Star_Wars:_The_Clone_Wars:_Episode_Guide"
 ]
}