{
 "name": "Gillam Tarturi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Andara"
     ]
    },
    {
     "name": "Born",
     "values": [
      "42 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Leadership School"
     ]
    }
   ]
  }
 ],
 "content": "Gillam Tarturi was a Human male who was the son of Senator Berm Tarturi who represented the planet Andara and, at face value, the entire Andaran system in the Galactic Senate during the waning years of the Republic Classic era, before the Clone Wars.\nGillam resembled Anakin Skywalker in general height and build. He was the leader of a squad of young mercenaries that trained at the elite Leadership School of Andara. Other squad members included Marit Dice, Rolai Frac, Tulah, Hurana, and Ze.\nGillam was persuasive and charismatic, which was how he convinced the others to join his group. He believed that his father paid little attention to him, ignoring him to look after his Senatorial duties. During a mission on Ieria, he, along with his band, pretended to let Padawan Anakin Skywalker join the band. He then attempted to murder Skywalker, so that he could pin his kidnapping and death on his father, but Anakin single-handedly defeated all six mercenaries. When the Jedi and security arrived, Gilliam feigned innocence, claiming the Ierians kidnapped him. However, Ferus Olin, who he thought was a nosy student, had discovered a datapad containing his plan. The squad was expelled from the Leadership School and taken to Coruscant by Skywalker, Siri Tachi, Ferus Olin and Obi-Wan Kenobi for questioning, to sort out the lies, betrayals, and criminal activity that had occurred within the group.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Andara/Legends",
  "/wiki/42_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Leadership_School",
  "/wiki/Senator/Legends",
  "/wiki/Berm_Tarturi",
  "/wiki/Andaran_system",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Marit_Dice",
  "/wiki/Rolai_Frac",
  "/wiki/Tulah",
  "/wiki/Hurana",
  "/wiki/Ze",
  "/wiki/Ieria",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Ferus_Olin",
  "/wiki/Datapad/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Siri_Tachi/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Jedi_Quest:_The_School_of_Fear",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}