{
 "name": "Gita",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Beilert Valance's crew"
     ]
    }
   ]
  }
 ],
 "content": "Gita was a human female agent of the Rebel Alliance during the Imperial Era who originally hunted animals on the astronomical object Mytar. When a group of rebels wished to acquire arms from the Hidden Hand criminal syndicate, Gita went undercover as a Tusken Raider sniper named \"Urrr'k.\" As Urrr'k, Gita was recruited by the Hidden Hand's leader, Gwi, to be part of a team led by the cyborg bounty hunter Beilert Valance on a hunt for the Sith Lord Darth Vader.\nDuring her mission, Gita relayed information about her team to her rebel superior, Aeliar, allowing the Alliance to purchase arms from the criminal syndicate. While on their mission to the Outer Rim astronomical object Arvina, Gita protected fellow members of her team by providing long-range support and covering their escape, eliminating bandits and Imperial TIE fighters that pursued them. On the celestial body Heva, she manned the guns of Valance's cruiser, the Broken Wing, and engaged pursuing TIE fighters. When the ship landed, Gita and her team took on Vader but were defeated by the Sith Lord.\nAfter failing her mission and revealing her identity to Valance, Gita traveled to the rebel outpost on the jungle planet Lowik and resided there with Aeliar. The two allowed the people of Valance's homeworld, Chorin, to migrate to Lowik after the cyborg agreed to supply the rebels with weapons using the payment from their original mission to hunt down Vader. When Gita offered him a position in the Alliance, Valance refused and departed Lowik to resume bounty hunting.\nGita was a human female who was trained to hunt when she was young by a woman on the astronomical object Mytar. As Gita took aim at an animal during one hunting trip, the woman instructed her to take a deep breath and wait for the animal to buck. When Gita fired her sniper rifle and only injured the animal, the woman stated that the meat from the animal would spoil, as the creature would run until it bled out. Gita was told that they would be the ones hunted when in battle, and that she must shoot to kill only.\nGita worked as an undercover agent for the Rebel Alliance during the Imperial Era. At some point prior to the Battle of Hoth in 3 ABY, she disguised herself as a Tusken Raider sniper known as \"Urrr'k\" and attracted the attention of the Hidden Hand criminal syndicate. Gita was eventually discovered and recruited by Gwi, the leader of the syndicate, who was pretending to be a mere messenger for the organization, and Gita was inducted into a team tasked with hunting down and eliminating the Sith Lord Darth Vader. When recruiting the team's leader, the cyborg bounty hunter Beilert Valance, Gwi described the disguised rebel as a skilled sniper with mysterious origins. Along with Valance, Gita was also accompanied by so-called Jedi hunter droid Arr-Nine-Nineteen, Ardennian slicer Chio Fain, Gamorrean tracker Honnah, and the bounty hunter Dengar.\nAfter Valance met the team, Gita witnessed the destruction of Arr-Nine-Nineteen at the hands of the cyborg, who revealed that the droid was a Hutt Clan spy and a fake Jedi hunter. With the team fully assembled, the group embarked on its mission. Gita then contacted the rebel base within the Fellio Asteroid Belt in the Outer Rim and informed her superior, Aeliar, that her team had begun its mission. Gita's actions allowed the rebels to begin purchasing arms from the Hidden Hand, as Vader was preoccupied with hunting down the individuals attempting to assassinate him. Unbeknownst to Gita, Valance had deduced that she was no Tusken Raider, owing to the fact that Tuskens never left their homeworld of Tatooine.\nAboard Valance's cruiser, the Broken Wing, the team traveled to the astronomical object of Arvina in the Outer Rim, where the group contacted the Besalisk arms dealer Fetya in order to acquire weapons. Valance ordered Gita to stay behind and provide long-range support while the rest of the team met with the weapons dealer in Fetya's Hollow, a settlement in the area. In addition, although Valance stated that he did not trust her, he expressed confidence in Gita's skills as a sniper. When the deal with Fetya went sour and the Empire began attacking the settlement, Gita eliminated the Besalisk's associates and covered her team's escape, shooting down a number of TIE fighters in the process.\nDeparting Arvina, the team then traveled to a Hidden Hand outpost on the astronomical object Heva, contacting another arms dealer named Wef and requesting several bot-drones, weapons originally intended for use by the Empire that were abandoned due to their unstable technology. Using a pair of electrobinoculars, Gita observed the conversation between Wef, Dengar, and Honnah. Vader and his forces soon arrived aboard the Imperial II-class Star Destroyer Formidable; the Sith Lord had received information on the group's whereabouts from Dengar, his informant in the team.\nThe disguised rebel then accompanied Valance and Fain in the Broken Wing as they utilized the bot-drones to assault the Star Destroyer, with Gita manning the cruiser's laser cannons and engaging TIE fighters. However, Vader attacked the Broken Wing in his personal TIE Advanced x1 and knocked Gita out of her position. After Fain successfully destroyed the Star Destroyer with the bot-drones, Valance landed his damaged starship, and Gita fled the vessel with the others. Using the dust cloud that had formed to their advantage, the team took aim at Vader, who had landed and ignited his lightsaber.\nAlthough Valance ordered the team to stand by and await his signal, Fain and Honnah suddenly rushed toward Vader, with the former firing his blasters. When Vader deflected the blaster bolts, one of them shattered Gita's mask, while Valance was struck in the chest by another. With her face exposed, Gita then rushed to the injured Valance, revealing her true identity to the cyborg. As Valance prepared to intercept Vader, Gita witnessed the deaths of Fain and Honnah, much to her horror. Remembering what she was taught on Mytar, the sniper distracted Vader by shooting him but was then incapacitated by Vader's Force abilities. Gita's actions gave Valance enough time to dash toward the Sith and place an electro-pulse on his cape. However, Valance was paralyzed and captured when Dengar openly betrayed the team and electrocuted the cyborg.\nFollowing Valance's capture, Gita traveled to the rebel outpost on the jungle planet Lowik and returned to Aeliar. Sometime later, she suggested to Aeliar that she could resume her mission as Urrr'k again but was informed that the Hidden Hand had gone silent and that the rebels would therefore have to search for another weapons dealer. Hearing the news, Gita replied that no one would conduct deals with the Alliance. The two were then greeted by Valance, who had been freed by Vader. He displayed the location of a Hidden Hand outpost, claiming he knew where the rebels could find more weapons.\nAfter Valance headed toward the Hidden Hand's main outpost in an asteroid field, Aeliar voiced her concerns about trusting the cyborg. Gita stated they had no other option and assured her that Valance would get them the weapons they desired to fight the Empire. While Valance was at the outpost, the two rebels allowed the people of Chorin, Valance's homeworld, to seek refuge in the rebel base in return for the weapons Valance would supply to the Alliance. Thus, the immigrants avoided a massacre at the hands of the Empire. Following the cyborg's return, Gita offered Valance a position in the Rebellion. However, he refused and left to continue his bounty-hunting career, but not before supplying the rebels with the weapons he had promised using the payment from their failed mission to assassinate Vader. By around 3 ABY, Gita and Aeliar's position at Lowik was succeeded by Lieutenant Kondra.\nDuring her time as Urrr'k, Gita only spoke to her team in the Tusken language, conveying a stoic personality to them. Despite Beilert Valance not trusting the disguised rebel, Gita took notice of the cyborg's expertise in combat and later assured Aeliar that he was skilled in battle and could help the Rebel Alliance greatly. When inviting Valance to join them, Gita remarked to the cyborg that although he was not very smart, he was a brave warrior. Gita also believed in the Force, often using variations of the phrase \"May the Force be with you.\" Gita had black hair, blue eyes, and light skin.\nWith her hunting experience gained on Mytar, Gita was a skilled marksman, being able to take out targets with her sniper rifle from a long distance and shoot down TIE fighters by damaging their wings. When Gwi described the sniper to Valance, he stated that she could eliminate a target from half a planet away.\nAs a sharpshooter, Gita utilized a sniper rifle as her weapon of choice. While hunting on Mytar, she wore a light-colored outfit that covered her entire body except for her face. Gita later wore a Tusken Raider's outfit while undercover for the Rebel Alliance and used a pair of electrobinoculars to observe Wef, Honnah, and Dengar's conversation on Heva. After returning to Aeliar on Lowik, she donned a brown jacket with brown gloves and pants.\nGita made her debut as the Tusken Raider Urrr'k in the first issue of the 2019 comic-book series Star Wars: Target Vader, written by Robbie Thompson, illustrated by Marc Laming and Cris Bolson, and published by Marvel Comics on July 3, 2019. She was first revealed to be the rebel agent Gita in the series' fourth issue, which was also written by Thompson, illustrated by Stefano Landini, and published on October 9, 2019. The cover for Target Vader's first issue depicts a disguised Gita wielding a gaderffii stick. However, she is never seen using one in the series.\nPrior to the comic's release, the character was introduced indirectly via a mention of Valance's team by assistant editor Tom Groneman at a panel held at Star Wars Celebration Chicago in April 2019 that was later detailed in a StarWars.com article published on April 15.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Beilert_Valance%27s_crew",
  "/wiki/Imperial_Era",
  "/wiki/Hunting",
  "/wiki/Species",
  "/wiki/Mytar",
  "/wiki/Hidden_Hand",
  "/wiki/Tusken_Raider",
  "/wiki/Sniper",
  "/wiki/Gwi",
  "/wiki/Cyborg",
  "/wiki/Bounty_hunter",
  "/wiki/Beilert_Valance",
  "/wiki/Hunt_for_Vader",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Aeliar",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Arvina",
  "/wiki/Galactic_Empire",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Heva",
  "/wiki/Cruiser",
  "/wiki/Broken_Wing",
  "/wiki/TIE_line",
  "/wiki/Starfighter",
  "/wiki/Starship",
  "/wiki/Sith_Lord",
  "/wiki/Rebel_outpost_(Lowik)",
  "/wiki/Jungle",
  "/wiki/Planet",
  "/wiki/Lowik",
  "/wiki/Homeworld",
  "/wiki/Chorin",
  "/wiki/Bounty",
  "/wiki/Unidentified_female_(Mytar)",
  "/wiki/Sniper_rifle",
  "/wiki/Foodstuff",
  "/wiki/Blood",
  "/wiki/Death",
  "/wiki/Battle_of_Hoth",
  "/wiki/3_ABY",
  "/wiki/Jedi_hunter",
  "/wiki/Droid",
  "/wiki/Arr-Nine-Nineteen",
  "/wiki/Ardennian",
  "/wiki/Slicer",
  "/wiki/Chio_Fain",
  "/wiki/Gamorrean",
  "/wiki/Honnah",
  "/wiki/Dengar",
  "/wiki/Hutt_Clan",
  "/wiki/Spy",
  "/wiki/Jedi",
  "/wiki/Rebel_base_(Fellio_Asteroid_Belt)",
  "/wiki/Fellio_Asteroid_Belt",
  "/wiki/Assassin",
  "/wiki/Tatooine",
  "/wiki/Besalisk",
  "/wiki/Arms_dealer",
  "/wiki/Fetya",
  "/wiki/Fetya%27s_Hollow",
  "/wiki/Heva_Hidden_Hand_outpost",
  "/wiki/Wef",
  "/wiki/Bot-drone",
  "/wiki/Electrobinoculars",
  "/wiki/Imperial_Military",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Formidable",
  "/wiki/Drone",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Laser_cannon",
  "/wiki/Darth_Vader%27s_TIE_Advanced",
  "/wiki/Star_Destroyer",
  "/wiki/Darth_Vader%27s_lightsaber",
  "/wiki/Blaster",
  "/wiki/Force_power",
  "/wiki/Time",
  "/wiki/Sith",
  "/wiki/Electro-pulse",
  "/wiki/Cape",
  "/wiki/Hidden_Hand_asteroid_base",
  "/wiki/Asteroid_field",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Lieutenant",
  "/wiki/Kondra",
  "/wiki/Tusken",
  "/wiki/Language",
  "/wiki/The_Force",
  "/wiki/May_the_Force_be_with_you",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Rifle",
  "/wiki/Clothing",
  "/wiki/Jacket",
  "/wiki/Glove",
  "/wiki/Target_Vader_1",
  "/wiki/2019",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Target_Vader",
  "/wiki/Robbie_Thompson",
  "/wiki/Marc_Laming",
  "/wiki/Cris_Bolson",
  "/wiki/Marvel_Comics",
  "/wiki/July_3",
  "/wiki/Target_Vader_4",
  "/wiki/Stefano_Landini",
  "/wiki/October_9",
  "/wiki/Gaderffii_stick",
  "/wiki/Tom_Groneman",
  "/wiki/Celebration_Chicago",
  "/wiki/April",
  "/wiki/StarWars.com",
  "/wiki/April_15",
  "/wiki/Category:Images_of_Gita",
  "/wiki/Target_Vader_2",
  "/wiki/Target_Vader_3",
  "/wiki/Target_Vader_5",
  "/wiki/Target_Vader_6",
  "/wiki/Bounty_Hunters_7",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Empire_Ascendant_1",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Bounty_Hunters",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Standard_year"
 ]
}