{
 "name": "Gizda Ramani",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue-green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Gizda Ramani was a Human female from Coruscant who served as a pilot for the Alliance to Restore the Republic during the time of the Galactic Civil War. Sometime following the Battle of Yavin in 0 BBY, Pooja Naberrie tasked a spacer with locating Ramani and escorting her back to the city of Dee'ja Peak on Naboo. Although the spacer was attacked by Imperial Army troopers, Naberrie's mission was completed.\nGizda Ramani was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011.\nPlayers who performed a series of quests for Pooja Naberrie had to locate Ramani and escort her safely back to Dee'ja Peak. According to a forum guide on the official Star Wars Galaxies discussion board, the quest to escort Ramani was bugged due to an inability to converse with the NPC. As a workaround, the guide recommended allowing the Imperial troopers to kill Ramani, so that the player could advance to the next quest. This article does not assume this outcome to be canon in the Star Wars Legends continuity, as Naberrie specifically requested that Ramani be safely escorted.\nBecause Gizda Ramani spawned under the generic \"rebel_trooper\" template, her appearance was randomized under one of six possible depictions. She could appear as a female Twi'lek, male Twi'lek, male Bith, male Sullustan, Human male, or as a Human female. Because the quest dialogue identified Ramani as a Human female, this article assumes that the Human female depiction is canon in the Star Wars Legends continuity. The questline that involved Ramani was eventually removed from the game when Pooja Naberrie was relocated to Theed as part of the newly introduced Legacy Quest, released as part of Publish 25's New Game Enhancements on November 15, 2005.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Pooja_Naberrie/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/City/Legends",
  "/wiki/Dee%27ja_Peak/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Imperial_Army_trooper/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Death/Legends",
  "/wiki/Canon",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Bith/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Theed/Legends",
  "/wiki/November_15",
  "/wiki/2005"
 ]
}