{
 "name": "Gizman",
 "display_name": "Gizman",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Moggonite hybrid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Gizman, better known by the nickname Big Gizz, was the leader of Jabba Desilijic Tiure's swoop gang just prior to Jabba's death. He was a gargantuan Moggonite hybrid standing nearly three meters tall. He was very muscular, had orange skin, and long, curly hair. His facial features exhibited distinctly nonhuman characteristics, such as sharpened teeth and a swine-like snout. During the Clone Wars, he joined with the Jedi Nuru Kungurama and Breakout Squad. Years later, he was part of Jabba's criminal empire and outlasted the Hutt. He and his swoop biker partner Spiker joined with Onoh and formed their own partnership.\nGizman, known as Gizz or Big Gizz, was a tall, male humanoid of Moggonite origin. He had orange skin, and by the time of the Clone Wars, was muscular and kept his hair in a ponytail, and had rings in his nose and ears. In 22 BBY, he was on the planet Vaced and rode his swoop bike with a gang. When the Chiss Jedi Nuru Kungurama arrived on Vaced, he pursued a Mandalorian sniper. The sniper dropped a thermal detonator and destroyed Gizz's swoop bike, who then jumped on the Jedi's bike. In the pursuit, Gizz was knocked out. Kungurama convinced his clone trooper force, Breakout Squad, to bring the unconscious Gizz with them, saving him from jail at the hands of the Vaced Spaceport authorities. Gizz then helped Breakout Squad fight to save Bilbringi Depot from the Techno Union.\nGizz then joined Breakout Squad on the trip back to Coruscant. The captured Overseer Umbrag faked a medical emergency to grab Kungurama and hold him hostage. The overseer shot Gizz with a concealed gauntlet blaster, knocking the big man out. Once on Coruscant, Kungurama and the Jedi Master Harro Kelpura went to Kelpura's lab in the Dacho District to respond to a break-in. Their freighter was impacted by the bounty hunter Cad Bane's dropship and crashed. Gizz left a dent in the bulkhead. He awakened in time to help the young Jedi confront his missing master, Ring-Sol Ambase. Gizz held a blaster at the Jedi Master while Kungurama talked him down. Ambase had been wounded in the confrontation and soon collapsed. Five days later, Gizz joined Breakout Squad in their barracks after grabbing ribs from a waitress in the CoCo Town, and was present when Grand Master Yoda assigned the clone squad to investigate the disappearance of the Spice Siren.\nGizz and Kungurama soon formed a close bond. After Kungurama was assigned another mission, Kungurama found Gizz in Dex's Diner, flirting with the waitress Hermione Bagwa. Gizz walked out after Bagwa insinuated that he couldn't read, but cheered up when Kungurama invited him on the mission. Together with Breakout Squad, they traveled to Affa in a Nu-class shuttle. There they discovered the remains of a massacre, but continuend their mission: escorting Noggox the Hutt's freighters to the Fondor Shipyards. Once at the shipyards, they defeated the Neimoidian pirate Dool Pundar. On the surface, they met a blind Twi'lek, Kuvuta Pindi. She was escorting a group of orphaned younglings to Foless. During the trip, the younglings ran wild in the shuttle, and eventually Gizz, fed up with them, stuffed Charky into a storage closet. On Foless, Breakout Squad and the younglings parted ways, but Gizz and Kungurama realized their was something wrong when the blind Twi'lek identified a specifically colored airbus. Gizz and Kungurama stole two swoops from the Spaceport Authority officers and chased after the bus. They forced it to stop and saw that Pindi was working with Pundar to kidnap the young ones. Pindi ran off and Gizz pursued her into an area marked \"danger.\" Pindi almost shot Gizz, but was eaten by a creature first. Breakout Squad then returned to Coruscant, and Gizz was treated to a hero's dinner at Dex's Diner.\nBig Gizz, while on the town with his buds one day in 3 ABY, was challenged by a mysterious biker, Jix, in Mos Eisley. When Jix cheated in the bike match, Gizz was impressed with his willingness to cheat. When Prince Xizor contacted Jabba about killing Luke Skywalker, Jabba gave the task to Big Gizz and his partner, Spiker. Unknown to Gizz, however, was that Jix was an Imperial agent working for Darth Vader, assigned to ensure Skywalker's survival.\nJix and Gizz's gang headed for Jabba's headquarters. Jabba was in the middle of breakfast when the bikes burst into his throne room. Jabba just got a transmission that interfered with Jix's instructions. Following Jabba's orders, the swoop gang attacked Luke, who was staying in Obi-Wan Kenobi's home near the Dune Sea. With the help of Dash Rendar, Luke was able to outmaneuver the swoop riders in Beggar's Canyon. Gizz was hurt, had a broken leg and had a talk to Jix about finishing one's job and how he had a clear view of Skywalker. This would be his undoing, for Luke and Dash were leaving the battle, before he could fire, Jix sneaked up behind him and smashed a rock into his head. Big Gizz collapsed then and there, bloody and left for dead.\nFollowing the debacle in Beggar's Canyon, Big Gizz was eventually found by the B'omarr monks, who provided him a medical aid. After undergoing surgery and cranial reconstruction, he was given a metal plate to wear for protection; its only downside was that it intermittently picked up comlink and other signals from nearby. Gizz would eventually go to Citadel of B'omarr on Tatooine, where he met Spiker—who had believed Gizz to be dead.\nGizz told his companion that Jix had tried to kill him, and that the Human was a spy for Darth Vader. The two left the B'omarr Citadel deciding it would best if they were freelancers. Gizz had heard of an old storehouse of Jabba's in the nearby Glass Mountain, where Jabba supposedly stored a well-armed ship for escape purposes. They hatched a plan to steal the ship and become pirates in the local star systems.\nWhen they reached Glass Mountain, they found they had been beaten to the punch by a group of thugs employed by Gorga Desilijic Aarrpo, Jabba's nephew. The bikers made short work of the thugs, however, and rescued a Lizling named Onoh, who had been posted by Jabba to safeguard Glass Mountain several years prior. Gorga's men had already opened the hangar and prepared the secret ship, Spirit of Jabba, for take off, leaving little additional work for the swoop bikers. Onoh initially objected to their boarding the ship, though his resistance subsided when they informed him that Jabba had been killed. Gizz and Spiker found the ship to be very well-stocked and fitted with numerous weapons that they hoped would help them carve out a piece of the Outer Rim for themselves. They also decided to take Onoh on as a member of their pirate crew.\nOne of Gorga's henchmen had survived and alerted the Hutt to the events, though Gizz and Spiker were able to fly the ship into space and open up a good lead on Gorga's pursuing enforcers. However, an interactive security tape—the \"Jabba Tape\"—kicked in, immobilizing the ship until the security clearance code was submitted. The tape also began draining oxygen from the ship's bridge, and closed off all exits, estimating that they had approximately four minutes left to live. While all this was happening, one of Gorga's ships caught up with the would-be pirates. Gizz was able to pick up transmissions on his skull plate, telling them to surrender. The ship fired several shots at Spirit of Jabba, damaging it severely but also ripping apart a bulkhead and allowing Gizz, Spiker and Onoh to escape the oxygen-deprived bridge.\nWith the artificial gravity disabled, Gizz and Spiker could do little but float aimlessly around the bridge, and were unable to reply to Gorga's ship's transmissions and warnings, because the Jabba Tape was blocking communications. Eventually, Onoh revealed that he knew the override code, and the bikers were able to deactivate the tape and announce their surrender to Gorga's ship. The other vessel escorted them down toward Mos Eisley, though when Gizz's skull plate picked up a transmission from Gorga announcing that Gizz and his companions would be killed when they reached the surface, they decided they would not be quite so cooperative. Gizz felt they would have a decent chance of evading the other ship if they could lighten their load, so Spiker and Onoh ventured into the cargo hold and began preparing much of the ship's provisions to be let loose onto Gorga below. They attempted to flee in Spirit of Jabba, but Gorga's ship was able to disable them, and they crashed-landed in the desert, kilometers from the nearest settlement.\nDespite astronomical odds, an Imperial dark trooper that had fought against Rebel forces survived on board a Rebel ship that crash-landed on Tatooine almost 3 years prior. Now Jawas discovered the wreck—and the dark trooper. While sleeping in the Mos Espa Grand Arena, Spiker and Big Gizz were awakened by the arrival of the Jawas' sandcrawler, whose crew had been slaughtered by the dark trooper. Upon further investigation, Big Gizz and Spiker discovered the terrifying machine as well.\nAfter a heated battle in which both nearly died, the dark trooper was defeated, if only because of its age and wear. Spiker and Big Gizz rode away from its remains,\ntheir future uncertain.\nBig Gizz was a swoop biker. On Vaced, he joined in the pursuit of a Mandalorian not because the Mandalorian's thermal detonator had killed the swoop gang Gizz traveled with, but because it had destroyed his swoop. He enjoyed fighting and despised pirates. Gizz also enjoyed flirting with women of any species. He also formed close bonds with his swoop gang members, such as Spiker.\nThe Rebellion Era Sourcebook states that Big Gizz is a Human. However, the more recent source The Essential Reader's Companion identifies Gizz as being of a Moggonite hybrid.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Moggonite/Legends",
  "/wiki/Hybrid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Nuru_Kungurama",
  "/wiki/Breakout_Squad",
  "/wiki/Standard_year/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Spiker",
  "/wiki/Onoh",
  "/wiki/Humanoid/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nose/Legends",
  "/wiki/Ear/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Vaced/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Mission_to_Vaced",
  "/wiki/Mandalorian/Legends",
  "/wiki/Sniper/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Vaced_Spaceport",
  "/wiki/Bilbringi_Depot",
  "/wiki/Techno_Union/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Overseer_(CIS)",
  "/wiki/Umbrag",
  "/wiki/Blaster/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Harro_Kelpura",
  "/wiki/Dacho_District",
  "/wiki/Freighter/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cad_Bane/Legends",
  "/wiki/Sleight_of_Hand",
  "/wiki/Ring-Sol_Ambase",
  "/wiki/Barracks/Legends",
  "/wiki/CoCo_Town/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Spice_Siren/Legends",
  "/wiki/Dex%27s_Diner/Legends",
  "/wiki/Hermione_Bagwa/Legends",
  "/wiki/Affa/Legends",
  "/wiki/Nu-class_attack_shuttle",
  "/wiki/Noggox",
  "/wiki/Fondor_Shipyards/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Dool_Pundar",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Kuvuta_Pindi",
  "/wiki/Youngling/Legends",
  "/wiki/Foless/Legends",
  "/wiki/Charky",
  "/wiki/Airbus/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Wrenga_Jixton",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Ben_Kenobi%27s_hut",
  "/wiki/Dune_Sea/Legends",
  "/wiki/Dash_Rendar/Legends",
  "/wiki/Beggar%27s_Canyon/Legends",
  "/wiki/B%27omarr_Order/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Citadel_of_B%27omarr",
  "/wiki/Glass_Mountain",
  "/wiki/Starship/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Gorga_Desilijic_Aarrpo/Legends",
  "/wiki/Lizling",
  "/wiki/Hangar/Legends",
  "/wiki/Spirit_of_Jabba",
  "/wiki/Realspace/Legends",
  "/wiki/Oxygen/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Gravity/Legends",
  "/wiki/Dark_trooper",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Mos_Espa_Grand_Arena/Legends",
  "/wiki/Sandcrawler/Legends",
  "/wiki/Special:EditPage/:Gizman",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/Human/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Clone_Wars:_Secret_Missions_3:_Duel_at_Shattered_Rock",
  "/wiki/The_Clone_Wars:_Secret_Missions_4:_Guardians_of_the_Chiss_Key",
  "/wiki/The_Clone_Wars:_Opress_Unleashed",
  "/wiki/The_Clone_Wars:_Strange_Allies",
  "/wiki/Star_Wars_Missions_10:_Showdown_in_Mos_Eisley",
  "/wiki/West_End_Games",
  "/wiki/Just_Another_Day%27s_Work",
  "/wiki/Shadows_of_the_Empire_Sourcebook",
  "/wiki/Shadows_of_the_Empire_2",
  "/wiki/Shadows_of_the_Empire_3",
  "/wiki/Shadows_of_the_Empire_4",
  "/wiki/The_Mandalorian_Armor",
  "/wiki/The_Jabba_Tape",
  "/wiki/Sand_Blasted",
  "/wiki/Star_Wars_Tales_4",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Horse%27s_Mouth",
  "/wiki/Star_Wars_Insider_29",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Around_the_Galaxy",
  "/wiki/Star_Wars_Galaxy_Magazine_6",
  "/wiki/The_Secrets_of_Star_Wars:_Shadows_of_the_Empire",
  "/wiki/1996_Topps_Star_Wars:_Shadows_of_the_Empire",
  "/wiki/Star_Wars:_The_Art_of_the_Brothers_Hildebrandt",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Casting_Shadows",
  "/wiki/Star_Wars_Galaxy_Magazine_7",
  "/wiki/Star_Wars:_Panel_to_Panel_Volume_2:_Expanding_the_Universe",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Shadows_of_the_Empire_(comics)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Secret_Missions"
 ]
}