{
 "name": "Gizor Dellso",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Geonosis"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 17 BBY and 12 BBY",
      "Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Geonosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems",
      "Separatist holdouts"
     ]
    }
   ]
  }
 ],
 "content": "Gizor Dellso was a Geonosian engineer who worked for the Confederacy of Independent Systems during the Clone Wars against the Galactic Republic. Years before the war began, he helped design a command signal that would shut down the Trade Federation's droid army to prevent anyone from ever using their droids against them. At war's end, the same signal was ultimately used to deactivate the defeated Separatist Droid Army.\nAlthough the Republic triumphed over the Separatists in the Clone Wars, Dellso refused to surrender. On the planet Mustafar, he reactivated a hidden droid factory near a former Separatist mining facility and began building his own private droid army, hoping to restart the war. However, the Imperial 501st Legion was sent to Mustafar to eliminate Dellso and end his rebellion, resulting in the fugitive Geonosian's death and the destruction of the droid factory.\nGizor Dellso was a Geonosian male who hailed from the planet Geonosis. At the behest of the Trade Federation, he served as one of the engineers who constructed a signal override apparatus that would shut down the conglomerate's droid army in case enemies ever attempted to turn the droids against their masters. Years later, Dellso joined the Confederacy of Independent Systems along with his people and participated in the Clone Wars against the Galactic Republic. The war ended when the Separatist Droid Army was shut down by the same signal that Dellso had helped design, which spread through the Separatist fleet via the HoloNet.\nDetermined to continue the fight against the Galactic Empire, the Republic's post-war successor state, the fugitive Dellso holed up inside a former Separatist mining facility on the planet Mustafar—the same fortress where the Sith Lord Darth Vader had slaughtered the Separatist Council at the end of the war. Possessing stolen dataplans for an experimental Imperial starfighter, Dellso needed protection while he planned his next move. He reactivated a hidden droid factory near the mining facility and began producing new battle droids that he intended to use as his own private army. Intimately familiar with the parameters of the droid deactivation device he had helped design, Dellso managed to countermand the shut-down signal. He also built prototypes of a new battle droid in the hopes of resurrecting the Separatist army.\nSometime between 17 BBY and 12 BBY, the Empire became aware of the threat that Dellso posed, and his location on Mustafar was discovered by Darth Vader. Seeking to end the rebellion before it could develop into a full-fledged war, Vader dispatched the elite 501st Legion of stormtroopers to eliminate Dellso and destroy his droid army. In space over Mustafar, Dellso's fleet confronted the Imperials, and his droid forces began boarding the 501st's Star Destroyer. However, the 501st repelled the boarders, destroyed a number of droid starfighters, crippled a Providence-class carrier/destroyer, and stole a Belbullab-24 strike bomber.\nThe 501st then landed on the planet and stormed the mining facility, where Dellso's army fought to fend off the stormtroopers and keep his rebellion alive, while the Imperials were determined to prevent the Clone Wars from reoccurring. After the 501st destroyed his prototype battle droid schematics, Dellso personally entered the fray, accompanied by other armed Geonosians and battle droids. Dellso rained fire down upon the Imperials with a Bulldog RLR, but the 501st ultimately overwhelmed his forces and killed the fugitive Geonosian by blasting him. The Empire then bombarded Mustafar from space, destroying both the mining facility and Dellso's factory—and with it the last stubborn remains of the droid army.\nMany of the 501st Legion's early missions remained classified for decades until some of its members' datapad journals emerged. One retired clone trooper recorded the 501st's mission to Mustafar, including the termination of Gizor Dellso and his failed droid insurrection.\nGizor Dellso was an engineer who helped design the signal override apparatus for the Trade Federation Droid Army. A Separatist stalwart, the fugitive Dellso refused to surrender after the destruction of the Separatist Council at the end of the Clone Wars and made a failed bid to resurrect the droid rebellion in the early days of the Galactic Empire. A winged Geonosian, Dellso had brown skin and dark eyes.\nGizor Dellso wielded a Bulldog RLR with a chassis akin to the Geonosian sonic blaster during the battle on Mustafar.\nGizor Dellso was created for the 2005 video game Star Wars: Battlefront II, developed by Pandemic Studios and published by LucasArts. Dellso features as the final objective in the two-part Mustafar mission, titled \"Preventive Measures\" and \"Tying up Loose Ends,\" as part of the game's \"Rise of the Empire\" campaign.\nIn Star Wars: Battlefront II and the Star Wars Battlefront II: Prima Official Game Guide, the character's name is spelled \"Gizor Delso,\" while the guide additionally misspells his last name as \"Delsa\" in multiple instances. However, beginning with the StarWars.com Databank, all subsequent sources spelled his name as \"Gizor Dellso.\" The game also provides two different pronunciations for the character's name, spoken by the game's clone trooper narrator and an Imperial trooper over comlink during the Mustafar mission.\nUnlike other Geonosians in Battlefront II, Dellso's in-game model does not feature wings while he is on the ground; however, his wings can be seen while he is flying. Additionally, Dellso's sidearm appears as a Geonosian sonic blaster, but it operates as a Bulldog RLR, firing rockets. While Battlefront II and its game guide explicitly task the player with killing Dellso, the StarWars.com Databank and The Complete Star Wars Encyclopedia entries for the 501st Legion alternatively stated that the 501st traveled to Mustafar to capture the rogue Geonosian.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Geonosian/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Cingulon",
  "/wiki/Technician",
  "/wiki/Dellso_Prin",
  "/wiki/Geonosis/Legends",
  "/wiki/17_BBY/Legends",
  "/wiki/12_BBY/Legends",
  "/wiki/Mustafar/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Separatist_holdouts/Legends",
  "/wiki/File:GizorDellso1.ogg",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Trade_Federation_Droid_Army/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Mission_to_Mustafar/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Gizor_Dellso%27s_droid_foundry",
  "/wiki/Klegger_Corp_Mining_Facility/Legends",
  "/wiki/Gizor_Dellso%27s_army",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Battle_of_Mustafar_(Imperial_Period)",
  "/wiki/Death/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Factory/Legends",
  "/wiki/File:GizorDellso2.ogg",
  "/wiki/Homeworld/Legends",
  "/wiki/Confederate_Navy",
  "/wiki/HoloNet/Legends",
  "/wiki/Fortress/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Separatist_Council",
  "/wiki/Thief/Legends",
  "/wiki/Dataplan",
  "/wiki/Starfighter/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Army/Legends",
  "/wiki/Confederate_infantry_prototype",
  "/wiki/File:GizorDellso3.ogg",
  "/wiki/Darth/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Gizor_Dellso%27s_navy",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Droid_starfighter/Legends",
  "/wiki/Providence-class_carrier/destroyer",
  "/wiki/Belbullab-24_strike_bomber",
  "/wiki/Bulldog_RLR",
  "/wiki/Blaster/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Legion/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Retired_clone_trooper",
  "/wiki/501st_Journal",
  "/wiki/Standard_day/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Geonosian_sonic_blaster/Legends",
  "/wiki/2005",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Battlefront_II",
  "/wiki/Pandemic_Studios",
  "/wiki/LucasArts",
  "/wiki/File:GizorDellso4.ogg",
  "/wiki/Star_Wars_Battlefront_II:_Prima_Official_Game_Guide",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Sonic_blaster/Legends",
  "/wiki/Missile/Legends",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Category:Images_of_Gizor_Dellso",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/19_BBY/Legends",
  "/wiki/Kamino_uprising",
  "/wiki/The_Essential_Atlas",
  "/wiki/Galactic_Standard_Calendar"
 ]
}