{
 "name": "Glah Ubooki  (alias)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bimmisaari"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bimm"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ubooki brothers"
     ]
    }
   ]
  }
 ],
 "content": "\"Glah Ubooki\" was an alias used by eighteen members of the Ubooki brothers who owned and operated the series of shops known as Glah Ubooki's Strange \u0026 Wondrous Imports.\n\"Glah Ubooki\" was in reality not one person, but a character \"played\" by eighteen Bimm brothers. The original Glah Ubooki once happened upon a crashed Imperial R\u0026D vessel and found several Imperial prototype weapons. He contacted seven of brothers and together they managed to salvage most of the valuable material in the wreckage before Imperial salvage vessels arrived. The following day, they sold the salvaged goods to a Rebel operative, who paid them a large amount of credits.\nThe Ubooki brothers decided to invest the money in a starship and explore locals systems in search of rare finds and treasures. The brothers acquired much Rebel and Imperial material in and around the Saari Ha system, which they stole from Imperial and Rebel installations. Taking advantage of battles and bombardments, the Ubooki brothers would simply sneak into the installation in question and make off with data, secrets, equipment and other valuables. The brothers would usually wait a few weeks and then take the goods to markets far away from the places where the installations were situated, and sell them off. They would often end up selling stolen goods back to unknowing representatives of the faction they were originally stolen from.\nThe Ubooki brothers were never seen together, and each of them would always introduce himself as \"Glah Ubooki.\" This was originally a tactic to confuse bounty hunters and other agents. Their business was so successful that eventually, pirates, mercenaries, and fringers would sell or donate items to Glah Ubooki. As a result of the continuing success, the Ubooki brothers opened several shops on several planets, including Bimmisaari, Tatooine and Coruscant, keeping up the tradition of each brother referring to himself as \"Glah Ubooki.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bimmisaari/Legends",
  "/wiki/Bimm_(Near-Human)",
  "/wiki/Gender/Legends",
  "/wiki/Ubooki_brothers",
  "/wiki/Glah_Ubooki%27s_Strange_%26_Wondrous_Imports",
  "/wiki/Glah_Ubooki",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Unidentified_Imperial_R%26D_vessel",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Unidentified_Rebel_smuggler",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Starship/Legends",
  "/wiki/Saari_Ha_system",
  "/wiki/Standard_week/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Fringer",
  "/wiki/Tatooine/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Glah_Ubooki%27s_Strange_%26_Wondrous_Imports_(article)",
  "/wiki/Star_Wars_Adventure_Journal_1"
 ]
}