{
 "name": "Glahst_Ombra",
 "display_name": "Glahst Ombra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3 ABY",
      "Skako Minor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Defel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Son-tuul Pride"
     ]
    }
   ]
  }
 ],
 "content": "Glahst Ombra was a female Defel mercenary who was hired by the Son-tuul Pride criminal syndicate to undertake a mission to recover the memories of the syndicates leader, 0-0-0, around 3 ABY. Whilst on Skako Minor, Ombra and the others were almost captured by an Imperial trap until their leader Chelli Aphra detonated an explosive Tooka on them. As they searched the workshop of Wat Tambor, the mercenaries were attacked by more Imperial forces, led by Magna Tolvan. When a Chthonic worm god awoke and attacked them, Ombra abandoned them others and fled. However, Tolvan caught up with her and killed her, using her skin as a disguise to get off Skako Minor with the rest of the mercenaries.\nAround 3 ABY, Glahst Ombra joined a crew of mercenaries led by Doctor Chelli. It comprised an assortment of bounty hunters hired by the Son-tuul Pride to recover their leader's memories. They included: the cyborg Rexa Go; the former Milvayne Authority Officer Tam Posla; Posla's cyborg soulmate Caysin Bog; the Skakoan guide Hallio Bas; the Xexto assassin Sister Six; the swordsman Violet Prince; and Aphra's first generation Droideka Dek-Nil. Before the crew could depart Son-tuul, Aphra left the Violet Prince to hold off Imperial forces that were investigating the spaceport.\nAphra took the crew to Skako Minor to investigate the workshop of Wat Tambor. Bas guided them to the entrance, hailing Wat Tambor and the Techno Union along the way. When they arrived, however, an Imperial patrol awaited. Bas revealed himself to be the traitor and demanded his side of the deal, which the Imperials refused. Aphra gave him her Tooka, Flufto, instead. The Skakoan raised it to the air in front of the Imperials and Aphra said a code-phrase, which made it explode. While Aphra opened her crate to pick out another Tooka—shrink-frozen and also modified to explode upon hearing a code-phrase—Ombra conversed within the trees. As a surviving stormtrooper shoved past Posla and Bog, Ombra attacked them as they entered the tree line and began feasting on their body.\nThe crew entered the workshop, where many artifacts lay. Aphra began looking through the data base for her superior's memories when the mercenaries were interrupted by a Delta-class T-3c shuttle, which smashed through the roof. A squad of stormtroopers, led by Lieutenant-Inspector Magna Tolvan, were then dispatched from the shuttle and open fired. Matters were made worse as the shuttles arrival had sprung another trap, the Chthonic worm god. The beast attack the two sides and Ombra used her cloaking ability to escape, leaving the others behind. In Ombra's absence, the beast wiped out Tolvan's forces, but was killed in the process. Tolvan escaped and found Ombra, killing her upon the encounter. She then skinned Ombra's body and wore it and the Defel's clothing as a disguise to blend in with Aphra's crew and get off of Skako Minor.\nAphra took her crew to the rebel flight school Lucrehulk Prime to capture their general, Hera Syndulla. There, Tolvan used Ombra's hide to sneak away and returned to Aphra when she was being held in the brig. Tolvan confronted Aphra and she realized that she had skinned Ombra, being shocked at this concept. Tolvan continued to use Ombra's hide and clothing while she hid in the vents of Lucrehulk Prime, eventually taking the opportunity to briefly capture the ship's control core. When Aphra sent Posla to retrieve Tolvan later on, the Imperial attacked the ex-lawman and stole his attire, leaving the mercernary gagged and in Ombra's cloak.\nGlahst Ombra was a female Defel with brown hair, orange eyes, and sharp teeth. Aphra described her as passive-aggressive, as well as sarcastic. Ombra used her cloaking ability to get her out of dangerous situations, even if it meant abandoning her comrades.\nGlahst Ombra could smell out even the smallest drop of blood from up to six miles away. Her fur could also bend light to make her almost disappear. Ombra's sharp teeth meant she could feast on fresh bodies, like she did to a stormtrooper on Skako Minor.\nGlahst Ombra first appeared in the canon comic Doctor Aphra  15, written by Simon Spurrier and penciled by Emilio Laiso.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/3_ABY",
  "/wiki/Skako_Minor",
  "/wiki/Defel",
  "/wiki/Gender",
  "/wiki/Son-tuul_Pride",
  "/wiki/Mercenary",
  "/wiki/0-0-0",
  "/wiki/Mission_to_Skako_Minor_(Son-tuul_Pride)",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Tooka",
  "/wiki/Wat_Tambor%27s_workshop",
  "/wiki/Wat_Tambor",
  "/wiki/Magna_Tolvan",
  "/wiki/Chthonic_worm_god",
  "/wiki/Death",
  "/wiki/Doctor",
  "/wiki/Cyborg",
  "/wiki/Rexa_Go",
  "/wiki/Milvayne_Authority",
  "/wiki/Officer",
  "/wiki/Tam_Posla",
  "/wiki/Caysin_Bog",
  "/wiki/Skakoan",
  "/wiki/Hallio_Bas",
  "/wiki/Xexto",
  "/wiki/Assassin",
  "/wiki/Sister_Six",
  "/wiki/Rabael_Dir_Glorio",
  "/wiki/Droideka",
  "/wiki/Dek-Nil",
  "/wiki/Son-tuul_Spaceport",
  "/wiki/Techno_Union",
  "/wiki/Flufto",
  "/wiki/Stormtrooper",
  "/wiki/Delta-class_T-3c_shuttle",
  "/wiki/Lieutenant-Inspector",
  "/wiki/Shuttle",
  "/wiki/Clothing",
  "/wiki/Lucrehulk_Prime",
  "/wiki/Capture_of_Hera_Syndulla",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Brig",
  "/wiki/Color",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Doctor_Aphra_(2016)_15",
  "/wiki/Simon_Spurrier",
  "/wiki/Emilio_Laiso",
  "/wiki/Doctor_Aphra_(2016)_16",
  "/wiki/Doctor_Aphra_(2016)_17",
  "/wiki/Doctor_Aphra_(2016)_18",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Databank_A-Z",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Accresker_Jail",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Crimson_Reign_3",
  "/wiki/Jeremoch_Colton",
  "/wiki/Wreckage-prison",
  "/wiki/Standard_year",
  "/wiki/The_Archivist",
  "/wiki/Prisoner",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Doctor_Aphra_(2016)_19"
 ]
}