{
 "name": "Glasfir'a'lik",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Defel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Glasfir Ring"
     ]
    }
   ]
  }
 ],
 "content": "Glasfir'a'lik, called Glasfir for short, was a Defel crime lord who effectively controlled the planet Demesel.\nGlasfir first came to Demesel while under the employ of Hutt crime lords. Feeling betrayed by his masters over a payment dispute, Glasfir engaged on a three-year campaign of revenge against every Hutt agent on Demesel. Soon, he was one of the most powerful and feared criminals on the planet, and since his former employers had posted a 60,000 credit bounty on his head, Glasfir had little recourse but to stay on Demesel. Within a few months, he had eliminated or frightened away all serious competition, and came to rule Demesel's underworld.\nCrime skyrocketed on Demesel, and the local authorities' attempts to subvert his organization failed. Glasfir used terror tactics to decrease the populace's faith in their government, and gave the Thalassian Slavers' Guild safe harbor at Demesel.\nSince Defel were so rare in the galaxy that average citizens had usually never even heard of them, Glasfir became notorious on Demesel for his brutal nature and mysterious abilities. Superstitions arose around the \"monster\" who ruled Demesel's underground; in reality, Glasfir was little more than a petty thug who used bullying and his species' uniqueness to his advantage.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Defel/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Glasfir_Ring/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Demesel/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Bounty/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Thalassian_Slavers%27_Guild",
  "/wiki/Galaxy_Guide_11:_Criminal_Organizations",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}