{
 "name": "Glaucus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Octero IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Octeroid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Glaucus was a Octeroid male who was also known by the nicknames \"Big Guy\" and \"Big Eye\". In 10 BBY, Glaucus spent time watching matches of sabacc in the Lodge on the planet Vandor and witnessed matches between the smugglers Han Solo and Lando Calrissian. He preferred spectating to playing as other players could see his card values reflected in his eye.\nIn the year 10 BBY, the Octeroid male Glaucus spent time in the establishment known as the Lodge in Fort Ypso on the planet Vandor. While there he was one of many patrons who crowded around a table in the back room to watch and play games of sabacc.\nWhile he stood by the table he witnessed matches involving the gamblers Lando Calrissian, Argus Panox, Karjj, Therm Scissorpunch, Dava Cassamam, Lark and Jonk. As Glaucus watched, the smuggler Han Solo arrived and joined the game, eventually gaining the upper hand and a large share of winnings. Solo eventually lost it all against Calrissian, who cheated by using a concealed sylop card to win.\nDue to his limited grasp of Galactic Basic Standard, Glaucus did not notice the difference between the two nicknames he was known by; \"Big Guy\" and \"Big Eye\". He preferred spectating to playing himself due to the fact that his hands were too small to conceal his cards and their values were often reflected in his eye, giving other players an advantage. The Octeroid had green skin and a yellow eye.\nHe wore a brown robe with a brown fur cloak over it and had atmosphere exchange breathing tubes connected to a collar around his neck.\nGlaucus was created for the 2018 Star Wars Anthology film Solo: A Star Wars Story and was first revealed in the film's first trailer. Concept art of Glaucus title \"Maverick 004\" was created by creature concept designer and senior sculptor Ivan Manzella for Solo. The character first received identification in the reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo and released in conjunction with the film.\nIn an interview with StarWars.com, creature concept designer Jake Lunt Davies revealed that for Glaucus' design, like Lark and Jonk's, Ivan Manzella was influenced by the space monster feel of the 1950s, taking as inspiration what would have influenced the designers had Solo been released in 1965, ten years prior to 1977, year in which the original Star Wars film Star Wars: Episode IV A New Hope, was released.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Octeroid",
  "/wiki/Glaucus_(Human)",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Batuu_Bounty_Hunters",
  "/wiki/Octero_IV",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/10_BBY",
  "/wiki/Sabacc",
  "/wiki/The_Lodge",
  "/wiki/Planet",
  "/wiki/Vandor",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Eye",
  "/wiki/Standard_year",
  "/wiki/Fort_Ypso",
  "/wiki/Gambling",
  "/wiki/Argus_Panox",
  "/wiki/Karjj",
  "/wiki/Therm_Scissorpunch",
  "/wiki/Dava_Cassamam",
  "/wiki/Lark_and_Jonk",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Limb",
  "/wiki/Clothing",
  "/wiki/Hair",
  "/wiki/Cape",
  "/wiki/Atmosphere",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Ivan_Manzella",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/StarWars.com",
  "/wiki/Jake_Lunt_Davies",
  "/wiki/1950s",
  "/wiki/1960s#1965",
  "/wiki/1977",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Solo:_A_Star_Wars_Story:_Han_on_the_Run",
  "/wiki/Solo:_A_Star_Wars_Story:_Meet_the_Crew",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_3",
  "/wiki/Lando_-_Double_or_Nothing_5",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/The_Art_of_Solo:_A_Star_Wars_Story",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Star_Wars_Archive",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/The_Eyes_Have_It",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Databank_(website)",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}