{
 "name": "Glem",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Glem was a male Rodian who worked at the loading docks on the Colossus refueling station on the Outer Rim planet of Castilon during the era of the New Republic. During a triple dark storm, he warned Kazuda Xiono of a possible pirate attack. Later, Teroj Kee locked Xiono in a crate and told Glem to dispose of it. Glem did so, and found an escaped Xiono clutching on a magnetic crane. During the First Order's occupation of the Colossus, Glem was confronted by stormtroopers about his identification.\nBy the year 34 ABY, Glem was working on the Colossus, a refueling station on the ocean planet Castilon, at its loading docks. During that year, Kazuda Xiono, a newly recruited Resistance spy, arrived there to work at Jarek Yeager's Repair Station, while secretly spying on the place. During his first visit to Aunt Z's Tavern, he was involved in a dispute with the Klatooinian Bolza Grool. When Grool hit a service droid, a cup flew from it and hit Glem, who was sitting at one of the nearby tables. Glem threw his cups back, and they hit the Snivvian Nod. As an all-out bar fight ensued, Nod attacked Glem, and had managed to put him into a headlock by the time Jarek Yeager broke up the fight. Following the fight, the Nikto Neeku Vozo entered Xiono into the race that took place the following day. Glem joined in on the betting after Torra Doza was revealed as the opposing racer.\nSometime after, Glem was in the Colossus marketplace when Xiono was spying on other residents. Later, Glem found him at the loading docks, looking at his lucky trophy. He recommended going inside as a triple dark storm had arrived. Xiono wasn't bothered about the storm, so Glem told him about how the Warbird gang, a band of pirates, used it to attack the Colossus, further pointing out their leader Kragan Gorr when the boy brought his name up. Glem then left Xiono to process the information for himself. As he had predicted, the Warbird gang did attack, but were thwarted soon enough.\nAt one point, Glem was walking through the hallways of the Colossus when Xiono shoved past him, causing the Rodian to yell back. Soon after, he was at Aunt Z's Tavern. There, he discussed the bounty on two fugitive children with the Gotal Yani. Glem predicted the pair would be on the other side of the galaxy by that time and asked Aunt Z for another Jet juice. He was later at the marketplace talking to Vic when two stormtroopers of the First Order came to investigate sightings of the children.\nGlem was driving a repulsorlift through the loading docks when Synara San, a newer employee, got into a fight with the dock worker Orthog. Later that day, the Warbird gang attacked the Colossus again. As some of them began raiding the loading docks, Glem hid behind a crate. He soon left his cover and the pirate attack eventually finished with the reactivation of the Colossus' turbolasers. Glem was at Aunt Z's tavern when two members of the Guavian Death Gang confronted the racer Marcus Speedstar. Following the commotion, Jarek Yeager arrived and challenged Speedstar to the Platform Classic. Speedstar accepted, and Aunt Z began the betting, causing Glem to cheer as it began. He later watched the race with the other patrons of the bar. After Speedstar won, Glem returned to the tavern and talked to Al when Speedstar paid his winnings to the Guavian Death Gang.\nA while later, Glem passed Torra Doza and Xiono when they visited the marketplace one day. He was working at the loading docks when Xiono and Ryvora found a baby Rokkna while receiving some salvaged parts. Glem was later at a landing pad when Neeku was searching for the infant creature. One day, Glem was at the loading docks when the Keteerian Teroj Kee asked him to dispose of a crate in dock 23. While listening to music, he had it dropped into the ocean, not knowing that Kee had trapped Xiono inside of it. After the crate was dropped, Glem found Xiono clinging onto the magnetic crane and asked why he was up there. Xiono made up silly excuses, so the Rodian left.\nDuring the First Order's occupation of the Colossus, Glem was confronted by three of their stormtroopers in the marketplace, asking for his identification. When he was unable to find it, the troopers tried to arrest him. Xiono intervened, and Glem then found his I.D. in time, and the stormtroopers let him go. Later, he was at the loading docks, convincing Synara to work the night-shift. She let agreed, but told him to prepare the containers ahead of time in exchange. As she left, two stormtroopers arrived in search of her, suspecting her to be a spy for the Warbird gang. Glem was still at the loading docks when she returned, and two stormtroopers searched around for her. They questioned him on where Synara was, and he directed them in her direction.\nGlem was a male Rodian with black eyes, green skin, and a bulky figure. He had a gravel voice and liked to gamble for better shifts at his job at the Colossus loading docks. He showed no loyalty to the new employee Synara San and pointed the First Order in her direction when asked of it.\nGlem wore gray tunic with dark gray sleeves and trousers. When working at the loading docks, he wore a yellow vest and sandy brown colored undershirt and trousers.\nGlem first appeared in the first episode of Star Wars Resistance Season One, \"The Recruit,\" on October 7 2018. He was voiced by Dee Bradley Baker, who also voiced the clone troopers in Star Wars: The Clone Wars and Star Wars Rebels.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Colossus_loading_docks",
  "/wiki/Colossus",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Castilon",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Triple_dark",
  "/wiki/Kazuda_Xiono",
  "/wiki/Raid_on_the_Colossus",
  "/wiki/Teroj_Kee",
  "/wiki/First_Order",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/34_ABY",
  "/wiki/Refueling_station",
  "/wiki/Ocean",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Jarek_Yeager%27s_Repair_Station",
  "/wiki/Aunt_Z%27s_Tavern",
  "/wiki/Klatooinian",
  "/wiki/Bolza_Grool",
  "/wiki/Service_droid",
  "/wiki/Snivvian",
  "/wiki/Nod",
  "/wiki/Jarek_Yeager",
  "/wiki/Nikto",
  "/wiki/Neeku_Vozo",
  "/wiki/Standard_day",
  "/wiki/Torra_Doza",
  "/wiki/Colossus_marketplace",
  "/wiki/Kaz%27s_lucky_trophy",
  "/wiki/Warbird_gang",
  "/wiki/Pirate",
  "/wiki/Kragan_Gorr",
  "/wiki/Bounty",
  "/wiki/Gotal",
  "/wiki/Yani",
  "/wiki/The_galaxy",
  "/wiki/Z%27Vk%27Thkrkza",
  "/wiki/Jet_juice",
  "/wiki/Vic_(Colossus)",
  "/wiki/Repulsorlift",
  "/wiki/Synara_San",
  "/wiki/Orthog",
  "/wiki/Second_raid_on_the_Colossus",
  "/wiki/Turbolaser",
  "/wiki/Guavian_Death_Gang",
  "/wiki/Marcus_Speedstar",
  "/wiki/Platform_Classic",
  "/wiki/Al",
  "/wiki/Rokkna",
  "/wiki/Keteerian",
  "/wiki/Unidentified_First_Order_stormtrooper_commander",
  "/wiki/Occupation_of_the_Colossus",
  "/wiki/Trooper",
  "/wiki/Time",
  "/wiki/Eye",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Star_Wars_Resistance_Season_One",
  "/wiki/The_Recruit",
  "/wiki/October_7",
  "/wiki/2018",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Clone_trooper",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars_Rebels",
  "/wiki/The_Triple_Dark",
  "/wiki/Fuel_for_the_Fire",
  "/wiki/The_Children_from_Tehar",
  "/wiki/Synara%27s_Score",
  "/wiki/The_Platform_Classic",
  "/wiki/Secrets_and_Holograms",
  "/wiki/Bibo_(episode)",
  "/wiki/Dangerous_Business",
  "/wiki/The_Doza_Dilemma",
  "/wiki/The_First_Order_Occupation",
  "/wiki/The_Disappeared",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/The_Engineer",
  "/wiki/Kaz%27s_Curse",
  "/wiki/The_Mutiny",
  "/wiki/The_New_World",
  "/wiki/The_Escape",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)"
 ]
}