{
 "name": "Glenna_Kip",
 "display_name": "Glenna Kip",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Shani"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Agricultural Alliance",
      "Galactic Empire",
      "Resistance",
      "First Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Avon Starros"
     ]
    }
   ]
  }
 ],
 "content": "Glenna Kip was a Shani female scientist and professor. Possessing a career several centuries long, she worked out of a laboratory on the planet Haileap during the High Republic Era. During the Imperial Era, she worked on Minfar in a laboratory for the Galactic Empire, researching methods of subduing unruly populations. While not fond of her work, Kip hoped that by working within the Empire she could prevent them from creating weapons. Kip and her fellow scientists created the Echo Horn, which could control the Zixon, the native species of Minfar. After the fall of the Empire, Kip freed the Zixon, and later worked with General Leia Organa of the Resistance. The First Order forcefully recruited Kip as a scientist, and she chose to work alongside Commander Branwayne Spiftz, who sought to locate the Echo Horn, which Kip hoped to destroy before the First Order could find it. When members of the Resistance arrived to assist the Zixon, Kip joined them, helping to prevent the First Order from acquiring the weapon and driving them from the planet.\nGlenna Kip was a Shani female who, during the High Republic Era was renowned as a scientist and professor, working out of a provisional lab in Port Haileap, on Haileap in the Dalnan sector of the Outer Rim Territories. Galactic Republic senator Ghirra Starros decided to send her daughter Avon, an aspiring inventor and scientist herself, to be mentored by Professor Kip, as the two shared some of the same questions about the Force and life in general. However, when Avon arrived at Port Haileap, Kip had gone off searching for an ancient artifact, so the girl was left to her own devices and minded by Jedi Douglas Sunvale and Vernestra Rwoh.\nOver two hundred years later, during the Imperial Era, Kip worked for the Galactic Empire, the Republic's successor state, in a laboratory on Minfar which researched ways to subdue unruly populations. Kip was not fond of the work, but hoped that by working from within, she could prevent the Empire from creating weapons. This work created the Echo Horn, a device capable of controlling Minfar's native sentient species, the Zixon. After the Empire's fall, Kip helped free the Zixon.\nLater on, Kip worked with General Leia Organa of the Resistance during the Cold War. She was forcefully recruited by the First Order as a scientist, and she chose to work alongside Commander Branwayne Spiftz. The commander sought to locate the Echo Horn, but Kip was hoping to destroy it before the First Order could get their hands on it. She joined members of the Resistance when they arrived on Minfar in search of the horn, and they drove the First Order from the planet, preventing them from acquiring the weapon.\nGlenna Kip had green skin and blue eyes. Kip had silver lines that laced through her skin. Her species was long-lived, with Kip being well over two centuries old by the time of the First Order-Resistance War. She was a passionate scientist, and was curious about the nature of the Force. Kip disliked creating weapons or having her work used for immoral purposes, and as such attempted to covertly sabotage or hamper such efforts if she was forced to participate in such work.\nGlenna Kip was a talented scientist, able to create the Echo Horn, a device which could control members of a sentient species.\nGlenna Kip first appeared in the 2019 junior novel Spark of the Resistance, by Justina Ireland.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Starlight:_Hidden_Danger",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/Spark_of_the_Resistance",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Shani",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Agricultural_Alliance",
  "/wiki/Galactic_Empire",
  "/wiki/Resistance",
  "/wiki/First_Order",
  "/wiki/Avon_Starros",
  "/wiki/Scientist",
  "/wiki/Professor",
  "/wiki/Standard_century",
  "/wiki/Laboratory",
  "/wiki/Planet",
  "/wiki/Haileap",
  "/wiki/High_Republic_Era",
  "/wiki/Imperial_Era",
  "/wiki/Minfar",
  "/wiki/Echo_Horn",
  "/wiki/Zixon",
  "/wiki/Homeworld",
  "/wiki/Species",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Commander",
  "/wiki/Branwayne_Spiftz",
  "/wiki/Mission_to_Minfar",
  "/wiki/Port_Haileap",
  "/wiki/Dalnan_sector",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Galactic_Republic",
  "/wiki/Senator",
  "/wiki/Ghirra_Starros",
  "/wiki/The_Force",
  "/wiki/Jedi",
  "/wiki/Douglas_Sunvale",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Standard_year",
  "/wiki/Sentience",
  "/wiki/Cold_War",
  "/wiki/Eye",
  "/wiki/First_Order-Resistance_War",
  "/wiki/2019",
  "/wiki/Justina_Ireland",
  "/wiki/The_High_Republic:_A_Test_of_Courage",
  "/wiki/The_High_Republic:_A_Test_of_Courage_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Spark_of_the_Resistance_(audiobook)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Starlight_Beacon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/232_BBY",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/34_ABY"
 ]
}