{
 "name": "Glorga",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    }
   ]
  }
 ],
 "content": "Glorga was a Hutt crimelord, based on Hollast Seven in the Hollastin system. At one time he employed the Tunroth, Kiran Tatch, who grew disgusted at the Hutt's behavior. Tatch eventually spat on Glorga. The Hutt demanded that Tatch leave the Hollastin system, although the face that the Tunroth was not killed reflected the amount of clout he had with the organization.\nAmong Glorga's retinue was his lieutenant Lanish Ran, Thom Clessigan, the Esoomian Tirsan, and the Trandoshan mercenary Nakaron. During the Second Hollastin Insurrection, several smugglers used the opportunity to try and overthrow Glorga. During the firefight, Glorga's Gamorrean bodyguards were killed, along with his Bith band and Tirsan. Nakaron and Ran fought off the assault and saved Gorga's life.\nThe incident convinced Nakaron that Ran was an Imperial agent, and set about trying to convince Glorga of his beliefs. Glorga did not believe Nakaron, and exiled from the Hollastin system. In a rage, Nakaron killed Glorga with a blaster at point blank range.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Hollast_VII",
  "/wiki/Hollastin_system",
  "/wiki/Tunroth",
  "/wiki/Kiran_Tatch",
  "/wiki/Lanish_Ran",
  "/wiki/Thom_Clessigan",
  "/wiki/Esoomian/Legends",
  "/wiki/Tirsan",
  "/wiki/Trandoshan/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Nakaron",
  "/wiki/Second_Hollastin_Insurrection",
  "/wiki/Smuggler/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Bith/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}