{
 "name": "Gnost-Dural",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Years before 3685 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Ossus Colonization Initiative",
      "Jedi High Council",
      "Ossus Colonization Initiative",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Kana Terrid",
      "Tau Idair"
     ]
    }
   ]
  }
 ],
 "content": "Gnost-Dural was a male Kel Dor Jedi Master serving the Jedi Order and the Galactic Republic during the Great Galactic War and the ensuing Cold War with the reconstituted Sith Empire.\nA Force-sensitive Kel Dor, Gnost-Dural was trained by the Jedi Order in the ways of the Force from an early age, studying at the Coruscant Jedi Temple while a Padawan. During his training as a Consular, at the advice of Jedi Master Shol Bestros, the senior Padawan began to keep a journal as a means to record his thoughts and experiences which could later serve as a personal reference as well as material for the Temple Archives. As Gnost-Dural began exploring the early histories of the Jedi Order, he uncovered forgotten records of Tython, the Force Wars, and the Infinite Empire. These discoveries would prove vital to the Order in the following decades. Continuing down the path of a historian, Gnost-Dural constructed his own green-bladed lightsaber as part of his training.\nFour years after beginning his journal, the Jedi High Council bestowed upon Gnost-Dural the title of Jedi Knight. During the ceremony, the Kel Dor swore to uphold the Jedi Code and defend the Galactic Republic as part of his duty to the Order and the Force. It was upon this day that news broke on Coruscant of a bloody assault on the Tingel Arm; history would later remember this attack as the first appearance of the resurgent Sith Empire, last seen during the Great Hyperspace War nearly two millennia prior.\nDispatched along with hundreds of other able-bodied Knights to the Minos Cluster, Gnost-Dural and his compatriots hoped to end the Sith offensive there quickly and decisively. As the Sith met the Jedi in battle, the conflict continued to drag out. Digging in on the planet Eliad for several months, Gnost-Dural had fought many Sith troopers in the initial weeks, but only once had an encounter with an actual lightsaber-wielding Sith. Despite the Jedi's initial concern at confronting the dark sider, he quickly realized that overconfidence was the Sith warrior's downfall and defeated him. Collecting the slain Sith's weapon, Gnost-Dural hoped to one day be able to return to the Temple Archives on Coruscant to enter it into the collection and studying it.\nIn the following weeks Gnost-Dural was transferred to the Republic Fleet where he was placed under the command of Admiral Greik and confronted and defeated the Imperial Battle Group at Bothawui. Despite this victory, the planet was eventually attacked a second time, resulting in the loss of Master Belth Allusis.\nAfter years of fighting on the front lines of what was now known as the Great Galactic War, Gnost-Dural's petitions to the High Council were finally answered and he returned to Coruscant and the Temple Archives to conduct research on the origins of the Sith. During his research, Gnost-Dural compiled a report to the Council detailing an historical account of the Sith Empire and his belief that the long-thought dead Sith Lord Naga Sadow was indeed the Sith Emperor leading the war effort against the Republic and the Jedi.\nEventually, Gnost-Dural became a Jedi Master and the keeper of the Jedi Archives. In the years following the Treaty of Coruscant, the Jedi High Council tasked him with creating a new timeline of the event. His research during this time unearthed several previously unknown factors about the war and served as the basis for a new Jedi Library.\nIn 3640 BBY, Gnost-Dural was assisted by intelligence agent Theron Shan to find and destroy the Ascendant Spear. The pair infiltrated the facility and Dural, giving time for Shan to sabotage the station, confronted his former apprentice turned dark Kana Terrid, now Darth Karrid. Dural dueled and killed her apprentices, but was captured in turn and interrogated by Karrid. Dural tricked her into going to Duros, where she met her demise in the ensuing battle.\nDuring the Eternal Empire conquest, Gnost-Dural led the battle for the swamp planet Mimban. Alongside Tau Idair, they fought in a lengthy campaign against the Eternal Empire and the pair were the only survivors. Following the conflict, with Jedi numbers thinned and Grand Master Satele Shan in hiding, Dural—as one of the remaining Jedi High Council members—took many Jedi and civilian volunteers with him to establish a hidden colony on Ossus. He and Idair recruited others to their colony, including the doctor Archiban Frodrick Kimble and Jedi Knight Nadia Grell.\nIn 3628 BBY, the colony was discovered by Imperials and Master Gnost-Dural led the evacuation efforts with Doctor Kimble and Nadia Grell. He welcomed the arrival and assistance of the Eternal Alliance's Commander, assigning him to his informal apprentice and the colony's security chief Tau Idair.\nDuring the Meridian Complex assault, Master Dural recruited as many Jedi as he could to join a ground defense group including some Green Jedi and later solicited the help of the Commander. Gnost-Dural, the Commander and Sith Lana Beniko rode aboard General Daeruun's personal ship to Corellia. Master Dural discussed philosophy about the Force with Lana aboard the ship before separating as they went into battle. He later met the Commander, Tau Idair and Arn Peralun, urging them to go after Malgus and fight as one. Though Malgus managed to escape, the Republic eventually emerged victorious.\nWhen the Commander, Arn Peralun, and Aryn Leneer returned from their mission to the old Dantooine Jedi Enclave, where they investigated the whereabouts of Darth Malgus, Gnost-Dural convened a meeting with who he considered the Order's most important representatives to discuss the Order's next moves in rebuilding its numbers. Jedi chosen by Master Gnost-Dural to attend the meeting included Sal-Deron, Tau Idair and Vinyor Tesh, as well as the Dantooine mission party. Though Tesh believed that it was inappropriate for Leneer to attend the meeting, given that she was no longer a member of the Order, Peralun backed Leneer's presence and Gnost-Dural concurred.\nMaster Gnost-Dural was a historian above all else and strived to record galactic history and the feats of important individuals. He kept journals for this task and mentioned to the Eternal Alliance's leader that he intended to create chapter just for the galactic hero's adventures.\nMaster Dural created the colony on Ossus to preserve the Jedi and safeguard their teachings, isolated from the galaxy. He was quick to evacuate it, during the Imperial invasion, in order to maintain that same goal.\nUnlike most Jedi, Gnost seemed open to entertain the thought of other ideas, as shown with his conversation with Lana Beniko where he recognized that the Sith's pursuit of power wasn't necessarily tied to usurping others.\nGnost-Dural used telekinesis and Force speed. He was a master of several forms of lightsaber combat including Soresu, Djem So, and Juyo. In combat, he wielded a single-bladed green Jedi lightsaber.\nGnost-Dural was voiced by Lance Henriksen. Gnost-Dural was one of the main characters in The Old Republic: Annihilation. Though a major character in elements of the material published alongside The Old Republic, he neither appeared in nor was mentioned in the game until he received offhand mentions in the Shadow of Revan and Knights of the Eternal Throne expansions. He was originally set to appear in the early version of Star Wars: The Old Republic's first expansion, which would have included the planet Ziost and a storyline for the Sith Warrior class involving the Jedi Master. He eventually appeared in update 5.10 Jedi Under Siege and was voiced by Fred Tatasciore.\nGnost-Dural was set to be mentioned in the short story Quite A Story To Tell, set after the events of the Star Wars: The Old Republic: Onslaught, but his name was later removed and replaced by a mention of Sal-Deron. Author Caitlin Sullivan Kelly later clarified that it was removed after it was brought up that Gnost-Dural could be dead for Imperial characters after the events of Jedi Under Siege, and they did not want to implicate that some choices were more canon than others.\nFor Imperial players, they confront Gnost-Dural alongside Darth Malgus. After defeating him in battle, Malgus remarked that he would simply leave the Jedi Master to die but instead leaves his fate up to the player. The player can either order Malgus to execute Gnost-Dural, earning dark side points, or take him prisoner, earning light side points. Gnost-Dural will also recount the player's most significant fallen foes upon being defeated.\nRepublic players meet Gnost-Dural for the first time at the Jedi colony on Ossus, where he acknowledged their respective player class and remarks that it's time they had a chapter all their own, but that would sadly have to wait.\nThroughout the evacuation efforts, Gnost-Dural encourages Tau Idair to take on a Padawan of her own, counseling her to overcome her survivor's guilt.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Quite_A_Story_To_Tell",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith",
  "/wiki/3685_BBY",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Ossus_Colonization_Initiative",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Karrid",
  "/wiki/Tau_Idair",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Consular",
  "/wiki/Shol_Bestros",
  "/wiki/The_Journal_of_Master_Gnost-Dural",
  "/wiki/Tython/Legends",
  "/wiki/Force_Wars",
  "/wiki/Infinite_Empire",
  "/wiki/Jedi_historian",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Knighting_ceremony/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Tingel_Arm/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Minos_Cluster_Campaign",
  "/wiki/Eliad",
  "/wiki/Imperial_soldier",
  "/wiki/Admiral/Legends",
  "/wiki/Greik",
  "/wiki/First_Battle_of_Bothawui",
  "/wiki/Bothawui/Legends",
  "/wiki/Battle_of_Bothawui_(Second;_Great_Galactic_War)",
  "/wiki/Belth_Allusis",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Tenebrae",
  "/wiki/Battle_of_Duro_(Galactic_War)",
  "/wiki/File:Gnost-Dural2.ogg",
  "/wiki/Lore_Keeper",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3640_BBY",
  "/wiki/Theron_Shan",
  "/wiki/Ascendant_Spear",
  "/wiki/Duros/Legends",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Mimban_campaign_(Eternal_Empire_conquest)",
  "/wiki/Swamp/Legends",
  "/wiki/Mimban/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Jedi_Colony",
  "/wiki/Ossus/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Archiban_Frodrick_Kimble",
  "/wiki/Nadia_Grell",
  "/wiki/3628_BBY",
  "/wiki/Invasion_of_Ossus",
  "/wiki/Eternal_Alliance",
  "/wiki/Alliance_Commander",
  "/wiki/Chief_of_Security/Legends",
  "/wiki/Meridian_Complex_assault",
  "/wiki/Corellian_Jedi",
  "/wiki/Lana_Beniko",
  "/wiki/Ardinondu_Dipolus_Daeruun",
  "/wiki/Corellia/Legends",
  "/wiki/Arn_Peralun",
  "/wiki/Aryn_Leneer",
  "/wiki/Dantooine/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Darth_Malgus",
  "/wiki/Sal-Deron",
  "/wiki/Vinyor_Tesh",
  "/wiki/Historian/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_speed",
  "/wiki/Form_III/Legends",
  "/wiki/Form_V/Legends",
  "/wiki/Form_VII/Legends",
  "/wiki/Lance_Henriksen",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Fred_Tatasciore",
  "/wiki/Caitlin_Sullivan_Kelly",
  "/wiki/Category:Audio_files_of_Gnost-Dural",
  "/wiki/Category:Images_of_Gnost-Dural",
  "/wiki/Timeline_1:_Treaty_of_Coruscant",
  "/wiki/Timeline_2:_The_Mandalorian_Blockade_is_Broken",
  "/wiki/Timeline_3:_The_Return_of_the_Mandalorians",
  "/wiki/Timeline_4:_The_Empire_Changes_Strategy",
  "/wiki/Timeline_5:_The_Battle_of_Bothawui",
  "/wiki/Timeline_6:_Onslaught_of_the_Sith_Empire",
  "/wiki/Timeline_7:_Peace_for_the_Republic%3F",
  "/wiki/Timeline_8:_The_Jedi_Civil_War",
  "/wiki/Timeline_9:_The_Mandalorian_Wars",
  "/wiki/Timeline_10:_The_Exar_Kun_War",
  "/wiki/Timeline_11:_Rebirth_of_the_Sith_Empire",
  "/wiki/Timeline_12:_The_Great_Hyperspace_War",
  "/wiki/The_Old_Republic:_Annihilation_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_137",
  "/wiki/Chief_Librarian/Legends",
  "/wiki/Ostar-Gal",
  "/wiki/3653_BBY",
  "/wiki/Barra-Rona-Ban"
 ]
}