{
 "name": "Gobi_Glie",
 "display_name": "Gobi Glie",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.84 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Twi'lek Resistance",
      "Free Ryloth Movement"
     ]
    }
   ]
  }
 ],
 "content": "Gobi Glie was a Rutian male Twi'lek revolutionary and freedom fighter who took part in and led various rebel movements on Ryloth during the last years of the Galactic Republic and the reign of the Galactic Empire. For decades, Glie served as one of Cham Syndulla's most trusted soldiers and right hand, beginning with the Clone Wars, during which the political radicals formed the Twi'lek Resistance to liberate their homeworld from a Confederacy of Independent Systems invasion. Though Glie and Syndulla were initially opposed to the Republic and Ryloth's corrupt senator, Orn Free Taa, the resistance accepted aid from the government and successfully repelled the Confederate forces.\nWhile Syndulla attempted to broker peace following the liberation of Ryloth, Glie maintained the resistance, believing that Ryloth would not be free until the occupational forces of the Republic and its successor state, the Galactic Empire, were gone as well. Glie's rebellion against the Empire instigated Imperial forces to act against him, and the arrest of both him and Cham's daughter, Hera, who Glie had been employing in his espionage, spurred the elder Syndulla back into the fight. The machinations of Imperial Admiral Rampart led to Cham's arrest, but with the help of Clone Force 99, a mercenary group Gobi had ties with, the rebels escaped custody. Now fugitives of the Empire and united for Ryloth's liberty once more, Glie and Syndulla formed the Free Ryloth Movement.\nAs one of the finest warriors at Cham's side, Glie helped the Free Ryloth Movement expand its forces to combat the Empire. In one desperate bid to free Ryloth, they plotted to assassinate Emperor Palpatine, his lieutenant Darth Vader, and Senator Taa by destroying the Star Destroyer Perilous. Despite the failure of their plot, Glie and Syndulla continued the fight as rebel movements spread across the galaxy. Though initially focused solely on Ryloth's freedom despite the wider rebellion, Gobi and the Free Ryloth Movement eventually forged ties with the Spectres, a rebel group founded by Hera and part of the larger Phoenix Cell. With aid from the Spectres, Glie and Cham continued their struggle, which paid off when Ryloth was freed by the end of the Galactic Civil War.\nGobi Glie was born on Ryloth, the homeworld of the Twi'lek species and a member of the Galactic Republic, a democratic union that governed much of the galaxy. Ryloth was represented in the Republic's Galactic Senate by Orn Free Taa, a corrupt and self-indulgent politician. Glie was a trusted friend and ally of Cham Syndulla, a radical who opposed Taa and wanted to bring freedom to the Twi'leks of Ryloth. Glie was additionally close to Syndulla's family and was treated like an uncle by his young daughter, Hera.\nIn the early days of the Clone Wars, a pan-galactic conflict between the Republic and the Confederacy of Independent Systems, Ryloth attempted to maintain neutrality but became contested due to its hyperspace location. Although Ryloth was part of the Republic, the Twi'lek citizens made it known to both sides that they wanted to remain neutral and free in the war. The Confederacy did not consider the Rylothians' wishes and mounted an invasion led by Emir Wat Tambor of the Techno Union. Tambor established an orbital blockade and started a campaign of surface bombing alongside the ground invasion, targeting Twi'lek villages and farms. Though Jedi General Ima-Gun Di and his garrison were sent to aid the Twi'eks in the early stages of the battle, Taa refused to return to Ryloth, staying on the Republic capital Coruscant instead, leading Syndulla to believe that the Republic had abandoned them. With Glie, he formed the Twi'lek Resistance to combat the Separatist occupiers themselves, working alongside General Di's ground forces and Admiral Dao's fleet in orbit to fight back.\nWith the small Republic garrison at their side, Glie and Syndulla's Resistance attempted to defend Rylothian villages, taking in a large number of refugees as the Separatist forces closed in. They established a base at the center of a set of canyons, and soon the right flank came under attack. Tambor's blockade cut off Republic aid and supplies, and the rapidly diminishing food and water supply proved to be a major threat to the refugees. Di ordered Admiral Dao to contact the Jedi High Council for help, to no avail. The Resistance and Di's forces continued to struggle, losing power to their heavy weapons systems and being slowly forced back. At Syndulla's urging, Di had Dao reach out to the Jedi Council again, and the admiral managed to make contact before his ship was destroyed in battle.\nGlie and Syndulla retreated to their base with General Di's forces as the right flank was overrun. With Dao's fleet destroyed and Tambor's blockade in full control of the space around Ryloth, Di had little communication with the Republic, and reinforcements were unavailable. Glie joined Syndulla, Di, and clone Captain Keeli to discuss their next move. Cham demanded to know what the Republic would do to help them and was dismissive when Di promised that aid would arrive eventually. Believing that they would all die by remaining put, Syndulla ordered Glie to mobilize the Twi'leks and tell them that they were evacuating their position. Before Glie could go, Keeli countered that there was no means of escape since the right flank had collapsed. Angered, Syndulla rode off on his blurrg, leaving Glie with Di and Keeli.\nBecause Di only had a single LAAT/i gunship, it was impossible to evacuate all the refugees. Syndulla returned to Glie and the others as they planned what to do next. Di devised a plan to destroy one of the canyon passes the Separatists had access to by reconfiguring the gunship's fuel system into a bomb. By rerouting the Separatist army through a single ravine, Di and his remaining soldiers could provide cover while the Twi'leks fled over the mountain. The Jedi Council, meanwhile, sent two Senate diplomats, Senator Bail Organa of Alderaan and Representative Jar Jar Binks of Naboo, to speak with King Katuunko of Toydaria about using Toydaria as a base from which a relief package could be sent to Ryloth. Despite setbacks from the Trade Federation, King Katuunko agreed to allow the Republic to send supplies to Ryloth through his world.\nBack on Ryloth, Glie began preparing the Resistance and the Twi'lek refugees to escape, and Captain Keeli had his men set the gunship in the canyon. Di told Glie that he and his soldiers wouldn't be able to hold off the droid forces for long. He advised that Glie move his people and their families out of danger as quickly as possible. Di turned to see Syndulla speaking with one of his soldiers, and Glie told him that Cham was still angry with the Republic and felt betrayed. Di confided in Glie that Syndulla was right to feel betrayed over the Republic's unfulfilled promises and asked that he tell him how he felt. Glie agreed to do so, and the two shook hands. Syndulla then galvanized the Twi'leks to begin evacuating. Glie watched as Di walked to join his men, then ran to catch up with the fleeing Resistance.\nAs Glie and Syndulla led the Twi'leks over the mountain, Di held off the advancing droid armies, giving them enough time to flee. Though they fought valiantly, Di's forces were killed, and the General gave his life to allow the Twi'leks to fight another day. Glie was moved by Di's actions and vowed to remember his sacrifice. Three Republic Pelta-class frigates from the atmosphere, fulfilling Di's promise and giving them enough provisions for the next few rotations. As the Confederacy continued to spread on Ryloth, Tambor took hold of the capital city Lessu and began plundering the Twi'lek population. The invasion forced the Republic's hand, and a naval fleet led by Generals Mace Windu, Obi-Wan Kenobi, and Anakin Skywalker was dispatched to free Ryloth. Skywalker's fleet engaged the blockade above Ryloth, crushing it and allowing Windu and Kenobi's armies to land on the planet's surface, where began a campaign to liberate Ryloth from the Separatists.\nIn the meantime, the Twi'lek Resistance fled to Cazne, where they established a hideout under a crashed Separatist C-9979 landing craft after a major battle. They continued to strike against the Confederate armies, but they suffered heavy casualties. Glie himself injured his arm, leaving him unable to continue fighting. Hoping to bolster his attempt to take the capital, Windu met with Syndulla in hopes of joining forces. Cham brought Windu to their hideout, where Glie showed Syndulla his injury. Syndulla joked that it was a scratch but warmly told Glie to get better because he needed him. Glie responded in Twi'leki, and Cham continued to speak with Windu.\nSyndulla initially refused to cooperate with Windu, believing that Senator Taa would take advantage of a victory to advance his plans for Ryloth and the possibility of a Republic occupation, however, news of a Separatist firebombing campaign made him reconsider. Windu brokered peace between Syndulla and Senator Taa, with Taa promising that there would be no occupation as long as Syndulla didn't seek his political office. Windu and Syndulla then led a strike to take the capital. With their combined forces, they managed to take the city, arresting Tambor in the process. After the victory, a parade was held in Lessu, where Syndulla and the freedom fighters celebrated their victory.\nDespite Senator Taa's promise to Syndulla that the clone armies would leave Ryloth once the battle was over, the Republic maintained an occupation on the planet. Syndulla worked alongside the clone occupation, led by clone Captain Howzer, but Glie continued to push for a completely free Ryloth and opposed the clone presence. After the end of the Clone Wars in 19 BBY, the Republic transformed into the Galactic Empire, and Ryloth was placed under Imperial occupation. Seeing the new government as a chance to bring peace to Ryloth, Syndulla broke with his philosophy of promoting a Ryloth free of any outside force and began working with Senator Taa. Glie, on the other hand, had the Twi'lek Resistance reorganized into the Free Ryloth Movement long after he and Syndulla had planned to disband it, believing that the Empire was up to something.\nThough Cham and his wife, Eleni, had no sympathy for the Empire, they disapproved of Glie's insurgent activities, especially as he began to involve their daughter, Hera, in them. Glie, who treated Hera like a niece, began to include her in his espionage, using her and her droid companion, C1-10P, or \"Chopper,\" to spy on Imperial facilities. Because of his continued dissent, Glie became a priority target of Imperial officials, who were intent on snuffing out the remnants of the Resistance. During the early occupation, the Empire established a doonium refinery on Ryloth, and Glie, suspicious, sent Hera and Chopper to spy on it.\nOn the day Cham and Eleni met with Senator Taa to address the citizens of Ryloth at Lessu, Glie and his fighters joined the crowds to watch. Their presence was noted by CT-9904, also known as Crosshair, an elite commando assigned to help root out the insurgents. Speaking to the crowd, Taa began praising the Empire and its new refinery, then urged all Twi'leks to step down from military posts to enjoy their new freedom. Glie looked around as the crowd questioned Taa's speech and shouted that they wanted to hear from Syndulla. Cham stepped forward and addressed the crowd, telling them that the war was over and concurring with Taa. Syndulla asked the people to turn over their weapons, and Glie and his fighters left as the crowd cheered.\nAnticipating that Cham's new policy would make Ryloth defenseless, Glie reached out to his underworld contact, a Trandoshan information broker based on Ord Mantell named Cid, to order more weapons. Gobi later joined Cham and Eleni at their home in the Tann Province, where he and Eleni spoke on a third-floor balcony overlooking Cham as a line of Twi'leks turned their weapons in. Glie told Eleni that clones should not be the ones defending Ryloth, then questioned how Cham supported it. Eleni responded that Cham knew that the people were tired of fighting and that the Twi'leks couldn't go on as they had been during the war, to which Glie opined that, by having them turn over their weapons, he was making them defenseless. He added that he had reached out to his underworld contact for more.\nGlie and Eleni suddenly heard Chopper as he and Hera were escorted into the courtyard by Captain Howzer and a squad of clones. Howzer told Cham that the two were found inside a restricted zone, but added that he wouldn't report it as long as it didn't happen again. Glie and Eleni walked down to the courtyard, where Cham was in the middle of asking Hera what she had been doing. Before Hera could respond, Glie interrupted and informed Cham that he had sent her to the refinery. Eleni brought Hera and Chopper inside the house, and Cham began chastizing Gobi for what he had done. Syndulla questioned if Glie knew the ramifications of what would have happened if Hera was caught spying, prompting Glie to ask why it would have been spying unless the Empire didn't want them to see something. Syndulla told Glie that they were in a delicate situation and that he would not allow him to put Hera in the middle of it. Glie reminded him that the clones were supposed to leave Ryloth when the war ended, then added that he was not going to stand by while more arrived. Syndulla told Glie that their Resistance was supposed to disband when the time came and asked what they had fought for if they couldn't accept peace, but Glie just replied that, though they had been friends a long time, Cham was unwilling to see that the Empire was up to something.\nAfter leaving the Syndulla residence, Glie eventually met with one of his fighters, Serin, at a cavern base to prepare for their run to obtain the weapons shipment from Cid. Glie had planned for Hera and Chopper to join them, but Hera arrived and told Glie that she felt she shouldn't go. Glie told her that Cham had only said that she couldn't do any more spying and that this was a simple supply run instead. Hera again insisted that she stay home, but as he turned to board the ship Gobi added that he was going to let her fly the ship this time. Hera, an aspiring pilot, was excited at the prospect and joined Glie, asking Chopper to cover for her while she was gone. Crosshair, who was watching them from cavern walls, fired a tracking device onto Glie's ship as it took off. Gobi helped Hera with her piloting, but as they prepared to land on one of Ryloth's moons, he had Serin take over, not wanting Hera to learn takeoffs and landings until she had more experience. Once they landed, they departed the ship and waited for Cid's delivery. Hera asked Glie what supplies they were there to get, and he told her they were receiving weapons. She mentioned to Gobi that they had just turned over all their weapons to the Empire, but he simply responded that it was not for long.\nA modified Omicron-class attack shuttle, the Marauder, arrived and landed on the moon. A team of renegade clone commandos working for Cid, Clone Force 99, stepped out of the ship. The squad's leader, Hunter, asked Gobi if he was who they were sent to meet, and Tech told him that they had three dozen blasters and a case of thermal detonators, which Glie asked to see. While Glie and Serin inspected the weapons, Hera walked up to the Marauder and explored its interior with Omega, a young clone who accompanied Clone Force 99. After closing the weapons containers, Glie said that it was only a start and asked the clones to tell Cid to contact him when she had more to sell. He handed the payment over to Hunter, who told Glie that building an arsenal would attract attention and advised that he know what he was getting into. Glie responded that they didn't have a choice, then called Hera to tell her that they were leaving.\nWith their weapons loaded onto the ship, Glie departed the moon. Serin flew the ship as they approached Ryloth, and Hera tried to prompt Gobi by asking why it wasn't more reasonable to teach her takeoffs and landings if they were the most difficult techniques to learn. Glie remarked that she was persistent, then Serin picked up an Imperial ship following them on their scanners. Gobi told her to fly low and try to lose it but, as they began their descent, Crosshair fired a sniper blast that hit one of their ship's engines. Rapidly falling into a ravine, Glie and Serin tried to ease the crash to no avail. As they got their bearings, Crosshair and a team of clones arrived to arrest them.\nWhile Crosshair's squad confiscated Glie's weapons and had him, Serin, and Hera arrested, an HCVw A9 turbo tank arrived at the scene, carrying Imperial Vice Admiral Rampart, Senator Taa, and Captain Howzer. Crosshair informed Rampart and Taa that the three were caught smuggling weapons. Rampart looked to Hera and told her that her involvement was alarming, and Taa immediately accused Cham of plotting an uprising. Howzer initially protested Rampart's order to have Hera arrested alongside Gobi and Serin, but ultimately complied and led the trio aboard the tank. Crosshair noticed three of Glie's soldiers on the western ridge of the canyon, but Rampart let them live, hoping they'd report to Cham. When informed of the matter, Cham and Eleni mounted a rescue mission, attacking the tank's speeder escorts as the convoy made its way through the chasm. One of Glie's lieutenants, Lenk, broke into the tank's cockpit and cut off communications, leaving Howzer, Rampart, and Taa hostage.\nRampart ordered Howzer to surrender, and Cham and Eleni entered the tank. They freed Glie, Hera, and Serin, then took the Imperial hostages outside. Glie joined Serin and Lenk in surrounding the hostages while Cham, fed up with Taa, confronted his longtime enemy as he accused the Resistance of treason. Cham aimed his blaster at Taa, but Eleni stopped him from killing the senator due to Hera's presence. Suddenly, Crosshair fired a sniper shot at Taa, hitting him in the lekku, and several gunships arrived and surrounded the Twi'leks. Although Hera managed to escape, Glie, the Syndullas, Lenk, and Serin were falsely charged with the attempted assassination of Senator Taa and arrested by Rampart's forces.\nGobi was brought to Lessu with the others, where he was held in a cell with Cham and Eleni, while others arrested for insurgency, including Lenk and Serin, were held in an adjacent cell. Rampart and Howzer came to the prison to question the Syndullas on Hera's location, but they refused to cooperate. Rampart ordered his forces to arrest anyone with ties to Cham, and he began to increase patrols in Lessu, much to Howzer's dismay. The captain later returned to Glie and the Syndullas' cell, where he attempted to assure them that he was trying to keep Hera safe covertly and asked them where she was, but Cham again refused. Hera and Chopper, meanwhile, contacted Omega and solicited Clone Force 99 for their help. The renegade clones arrived on Ryloth and began working with Hera to devise a rescue plan. Using her knowledge from Glie's recon missions, Hera helped them formulate a plan to attack the Imperial refinery, which would divert forces from the capital. While Hera, Omega, and two members of Clone Force 99 named Wrecker and Tech attacked the refinery, Hunter and Echo snuck into the capital and broke Glie and the others out of prison.\nGobi asked what they were doing there upon seeing them, and Cham questioned how he knew who they were. Glie explained that they were mercenaries, but that he didn't hire them to break them out, and Hunter informed them that Hera did. As they attempted to escape via the main entrance, they were stopped by Howzer, who told them that there was a squad outside waiting for them. Glie angrily asked why they should trust him, and Howzer said to them that he was on their side and denounced the Empire. He told them that Imperial forces had the exits blocked, and Eleni proposed they use Senator Taa's shuttle, which was kept in his private tower chamber. Howzer refused to abandon his squad but gave Glie and the others an opportunity to escape by distracting them. While they boarded Taa's shuttle and fled the capital, Howzer convinced several of his men that what they were doing was wrong, only to be arrested for treason. Glie, the Syndullas, and the other insurgents fled Ryloth, now with more incentive to lead the new resistance against the Empire.\nIn the years after breaking from the Empire, Cham led the Free Ryloth Movement, a new guerrilla resistance with Gobi as one of his top fighters once again. As the Empire increased its hold on Ryloth with Senator Taa's blessing, the Free Ryloth Movement expanded in kind, establishing a network of informants, numerous hidden bases across the system, and a stockpile of supplies and necessary materials. Cham, Gobi, and the movement recruited hundreds of volunteers and led many raids on the Imperials, killing dozens of military personnel and disrupting the spice trade. Cham made an ally in Imperial Colonel Belkor Dray, who supported the Free Ryloth movement to undermine his superior officer, Moff Delian Mors, the spice-addled governor of Ryloth. Mors lived in a luxurious palace on Ryloth's largest moon, and Dray saw Syndulla's resistance as a means to replace her. The Free Ryloth Movement had little to show for its early successes and faced losses as fighting increased. Among those killed during the resistance was Eleni, whose death spurred Cham to devote himself fully to his cause, straining his relationship with Hera.\nIn 14 BBY, a rebel attempt to hijack an Imperial weapons shipment at Yaga Minor was foiled by Darth Vader, Emperor Palpatine's chief enforcer, who led a V-wing squadron in crushing the Twi'lek insurgents who had stolen the cache. Following the incident, Cham learned from his spies that Vader, Senator Taa, and the Emperor himself would be traveling to Ryloth aboard Vader's flagship, the Star Destroyer Perilous. Intent on dealing a major blow to the Empire, Cham devised a plan to target the Perilous and destroy it, thus removing the two heads of the Empire and Taa alongside them. At their underground base on Ryloth's third moon, Gobi helped Cham and several of the movement's top members, Isval, Xira, and Kallon, map out their plot to attack the Perilous. They had nine days until the ship was supposed to arrive at Ryloth, and Cham coerced Belkor to divert Imperial patrol craft and flight clearances to aide them. Gobi and the others assembled a large assault force to take down the Star Destroyer consisting of repurposed Clone Wars-era vulture droids, buzz droids, mines, and shield bleeders.\nOn the day the Perilous was to arrive at Ryloth, Gobi joined Cham at the command center of their base with Xira, Kallon, and the droid D4L1. While Gobi manned the subspace transmitter, Xira monitored data readouts, and Kallon stood by as a consulting engineer. Nine viewscreens mounted on the wall showed the outer reaches of Ryloth's system as seen from a half dozen probe droids positioned in the planet's asteroid belt. All their droid ships were hidden in the asteroid belt as well, powered down to almost zero, and a minefield had been laid out in the surrounding space. Gobi and the others waited intently for signs of the Perilous when, suddenly, Xira yelled out that a ship was coming out of hyperspace.\nCham ordered the mines to be activated and shield bleeders to be put on standby. He placed a hand on Gobi's shoulder and told him to be ready to transmit orders to the droid ships. Glie, shaking with excitement and tension, replied that he was more than ready and stated that they would force-feed the Imperials some fire. As the Perilous emerged from hyperspace, the ship was pelted with hundreds of mines. Xira reported that the ship was attempting to reverse, and everyone looked at the screens. Cham stated that it seemed there was little damage from the mines, but Gobi pointed out that it had only taken little damage so far. Though they had wanted the Perilous closer to the asteroid field, Cham ordered Glie to activate the shield bleeders.\nThe bleeders caused the Star Destroyer's shields to fluctuate, and Gobi stated that they had trapped the ship. Cham asked Kallon if the bleeders were working, and when Kallon confirmed that the Perilous' shields were down, Cham ordered Gobi to launch all droid ships. Glie sent out the signal, and from the probe droids, they could see their fleet speed out from the asteroids. Cham had Kallon magnify one of the probe readings onto the Destroyer's launch bay, where they saw a contingent of V-wings pour out of it. He asked what the status of the shields was, and Kallon told him that the ship was too far out for an accurate reading. The screens, however, then showed the shield net around the Perilous flare and die out, and Gobi slammed his fist onto the table before him in excitement, spilling his caf. They watched as the mines continued to pelt the ship, and as the vulture droids closed in and began firing, Glie eagerly watched the battle ensue. Though some of the vulture droids entered a dogfight with the Imperial V-wings, a separate group went straight for the Perilous, speeding into the ship and deploying their cargo of explosive buzz droids. Explosions rocked the Perilous, and back in the command center, Gobi smiled as he paced the floor while watching the screens. Glie then saw a reading that the ships' weapons were down and informed the others that it was defenseless, leading Cham to order Kallon to send in the second wave of vulture droids.\nEveryone in the command center watched silently a single V-wing depart from the rest of the Imperial contingent, and Gobi broke the silence by asking what the ship was doing. Cham recognized that Vader himself was helming the ship and destroyed many of the incoming vulture droids with only the Force. The vulture droids, buzz droids, and mines collided, and the Imperial V-wings formed a protective perimeter around the Perilous. Once Vader returned to the Destroyer, the burning ship began heading towards Ryloth, and Cham was contacted by a panicked Belkor, who he forced to continue with the plan. Cham issued an order to begin phase two, earning questioned looks from Glie, Xira, and Kallon, who were unaware of the plan. Upon learning of a second phase, Gobi showed excitement, but Cham stared him down until his glee faded. Gobi asked if he had said something wrong, and Cham reprimanded him, saying that what they were doing was not a game and that people were dying. Glie tried to save face and remarked that it was only Imperial people, which Cham acknowledged but again insisted to Gobi that it was no game. His skin darkening from embarrassment, Glie agreed and calmed down. At Cham's orders, several repair ships secretly filled with members of the Free Ryloth Movement descended on the Perilous, ostensibly responding to a distress signal from Belkor.\nLed by Isval, the parties boarded the Perilous and managed to attach twelve explosive charges to the ships' hyperdrive and adjacent amplifiers. Realizing the ship was going to explode, Vader ordered an evacuation of Imperial forces and, after failing to capture Isval and her team, he and the Emperor fled the Perilous aboard an escape craft that crashed on Ryloth. The Perilous was destroyed above Ryloth, but the Free Ryloth Movement was unable to assassinate Vader, the Emperor, or Senator Taa, who also survived. Cham and Isval focused on locating the crashed Imperial leaders. On Ryloth, Cham led his freedom fighters in hunting the Sith Lords, but his plan was complicated by Belkor's decision to turn against him and the threat Vader and the Emperor proved to Rylothian civilians. Cham's plan ultimately failed, and he ordered a retreat of the Free Ryloth Movement, suffering numerous losses, including Isval. Despite the movement's failure, they continued their struggle and maintained steady resistance against Imperial forces.\nOver the following years, Glie continued to fight alongside Cham and the Free Ryloth Movement. In 12 BBY, Hera and Cham had a falling out, and the younger Syndulla left Ryloth with Chopper to become a first-rate starship pilot. Following in her parents' footsteps, she became part of the burgeoning galactic rebellion against the Empire and formed her own cell, the Spectres, who operated on Lothal before joining the much larger Phoenix Cell. Cham and his fighters remained solely focused on Ryloth and its isolated freedom despite there being a more widespread rebel movement. The aging Gobi and Cham were often joined in their missions by Numa, a younger Twi'lek who had been a child during the Separatist invasion of Ryloth during the Clone Wars. By 3 BBY, the Imperial forces at Ryloth deployed a Quasar Fire-class cruiser-carrier in orbit over the planet and began running bombing campaigns to root out the Twi'lek rebels. After several years of no contact with Hera, Cham was unexpectedly messaged by her. She wanted his help taking control of the cruiser-carrier above Ryloth to provide a safe base for Phoenix Squadron. Cham brought Gobi and Numa with him aboard a Nu-class shuttle to meet with his daughter and her team in deep space. Once their ship was docked, Glie, Cham, and Numa boarded Hera's CR90 corvette.\nHera greeted her father, but Cham instead directed his focus to one of her Spectres, Jedi Kanan Jarrus. Jarrus introduced himself and the rest of the Spectres, Ezra Bridger, Sabine Wren, and Garazeb Orrelios. Cham introduced himself, and Sabine recognized him as the \"Liberator of Ryloth\" from her studies at the Imperial Academy. Cham then introduced Gobi and Numa as two of his finest warriors. Hera changed the subject and told everyone gathered that they should get to the briefing. At the briefing, Hera explained that she wanted to enter Ryloth space, take control of the carrier, and escape, but Cham rejected her proposal and instead wanted to destroy it using his own strategies as a symbol for the Rylothians. Hera challenged his notion and pointed out that he would have destroyed the carrier already if he had the means to do so. Jarrus interjected that they needed each other to win, and Cham looked to Gobi and Numa and nodded. They agreed to Hera's terms, but in secret Cham instructed the two that they would turn on the Spectres once they reached the carrier. Gobi and Numa brought a bag of detonators onto their TIE/sa bomber, which was docked on the Nu-class shuttle. The group planned to use the bomber to board the carrier. Joined by the Spectres and escorted by two of Phoenix Squadron's A-wing fighters, the Twi'lek rebels entered hyperspace for Ryloth.\nAboard the TIE Bomber, Gobi, Hera, and Chopper sat in the cockpit while Cham, Numa, and the other Spectres sat in the adjacent ordnance bay. Cham began entertaining Jarrus with his story of the Battle of Lessu, and an annoyed Hera shut the door between the two pods. Glie remarked that Cham had taken a liking to her Jedi, and she snidely replied that it was more the other way around. Jarrus entered the cockpit, and Hera shut the door after him, again cutting off her father. When Jarrus remarked that she and Cham were not different, the two bickered while Glie sat with Chopper. Once the shuttle left hyperspace near Ryloth, it deployed the bomber before leaving. Cham entered the cockpit and ordered Gobi to prepare for landing. Glie went to the second pod and joined Numa and the Spectres. As they had planned, the Imperial carrier sent out its fleet of bombers to Ryloth, giving the rebels a window to take control of it. Hera signaled the A-wings, which began firing at the bomber. Using the A-wings as a guise for a rebel attack, Jarrus requested emergency permission to land from the cruiser. Both of the A-wings left the system when the carrier fired at them, and Hera shakily piloted the bomber towards the carrier's hangars. She crashed the ship into the hangar, causing everyone aboard to be flung around the cabin.\nWhile Sabine, Ezra, and Zeb got their bearings, Gobi and Numa quickly got up and shot them with stun blasts. Cham stunned Jarrus and Chopper in the cockpit, and Gobi entered the pod as he told Hera that he only needed the Spectres' help to get on board the carrier. He then handcuffed Hera to the pilot's seat before leaving the bomber and attacking the Imperial squad outside. Glie and Numa joined him and beat down two of the remaining stormtroopers. Glie narrowly missed a shot to the head from one before shooting back and killing him. Cham ordered Gobi and Numa to set their charges on the munitions racks while he went to set charges in the engine room. As the Twi'leks set the explosives, the Spectres regained consciousness and freed Hera, resolving to stop the Twi'lek rebels from destroying the ship. Zeb and Sabine set out to disarm the bombs on the munitions rack but were spotted by Glie and Numa, who fired at them. An alarm went off, and the bay doors opened to reveal five incoming stormtroopers. The rebels turned from firing at each other and fired at the Imperials. One shot from Sabine hit the door panel, closing it. With the stormtroopers no longer a threat, Gobi and Numa refocused their attention on Zeb and Sabine.\nEngaged in a standoff, Glie and Numa remained behind the munitions while Sabine and Zeb stood behind a corner. To end the standoff quickly, Sabine had Zeb capture a mouse droid, then rewired it and attached a stun bomb to it. Sabine navigated the droid around the corner to the munitions, and Gobi began firing at it, but she drove it past him and stopped it between him and Numa. She then activated the bomb, stunning the two Twi'leks. Sabine and Zeb ran over to the two, then took their blasters and tied them down. In the carrier's command center, Hera confronted Cham and tried to persuade him to help her. Sabine played Hera's impassioned speech to Glie and Numa, who heard as Hera spoke of how Cham hadn't fought for just one village but all of Ryloth during the Clone War and how he could fight for the entire galaxy instead of just Ryloth against the Empire. Inspired by Hera, Gobi looked to Numa, then stood up and told Hera over Sabine's comm that he was with her. Numa did the same, and Cham relented to his daughter.\nHera then ordered everyone to get to the cruiser's turrets to combat an incoming fleet of TIE fighters from a nearby Imperial light cruiser. Gobi took up one of the rear turrets and began firing at the TIEs as they circled the carrier. They managed to destroy the TIE fighters and an Imperial shuttle, but their victory was brief as the TIE bombers returned from Ryloth. The bombers fired torpedoes at the carrier, and Gobi destroyed two ships as they passed him following a bombing run. Though the rebels destroyed all the bombers, one torpedo nearly hit the command center and disrupted the stabilizer, but Cham and Hera were able to reset the carrier together. The light cruiser began advancing on the carrier, and Sabine formulated a plan to destroy it. She filled a TIE bomber with explosives, then set the craft's anti-grav. Ezra used the Force to push the ship out into space, and as it floated close to the cruiser, Cham fired on it from one of the carrier's turrets. The cruiser's forward magazine exploded, and the ship began falling towards Ryloth's surface in a fiery blast. Having won the Spectres the carrier and given a symbol to the people of Ryloth, the rebels returned to Phoenix Squadron, where Gobi, Cham, and Numa bade the Spectres farewell before leaving aboard their shuttle.\nIn 2 BBY, Ryloth was placed under a stronger orbital blockade by the Empire, and Captain Slavin was placed in command of combating the Free Ryloth movement. Though Slavin's attacks and strategies were clumsy, and the Twi'leks could evade capture easily, his forces managed to take control of the Tann Province and set up their headquarters in the Syndulla residence. Gobi reported to Cham that the Empire had mined the Tulara Ravine, which the rebels had previously used to lose Imperial forces in its maze.\nAdditionally, unknown to the Twi'leks, the Empire became better at anticipating the movement's moves due to the arrival of Grand Admiral Thrawn, a brilliant strategist who began cracking down on them. Needing support, Cham contacted the Spectres and asked Hera to deliver supplies to the resistance. While Cham and Numa were on a mission, Gobi met with Hera after she managed to slip past the orbital blockade. Cham and Numa were forced to retreat, however, and were chased by an Imperial convoy near the Tulara Ravine. Cham contacted Gobi for a pickup, and he, along with Hera, arrived aboard the Ghost to rescue the two. After destroying the convoy, Hera flew the Ghost close to the ground, allowing Cham and Numa to jump aboard with their blurrgs.\nGobi sat in the Ghost's main hold with Cham, Numa, and the Spectres when Hera entered and reunited with her father. Cham informed Hera that the Imperials had taken over the Tann Province and that they had become more swift and precise in their counterattacks. Hera asked Cham if he was able to save their family's Kalikori when he escaped their home, prompting Ezra to ask what a Kalikori was. Numa stated that the Kalikori was a totem passed down in Twi'lek families that honor their ancestors. Glie added that each parent added to the artwork to include themselves in the legacy, and Sabine remarked that it was family history as living art. Cham solemnly told Ezra that Hera would have inherited the Syndulla Kalikori, but Hera instead told her father that she was still going to and was going to take it back in honor of her mother. Cham, Gobi, Numa, and the Spectres offered to help her, and they devised a plan to have Hera and a disguised Ezra and Chopper sneak into the Tann Province by creating a diversion inside a ravine near the province.\nInside the ravine, the team prepared to ambush an incoming Imperial convoy by splitting into different groups around the pass; Cham, Gobi, and a pack of blurrgs on one side, Kanan and Zeb on the other, and Sabine and Numa on a cliff above them. As the patrol neared them, Zeb sent a signal to Cham, who then sent one to Numa. Glie and Cham rushed out from hiding with their blurrgs and went headfirst towards the patrol, firing at the stormtroopers and distracting them. Sabine detonated several explosives underneath the convoy, and the rest of the group joined Gobi and Cham in the fray. Amid the commotion, everyone got on a blurrg and retreated, closely followed by the patrol, giving Hera and Ezra a chance to head for the Syndulla estate on a speeder bike, where they joined Chopper, who had already snuck into the compound.\nGobi and Numa led the group through the ravine, and they believed to have lost the Imperials until an AT-DP walker and Imperial Troop Transport arrived and began firing on them. One of the blasts hit the blurrg Kanan and Sabine were riding, and they were stranded in the open while Glie and the others rushed to cover. Cham yelled to Gobi to fire his rocket launcher, and the two rode out to where Kanan and Sabine were. Glie jumped off his blurrg and fired his rocket launcher at the ravine wall above the AT-DP, creating a rockfall that crushed several ground stormtroopers and created a temporary blockade against the transports.\nThe AT-DP blasted through the rock pile and continued its advance, forcing Gobi and the others to retreat again. They took refuge behind some boulders and entered a gunfight with the oncoming Imperial forces. The Imperials, however, stopped firing as they neared, and a hologram of Captain Slavin was broadcast from the AT-DP. Slavin ordered to speak with Cham and mentioned that it was about Hera. Cham demanded to know where she was, and Slavin revealed that he had captured her and Bridger. He told Cham that both would be executed unless he surrendered. Cham walked out from behind a boulder, and Gobi tried to dissuade him from surrendering and said that he was too important, but Cham argued that Hera was just as important. He told Glie that he would trade his life for hers and that she would lead in his place. Cham demanded to know from Slavin what assurance he had that Hera and Ezra would be released, but all Slavin said was that, if Cham didn't arrive by sundown, both would be terminated. Sabine sarcastically noted that the trap couldn't be more obvious, and Cham turned to the group and asked them all to use his sacrifice to free Hera and Ezra.\nGobi and the rest of the rebels boarded the Ghost and flew to the Syndulla home, where Slavin was waiting with Hera and Bridger. Though Cham was willing to turn himself in, Hera surprised him by revealing that Chopper had set several explosives inside their house. Hera ordered Chopper to detonate them, destroying the Syndulla's house and giving them a chance to escape aboard the Ghost. The ship flew past Thrawn's light cruiser, but the Grand Admiral refused to retaliate and instead allowed them to get away. The Ghost later landed near a gorge, where Gobi and Numa mingled with the Spectres while Cham spoke with Hera and Kanan.\nIn the year 5 ABY, after the deaths of Emperor Palpatine and Darth Vader in the Battle of Endor the year prior, the Empire began to fracture heavily amid the chaotic final year of the Galactic Civil War. The Imperials abandoned their bases and garrisons on Ryloth, finally freeing Ryloth from outside rule and granting the world independence. The decades-long resistance movements led by Gobi Glie and Cham Syndulla were credited and lauded by the Twi'leks for the victory. A philosophical successor to the Free Ryloth Movement emerged in the form of the Ryloth Defense Authority, a militia devoted to maintaining Ryloth's hard-fought freedom and neutrality.\nAt some point, Eirriss Ryloth Defense Tech, an arms manufacturer associated with the Free Ryloth Movement, produced a blaster pistol named after Gobi Glie, the Glie-44. The blaster had a lightweight, rugged construction, with a power cartridge as ammunition and a reactant gas port cap in its stock. The blaster saw widespread use by the Resistance, a paramilitary force founded in 28 BBY to combat the spread of the First Order, a neo-Imperial junta.\nGobi Glie was a male Twi'lek who stood 1.84 meters, or 6 feet, tall. As a Rutian Twi'lek, Glie's skin tone was a gradient of blue hues. During the Clone Wars and its immediate aftermath, Gobi was a slender and muscular individual, but by 3 BBY he had aged significantly and become stockier in appearance. Additionally, his face and lekku were covered in scars. Glie spoke both Galactic Basic Standard and Twi'leki.\nA political radical, Glie was a staunch proponent of an independent Ryloth. His decades-long opposition to outside influence on Ryloth was directed not only toward aggressive invaders such as the Confederacy of Independent Systems and the Galactic Empire but the Galactic Republic as well. Unlike Cham Syndulla, who attempted to soften his ways and accept some form of occupation following the Clone Wars, Gobi distrusted outsiders and remained devoted to removing their control over the Twi'lek people. Glie believed that he and his people didn't have a choice besides fighting in order to free Ryloth. Though he had opposed the Republic, Glie held a great deal of respect for General Ima-Gun Di despite Cham's dismissal of him. Gobi respected Di for his commitment to the Twi'leks and was moved by Di's willingness to admit the Republic's failures and his sacrifice to save the rebels, which Glie vowed to remember.\nA close confidante of Cham Syndulla's, Gobi was his most trusted lieutenant and shared a warm friendship with him and his family. Despite Cham's attempts to broker peace with the Empire after the Clone Wars, Glie continued to lead the resistance movement, creating political tensions between the two. Glie couldn't accept Cham's collaboration with the Empire and believed that his decision to enforce a weapons ban made the Twi'leks defenseless. He shared his concerns with Eleni Syndulla and made no secret to the family his intention to continue revolting against an occupied Ryloth. Gobi treated Cham's daughter, Hera, as a niece, but his insistence on including her in his spying, flying, and black market arms dealings put him and Cham at personal odds. Though the two disagreed on what was best for Ryloth, they remained close, and Cham later endangered his relationship with the Empire to rescue Gobi and Hera from imprisonment.\nGlie had little sympathy for the Imperials and took satisfaction in victories against them. During the assault on the Perilous, Gobi eagerly played his part and expressed joy as the battle increasingly turned in the Free Ryloth Movement's favor. Cham chastized Glie for his desire to see the Imperials killed, but though Gobi calmed down, he remained unconcerned that the battle had casualties as long as they were the Empire's. Because he was so devoted to Ryloth's freedom, Gobi and his comrades dismissed rebellions across the galaxy unrelated to theirs, but they later changed their stance and forged an alliance with the Spectres and Phoenix Cell after being inspired by Hera's reminder of how important their struggle was beyond Ryloth.\nGobi Glie was one of the finest soldiers in the Twi'lek Resistance and Free Ryloth Movement. A survivalist at heart and a devoted warrior, Glie was a talented guerrilla fighter and reconnaissance specialist. His combat expertise, both armed and unarmed, made him a leading revolutionary, and he survived many of the conflicts that he took part in, including the Battle of Ryloth. He was also a capable pilot and passed on what he knew to Hera Syndulla, who, as an adult, became an adept flyer. In addition to his guerrilla skills, Glie was a gifted musician and balladeer.\nOver the years, Glie employed the use of a variety of weapons, ranging from blaster pistols to heavier equiptment. In the early Imperial era, he wielded a DC-15A blaster carbine, and he commonly used a DC-17 hand blaster. He additionally used an RPS-6 rocket launcher during the mission to recover the Syndulla Kalikori. Glie was also the owner of his own starship, a Rainhawk-class transport. The ship was an outdated model and was later shot down by Crosshair during Gobi's early insurgency against the Empire, after a supply run where he purchased three dozen DC-15A blasters and a case of thermal detonators.\nDuring the Clone Wars, Glie wore a pair of brown camouflage pants and a white shirt that, by the Battle of Ryloth, was in desperate need of a wash. During the early Imperial era, Gobi wore black and gray combat gear over a brown shirt, with gray vambraces on his forearms. In the later years of the Free Ryloth Movement, Glie had mismatched body armor, including gray torso armor alongside white arm gauntlets with yellow stripes.\nGobi Glie first appeared in \"Liberty on Ryloth,\" the twenty-first episode of the first season of the television series Star Wars: The Clone Wars. The episode, which was written by Henry Gilroy and directed by Rob Coleman, and first aired on March 13, 2009. In the brief appearance, Glie was voiced by Corey Burton, who reprised the character in the third episode of season three, \"Supply Lines,\" where Gobi has an expanded role.\nGlie later appeared in the second season of Star Wars Rebels, \"Homecoming,\" which aired on February 26, 2016, and is featured again in the season three episode \"Hera's Heroes,\" Unlike his previous appearances, Glie is featured as a prominent character in a two episode story arc of the series Star Wars: The Bad Batch, in the episodes \"Devil's Deal\" and \"Rescue on Ryloth,\" which aired on Disney+ on July 9 and July 16, 2021, respectively. Burton voiced Glie once again in both Rebels and The Bad Batch.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gobi_Glie",
  "/wiki/Gobi_Glie/Legends",
  "/wiki/Ryloth",
  "/wiki/Twi%27lek",
  "/wiki/Rutian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Twi%27lek_Resistance",
  "/wiki/Free_Ryloth_Movement",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Standard_decade",
  "/wiki/Cham_Syndulla",
  "/wiki/Clone_Wars",
  "/wiki/Homeworld",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Orn_Free_Taa",
  "/wiki/Hera_Syndulla",
  "/wiki/Admiral",
  "/wiki/Rampart",
  "/wiki/Clone_Force_99",
  "/wiki/Mission_to_Ryloth",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Anakin_Skywalker",
  "/wiki/Perilous",
  "/wiki/Spectres",
  "/wiki/Phoenix_Cell",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Senate",
  "/wiki/Politics",
  "/wiki/Syndulla_clan",
  "/wiki/Emir",
  "/wiki/Wat_Tambor",
  "/wiki/Techno_Union",
  "/wiki/Ryloth_blockade",
  "/wiki/Jedi_General",
  "/wiki/Ima-Gun_Di",
  "/wiki/Outer_Rim_garrison",
  "/wiki/Coruscant",
  "/wiki/Dao",
  "/wiki/Jedi_High_Council",
  "/wiki/Clone_trooper",
  "/wiki/Captain",
  "/wiki/Keeli",
  "/wiki/Blurrg",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Gunship",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Alderaan",
  "/wiki/Representative",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Naboo",
  "/wiki/King",
  "/wiki/Katuunko",
  "/wiki/Toydaria",
  "/wiki/Trade_Federation",
  "/wiki/Pelta-class_frigate",
  "/wiki/Lessu",
  "/wiki/Mace_Windu",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Cazne",
  "/wiki/Twi%27lek_freedom_fighters_hideout",
  "/wiki/C-9979_landing_craft",
  "/wiki/Twi%27leki",
  "/wiki/Howzer",
  "/wiki/19_BBY",
  "/wiki/Eleni_Syndulla",
  "/wiki/C1-10P",
  "/wiki/Imperial_doonium_refinery",
  "/wiki/CT-9904",
  "/wiki/Trandoshan",
  "/wiki/Ord_Mantell",
  "/wiki/Cid",
  "/wiki/Syndulla_residence",
  "/wiki/Tann_Province",
  "/wiki/Serin",
  "/wiki/Gobi_Glie%27s_starship",
  "/wiki/Omicron-class_attack_shuttle",
  "/wiki/Marauder",
  "/wiki/Hunter",
  "/wiki/Tech",
  "/wiki/Thermal_detonator",
  "/wiki/Omega",
  "/wiki/HCVw_A9_turbo_tank",
  "/wiki/Vice_Admiral",
  "/wiki/Rescue_of_Hera_Syndulla",
  "/wiki/Lenk",
  "/wiki/Rescue_of_Cham_and_Eleni_Syndulla",
  "/wiki/Orn_Free_Taa%27s_shuttle",
  "/wiki/Spice",
  "/wiki/Colonel",
  "/wiki/Belkor_Dray",
  "/wiki/Moff",
  "/wiki/Delian_Mors",
  "/wiki/Ryloth%27s_largest_moon",
  "/wiki/14_BBY",
  "/wiki/Mission_to_hijack_an_Imperial_weapons_shipment",
  "/wiki/Yaga_Minor",
  "/wiki/Alpha-3_Nimbus-class_V-wing_starfighter",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Free_Ryloth_Movement_underground_base",
  "/wiki/Ryloth%27s_third_moon",
  "/wiki/Isval",
  "/wiki/Xira",
  "/wiki/Kallon",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Pistoeka_sabotage_droid",
  "/wiki/Shield_bleeder",
  "/wiki/D4L1",
  "/wiki/Caf",
  "/wiki/12_BBY",
  "/wiki/Early_rebellion_against_the_Galactic_Empire",
  "/wiki/Lothal",
  "/wiki/Numa",
  "/wiki/3_BBY",
  "/wiki/Quasar_Fire-class_cruiser-carrier",
  "/wiki/Phoenix_Squadron",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/CR90_corvette",
  "/wiki/Kanan_Jarrus",
  "/wiki/Ezra_Bridger",
  "/wiki/Sabine_Wren",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Imperial_Academy_of_Mandalore",
  "/wiki/Detonator",
  "/wiki/TIE/sa_bomber",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Stun",
  "/wiki/Stormtrooper",
  "/wiki/MSE-6_series_repair_droid",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Arquitens-class_command_cruiser",
  "/wiki/Torpedo",
  "/wiki/Stabilizer",
  "/wiki/2_BBY",
  "/wiki/Slavin",
  "/wiki/Tulara_Ravine",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Ghost",
  "/wiki/Kalikori",
  "/wiki/All_Terrain_Defense_Pod",
  "/wiki/K79-S80_Imperial_Troop_Transport",
  "/wiki/Missile_launcher",
  "/wiki/Tekku_Aylay",
  "/wiki/Yendor",
  "/wiki/5_ABY",
  "/wiki/Battle_of_Endor",
  "/wiki/Ryloth_Defense_Authority",
  "/wiki/Eirriss_Ryloth_Defense_Tech",
  "/wiki/Glie-44_blaster_pistol",
  "/wiki/Resistance",
  "/wiki/28_BBY",
  "/wiki/First_Order",
  "/wiki/Lekku",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Musician",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/DC-17_hand_blaster",
  "/wiki/RPS-6_rocket_launcher",
  "/wiki/Rainhawk-class_transport",
  "/wiki/Clothing",
  "/wiki/Liberty_on_Ryloth",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Henry_Gilroy",
  "/wiki/Rob_Coleman",
  "/wiki/March_13",
  "/wiki/2009",
  "/wiki/Corey_Burton",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Supply_Lines",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Homecoming",
  "/wiki/February_26",
  "/wiki/2016",
  "/wiki/Star_Wars_Rebels_Season_Three",
  "/wiki/Hera%27s_Heroes",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Devil%27s_Deal",
  "/wiki/Rescue_on_Ryloth",
  "/wiki/Disney%2B",
  "/wiki/July_9",
  "/wiki/July_16",
  "/wiki/2021",
  "/wiki/Lords_of_the_Sith",
  "/wiki/Lords_of_the_Sith_(audiobook)",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Hammerhead_Corvettes_Expansion_Pack",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Helmets",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Blasters_and_Ranged_Weapons",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Storm_Over_Ryloth",
  "/wiki/Innocents_of_Ryloth",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Rampage_(episode)",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Star_Wars_Rebels:_The_Siege_of_Lothal",
  "/wiki/A_Princess_on_Lothal",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_BBY",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/The_Mystery_of_Chopper_Base",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars_Rebels:_Steps_Into_Shadow",
  "/wiki/Mon_Mothma",
  "/wiki/Declaration_of_the_Rebel_Alliance",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/Resistance_Reborn",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/December_24"
 ]
}