{
 "name": "Gode Takrab",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation"
     ]
    }
   ]
  }
 ],
 "content": "Gode Takrab was a male Neimoidian trade officer and holo faker working for the Trade Federation during the Naboo crisis of 32 BBY. Although the Federation had captured the planet Naboo, they still needed Queen Amidala to sign an agreement to legitimize their occupation, and she was reticent to do so. Takrab's superior, Rune Haako, ordered Takrab to forge Amidala's signature in an agreement, and to create a mock hologram of her. The Federation intended to send both counterfeits to Coruscant.\nWhen Amidala and her allies attacked the Federation ground headquarters on Naboo during the second attack of Theed, Takrab was ordered to reach the Droid Control Ship orbiting the planet to transmit the message. Although he was escorted by a security detachment in his route to his shuttle, Takrab was nonetheless intercepted and captured by the Naboo Resistance. He was unable to send the communication before the battle was over, and because Amidala survived and communicated with Coruscant herself, the forgery was rendered useless.\nGode Takrab was a male Neimoidian bureaucrat. A minor trade officer working for the Trade Federation, Takrab was a subordinate to Settlement Officer Rune Haako during the last years of the Galactic Republic. In 32 BBY, the Trade Federation secretly settled the planet Alaris Prime and sent its troops to fight a colony of Wookiee settlers led by Attichitcuk. Takrab commanded a number of B1-Series battle droids that were defeated during a skirmish against the Wookiees.\nLater that year, the Trade Federation invaded the planet Naboo and captured its queen, Amidala. Viceroy Nute Gunray, commanding officer of the Federation, wanted the Queen to sign a treaty to legitimize their presence—but Amidala was loathe to do so, and later managed to escape.\nOnce the Federation had captured the capital city of Theed, both Haako and Takrab were assigned to the Theed Royal Palace, on the surface of Naboo. Haako then ordered Takrab to create a false, but convincing, agreement with a forgery of Amidala's signature, along with a fake hologram of the Queen that was to be sent to the Galactic Senate as if it were a message from her. Haako reasoned that even if the Senate did not ratify those files immediately, they would argue about its reliability, giving the Federation precious time to cement its position on Naboo.\nTakrab created an agreement with the false signature and stored it electronically in the memory of his protocol droid, TC-11. Takrab then developed the false message, in which a simulation of Amidala held a data slate supposedly visualizing the treaty. Takrab intended to copy the electronic treaty into a real data slate once he could reach the Droid Control Ship, which was orbiting Naboo at that point. Due to a loss of communications on Naboo staged by the Federation, Takrab could only send the files to Coruscant from the starship.\nShortly after Haako personally approved Takrab's work, Amidala and her allies, including the nascent Naboo Resistance, attacked the Palace. Haako assigned ten security B1 battle droids to escort Takrab to his shuttle, where TC-11 and two more battle droids were already waiting for him. Haako ordered Takrab to reach the Droid Control Ship and send his proofs to the Senate.\nTo avoid a firefight between other battle droids and Captain Panaka's soldiers, Takrab ordered his escort to detour through the repair bay of the Palace. There, they found a few members of the Resistance—including Rorworr, a Wookiee scout; Deel Surool, a Twi'lek scoundrel; and Sia-Lan Wezz, a Human Jedi Padawan—who had separated from the main battle. Confident with his numerical superiority, the Neimoidian ordered his droids to attack, keeping four of them to shield him with their bodies. However, Takrab suffered a panic attack and ran through the crossfire. As the droids were programmed to not shoot at Takrab, this reduced the efficiency of his side.\nThe members of the Resistance defeated the droids and captured Takrab. The Neimoidian pretended to be unaware of the details of his mission and asked to be released, offering his captors a bribe if they escorted him to his shuttle. His captors found the hologram he was carrying and discovered that Takrab did know about it. Nonetheless, Takrab was confident that they would not find the treaty, stored only in his droid.\nNute Gunray then sent several other battle droids, commanded by the officer battle droid RK-7, to secure Takrab's shuttle, which was essential for Takrab's mission or as an emergency exit for Gunray should Takrab be killed. Even then, Takrab did not reach the Droid Control Ship and was unable to send his forgeries. Soon afterward, Queen Amidala captured Federation leaders Gunray and Haako, and her Naboo Royal Space Fighter Corps destroyed the Droid Control Ship, deactivating the battle droids. The Federation had lost the battle. Amidala then contacted Coruscant herself and told the Senate about the situation. Once she had made her statement, Takrab's forged hologram was of no use.\nGode Takrab was a trade officer with extensive experience in the fields of computer use and counterfeiting. He was also familiar with other areas, including diplomacy and commerce. He was unable to pilot ships, and did not even know the activation code of his own shuttle. Takrab was also a mediocre fighter who would rather allow others to protect his life. The possibility of suffering physical damage intimidated him, as was the norm with Neimoidians. Thus, during firefights, he was unable to keep still.\nHis personal effects included a hold-out blaster that he was unable to use effectively. He also had a friend-or-foe identifier hidden in his cowl, an item provided to Trade Federation officers that kept battle droids from attacking them. In addition, Takrab kept two other identifiers in a secret compartment of his personal shuttle. He made heavy use of the protocol droid TC-11, having pre-established code words with him.\nGode Takrab appears in the RPG adventure Peril on Naboo, published in the sourcebook Secrets of Naboo and adapted for Wizards of the Coast's Star Wars Roleplaying Game.\nThe player characters are supposed to capture Takrab and stop his mission, although they do not necessarily find both Takrab's forgeries. Should both be found, however, Queen Amidala would name the characters honorary Palace Guards.\nIn the unlikely case that the player characters are defeated by Takrab's droids, Takrab prompts the droids to escort him to the shuttle and leave for the Droid Control Ship, not giving his fallen enemies a coup de grâce.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Neimoidian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Trade_officer",
  "/wiki/Holo_faker",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Rune_Haako/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Lucrehulk-class_Droid_Control_Ship",
  "/wiki/Orbit/Legends",
  "/wiki/Gode_Takrab%27s_shuttle",
  "/wiki/Naboo_Resistance",
  "/wiki/Settlement_Officer/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Alaris_Prime/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Attichitcuk/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Trade_Federation_Viceroy",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/Fall_of_Theed",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Theed_Royal_Palace/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/TC-11",
  "/wiki/Data_slate",
  "/wiki/Starship/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Peril_on_Naboo",
  "/wiki/Canon",
  "/wiki/Droid/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Quarsh_Panaka/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Rorworr_(Naboo)",
  "/wiki/Scout/Legends",
  "/wiki/Deel_Surool",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Scoundrel",
  "/wiki/Sia-Lan_Wezz",
  "/wiki/Human/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Officer/Legends",
  "/wiki/RK-7",
  "/wiki/Shuttle/Legends",
  "/wiki/Death/Legends",
  "/wiki/Naboo_Royal_Space_Fighter_Corps/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Friend-or-foe_identifier",
  "/wiki/Roleplaying_game",
  "/wiki/Secrets_of_Naboo",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Palace_Guard_(Naboo)",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_64",
  "/wiki/The_Official_Star_Wars_Fact_File_91",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_62",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace"
 ]
}