{
 "name": "Goll",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Free Ryloth Movement"
     ]
    }
   ]
  }
 ],
 "content": "Goll was a Twi'lek male who served in the Free Ryloth Movement during the reign of the Galactic Empire. He helped hunt down Darth Vader and Emperor Sheev Palpatine when the movement destroyed the Star Destroyer Perilous and shot their shuttle down. Goll and his squad were with Cham Syndulla, Isval and Kallon when they discovered the body of Nordon who had tried to kill the two Sith Lords and failed. They were then attacked by Gutkurrs and had to get picked up by Faylin on his ship. They then continued to track their targets until they found them down in a village in a canyon. They attacked the place but soon found themselves under attack by V-wings. Everyone else died, except for Goll, Cham, and Faylin, who escaped.\nFollowing this defeat, Goll left the Free Ryloth movement, but remained in service of his planet. One year later in 13 BBY, Goll purchased a shipment of gattis-root extract from the Karthakk Group to give to the Twi'lek elders on Ryloth, because the Empire had rationed the supply of gattis-root extract in order to ferret out fugitive Free Ryloth insurgents. He was accompanied by \"Clinician\" Trae Baratha of the Karthakk Group who was there to collect the money after the delivery, Hera Syndulla whom he had convinced despite her differences with her father Cham and the crew of the YT-209 freighter Eclipse: Captain Krysiant Rheden, the Nikto gunner Ul'ligan and the Sephi gunner Eira Tay. Upon entering the Ryloth system, their ship, which is posing as the freighter Tirion, is scanned by an Imperial cruiser and cleared for entry. Three Imperial V-wings intercept the Eclipse but the rebels shoot down the enemy starfighters following a brief dogfight, despite being damaged in the process. Goll makes contact with Dianthy, who is supposed to pick up the delivery in Lessu. Approaching the capital, Hera lands the Eclipse in an abandoned commercial landing zone to the city situated beyond the viewing range of the Imperial monitoring stations. There, the rebels deliver their supplies and complete their repairs. Before the Empire can catch up to them, the crew jumps to hyperspace and makes for Manda, where they will be dropped off. Goll compliments Hera for her leadership skills, which she showed after the Eclipse's captain was wounded in the dogfight.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ryloth",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Free_Ryloth_Movement",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Mission_to_Ryloth",
  "/wiki/Anakin_Skywalker",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Star_Destroyer",
  "/wiki/Perilous",
  "/wiki/Cham_Syndulla",
  "/wiki/Isval",
  "/wiki/Kallon",
  "/wiki/Nordon",
  "/wiki/Sith_Lord",
  "/wiki/Gutkurr",
  "/wiki/Faylin",
  "/wiki/V-wing",
  "/wiki/13_BBY",
  "/wiki/Gattis-root",
  "/wiki/Karthakk_Group",
  "/wiki/Trae_Baratha",
  "/wiki/Hera_Syndulla",
  "/wiki/YT-209_freighter",
  "/wiki/Freighter",
  "/wiki/Eclipse_(freighter)",
  "/wiki/Captain",
  "/wiki/Krysiant_Rheden",
  "/wiki/Nikto",
  "/wiki/Gunner",
  "/wiki/Ul%27ligan",
  "/wiki/Sephi",
  "/wiki/Eira_Tay",
  "/wiki/Dianthy",
  "/wiki/Lessu",
  "/wiki/Manda",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Goll",
  "/wiki/Lords_of_the_Sith",
  "/wiki/Lords_of_the_Sith_(audiobook)",
  "/wiki/Mercy_Mission_(short_story)",
  "/wiki/The_Rise_of_the_Empire"
 ]
}