{
 "name": "Gonto Yas",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Gonto Yas was an elderly Human male pazaak gambler who Revan met in Ahto City in 3956 BBY. When Revan asked him about the missing Selkath he attempted to charge him two hundred credits for some information. He also revealed to Revan information about Sunry's affair with Elassa Huros without charging . He said he wasn't interested in either the Sith or the Republic, and they weren't interested in him. When he heard about the attack on Dantooine he openly mocked the Jedi defeat to Revan, not being aware that Revan was a Jedi.\nGonto Yas was somewhat of a rude person and a sore loser when it came to pazaak. When he lost a game, he blamed it on luck, believing that his skill was better then others, even if he was on a losing streak. He liked to gossip, calling the affair between Sunry and Huros a \"juicy tidbit.\" He was also in some ways a hustler who would try to earn credits by selling information that wasn't much of a help.\nIt is possible to make Yas reveal the information involving the missing Selkath without paying by threatening him. This gives the player dark side points. Performing a Force persuasion attempt on Yas also gives the player dark Side points.\nIf the player beats him ten times at pazaak, Yas will eventually refuse to play, saying that he can't afford to.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Pazaak/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Ahto_City",
  "/wiki/3956_BBY",
  "/wiki/Selkath/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sunry",
  "/wiki/Elassa_Huros",
  "/wiki/Sith/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Attack_on_Dantooine_(Jedi_Civil_War)",
  "/wiki/Dantooine/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}