{
 "name": "Goorth",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bespin"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 650 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neo-Bespinian"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.43 meters"
     ]
    }
   ]
  }
 ],
 "content": "Goorth was a Neo-Bespinian, a member of an ancient species native to Bespin. They were a long-lived species characterized by their gaseous appearance and ability to hide within the clouds of the planet's atmosphere.\nGoorth was born on the planet Bespin some 650 years before the Battle of Yavin and was part of an advanced civilization of gaseous beings known as Neo-Bespinians, that were able to hide within the atmosphere of the planet. Sometime during the Galactic Civil War, Goorth infiltrated Cloud City. With his gaseous nature, the Neo-Bespinian was able to stow aboard a freighter and escape the planet. However, Goorth's invisible nature disappeared when the Neo-Bespinian exposed itself to foreign atmospheres. At one point when this happened, the grayish form that Goorth had taken brought a group of bandits after him. Although they tried to ionize him and disperse his molecules, Goorth had absolute control over the gases surrounding its body. As a result, Goorth was able to change the nature of the air around the bandits, suffocating them.\nGoorth was invisible while in the atmosphere of Bespin, but when entering other atmospheres, the foreign gases began to poison the Neo-Bespinian's body. Although naturally invisible, this poisoning gave Goorth a grayish, opaque appearance. This poisoning would have eventually killed Goorth if the Neo-Bespinian stayed in one atmosphere for too long. In order to avoid this, Goorth needed to enter small spaces, such as ships or freighters to expel the poisonous gasses, which kept Goorth from staying in one place.\nGoorth appeared in dossier BXLH: Les mutants dans Star Wars , a roleplaying article in the French magazine Graal 23. Published in 1990, the article was written under the pseudonym \"Haufe the ugly little Ewok.\" The roleplaying statistics provided were compatible with the roleplaying game created by West End Games.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Bespin/Legends",
  "/wiki/650_BBY",
  "/wiki/Neo-Bespinian",
  "/wiki/Species/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Dossier_BXLH:_Les_mutants_dans_Star_Wars",
  "/wiki/Roleplaying_game",
  "/wiki/Graal_23",
  "/wiki/1990",
  "/wiki/Haufe_the_ugly_little_Ewok",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/Graal_(magazine)"
 ]
}