{
 "name": "Gor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Vassek 3"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Roggwart"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Armored plating"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Owner(s)",
     "values": [
      "Grievous"
     ]
    }
   ]
  }
 ],
 "content": "Gor was a male roggwart whom Kaleesh General Grievous of the Confederacy of Independent Systems kept as a pet during the Clone Wars. Gor guarded his master's fortress on the third moon of the planet Vassek; he was tended to by the medical droid EV-A4-D whenever Grievous was away. Gor's body was covered in thick armor; on his back were four cybernetic limbs.\nAfter Count Dooku allowed a Republic task force to infiltrate the lair of General Grievous, the cyborg ordered Gor to kill the intruders. However, the roggwart was killed by Jedi Master Kit Fisto and his apprentice Nahdar Vebb.\nDuring the Clone Wars, General Grievous used his beloved pet roggwart, Gor, to protect his castle on the third moon of Vassek. Grievous ordered his medical droid, EV-A4-D, to enhance Gor's body, thus the roggwart was covered in thick armor and two pairs of cybernetic limbs were attached to his back.\nAfter General Grievous suffered a series of defeats at the hands of the Jedi, a desire to reassess the cyborg's effectiveness grew within Count Dooku. The Count lured Republic forces to Grievous' castle and remotely deactivated the general's IG-100 MagnaGuards; this left no one to feed Gor. Hungry, the roggwart shrieked as Kit Fisto, Nahdar Vebb, and a squad of clone troopers led by Commander Fil infiltrated his master's lair.\nUpon returning to his castle, General Grievous  was ambushed by Fisto, Vebb, and the clones. The Republic forces severely damaged Grievous; before beginning the necessary repairs to his body, the general released Gor to \"play\" with his uninvited guests. While Gor managed to kill Commander Fil, briefly overpower Nahdar Vebb, and even disarm Kit Fisto, the roggwart ultimately met his end when the Nautolan used a lightsaber to stab him in the throat.\nFully repaired by the time of Gor's death, General Grievous was greatly upset by the revelation of his pet's murder. Which became yet another reason for his disdain for the Jedi.\nGor was a predatory, non-sentient beast that possessed large, sharp teeth and twin horns that curved downward from the top of his head. Gor had a long, prehensile tail that he used to impale and grab his foes, and he also had sharp claws on his hands and feet. The roggwart was quite muscular; his thick hide was capable of withstanding blaster shots and modest lightsaber wounds. A chest plate protected Gor's vital organs, while a durable helmet shielded his brain, while his soft neck was left exposed. Gor shrieked loudly when hungry or angered, and he was quite aggressive.\nGor appeared in the first season of Star Wars: The Clone Wars, specifically during the episode \"Lair of Grievous.\" Vulture and lion vocalizations were combined to create the roggwart's shrieks.\nThe sourcebook Ultimate Star Wars erroneously identifies Gor as the killer of Nahdar Vebb. In actuality, Vebb was slain by General Grievous, while it was Vebb's clone Commander, Fil, who died to Gor.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gor",
  "/wiki/Gor/Legends",
  "/wiki/Gor_(disambiguation)",
  "/wiki/21_BBY",
  "/wiki/Vassek_3",
  "/wiki/Roggwart",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Grievous",
  "/wiki/File:GorTimeToEntertain-LoG.ogg",
  "/wiki/Kaleesh",
  "/wiki/General",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Clone_Wars",
  "/wiki/Grievous%27s_fortress",
  "/wiki/Planet",
  "/wiki/Vassek",
  "/wiki/Medical_droid",
  "/wiki/EV-A4-D",
  "/wiki/Armor",
  "/wiki/Cybernetics",
  "/wiki/Limb",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Galactic_Republic",
  "/wiki/Cyborg",
  "/wiki/Death",
  "/wiki/Jedi_Master",
  "/wiki/Kit_Fisto",
  "/wiki/Nahdar_Vebb",
  "/wiki/Third_moon_of_Vassek",
  "/wiki/Jedi",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/IG-100_MagnaGuard",
  "/wiki/Foodstuff",
  "/wiki/Squad",
  "/wiki/Clone_trooper",
  "/wiki/Clone_Commander",
  "/wiki/CC-3714",
  "/wiki/Mission_to_Vassek_3",
  "/wiki/Nautolan",
  "/wiki/Lightsaber",
  "/wiki/File:WellThatWasSomething-LoG.ogg",
  "/wiki/Sentience",
  "/wiki/Tooth",
  "/wiki/Helmet",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Lair_of_Grievous",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Cloning",
  "/wiki/Commander",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_65",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/The_Separatists",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Blue_Shadow_Virus",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_53",
  "/wiki/Droid_Directory"
 ]
}