{
 "name": "Gor_Koresh",
 "display_name": "Gor Koresh",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Abyssin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.73 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Carnita arena"
     ]
    }
   ]
  }
 ],
 "content": "Gor Koresh was an Abyssin male gangster, gambler, and entrepreneur who organized gladiator matches at his own arena and hunted Mandalorian remnants for their beskar armor during the New Republic's reign. At his arena in 9 ABY, the Abyssin met the Mandalorian bounty hunter Din Djarin and the infant Grogu. The Mandalorian inquired about finding others of his kind, but Koresh advised the bounty hunter to enjoy the entertainment first.\nKoresh attempted to trick the Mandalorian into a bet in order to win the bounty hunter's beskar armor, but when Djarin refused the offer, the Abyssin and his assailants held the bounty hunter at gunpoint. Nevertheless, Djarin defeated Koresh's allies and intercepted Koresh outside the fighting pit, interrogating the Abyssin for the information he desired. After Koresh gave in, the Mandalorian left him to face wild dogs.\nDuring the reign of the New Republic, the Abyssin gangster, gambler, and entrepreneur Gor Koresh profited from various criminal activities, including organizing underworld gladiator matches at his own arena, the Carnita arena in the warehouse district of a barren city on an Outer Rim planet. He also hunted Mandalorian remnants for their armor made of beskar, which was rising in value. Koresh at some point heard about a supposed Mandalorian on the planet Tatooine. The apparent Mandalorian was in reality Cobb Vanth, the marshal of the Tatooine mining town Mos Pelgo who had acquired a set of Mandalorian armor from Jawas in 4 ABY. Koresh also learned about the Mandalorian bounty hunter Din Djarin, who closely protected the infant foundling Grogu.\nIn 9 ABY, Djarin traveled to Koresh's arena, having been told that the gangster knew of the whereabouts of other Mandalorians. Koresh sat ringside at his arena, betting on one of the Gamorrean fighters in the ring, when he was approached by Djarin and Grogu. Looking between the pair, the gambler remarked that the pit was no place for a child like Grogu, but the Mandalorian stated that the foundling went wherever he went. Djarin told Koresh that he was looking for information on other Mandalorians in the galaxy as part of a quest to return Grogu to his own kind. Koresh, more fixated on the fight, advised the bounty hunter to enjoy the entertainment instead of going straight to business.\nThe Gamorrean that Koresh had bet on was knocked to the ground, so the displeased gangster shouted for the other Gamorrean to kill their opponent. As the injured Gamorrean struggled to survive, Koresh put the information Djarin needed up for a bet on whether the losing Gamorrean would die within the next minute and a half. In turn, the Abyssin requested the Mandalorian put up his beskar armor for the bet. Djarin refused, so Koresh shot the winning Gamorrean with his blaster pistol, and his armed assailants swiftly surrounded the Mandalorian with their own blasters drawn as part of Koresh's own trap.\nThe arena's audience promptly fled the venue, and Koresh bragged about not having to seek out Djarin for his armor and told his new captive of how fond he had become of the increasingly expensive beskar. The gangster demanded Djarin's armor in return for not killing the Mandalorian, but in reply, Djarin threatened to kill Koresh if he did not tell him where other Mandalorians could be found. After Koresh remarked that he thought Djarin was not a gambler, the Mandalorian used his whistling birds to eliminate the Abyssin's armed assailants and fought the arena's workers. Koresh fled the arena as Djarin defeated the remainder of the gambler's people.\nKoresh ran outside and down the street when Djarin, exiting the arena, snared the gangster with his fibercord whip, pulling him across the ground and hanging him on a lamppost. Turning to try and befriend his captor, the Abyssin panically offered Djarin the information he desired in return for his life. He revealed what he knew of the alleged Mandalorian on Tatooine, swearing the information to be true by a gotra. Djarin then began leaving, and Koresh begged to be freed from the grappling line, claiming it was part of their deal. The Mandalorian instead shot out the light post with his blaster pistol, allowing several local wild dogs to advance on the gangster and try to kill him as he screamed in fear.\nGor Koresh was a 1.73-meter-tall  Abyssin male with green skin; gray, thinning hair; and a single brown eye. The deceitful entrepreneur had a habit of double-crossing or killing anyone who interfered with his exploits. He grew fond of beskar as it rose in value and hunted Mandalorians to harvest their beskar armor. The Abyssin watched Grogu come to his arena with bemusement and disapproval, believing it was no place for the child.\nKoresh tried to convince Djarin into betting for information in an attempt to trick him into handing over his beskar armor. When Djarin did not play into the gambler's trick, Koresh and his assailants held the bounty hunter at gunpoint, with Koresh chuckling as he bragged to the Mandalorian. After Djarin defeated all of Koresh's allies and apprehended him, the Abyssin gave up information on a possible Mandalorian in an attempt to preserve his life, his voice cracking as he attempted to maintain some composure while being hung from a lamppost. Koresh's voice grew hoarse and breathless as he swore his information by a gotra.\nGor Koresh wore brown under-clothing, brown gloves, and a white sport coat. The coat included a symbol of his arena, intended to give an air of respectability. He donned black trousers and brown boots. He also wielded a blaster pistol that was modified for Abyssin vision.\nGor Koresh first appeared in \"Chapter 9: The Marshal,\" the premiere episode of the second season of the Disney+ live-action series The Mandalorian, which was directed by show-runner Jon Favreau and aired on October 30, 2020. Koresh was voiced by John Leguizamo and portrayed in costume by John Rosengrant.\nKoresh was initially teased in the official trailer for The Mandalorian Season Two, which was published on YouTube on September 15, 2020. On YouTube, the trailer's captions initially identified the character as \"Gore Keresh,\" but they were later changed to remove the name and simply identify the character as an alien. The subtitles on the Disney+ version of the trailer wrote the name as \"Gor Koresh\" but were also subsequently removed. The \"Launchpad\" section of the 202th issue of Titan Magazines' Star Wars Insider, published on April 27 of 2021, used the spelling \"Gor Keresh,\" as did the \"Jedi Master's Quiz\" section of Star Wars Insider's 203rd issue, published on June 22 of that year.\nIn the first drafts for \"Chapter 9: The Marshal,\" written by Favreau during the holiday break at the end of 2018, Koresh was described as a \"foul cyclops\" with a pair of earrings and a nose ring. The director also put across the idea that the character would be sat among a crowd of spectators on simple bench seating with bodyguards rather than being a distant spectator or on a throne, while arts director Doug Chiang described Koresh to concept artists as akin to an emperor of the Colosseum, stating that he would decide the fates of competing Gamorreans. Working off of another description of Koresh as a \"low-level crime boss,\" artist Brian Matyas gave the character a design inspired by the \"old-school\" work of animator Ray Harryhausen with a retro-style color palette.\nIn another concept, Matyas worked off of Chiang's emperor idea, giving Koresh a very simple costume. One of Matyas's other concepts for the character included a helmet with a monocle visor, playing off of the idea of an Abyssin \"assassin-hitman-henchman with a helmet.\" Matyas chose to make later designs resemble a classic mob boss, being inspired by Tony Soprano, a character from the television series The Sopranos, which translated into the final design of Koresh.\nDuring Leguizamo's rehearsal for Koresh voice, Favreau advised the voice actor to come across as a \"high status mob boss\" like Don Corleone, a character from The Godfather film series. Lines about Koresh calling his Gamorrean the best in his stable were included during the rehearsal but did not make it into the episode. Filming for \"Chapter 9: The Marshal,\" including Koresh's scenes, took place over thirteen days during November 2019.\nJoe Schreiber's 2022 junior novelization of The Mandalorian Season Two describes Koresh as having a nose ring, in line with the first drafts of \"Chapter 9: The Marshal.\" However, his depiction in the finished episode did not include a nose ring. The novel also presents some of Koresh's lines differently to how they are said in the episode or presented in the subtitles. Additionally, the novelization describes Koresh rising to his feet when shooting the Gamorrean while the episode shows him being seated until the second Gamorrean attacks Djarin. This article uses the information from the episode when it differs from its novelization.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Gor_(disambiguation)",
  "/wiki/Abyssin",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Carnita_arena",
  "/wiki/Gangster",
  "/wiki/Gambler",
  "/wiki/Gladiator",
  "/wiki/Hunting",
  "/wiki/Mandalorian",
  "/wiki/Beskar",
  "/wiki/Mandalorian_armor",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Era",
  "/wiki/9_ABY",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Youngling",
  "/wiki/Grogu",
  "/wiki/Bounty",
  "/wiki/Din_Djarin%27s_armor",
  "/wiki/Blaster",
  "/wiki/Wild_dog",
  "/wiki/Warehouse_district_(Carnita_arena)",
  "/wiki/City",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Unidentified_Outer_Rim_planet_(Carnita_arena)",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Cobb_Vanth",
  "/wiki/Marshal",
  "/wiki/Mining",
  "/wiki/Freetown",
  "/wiki/Boba_Fett%27s_armor",
  "/wiki/Jawa",
  "/wiki/4_ABY",
  "/wiki/Foundling",
  "/wiki/Unidentified_Gamorrean_fighter_2",
  "/wiki/Gamorrean",
  "/wiki/The_galaxy",
  "/wiki/Jedi",
  "/wiki/Unidentified_Gamorrean_fighter_1",
  "/wiki/Death",
  "/wiki/Standard_minute",
  "/wiki/Blaster_pistol",
  "/wiki/Armor",
  "/wiki/Whistling_bird",
  "/wiki/Fibercord_whip",
  "/wiki/Gotra",
  "/wiki/The_Mandalorian%27s_IB-94_blaster_pistol",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Pistol",
  "/wiki/Chapter_9:_The_Marshal",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Jon_Favreau",
  "/wiki/October_30",
  "/wiki/2020",
  "/wiki/John_Leguizamo",
  "/wiki/John_Rosengrant",
  "/wiki/September_15",
  "/wiki/Alien",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Titan_Magazines",
  "/wiki/Star_Wars_Insider",
  "/wiki/April_27",
  "/wiki/2021",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/June_22",
  "/wiki/2018",
  "/wiki/Piercing",
  "/wiki/Doug_Chiang",
  "/wiki/Brian_Matyas",
  "/wiki/Monocle",
  "/wiki/Assassin",
  "/wiki/Helmet",
  "/wiki/November",
  "/wiki/2019",
  "/wiki/Joe_Schreiber",
  "/wiki/2022",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/The_Mandalorian:_The_Rescue",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_Two)",
  "/wiki/Mandalorian_Mayhem",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Gor_Koresh",
  "/wiki/Aftermath_(novel)",
  "/wiki/Temmin_Wexley",
  "/wiki/Norra_Wexley",
  "/wiki/Akiva",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/File:Gore-name-reveal.jpg",
  "/wiki/File:Gore-name-removed.jpg",
  "/wiki/File:Gor-Koresh-caption.png",
  "/wiki/May_7",
  "/wiki/2013",
  "/wiki/July_9",
  "/wiki/April_4",
  "/wiki/2007",
  "/wiki/July_17",
  "/wiki/2012",
  "/wiki/April_18",
  "/wiki/2014",
  "/wiki/November_12"
 ]
}