{
 "name": "Goran",
 "display_name": "Goran",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Skystrike Academy",
      "Imperial Starfighter Corps",
      "Skystrike Academy",
      "Imperial Starfighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "Goran was a human male officer that served in the Galactic Empire as an instructor. Two years before the Battle of Yavin, he held the rank of commandant, serving as flight instructor of the elite Skystrike Academy on Montross. Under his command was Captain Vult Skerris.\nGoran was the flight instructor of the Skystrike Academy during the Age of the Empire. The Skystrike Academy was one of the Galactic Empire's top Imperial academies and produced TIE fighter pilots. Three of his Academy's cadets included Wedge Antilles, Hobbie, and Rake Gahree. Two years before the Battle of Yavin, Wedge and his two friends became disillusioned with the Empire and made arrangements to defect to the rebellion. The Phoenix Cell sent Sabine Wren to extricate the defecting cadets.\nAfter a disguised Sabine arrived with a new intake of cadets, Goran addressed the cadets and told them that only the best students would survive the Academy. He added that their performance at previous academies would have little bearing on their success at the Skystrike Academy. Goran then told them that a combat practice simulation would take place 0600 hours the following day before dismissing them.\nThe following morning, Goran supervised Wedge and Sabine in their combat simulation exercise. When Wedge and Sabine , referred to themselves by their real names, he reminded them to use only their call numbers. The two cadets managed to destroy four simulated Y-wings but were destroyed by a simulated version of the rebel freighter Ghost, which was piloted by Captain Vult Skerris. Following the exercise, Goran instructed Wedge and Sabine to report for a debriefing. He watched as Skerris warned the cadets about the consequences of disobeying orders.\nGoran later greeted the visiting Governor Arihnda Pryce and the Imperial Security Bureau Agent Kallus, who had traveled to investigate reports that some cadets were planing to defect to the rebellion. Goran expressed disbelief that there were traitors among his cadets and opined that his cadets were were trained and loyal. However, Governor Pryce insisted on going ahead with the investigation. As a result, the Skystrike Academy was placed on lockdown, operations were suspended, and cadets were questioned by Agent Kallus.\nHowever, Kallus' investigation yielded no results. When Goran expressed frustration at the disruption the investigation was causing to his Academy, Pyrce suggested that they could reach a mutual agreement by getting the cadets back into space. With Pryce's approval, Goran ordered all of the cadets to report to their TIE fighters and engage in a mock combat exercise in space. Over the intercom, Goran informed the cadets that their laser cannons had been nullified but that their scores would still register on the charts. As expected, Sabine and the defecting cadets took the bait and tried to fly towards a rebel CR90 corvette commanded by Ezra Bridger.\nAfter sighting the rebel ship, Goran watched as Governor Pryce ordered the four cadets to returned. When they refused, she deactivated their solar collector panels and sent Captain Skerris and his TIE interceptors to attack the rebel ship. The rebel ship managed to escape into hyperspace. Under Pryce's orders, Skerris destroy Rake's TIE fighter. Goran did not intervene when Governor Pryce and Agent Kallus handled the rebellious cadets. Ultimately, Sabine and the defecting cadets managed to escape the Academy with the help of Kallus, who had come to respect Sabine's rebel comrade Garazeb Orrelios and wanted to return him a favor.\nGoran was a human man who served as the flight instructor of the elite Skystrike Academy. He took pride in the quality and caliber of his students and initially refused to believe reports that there were defectors within his Academy. He was a tough and unforgiving instructor but was blind to the rebel sympathies of his students. Goran was deeply embarrassed when Governor Pryce and Agent Kallus visited his Academy to investigate the presence of rebel defectors.\nDespite his unhappiness with the investigation, Goran complied with Governor Pryce's orders.\nGoran appeared in the second episode of the television show Star Wars Rebels' third season, \"The Antilles Extraction,\" in which he was voiced by Corey Burton, who also voiced Rake Gahree. He was identified in the episode's credits. The databank for Goran had incorrectly named him as Relik, but was later fixed. The 2018 canon sourcebook, Dawn of Rebellion, released by Fantasy Flight Games also incorrectly names him as Relik.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Goran_(disambiguation)",
  "/wiki/Special:Upload",
  "/wiki/Sons_of_the_Sky",
  "/wiki/TIE_Fighter_Owners%27_Workshop_Manual",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Skystrike_Academy",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Officer",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Military_rank",
  "/wiki/Commandant",
  "/wiki/Flight_instructor",
  "/wiki/Montross",
  "/wiki/Captain",
  "/wiki/Vult_Skerris",
  "/wiki/Imperial_Era",
  "/wiki/Imperial_Academy",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Imperial_cadet",
  "/wiki/Wedge_Antilles",
  "/wiki/Derek_Klivian",
  "/wiki/Rake_Gahree",
  "/wiki/Phoenix_Cell",
  "/wiki/Sabine_Wren",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Ghost",
  "/wiki/Governor",
  "/wiki/Arihnda_Pryce",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Treason",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Laser_cannon",
  "/wiki/CR90_corvette",
  "/wiki/Ezra_Bridger",
  "/wiki/Solar_collector",
  "/wiki/TIE/IN_interceptor",
  "/wiki/Hyperspace",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels_Season_Three",
  "/wiki/The_Antilles_Extraction",
  "/wiki/Corey_Burton",
  "/wiki/2018",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/Star_Wars_Rebels_Magazine_33",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Chimaera_Expansion_Pack",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Skystrike_Academy_Squadron_Pack",
  "/wiki/Databank_(website)"
 ]
}