{
 "name": "Gorak  (Trandoshan)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Phylus Mon"
     ]
    }
   ]
  }
 ],
 "content": "Gorak was a Trandoshan female mercenary and slave.\nGorak did not recall her first years. She knew she was raised as a slave in a starship and mocked by Wookiees for being short, pink-eyed and specially for being albino. Apparently she was rented for a week by a huge Wookiee, but she could not recall what happened. At that time, she was also regularly beaten, which served to increase her skin's hardness.\nAfter some years, she became a stout, albeit still short, young adult. She was big enough to become a threat. Although she was still a slave, she was no longer mocked.\nEventually Gorak was freed, and she met slaver Phylus Mon. Phylus Mon offered Gorak a job at his zoo, food and clothes, as well as a sense of importance. However, upon hiring her, Phylus Mon injected an explosive near Gorak's heart. The device would kill Gorak should Phylus Mon die for any reason. The bomb could be deactivated if hit by an ion weapon, but Phylus Mon did not allow any ion weapon in his ship, the Animiasma. This mechanism was a security measure that Phylus Mon used in every one of his slaves. At the same time, Phylus Mon paid his slaves and insisted in calling them employees - but at the same time, all of them knew they could not leave his service or they would die.\nPhylus Mon was a hunter and he also dealt in huge animals. Gorak's job included handling violent animals, apparently because of her own experience with violence and because of her phylosophical views on the innate violence of the reality. After years working on it, and specializing in Acklays and Rancors, Gorak developed the ability to identify most non-sentient species by their odor. She also developed claustrophobia.\nIn around 20 BBY, Phylus Mon decided to take Gorak in a mission to the Cularin system onboard the Animiasma . Gorak was not informed of the details, but she was introduced the other members of the team. She disliked Nalz the Spiner as a useless technician, although she tried to remember that, if he were so useless, Phylus Mon would not have trusted him. He did not like the Human, but she assumed he might have some local contacts. She sexually liked the Barabel bounty-hunter Yerj, although the feeling was not mutual. However, the last team member was the Wookiee Kaarror, for whom she felt an innate hatred.\nGorak and the other minions attacked the Almas Sith fortress in Cularin system. The fortress entrance was being protected by six Jedi, but Phylus Mon sent no less than thirteen minions, including his Wampa bodyguard Ku-Kak. Phylus Mon's team killed four of the Jedi and defeated the other two, even although Gorak and Kaarror spent the whole battle insulting each other from different sides of the field.\nIn the fortress, Phylus Mon performed a Sith ritual to transform Gorak and the others in Sith battlelords: After a dangerous, life-threatening process, they were supposed to rise as powerful military commanders that could use Force powers to deal with insubordination of their troops. However, something went wrong with the ritual: Gorak and the other prospective Battlelords were stripped of their Force-essences, which would be stored in a large crystal.\nPhylus Mon left the fortress with the crystal, but without Kaarror and the other empty bodies. Those bodies would then be found by a search team sent by the Jedi in the Almas Academy. The bodies were sent to the Academy. There, the Jedi tried their best to recover the lost essences and restore them to their previous state.\nOne player character in A Mon Alone can, at a certain point, enter this non-player character's body and use Gorak's statistics until his essence can be freed , or until Gorak's body is killed in action. The text explains that some of the final scenes are so dangerous that they could easily kill the player characters - leading to the players getting angry.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gorak",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Phylus_Mon",
  "/wiki/Slavery/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Animiasma",
  "/wiki/Acklay/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Cularin_system",
  "/wiki/Nalz",
  "/wiki/Spiner",
  "/wiki/Karae_Nalvas",
  "/wiki/Barabel/Legends",
  "/wiki/Yerj",
  "/wiki/Kaarror",
  "/wiki/Almas_Sith_fortress",
  "/wiki/Wampa/Legends",
  "/wiki/Ku-Kak",
  "/wiki/Sith_battlelord",
  "/wiki/Almas_Academy",
  "/wiki/A_Mon_Alone",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Night%27s_Homecoming"
 ]
}