{
 "name": "Gorgara",
 "display_name": "Gorgara",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "14 BBY",
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chirodactyl"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Gorgara was a female chirodactyl that resided on the planet Dathomir, known in local legends as \"the winged daemon of the canyon.\" When Gorgara began to collect bones, it was a sign of unrest. Gorgara was part of a rite of passage for the strongest Nightbrothers - to venture into her lair and return alive.\nThis female chirodactyl lived in areas that were very difficult to access, at altitudes that it was foolish to try to reach without a ship, or in the dark depths of gloomy canyons and caves.\nWith a wingspan of several dozen meters, eyes that seemed to be blind, enormous talons, and a head reminiscent of an owl with teeth, Gorgara feared no rival. For good reason: she was classified as a super-predator, with no known predator that could take her down. Nevertheless, despite her power, size and the dangers that surrounded her territory, Gorgara was killed in a battle with the Jedi Padawan Cal Kestis after crashing into a wall of rock whilst attempting to throw Kestis from her hair.\nEven with the clawed wingtips, the shockwave-inducing howl and her ability to spit a deadly dark substance, the Jedi severely wounded it in her lair, forcing her to flee. Gorgara counterattacked when Kestis attempted to climb a cliffside to the upper reaches of the ruins of Dathomir. However, injured and disoriented by the Jedi who clung to her neck, the chirodactyl hit many rocks in mid-air until she fell to her death.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Dathomir",
  "/wiki/14_BBY",
  "/wiki/Chirodactyl",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Planet",
  "/wiki/Nightbrothers",
  "/wiki/Starship",
  "/wiki/Cave",
  "/wiki/Eye",
  "/wiki/Tooth",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Cal_Kestis",
  "/wiki/Death",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Gorgara",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Bespin_and_Other_Outer_Rim_Planets",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Databank_(website)",
  "/wiki/Template:JFODate"
 ]
}