{
 "name": "Gorgeous_Su",
 "display_name": "Gorgeous Su",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 5 ABY",
      "Troithe"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Houk"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "61st Mobile Infantry",
      "Wyl Lark's squadron",
      "61st Mobile Infantry",
      "Wyl Lark's squadron"
     ]
    }
   ]
  }
 ],
 "content": "Gorgeous Su was a Houk female member of the New Republic's 61st Mobile Infantry, and the brother of the New Republic soldier Jorgatha. During an operation on the planet Troithe, she and her brother were routed from their positions during an attack by the Galactic Empire's 204th Imperial Fighter Wing. Regrouping with other New Republic personnel, Su was selected by the New Republic pilot Wyl Lark to fly in his makeshift squadron. She was given a Humble HoverCat airspeeder before the New Republic forces began travelling covertly through Troithe's underground tunnel network.\nDuring their travels, Su encouraged her squadron to play the game Who? What? Where?, the Houk sparking some disagreement with her own submission to the game. A scout from the 204th's Squadron Three then came across the New Republic complement in the tunnels. While the scout was killed facing Lark, she was soon followed by Squadron Three, which Su spotted during reconnaissance in the tunnels. While Lark tried to have her distract the TIE fighter squadron with him, she was pursued by the TIEs and killed, and Squadron Three was cut off from the New Republic forces when one of their vehicles detonated to block a tunnel entrance.\nGorgeous Su at one point became married to Thage Howless, an individual who eventually became separated from her. During the Galactic Civil War, she and her brother Jorgatha served in the New Republic's 61st Mobile Infantry, Jorgatha becoming a New Republic soldier and eventually a squad commander. Around 5 ABY, the 61st fought in the city districts of the ecumenopolis planet Troithe as part of a campaign against the Galactic Empire's control in the Deep Core's Cerberon system led by General Hera Syndulla's New Republic battle group. However, the battle group was devastated in an attack by the Empire's 204th Imperial Fighter Wing, which routed the 61st's forces from their positions on the surface of Troithe.\nSu, Jorgatha, and around fifty other New Republic personnel and around twenty additional local militant sympathizers gathered at a three-story speeder garage in Troithe's Highgarden District. With the 61st's commanding officer, Captain Hazram Namir, stranded on an asteroid, Sergeant Carver assumed command of the complement of New Republic personnel. In a meeting between the remnant's senior personnel, it was decided that Wyl Lark and Nath Tensent, two New Republic pilots would build up a new makeshift squadron to reinforce their air power against the 204th. While Tensent sought out aircraft, Lark canvassed the New Republic personnel and chose Su and the 61st members Sergeant Vitale, Denish Wraive, Ubellikos, and Prinspai as they all had some form of flight experience.\nIn the meantime, the remnant of New Republic personnel traveled across the Highgarden District and into a tunnel network under the surface in order to covertly travel to the Scar of Troithe. Tensent was able to acquire airspeeders, skimmers and a V-wing starfighter for the new pilots to join him and Lark in flight, as well as unarmed ground vehicles for the rest of the New Republic personnel to travel in as a caravan, from sympathizers at the factory district the Web. Su herself received a Humble HoverCat airspeeder which she could barely fit into the cockpit of. While travelling through the tunnels, the new pilots were the freshly formed squadron was ran through drills by Lark, who ran them through past encounters with the 204th and gave them improper training in the space that the tunnels provided.\nTravelling through the tunnels, Wraive commented on the presence of houses preserved in the stone of the tunnels over the squadron's comm channel, and Su replied with rumors she had heard of buried \"ghost civilizations.\" Later on, the Houk, out of boredom, suggested to her fellow pilots that they play Who? What? Where?, a game where the participants predict who first heard about their death, what caused their death, and where they died. After Lark approved of the game, Tensent was nominated to go first by the other pilots, with Vitale going after him. Su followed Vitale, choosing her husband Howless as who would hear of her death, and predicting her death to be ramming into the 204th's flagship with warheads somewhere along the Rimma Trade Route.\nWraive was skeptical about Su getting her Humble HoverCat all the way to the Rimma, Su expressing her displeasure at the speeder's model name. Vitale also chimed in, arguing that Lark and Tensent's squadron, Alphabet Squadron, had dibs on ending the 204th, although Tensent was open to sharing it. As the other pilots took their turns in Who? What? Where?, Vitale alerted them to an approaching TIE fighter, a scout from the 204th's Squadron Three. Lark pursued the TIE scout, which destroyed itself trying to bury Su's squadron commander with rubble from the tunnel ceiling. With the caravan having been encountered by a 204th scout, Carver chose for his people to get some distance from where the encounter had taken place.\nLark told Su and the other pilots that their top priority was to protect their comrades in the caravan, which Su and her comrades acknowledged one by one. She later went on a reconnaissance mission, where she spotted the rest of Squadron Three, alerting Lark to the enemy and transmitting her readings. When Lark suggested using the TIE scout's tactic, Su pointed out that it had led to the scout's death. Her commander then chose to fly for her position to distract the TIEs, much to the protesting of Carver and the other pilots. Choosing to go ahead with his plan, Lark had Su activate jammers. Squadron Three approached and fired on Su as the caravan passed into another tunnel. That was when Carver had the final vehicle of the convoy self-destruct, blocking the newer tunnel's entrance. Su was killed during the chaos.\nWith Lark effected by Su's death, Tensent assured his fellow pilot that she had been outnumbered and that her fate was not preventable. The caravan eventually reached the Scar of Troithe, finding that the 204th had reached their target, the Core Nine mining megafacility, before them. The New Republic forces attacked the facility and, with the help of reinforcements, drove the fighter wing out of the Cerberon system. Days after the battle, which saw the deaths of Ubellikos, Prinspai and Carver among others, Lark spoke of the latter and Su with General Syndulla. He, Vitale and Wraive later mourned the lost pilots from their squadron. During the Battle of Jakku, Tensent led a starfighter wing, Vitale and Wraive among the pilots in the wing, in a final battle with the 204th. During the fighting, pilots from each side called out names of their fallen comrades, one choosing to call out Gorgeous Su's name.\nA Houk female, Gorgeous Su chose to be ignorant of the superstitions around the rumored ghost civilizations under Troithe. To quell her boredom, she got the other pilots of Wyl Lark's squadron to play Who? What? Where? to pass the time. In her turn, she recalled her husband Thage Howless as her love, but in contrast called his heart black. Su disliked her Humble HoverCat, comparing it to a child's toy. When Lark suggested using the same tactics against Squadron Three as what their scout had attempted, Su was sure to point out how the scout's attempt had backfired.\nGorgeous Su first appeared in the 2020 novel Shadow Fall, the second installment of the Star Wars: Alphabet Squadron trilogy which was written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/5_ABY",
  "/wiki/Troithe",
  "/wiki/Houk",
  "/wiki/Gender",
  "/wiki/New_Republic",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Wyl_Lark%27s_squadron",
  "/wiki/New_Republic_soldier",
  "/wiki/Jorgatha",
  "/wiki/Troithe_operation",
  "/wiki/Planet",
  "/wiki/Attack_on_Cerberon",
  "/wiki/Galactic_Empire",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/New_Republic_pilot",
  "/wiki/Wyl_Lark",
  "/wiki/Airspeeder",
  "/wiki/Who%3F_What%3F_Where%3F",
  "/wiki/Garmen_Naadra",
  "/wiki/Squadron_Three_(Shadow_Wing)",
  "/wiki/Death",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Squadron",
  "/wiki/TIE_line",
  "/wiki/Marriage",
  "/wiki/Thage_Howless",
  "/wiki/Galactic_Civil_War",
  "/wiki/Squad",
  "/wiki/Commanding_officer",
  "/wiki/City",
  "/wiki/Ecumenopolis",
  "/wiki/Campaign_in_the_Cerberon_system",
  "/wiki/Deep_Core",
  "/wiki/Cerberon_system",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Barma_Battle_Group",
  "/wiki/Speeder",
  "/wiki/Highgarden_District",
  "/wiki/Officer",
  "/wiki/Captain",
  "/wiki/Hazram_Namir",
  "/wiki/Asteroid_CER952B",
  "/wiki/Sergeant",
  "/wiki/Carver",
  "/wiki/Nath_Tensent",
  "/wiki/Vitale",
  "/wiki/Denish_Wraive",
  "/wiki/Ubellikos",
  "/wiki/Prinspai",
  "/wiki/Scar_of_Troithe",
  "/wiki/Skimmer",
  "/wiki/Alpha-3_Nimbus-class_V-wing_starfighter",
  "/wiki/Pilot",
  "/wiki/Web",
  "/wiki/Warhead",
  "/wiki/Rimma_Trade_Route",
  "/wiki/Alphabet_Squadron",
  "/wiki/Squadron_commander",
  "/wiki/Core_Nine_mining_megafacility",
  "/wiki/Attack_on_Troithe",
  "/wiki/Standard_day",
  "/wiki/Battle_of_Jakku",
  "/wiki/Deliverance%27s_starfighter_wing",
  "/wiki/2020",
  "/wiki/Shadow_Fall",
  "/wiki/Star_Wars:_Alphabet_Squadron",
  "/wiki/Alexander_Freed",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_61",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}