{
 "name": "Goril Sevintran",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Advozse"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Goril Sevintran was an Advozse male Jedi Knight who served the Jedi Order and the Galactic Republic during the Galactic War with the Sith Empire. When the Empire invaded the planet Corellia in 3640 BBY, Sevintran was among the first Jedi sent to aid the Corellian people and the Republic Military on the embattled Core World.\nAn Advozse male, Goril Sevintran was inducted into the Jedi Order and had begun serving the Galactic Republic as a Jedi Knight by the year 3640 BBY. The planet of Corellia was invaded by the Sith Empire in that year as part of the Galactic War between the Empire and the Galactic Republic, and Sevintran was part of the first group of Jedi who were sent to aid the Corellians and the Republic Military in the Battle of Corellia. During the lengthy fighting against the Imperial Military and the Sith, many Jedi were killed, and Sevintran was among the few Jedi still on Corellia's surface when Grand Master Satele Shan dispatched Jedi reinforcements from the Outer Rim Territories.\nA Force-sensitive Advozse male with black eyes, orange-brown skin, and a dark brown horn common to his species, Sevintran was proud to be a member of the Jedi Order and believed that unity would allow the Republic and the Jedi to win the fight for Corellia. He also believed that the Empire would never surrender and had to be destroyed, though Sevintran forced himself to ignore his aversion to killing when it came to defeating the enemy and saving lives.\nAs a member of the Jedi Order, Sevintran was proficient with both the Force and lightsaber combat, and he was experienced enough to be granted the title of Jedi Knight. In battle, he wore bronze-colored armor over his Jedi robes.\nGoril Sevintran first appeared in Star Wars: The Old Republic, a 2011 video game produced by BioWare and LucasArts. Sevintran will only appear in the Jedi Knight mission \"Jedi Commander\" on Corellia if the player fails to redeem the Sith Lord Praven on Tatooine during Act I, and Sevintran will then appear in Praven's place in the tunnel system in the Blastfield Shipyards district. He will continue to appear in Praven's place in all subsequent cutscenes, though neither Sevintran nor Praven speak to the player after their initial meeting. As a Republic character, the Jedi Knight is assumed to only choose the moral light side options, so this article assumes that the player successfully convinced Praven to become a Jedi and therefore never encountered Sevintran. While his ultimate fate is left unknown in the light-side scenario, Sevintran's comments about his time on Corellia before the Hero's arrival are still taken to be correct.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Advozse/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Battle_of_Corellia",
  "/wiki/Planet/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/3640_BBY",
  "/wiki/Jedi/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Sith/Legends",
  "/wiki/Death/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Species/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Praven",
  "/wiki/Tatooine/Legends",
  "/wiki/Blastfield_Shipyards",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Time/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Battle_of_Ilum",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies"
 ]
}