{
 "name": "Gormak_Zak",
 "display_name": "Gormak Zak",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Yes"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Zak was a male Human smuggler living during the Galactic War.\nHe was the partner of Jela Reneke in her scheme to smuggle the Gormak-enhanced cyberbeasts from Voss to sell them on the black market. However, during his stay on Voss Zak went extremely native among the local Gormak, he came to share their culture, their love for technology and their hatred of Voss. The Gormak accepted him in return and both himself and others started referring to him as Gormak Zak. Around 3640 BBY the Voidhound came to Voss trying to dismantle their smuggling ring and Gormak Zak was present during his encounter with Reneke, where she framed the smuggler for the own operations in the eyes of the Adjudicators. However, when the Voidhound later infiltrated Gormak Zak's home, he showed no hostility to him. Gormak Zak came to despise Reneke, for she committed an act considered atrocious by Gormak: she took a group into the Nightmare Lands and those who survived and returned, went mad from the experience. Gormak Zak agreed to help the Voidhound if that would stop him from losing more brothers to corruption of the Dark Heart and supplied him with Reneke's coordinates. The Voidhound confronted and killed Jela Reneke and afterwards Gormak Zak agreed to abandon all ties to Rogun the Butcher and work directly for the smuggler instead.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zak_(disambiguation)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Gormak_Zak",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_War",
  "/wiki/Jela_Reneke",
  "/wiki/Gormak/Legends",
  "/wiki/Ssorokk",
  "/wiki/Voss",
  "/wiki/Black_market/Legends",
  "/wiki/Voss_(species)",
  "/wiki/3640_BBY",
  "/wiki/Voidhound",
  "/wiki/Adjudicators",
  "/wiki/Nightmare_Lands",
  "/wiki/Dark_Heart",
  "/wiki/Rogun_Matt%27rik",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}