{
 "name": "Gormo",
 "display_name": "Gormo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Gormo was a male Duros stranded in the Iziz cantina for two weeks just prior to the Onderon Civil War without a starport visa. He was the captain of the freighter Tweigar.\nVisiting Onderon on business, Gormo entered the city of Iziz and was robbed of his starport visa, which was legally required in order to enter or re-enter the starport for any reason. Soldiers at the Iziz Starport entry checkpoint were unsympathetic to Gormo's plight, refusing to let him enter even when his crew came out and confirmed Gormo was captain of the Tweigar. Gormo, who was only on the planet temporarily, is incensed by this and vows to Meetra Surik that if he manages to leave Onderon he will never be coming back.\nEach of the individuals who appeals to Surik for a starport visa has a particular motive for doing so. Gormo's is very straightforward; he is a working man and a ship captain, whose crew cannot afford to wait for him forever. He knows a war is coming on Onderon and as a non-native with no stake in either side, he is eager to leave before it starts. Gormo appeals to Surik on the grounds that they both command a ship, insisting: \"Help out a fellow captain!\"\nGormo was one of several individuals to whom Meetra Surik may have given a visa to during her first stay on Onderon. If so, he makes good on his word, rejoining his crew and leaving Onderon immediately.\nGormo offers the Exile 500 credits for an open starport visa. If the Exile gives a starport visa to Gormo, and accepts the 500 credits, there will be no shift in the player's alignment. However, if the Exile refuses the 500 credits offer but still gives Gormo the starport visa, the player will receive light side points.\nAfter Vaklu attacks the cantina, the player won't be able to talk to Gormo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Duros/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Tweigar",
  "/wiki/N%27Kata_Del_Gormo",
  "/wiki/Hysalrian",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Iziz/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Onderon_Civil_War",
  "/wiki/Starport_visa",
  "/wiki/Onderon_Soldier",
  "/wiki/Iziz_Starport",
  "/wiki/Meetra_Surik",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}