{
 "name": "Gorth  (Trandoshan)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "32 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hath Monchar"
     ]
    }
   ]
  }
 ],
 "content": "Gorth was a Trandoshan male who served as a bodyguard on the planet Coruscant. In 32 BBY, Gorth was hired by the Neimoidian Hath Monchar to protect him while Monchar was trying to sell a holocron that contained plans for the Trade Federation to invade the planet Naboo. However, before Monchar could sell the holocron, Gorth, Monchar, and two Quarren bodyguards were killed by the Sith Lord Darth Maul, who tried to attain the device for his Master.\nGorth was a Trandoshan male who lived during the last years of the Galactic Republic. In 32 BBY, Gorth worked as a bodyguard on the planet Coruscant. During that year, the Neimoidian Hath Monchar hired Gorth to protect him while trying to sell a holocron that contained information regarding the Trade Federation's plans to blockade the planet Naboo, and Monchar—the Deputy Viceroy of the Trade Federation—hoped to make a fortune by selling the information to the highest bidder. While the Neimoidian was waiting for a potential buyer, Lorn Pavan, in the Dewback Inn cantina, Gorth stayed in the background, keeping an eye on Monchar and restraining Pavan after the Human arrived at the bar to bargain.\nMonchar and Pavan came to an agreement, and Gorth escorted Monchar back to the Neimoidian's apartment, where the deal was to take place. Joined by two Quarren bodyguards, Gorth and Monchar waited for Pavan to arrive with the money. However, the group was then attacked by the Sith Lord Darth Maul, whose Master had tasked him with attaining the holocron. Gorth was the first to react after the Sith had smashed through the door, and the Trandoshan opened fire with one of his blasters. However, Maul simply reflected the blasterfire into Gorth's face with his lightsaber, instantly killing the Trandoshan. Maul proceeded to slay Monchar and the Quarren but was at first unable to collect the holocron due to the intervention of the bounty hunter Mahwi Lihnn, who was also looking for Monchar. The resulting fight ended in an explosion that destroyed much of the building and Gorth's body.\nA big Trandoshan, Gorth obeyed Monchar's orders without question. Monchar, however, did not trust his bodyguard enough to carry the holocron with him in places such as the bar where Monchar met Pavan.\nGorth was easily able to overpower and neutralize Pavan when the Human tried to approach Hath Monchar. The bounty hunter Mahwi Lihnn was instantly able to tell Gorth was a bodyguard from the way he behaved, and the Sith Lord Darth Maul believed Gorth to be an untrained amateur due to his quite obvious way of checking his surroundings for potential threats. Gorth was quick to react when Maul attacked, but that did not help the Trandoshan, as the Sith easily killed him.\nGorth was armed with two blasters and carried one on each hip.\nGorth first appeared in Darth Maul: Shadow Hunter, a novel written by Michael Reaves and published in 2001.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Gorth_(disambiguation)",
  "/wiki/32_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Hath_Monchar",
  "/wiki/Bodyguard/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Death/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Deputy_Viceroy",
  "/wiki/Lorn_Pavan",
  "/wiki/Dewback_Inn",
  "/wiki/Cantina/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Human/Legends",
  "/wiki/Kaldani_Spires_Residential_Apartments",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sith/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Darth_Maul%27s_lightsaber",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Mahwi_Lihnn",
  "/wiki/Bounty/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Maul:_Shadow_Hunter",
  "/wiki/Michael_Reaves",
  "/wiki/2001",
  "/wiki/Darth_Maul:_Shadow_Hunter_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}