{
 "name": "Gotrut",
 "display_name": "Gotrut",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ugnaught"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  }
 ],
 "content": "Gotrut was an Ugnaught male who lived on Coruscant during the Cold War between the Galactic Republic and the reconstituted Sith Empire.\nA male Ugnaught, Gotrut lived in the Justicars' Sector on Coruscant. During the Cold War between the Galactic Republic and the Sith Empire, he led a group of Ugnaughts who lived beneath the Justicars' territory. They worked in the maintenance shafts and tunnels of the planet, where they worked to keep the area clean and habitable.\nGotrut and his group stole a Gree device designed by the droid Hib-R-ak to repair the waste processing system, not knowing the true purpose of the device. They were attempting to reverse engineer the device to aid them in their reconstruction efforts, but the technology was too complex for them. When a Republic-allied individual asked them for the device, Gotrut gave it to them and asked the individual to talk to the Gree delegation about working together. The agent was able to convince Nam-aK and the other Gree droids to work with the Ugnaughts in repairing the planet's infrastructure.\nGotrut was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. He appears in the Coruscant mission \"Ugnaught Saboteurs\", as part of the series of quests Republic players may complete for the Gree droid delegation.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ugnaught/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Justicar_territory",
  "/wiki/Gree/Legends",
  "/wiki/Hib-R-ak",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011"
 ]
}