{
 "name": "Govenni",
 "display_name": "Govenni",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Govenni was a Rodian, and a relative of Kelko. It is known that Govenni's clan was at war with another Rodian clan. A pair of Rodians, one of each clan, fell in love. Knowing that they would not be allowed to marry, the two left Rodia. One of them was Govenni's child, but it is unknown if Govenni was the father of the male or the female Rodian.\nThese two Rodians had a child on Ryloth, but were eventually tracked down by a group of assassins working for a third Rodian clan, one which wanted the war between these two clans to escalate. Instead, the disappearance of the couple united the two clans against a common foe. They merged into a single clan and annihilated the third, after determining their responsibility for the assassinations. The united clan became exceedingly wealthy, and their interests, including the ownership of several large businesses, stretched throughout the galaxy.\nGovenni was already old at that time, and the discovery of a previously unknown grandson caused the elderly Rodian to fixate on tracking him down. He finally found the young Rodian, named Kelko, working as a mechanic at Shusko Station . Govenni explained his own history to Kelko, and revealed to him that he was to inherit controlling interest in at least one of the family businesses. Due to his position, Kelko could have chosen a lucrative casino, but he opted to take control of his adopted home, Shusko Station, instead.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodia/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kelko",
  "/wiki/Ryloth/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Shusko_Station",
  "/wiki/Wizards.com",
  "/wiki/Meet_Kelko:_Rodian_Fringer"
 ]
}