{
 "name": "Grann  (general)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Grann was a Human male general who served in the Sith Empire during the Galactic War. In 3640 BBY, Grann and General Merion were stationed on Corellia where they led their Imperial forces to take over Guardian Hold Four with the assistance of the Children of the Emperor. However, the Barsen'thor and the Rift Alliance were able to reclaim the base and defeat both the Imperial Guard and the Child of the Emperor stationed there, Daresha. Both generals were captured, and Grann chose to cooperate with the Barsen'thor by revealing the possible location of the First Son.\nAt some point during the Battle of Corellia, he and his compatriot General Merion took command of Guardian Hold Four after it was compromised from within by Corporal Daresha, secretly a Child of the Emperor. However, he and Merion did not have much time to consolidate their holding before it came under attack from the current Barsen'thor and his forces. Balmorran droids under the Barsen'thor's command sabotaged the Guardian Hold's security, while a team of Voss commandos and the Barsen'thor himself breached the compound.\nGrann, Merion, and Daresha were in the Guardian Hold's conference room when the Barsen'thor arrived. Despite the best efforts of the Guardian Hold's Imperial garrison, the Barsen'thor managed to break into the conference room and kill Daresha in single combat. Grann and Merion were captured by Republic forces shortly thereafter. Grann chose to cooperate with the Republic, despite Merion's protests, and revealed that the First Son may have hidden himself in Guardian Hold One with the remnants of the Corellian Council. The Barsen'thor left to pursue the First Son, and Grann and Merion were escorted into custody.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gran_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/General/Legends",
  "/wiki/Galactic_War",
  "/wiki/3640_BBY",
  "/wiki/Merion",
  "/wiki/Corellia/Legends",
  "/wiki/Guardian_Hold_Four",
  "/wiki/Children_of_the_Emperor",
  "/wiki/Tenebrae",
  "/wiki/Rift_Alliance",
  "/wiki/Imperial_Guard",
  "/wiki/Daresha",
  "/wiki/Syo_Bakarn",
  "/wiki/Battle_of_Corellia",
  "/wiki/Corporal/Legends",
  "/wiki/The_Barsen%27thor",
  "/wiki/Voss_commandos",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Guardian_Hold_One",
  "/wiki/Corellian_Council",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}