{
 "name": "Grandi",
 "display_name": "Grandi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "ISB Supervisor Grandi was a human female who served in the Imperial Security Bureau with the rank of lieutenant. In 5 BBY, she attended a meeting on the planet Coruscant where she reported that the Ryloth sector detention estimates were expected to increase which might require an increased blackline budget. Major Partagaz then claimed she was being intentionally vague about what she would use the new resources for and demanded specifics.\nGrandi was a human female who served as a supervisor and held the rank of lieutenant in the Galactic Empire's Imperial Security Bureau. She oversaw the Ryloth sector, and in 5 BBY attended a meeting in a bureau building on the planet Coruscant where she reported that the sector's detention estimates were expected to increase over the next quarter. When she stated that any further erosion in the local authority in the sector would require an increase in her blackline budget, Major Partagaz, who was leading the meeting, questioned where these new resources would be targeted.\nChuckling, Grandi stated that they would be used for surveillance of anti-Imperial activity, but Partagaz was dissatisfied with her answer and claimed she was being purposefully vague. Grandi denied this, but he demanded that she provide specifics to him by the end of the day before moving on to the next item on the agenda. When Partagaz later questioned the entire room as to what the purpose of the Imperial Security Bureau was, Grandi did not answer.\nAfter the Imperial payroll for an entire sector was stolen from an Imperial installation on the planet Aldhani, Grandi was called back to the meeting room alongside the other supervisors and numerous other staff. Partagaz told those gathered to inform their staff and families that they would not be coming home and ordered that every Star Sector and Planetary Emergency Retaliation plan in the building to be ready for presentation by midnight.\nGrandi chuckled after telling Partagaz that she would use new resources on increased surveillance, but quickly stopped once he reprimanded her. She had light skin and gray hair.\nGrandi wore a white Imperial officer's uniform with a code cylinder on each shoulder and a rank insignia plaque with three blue squares.\nGrandi was portrayed by Lucy Russell in \"Aldhani,\" the fourth episode of the television series Andor, which aired on September 28, 2022. Prior to the episode's release, she was visually revealed in the teaser trailer for the show which aired on May 26, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Announcement",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/ISB_Supervisor",
  "/wiki/Military_rank",
  "/wiki/Lieutenant",
  "/wiki/5_BBY",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Gaulus_sector",
  "/wiki/Major",
  "/wiki/Partagaz",
  "/wiki/ISB_Central_Office",
  "/wiki/Sector",
  "/wiki/Standard_day",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani_dam",
  "/wiki/Aldhani",
  "/wiki/Hair",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Aldhani_(episode)",
  "/wiki/September_28",
  "/wiki/2022",
  "/wiki/May_26",
  "/wiki/The_Eye",
  "/wiki/Star_Wars",
  "/wiki/Category:Images_of_Grandi",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/June_4",
  "/wiki/File:Imperial_Forces_Rank_Chart_-_Rogue_One.png",
  "/wiki/Kassa_(episode)"
 ]
}