{
 "name": "Granta Omega",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nierport VII"
     ]
    },
    {
     "name": "Born",
     "values": [
      "50 BBY",
      "Telos IV"
     ]
    },
    {
     "name": "Died",
     "values": [
      "23 BBY",
      "Korriban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Order of the Sith Lords",
      "Offworld Mining Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Granta Omega was a human male criminal and the son of the Dark Jedi Xanatos and the grandson of Telosian Governor Crion. Omega vowed revenge on the Jedi Order for his father's death, not wanting to accept the fact that Xanatos killed himself.\nGranta Omega was born on Telos IV eighteen years before the Invasion of Naboo to Tura Omega and the Dark Jedi Xanatos, who became the First Citizen of Telos IV. At age three, he was sent with his mother to hide on the moon of Nierport VII, where Tura worked at a refueling station. Xanatos told his son everything about the Jedi Order, his former Master Qui-Gon Jinn, and how much they \"misunderstood\" the Force. While he hoped that Omega would be Force-sensitive, he soon realized this was not the case. Nevertheless, upon his death, he left his fortune from the Offworld Mining Corporation to Omega.\nAs a young man, Omega left his home to attend the All Science Research Academy on Yerphonia sponsored by Senator Sano Sauro. His mother died two years later; he never came back to Nierport VII for the funeral.\nA few years following the Invasion of Naboo, Omega hired a number of bounty hunters to capture the Jedi training on Ragoon VI. The Jedi that were there, Obi-Wan Kenobi and his apprentice Anakin Skywalker , managed to evade the numerous traps set out by the bounty hunters, including a trap that Omega himself set.\nOmega reappeared in 26 BBY under the alias of \"Dr. Tic Verdun\" to attack Kenobi and Skywalker while on a mission to rescue five war-besieged scientists on Haariden. There, Obi-Wan discovered that Omega planned to dominate the galactic bacta market through the mining of titanite on Haariden.\nReturning to Galactic City, Kenobi delved into research on Omega and discovered, with the help of Jedi Temple archivist Jocasta Nu, that he was a native of Nierport Seven—a small moon less than a day's journey from Coruscant. With a penchant for collecting Sith artifacts, but possessing no Force sensitivity at all, Omega was extremely wealthy, though Kenobi could not determine the vast sources of his wealth.\nAfter Omega later captured Anakin in an attempt to impress the galaxy's hidden Sith Lord, the boy managed to escape and, along with his Master, stopped Omega from pursuing his titanite venture by literally chasing him off planet when Haariden's great volcano erupted. While the Jedi were caught in the disaster, they managed to blast themselves free and catch up with Omega in a final confrontation, pinning him between themselves and a great tidal wave. Even so, the ever-elusive Omega again escaped Kenobi and Skywalker's grasp, eluding capture to slip offworld.\nIn 25 BBY, Omega appeared on the world of Mawan disguised as a crime-lord named Striker . Obi-Wan Kenobi, Anakin Skywalker, and Yaddle were assigned to the planet to negotiate peace between the warring factions there . Omega once again captured Skywalker, and this time was not averse to killing him, his Jedi Masters , and all of Mawan with a bioweapon, to further impress the Sith Lord. Though Skywalker escaped and Mawan was protected, Omega succeeded in killing Master Yaddle, who had been protecting Anakin at the time. Omega prepared to escape Mawan from the heart of its capital city Naatan, and Obi-Wan Kenobi tried to stop him. It was during his escape that Omega revealed to Kenobi that he was the son of Xanatos and grandson of Crion. Kenobi was utterly astonished by this news, but realized that it all made sense. Omega obviously inherited his father's fortune from Offworld Mining Corporation, and his father's hatred of the Jedi.\nOver the next few months, Omega worked with the scientist Jenna Zan Arbor. Together they planned to use the neuro-drug known as the Zone of Self-Containment to control thousands of innocent people. In these months, Kenobi and Skywalker encountered Zan Arbor, and were led through a string of puzzles on worlds such as Romin and Falleen that led them to finding Omega on Coruscant. Here they discovered that Omega planned to assassinate Supreme Chancellor Palpatine. Though the assassination was foiled, and Palpatine was protected by the Jedi Padawan Ferus Olin, a number of innocent lives were taken . After a battle with Obi-Wan on his speeder bike, Omega managed to escape the Jedi yet again.\nOmega was finally granted an audience with the Sith on Korriban and took Zan Arbor with him. He met with the Sith Lord in a tomb in the Valley of the Dark Lords, and moments later, encountered the Jedi. He shot and killed Darra Thel-Tanis with his KYD-21 blaster pistol when she tried to protect fellow Padawans Ferus Olin and Tru Veld. After that, he fled and was followed by Obi-Wan. Omega manned an E-Web heavy repeating blaster against Kenobi. His weapon overheated and exploded. Omega was thrown against a wall. He made another attempt to attack Kenobi, but was too weak, and Obi-Wan was forced to kill Omega with his lightsaber. Omega's last words were \"I know who he is. You will wish you did,\" referring to Darth Sidious.\nA few months after the Clone Wars, Obi-Wan revealed to Ferus Olin that Omega had been meeting with Count Dooku, who had been known by that time as Sidious's Sith apprentice, Darth Tyranus.\nGranta Omega possessed highly developed skills of deception; more than once, he escaped detection while right under the Jedi's noses. Omega was a Force Blank—a being with no connection to the Force, who could cloak himself as it were in a \"void\"—essentially shrouding himself from all detection by Force-sensitives. He used this to his advantage. People forgot they had seen him, or if they did remember him, they often could not quite place the face or how he'd originally appeared to them.\nOmega studied and practiced a variety of languages. He could both speak, read, and write Basic, Pak Pak, Huttese, and ancient Sith.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nierport_VII",
  "/wiki/50_BBY/Legends",
  "/wiki/Telos_IV",
  "/wiki/23_BBY/Legends",
  "/wiki/Korriban",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Offworld_Mining_Corporation",
  "/wiki/Jenna_Zan_Arbor",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Xanatos",
  "/wiki/Governor/Legends",
  "/wiki/Crion",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Death/Legends",
  "/wiki/Suicide/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Tura_Omega",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/All_Science_Research_Academy",
  "/wiki/Yerphonia",
  "/wiki/Senator/Legends",
  "/wiki/Sano_Sauro",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Ragoon_VI",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Wren_Honoran",
  "/wiki/26_BBY/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Mission_to_Haariden",
  "/wiki/Haariden",
  "/wiki/Bacta/Legends",
  "/wiki/Titanite",
  "/wiki/Galactic_City",
  "/wiki/Jocasta_Nu/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Kaachtari",
  "/wiki/25_BBY/Legends",
  "/wiki/Mawan/Legends",
  "/wiki/Striker_projectile_pistol",
  "/wiki/Yaddle/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Naatan",
  "/wiki/Zone_of_Self-Containment",
  "/wiki/Romin",
  "/wiki/Falleen_(planet)/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Attack_on_the_Senate_Building",
  "/wiki/Senatorial_aide",
  "/wiki/Tyro_Caladian",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Valley_of_the_Dark_Lords/Legends",
  "/wiki/Darra_Thel-Tanis",
  "/wiki/KYD-21_blaster_pistol/Legends",
  "/wiki/Ferus_Olin",
  "/wiki/Tru_Veld/Legends",
  "/wiki/E-Web_heavy_repeating_blaster",
  "/wiki/Lightsaber/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Void_in_the_Force",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Pak_Pak",
  "/wiki/Huttese/Legends",
  "/wiki/Sith_(language)",
  "/wiki/Category:Images_of_Granta_Omega",
  "/wiki/Jedi_Quest:_The_Trail_of_the_Jedi",
  "/wiki/Jedi_Quest:_The_Dangerous_Games",
  "/wiki/Jedi_Quest:_The_Master_of_Disguise",
  "/wiki/Jedi_Quest:_The_School_of_Fear",
  "/wiki/Jedi_Quest:_The_Shadow_Trap",
  "/wiki/Jedi_Quest:_The_Changing_of_the_Guard",
  "/wiki/Jedi_Quest:_The_False_Peace",
  "/wiki/Jedi_Quest:_The_Final_Showdown",
  "/wiki/The_Last_of_the_Jedi:_The_Desperate_Mission",
  "/wiki/The_Last_of_the_Jedi:_A_Tangled_Web",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Wizards.com",
  "/wiki/Granta_Omega:_An_Expanded_Universe_Character",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}