{
 "name": "Grappa_(Rodian)",
 "display_name": "Grappa  (Rodian)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Osarian First-Force"
     ]
    }
   ]
  }
 ],
 "content": "Grappa was a male Rodian mercenary hired by the government of the planet Osarian to serve as a captain in the Osarian First-Force. His hiring was a response by Osarian to the quickly escalating Osarian-Rhommamool conflict; the planet's own military was too small and technologically limited to pose a threat to the neighboring world of Rhommamool.\nIn 25 ABY, Grappa attempted to halt the Jade Sabre, a shuttle carrying the former New Republic Chief of State, Leia Organa Solo, who was on a diplomatic mission to Rhommamool. The head of the Osarian government, Shunta Osarian Dharrg, wanted to forcibly arrange a meeting with Organa Solo in order to hinder her from inadvertently heightening the Rhommamoolian leader's stature in the sector. Although Grappa's small squadron of outdated Z-95 Headhunters was initially able to outmaneuver the Republic ship, their attempts at redirecting the Jade Sabre were ultimately unsuccessful. Three of the starfighters under Grappa's command were incapacitated in the ensuing skirmish, forcing the remainder of the First-Force squadron to retreat.\nSome time prior to 25 ABY, the male Rodian Grappa was hired by the government of the planet Osarian to serve in the Osarian First-Force, the spaceborne branch of the world's military forces. The authorities on Osarian were concerned that the escalating conflict with the neighboring planet, Rhommamool, would erupt into war, and were thus looking to hire mercenaries to complement their technologically inferior military.\nGrappa and his fellow mercenaries were supplied with Z-95 Headhunter starfighters by the Osarian government. Although the ships were considered outdated by 25 ABY, the mercenaries were able to overcome this hindrance by employing advanced starfighter tactics. At some point, Grappa was granted the rank of captain in the First-Force.\nIn 25 ABY, Captain Grappa, still in Osarian employ, attempted to intercept a New Republic shuttle, the Jade Sabre, carrying former New Republic Chief of State Leia Organa Solo, who was on a diplomatic mission to Rhommamool. The Jedi Mara Jade Skywalker and Jaina Solo accompanied Organa Solo in the shuttle. Although Organa Solo's mission was to negotiate peace between the two planets, Shunta Osarian Dharrg, head of the Osarian government, was worried that her visit would inadvertently cause the stature of Nom Anor, the leader of the extremist Red Knights of Life organization that controlled Rhommamool, to increase, both on Rhommamool itself and in the sector at large. Dharrg wished to meet with the diplomat before she could do so with Anor.\nGrappa approached the Jade Sabre with four Z-95 Headhunters—all piloted by fellow Rodians—hiding two more some distance away in case the Sabre did not come willingly. He made viewscreen contact with the shuttle, and demanded the passengers follow him and his pilots to Osa-Prime, the capital of Osarian, to meet with Shunta Osarian Dharrg. The crew aboard the shuttle refused, and attempted to flee the First-Force Headhunters by out-navigating them with their technologically superior shuttle, fearing that a gunfight would lead to a diplomatic crisis. Grappa and his fellow mercenaries were forced to open fire and bring forth the two covert fighters in order to keep up with the Jade Sabre.\nDespite the fact that the shuttle was piloted by the Jedi Jaina Solo, whose sensitivity to the Force gave her an advantage, the First-Force Headhunters managed to position themselves in increasingly favorable shooting positions while pursuing the shuttle. Although the battle appeared to go in Grappa's favor at first, this changed when the Jade Sabre suddenly incapacitated one of his Headhunters by crashing into it. Within moments, a T-65XJ X-wing starfighter piloted by yet another Jedi, Wurth Skidder, joined the battle, destroying two more Headhunters. With additional New Republic reinforcements approaching, in the form of a Mediator-class battle cruiser, the remaining First-Force pilots chose to retreat and abort their mission.\nGrappa was willing to risk his life by engaging high-profile New Republic officials in starfighter combat. His adeptness at starfighter tactics was such that he and the ships under his command were able to successfully out-navigate the Force-sensitive Jedi pilot Jaina Solo, as well as causing Mara Jade Skywalker to consider his abilities \"good.\" Grappa had the appearance of an average Rodian; his skin was green, his eyes were black, his head sported a spiny head ridge, and a tapir-like snout adorned his face. His voice was described as uneven, and he was able to speak Basic, albeit with a limited vocabulary.\nGrappa was created by the author R. A. Salvatore. His only appearance is in the novel Vector Prime  of the New Jedi Order series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Grappa_(Hutt)",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Osarian_First-Force",
  "/wiki/Mercenary/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Osarian",
  "/wiki/Captain/Legends",
  "/wiki/Osarian-Rhommamool_conflict",
  "/wiki/Rhommamool/Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/Jade_Sabre",
  "/wiki/Shuttle/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Shunta_Osarian_Dharrg",
  "/wiki/Nom_Anor",
  "/wiki/Squadron/Legends",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Navy/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Red_Knights_of_Life",
  "/wiki/Sector/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Osa-Prime",
  "/wiki/Capital/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/T-65XJ_X-wing_starfighter",
  "/wiki/Wurth_Skidder",
  "/wiki/Mediator-class_battle_cruiser",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/R._A._Salvatore",
  "/wiki/The_New_Jedi_Order:_Vector_Prime",
  "/wiki/1999",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}