{
 "name": "Grath_(stormtrooper_commander)",
 "display_name": "Grath  (stormtrooper commander)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "Commander Grath was the Human male commanding officer of a detachment of stormtroopers dispatched to Culroon III under General Irrv. When Irrv's attempts to subdue the planet's native, the Culroon, with an exchange of ceremonial weapons failed, Grath rallied the stormtrooper force long enough for Lieutenant Maximilian Veers to arrive in an All Terrain Armored Transport. Veers, who had suggested to Irrv that a show of force to the Culroon was necessary, expected an apology from the general. Irrv began to indicate that a court martial for disobeying orders was more appropriate, until Grath killed him and gave Veers a field promotion to Major.\nGrath was a Human male stormtrooper commander serving the Galactic Empire during the Galactic Civil War. Assigned to Culroon III, a backwater planet, he was tasked with overseeing security for the Imperial researchers on the world, along with the personnel constructing a new Imperial garrison. The Emperor tasked General Irrv with subjugating the planet, and he convinced the local warlord, Kloff, to agree to a ceremony that would see the native Culroon and the Empire exchange ceremonial weapons as a sign of their acceptance of Imperial military rule. Irrv's plan was questioned by Junior Lieutenant Maximilian Veers, who had studied the Culroon while serving alongside Grath on the planet before Irrv's arrival. Veers believed that a show of force was necessary to subjugate the Culroon, and was sure that Kloff would be planning an attack on the ceremony.\nGrath and a legion of stormtroopers attended the ceremony, wielding dress weapons designed for show rather than combat. As the ceremony started, Kloff accepted a Naval sword from Irrv, which he then used to kill the general's aide, Colonel Jeffers. Kloff then sprung his ambush, assaulting the Imperial force with hidden warriors armed with energy weapons that outclassed the Imperials' ceremonial showpieces. Grath rallied his troops and protected the general, but the weight of the assault soon began reducing the stormtrooper's numbers. However, Lieutenant Veers—who had been confined to base due to his disagreement with Irrv's plan—arrived in his All Terrain Armored Transport and began counter-attacking and driving off the Culroon. Grath led the remnants of his force to the safety of the walker, where Veers expected Irrv to apologize to him. Irrv rebuked Veers, threatening him with a court-martial, until Grath executed the general with a shot to the back before requesting that Major Veers escort them back to the base.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Culroon_III/Legends",
  "/wiki/General/Legends",
  "/wiki/Irrv",
  "/wiki/Planet/Legends",
  "/wiki/Culroon",
  "/wiki/Ambush_on_Culroon_III",
  "/wiki/Lieutenant/Legends",
  "/wiki/Maximilian_Veers/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Death/Legends",
  "/wiki/Major/Legends",
  "/wiki/Stormtrooper_commander/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/IM-455_modular_garrison",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Kloff",
  "/wiki/Junior_Lieutenant/Legends",
  "/wiki/Legion/Legends",
  "/wiki/Naval_sword",
  "/wiki/Colonel/Legends",
  "/wiki/Jeffers",
  "/wiki/Walker/Legends",
  "/wiki/Court-martial/Legends",
  "/wiki/West_End_Games",
  "/wiki/The_Promotion_of_Lieutenant_Veers",
  "/wiki/The_Star_Wars_Sourcebook",
  "/wiki/Star_Wars_Sourcebook_(Second_Edition)",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_31",
  "/wiki/The_Official_Star_Wars_Fact_File_45",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}