{
 "name": "Grathan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Vereta Fraabaal",
      "Ladra",
      "Beelzlit Grathan",
      "Cellvanta Grathan",
      "Ralesk"
     ]
    }
   ]
  }
 ],
 "content": "Grathan was a male Human Sith Lord who served the reconstituted Sith Empire during the Cold War against the Galactic Republic. He rebelled against the Dark Council and organized a private base of operations in Dromund Kaas, though his ambition eventually suffered a crippling blow by Darth Baras's apprentice.\nSome time into the Cold War, Grathan went rogue and declared himself the thirteenth Dark Council member, with his own power base and sphere of influence within the Sith hierarchy. Although his claim had not been widely recognized, he controlled a substantial private army on Dromund Kaas. The Dark Council authorized all-out warfare against Grathan and anyone who supported him.\nAfter being driven from the Citadel, Lord Grathan holed up in his estate outside Kaas City. His forces there were made up of apprentices, loyal Imperial troops and cybernetic supersoldiers he developed in his secret weapons labs. His cadre of elite scientists — some volunteers, others kidnapped and forced into service — developed a seemingly endless number of war droids, reducing attrition in Grathan's army to near zero. Vereta Fraabaal was one of his apprentices.\nWilling to show Grathan he was not untouchable as he thought, Darth Baras commanded his apprentice to invade his estate and assassinate his son. Grathan's wife tried to bargain her son's life for her husband's, but Baras' apprentice eventually slew both mother and son.\nAt some point, Grathan came into possession of the mask of Revan, which he stored deep within his vaults. He lost it when the Order of Revan executed a heist on his estate and retrieved the mask, after which it eventually came back into the possession of Revan himself.\nOne of Grathan's many schemes involved attempting to send messages off-world to an exiled Lord of the Sith, Tytonus, who had at one point attempted to conquer an Imperial world for herself. These messages contained schematics of Kaas City, among other things, allowing Tytonus to mount an invasion using a small army of mercenaries built around a core of Sith adepts who she had trained herself. Because most of the Imperial army was deployed across the galaxy as a consequence of the Empire's overexpansion during the previous war, there was a serious risk that she might have succeeded in seizing the capital, which would have been a disaster for the Empire at broad. However, a strike team of Imperials managed to destroy her fleet of shuttles and kill her, halting her invasion and, by proxy, Grathan's attempt to destabilize the Dark Council. Major Shellaster, who was responsible for organizing the strike team, noted that although nobody could prove Grathan was behind the transmissions or the invasions, it didn't matter--anyone who mattered knew, and as a consequence Grathan was already losing what little support he had left.   \nLord Grathan first appeared in the video game Star Wars: The Old Republic, as an enemy during the Sith Warrior storyline on Dromund Kaas. According to conversation files, Grathan's name was originally \"Lord Rathari\", and his wife and son were Cellvanta Rathari and Beelzlit Rathari respectively. However, the name \"Rathari\" was later used on a Sith Lord on Nar Shaddaa instead of him. A character model labeled \"Lord Grathan,\" albeit a default one with no textures or details, is also present with the fully-qualified name of \"npc.​location.​companion.​sith_warrior.​jaesa.​lord_grathan\", indicating that Grathan at one point was planned to be involved with the companion missions for Jaesa Willsaam.\nLord Grathan's fate is upon player's choice. Players can choose to kill his wife and son  or spare their lives and kill Lord Grathan himself, letting his son take his place secretly .",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Grathan",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Vereta_Fraabaal",
  "/wiki/Ladra_(Sith)",
  "/wiki/Beelzlit_Grathan",
  "/wiki/Cellvanta_Grathan",
  "/wiki/Ralesk",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dark_Council",
  "/wiki/Dromund_Kaas",
  "/wiki/Darth_Baras",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Imperial_Citadel_(Sith_Empire)",
  "/wiki/Lord_Grathan%27s_estate",
  "/wiki/Lord_Grathan%27s_forces",
  "/wiki/Cyborg/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Revan%27s_mask",
  "/wiki/Revan/Legends",
  "/wiki/Order_of_Revan",
  "/wiki/Tytonus",
  "/wiki/Shellaster_(major)",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Rathari",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Jaesa_Willsaam",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}