{
 "name": "Graxol Kelvyyn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Anx"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Creamy white"
     ]
    }
   ]
  }
 ],
 "content": "Graxol Kelvyyn was an Anx who viewed the Boonta Eve Classic podracing event from the private box of the Toydarian junk dealer Watto in Mos Espa Grand Arena on the planet Tatooine in 32 BBY. Kelvyyn had creamy white skin and wore blue and orange robes with a silver necklace and a high red collar.\nGraxol Kelvyyn first appeared in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. Both Kelvyyn and Horox Ryyder, another Anx that appeared in The Phantom Menace, were based on a single sketch produced by concept artist Doug Chiang. The sketch was used by sculptor John Coppinger to produce a 3D maquette, and as Coppinger like the image so much he made few alterations when converting it, only adding some details and changing proportions.\nAs actor Jerome Blake was busy playing a different character on the day that Kelvyyn's scene was filmed, Coppinger also got to wear the Anx rig, which consisted of the performer standing on twenty-four inch stilts with the head standing thirty-six inches above that of the performer. As this made the character around eleven feet tall in total, director George Lucas realized that including an Anx in frame with other smaller characters like Yoda would require the camera to be too far back. As such, Kelvyyn was filmed sitting down for his scene.\nKelvyyn was first identified in the current Star Wars canon on a card in the Star Wars: Rogue One Mission Briefing set released by The Topps Company, Inc. in 2016. The name originated in the Star Wars Legends continuity, where it was first used on an action figure set released by Hasbro Inc. in 1999.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Graxol_Kelvyyn",
  "/wiki/Graxol_Kelvyyn/Legends",
  "/wiki/Anx",
  "/wiki/Color",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Podracing",
  "/wiki/Watto%27s_box",
  "/wiki/Toydarian",
  "/wiki/Junk_dealer",
  "/wiki/Watto",
  "/wiki/Mos_Espa_Grand_Arena",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/32_BBY",
  "/wiki/Clothing",
  "/wiki/Necklace",
  "/wiki/1999",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Horox_Ryyder",
  "/wiki/Doug_Chiang",
  "/wiki/John_Coppinger",
  "/wiki/Jerome_Blake",
  "/wiki/George_Lucas",
  "/wiki/Yoda",
  "/wiki/Star_Wars",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2016",
  "/wiki/Star_Wars_Legends",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/September_1",
  "/wiki/2011",
  "/wiki/July_27",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_I_(toy_line)"
 ]
}