{
 "name": "Grayla_Stindy",
 "display_name": "Grayla Stindy",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Grayla Stindy's species"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  }
 ],
 "content": "Grayla Stindy was an alien who spent time in the city of Canto Bight on the planet Cantonica in around 34 ABY. Stindy walked past the entrance to the Canto Casino arm-in-arm with an Abednedo companion. Stindy was a black eyed, white-skinned member of a species with a bipedal humanoid body and large flaps on either side of their heads. While in Canto Bight, the alien wore a monochromatic white ensemble including a coat, pants, belt and boots. This appealed to those who liked military uniform.\nGrayla Stindy was created to appear in the 2017 film Star Wars: Episode VIII The Last Jedi, but did not make it into the final cut. Despite this, the character appeared in Star Wars: The Last Jedi Activity Book with Stickers, a children's activity book released alongside the film. Stindy then received a name in the 2018 magazine Star Wars: The Last Jedi The Official Movie Companion. Concept art of Stindy titled \"Male Screamer 01\" was produced by creature concept designer Tim Napper.\nStindy's scenes in The Last Jedi was included in the film's deleted scenes. In the first scene, Stindy and the Abednedo are seen walking together in front of the casino as various speeders park around them. The Abednedo pats Stindy's hand, and the alien pats the Abednedo's upper arm in return. The second scene shows Stindy and the Abednedo in front of the casino again when the fathier herd stampedes through the buidling's front doors. The pair cower in fear as the fathiers rush past.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Grayla_Stindy%27s_species",
  "/wiki/Color",
  "/wiki/Alien",
  "/wiki/City",
  "/wiki/Canto_Bight",
  "/wiki/Planet",
  "/wiki/Cantonica",
  "/wiki/34_ABY",
  "/wiki/Canto_Casino_and_Racetrack",
  "/wiki/Limb",
  "/wiki/Abednedo_(planet)",
  "/wiki/Eye",
  "/wiki/Species",
  "/wiki/Humanoid",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/2017",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Last_Jedi_Activity_Book_with_Stickers",
  "/wiki/2018",
  "/wiki/Star_Wars:_The_Last_Jedi_The_Official_Movie_Companion",
  "/wiki/Tim_Napper",
  "/wiki/Speeder",
  "/wiki/Fathier",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/The_Art_of_Star_Wars:_The_Last_Jedi",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}