{
 "name": "Gre%27ento",
 "display_name": "Gre'ento",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Gre'ento was a Human male who made his home on an unnamed forested planet, where he worked as an information broker.\nFollowing a botched Rebel rescue attempt to rescue Han Solo from Jabba Desilijic Tiure, Gre'ento received word from some Imperials who were meeting Boba Fett on the forested planet to talk about prices over Solo's frozen body. Inside a shady bar, Gre'ento was approached by Lando Calrissian, Princess Leia Organa, and Chewbacca while he was trying to woo a Rodian woman. Acting belligerent at first to their questions, Gre'ento changed his tune when Chewbacca seized him by the neck and hoisted him into the air. He knew that Fett would likely kill him if he spoke, but realized his life was in danger in Chewbacca's hands as well, so he stated that he knew some Imperials would be meeting Fett the following day at an abandoned spaceport across a lake to make a secret exchange. When asked what the item was, Gre'ento stated that he didn't know and didn't care. The three Rebels left Gre'ento with Calrissian knowing he wouldn't inform Fett, knowing that he would well be signing his own death warrant if he did.\nThough Gre'ento only appears in a non-canon story, since this story is an alternate \"what-if\" retelling of a canon story, it may be possible that Gre'ento exists in some form of canon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Chewbacca/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Star_Wars_Infinities:_Return_of_the_Jedi_2"
 ]
}