{
 "name": "Great_Goblin",
 "display_name": "Great Goblin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Anx"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "The Great Goblin was a mute, Anx gladiator who fought in the gladiatorial pits of the planet Loovria. He died of terror after being purchased by a Hutt crime lord who tried to transport him alone to the planet Nal Hutta.\nThe mute, Anx gladiator known as the Great Goblin fought in the gladiatorial pits of the planet Loovria, where he set a record for the most kills that would remain unbroken for at least three hundred years. The Anx was sold to a Hutt crime lord, who had him transported to the planet Nal Hutta in a small freighter. The gladiator was transported alone and died of terror on the second day of the trip, as members of the Anx species had a need for company. The gladiator and the Hutt were later written about by the sentientologist Tem Eliss in The University of Sanbra Guide to Intelligent Life.\nThe Great Goblin was first mentioned in The University of Sanbra Guide to Intelligent Life: The Anx, an article written by Craig Robert Carey, Jason Fry and Daniel Wallace for the seventh issue of Wizards of the Coast's Star Wars Roleplaying Game magazine Star Wars Gamer in 2001. The gladiator was later mentioned in the 2014 StarWars.com article Galactic Gladiators: Great Warriors of Star Wars by Tim Veekhoven and Kevin Beentjes. It is not stated what era the Goblin lived in, although due to a mention of the Battle of Gravlex Med, the in-universe article from Star Wars Gamer must be written in the New Republic era or later.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Anx/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gladiator/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Loovria/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Unidentified_Hutt_crime_lord_(Great_Goblin)",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Sentientologist",
  "/wiki/Tem_Eliss",
  "/wiki/University_of_Sanbra",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Anx",
  "/wiki/Craig_Robert_Carey",
  "/wiki/Jason_Fry",
  "/wiki/Daniel_Wallace",
  "/wiki/Star_Wars_Gamer_7",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Star_Wars_Gamer",
  "/wiki/2001",
  "/wiki/2014",
  "/wiki/StarWars.com",
  "/wiki/Galactic_Gladiators:_Great_Warriors_of_Star_Wars",
  "/wiki/Tim_Veekhoven",
  "/wiki/Kevin_Beentjes",
  "/wiki/Battle_of_Gravlex_Med",
  "/wiki/New_Republic_era"
 ]
}