{
 "name": "Great_Leveler",
 "display_name": "Great Leveler",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 382 BBY",
      "Dalna"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nameless"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Camera"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Path of the Open Hand",
      "Ro family",
      "Nihil"
     ]
    },
    {
     "name": "Owner(s)",
     "values": [
      "Elecia Zeveron",
      "Yana Ro",
      "Marchion Ro"
     ]
    }
   ]
  }
 ],
 "content": "The Great Leveler, or simply the Leveler, was a powerful Nameless that had the ability to overwhelm Force-sensitives and nullify their connection to the Force. The creature possessed claws, moving on four legs. The being had been trapped within ice within the Shrine inside the caves of the planet Rystan, guarded by droid attendants and revered by the ancestors of Eye of the Nihil Marchion Ro, who were unaware that the Leveler was not its true name. The Ro family revered the being but not as a god, instead viewing it as an agent of balance.\nThe egg from which the Great Leveler would hatch was retrieved from the Nameless homeworld in Wild Space by the smuggler and prospector Radicaz Dobbs by around 382 BBY. Dobbs, who occasionally fenced Force artifacts, believed the egg was a large jewel. He was eventually approached by Elecia Zeveron, the leader of the Path of the Open Hand, a cult based on the planet Dalna which believed the Force needed to be \"freed\" from those who wielded its gifts. After seeing that Zeveron was unimpressed by the other wares he had to show, Dobbs revealed the egg, which impressed her. Dobbs agreed to assist the Path in retrieving other Force artifacts, while Zeveron kept the egg in her possession. Kor Plouth, a Force-sensitive member of the cult, was unsettled by the egg when she saw it, and told her girlfriend Yana Ro of her unease.\nThe egg was eventually hatched by Zeveron when two Jedi, Zallah Macri and her Padawan Kevmo Zink, burglarized the Path compound in search of the Rod of Seasons, an artifact stolen by the cult from Hynestia Prime. The newly-hatched Leveler quickly overwhelmed and petrified Macri. Zeveron was unharmed, but suffered temporary petrification effects as well as gaining grey streaks in her hair. Zink fled, but was eventually overwhelmed by the creature's energies and was petrified to death in the arms of Yana's cousin Marda, whom he had had a mutual attraction to.\nThe Leveler was hailed as a gift from the Force by the members of the cult. Yana discovered that the creature was attracted to the Rod of Seasons, but the Elders of the Path named her the Champion after believing the Leveler was drawn to the Evereni woman herself instead of the artifact. Having developed a grudge against Zeveron, who was responsible for Plouth's death, Yana hoped to use her new power in the sect against the leader. The Leveler was eventually frozen in ice on the planet Rystan.\nMarchion visited Rystan with the Force-sensitive Talortai Udi Dis and was guided to the Shrine by his cousin, Kufa; by that point, the Leveler had not been visited for some time. As they approached the Shrine, Dis began to be overwhelmed by the Leveler. Ro, who had brought Dis as a test of the Leveler's power, killed both the Talortai and Kufa, retrieving the Leveler and containing the creature aboard his flagship, Gaze Electric at the Nihil marauder base on Grizal. Ro had previously acquired both halves of the rod which could be used to control it.\nAboard the Gaze Electric, the Chadra-Fan doctor Kisma Uttersond fabricated a heating rig for the ice block, as well as grafting a camera into the Leveler's back so that Ro could view the creature's movements. Some time afterward, during a Jedi attack on the Nihil's camp, Ro used two halves of an artifact to control the Leveler, freeing the creature, which leapt from the starship, having become insatiable due to its time in the ice. Though Ro soon used the artifact to call the Leveler back to the Gaze Electric, which escaped into hyperspace, it left the the Padawan Bell Zettifar overwhelmed and the Jedi Master Loden Greatstorm turned to stone.\nWishing to test whether the Leveler's effect on Grizal could be replicated, Nihil Tempest Runner Lourna Dee brought the Leveler to the planet Xais, where the Nihil had occupied a former gas refinery. On Xais, the Jedi Knights Keeve Trennis and Terec had attempted to infiltrate the Nihil's ranks, but had been exposed. Dee had Uttersond bring forward a box that contained the Leveler, opening it in the presence of the Jedi and subjecting them to its power. Trennis was overwhelmed by the Leveler, while Terec began to slowly turn to stone—as did their bond-twin, Ceret, elsewhere aboard the Jedi cruiser Ataraxia. Ceret guided the Ataraxia to Xais, where the Jedi clashed with the Nihil forces, prompting Dee to have Uttersond load the Leveler aboard her ship as she attempted to escape.\nWith the power of the Nameless proven through the Leveler's deployments, Ro sought out and collected more of the Nameless beings from a hidden planet. In possession of a large group of Nameless, Ro unleashed them upon the Starlight Beacon as the Nihil destroyed it. Upon being affected by one of the creatures as she entered the falling space station, Trennis believed the Great Leveler itself was part of the attacking force.\nThe Leveler was blue in coloration.\nThe Great Leveler was introduced in the 2021 novel The High Republic: The Rising Storm, written by Cavan Scott as part of the Star Wars: The High Republic publishing initiative.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Leveler_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/382_BBY",
  "/wiki/Dalna",
  "/wiki/Nameless",
  "/wiki/Color",
  "/wiki/Camera",
  "/wiki/Path_of_the_Open_Hand",
  "/wiki/Ro_family",
  "/wiki/Nihil",
  "/wiki/Elecia_Zeveron",
  "/wiki/Yana_Ro",
  "/wiki/Marchion_Ro",
  "/wiki/Force-sensitive",
  "/wiki/The_Force",
  "/wiki/Limb",
  "/wiki/Water",
  "/wiki/The_Shrine",
  "/wiki/Cave",
  "/wiki/Planet",
  "/wiki/Rystan",
  "/wiki/Droid",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/God",
  "/wiki/Egg",
  "/wiki/Unidentified_planet_(Nameless)",
  "/wiki/Wild_Space",
  "/wiki/Smuggler",
  "/wiki/Prospector",
  "/wiki/Radicaz_Dobbs",
  "/wiki/Force_artifact",
  "/wiki/Gemstone",
  "/wiki/Religion",
  "/wiki/Kor_Plouth",
  "/wiki/Jedi",
  "/wiki/Zallah_Macri",
  "/wiki/Padawan",
  "/wiki/Kevmo_Zink",
  "/wiki/Mission_to_Dalna_(Macri_and_Zink)",
  "/wiki/Path_compound",
  "/wiki/Rod_of_Seasons",
  "/wiki/Theft_of_the_Rod_of_Seasons",
  "/wiki/Hynestia_Prime",
  "/wiki/Marda_Ro",
  "/wiki/Evereni",
  "/wiki/Talortai",
  "/wiki/Udi_Dis",
  "/wiki/Kufa",
  "/wiki/Death",
  "/wiki/Flagship",
  "/wiki/Gaze_Electric",
  "/wiki/Pirate",
  "/wiki/Grizal",
  "/wiki/Nameless_control_rods",
  "/wiki/Chadra-Fan",
  "/wiki/Doctor",
  "/wiki/Kisma_Uttersond",
  "/wiki/Starship",
  "/wiki/Hyperspace",
  "/wiki/Bell_Zettifar",
  "/wiki/Jedi_Master",
  "/wiki/Loden_Greatstorm",
  "/wiki/Tempest_Runner",
  "/wiki/Lourna_Dee",
  "/wiki/Xais",
  "/wiki/Jedi_Knight",
  "/wiki/Keeve_Trennis",
  "/wiki/Terec",
  "/wiki/Bond-twins",
  "/wiki/Ceret",
  "/wiki/Cruiser",
  "/wiki/Ataraxia",
  "/wiki/Starlight_Beacon",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/StarWars.com",
  "/wiki/Dustin_Diehl",
  "/wiki/2021",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Cavan_Scott",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/The_High_Republic:_Path_of_Deceit",
  "/wiki/The_High_Republic:_Path_of_Deceit_(audiobook)",
  "/wiki/The_High_Republic_(2022)_2",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Trail_of_Shadows_1",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic:_Trail_of_Shadows_2",
  "/wiki/The_High_Republic_Adventures_(2021)_8",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/The_High_Republic:_Tempest_Runner_(script)",
  "/wiki/The_High_Republic_(2021)_10",
  "/wiki/The_High_Republic_(2021)_11",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_Midnight_Horizon_(audiobook)",
  "/wiki/The_High_Republic_(2021)_12",
  "/wiki/The_High_Republic_(2021)_13",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/The_High_Republic_(2021)_14",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/The_High_Republic:_Trail_of_Shadows_4",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_2",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/232_BBY",
  "/wiki/Template:LightOfTheJediDate",
  "/wiki/Standard_year",
  "/wiki/August_5"
 ]
}