{
 "name": "Grebleips",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Asogian"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Grebleips was an Asogian who served as a senator in the Galactic Republic's Galactic Senate. In 32 BBY, Grebleips was present for a session of the Senate in the Senate Building on the planet Coruscant in which Queen Padmé Amidala of the planet Naboo requested aid with the Trade Federation invasion of her homeworld.\nAfter Senators Lott Dod and Aks Moe stalled Amidala's request, she called for a Vote of No Confidence in Supreme Chancellor Finis Valorum. This sent the Senate into an uproar, and Grebleips and the two other aliens in the senator's repulsorpod stood and threw their arms up in the air along with many others, who cried out in response to the vote. Grebleips had brown skin and wore no clothing while in the Senate Building.\nSenator Greblieps first appeared as a computer generated character in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. The character was included by George Lucas as a reference to the 1982 film E.T. the Extra-Terrestrial, which had been made by his friend Steven Spielberg and included a child dressed as Yoda for Halloween as a reference to The Empire Strikes Back. In E.T., the title character, an alien from an unidentified planet, sees the face of Yoda and says \"Home!\" This led to a popular speculation that E.T. was a resident of the Star Wars galaxy and had met Yoda or another member of his species.\nIn the new Star Wars canon, Grebleips' name was first used in a 2019 episode of The Star Wars Show. It originated in the Star Wars Legends continuity, where it was created by author James Luceno for the 2001 novel Cloak of Deception as a further reference to Spielberg, as the name is Spielberg backwards.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Grebleips",
  "/wiki/Grebleips/Legends",
  "/wiki/Asogian",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Senator",
  "/wiki/32_BBY",
  "/wiki/Galactic_Senate_Building",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Queen",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Trade_Federation",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Gender",
  "/wiki/Homeworld",
  "/wiki/Lott_Dod",
  "/wiki/Aks_Moe",
  "/wiki/Vote_of_No_Confidence",
  "/wiki/Supreme_Chancellor",
  "/wiki/Finis_Valorum",
  "/wiki/Repulsorpod",
  "/wiki/Clothing",
  "/wiki/1999",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/George_Lucas",
  "/wiki/1982",
  "/wiki/Steven_Spielberg",
  "/wiki/Yoda",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars",
  "/wiki/2019",
  "/wiki/The_Star_Wars_Show",
  "/wiki/Star_Wars_Legends",
  "/wiki/James_Luceno",
  "/wiki/2001",
  "/wiki/Cloak_of_Deception",
  "/wiki/Category:Images_of_Grebleips",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Challenge!",
  "/wiki/Star_Wars_Insider_161",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}