{
 "name": "Grees",
 "display_name": "Grees",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Skor II"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Squib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Directors",
      "Second Mistake Enterprises"
     ]
    }
   ]
  }
 ],
 "content": "Grees was a Squib who, along with Sligh and Emala, formed the dubious group the Directors. For a while they made their profits by selling information they had collected to the New Republic Intelligence, but later they found a new break on Tatooine. In 8 ABY, the Squibs \"helped\" Han and Leia Solo during their skirmishes on Tatooine while trying to obtain the moss painting Killik Twilight. They realized that selling information to the Imperial Remnant would be more profitable, and later started Second Mistake Enterprises.\nAfter surviving the Yuuzhan Vong War he became a war profiteer along with Sligh and Emala during the Killik-Chiss Swarm War. After being sabotaged by the Solos, they took out a bounty on each of the family's heads.\nProviding it to the New Republic Intelligence  agency, the trio worked out of Tatooine. Grees accompanied Leia Organa Solo and her husband, Han Solo, to Tatooine, in attempting to capture a lone group of Imperials in search of the Killik Twilight. After their debacle with the Solos, the Squibs decided that selling art to the Imperials would garner them wealth and knowledge about the secretive Imperial Remnant. Aligned with the Invisible Shell, they did nothing to correct the NRI's assumption that it was Ludlo Lebauer providing the artworks to the Empire, because it allowed for a distraction from their organization. Grees, however, became too greedy and wasted their scapegoat by becoming his prisoner. Frozen in carbonite, Emala and Sligh once more manipulated the Solos in order for them to help them. Arranging a meeting via their NRI contacts, the Squibs and the Solos met on Pavo Prime and agreed to combine forces in order to re-obtain Grees and ten Alderaanian boasas. After completing the mission, the Directors quickly fled for the Outer Rim.\nAfter the Yuuzhan Vong invasion, the group formed a new organization known as Second Mistake Enterprises. Hired by the Colony to transport spinglass sculptures to the rest of the galaxy, they were responsible for the near disastrous invasion of Galactic Alliance capital ships by Gorog assassins. After they were reprimanded, the Directors planned several assassination plots against Han, Leia, and Jaina Solo, all of which failed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Skor_II",
  "/wiki/Squib/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Directors",
  "/wiki/Second_Mistake_Enterprises",
  "/wiki/Sligh",
  "/wiki/Emala",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Tatooine/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Moss_painting/Legends",
  "/wiki/Killik_Twilight",
  "/wiki/Imperial_Remnant",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Killik/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Swarm_War",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Invisible_Shell",
  "/wiki/Ludlo_Lebauer",
  "/wiki/Pavo_Prime/Legends",
  "/wiki/Alderaanian/Legends",
  "/wiki/Boasa",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/The_Colony",
  "/wiki/Spinglass",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Gorog",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Grees",
  "/wiki/Tatooine_Ghost",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Trouble_with_Squibs",
  "/wiki/Star_Wars_Insider_67",
  "/wiki/Dark_Nest_II:_The_Unseen_Queen",
  "/wiki/Dark_Nest_III:_The_Swarm_War",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Unknown_Regions"
 ]
}