{
 "name": "Greer Sonnel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pamarthe"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Coppery"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Crystal Cairn",
      "New Republic",
      "New Republic Defense Fleet",
      "New Republic Defense Fleet",
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Greer Sonnel was a human female pilot and the personal assistant of Senator Leia Organa. Sonnel was a racer who piloted a purple RZ-1 A-wing interceptor, the Ossifrage. Sonnel suffered from bloodburn, a rare affliction that ultimately ended her racing career.\nSome time later, in 28 ABY, Sonnel was chief of Senator Leia Organa's staff. She accompanied the senator on several investigations into Rinnrivin Di's crime cartel and the Amaxine warriors alongside senator Ransolm Casterfo, X-wing pilot Joph Seastriker and Korr Sella.\nGreer Sonnel was born on the planet Pamarthe, and like many people on her planet, grew up to become a starfighter pilot, participating in many races across the galaxy. At some point in her life, she partook in a race known as the Gauntlet, along with fellow Pamarthens Bors, Torret, Vee and her former partner, Karsted. The race itself was known to be very mysterious and extremely dangerous, as well as being sponsored by Han Solo himself. The race took place on a course called The Evil Eye, which required the racers to thread through ten eyes, with their overall score depending on how many. For the race, Sonnel piloted a modified RZ-1 A-wing interceptor known as the Ossifrage.\nAs the race began, Sonnel managed to achieve a head start, with the other racers being far behind her. As she flew, she turned on a comlink, which allowed her to communicate with her fellow racers. She eventually began speaking to a man whose voice she did not recognize; however, the two continued to converse throughout the course, with each commenting on the other's piloting skills. Suddenly, the Ossifrage began to shudder with the instrument panel bleeping and flashing. Karsted had shot at her ship, blocking its thruster. Luckily, the man she had been talking to knew a solution, telling Sonnel to power off the ship for ten seconds and restart with the throttle on hot and the right stabilizer maximized. To her surprise, this worked, and the ship was able to continue flying. As she reached the last stretch of the race, it was announced that in order to gain double points, two ships must pass simultaneously through the last eye. Sonnel and her new friend proceeded to work together on this, managing to finish and win the race. As they crossed the finish line, the man asked Sonnel if she knew of his name, upon which he revealed he was the legendary Han Solo, and with that he recruited her to join him on his team for the Five Sabers tournament.\nThree years before the Amaxine warrior crisis, Sonnel was diagnosed with bloodburn syndrome, a disease that caused severe fevers. Since there was no cure, Sonnel had to take Hadeira serum and to avoid stressful activities such as racing. Due to bloodburn, Sonnel abandoned her racing career and instead found work as the chief of the New Republic Senator Leia Organa's staff at the senatorial complex on Hosnian Prime. Her work involved managing Senator Organa's timetable and flying the Senator's personal transport, Mirrorbright. Sonnel also helped Leia's husband Han Solo to install guns into the ship as well. During her time working for Leia, Sonnel befriended another senatorial staff member named Korr Sella, a teenager whom they affectionately nicknamed Korrie. Sonnel's time at the Galactic Senate coincided with rising tensions between the Populists, who favored individual member worlds maintaining autonomy, and the Centrists, who advocated a more centralized government and powerful military.\nFollowing a dedication ceremony to honor Leia's adoptive father Senator Bail Organa, Sonnel informed Leia, who was a prominent Populist, that the Centrist Senator Bevicard had invited her to a reception in Coruscant. In the presence of both Sonnel and Korrie, Leia explained how factional politics made it improper for her to accept the invitation. After Leia and a Centrist Senator named Ransolm Casterfo accepted a senatorial mission to investigate the Nikto crime lord Rinnrivin Di's cartel on Bastatha, Leia discussed her travel plans with Sonnel and confirmed that Casterfo would be accompanying them.\nPrior to leaving on the Mirrorbright, Sonnel greeted the New Republic pilot Joph Seastriker, who had been assigned to escort the Mirrorbright on its journey to Bastatha. Joph took an instant liking to Sonnel and the two exchanged conversation before departing the New Republic senate hangar. During the journey, Sonnel manned the helm of the Mirrorbright. Casterfo tried to make conversation with Sonnel and Kor Sella but made little progress due to their philosophical differences. During the visit to Bastatha, Sonnel stayed aboard the ship while Leia, Casterfo, Korr, and C-3PO attended a function at a casino that was hosted by the Nikto Magistrates Tosta and Xun.\nFollowing a political argument between Leia and Casterfo, Joph informed Sonnel about details of the spat including Leia calling Casterfo a \"spoiled brat\" for criticizing the Rebellion. Later, Leia informed Sonnel and the others about an upcoming meeting with several Bastathan business leaders. This business delegation turned out to be a group of gangsters sent by Rinnrivin, who kidnapped Leia and spirited her away for a secret meeting with the crime lord. Rinnrivin tried to bribe the senator into easing the Republic's restrictions on the spice trade. However, Organa was rescued by Casterfo and the two escaped Rinnrivin's headquarters. Despite Rinnrivin's escape, Leia's team discovered a trove of information in the crime lord's computers which showed that the cartel's money was being funnelled into shadow corporations in the Outer Rim Territories. Based on this information, Leia and Casterfo decided to continue their investigation into Rinnrivin's syndicate.\nFollowing the mission to Bastatha, Sonnel along with Korrie and C-3PO urged Senator Organa to consider nominating herself for the proposed position of First Senator, which would wield considerable power over the New Republic military and economy. The Centrists had successfully proposed this motion in an effort to end the deadlock in the Galactic Senate. While disillusioned with politics, Leia reluctantly acceded to an exploratory committee exploring her suitability for the job. In secret, Sonnel and C-3PO had conceived the idea of the exploratory committee in order to encourage Leia to consider the job. Sonnel believed that Leia as First Senator would have more latitude over the Rinnrivin investigation.\nLater, Senator Organa dispatched Sonnel and Joph on a secret mission to investigate whether Rinnrivin was hiring pilots from Sonnel's homeworld of Pamarthe, which was reputed to have some of the best pilots in the galaxy. Upon arriving on Pamarthe, Sonnel and Joph landed on a Pamarthen bridge which overlooked the ocean. While chatting about the Five Sabers with a local tavern keeper and elderly pilot, the two posed as pilots looking for a job. They learned that a paramilitary faction on the nearby planet of Daxam IV called the Amaxine warriors were dominating the local cargo shipping. After learning this information, the two pilots shared a drink. When Joph asked Sonnel about the secrecy of their mission, Sonnel explained that Leia had sent them in order to circumvent a Senate rule forbidding senators from engaging in espionage. While their trip to Bastatha had been sanctioned by the Senate, their mission to Pamarthe was not, hence the need for secrecy.\nAfter returning to Hosnian Prime, Sonnel and Joph rendezvoused with Leia aboard the Mirrorbright to discuss their secret mission. Sonnel reported that the Amaxines were running a smuggling trade around Daxam IV. Leia explained that the Amaxine Warriors were a warrior culture that had left the galaxy during the time of the Old Republic. While noting that the Amaxines were believed to be extinct, Sonnel displayed a holo-map which showed reports of Amaxine activities on Daxam IV and other predominantly Centrist worlds. Based on these prelimary findings, Sonnel and her team speculated that certain Centrist senators were colluding with the Amaxines. Sonnel was pleasantly surprised when Leia decided to solicit Casterfo's help in investigating the Centrist connections to the Amaxine Warriors.\nSeveral days later, Sonnel and her friend Korrie were walking through the Senate grounds when a bomb damaged the nearby Senatorial conference building. Sonnel suffered mild concussion and a broken finger nail. Korrie was unhurt but frightened, promoting Sonnel to comfort her. Sonnel witnessed several wounded senators and other staff being evacuated from the scene. They managed to find Leia, who had discovered a message warning of the bombing and had ordered an evacuation; saving many lives. Following the so-called Napkin Bombing, Sonnel asked Leia who would want to destroy the building. Leia responded that this was an attack on the Galactic Senate.\nFollowing the bombing, Sonnel received a round of serum injections and had her hand treated with bacta in order to allow her fingernail to regrow. Due to their moderate wounds, Sonnel and her companions were allowed by Dr Harter Kalonia to leave the medcenter. Over the following days, both the Centrists and Populists accused each other of staging the bombing for capital. After footage of a Twi'lek mercenary emerged, Leia and her staff decided to travel to Ryloth to investigate whether Rinnrivin was involved. She also sent Sonnel to accompany Casterfo on a mission to Daxam IV to investigate the Amaxines. Casterto had arranged to buy an Imperial artifact from a local dealer there and has used the trip as a cover for his investigation.\nWhile Leia had told Casterfo that she had assigned Sonnel as backup and not as a sign of mistrust, Sonnel was initially uncomfortable with the Centrist senator. For the journey, Casterfo rented a Jeconne courier. During the trip, Castero asked Sonnel about her previous career as a professional pilot on the Crystal Cairn team before her abrupt resignation three years ago. Wanting to hide her bloodburn diagnosis, Sonnel downplayed her achievements and claimed that two years as a Crystal Cairns pilot did not make her elite.\nAfter exiting hyperspace, Sonnel discussed the details of their mission. Ransolm explained that he was buying the helmet of an Emperor's Royal Guard from a mysterious dealer named Crimson Blade. As a cover story, the two agreed that Sonnel would pretend to be Casterfo's personal pilot whom he had hired from under Leia's nose a fortnight ago. Upon landing on Daxam IV, Sonnel and Casterfo noted the planet's impoverished status and smushed where the money from Rinnrivin's revenue was actually going to. The two then traveled to a teahouse where Casterfo had earlier arranged to meet Crimson Blade.\nThe dealer turned out to be Arliz Hadrassian, a woman that Casterfo and Leia had encountered earlier on Bastatha. While Casterfo gained Hadrassian's trust, Sonnel waited at wooden stool near the counter. After Casterfo convinced her of his Imperial sympathies, Hadrassian informed him that she had been a former TIE fighter pilot and that the helmet had belonged to her brother, a Royal Guard, who had fallen during the Battle of Jakku. Satisfied, Hadrassian arranged for Casterfo to visit her compound the following day to complete the transaction. Later that night, Sonnel took the Jeconne courier for a flight above Daxam IV and discovered that the Amaxines were a well-equipped militia with at least six sizeable starfighter squadrons practising manuevers over the planet's atmosphere.\nThe following day, Sonnel stayed behind with the ship while Casterfo traveled on a rented Speeder bike to collect the helmet from Hadrassian, who had requested that Casterfo come alone for privacy reasons. While Sonnel was uncomfortable, she agreed to trust Casterfo's ability to look after himself. However, she remained on stand-by in order to evacuate him if necessary. Prior to departing, Sonnel linked the speeder bike's holocam to the courier's comm systems to keep an eye on Casterfo and the Amaxines. After purchasing the helmet, Casterfo returned to Sonnel and the courier safely. He informed Sonnel that the Amaxines had at least fifty starfighters and a thousand warriors based on Daxam IV. In addition, the Amaxines had at least six other bases including a headquarters on the watery Expansion Region world of Sibensko. Due to their mission, Sonnel came to trust and respect Casterfo and complimented his combat skills.\nAfter Leia and Casterfo returned to Hosnian Prime, the two senators made arrangements for a secret mission to Sibensko. Since New Republic officials were prohibited from engaging in undercover work, Leia made plans for her team to travel disguised as smugglers. Under Leia's instructions, Sonnel and Seastrikerl traveled to the seedy space station of Chrome Citadel disguised as smugglers. At a cantina, the two smugglers accepted a discreet job to transport material from Daxam IV to Sibensko. During their trip to Chrome Citadel, Sonnel and Joph struck up a friendship.\nLater, the two pilots met with Leia and Casterfo to discuss the details of their mission. Their trip to Daxam IV was scheduled to take place the following week. Leia supplied Sonnel and Joph with various disguises including an Ubese bounty hunter's mask. Casterfo also theorized that Rinnrivin and Hadrassian had a source in the Galactic Senate, whom Sonnel speculated was a Centrist. Prior to leaving, Sonnel took C-3PO for an oil bath. The joint investigatory mission experienced a blow when another prominent Centrist senator Lady Carise Sindian learned about Leia's true parentage as the daughter of Darth Vader. Knowing Casterfo's hatred for Vader, Lady Carise informed the young senator. Feeling betrayed, Casterfo upstaged Leia's hearing on her suitability for First Senator by revealing her parentage as Vader's daughter. This created a political firestorm which destroyed Leia's political career and reputation.\nFollowing the scandal, Sonnel and C-3PO remained loyal to Leia and helped keep a baying crowd from entering Leia's office. However, Sonnel's friend Korrie resigned in protest of Leia's perceived insincerity. Sonnel later allowed Leia's Populist friend senator Tai-Lin Garr to enter the room and comfort her. Sonnel also made a requisition order for the keepsake chest and the music box that Casterfo had used during the Senate hearing. That night, Sonnel undertook research into Leia's family history and discovered that Leia's father Anakin Skywalker had indeed been a Jedi Knight and Padmé Amidala's husband before becoming Darth Vader. Sonnel later discussed her findings with Joph and the two decided to reaffirm their loyalty to Leia. After discussing details of their investigation into Rinnrivin and the Amaxines with Leia, they agreed to wait until Leia had obtained leave from the Senate.\nShortly therafter, Sonnel visited the medcenter to obtain another dose of Hadeira serum. When a 2-1B-series medical droid attended to her, the droid informed her that her use of the drug exceeded suggested limits. Due to the recent stress of Casterfo's revelations, Sonnel had begun to experience symptoms of bloodburn, including spasms in her leg muscles. Despite the injection, Sonnel experienced a bloodburn attack while making preparations with Leia, Joph, and C-3PO for their Sibensko trip. Joph managed to grab her before she fell to the floor and took her to Dr Kalonia. Sonnel survived due to prompt medical attention. While recovering, Joph expressed his love for Sonnel and comforted her.\nAfter Leia obtained leave from the Senate, Sonnel and her companions traveled on a junker ship to Sibensko. For the mission, Sonnel wore a gray and black suit of Mandalorian armor while Joph wore an Ubese bounty hunter's mask. Leia pretended to be their indentured servant while C-3PO pretended to be Leia's minder. Upon arriving at Sibensko, Sonnel and Joph met an Amaxine warrior named Padric, who revealed that they were transporting a shipment of thousands of thermal detonators, which were destined for Hosnian Prime. While Sonnel and Joph loaded the cargo, Leia and C-3PO infiltrated the underwater city and managed to download banking records linking the Amaxines to Rinnrivin's cartel. Leia then sent C-3PO back to the ship and gave Joph instructions to leave with the droid while she spied on the Amaxine base.\nAfter finishing their loading, Sonnel and Joph discussed Leia 's orders with C-3PO. While Joph refused to leave Leia behind, Sonnel assured him that Leia was capable of stealing a ship for herself. C-3PO backed her up by telling that Leia had given them explicit orders. While Sonnel and Joph argued about Leia's safety, an alarmed C-3PO reported that a large Amaxine army was based inside the base. After killing Rinnrivin, Leia infiltrated the base where she discovered the Amaxines marshalling several starfighters. Despite being pursed, the senator managed to escape up a platform where she was rescued by her husband Han. Sonnel then contacted Han's racer and expressed relief and surprise at his arrival. Shortly later, the Amaxine base and underwater city was destroyed when a stricken Amaxine B-wing crashed into its heavily-stocked underwater depot. The explosion eliminated both Rinnrivin's cartel and the Amaxines as threats to the New Republic.\nFollowing the mission to Sibensko, Sonnel and Joph stored the stolen thermal detonators and their junker ship at a low-rent civilian hangar under the orders of senator Organa. Sonnel and Joph also made arrangements to store the thermal detonators at a secure storage space. Despite the defeat of the Amaxines and Rinnrivin's cartel, Leia believed that other threats to the New Republic lurked in the galaxy. With the Senate unwilling to take action, Leia had decided to resign from the Senate after her term was up.\nAfter Casterfo spoke up in Leia's defense during a Senate hearing on the Sibensko mission, Lady Carise, who was a secret agent of the First Order, hired Hadrassian to assassinate the Populist politician Tai-Lin Garr and then framed Casterfo for the crime. As evidence of Casterfo's purported linkages to Hadrassian, Lady Carise leaked a video of the two shaking hands. Sonnel quickly determined that the video had been doctored by Lady Carise's slicers. While Sonnel believed they could use this evidence to clear Casterfo's name, they were unable to prevent him from being deported for imprisonment, trial, and sentencing on his homeworld of Riosa.\nLater, Sonnel and several other New Republic personnel including Joph, Snap Wexley, and Zari Bangel were present at a secret meeting in the New Republic hangar bay where Leia established a new paramilitary outfit called the Resistance to defend the New Republic from threats like the First Order, the instigators behind Rinnrivin's cartel and the Amaxine Warriors.\nGreer Sonnel was a human woman with thick, blue-black hair, full lips, and deep coppery skin. She preferred plain, practical clothing. Despite the fact that it was standard procedure to ground pilots diagnosed with bloodburn, Sonnel kept her condition quiet and pulled double duty as Organa's personal pilot as well as her chief of staff. As a high-ranking staff member, Sonnel was one of the few people privy to the fact that Organa was the daughter of the Imperial enforcer Darth Vader; this secret would have ramifications for Organa's political career if publicly disclosed. Despite Organa's parentage, she remained loyal to the older woman and refused to condemn her for her late father's actions.\nWhile initially wary of Ransolm Casterfo, she grew to respect and befriend the Centrist senator due to his courage, fighting skills, and selflessness. She and Leia were some of the few to believe in Casterfo's innocence following the murder of Tai-Lin Garr. During the course of her work for Organa, Sonnel came to develop romantic feelings for the New Republic starfighter pilot Joph Seastriker. Both were loyal to Organa and to the New Republic.\nDue to her upbringing in Pamarthe, Sonnel was a tough woman who did not believe in crying and admired honorable warriors. She found the adjustment to the formality of the Senate challenging, but worked to improve her diplomatic skills. Like Organa, she realized that the New Republic was unable to defend itself against threats like the First Order.\nGreer Sonnel was a skilled pilot who loved flying with a passion. She was also familiar with slicing and could ascertain when a video recording had been tampered with. She also liked martial combat and found a kindred spirit in Casterfo.\nGreer Sonnel was created in 2016 for the novel Bloodline, written by Claudia Gray. While writing the novel, Gray imagined Sonnel as being portrayed by actress Priyanka Chopra.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Greer",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Greer_Sonnel",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/RZ-2_A-Wing_Expansion_Pack",
  "/wiki/Pamarthe",
  "/wiki/Human",
  "/wiki/Pamarthen",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Crystal_Cairn",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Resistance",
  "/wiki/Pilot",
  "/wiki/Senator",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Ossifrage",
  "/wiki/Bloodburn",
  "/wiki/28_ABY",
  "/wiki/Rinnrivin_Di",
  "/wiki/Rinnrivin_Di%27s_cartel",
  "/wiki/Amaxine_warriors_(New_Republic_Era)",
  "/wiki/Ransolm_Casterfo",
  "/wiki/X-wing_starfighter",
  "/wiki/Joph_Seastriker",
  "/wiki/Korr_Sella",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Starfighter",
  "/wiki/The_galaxy",
  "/wiki/The_Gauntlet_(starship_race)",
  "/wiki/Bors",
  "/wiki/Torret",
  "/wiki/Vee",
  "/wiki/Karsted",
  "/wiki/Han_Solo",
  "/wiki/Eye",
  "/wiki/Comlink",
  "/wiki/Starship",
  "/wiki/Second",
  "/wiki/Five_Sabers",
  "/wiki/25_ABY",
  "/wiki/Standard_year",
  "/wiki/Amaxine_warrior_crisis",
  "/wiki/Hadeira_serum",
  "/wiki/New_Republic_senatorial_complex",
  "/wiki/Hosnian_Prime",
  "/wiki/Transport",
  "/wiki/Mirrorbright",
  "/wiki/Marriage",
  "/wiki/New_Republic_Senate",
  "/wiki/Populists",
  "/wiki/Centrists",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/Bail_Organa_statue-dedication_ceremony",
  "/wiki/Parent",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Bevicard",
  "/wiki/Coruscant",
  "/wiki/Politics",
  "/wiki/Mission_to_Bastatha",
  "/wiki/Nikto",
  "/wiki/Crime_lord",
  "/wiki/Bastatha",
  "/wiki/New_Republic_pilot",
  "/wiki/Senate_hangar",
  "/wiki/C-3PO",
  "/wiki/Unidentified_casino",
  "/wiki/Magistrate",
  "/wiki/Tosta",
  "/wiki/Xun",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Spice",
  "/wiki/Rinnrivin%27s_headquarters",
  "/wiki/Outer_Rim_Territories",
  "/wiki/First_Senator",
  "/wiki/Homeworld",
  "/wiki/Ocean",
  "/wiki/Unidentified_tavern-keeper",
  "/wiki/Daxam_IV",
  "/wiki/Smuggler",
  "/wiki/Galactic_Republic",
  "/wiki/Standard_day",
  "/wiki/Senatorial_conference_building",
  "/wiki/Napkin_Bombing",
  "/wiki/Bacta",
  "/wiki/Doctor",
  "/wiki/Harter_Kalonia",
  "/wiki/Medcenter",
  "/wiki/Twi%27lek",
  "/wiki/Mercenary",
  "/wiki/Ryloth",
  "/wiki/Arliz_Hadrassian",
  "/wiki/Jeconne_courier",
  "/wiki/Hyperspace",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Crimson_Blade",
  "/wiki/Nose",
  "/wiki/Unidentified_teahouse",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Arliz_Hadrassian%27s_brother",
  "/wiki/Battle_of_Jakku",
  "/wiki/Squadron",
  "/wiki/Atmosphere",
  "/wiki/Speeder_bike",
  "/wiki/Holocam",
  "/wiki/Amaxine_warriors%27_camp",
  "/wiki/Water",
  "/wiki/Expansion_Region",
  "/wiki/Sibensko",
  "/wiki/Mission_to_Sibensko",
  "/wiki/Space_station",
  "/wiki/Chrome_Citadel",
  "/wiki/Cantina",
  "/wiki/Ubese",
  "/wiki/Bounty_hunter",
  "/wiki/Oil_bath",
  "/wiki/Lord",
  "/wiki/Carise_Sindian",
  "/wiki/Darth",
  "/wiki/Anakin_Skywalker",
  "/wiki/Tai-Lin_Garr",
  "/wiki/Keepsake_chest",
  "/wiki/Music_box",
  "/wiki/Jedi_Knight",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/2-1B-series_medical_droid",
  "/wiki/Limb",
  "/wiki/Mandalorian_armor",
  "/wiki/Padric",
  "/wiki/Thermal_detonator",
  "/wiki/Sibensko_complex",
  "/wiki/Racing_starfighter",
  "/wiki/A/SF-01_B-wing_starfighter",
  "/wiki/Hangar",
  "/wiki/Agent",
  "/wiki/First_Order",
  "/wiki/Tai-Lin_Garr%27s_assassination",
  "/wiki/Slicer",
  "/wiki/Prison",
  "/wiki/Riosa",
  "/wiki/Temmin_Wexley",
  "/wiki/Zari_Bangel",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/2016",
  "/wiki/Bloodline_(novel)",
  "/wiki/Claudia_Gray",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Star_Wars_Insider",
  "/wiki/Scorched",
  "/wiki/Star_Wars_Insider_165",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/StarWars.com"
 ]
}