{
 "name": "Greez_Dritus",
 "display_name": "Greez Dritus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lateron"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Latero"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Stinger Mantis crew"
     ]
    }
   ]
  }
 ],
 "content": "Greez Dritus was a Latero male who lived during the Imperial Era. He worked for Cere Junda and was the captain of the Stinger Mantis. He was known to have a bad gambling habit, and got into trouble with the Haxion Brood.\nGreez Dritus was a Latero male who was raised by his great-grandmother on Lateron. Growing up, Dritus' parents weren't around very much, but it was from them that Dritus learned his habit of risk-taking. He attended the Lateron Space Academy, where he learned how to pilot.\nAt some point during the Galactic Republic's existence, Greez traveled to Coruscant and snuck onto a tour group that was touring the Jedi Temple. Wearing a disguise, Greez planned to pull a heist on the Temple, but became too scared to seriously attempt it while he was there.\nBefore 14 BBY, he took out a large loan to purchase the Stinger Mantis and left Lateron. He had fond memories of his home planet, though he lamented the Empire's exploitation of it.\nAfter Order 66 and during the Great Jedi Purge, former Jedi Knight Cere Junda hired Dritus to assist her in her efforts to restore the Jedi Order. This entailed piloting the Mantis as needed, monitoring Imperial communications, providing quarters, and preparing food. The Latero was fond of the latter duty, as he appreciated both the social value of meals and being reminded of his heritage.\nAt some point Greez and Cere traveled to Nar Shaddaa and went to the Slag Pit cantina. There, Greez was ambushed by a group of smugglers, forcing Greez to fight back and causing them to be kicked out of the cantina. Greez ended up drinking rum from Cere's flask in the alley outside the cantina. According to Greez, this was the point when his dynamic with Cere began to change for the better.\nIn 14 BBY, Dritus and Junda discovered that Imperial Inquisitors were on route to Bracca. Correctly surmising that they had discovered a Jedi, the pair arrived just in time to rescue Cal Kestis from the Second Sister. Dritus then flew the group to Bogano on Junda's direction, where they discovered the existence of Eno Cordova's holocron, which contained a list of Force-sensitive children. Junda and Kestis decided to focus their efforts on searching for it, and Dritus obliged, flying them to the locations that had clues to where Cordova hid it. Though the travels of the group took them to many conflicts, Dritus remained hesitant to directly engage in physical combat, preferring to stay near the Mantis when possible.\nNear the end of the Mission to Zeffo, the extent of Dritus' gambling habits were revealed when Kestis was captured by the Haxion Brood, forced to fight for his life in an arena due to his valuable status as a Jedi and association with Dritus. Dritus had previously lied to his crew about paying off the debt, so this blindsided them. The Latero regretted this deeply, later apologizing to Kestis for endangering him. Bounty hunters representing the crime syndicate continued to attempt to apprehend Kestis for the remainder of his travels.\nAfter the successful retrieval of Cordova's holocron, Junda stated that their formal business was concluded. However, Dritus offered to let them continue to stay on the Mantis indefinitely.\nBy 9 BBY, Dritus had seemingly vanished, along with crewmembers Cere Junda and Merrin, as he was not piloting the Mantis when it had landed on a planet.\nDespite his history of gambling, Greez was one of the most risk-averse members of the Stinger Mantis' crew. He repeatedly expressed hesitation when asked to travel to dangerous planets such as Dathomir, and later confessed to being highly intimidated by Nightsister Merrin. He hated nature and constantly cooked meals for the crew. He also had a terrarium behind a wall of Umbaran glass and was grateful when Cal Kestis collected seeds for it. Even though he was initially hesitant about Cal, Greez warmed up to him throughout their time together.\nGreez Dritus was introduced in the 2019 video game Star Wars Jedi: Fallen Order. According to the game's director Stig Asmussen, the inspiration for Greez Dritus was John C. Reilly and Ralph Furley from the sitcom Three's Company. He is played by Daniel Roebuck.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Greez_Dritus",
  "/wiki/Lateron",
  "/wiki/Latero",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Stinger_Mantis_crew",
  "/wiki/Imperial_Era",
  "/wiki/Cere_Junda",
  "/wiki/Captain",
  "/wiki/Stinger_Mantis",
  "/wiki/Haxion_Brood",
  "/wiki/Greez_Dritus%27s_great-grandmother",
  "/wiki/Lateron_Space_Academy",
  "/wiki/Pilot",
  "/wiki/Galactic_Republic",
  "/wiki/Coruscant",
  "/wiki/Imperial_Palace",
  "/wiki/14_BBY",
  "/wiki/Planet",
  "/wiki/Order_66",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Jedi_Knight",
  "/wiki/Secret_mission_to_rebuild_the_Jedi_Order",
  "/wiki/Jedi_Order",
  "/wiki/Nar_Shaddaa",
  "/wiki/Slag_Pit",
  "/wiki/Galactic_Empire",
  "/wiki/Inquisitorius",
  "/wiki/Bracca",
  "/wiki/Escape_from_Bracca",
  "/wiki/Cal_Kestis",
  "/wiki/Second_Sister",
  "/wiki/Bogano",
  "/wiki/Eno_Cordova",
  "/wiki/Eno_Cordova%27s_holocron",
  "/wiki/Force-sensitive",
  "/wiki/Mission_to_Zeffo",
  "/wiki/Haxion_Fight_Pit",
  "/wiki/Bounty_hunter",
  "/wiki/9_BBY",
  "/wiki/Merrin",
  "/wiki/Gambling",
  "/wiki/Dathomir",
  "/wiki/Nightsisters",
  "/wiki/Terrarium",
  "/wiki/Umbaran_glass",
  "/wiki/Seed",
  "/wiki/Time",
  "/wiki/2019",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Stig_Asmussen",
  "/wiki/Daniel_Roebuck",
  "/wiki/Category:Images_of_Greez_Dritus",
  "/wiki/StarWars.com",
  "/wiki/Electronic_Arts",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Inside_the_Fallen_Order",
  "/wiki/Star_Wars_Insider_193",
  "/wiki/The_Art_of_Star_Wars_Jedi:_Fallen_Order",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Jedi:_Survivor",
  "/wiki/Standard_year",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Clone_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/August_21"
 ]
}