{
 "name": "Greedo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia",
      "Tatooine"
     ]
    },
    {
     "name": "Born",
     "values": [
      "44 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.74 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Indigo"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire",
      "Trade Federation"
     ]
    }
   ]
  }
 ],
 "content": "Greedo was a male Rodian bounty hunter who grew up on Tatooine in Mos Espa. During the Clone Wars, he was hired by the Trade Federation to kidnap Chi Eekway Papanoida and Che Amanwe Papanoida, the daughters of Chairman Papanoida, but was forced by the chairman to lead him and his son Ion to them. He was occasionally hired by crime lord Jabba the Hutt for various mercenary jobs, including the capture of Han Solo, who killed the luckless Rodian.\nOriginally hailing from the swamp planet of Rodia, during his youth, Greedo relocated and lived on the desert planet of Tatooine. After the slave boy Anakin Skywalker won the famous Boonta Eve Classic, beating the renowned Dug racer Sebulba, Greedo jumped to the conclusion that he had cheated. Angered by the false accusation, Skywalker consequently found himself entangled in a fight with the young Rodian. The fellow young Rodian Wald warned Greedo that if he continued to pick on fights, he would eventually meet with a bad end.\nBy the Clone Wars, Greedo was employed to Jabba the Hutt as a bounty hunter. At some point in the war, he and another mercenary were hired by the Trade Federation to kidnap Chairman Papanoida's daughters, Che Amanwe and Chi Eekway, to use as leverage for Pantora to join the Confederacy of Independent Systems. In the ensuing struggle, Che struck Greedo with an idol, covering its base with the Rodian's green blood. After finding this blood sample while investigating his daughter's kidnapping, Chairman Papanoida and his son Ion tracked the bounty hunter to Jabba's Palace and presented the evidence to Jabba, who then forced Greedo to bring the Pantorans to the cantina in Mos Eisley where Che was being held. In the ensuing firefight, Greedo managed to slip away while the family gunned down the rest of Che's captors.\nDuring Obi-Wan Kenobi's exile to Tatooine in the Imperial Era, Greedo was confronted by a blaster-armed Sullustan down the backalley of Chalmun's Spaceport Cantina.\nLater, while continuing his work for Jabba, Greedo captured Figrin D'an of Figrin D'an and the Modal Nodes and delivered him to Jabba, after which D'an and his band entered into indentured servitude under Jabba, due to D'an being in heavy debt to him. During their time there, the group kept tabs on Greedo using their superior hearing abilities, seeing how he would bring in small-time criminals, help them to escape, then bring them back to re-collect the bounty. At one point, they discovered Greedo bringing in one unfortunate Jawa three times. Upon gaining enough money to free themselves, the band told Jabba of these events, which made him furious. This resulted in a grudge between Greedo and the band.\nDuring the trade wars, Greedo was hired by Jabba to eliminate InterGalactic Banking Clan Vice Chairman Anolo on Mygeeto and acquire his Givin codebreaker. There, Greedo, Barada, and several of Jabba's thugs led an assault against the Vice Chairman and his guards. Greedo was able to kill Anolo and put the codebreaker into Anolo's Office. In the office, Greedo used Anolo's lightsaber to make his escape with the Givin. However, Greedo was unable to capture the Givin and it fell to its death. Greedo returned to Tatooine and went on his knees before Jabba at his palace. Greedo offered the lightsaber to Jabba, but the Hutt refused it and faced Greedo with the prospect of becoming the rancor Pateesa's food. However, Greedo was saved when the antiques collector Dok-Ondar offered to buy the lightsaber from Jabba.\nSometime later, Greedo tipped off Jabba to something the Hutt was looking for. Jabba then paired up Greedo with the smuggler Han Solo and his Wookiee companion Chewbacca for a special mission; retrieving a verillix urn which contained the ashes of one of Jabba's most hated rivals, Krestrel D'Naran. The reward for the urn was one million credits, which would be split between the hired hunters. Once they reached Corellia in the Millennium Falcon, Greedo brought Solo and Chewbacca to the planet's Pearl District. He told them that the urn was being kept in a safe within the penthouse of Augustus Graves, Chief Executive Officer of the Corellian Engineering Corporation. After briefly sneaking inside the penthouse, Solo informed Greedo that the safe was a Locris 1-42-08 and that they would need something as strong as a turbolaser to cut through it. Solo assured Greedo he would think of something before he and Chewbacca left the smuggler to think over a Montalsian ale. Later, Solo returned to Greedo and Chewbacca on the Falcon, informing them that he met a man named Ovan who claimed to be his father. When Greedo asked him if they were on Corellia for sentiment or to do a job, Solo explained that as a shipbuilder, Ovan had access to equipment they would need to get into the penthouse. Greedo then asked how they would get in, to which Chewbacca pointed out that Graves had hired private security following the break-in. To this, Solo claimed that the guards would be their way inside.\nAfter regrouping with Solo, Chewbacca and Ovan, Greedo watched as Solo used an explosive to break into a laundromat and took three security uniforms. As Chewbacca left to retrieve their getaway vehicle, Solo, Greedo and Ovan disguised themselves as guards and approached the building. Ovan managed to bluff their way inside and the three of them made their way to a turbolift. Upon reaching the door to the penthouse, Greedo began to work on the electrolock but found that he couldn't open it. Solo then contacted an actual guard and asked them to remotely unlock the door for them due to the lock malfunctioning. The ploy worked and the guard opened the door, allowing them to enter the penthouse. Once they were inside, Solo told Greedo to keep watch and not touch anything while he and Ovan opened the safe. As they got to work, Greedo noticed a few expensive looking items and picked one of them up. He was then confronted by Solo, who informed him that the safe was empty and that his intel had been wrong. Noticing the item Greedo was holding, Solo reminded him that he was told not to touch anything. Greedo remarked that it was worth at least ten thousand credits before Solo pointed out that it was tagged with an MSX tracker. An alarm then sounded throughout the building and the three of them ran for the turbolift, only to be met by a group of armed security guards.\nGreedo fired at the guards, though the blast bounced off from the transparisteel windows. This gave Solo an idea, leading him to call another group of guards for medical assistance, call Chewbacca for backup and break one of the windows with Ovan's plasma cutter. The guards then arrived in a medshuttle and Solo stunned the driver, allowing them to escape and rendezvous with Chewbacca. Once they used a landspeeder to return to the Falcon, Solo had Greedo look for a hydrospanner, only for him to be left on Corellia as the Falcon flew away. Luckily, Greedo was picked up by Khel Tanna and her crew aboard their starship before they left for Graves' planetoid Mollo Tanka. Once they reached the planetoid, they found Solo and Chewbacca being chased by Graves' guards, including the bounty hunter Krrsantan. The crew then fired on the guards and brought the smuggler and Wookiee aboard before taking off from Mollo Tanka. As Solo expressed his gratitude, Greedo punched the smuggler for leaving him stranded on Corellia. Solo then led the crew back to the shop on Antillion where they found the urn, for which they would share the reward. However, once they reached the shop, they found that the urn was gone. Chewbacca then realized that Ovan had been an imposter and had faked being unconscious to make off with the urn and the Falcon. Solo then revealed that he had placed a tracker on the conman as insurance. Once they left Antillion, Greedo informed Tanna that the tracker led to the Benelex Marshal Service Headquarters on Paqualis III. After landed on a nearby platform, the crew split up, with Greedo, Chewbacca and Ooris Bynar going after Tyra while Solo, Tanna, T'onga and Akko stayed on the ship. As they brought Tyra aboard, Chewbacca was blasted and arrested by Marshal Buck Vancto. Solo tried to stop the crew from leaving, but Greedo intervened and shot Solo in the chest.\nBelieving Solo to be dead, the crew dropped him off on Escalan before leaving to retrieve the Falcon. With Tyra's help, they found the ship at an Imperial Impound Facility on Iakar. Sneaking into the facility along with T'onga and Tyra, Greedo created a diversion while the crew fought their way toward the Falcon. Once they retrieved the ship, they fled the facility and regrouped on an asteroid. Tyra then opened the compartment on the ship where he had stored the urn, only to find that it was gone.\nGreedo was hunting Solo for the bounty Jabba placed on his head after the smuggler dropped a large shipment of illicit cargo owned by the Hutt to avoid Imperial arrest. A fellow Rodian bounty hunter named Neesh, who actually had been hired to kill Greedo before outsourcing the job to Spruch Goa, had encouraged Greedo to make a play at capturing Solo. Despite Neesh urging him to act alone when confronting Solo, Greedo hired Cornelius Evazan and Ponda Baba as backup.\nTo corner the smuggler, Greedo traveled to the Mos Eisley Cantina, where he also attempted to collect money owed to him by Bith musician Lirin Car'n. However, Car'n was unable to pay as he had been robbed the previous night. Greedo allowed Car'n to live, raising his interest rate and giving him until next week to pay up, believing Car'n to be a waste of his time.\nGreedo was humiliated briefly at the Mos Eisley cantina when he was tripped by a piece of the instrument used by Ickabel G'ont, a member of the Model Nodes. He decided to ignore the insult, seeing payback against Solo as sweeter than revenge on the Nodes. Upon entering the cantina, Greedo saw its bartender, Wuher, ordering the droids C-3PO and R2-D2 to leave the premises. While the Rodian steeled himself mentally for the encounter, he thought about how his former lover Uncelta fell for Solo only to have the smuggler break her heart.\nWhile at the bar, Greedo saw Baba lose an arm to the lightsaber of Obi-Wan Kenobi due to assaulting Luke Skywalker, an event at which he merely laughed. However, this prevented Baba and Evazan from assisting Greedo, as had been previously planned, forcing the Rodian to improvise.\nGreedo challenged Solo at the Mos Eisley Cantina, where, threatening Solo with his gun, he demanded that he pay the money to Jabba or to Greedo himself; or hand over Solo's legendary starship, the Millennium Falcon. When Solo replied that he would rather die than give up his ship, Greedo said that was indeed the idea before announcing that it was something he had been looking forward to for a long time. As Greedo pulled his trigger and said that he would end with him, Solo shot Greedo dead from beneath the table with his readily prepared blaster. Greedo missed Solo completely and the last thing that Greedo ever saw was a flash of bright light with a memory of bitter injustice.\nAs a boy, Greedo was noted for his temper and tendency to pick fights with others, which his friend Wald warned would lead to trouble. In adulthood, Greedo was overconfident and slow on the uptake, and something of a poor shot with a blaster. He thought highly of himself as a \"big time\" bounty hunter due to his employment to Jabba the Hutt, even believing himself more prestigious than Boba Fett, though others saw him as unremarkable. He was a frequent customer of Chalmun's Cantina, considering it his base of operations and preferred venue for death deals. He was known for rotten luck, and that proved true for the majority of his life. Despite his overwhelmingly poor fortunes, Greedo was a persistent and cautious operator. However, when he finally cornered Solo, he carelessly let his guard down and began gloating, an uncharacteristic mistake that cost him his life.\nGreedo first appeared in the 1977 film Star Wars: Episode IV A New Hope, the first installment of the Star Wars original trilogy. He was played by Paul Blake and voiced by Larry Ward. In the Star Wars: The Clone Wars episode \"Sphere of Influence,\" Greedo was voiced by Tom Kenny.\nBlake played Greedo in the shots that feature both Greedo and Han Solo in the same frame. For Greedo's close-ups, a new articulated head was built for pickups at the end of the shoot, and Maria De Aragon was enlisted to play the Rodian. The mechanism for Greedo's mouth broke just before he needed to be shot. Aragon was then asked to put a clothespin between her teeth to move Greedo's mouth, making Greedo come to life. During pickups, Greedo's costume vest changes significantly, as do his hands. In the original shoot, Greedo has long, suction-cup tipped fingers, and in pickups, he has swollen knuckles and shorter fingers. The Greedo mask and tunic are currently on display as part of the \"Out of this World: Extraordinary Costumes from Film and Television\" in the Science Fiction Museum \u0026 Hall of Fame in Seattle, Washington. George Lucas called upon Ben Burtt to come up with a voice for Greedo, the first Rodian in Star Wars. Linguist Larry Ward provided the voice over, and it was Burtt's job to make the voice interesting. At first, the word \"oink\" was going to be manipulated with \"the right rhythm and electrical equipment\" to make a bizarre-sounding language, but they were unhappy with the result. Burtt and a UC Berkeley grad student went through multiple languages including the Quechua, and they created their own. A combination of multiple languages paired with expert editing were used to create Greedo's voice.On the other hand, while Ward did provide little bits of Greedo's voice, Blake also provided some of words as well, which were later scrambled electronically, but none of their voice work was done at Elstree Studios. According to Blake, however, Greedo was just referred as \"The Alien\" in the script. Aragon claims that George Lucas practically saved her life when he saw her making odd vestures to signal that she couldn't breathe in the mask.\nGreedo's manner of death has been subject to a number of retcons over the years. The most famous involves the question of who shot first, for in the original release of the film, as well as the script, Greedo did not shoot at Han at all. In the 1997 re-release of the film, Greedo gets a badly-aimed shot at Solo before Solo kills him. George Lucas has said that this change is to enhance Solo's overall heroism, making him seem less of a killer and more of a \"cowboy\" to viewers. This was a controversial decision and in the 2004 version the two shots are almost simultaneous, with Greedo shooting first. In A New Hope: The Princess, the Scoundrel, and the Farm Boy, there is no mention of Greedo firing a shot and author Alexandra Bracken, when asked, stated that Solo fired before Greedo could get off a shot. The 2019 release of A New Hope on Disney+ depicted Greedo saying one last word before being shot by Han, an alteration inserted by Lucas before selling Lucasfilm Ltd. to The Walt Disney Company in 2012. However, Greedo's voice work wasn't reused footage from Blake.\nIn 1999, Greedo made a cameo appearance in Star Wars: Episode I The Phantom Menace, in a deleted scene where he accuses Anakin Skywalker of cheating in the Boonta Eve Classic, leading Qui-Gon Jinn to separate them.\nIn the From a Certain Point of View short story \"The Luckless Rodian,\" Greedo is said to have never seen a lightsaber in person, only having heard stories of the weapon. The comic Galaxy's Edge 2 contradicts this, showing Greedo's theft of Ki-Adi-Mundi's lightsaber. This article currently assumes the latter and more recent source is correct.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Greedo",
  "/wiki/Greedo/Legends",
  "/wiki/Star_Wars_(2015)_28",
  "/wiki/Han_Solo_%26_Chewbacca_1",
  "/wiki/Han_Solo_%26_Chewbacca_2",
  "/wiki/Han_Solo_%26_Chewbacca_3",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/Han_Solo_%26_Chewbacca_6",
  "/wiki/The_Luckless_Rodian",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/Rodia",
  "/wiki/Tatooine",
  "/wiki/44_BBY",
  "/wiki/0_BBY",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Trade_Federation",
  "/wiki/How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Bounty_hunter",
  "/wiki/Mos_Espa",
  "/wiki/Clone_Wars",
  "/wiki/Chi_Eekway_Papanoida",
  "/wiki/Che_Amanwe_Papanoida",
  "/wiki/Chairman",
  "/wiki/Notluwiski_Papanoida",
  "/wiki/Ion_Papanoida",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Mercenary",
  "/wiki/Han_Solo",
  "/wiki/Death",
  "/wiki/Homeworld",
  "/wiki/Swamp",
  "/wiki/Planet",
  "/wiki/Desert",
  "/wiki/Slavery",
  "/wiki/Anakin_Skywalker",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Dug",
  "/wiki/Boonta_Eve_Classic_Podracer_pilot",
  "/wiki/Sebulba",
  "/wiki/Wald",
  "/wiki/Unidentified_Gotal_bounty_hunter",
  "/wiki/Kidnapping_of_the_Papanoida_daughters",
  "/wiki/Pantora",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Icon_of_the_Moon_Goddess",
  "/wiki/Color_Graphix",
  "/wiki/Blood",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Pantoran",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Mos_Eisley",
  "/wiki/Rescue_in_Chalmun%27s_Cantina",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Imperial_Era",
  "/wiki/Sullustan",
  "/wiki/Chalmun",
  "/wiki/Spaceport",
  "/wiki/Cantina",
  "/wiki/Figrin_D%27an",
  "/wiki/Figrin_D%27an_and_the_Modal_Nodes",
  "/wiki/Band",
  "/wiki/Time",
  "/wiki/Bounty",
  "/wiki/Unidentified_Jawa_prisoner",
  "/wiki/Jawa",
  "/wiki/Trade_wars",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Vice_Chairman",
  "/wiki/Anolo",
  "/wiki/Mygeeto",
  "/wiki/Unidentified_Givin_codebreaker",
  "/wiki/Barada",
  "/wiki/Ki-Adi-Mundi%27s_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Diet",
  "/wiki/Collector",
  "/wiki/Dok-Ondar",
  "/wiki/Smuggler",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Heist_on_Corellia",
  "/wiki/Krestrel_D%27Naran",
  "/wiki/Corellia",
  "/wiki/Millennium_Falcon",
  "/wiki/Pearl_District",
  "/wiki/Augustus_Graves%27_penthouse",
  "/wiki/Augustus_Graves",
  "/wiki/Chief_Executive_Officer",
  "/wiki/Corellian_Engineering_Corporation",
  "/wiki/Turbolaser",
  "/wiki/Montalsian_ale",
  "/wiki/Corbus_Tyra",
  "/wiki/Ovan",
  "/wiki/Laundromat",
  "/wiki/Locris_Syndicated_Securities",
  "/wiki/Turbolift",
  "/wiki/Transparisteel",
  "/wiki/Shuttle",
  "/wiki/Landspeeder",
  "/wiki/Hydrospanner",
  "/wiki/Khel_Tanna",
  "/wiki/Khel_Tanna%27s_crew",
  "/wiki/Khel_Tanna%27s_starship",
  "/wiki/Planetoid",
  "/wiki/Mollo_Tanka",
  "/wiki/Krrsantan",
  "/wiki/Antillion",
  "/wiki/Benelex_Marshal_Service",
  "/wiki/Benelex_Marshal_Service_Headquarters",
  "/wiki/Paqualis_III",
  "/wiki/Landing_platform_31-Beta",
  "/wiki/Ooris_Bynar",
  "/wiki/T%27onga",
  "/wiki/Akko",
  "/wiki/Marshal",
  "/wiki/Buck_Vancto",
  "/wiki/Iakar",
  "/wiki/Asteroid",
  "/wiki/Galactic_Empire",
  "/wiki/Neesh",
  "/wiki/Spruch_Goa",
  "/wiki/Cornelius_Evazan",
  "/wiki/Ponda_Baba",
  "/wiki/Bith",
  "/wiki/Musician",
  "/wiki/Lirin_Car%27n",
  "/wiki/Standard_week",
  "/wiki/Ickabel_G%27ont",
  "/wiki/Bartender",
  "/wiki/Wuher",
  "/wiki/Droid",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/Uncelta",
  "/wiki/Heart",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Luke_Skywalker",
  "/wiki/DT-12_heavy_blaster_pistol",
  "/wiki/Starship",
  "/wiki/Han%27s_heavy_blaster_pistol",
  "/wiki/Blaster",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Paul_Blake",
  "/wiki/Larry_Ward",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Sphere_of_Influence",
  "/wiki/Tom_Kenny",
  "/wiki/Maria_De_Aragon",
  "/wiki/Mouth",
  "/wiki/Tooth",
  "/wiki/George_Lucas",
  "/wiki/Ben_Burtt",
  "/wiki/Elstree_Studios",
  "/wiki/Retcon",
  "/wiki/Han_shot_first",
  "/wiki/List_of_changes_in_Star_Wars_re-releases#1997_special_editions",
  "/wiki/2004",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/Alexandra_Bracken",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/2012",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Han_Solo_%26_Chewbacca_4",
  "/wiki/Han_Solo_%26_Chewbacca_7",
  "/wiki/Han_Solo_%26_Chewbacca_8",
  "/wiki/Bounty_Hunt",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_Heroes_Path",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_Battlefront",
  "/wiki/Not_for_Nothing",
  "/wiki/We_Don%27t_Serve_Their_Kind_Here",
  "/wiki/The_Kloo_Horn_Cantina_Caper",
  "/wiki/Added_Muscle",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Smuggler%27s_Run:_A_Han_Solo_%26_Chewbacca_Adventure",
  "/wiki/Smuggler%27s_Run:_A_Han_Solo_%26_Chewbacca_Adventure_(audiobook)",
  "/wiki/Star_Wars_Adventures:_Smuggler%27s_Run_1",
  "/wiki/Star_Wars_(2015)_4",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars_Epic_Yarns:_A_New_Hope",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_Star_Wars:_The_Resistance_Rises",
  "/wiki/Hunting_for_Han",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/The_LEGO_Star_Wars_Holiday_Special",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_ABC-3PO",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_68",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Scum_and_Villainy_Conversion_Kit",
  "/wiki/Hound%27s_Tooth_Expansion_Pack_(X-Wing:_Second_Edition)",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_32",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Star_Wars:_Outer_Rim",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/Going_Green",
  "/wiki/Star_Wars_Insider_195",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Practical",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars:_The_Secrets_of_the_Bounty_Hunters",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/November_14",
  "/wiki/March_29",
  "/wiki/2020",
  "/wiki/September_23",
  "/wiki/2015",
  "/wiki/March_31",
  "/wiki/November_12",
  "/wiki/January_16"
 ]
}