{
 "name": "Greedo_the_Elder",
 "display_name": "Greedo the Elder",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Died",
     "values": [
      "17 BBY",
      "Rodia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tetsu Clan"
     ]
    }
   ]
  }
 ],
 "content": "Greedo the Elder was a male Rodian who was a member of the Tetsu Clan. He later became a famous bounty hunter, sired two sons, and became a leader of his clan. He was murdered by his arch rival, Navik the Red.\nGreedo lived on Rodia, becoming a successful bounty hunter, marrying and siring two sons. As an adult, Greedo began to look upon the traditional Rodian hunts as foolishness, and despite his feared reputation, Greedo refused to join in the gladiatorial combat that his people engaged in.\nAfter a successful career hunting criminals and outlaws, Greedo came to a violent end when his first-born son was young, dying in the purges of Navik the Red.\nGreedo's pregnant wife Neela, along with his son and namesake, and brothers-in-law Nok and Teeku, fled Rodia. Greedo's son sought to emulate his father by claiming the bounty on Han Solo, but died as violently as the first Greedo had.\nThe original intention was that the Greedo scuffling with Anakin Skywalker in the scene that was cut from The Phantom Menace and later included as part of the bonus material on the DVD, would be the same Greedo seen in A New Hope, and that Wald's prediction would foreshadow Greedo's death at the hands of Han Solo. George Lucas also stated in the commentary for the deleted scene that this was the same Greedo that appeared in A New Hope. However, in order to keep the Expanded Universe backstory developed for the A New Hope character intact, later references have retconned the Rodian who fought with Anakin as Greedo the Elder. However, in 2010, following the Star Wars: The Clone Wars episode Sphere of Influence, which also featured Greedo, it was re-retconned that the Greedo in The Phantom Menace's deleted scene is indeed the very same Greedo of A New Hope.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Neela",
  "/wiki/Greedo/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chalmun%27s_Spaceport_Cantina/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/17_BBY/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tetsu_Clan",
  "/wiki/Navik",
  "/wiki/Rodia/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Nok_(Rodian)",
  "/wiki/Teeku",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Sphere_of_Influence",
  "/wiki/A_Hunter%27s_Fate:_Greedo%27s_Tale",
  "/wiki/Tales_from_the_Mos_Eisley_Cantina",
  "/wiki/A_Hunter%27s_Fate:_Greedo%27s_Tale_(webstrip)",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Trilogy_Sourcebook,_Special_Edition",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com",
  "/wiki/The_Not-So_Magnificent_Seven"
 ]
}