{
 "name": "Greel",
 "display_name": "Greel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gamorrean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "SoroSuub Synthax-7 voice synthesizing cybernetic implant"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Broken Tusk"
     ]
    }
   ]
  }
 ],
 "content": "Greel was the co-owner of The Broken Tusk alongside his brother Gorge. Greel was the brains of the two brothers and managed the business side of their cantina.\nGreel and his brother Gorge were slaves of Var'Rotha Fin'Rotha who were restrained at all times except when the bounty hunter needed them for physical labor.\nWhile en route from Coruscant to the Outer Rim after delivering a high-priced bounty, Fin'Rotha let Greel out of his cage to clean the ship's interior. Greel broke the ship's hyperdrive and while Fin'Rotha was busy making repairs Greel freed Gorge and the two took over the ship, forcing their former master into an escape pod.\nThe pair piloted their new ship, the Tolan's Tusk until its fuel cells ran out and the ship crash landed on Reuss VIII. The brothers then converted the crashed ship into a cantina.\nAlthough the stereotypical Gamorreans were short and stocky with humongous horns or oversized hands, Greel was one of the precious few who had a different physique. Greel was tall and thin, producing a sharp contrast between himself and his brother who resembled the more common Gamorreans.\nGreel was also far more intelligent than a typical Gamorrean and had become a ruthless businessman, wheeling and dealing to keep their cantina profitable.\nGreel was far more intelligent than a typical Gamorrean displaying both technical and economic aptitudes. Although he never had any formal training he was able to pick up talent in business operations and computer programming. Unlike his brother, however, he was not particularly strong or skilled in any form of combat.\nGreel was able to communicate to the rest of the world by having a SoroSuub Synthax-7 voice synthesizing cybernetic implant installed making him one of the few Gamorreans in the galaxy who could speak Basic.\nGreel was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/The_Broken_Tusk_(Reuss_VIII)",
  "/wiki/Cohden_K%27Reye",
  "/wiki/Gorge",
  "/wiki/Cantina/Legends",
  "/wiki/Var%27Rotha_Fin%27Rotha",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Tolan%27s_Tusk",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Fists_of_Ion",
  "/wiki/StarWars.com",
  "/wiki/Unbound_Worlds",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}