{
 "name": "Green Leader  (clone trooper)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Tranquility"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Green Company",
      "Green Company"
     ]
    }
   ]
  }
 ],
 "content": "\"Green Leader\" was the callsign of the clone trooper who led Green Company, a unit of clone trooper attached to the Grand Army of the Republic's 41st Elite Corps during the Clone Wars. He was stationed aboard the Venator-class Star Destroyer Tranquility when the Confederacy of Independent Systems boarded the ship in a desperate attempt to rescue Viceroy Nute Gunray, leader of the Trade Federation, from Republic custody, and was killed in the battle after his company was overran in the Tranquility's hangar while trying to repel B2-series super battle droids that were deployed from a trio of Droch-class boarding ships.\nThis clone was born on the planet Kamino as a clone of the bounty hunter Jango Fett made to serve the Galactic Republic. Early during the Clone Wars against the Separatist Alliance, this clone trooper served in the Grand Army of the Republic's 41st Elite Corps as the commanding officer of Green Company, serving with the call sign \"Green Leader.\" During this time, Viceroy of the Trade Federation and Separatist Council member Nute Gunray was captured on the planet Rodia by Senator Padmé Amidala and her companions. Green Company was sent to retrieve Viceroy Gunray and transport him to the flagship Tranquility so that he could be taken to Coruscant and interrogated for Separatist information.\nWhile Jedi General Luminara Unduli and Jedi Commander Ahsoka Tano interrogated Gunray in the starship's brig, the Tranquility was attacked by vulture droid starfighters and Droch-class boarding ships. Clone Commander CC-1004 \"Gree\" deployed Green Company to repel Separatist forces, and Green Leader and his forces sprang into action, heading to the main hangar. B2-series super battle droids deployed from the boarding ships and into the hangar and engaged Republic forces led by Green Leader.\nAs the skirmish was underway, Green Leader contacted Commander Gree to report the status of the attack. After Separatist forces broke through and defeated the clone troopers, Green Leader hid behind a crate and warned Commander Gree that the droids were headed to the prison level and that his forces needed reinforcements. However, a super battle droid spotted Green Leader and killed him with several blaster shots. Ultimately, the super battle droids were stopped, but Gunray was freed by Asajj Ventress and a traitor to the Senate Guard, Faro Argyus.\nAs a clone of Jango Fett, Green Leader was a human male who was 1.83 meters tall and had naturally black hair, brown eyes, and tan skin. Being overwhelmed by enemy forces, Green Leader was able to hide until he had to contact Commander Gree and warn him of Separatist movements to the detention level, a move that would cost him his life.\nGreen Leader, like his fellow clone troopers, was trained in combat and succeeded to becoming the leader of Green Company.\nWhile he was a clone trooper officer, Green Leader wore a set of standard phase I clone trooper armor with the green markings of Green Company, and did not have any personalization or additional equipment. During combat, Green Leader utilized a DC-15A blaster carbine.\n\"Green Leader\" first appeared in the ninth episode of the first season of the animated TV series Star Wars: The Clone Wars, \"Cloak of Darkness.\" Like all clone troopers in the show, he was voiced by Dee Bradley Baker.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Green_Leader_(clone_trooper)",
  "/wiki/Green_Leader_(clone_trooper)/Legends",
  "/wiki/Green_Leader",
  "/wiki/Commander",
  "/wiki/Green_Squadron_(Rebel_Alliance)",
  "/wiki/Kamino",
  "/wiki/21_BBY",
  "/wiki/Tranquility",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Green_Company",
  "/wiki/File:GreenLeaderToCmdrGree-CoD.ogg",
  "/wiki/Callsign",
  "/wiki/Clone_trooper",
  "/wiki/Squad",
  "/wiki/Trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/41st_Elite_Corps",
  "/wiki/Clone_Wars",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Rescue_on_the_Tranquility",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Nute_Gunray",
  "/wiki/Trade_Federation",
  "/wiki/Death",
  "/wiki/Hangar",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Droch-class_boarding_ship",
  "/wiki/File:WeNeedReinforcements-CoD.ogg",
  "/wiki/File:Tranquility2.png",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Commanding_officer",
  "/wiki/Call_sign",
  "/wiki/Color",
  "/wiki/Time",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Mission_to_Rodia",
  "/wiki/Rodia",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Viceroy",
  "/wiki/Flagship",
  "/wiki/Coruscant",
  "/wiki/Jedi_General",
  "/wiki/Luminara_Unduli",
  "/wiki/Jedi_Commander",
  "/wiki/Ahsoka_Tano",
  "/wiki/Starship",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Clone_Commander",
  "/wiki/CC-1004",
  "/wiki/Company",
  "/wiki/Droid",
  "/wiki/Battle_droid",
  "/wiki/Blaster",
  "/wiki/Asajj_Ventress",
  "/wiki/Senate_Guard",
  "/wiki/Faro_Argyus",
  "/wiki/File:TCW_Green_Leader_spotted.png",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clone_trooper_officer",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Jedi_Crash",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Category:Audio_files_of_Green_Leader",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Standard_year",
  "/wiki/StarWars.com"
 ]
}