{
 "name": "Grefnakk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gamorrean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Maldor Ring"
     ]
    }
   ]
  }
 ],
 "content": "Grefnakk was a Gamorrean bounty hunter who was active during the Galactic Civil War.\nGrefnakk was a Gamorrean sold by his own clan to slavers of the Maldor Ring. As a slave for the Ring, he functioned as a common thug, working in the area around the planet Ryloth. When a rival group of slavers attacked the Maldor Ring, Grefnakk saved the life of the second-in-command, though their leader was killed. The being he saved was appreciative, and rewarded Grefnakk with his freedom.\nGrefnakk then became a bounty hunter, and over the course of four years, racked up a highly impressive capture list of seventy-four bounties.\nGrefnakk was like most Gamorreans, being crude, brutish, and thick-headed. Nothing made him happier than cracking other beings' skulls, and preferred brawling to what he thought of as \"puny\" blasters. Overall, Grefnakk was simply a bully, and enjoyed it.\nHe was willing to work with smarter bounty hunters in order to function as their brawn, but was more than happy to work alone. Grefnakk would purposefully take on high-risk bounties in anticipation of a greater reward. He would overlook the Gamorrean tradition of contact by combat, believing that he'd be allowed to fight soon enough by undertaking their contract. In the end, Grefnakk was only loyal to himself.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Maldor_Ring",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Clan",
  "/wiki/Slavery/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Galaxy_Guide_10:_Bounty_Hunters",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}