{
 "name": "Gregor",
 "display_name": "Gregor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Born",
     "values": [
      "32 BBY",
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Lothal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Foxtrot Group",
      "D-Squad",
      "Foxtrot Group",
      "D-Squad",
      "Power Sliders",
      "Galactic Empire",
      "Imperial Army",
      "Imperial Special Forces",
      "Imperial Army",
      "Imperial Special Forces"
     ]
    }
   ]
  }
 ],
 "content": "Gregor, formerly designated CC-5576-39 but shortened to CC-5576, served as a clone trooper captain in the Grand Army of the Republic's Special Operations Brigade. For the Battle of Sarrish, Gregor and his men were assigned to Foxtrot Group, an elite clone commando squad. The battle proved to be a great defeat for the Republic, and Gregor was forced to retreat into space. His transport ended up crash landing on Abafar. The crash caused him to suffer from amnesia, and he was rescued by a Sullustan named Borkus who took advantage of his condition to put him to work as a dishwasher in his business. Gregor regained his memories after Colonel Meebur Gascon and his unit identified him after their chance arrival in Pons Ora. He was thought to have been killed in an explosion trying to protect the colonel and his companions in a firefight against Separatist droids, but survived, although he sustained a traumatic brain injury.\nAfter the Clone Wars ended, Gregor was sent by the new Galactic Empire to a secret facility on the planet Daro, where he and other clone commandos were tasked with training the \"TK troopers\" which were to replace the clones. Gregor quickly realized he wanted out and sent a distress signal to the clone deserter Rex, who was unable to come himself but sent the Bad Batch, another group of deserters, to rescue him.\nFifteen years after the end of the Clone Wars, Gregor was still alive and was living in a modified AT-TE on Seelos with Captain Rex and Commander Wolffe. In 0 BBY, Gregor participated in the Liberation of Lothal, where the Lothal resistance group and the Spectres drove the Galactic Empire off Lothal once and for all. During the conflict, Gregor was killed, passing away after telling Rex that it was an honor to serve with him and to fight for a cause the clones actually chose to believe in.\nClone Captain Gregor was in command of Foxtrot Group, a squad of clone troopers that were part of the Special Operations Brigade. At one point, he befriended Clone Captain CT-7567 \"Rex.\" For the Battle of Sarrish, Gregor and his squad of clone commandos were assigned to the 212th Attack Battalion. Gregor and his men participated in the chaotic battle that ended in a disastrous Republic defeat. After covering the retreat of his allies, Gregor was reported as missing in action after the battle and was considered to be dead. Despite his efforts, the rest of Gregor's squad perished in the battle.\nHowever, Gregor had survived the battle. His escape shuttle crashing on the planet Abafar in the town of Pons Ora, although he had not escaped unscathed. Gregor suffered from amnesia after a traumatic brain injury and, unable to remember that he was a soldier of the Republic Army, sought work and was given a job working as a dishwasher and cleaner at the Power Sliders diner by the Sullustan Borkus for nothing more than room and board. He worked at the diner for some time and, due to his amnesia, never realized who he was. Borkus claimed his armor, weapons, and other gear and kept it, never telling Gregor who he was.\nAfter Colonel Meebur Gascon and his team of droids crash-landed on Abafar as they attempted to return to Republic lines after a mission, they eventually made their way into the town. As Gascon attempted to find food, he ran into Gregor behind the diner. Gregor offered him food but was confused when Gascon attempted to tell him that he was a clone. Gascon began to think that Gregor was working undercover, and a disoriented Gregor left Gascon and later went home.\nLater, Gregor returned home from work and was greeted by a hologram of his old friend Rex. Shocked, Gregor listened as Gascon explained who he was. When R2-D2 scanned Gregor's arm to learn his designation, CC-5576-39, Gascon read through Gregor's report, which listed him as missing in action. Gregor began to remember who he was, recalling the wounded and dying clones from the battle. Gascon convinced Gregor to search for his gear and help them leave the planet and complete their mission.\nGregor and his new companions broke into the diner to search for Gregor's equipment, but Borkus arrived with Gregor's gear in a large crate. When Gregor angrily accused Borkus of lying to him, Borkus pointed Gregor's own blaster at him. Gregor tried to reclaim it and clumsily lunged, still not functioning to his abilities as a clone commando. Borkus easily knocked him down, but was overpowered by the droids of D-Squad. Gregor then donned his gear and prepared to help D-Squad storm the landing pad at the Separatist Rhydonium mining installation.\nGregor fired on the hordes of battle droids, clearing a path for his allies but leaving himself surrounded. As hostile forces closed in, Gregor advised Gascon and his forces take off, leaving him facing near-certain death. Gascon reluctantly agreed and departed as Gregor promised that he would make his way home. Gregor seemingly sacrificed himself after shooting containers of rhydonium to destroy the droids that would have shot down Gascon's fleeing shuttle. However, Gregor survived the explosion, albeit with several intense head injuries, eventually making his way back to the Republic and his comrades.\nIn 19 BBY, the Clone Wars ended with the reorganization of the Galactic Republic into the Galactic Empire. Gregor however did not carry out Order 66. Meanwhile, the new government had plans to phase out the clones and create a new army composed of recruits. As part of Project War-Mantle, a secret base was constructed on the Outer Rim planet Daro where the new \"TK troopers\" were to be trained. Fifty clone commandos, including Gregor, were dispatched to the base as trainers. However, Gregor quickly realized that he did not want to be a part of the new Empire. He escaped the base, but was hunted. He managed to plant a rescue beacon before being recaptured and imprisoned. The beacon sent a distress signal to Captain Rex, who had also deserted from the military when he declined to obey Order 66. Unable to go himself, Rex asked the Bad Batch, a group of fellow deserters, to carry out the rescue.\nGregor was in his cell on Cellblock 25 when he demanded that the trooper on guard duty be useful and bring him some food. The trooper retorted that he was a traitor, and Gregor snapped back that it was \"Captain Traitor\" as the trooper walked away, before muttering that the recruit was an \"Insubordinate pleb.\" Soon after that, the guards were neutralized by Hunter, Echo, and Tech as the Bad Batch approached Gregor's cell to set him free. Echo asked Gregor if he was CC-5576, and Gregor said it depended on who was asking. Tech said that Rex had sent them, and Gregor stood up and told them his name, saying they had to move out. As Hunter, Echo, Tech, and Gregor were making a swift escape from the base, Gregor took a hard shot to the chest by Scorch but survived and was evacuated from Daro at the cost of Hunter's capture and was left with information broker Cid on Ord Mantell. At some point his behavioral modification biochip was removed.\nIn the years after the Galactic Empire's creation, Gregor was living with Captain Rex and Commander Wolffe, who had also removed their chips, in a modified AT-TE on the planet Seelos. Unfortunately, due to his two traumatic brain injuries, he suffered from episodes of mild insanity.\nFour years prior to the Battle of Yavin, the clones were approached by the crew of the Ghost, who were looking for information on abandoned military installations for the rebel network. When Kanan Jarrus identified them as clones, Wolffe, in turn, recognized him as a Jedi and let off a few shots. Gregor eagerly raised his rifle but Rex calmed the situation. When Ezra Bridger explained that they were sent by Ahsoka Tano, Rex welcomed them as friends. Later on, Gregor encouraged the Lasat Garazeb Orrelios to help the clones hunt for joopas. But he later reveals to Ezra that Zeb was in fact the bait, resulting in the Lasat being swallowed by the joopa, whom Gregor nicknamed Big Bongo. After managing to kill the joopa, Zeb was none too happy to learn that he was bait, but was calmed when Gregor pointed out that he helped catch Big Bongo.\nWhile settling down for dinner, Sabine discovered that one of the clones, Wolffe, had contacted the Empire. While Gregor and Rex had grown to trust the Ghost crew, Wolffe wanted to protect his comrades from being persecuted by the Empire for harboring these rebels. When confronted, Wolffe admitted his wrongdoing and accepted Rex's reasoning that the rebels were their friends. After discovering and destroying an Imperial probe droid, the clones and rebels prepared for the impending Imperial assault. While Kanan tried to convince the clones to come with them, Rex was adamant that he and his comrades would stay behind to hold the Imperials back while the rebels escaped.\nThe rebels reluctantly departed on their auxiliary ship Phantom to rendezvous with the Ghost in space. Shortly later, a force of three AT-AT walkers led by the Imperial Security Bureau Agent Kallus, a perennial foe of the crew of the Ghost. While outnumbered and outgunned, Gregor and his companions faced off against the Imperials in their lone AT-TE walker. At Ezra's urging, the rebels returned to rescue the clones and succeeded in defeating the Imperial force, forcing Kallus and his men to flee into the desert. After that, Gregor and his fellow clones saluted Kanan and his Padawan, and Rex agreed to join the Rebellion whilst Gregor and Wolffe stayed behind on Seelos, taking the remaining AT-AT walker for their new home.\nIn 0 BBY, Gregor and Wolffe were still living in the repurposed AT-AT walker, which had been christened Joopa Base. Gregor and Wollfe's modifications included a landing platform on top of their walker. Prior to the Liberation of Lothal, Hera along with Rex and the former ISB Agent Alexsandr Kallus traveled to Seelos to convince Gregor and Wolffe to help Ezra liberate his homeworld from the Empire. Gregor and Wolffe were joined by the Weequay pirate Hondo Ohnaka, the Ugnaught Melch, and the Mandalorian bounty hunter Ketsu Onyo.\nDespite the small chance of success, Gregor and the others agreed to help Ezra liberate Lothal. After traveling through the Imperial blockade, Gregor along with Rex, Wolffe, and Kallus helped the Spectres and Ryder Azadi's Lothal resistance group to defeat Governor Arihnda Pryce's forces at the Lothal cliff dwelling.\nFollowing the capture of Governor Pryce, Gregor, Rex, and Wolffe took part in the assault on the \"Dome,\" the Imperial headquarters on Lothal and a mobile Imperial Planetary Occupation Facility. For the operation, the rebels traveled in two captured patrol transports. Using an unwilling Pryce, the rebels gained landing rights for the executive landing pad at the Dome. After a brief battle, the rebels managed to capture the command center and initiate a faux Protocol 13, causing the entire Imperial garrison on Lothal to evacuate aboard the Dome.\nBefore they could fire up the Dome's thrusters, Grand Admiral Thrawn returned aboard his Imperial Star Destroyer Chimaera and blocked their exit. Thrawn managed to force Ezra to meet him aboard the Chimaera by bombarding Lothal's Capital City. In Ezra's absence, the rebels embarked on Sabine's plan to recapture the power terminals powering up the Dome's deflector shield generator in order to protect Capital City from Imperial bombardment.\nGregor along with Zeb and Kallus were assigned to Team B, which was tasked with recapturing and restarting the south tower's power terminal. Despite fierce resistance, Team B managed to reach the south tower. There, they were attacked by Thrawn's Noghri assassin Rukh and several death troopers. While Zeb fought Rukh, Gregor and Kallus dealt with the others. During the battle, Gregor was shot in the right side of the chest by an Imperial weapons technician. Despite being mortally wounded, Gregor hurled the Imperial into the depths of the reactor chamber. He then told Kallus to get the shields back up. After reuniting with Rex, who had helped restore the north tower's power terminal, Gregor told Rex it was an honor to serve alongside him, saying that he was grateful to have died fighting for something that he chose to believe in before passing away. Rex stayed by his side until the end before returning to the fight. The rebels went on to liberate Lothal from Imperial rule at the end after the purrgil attached themselves to Thrawn's Star Destroyers and dragged them into hyperspace.\nAs a clone commando, Gregor was trained in combat and could operate a blaster. Despite suffering a brief spell of amnesia, Gregor was loyal to the Galactic Republic and willing to put his life on the line for it. Since Gregor removed his control chip, he was unaffected by the transmission of Order 66. Due to the brain damage he had sustained during the Clone Wars, Gregor experienced occasional periods of insanity during the Age of the Empire. When recruited by the Empire in training new recruits, Gregor was loyal to the Empire until he realized their ways was not what he signed up for and decided to defect from the Empire. Even when he was deemed a traitor by the Empire, Gregor openly remarked how proud he was for choosing to defect from the Empire.\nUnlike Wolffe, Gregor, along with Rex, was not hostile towards Kanan Jarrus and his rebel cell, the Spectres. He befriended Ezra Bridger and particularly Garazeb Orrelios, and convinced the rebels to accompany him on a hunt for joopas in return for Rex supplying them with information on former Republic military installations. Gregor and Wolffe were loyal to Rex and looked up to him as their leader, and they were willing to fight to the death in order to protect their new-found rebel friends from Imperial forces led by Agent Kallus. Gregor, Rex and Wolffe soon came to respect Kanan and Ezra after the rebels came to their aid and drove off Kallus' forces.\nWhile Gregor thought that Ezra's plan to liberate Lothal had a slim chance of success, his loyalty to Rex and Ezra led him to volunteer for the mission. Gregor was a competent fighter and soldier who was able to fight as part of a team. Before he died during the liberation of Lothal, Gregor stated to Rex that it was an honor to fight with him, and for what they chose to believe in.\nGregor was a human male who stood 1.83 meters tall, or 6 feet. He had black hair, brown eyes, and tan skin.\nWhile in service to the Grand Army of the Republic, Gregor wore Katarn-class Commando Armor with yellow markings and a grayish camouflage printing. He kept a tally of defeated droids on his helmet. His weapon of choice was the DC-17m Interchangeable Weapon System.\nGregor first appeared in \"Missing in Action,\" an episode of the fifth season of the Star Wars: The Clone Wars television series. A preview clip featuring Gregor was later shown at Celebration VI. He is voiced by Dee Bradley Baker. A trailer for the show's fifth season includes Aurebesh on Gregor's profile notes indicating that he went missing in action during the Battle of Sarrish.\nDuring the episode, a hologram showing Gregor's military records was displayed in Aurebesh after R2-D2 scanned his identifying code. As well as displaying Gregor's status as MIA during the Battle of Sarrish, it displayed \"Captain,\" \"212 Attack Battalion,\" and \"Foxtrot Group,\" as well as Gregor's height and weight. The designation of Captain contradicts Colonel Gascon stating that Gregor was a captain, despite the fact that Gascon was going off of the hologram.\nThe markings on Gregor's helmet were inspired by the hash-marks that Boston Bruins goaltender Gerry Cheevers stenciled on his mask to denote the stitches he would get had he not been wearing protective gear.\nBaker later reprised his role as Gregor in the second season of the Disney XD animated television series Star Wars Rebels; appearing in the episodes \"The Lost Commanders\" and \"Relics of the Old Republic,\" which premiered on October 8, 2015 at the 2015 New York Comic Con. He was erroneously referred to as a Clone Commander in the former episode. Three years later, Baker reprised his role as Gregor once more in the final Rebels episodes \"A Fool's Hope\" and \"Family Reunion – and Farewell,\" which premiered on March 5, 2018 on Disney XD.\nDuring development of the Star Wars Adventures: The Clone Wars – Battle Tales comic book series, Michael Moreci wanted to have Gregor make an appearance, but he was denied to do so.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gregor",
  "/wiki/CC-5576-39",
  "/wiki/Gregor_(disambiguation)",
  "/wiki/War-Mantle",
  "/wiki/Return_to_Kamino",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_73",
  "/wiki/Droid_Directory",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Gregor",
  "/wiki/Kamino",
  "/wiki/32_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/0_BBY",
  "/wiki/Lothal",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Foxtrot_Group",
  "/wiki/D-Squad",
  "/wiki/Power_Sliders",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/Imperial_Special_Forces",
  "/wiki/Clone_trooper",
  "/wiki/Clone_Captain",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Special_Operations_Brigade",
  "/wiki/Battle_of_Sarrish",
  "/wiki/Clone_commando",
  "/wiki/Squad",
  "/wiki/Abafar",
  "/wiki/Amnesia",
  "/wiki/Sullustan",
  "/wiki/Borkus",
  "/wiki/Dishwasher",
  "/wiki/Colonel",
  "/wiki/Meebur_Gascon",
  "/wiki/Pons_Ora",
  "/wiki/Escape_from_Abafar",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Battle_droid",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Imperial_Base_on_Daro",
  "/wiki/Planet",
  "/wiki/Daro",
  "/wiki/Project_War-Mantle",
  "/wiki/Stormtrooper",
  "/wiki/Distress_signal",
  "/wiki/Rex",
  "/wiki/Clone_Force_99",
  "/wiki/Extraction_on_Daro",
  "/wiki/Standard_year",
  "/wiki/All_Terrain_Tactical_Enforcer",
  "/wiki/Seelos",
  "/wiki/Captain",
  "/wiki/Commander",
  "/wiki/Wolffe",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Lothal_resistance_group",
  "/wiki/Spectres",
  "/wiki/212th_Attack_Battalion",
  "/wiki/Death",
  "/wiki/Shuttle",
  "/wiki/Restaurant",
  "/wiki/Armor",
  "/wiki/Droid",
  "/wiki/Mission_to_steal_a_Separatist_encryption_module",
  "/wiki/Hologram",
  "/wiki/R2-D2",
  "/wiki/DC-17m_Interchangeable_Weapon_System",
  "/wiki/Rhydonium_mining_installation",
  "/wiki/Rhydonium",
  "/wiki/19_BBY",
  "/wiki/Order_66",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Cellblock_25",
  "/wiki/Hunter",
  "/wiki/Echo",
  "/wiki/Tech",
  "/wiki/RC-1262",
  "/wiki/Cid",
  "/wiki/Ord_Mantell",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Battle_of_Yavin",
  "/wiki/Ghost",
  "/wiki/Kanan_Jarrus",
  "/wiki/Ezra_Bridger",
  "/wiki/Ahsoka_Tano",
  "/wiki/Lasat",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Joopa",
  "/wiki/Big_Bongo",
  "/wiki/Probe_droid",
  "/wiki/Phantom",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Assault_on_Seelos",
  "/wiki/Loth-wolf",
  "/wiki/File:WolfPackBack-AFH.ogg",
  "/wiki/Joopa_Base",
  "/wiki/Weequay",
  "/wiki/Pirate",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Ugnaught",
  "/wiki/Melch",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Ketsu_Onyo",
  "/wiki/Ryder_Azadi",
  "/wiki/Governor",
  "/wiki/Arihnda_Pryce",
  "/wiki/Lothal_cliff_dwelling",
  "/wiki/Imperial_Complex_(Lothal)",
  "/wiki/Imperial_Planetary_Occupation_Facility",
  "/wiki/LAAT/le_patrol_gunship",
  "/wiki/Protocol_13",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Chimaera",
  "/wiki/Capital_City",
  "/wiki/Deflector_shield_generator",
  "/wiki/Noghri",
  "/wiki/Assassin",
  "/wiki/Rukh",
  "/wiki/Death_trooper",
  "/wiki/Imperial_weapons_technician",
  "/wiki/Purrgil",
  "/wiki/Hyperspace",
  "/wiki/Blaster",
  "/wiki/Imperial_Era",
  "/wiki/Katarn-class_Commando_Armor",
  "/wiki/Missing_in_Action",
  "/wiki/The_Clone_Wars:_Season_Five",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Celebration_VI",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Aurebesh",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/Disney_XD",
  "/wiki/Star_Wars_Rebels",
  "/wiki/The_Lost_Commanders",
  "/wiki/Relics_of_the_Old_Republic",
  "/wiki/October_8",
  "/wiki/2015",
  "/wiki/Clone_Commander",
  "/wiki/A_Fool%27s_Hope",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/March_5",
  "/wiki/2018",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Michael_Moreci",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Category:Audio_files_of_Gregor",
  "/wiki/Category:Images_of_Gregor",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels:_Visual_Guide:_Epic_Battles",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_13",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_16",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Star_Wars_Insider",
  "/wiki/Clone_Tales",
  "/wiki/Star_Wars_Insider_187",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Unsung_Heroes",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/StarWarsKids.com",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Aftermath_(episode)",
  "/wiki/Victory_and_Death"
 ]
}