{
 "name": "Gregg",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Gregg was a Human male who served as a Lieutenant in the Imperial Navy. He acted as Darth Vader's right-hand man during the early months of the Galactic Empire.\nIn 19 BBY, Gregg, along with the Sith Lord Darth Vader, was stationed aboard an Imperial I-class Star Destroyer, which was orbiting the planet Prine. Vader was tracking Jedi fugitive Dass Jennir, and a starship matching Jennir's was transmitting a signal from the planet's surface. After reporting that a ship involved in a recent break-in at Imperial Prison ISO-L8 was also detected, Gregg joined Vader and the two departed to the planet's surface. There, they captured the prison's intruder, bounty hunter Falco Sang.\nDuring the construction of the Imperial Palace in the aftermath of the Gentis coup, Gregg attempted to get Vader to listen to a plan of his, to which Vader had him walk with him to see Falco Sang's training. He, after giving his report on the progress of Sang's training, was then ordered to replace the droid's weaponry with live ammunition and supply orders to wound Sang only, and told him that he'll personally visit the training facility to give Sang more motivation.\nThe next day, upon Vader's arrival, they acknowledged each others presence and proceeded to enter the facility. Gregg then smirked as he witnessed Vader telekinetically lifting an irate and disabled Sang and throwing him against a wall after Sang accused Vader of trying to have him killed. After the Tenacious disobeyed prior orders and left for Arkinnea, Gregg attempted to report this suspicious action to Vader, though Vader rebuked him, as it didn't supply any apparent, immediate relation to Jedi hunting.\nGregg, after one of Sang's escape attempts, had the containment facility redesigned to have its doors voice-coded and dead-locked, so that in the event Sang tried to kill him, he won't be able to escape the prison. He then tried to request that Sang try to work with Vader regarding \" Dass Jennir's head,\" and inferred that Sang try to impress Vader by attacking him. He then revealed that they had delivered Sang's ship to the facility, and witnessed Sang's attempt to fight Vader to impress him. Later, while working late, Gregg was contacted by Emperor Palpatine himself. Glad that Gregg was still at his station, he told the lieutenant to supply vital information regarding Jennir's likely location, although he also swore to him, like before, not to reveal that he and Palpatine spoke. He then rushed to Vader's location only to stumble on Vader just getting out of his Qaddrath and informed him of Jennir's location at the Colonies world of Kestavel. Before he could finish, Vader ordered him to have Captain Gillehspy prepare the Hound to depart within the hour. Gregg complied with the order, but nonetheless was shocked that Vader planned on taking a Venator-class Star Destroyer over to the planet. He later accompanied Vader to Kestavel, where the latter attempted to attack The Lucky Twi'lek hotel. However, the mission met complications upon learning that the hotel released engine fuel over the bridge, although Gregg pointed his blaster to his fellow officer's head and told him to not aid Vader, as the latter ordered that none were to interfere in his mission, not even to aid him. He then believed Vader to have been killed when he saw an immense blaze at the area via his electrobinoculars.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Prine",
  "/wiki/Jedi/Legends",
  "/wiki/Dass_Jennir",
  "/wiki/Dezono_Qua%27s_starship",
  "/wiki/Falco_Sang%27s_starship",
  "/wiki/Imperial_Prison_ISO-L8",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Falco_Sang",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/Ghost_Prison_incident",
  "/wiki/Tenacious_(Venator-class)",
  "/wiki/Arkinnea",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Colonies/Legends",
  "/wiki/Kestavel",
  "/wiki/Captain/Legends",
  "/wiki/Gillehspy",
  "/wiki/Hound_(Star_Destroyer)",
  "/wiki/The_Lucky_Twi%27lek",
  "/wiki/Electrobinoculars/Legends",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_3",
  "/wiki/Dark_Times%E2%80%94Out_of_the_Wilderness_5",
  "/wiki/Star_Wars:_Dark_Times%E2%80%94Fire_Carrier",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_1",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_2",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_3",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_4",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_5"
 ]
}