{
 "name": "Gregor_Willsaam",
 "display_name": "Gregor Willsaam",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "House of Organa"
     ]
    }
   ]
  }
 ],
 "content": "Gregor Willsaam was a male Human who was the husband of Parvin Willsaam and the father of Jaesa Willsaam.\nDuring the Great Galactic War, Gregor lived with his wife and his daughter as a faithful servant to the House of Organa. A few years after the Treaty of Coruscant, Gregor's daughter was revealed to be force-sensitive and was elected by Jedi Master Nomen Karr to serve as his apprentice of the Jedi Order. His daughter was very valuable to the Jedi Order due to her unique ability to recognize the true nature of every person. However, Gregor and his wife hoped that their daughter would be married to the House Organa, so they could be free from being mere servants.\nDuring the Cold War, Sith Lord Darth Baras, whose espionage network was threatened by Jaesa, sent his apprentice to eliminate Jaesa's parents in order to lure Jaesa out of hiding. The apprentice followed various clues and followed them to Gesselle Organa's castle, Gregor and Parvin the parents were under the protection of the Jedi Master Volryder.\nWhen Volryder prepared to engage the Sith Warrior, Gregor, despite the objections of the Jedi, wanted to find out the reason for this intrusion. The apprentice only needed the Willsaams in order to send a message to Jaesa. Gregor pleaded the Sith Warrior to spare him and his wife, but the apprentice killed them anyway.\nThe Sith Warrior has two options. In the light side option, he/she would convince the parents to join the Empire and spare them, and letting Volryder leave; that way, if the Sith Warrior would tell Darth Baras of their sending the parents to him, the option of torture or letting them bask in Imperial luxury would tip Jaesa off-balance. In the dark side option, the Warrior kills them and faces Volryder. If the pair are spared, the Warrior will receive a piece of mail from Gregor revealing that they have safely arrived on Dromund Kaas, however, Darth Baras found out about them regardless if the player choose to tell him or not, with it being implied he later tortures them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/3643_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Parvin_Willsaam",
  "/wiki/Jaesa_Willsaam",
  "/wiki/Great_Galactic_War",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Nomen_Karr",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Gesselle_Organa",
  "/wiki/Volryder",
  "/wiki/Sith_Warrior",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}