{
 "name": "Gregar_Typho",
 "display_name": "Gregar Typho",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.85 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo",
      "Royal Naboo Security Forces",
      "Royal Naboo Security Forces",
      "Galactic Republic",
      "Amidalans"
     ]
    }
   ]
  }
 ],
 "content": "Gregar Typho was a human male Naboo and a captain of the Royal Naboo Security Forces for Senator Padmé Amidala during the Separatist Crisis and the Clone Wars, ensuring the senator's safety at all costs. Typho followed in the footsteps of his uncle, Quarsh Panaka, who was a Naboo Royal Security Forces captain during the Invasion of Naboo and his aunt, Mariek Panaka, who also served as a captain in the Security Forces.\nIn the last days of the Clone Wars, Amidala decided to travel to the planet Mustafar to face Darth Vader. However, Typho tried to persuade her that he must go with her, to no avail, as Amidala informed him that C-3PO would look after her.\nBy the time of the Galactic Civil War, Typho had become part of the Amidalans, a resistance group desired to hunt down and kill those responsible for Amidala's mysterious death.\nGregar Typho was the nephew of Captain Quarsh Panaka and his wife Mariek Panaka. His uncle served the Royal Naboo Security Forces. Typho had at least another relative, a cousin named Versaat.\nAt some point, Gregar Typho undertook security forces training alongside Dorra, who stayed in the Academy to go through a modified version of handmaiden training.\nDuring the Invasion of Naboo, Gregar was taken into custody by the Trade Federation and held at camp three alongside Naboo citizens who had been incarcerated within the campus dormitories of Gallo Mountain University. Typho went out of his way to protect his family whilst ensuring that food would be provided to the children within the camp. Upon finding a working transmitter, Typho assigned shifts to retain communications with the outside. While taking his turn during one of those shifts, he received word that the Queen of Naboo had arrived, opening the doorway for effective resistance to the Trade Federation. Gregar then began preparations for the oncoming fight. In the following ensuing battle to retake the planet, he lost his left eye.\nAfter Padmé Amidala's term as queen of Naboo ended and she accepted the role of representing Naboo in the Galactic Senate, Typho immediately recommended Dorra as a potential new handmaiden.\nDuring the Separatist Crisis, Captain Typho accompanied Amidala on a diplomatic mission to the galactic capital Coruscant to vote against the upcoming Military Creation Act. A growing Separatist movement led by the charismatic former Jedi Count Dooku was challenging the ailing Galactic Republic. In response, loyalist elements led by Supreme Chancellor Sheev Palpatine had introduced legislation to create a Grand Army of the Republic.\nDue to Amidala's high profile, the Senator and Captain Typho had traveled to Coruscant disguised as starfighter pilots. Due to his grim duty, Typho enlisted Cordé, one of Amidala's handmaidens, to pose as Amidala and travel on her diplomatic barge. This ruse enabled Amidala to escape an assassination attempt which claimed the life of her decoy and several members of her entourage. While Amidala was grieving over the fallen Cordé, Typho comforted her by assuring Amidala that the handmaiden had died in the line of duty.\nLater, Typho went to Amidala's apartment on Coruscant to establish security there. The Senator's security detail was further augmented by two Jedi: the Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker, who had a crush on Amidala. That night, as Typho and his men guarded downstairs, a second assassination attempt against Amidala by the Clawdite assassin Zam Wesell involving two poisonous kouhuns was foiled by Skywalker and Kenobi. As a result, Amidala returned to Naboo accompanied by Skywalker. Following these events, Typho remained on Coruscant to protect the Gungan Representative Jar Jar Binks, who took Amidala's place on the Senate. Binks sponsored the creation of the Grand Army, which foreshadowed the outbreak of the Clone Wars.\nCaptain Typho and his men shot down and captured three B1-series battle droids and a T-series tactical droid. In response, the reigning Queen Neeyutnee summoned Senator Amidala and Representative Jar Jar Binks back to Naboo to request for military assistance from the Galactic Republic. Captain Typho was present when Amidala, Binks, and C-3PO interrogated the captured tactical droid. Tricking the droid into thinking that it was on a Separatist warship, C-3PO managed to glean that there was a secret Separatist research installation on Naboo, producing a virus.\nWhen the tactical droid realized that it was not on a Separatist warship, Typho raised a blaster at the droid and demanded that it cooperate. Before he could proceed, Binks accidentally destroyed the droid by knocking over some shelves while trying to catch a slug-beetle. Despite this setback, Amidala and Binks deduced that the droid came from Naboo's Eastern swamps due to the presence of mud on its chassis and the slug-beetle, which Binks recognized as originating from those swamps. While Amidala and company traveled to the Eastern Swamps to investigate, Captain Typho and Threepio remained behind to examine the other battle droids.\nWhile examining a B1 battle droid's head, Typho and C-3PO discovered a hologram of a Separatist scientist named Doctor Nuvo Vindi and quickly relayed this information to Amidala. Meanwhile, Amidala and her companions discovered Dr. Vindi's laboratory in the Eastern Swamps. Vindi was developing a deadly bioweapon called the Blue Shadow Virus for use by the Separatists.\nFollowing a dangerous struggle, Amidala and her companions with the help of the Jedi Kenobi, Skywalker, his Padawan Ahsoka Tano and several clone troopers managed to apprehend Vindi and stop him from releasing an airborne strain of the virus. Despite being exposed to the Blue Shadow Virus, Amidala and Binks survived due to Skywalker and Kenobi's efforts to obtain an antidote, the root of a reeksa plant from the planet Iego.\nLater in the Clone Wars, Typho accompanied Amidala to Alderaan for an Alderaan Refugee Conference hosted by Senator Bail Organa of Alderaan, which is to address the increasing humanitarian problem of the war refugees. However, after assassin Aurra Sing's first attempt on Amidala, Typho began to closely watch and keep an eye on the assassin to prevent her from killing Amidala. He and Organa then went to her quarters to stop Sing, only to be unable to open the door. After they managed to get the door open, Typho picked Sing up and arrested her after she had been stunned by Amidala. They then took Sing back to Coruscant to be arrested.\nShortly after, Amidala was back on Coruscant. Typho and his guards went with Amidala to show their support of Senator Riyo Chuchi after the Trade Federation blockaded her homeworld.\nAfter a fight between Jedi Knight Anakin Skywalker and Senator Rush Clovis, Typho came into Amidala's room and asked what happened, to which Clovis tells him that they were attacked and Skywalker saved him. Typho then informed them that a 2-1B-series medical droid was on its way. His royal guards then helped carry Clovis to a bedroom.\nIn the last days of the Clone Wars, the Jedi Temple was attacked and many Jedi were killed due to Order 66. Shortly after, Typho attended a meeting of the Senate where Palpatine declared the formation of the Galactic Empire and himself as the Galactic Emperor. Almost immediately after, Amidala was visited by Kenobi, who told her impacting news about her husband. After Kenobi departed, Amidala decided to travel to the planet Mustafar. However, Typho tried to persuade her that he must go with her, to no avail, as Amidala informed him that C-3PO would look after her. Typho reluctantly abated, believing Threepio could offer her adequate protection. This turned out to be the last time Typho saw Amidala alive, as she died after giving birth to her children two days later on Polis Massa.\nAfterward, following Quarsh being appointed as the Imperial Moff of the Chommell sector, Typho did not to join him for his first formal address to the people of Naboo. Sabé noticed as such. Typho would instead join the Amidalans resistance cell to investigate Amidala's death.\nCaptain of the Royal Naboo Security Forces, Gregar Typho was absolutely loyal to Padmé Amidala, the senator of his homeworld. Typho deeply cared for Amidala, expressing his concern over her safety when Amidala had to return to Naboo to stop risking her life at Naboo due the Separatists' attempt on her life. Unlike his uncle Quarsh Panaka, whom he succeeded in the security forces, Typho held the Jedi in high esteem, expressing his gratefulness to the Jedi Knight Obi-Wan Kenobi when Kenobi and Anakin Skywalker came to check Amidala on her apartment.\nGregar Typho was portrayed by Jay Laga'aia in both the 2002 film Star Wars: Episode II Attack of the Clones and the 2005 film Star Wars: Episode III Revenge of the Sith. He was voiced by James Mathis III in Star Wars: The Clone Wars TV series, which aired from 2008 to 2013.\nIn early storyboards of Attack of the Clones, Typho was originally intended to be gunned down by droidekas upon waving goodbye to Amidala. This idea, however, was dropped.\nIn E. K. Johnston's 2019 novel Queen's Shadow, Gregar Typho's first name is misspelled as \"Gregor.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gregar_Typho",
  "/wiki/Gregar_Typho/Legends",
  "/wiki/Template:Expand",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Hope",
  "/wiki/Darth_Vader_(2020)_3",
  "/wiki/Darth_Vader_(2020)_4",
  "/wiki/Darth_Vader_(2020)_5",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Naboo",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Royal_Naboo_Security_Forces",
  "/wiki/Galactic_Republic",
  "/wiki/Amidalans",
  "/wiki/File:Typho-NoDanger-AOTC.ogg",
  "/wiki/Captain",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Separatist_Crisis",
  "/wiki/Clone_Wars",
  "/wiki/Quarsh_Panaka",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Mariek_Panaka",
  "/wiki/Mustafar",
  "/wiki/Anakin_Skywalker",
  "/wiki/C-3PO",
  "/wiki/Time",
  "/wiki/Galactic_Civil_War",
  "/wiki/Death",
  "/wiki/Marriage",
  "/wiki/Vers%C3%A9",
  "/wiki/Dorm%C3%A9",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Trade_Federation",
  "/wiki/Camp_three",
  "/wiki/Gallo_Mountain_University",
  "/wiki/Battle_of_Naboo",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Galactic_Senate",
  "/wiki/The_galaxy",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Military_Creation_Act",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Jedi",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Loyalist_Committee",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Cord%C3%A9",
  "/wiki/J-type_diplomatic_barge",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Padawan",
  "/wiki/Clawdite",
  "/wiki/Zam_Wesell",
  "/wiki/Kouhun",
  "/wiki/Gungan",
  "/wiki/Jar_Jar_Binks",
  "/wiki/B1-series_battle_droid",
  "/wiki/T-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/Queen",
  "/wiki/Neeyutnee",
  "/wiki/Slug-beetle",
  "/wiki/Eastern_swamps",
  "/wiki/Hologram",
  "/wiki/Scientist",
  "/wiki/Doctor",
  "/wiki/Nuvo_Vindi",
  "/wiki/Trade_Federation_laboratory",
  "/wiki/Blue_Shadow_Virus",
  "/wiki/Ahsoka_Tano",
  "/wiki/Clone_trooper",
  "/wiki/Reeksa",
  "/wiki/Iego",
  "/wiki/Alderaan_Refugee_Conference",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Aurra_Sing",
  "/wiki/Riyo_Chuchi",
  "/wiki/Rush_Clovis",
  "/wiki/2-1B-series_medical_droid",
  "/wiki/Imperial_Palace",
  "/wiki/Siege_of_the_Jedi_Temple",
  "/wiki/Order_66",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Galactic_Emperor",
  "/wiki/Reproduction",
  "/wiki/Luke_Skywalker",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Polis_Massa",
  "/wiki/Chommell_sector",
  "/wiki/Jay_Laga%27aia",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/James_Mathis_III",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/2008",
  "/wiki/2013",
  "/wiki/Droideka",
  "/wiki/E._K._Johnston",
  "/wiki/2019",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/Blue_Shadow_Virus_(episode)",
  "/wiki/Mystery_of_a_Thousand_Moons",
  "/wiki/Children_of_the_Force",
  "/wiki/Senate_Spy",
  "/wiki/Assassin_(episode)",
  "/wiki/Sphere_of_Influence",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volume_1",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volumes_1_%26_2",
  "/wiki/Senate_Murders",
  "/wiki/Crisis_on_Naboo",
  "/wiki/Star_Wars:_Forces_of_Destiny%E2%80%94Ahsoka_%26_Padm%C3%A9",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Gregar_Typho",
  "/wiki/Category:Images_of_Gregar_Typho",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_One",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_13",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_15",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Naboo_(Star_Wars_Encyclopedia)",
  "/wiki/Coruscant_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Inside_Intel:_Padm%C3%A9%27s_Real_Last_Name",
  "/wiki/Databank_(website)",
  "/wiki/Assassin",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/Star_Wars_Storyboards:_The_Prequel_Trilogy"
 ]
}