{
 "name": "Grek_(commodore)",
 "display_name": "Grek  (commodore)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Fourth Division",
      "Fourth Division"
     ]
    }
   ]
  }
 ],
 "content": "Grek was a human male who served as a commander and later commodore in the navy of the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. Following the Battle of Hoth in 3 ABY, the Rebellion's fleet was divided in order to scatter their forces, and Grek was one of several commanding officers assigned to the Fourth Division. Their cell came under attack when Imperial commander Ellian Zahra broke the codes that the rebel cells were using to contact each other, but escaped thanks to the help of the rebels aboard the freighter Millennium Falcon.\nAs the Alliance Fleet was unable to regroup in the way they had intended, Commander Grek and Princess Leia Organa developed a new plan to find and reassemble the other cells. The plan involved the Fourth Division responding to the transmission of the Seventh Division, drawing some of Zahra's forces away. The forces of the Fourth Division subsequently traveled to the Seventh Divison's location, attacking the Imperial fleet.\nDuring the Galactic Civil War between the Rebel Alliance and the Galactic Empire, Grek held the rank of commander in the Alliance Fleet. After the Rebellion was forced to escape from the Battle of Hoth in 3 ABY they scattered the fleet to prevent the Empire from finding all their forces, and Grek was placed as a commanding officer of the Fourth Division, which was sent to regroup at Rendezvous Point Delta-Three in the Mid Rim.\nAs the Rebellion planned to have the separate fleets contact one another and slowly reassemble, Commander Grek and the Fourth Division contacted the Eighth Division. However, Commander Ellian Zahra of the Empire had developed a signal analysis protocol, which she used to break the rebel codes, learning the location of both fleets. Sending some of her forces to destroy the Eighth Division, Zahra led an attack on the Fourth Division. The Fourth Division was unable to escape, blocked by a star on one side and the Imperial blockade on the other.\nA number of rebel ships were lost, including the frigate Tyvarex, but the freighter Millennium Falcon arrived at the rendezvous point, carrying a number of rebel leaders, including Princess Leia Organa. The Falcon managed to incapacitate one of the Imperial light cruisers, making a hole in the blockade. Upon realizing this, Commander Grek ordered the surviving rebel forces to escape into hyperspace.\nThe Fourth Division arrived at Backup Rendezvous Point Gamma-Nine, where Commander Grek spoke with Organa. Grek revealed what had happened to the Eighth Division, and Organa deduced that the Imperials had broken their codes, and that they were unable to warn any other rebel cells.\nThough their situation seemed hopeless, the rebels did not give up hope. The commanding officers called a meeting, informing the personnel of the Fourth Division of the situation they were in. As they were unable to contact the other rebel fleets, Organa proposed that the forces of the Fourth Division solve the problem themselves. Commander Grek introduced a plan he called Operation Starlight, inspired by an ancient High Republic Era space station which had been constructed to help travelers navigate unexplored regions of the galaxy.\nAs Organa embarked on a mission to Cloud City alongside rebel Luke Skywalker and former Baron Administrator Lando Calrissian, work on Operation Starlight began. Organa and Calrissian later returned to the rebel fleet, while Skywalker followed a Force vision. The Fourth Division established a team tasked with bypassing Zahra's infiltration of their communications network, as well as Starlight Squadron. When Skywalker returned to the Fourth Division with a new lightsaber, Commander Grek was among the rebels present.\nWhile the Fourth Division were grouped in the Inner Rim, the rebels received a transmission from the Seventh Division. As the rebels had devised a plan that required them to be contacted, Commander Grek received confirmation from Organa in sending a response, despite warning from the protocol droid C-3PO. The Fourth Division replied, aware that Zahra would subsequently be able to locate their forces. However, before Zahra's secondary strike force reached their location, the Fourth Division's vessels escaped, heading to the coordinates of the Seventh. The Fourth Division emerged from hyperspace, trapping Zahra's fleet between themselves and the Seventh Division.\nIntent on personally killing Organa, Zahra boarded the frigate that both she and Grek were aboard during the battle. Grek was notified that their vessel had been boarded, sending teams to handle the intruders. However, Zahra defeated the rebels sent to stop her, making her way to the main reactor and disabling its safety controls. As alarms sounded, Grek insisted that a crew be sent to lock down the reactor immediately, but Zahra made contact with the ship's command, informing the rebels of the vessel's imminent destruction and her intention of targeting Organa. She informed the crew that if they wanted to survive, they would send Organa down to the reactor alone so she could face her. Organa agreed to the terms immediately, and despite Grek's objections, stated that her life was not worth the lives of the entire crew. Grek, knowing he could not persuade her to reconsider, wished her luck and allowed Organa to take his blaster to face Zahra. Sometime later, Grek was promoted to commodore.\nA human male, Grek had black hair, dark skin, and dark eyes. While it seemed as if there was no way that the Fourth Division could recover and help the rebel fleet rebuild without being able to contact the other cells, Commander Grek did not lose hope, inspired by the actions of travelers in the time of the High Republic. He accepted that their situation was problematic and that the task ahead would be difficult, but Grek believed that the forces of the Fourth Division would be able to succeed. When the Fourth Division's frigate was boarded during its second battle with Zahra's forces, Grek initially dismissed the chance of danger, questioning the boarding party's motives.\nFollowing the Battle of Hoth, Commander Grek wore a brown jacket over a white shirt and brown pants. He wore a blue rebel command insignia on the right side of his jacket, signifying his rank as commander. Grek later also wore a pair of black gloves and carried a blaster pistol in a holster on his hip.\nGrek first appeared, albeit unidentified, in the comic Star Wars  1, written by Charles Soule, illustrated by Jesús Saiz, and published by Marvel Comics on January 1, 2020. The character's name was given in the following issue, also written by Soule, illustrated by Saiz, and published on January 29, 2020.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Grek_(disambiguation)",
  "/wiki/Star_Wars_(2020)_8",
  "/wiki/Star_Wars:_Operation_Starlight",
  "/wiki/Star_Wars_(2020)_21",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Star_Wars_(2020)_23",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/Star_Wars_(2020)_28",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Fourth_Division",
  "/wiki/Commander",
  "/wiki/Commodore",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Hoth",
  "/wiki/3_ABY",
  "/wiki/Fleet",
  "/wiki/Commanding_officer",
  "/wiki/Battle_at_Rendezvous_Point_Delta-Three",
  "/wiki/Ellian_Zahra",
  "/wiki/Freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Operation_Starlight",
  "/wiki/Seventh_Division",
  "/wiki/Military_rank",
  "/wiki/Rendezvous_Point_Delta-Three",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Eighth_Division",
  "/wiki/Battle_near_Malastare",
  "/wiki/Unidentified_Mid_Rim_star",
  "/wiki/Blockade",
  "/wiki/Starship",
  "/wiki/Frigate",
  "/wiki/Tyvarex",
  "/wiki/Light_cruiser",
  "/wiki/Hyperspace",
  "/wiki/Backup_Rendezvous_Point_Gamma-Nine",
  "/wiki/High_Republic_Era",
  "/wiki/Starlight_Beacon",
  "/wiki/The_galaxy",
  "/wiki/Mission_to_Cloud_City",
  "/wiki/Cloud_City",
  "/wiki/Luke_Skywalker",
  "/wiki/Baron_Administrator",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Force_vision",
  "/wiki/Starlight_Squadron",
  "/wiki/Lightsaber",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Hunter_Fleet%27s_secondary_strike_force",
  "/wiki/Death",
  "/wiki/Reactor",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Jacket",
  "/wiki/Rebel_command_insignia",
  "/wiki/Glove",
  "/wiki/Blaster_pistol",
  "/wiki/Holster",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_(2020)_1",
  "/wiki/Charles_Soule",
  "/wiki/Jes%C3%BAs_Saiz",
  "/wiki/Marvel_Comics",
  "/wiki/January_1",
  "/wiki/2020",
  "/wiki/Star_Wars_(2020)_2",
  "/wiki/January_29",
  "/wiki/Category:Images_of_Grek",
  "/wiki/Star_Wars_(2020)_6",
  "/wiki/Star_Wars_(2020)_7",
  "/wiki/Star_Wars_(2020)_9",
  "/wiki/Star_Wars_(2020)_10",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/Star_Wars_(2020)_12",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Accessories_and_Structures",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_(2020)_3",
  "/wiki/Star_Wars_(2020)_4"
 ]
}