{
 "name": "Greldo_Farnor",
 "display_name": "Greldo Farnor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Belnar",
      "Alderaan"
     ]
    },
    {
     "name": "Born",
     "values": [
      "25 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Khil"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.4 meters"
     ]
    }
   ]
  }
 ],
 "content": "Greldo Farnor was a Khil from Belnar, working as a droid parts merchant on Alderaan. After the destruction of Alderaan, he became an anti-Galactic Empire terrorist and pirate.\nIn 0 BBY, while Farnor was off-planet on a business trip, his mate and his children were killed in the destruction of Alderaan. When he returned to find nothing but asteroids and rubble where his home once was, the enraged Khil embarked on a solitary crusade against the Galactic Empire.\nFarnor took to acts of piracy and terrorism, attacking unarmed freighters and scout vessels in Imperial space. He continued to seek violent revenge in Imperial space, even after the death of Galactic Emperor Palpatine at the Battle of Endor. By 7 ABY, he had even destroyed New Republic property and murdered New Republic personnel in the course of his vendetta.\nWhile the Imperial authorities believed him to be a New Republic agent, the New Republic considered him to be a serious threat. General Airen Cracken, head of New Republic Intelligence, believed that many non-aligned worlds had aligned themselves with the Empire as a result of Farnor's terrorism, and that his actions provoked hostilities in places where peaceful settlements were possible. Cracken set a reward of 10,000 credits to anyone who stopped Farnor—preferably by capturing him alive, as Cracken reasoned that Farnor could be rehabilitated with proper counseling. Cracken also pointed out that if the New Republic could not stop Farnor, the Empire would score a propaganda victory by killing him.\nFarnor's vessel, a modified YT-1300 light freighter, was frequently seen in the Borderland Regions separating the Empire and the Republic. Farnor equipped himself with a blaster pistol, vibroblade, blast vest, and blast helmet.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Belnar/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/25_BBY/Legends",
  "/wiki/Khil",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/The_Graveyard",
  "/wiki/Freighter/Legends",
  "/wiki/Scout_vessel",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Trans-Hydian",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Blast_vest",
  "/wiki/Blast_helmet/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}