{
 "name": "Gresia_Vleen",
 "display_name": "Gresia Vleen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Captain Gresia Vleen was in command of the Interdictor cruiser the Tory's Catcher and patrolled the Noonian sector. She had long brown hair, which she wore in a tight bun. She had an athletic body of such proportions that many Human males could not keep their eyes off her.\nVleen appeared cool, calm, and patient, but was in reality extremely short-tempered. She was known to shoot freighter captains at point blank for mouthing off and to blast ships out of the sky for not following procedure. She would personally inspect every crate of cargo, and would also have Imperial technicians investigate maintenance ducts and engineering spaces. She was accompanied by several squads of stormtroopers, whom she always ordered to secure the ship to be inspected before inspection.\nShe was eager to prove her worth as an Imperial captain and was extremely meticulous. She expected full cooperation from inspectees. Freighter captains ogling her good looks would sometimes find themselves looking at the wrong end of a blaster barrel.\nAt some point before 1 ABY, Vleen captured smugglers Thi Sawrtin and Zayl Braith, who were performing a \"routine\" smuggling run through the Noonian sector. Sawrtin tried to bribe Vleen; in reply she shot Sawrtin. Then she impounded Sawrtin's ship and convinced Braith to serve sentence on Rol II.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Platt_Okeefe/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Immobilizer_418_cruiser/Legends",
  "/wiki/Tory%27s_Catcher",
  "/wiki/Noonian_sector/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Thi_Sawrtin",
  "/wiki/Zayl_Braith",
  "/wiki/Rol_II",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Smuggler%27s_Log",
  "/wiki/Star_Wars_Adventure_Journal_2",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}