{
 "name": "Greybok",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Greybok was a Wookiee male tribal diplomat who was enslaved and forced to mine spice on the planet Sevarcos in a mine controlled by the Galactic Empire. He and his fellow slaves the Weequay Hatchet and the Quarren Palabar freed themselves during the Battle of Sevarcos. Later, Greybok and his friends took part in the liberation of the Wookiee homeworld of Kashyyyk.\nPrior to the Age of the Empire, Greybok was a tribal diplomat. When the Empire enslaved the Wookiee species, he was enslaved and shipped off to the spice mines of Sevarcos. As a slave, his job was to swing a pneumo-hammer and pulverize rock. After trying to escape the mines on one occasion, the slavers chopped off one of his arms as punishment. Sometime after the Battle of Endor, the Imperial mines on Sevarcos were attacked by the New Republic and Greybok watched the battle unfold alongside the Weequay slave Hatchet and the Quarren slave Palabar. Hatchet suggested the trio use the opportunity to escape, but Greybok, with the support of Palabar, demanded they aid the Republic and fight both the slavers and the Imperials.\nIgnoring Hatchet's protests, Greybok charged into the fight and flung one Imperial into a crevasse, heading for the corral in which three rancors were kept by the slavers. Once at the gate, the Wookiee beat off the lock with a rock while under Imperial fire, allowing the rancors free to attack the Empire's forces. As the first rancor exited the coral, it knocked the gate into its Wookiee liberator, flinging Greybok into a rock. Dazed, the slave was unable to defend himself when a Zygerrian slaver approached and shot him with a needler, intending to kill him with the weapon.\nHowever, before the pain caused by the needler stopped Greybok's heart, Hatchet bludgeoned the slaver to death with a rock. Seeing he was saved, the Wookiee passed out, only awaking once the battle was over and the Imperials and slavers defeated. Unsure of what to do next, Hatchet asked a nearby New Republic soldier, who informed the trio they were free, but beyond that was not sure what would happened to them. After the soldier had moved on, Hatchet suggested that they make the most of the freedom and take a walk.\nIn 5 ABY, Greybok, Hatchet, and Palabar joined Han Solo and Chewbacca's mission to free Kashyyyk from Imperial rule. The Zabrak bounty hunter Jas Emari recruited them and a ragtag crew of Wookiee refugees. Together, the team traveled to Kashyyyk on her gunship Halo. At the behest of Palabar, the rebels used pneumo-hammers to hammer eyebolts into the wroshyr trees so that the Solo's team could take up position and fire on Camp Sardo's deflector shield generator.\nWhen Hatchet claimed that he did not want to be there, Greybok silenced him by shaking him with his one remaining arm. After the former Imperial loyalty officer, Sinjir Rath Velus disabled the inhibitor chips controlling the Wookiee population on Kashyyyk, Greybok and his fellow crew served as gunners aboard Jas's gunship Halo. They blasted Imperial Forest troopers, LAIT gunships, and AT-ST walkers. Following a fierce battle, Kashyyyk was liberated by the combined efforts of the Wookiees and the New Republic.\nIn the months after the liberation of Kashyyyk, Greybok accompanied Chewbacca, other Wookiees, and New Republic soldiers on mopping up operations against Imperial holdouts. On one such operation, Greybok and his team shot several Imperial soldiers that had cornered a Wookiee child slave named Lumpawaroo, who was Chewbacca's son. After Commandant Dessard was taken prisoner, Chewbacca and Waroo reunited.\nGreybok was a tall Wookiee. Prior to the Age of the Empire, he was a tribal diplomat. He lost an arm while he was working as a slave in the spice mines of Sevarcos. Due to his work as a slave, he knew how to wield a pneumo-hammer and pulverize rock. Despite losing one of his arms, Greybok was still strong enough to fling an Imperial in mechanized battle armor down a crevasse. Following his emancipation, Greybook and other Wookiee refugees participated in the liberation of Kashyyyk.\nGreybok first appeared in the novel Aftermath, which was written by Chuck Wendig and published in 2015.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookiee",
  "/wiki/Gender",
  "/wiki/Mining",
  "/wiki/Spice",
  "/wiki/Planet",
  "/wiki/Sevarcos",
  "/wiki/Galactic_Empire",
  "/wiki/Weequay",
  "/wiki/Hatchet_(slave)",
  "/wiki/Quarren",
  "/wiki/Palabar",
  "/wiki/Battle_of_Sevarcos",
  "/wiki/Liberation_of_Kashyyyk",
  "/wiki/Kashyyyk",
  "/wiki/Imperial_Era",
  "/wiki/Pneumo-hammer",
  "/wiki/Slaver",
  "/wiki/Limb",
  "/wiki/Battle_of_Endor",
  "/wiki/New_Republic",
  "/wiki/Rancor",
  "/wiki/Zygerrian",
  "/wiki/Needler",
  "/wiki/Death",
  "/wiki/Heart",
  "/wiki/New_Republic_soldier",
  "/wiki/5_ABY",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Zabrak",
  "/wiki/Bounty_hunter",
  "/wiki/Jas_Emari",
  "/wiki/Halo",
  "/wiki/Wroshyr_tree",
  "/wiki/Camp_Sardo",
  "/wiki/Deflector_shield_generator",
  "/wiki/Loyalty_officer",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Forest_trooper",
  "/wiki/Low-altitude_Imperial_transport",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Lumpawaroo",
  "/wiki/Commandant",
  "/wiki/Dessard",
  "/wiki/Aftermath_(novel)",
  "/wiki/Chuck_Wendig",
  "/wiki/2015",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}