{
 "name": "Gribbet",
 "display_name": "Gribbet",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rybet"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Skorr"
     ]
    }
   ]
  }
 ],
 "content": "Gribbet was a Rybet bounty hunter operating on Ord Mantell in the times of the Galactic Empire.\nGribbet worked with another bounty hunter, Skorr, both of them having an Imperial permit to operate on Ord Mantell.\nSoon after the Battle of Yavin, an Imperial fleet began maneuvers on Ord Mantell. Due to the high Imperial presence, available preys offered low bounties, and Skorr began considering looking for job elsewhere. However, just then, Gribbet noticed a group of newcomers, including Han Solo and partners Chewbacca, Luke Skywalker and Leia Organa, who had stopped on Ord Mantell to repair their transport, Millennium Falcon.\nSkorr changed his mind, tempted by the reward Jabba Desilijic Tiure offered for Solo's life. Afraid of Solo and Chewbacca's fighting skills, he prepared a plan to trap Solo using his Human allies, to whom he considered his Achilles' heel.\nSoon afterwards, due to an argument with Solo, Organa left angry and Skywalker went after her to protect her. Gribbet, who was watching, reported that to Skorr. Thus, Skorr ambushed and knocked out Organa while the Rybet was hiding. Skywalker, seeing Organa in danger, switched on his lightsaber, but Gribbet attacked and stunned him from behind.\nSkorr then proceeded to hide a probe on Skywalker's saber, as well as a holographic message for Solo: He would free his hostages in exchange for Solo himself, without weapons and without his Wookiee friend. Solo understood he needed a plan. First, he left the Falcon, empty, on the dock, but preheating her engines, so that Skorr could believe Chewbacca was there. However, Chewbacca would go to the meeting point with another transport, one with a tractor beam to pick up Solo and his friends.\nSkorr asked Gribbet for the exact place where the Falcon was, and believed that Chewbacca was there. The prisoners managed to escape with Solo and Chewbacca.\nFar from surrender, Skorr and Gribbet boarded their own ship to chase them. They began a shooting on the orbit of Ord Mantell, near the Imperial maneuvers, and under the notice of the local Admiral.\nThe chase took them to the twin moons of Ord Mantell, where Skywalker understood what was happening. He and Solo took the probe from the saber. Under Organa's idea, they placed the probe on a escape pod, and threw it to a Imperial-controlled area. Skorr chased the pod and, when he understood his mistake, his ship was trapped by the Imperial flagship's tractor beam. The Admiral decided that these prisoners would be an example for others.\nGribbet was never heard of again.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rybet/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Skorr/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Rookies:_Rendezvous",
  "/wiki/The_Bounty_Hunter_of_Ord_Mantell",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Crimson_Bounty",
  "/wiki/Star_Wars_Adventure_Journal_14",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Magazine_2",
  "/wiki/Use_the_Force",
  "/wiki/Star_Wars_Galaxy_Magazine_4",
  "/wiki/Predators_for_Hire:_A_Guide_to_Star_Wars_Bounty_Hunters",
  "/wiki/Star_Wars_Galaxy_Magazine_6",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Unseen_Planets_of_Star_Wars",
  "/wiki/Star_Wars_Insider_36",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Star_Wars_Galaxy_Collector_3",
  "/wiki/Aurra_Sing:_Dawn_of_the_Bounty_Hunters",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_132"
 ]
}