{
 "name": "Grievous",
 "display_name": "Grievous",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kalee"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Utapau"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaleesh"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.16 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "159 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Completely cybernetic except for the brain",
      "some vital organs",
      "and parts of the head including the eyes"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kaleesh",
      "Grievous's family",
      "Grievous's family",
      "InterGalactic Banking Clan",
      "Confederacy of Independent Systems",
      "Confederacy military",
      "Confederacy military"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Dooku"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "IG-100 MagnaGuards"
     ]
    }
   ]
  }
 ],
 "content": "Grievous, born Qymaen jai Sheelal, was a Kaleesh male warlord who served within the military forces of the Confederacy of Independent Systems as a commanding officer during the Clone Wars in the final years of the Republic Era. In addition to his position as a general within the Separatist Droid Army, the Kaleesh held the title of Supreme Martial Commander of the Separatist Droid Armies throughout the duration of the war, in which he led countless engagements against the Republic's Grand Army. Recognized for his ruthless tactics and extensive cybernetic enhancements, Grievous utilized the Separatist Droid Army and his adept combat skills to instill fear throughout the galaxy as he traveled to and invaded planets, while also engaging numerous Knights of the Jedi Order, his sworn enemies.\nA native of the Kalee, a planet within Wild Space, Sheelal grew to become a fearsome warrior of his people. He gained an aptitude for warfare and battle tactics when he led his people during the Kaleesh's war against their technologically-advanced enemies, the Yam'rii, invading from the planet Huk. Qymaen jai Sheelal took up the name \"Grievous\" and quickly attained the title of warlord, brutally pushing the Yam'rii from his world. However, the Galactic Republic and Jedi Order intervened in the conflict in assistance of the Yam'rii, leading to the development of an enduring grudge in Grievous.\nIn time, Grievous looked to the stars to continue his conquests, earning a bloody reputation that eventually reached the ears of the Sith Lords Darth Sidious and Darth Tyranus, also known as Dooku, the Count of Serenno. While in the employ of the InterGalactic Banking Clan as an enforcer, Grievous was approached by the Sith with an offer for conversion into an enhanced cybernetic being. He accepted the proposal, and began undergoing the alterations in stages over time while continuing his violent exploits. Sometime later, members of the Executive Separatist Council of the newly-formed Confederacy of Independent Systems led by Count Dooku conspired to mortally wound Grievous in a bid to convert him into a super-cyborg subservient to their cause. Dooku's agents sabotaged Grievous's shuttle, which resulted in a gruesome crash that left the man on the brink of death. The majority of his organic body was destroyed, with his remaining vital organs implanted into a powerful new robotic body.\nThe reconstructed Grievous became a skilled lightsaber duelist under Dooku's guidance, who trained the Kaleesh in the arts of lightsaber combat and eventually welcomed him into a position as a warrior in the Confederacy. Shortly after the advent of the Clone Wars, Grievous was granted the rank of general, as well as the title of Supreme Martial Commander of the Separatist Droid Armies, making him one of the most powerful people within the Separatist Alliance, second only to his master Dooku. Grievous wielded his skills as a brilliant military strategist and melee combatant during numerous campaigns against the Republic throughout the Clone Wars while also gaining a reputation for hunting and killing Jedi Knights. He made a habit of claiming the lightsabers of defeated Jedi as trophies and weapons to be used against other opponents. His position and threat level led to his preeminence as one of the Republic's primary targets throughout the course of the war. As the war played out, Grievous found a personal nemesis in Jedi Master Obi-Wan Kenobi, whom he dueled on numerous occasions.\nDays before the end of the war in 19 BBY, Grievous, under orders from Darth Sidious, launched a daring and unprecedented assault on the planet Coruscant, the capital world of the Republic. In his assault, the Kaleesh managed to take the Republic's Supreme Chancellor, Sheev Palpatine -in reality secretly Sidious himself- captive aboard his flagship, the Providence-class Dreadnought Invisible Hand. However, during the battle, the Chancellor was rescued from the general's grasp by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker, an engagement that also resulted in Dooku's death. Subsequently, Grievous became the de facto leader of the entire Separatist Alliance and immediately withdrew of all remaining reinforcements and fled into the Outer Rim Territories, prolonging the war. Following the Battle of Coruscant, Grievous, succeeding Dooku as the Confederacy's Head of State, retreated to the planet Utapau where he addressed and relocated the members of the Executive Separatist Council to the planet Mustafar under Sidious's orders. However, unknown to the general, Grievous's location on Utapau was betrayed by Sidious, resulting in a Republic invasion of the planet in an effort to bring a decisive conclusion to the war. As a result, following a prolonged chase between the two, Grievous was ultimately slain by his nemesis, General Kenobi, which resulted in the war's conclusion as well as the Confederacy's systematic collapse.\nBorn into his family to his mother and father years prior to the Clone Wars as Qymaen jai Sheelal, the Kaleesh who would one day become \"Grievous\" was a male who hailed from the Wild Space planet Kalee. The Yam'rii cruelly invaded countless worlds in their sector, stole their resources, and sold their inhabitants as slaves. Kalee became their target, which led to the Kaleesh becoming their victims. Sheelal was born in the midst of a near-constant war against the Yam'rii, a greedy, technologically-advanced insectoid species from the planet Huk, located in the same system as Kalee. Since his childhood, Sheelal worshiped the warlords of Kalee, watching them return home with spoils of war from conquered peoples. He was taught by his father to use a ranged weapon, the Czerka Arms Outland rifle, and by the age of eight, he had already killed forty enemies and had begun to harbor a disdain for the Galactic Republic.\nAs he matured, Sheelal experienced a rapid rise in rank and became a feared warrior and warlord, having learned battle tactics and warfare during the Kaleesh-Yam'rii war. Shrouded in the cloak and head wraps customary of his people, the proud Kaleesh warrior used weaponry like a curved sword and an elongated curved shield in battle. Sheelal became one of the greatest military leaders of his people, regarded by them as legendary. He bore the capacity to excite, motivate, and lead his fellow Kaleesh warriors using his ruthless and uncompromising tactics in the merciless war against the Yam'rii. He developed a habit of collecting the weapons of his defeated enemies and, like others of his species, became known for his lack of mercy and obsession with the glory gathered in war, valuing bravery in combat above all else. Rightfully, the infamous Kaleesh warrior earned a bloody reputation among his people and others, and eventually took up the moniker \"Grievous\". He continued to wage war against the invading Yam'rii for years, traveling and fighting alongside a team of personal bodyguards known as the Izvoshra. Seemingly always alongside their warlord leader, the Izvoshra shared in his victories and his love of battle alike.\nGrievous had cemented himself as the preeminent warlord of Kalee. He came to turn his attention to the stars, and began to embark on conquests beyond his planet throughout space, accompanied by his Izvoshra. Over the course of his exploits, Grievous came to topple nations, slay kings, and murder legends. At some point, he encountered a Wookiee warrior champion of Kashyyyk and decapitated a member of the Skrilling species. Word of Grievous's reputation eventually reached the Sith, who were recruiting minions with special abilities and a deep hatred of the Jedi; Darth Tyranus, also known as Count Dooku, and his Sith Master, Darth Sidious, secretly the Republic politician Sheev Palpatine, saw great potential in him. Legend claimed that they specifically were interested in his strength, power, and will to succeed. The Sith had been recruiting minions who possessed unique skills and hatred of the Jedi, both of which Grievous had in abundance.\nIn time, the Kaleesh forces successfully drove the Huk from their world thanks in no small part to Grievous's ferocity and determination on the offensive. However, the Yam'rii unexpectedly sought aid from the the Republic. The intervention of the Galactic Republic and the Jedi, its protectors, in favor of the Yam'rii resulted in hundreds of thousands of Kaleesh starving to death. Grievous's hatred for the Jedi and the Republic consequently grew even stronger, the incident causing him to develop a personal vendetta against them. He was further frustrated by the realization that the Knights of the Jedi Order were nearly undefeatable in combat, thanks to their possession of supernatural abilities originating from the mystical energy field known as the Force.\nDespite the disastrous intervention of the Republic and their Jedi, Grievous eventually became an agent of the InterGalactic Banking Clan. Though he requested to have his loyal Izvoshra guards continue to serve him under the Banking Clan's employ, the organization rejected the warriors and forced him to instead command the Clan's own droids, which he despised. However, the droids were replaced by a new type of guard when Count Dooku, an ally of the IGBC, commissioned the creation of the IG-100 MagnaGuard combat droids in response to hearing of Grievous's demands for a more intelligent type of bodyguard. In his tenure in their service, Grievous quickly established himself as one of IGBC's most valuable assets. By this point highly impressed by Grievous, Count Dooku and Darth Sidious had developed crucial intentions for him.\nGrievous chose to become a cyborg, receiving his enhancements over time, after the Sith gave him an unquestionable chance, which he accepted, as they had been looking to test technologically advanced beings. His combat abilities increased as a result of the changes, with strength and speed to rival even a Jedi Master after sacrificing almost all of his physical body, becoming an even more threatening and fearsome warrior. Although legend claimed Grievous transformed himself because he admired the logic of droids and wanted to mirror their infallibility, strength, and power. He betted with himself that, by inventing a new form for himself, he would rise above all others. These augmentations turned an already capable warrior into a nearly unstoppable killing machine on the battlefield, giving him capabilities beyond those of a normal soldier.\nBefore the advent of the Separatist Crisis and becoming the Head of State of Confederacy of Independent Systems, Count Dooku of Serenno arranged a scheme with San Hill, Chairman of the InterGalactic Banking Clan, and Poggle the Lesser, the Archduke of Geonosis, to assassinate their volatile ally, General Grievous to permanently add him to the Separatist arsenal as a subservient but skilled super-cyborg. To accomplish this, Grievous' shuttle was critically sabotaged under Dooku's direction. After the damaged shuttle gruesomely crashed that almost killed him and destroyed most of his original body, Dooku offered the Kaleesh warrior life-saving surgery and informed him that a Jedi was responsible for the sabotage; as a result, the General harbored a deep and violent hatred of the Jedi from that moment. However, Dooku was directly responsible for the shuttle crash that caused Grievous' injuries and subsequent transformation. With his mind entirely transformed, the warrior chose to accept the reconstruction of his and return to military service, fueling his hate for the Republic and the Huk.\nSeparatist cybernetics experts and Geonosian biotechnicians surgically reconstructed Grievous with assistance from the FX-9 surgical assistant FX-6 under the supervision of Dooku, Hill, and Poggle. Among the repairs and improvements made by the surgeons, some areas of Grievous's brain were altered without his knowledge in order to make him a smarter and faster fighter. Such upgrades included the installation of heuristic combat programming. His brain was also modified, such as brain tissue, which was wired directly into and carried electrical signals to better facilitate the coordinated usage of his cyborg body. Additional processors boost the cyborg's already impressive physical control by further sharpening agility and reactions. While cybernetic implants were added to enhance his vision, Grievous's eyes were his own, with enough skull remaining behind them to prevent the organic muscles and tendons required for them to function normally. Furthermore, his memory center was tinkered with to suppress memories of his past, and increase his aggression. His lungs were given implants as well.\nMany critical decisions were made as to what should be kept of his mangled original body, and by the time the Kaleesh warrior had been rebuilt, very little remained of his original form. These remaining structures largely consisted only of his brain, eyes, and several vital internal organs: his heart, lungs, and the portions of his digestive system and much of his spinal cord were kept intact, all implanted into a duranium alloy body, complete with two mechanical arms that could split into four, LX-44 robotic legs and integrated sensors that allowed him to touch and feel the world. Grievous's spinal cord carried signals to and from his robotic limbs and body, as well as his remaining organs. However, millions of pin-point electrodes were inserted into his brain from the lining of his helmet, to monitor brain activity and improve nerve signal timings. His head unit, which additionally retained parts of his skull, could be opened to allow for electronic repair or replacement, as well as further surgery.\nThe vast majority of resemblance to other Kaleesh eliminated, his gold reptilian eyes with slit pupils, flat nose, and elongated ears remained on his face, surrounded by a small amount of dark, tortured skin that extended upward somewhat beneath the forehead of his faceplate. It claimed that only his eyes still looked like the man he once was, and gazing into them was supposed to feel like looking into the gaping maw of a black hole. Despite not having a mouth, he required a vocabulator, which almost perfectly mimicked his original voice. As a cyborg, he didn't need to eat or drink and could survive in vacuum or underwater; he was also immune to poisons and toxins. Without inspection, Grievous appeared to be a machine, but he still retained what made him a living, breathing man. Grievous was covered in thick armorplast plating, on top of his dull-down duranium armour, with the exterior terrors and appearance of polished bone. The cyborg's skeletal structure bore various call-backs to his Kaleesh past, which purposefully designed to resemble Grievous' Kaleesh body and his warlord armor. This included a faceplate that mirrored the mask he once wore, which evoked the culture of his people. The synthskin gut-sack protecting his remaining vital organs was sealed behind his external armorplast plates and armoured ribs, but the technology wasn't perfect, with his heart and lungs weakening. However, the organic lungs were irritated by their implants. This gave the warrior a persistent cough and difficulty breathing for the rest of his life.\nThe General was presented by Dooku with a new weapon, a lightsaber that had belonged to a long-dead friend of the former Jedi. Subsequently, the general added other weapons to the collection which he had started while still a warlord on Kalee. Furious that his body had been entirely replaced with that of the droids he hated, Grievous slaughtered all the guards present upon his resurrection. Grievous, despite his disgust with his cyborg body, reluctantly accepted the position of supreme commander of the Separatists' droid armies. No longer recognizable as the person he had once been, having become more machine than alien. Grievous nonetheless proclaimed himself to be someone who had chosen voluntary improvements, and insisted that he submitted to no one.\nGrievous was then selected for training in the art of lightsaber combat, for which his cybernetic upgrades were well suited to. Dooku improved his lightsaber training, making him even more lethal, thanks cybernetic implants to his brain gave him access to heuristic combat programming that would assist him in battling Jedi. He'd spent hours watching holovids of Jedi in combat and had read every training manual Count Dooku could supply him with. He was a voracious learner when it came to dealing with death. He viewed the different saber styles as just another aspect of warfare to be learned.\nOver time, Grievous' cybernetic body underwent significant changes and enhancements, replacing much of his living body so little of his original form remained, transforming into a four-armed cyborg monstrosity. Everything else was made of metal, mechanical actuators, armorplast, and hatred. His confident, modified surgical EV-series medical droid named EV-A4-D, given by the Separatists to serve as a surgeon, doctor, and cybernetics repair mechanic. The rather sarcastic and slightly sadistic droid, who had access to all of Grievous's medical and cybernetic records and a greatly boosted intelligence, served as the perfect foil for the general, as well as his doctor. A4-D always stored replacement parts for the General, assisting him design and fit any new upgrades Grievous request. In that sense, his statement that he makes modifications to his body himself could be considered true from a twisted point of view. He was one of the few beings in the galaxy who knew many secrets of his master, which made him very important. Though he still wondered why the proud warrior submitted to the extensive changes.\nWhile training in the ways of lightsaber combat under Count Dooku, the General quickly realized the MagnaGuards' impressive capabilities, wiped the droids' original combat programming and retrained them. He passed on everything he learned to his bodyguards to ensure their utmost effectiveness in combat, and subsequently used them as sparring partners to keep himself sharp. He also presented many of them with Kaleesh capes adorned with mumuu markings and head wraps as a tribute to his original Izvoshra bodyguards and to harken back to the traditions of his homeworld's warriors. The MagnaGuards came to share his fearsome reputation, and Grievous was rarely seen without at least two of them by his flanks, who could form a shield around him through which few could pass.\nWhile he claimed his old form was no more than weak flesh, Grievous retained several reminders of his past life. As a cyborg, Grievous frequently wore a Kaleesh cloak, which was a vestige of his past identity, as well as a fearsome mask that was often worn by Kaleesh warriors. By the time he owned his fortress on the third moon of Vassek, Grievous had several statues that depicted his progression from his organic life into that of a cyborg, beginning with replacement arms, and later legs, chest armor, and a faceplate. One of these depicted him holding aloft the head of the Skrilling that he decapitated prior to his cybernetic enhancements.\nThis fortress was carved into a cliff face at the end of an unremarkable canyon, and it was the closest thing to what he could call a home, serving as a hideaway and a safe place where he could undergo repairs when damaged in battle. He also ownd an enormous roggwart named Gor, whom he had enhanced by A4-D with whiplike cybernetic limbs to his back and attached a battle armour exoskeleton to his body. Like his master, the roggwart was given a protective chest plate and a helmet to protect his braincase. Gor became beloved to Grievous, who would rest between conflicts with his pet at his fortress.\nAfter Grievous received his cybernetic enhancements and was trained in lightsaber combat by Dooku, the Count of Serenno invited him to join his Separatist movement. Grievous accepted the invitation and allied himself with other members of the Confederacy of Independent Systems, in direct opposition of the Galactic Republic and the Jedi Order, whom he had long regarded as mortal enemies. The leading Executive Separatist Council included, among others, San Hill, for whom Grievous had previously worked as part of the InterGalactic Banking Clan, and who had secretly acted as a co-conspirator in an assassination attempt on Grievous. Poggle the Lesser, who had also taken part in the plot, was a Council member as well. According to legend, although Grievous had the outward appearance of a machine, Grievous was pleased, for he alone understood his true potential and that he still had some of what made him a living, breathing man. This, he believed, set him apart from the rest of the Separatists, droids and organics alike—although neither droids nor organics found themselves comfortable in his company.\nThe CIS and Republic were soon launched into opposite warring sides of the galactic conflict known as the Clone Wars with the Battle of Geonosis, which Grievous secretly took part in. While it was entirely by accident, Grievous's first clash against members of the Jedi Order in his cyborg form built around his meager physical remains came during the battle; he was positioned within the Stalgasin hive catacombs on Geonosis when the battle began, and the cyborg ended up dueling a number of Jedi who incidentally wandered into the tunnels in the midst of the battle. Grievous prevented the Jedi and the clone troopers from reaching the Separatist Council and left none of the Force-sensitives he encountered alive to speak of his existence, meaning his involvement in the war's opening battle was not discovered by the Republic until much later. But the General would soon become a frequent and brutal presence in the conflict. During the early weeks of the war, he publicly emerged onto the scene as a major Separatist leader.\nGrievous quickly gained a reputation as a savage, merciless brute as well as a tactical genius. As a merciless military leader, warrior, and tactician, Grievous outstripped every commanding officer in the Republic and led the Confederacy to victory in a number of battles. Grievous' fearsome reputation was also reinforced by a personal fleet of specialized killing machines and vehicles. The news of his abilities and subsequent victories caused doubt in the ranks of the Republic's military and paralyzed fear in the hearts of the population. As would later be proclaimed in the legend he made for himself, Grievous swiftly became accomplished during his tenure as one of the most fearsome warriors of the Separatists, and through the many campaigns he had fought on behalf of his masters, he had risen in the ranks, claiming victory after victory. He earned a name for himself amongst the powerful men and women who led the Separatist movement, in part because of his sheer commitment to being the best soldier he could be. Soon enough, Grievous found himself granted the rank of general in the Confederacy military, becoming a key Separatist leader in command of vast droid armies. Subsequently, Dooku personally presented Grievous with the title of Supreme Martial Commander of the Separatist Droid Armies, which he gladly accepted. Thus, General Grievous became the absolute leader of the Separatist Droid Army.\nAs the Clone War proceeded to spread throughout the galaxy, Grievous and his forces engaged the Grand Army of the Republic, and, under his command, the Separatist Droid Army attacked and conquered numerous Republic planets. As the Separatist Army's imposing leader, Grievous and the tales of his brutality and victories would strike fear throughout the Republic, although the Confederate populace were not told the stories of the General's bloody onslaughts. Ultimately, many Republic citizens—as well as some citizens in CIS territory— came to see Grievous as the face of the Confederacy despite Dooku's status as its official leader. Those who knew the Kaleesh warrior's true nature saw this face as a brutal and terrifying one. Grievous also share his name with The Grievous Legion, a battle group that included at least one vulture droid. During the war, the clone troopers of the Republic Military, having nicknamed the Confederacy's battle droids \"clankers,\" accordingly nicknamed Grievous the \"head clanker;\" Grievous was also referred to within the Republic as the \"droid general.\"\nWhile the war against the Yam'rii had given Grievous a vendetta against the Republic, Grievous had changed by the Clone Wars; indifferent to the Republic and the politics of the war as a whole, his only goal was to see the extermination of the Jedi Order, which led to him escalating the war as his quest to wipe out the Jedi once and for all carried on. However, his hatred for the Jedi pushed him to near-madness, making him easy to exploit. Grievous fought against numerous Jedi during the war, defeating and killing many of the Order's members with his powerful droid physique made out of duranium and powered by the twisted mind of a psychologically and spiritually shattered warrior. His prowess with lightsabers and his lifetime of knowledge and the advantages provided by his mechanical body enabled him to stand up to them. Thus the general became the most proficient Jedi hunter of the war, which enabled him to collect lightsabers and other trophies from bested opponents. Grievous often maintained a strategy of elusiveness, making it difficult for the Republic's forces to locate him despite it being one of their primary objectives.\nDuring the war, Grievous came to duel Jedi Master Obi-Wan Kenobi numerous times, developing a history between them that made it so Grievous would choose to engage Kenobi over others. Their great powers were so evenly matched that he and Kenobi became mortal enemies. Kenobi's former apprentice, Jedi General Anakin Skywalker considered him a monster that needed to be stopped, even making it a personal mission to find Grievous. However, Grievous and Skywalker would not meet face-to-face until the war had nearly reached its conclusion.\nTowards the beginning of the war, Grievous led a fleet of Providence-class Dreadnoughts to the Moon of Staggec with the aim of taking a valuable item from Republic Senator Yarua. There, he and his droid forces captured Yarua, Senator Padmé Amidala, and their associates. Shortly after, the droids also captured Yarua's daughter Viiveenn and Kenobi. Once Kenobi was restrained, Grievous interrogated Yarua and Viiveenn about their hidden item. Just then, Kenobi appeared behind Grievous and asked for Yarua and Viiveenn to be released. Grievous responded by drawing his lightsabers and engaging the Jedi in combat. Force pushed by Kenobi, Grievous immediately took Viiveenn hostage, only for Yarua to tackle him into space, sacrificing himself and allowing his daughter to escape along with the Jedi. While successfully escaping from the Separatists, Kenobi assumed Grievous was dead, but Yoda warned him not to underestimate him.\nDuring the early weeks of the war, Grievous had an encounter with Jedi Master Ki-Adi-Mundi that left the Cerean with scars across his cheek that took time to heal. He also learned of the legendary reputation of Jedi Grand Master Yoda as a master swordsman and hoped to meet him in combat one day. Later, Grievous and Jedi Knight Pablo-Jill had a duel over the world of Duro in a collapsing satellite city. Jill was left injured and lost his blue-bladed lightsaber to Grievous. At some point, Grievous killed Jedi Master Jmmaar and took his green-bladed lightsaber in order to add to his own collection.\nSoon, Grievous met in person with the droid mercenary AD-W4 to hire him to oversee the Separatists' operations on the planet Hissrich. Grievous admitted that he would have liked to fill this role himself, but could not as he had the entire Separatist Droid Army to command. AD-W4 was skeptical, but after seeing the payment available, left to fulfill the job. AD-W4 served as commander of the droids on the planet and battled with Jedi Master Mace Windu and his Jedi squad. Grievous later checked in via hologram to see the progress of AD-W4, and the droid falsely claimed to have killed Windu; however Grievous demanded the Jedi's lightsaber as evidence, which was not presented. Ultimately, the droid was defeated and Hissrich was lost to the Republic.\nIn a battle on the fourth moon of Parein II, Grievous's MagnaGuards were put to their first real test. With Grievous in command and leading his troops at the front, the Republic forces led by Jedi General Sannen were crushed. Grievous used a new weapon the TSMEU-6 personal wheel bike, for the first time on the battlefield. Sannen bravely tried to confront the cyborg directly, but the Jedi was instead stabbed in the throat with an electrostaff by one of the MagnaGuards. According to legend, early in the Clone Wars, Grievous was tasked with a critical mission; he was to travel to the distant ice planet Alamass and deploy his army of droids in an assault that would destroy a strategic enemy stronghold. The operation was a dangerous and difficult one, at which Grievous ultimately failed due to his tactical droid's betrayal. Eventually, the general was forced to admit his defeat to his Sith masters, becoming Grievous's first major loss.\nAt one point, Grievous attacked the frozen moon Caliban, destroying a bridge in the process. He also captured Jedi General Kenobi and Clone Marshal Commander CC-2224 \"Cody,\" along with their squad of clone troopers and ordered them to rebuild the bridge, to allow him to freely move weapons and battle droids across the moon. Kenobi, however, answered that he and the clones would not have to work for Grievous, since according to the Galactic Accord of Systems, no war prisoner could be forced into manual labor. The Separatist general smacked Kenobi to the ground and threatened him with death if he would not follow his orders.\nKenobi and the clones started constructing the bridge, but during the operation, Grievous was distracted by a group of native Qubeys, in league with Kenobi, who piled on top of him and managed to steal back Kenobi's lightsaber, which had been tucked into Grievous's cloak, without the cyborg noticing. Although the bridge was completed sometime later, Grievous ordered the battle droids to execute Kenobi and his men, but the Qubeys ambushed the droids, allowing Kenobi to engage Grievous while the clones reclaimed their blasters. In the ensuing battle, Kenobi used the Force to cause an avalanche, burying Grievous and his droids. Kenobi and the clones escaped on a Low Altitude Assault Transport/infantry gunship before Separatist reinforcements could arrive and destroyed the previously built bridge.\nAt some point during the Clone Wars, Grievous infiltrated the Stellar Rise in search of High Republic–era artifacts and brought along four IG-100 MagnaGuards, who then killed all of the deck crew in under a minute. Grievous spared the ship's captain Lozz Beraf, intimidating him until the Jedi Knight Anap Ree-Di showed herself by ordering Grievous to let go of his captain and leave. Her piercing green eyes with a crystal-gaze caught his attention and was struck by her seeming confidence. However, he still had not yet demonstrated to her his full potential. He slowly produced four lightsabers, activated them one by one, and displayed a menacing demeanor. She remained motionless; her gaze locked on him. All four MagnaGuards jumped forwards, swinging their electrostaffs at the Jedi. Anap managed to ignite her green lightsaber, exchanged blows and somersaulting backwards to avoid the other. Ree-Di fled from the bridge, forcing Grievous to follow.\nAfter following the fleeing Jedi, Anap appeared from nowhere, striking from behind, slicing one of the Magnaguards' arms along with it wielding the electrostaff as the remaining three droids went on the attack, landing blow after blow on the Jedi's green blade, forcing her away from the barracks. Grievous now ignited two lightsabers, both blue and green, and closed in for the kill. At that moment, Grievous and his MagnaGuards were interrupted by four clone troopers, Grievous snarled in anger and threw one of his lightsabers at a low arc that cut into the legs of the two troopers, making the fight an equal one. He retrieved the blade and then turned his attention to the troublesome Jedi, igniting another three sabers retrieved from his cloak, and begin advancing on her at speed. Anap used the Force to open a blast shield behind, stepping through it backwards, almost losing her footing, and Grievous struck, looking down on her with two of his blades, which she parried but almost took out her legs with his other two swept low. Grievous was then knock off unbalance by Anap, who leaped over his lightsabers and kicked at Grievous' chest.\nHe continued to attack, nearly disarming the Jedi with a maneuver meant to catch her off guard. For a brief moment, Grievous stepped back, but the Jedi did something curious. She used the Force to lower the shield, blocking them off from the battle between troopers and IG-100 droids. This idea amused him. Anap implied to Grievous that she was described as having an \"old soul\" by Master Jocasta Nu, and soon that would be his only possession. After that, Grievous moved forward spinning his lightsabers at a near impossible speed intent on striking a fatal blow. In a pitiful attempt at defense, she threw her ignited lightsaber at him, and he watched as it went harmlessly by, landing in an ancillary walkway. Ultimately, Grievous was ejected from the Stellar Rise by Ree-Di after tricking him into getting into an escape pod. As the Republic ship jumped to lightspeed, leaving Grievous behind, alone and adrift in space.\nAround the time of the Battle of Christophsis, Grievous had spread Republic forces thin, which hampered Republic efforts to locate Rotta the Hutt after he was secretly kidnapped by the CIS. Grievous was also known to lead starfleets within the Confederate Navy to further his conquest of Republic planets, with his ships leaving the worlds wrecked and burned. As he was leading the Separatist forces in the Clone Wars, Grievous was given the Subjugator-class heavy cruiser Malevolence as his flagship. From the Malevolence's bridge, Grievous could command millions of battle droids, and he used his new warship in the Malevolence Campaign, wherein he executed attacks on Republic fleets that left no survivors. Grievous' favored tactics were well suited to the Malevolence. Initially, small convoys were attacked, then entire fleets, as with his own abilities, the Separatist Commander gradually revealed the power of his new ship. For months, rumors circulated of a terrifying new Separatist weapon alongside widespread concern over the cyborg general. Once such attack came with the Battle of the Phu system, where the Malevolence wiped out three Venator-class Star Destroyers under the command of Jedi Master Ares Nune.\nFollowing that victory, while stationed in the Abregado system with Count Dooku aboard, a Republic fleet led by Jedi Master Plo Koon and Clone Commander CC-3636 \"Wolffe\" aboard the Venator Triumphant arrived in the system to engage the warship. The mega-ion cannons of the Malevolence disabled the Republic fleet's deflector shields, and fired on the defenseless Star Destroyers. The entire fleet was destroyed, although a few individuals managed to survive by launching away from the vessels inside escape pods. General Plo Koon, Commander Wolffe, Clone Sergeant \"Sinker,\" and clone trooper CT-4860 were the only survivors, having been eventually rescued by Anakin Skywalker and his Padawan Ahsoka Tano aboard the G9 Rigger-class light freighter Twilight. As a result of the escape of survivors, Dooku's trust in Grievous was shaken, and the Sith Lord left to discuss the matter with his master, Darth Sidious.\nAfter later destroying a Republic convoy in the Ryndellia system, Grievous, as instructed by Dooku via hologram, took the Malevolence to destroy a Republic medical facility that was treating over 60,000 wounded clones. In order to reach the target, the Malevolence had to navigate around the Kaliida Nebula, a time-consuming journey that frustrated Grievous. Upon arriving at its destination, the ion cannons of the Malevolence were disabled by a small strike force of fighters led by General Skywalker. After this, a Republic fleet led by Obi-Wan Kenobi aboard his flagship the Negotiator arrived and attacked Grievous' crippled ship. Grievous was forced to retreat, but Dooku came up with a new plan; taking Senator Amidala hostage. After Amidala's ship was captured, the Republic fleet stopped firing, and a rescue team was sent to board the Malevolence led by Obi-Wan Kenobi and Anakin Skywalker aboard the Twilight. Grievous fought Obi-Wan Kenobi briefly and overpowered him, but the two Jedi managed to escape with Padmé and her protoccol droid C-3PO. Grievous pursued the Twilight in his personal starfighter, the Soulless One, but Skywalker had sabotaged the navigation system of the Malevolence so that when the ship engaged its hyperdrive, it crashed directly into the nearby Dead Moon of Antar. Grievous escaped in his starfighter, Soulless One, but he had personally disconnected a transmission with a questioning Count Dooku.\nWithout doubt, the loss of the ship was a setback for Darth Sidious and the Separatist movement, as well as a poor return on such a large investment of time and resources. In addition, the absence of the Malevolence kept the arrogant Grievous at bay. Only a few months after this session, Grievous would face Luminara Unduli in person at Nadiem in the Outer Rim.\nThe Republic would make efforts to locate Grievous, but, even after Clone Intelligence spotted him in the Balmorra system, the general remained out of the Republic's sight. Several standard weeks after his sighting in the Balmorra system, Anakin Skywalker was losing sleep while searching for the cyborg, but he denied himself his needed rest until Grievous was found. While Obi-Wan Kenobi believed that they would know if Grievous entered their current quadrant, the general was currently preparing to launch an attack on Kamino. Under the Separatist invasion plan, Grievous would be able to remain undetectable, as he was to take over the Rishi Station. Seizing the listening outpost would enable the Separatists to keep its all-clear signal broadcasting; Republic forces would assume Kamino was still secure, meaning Grievous's fleet could launch a surprise assault on the planet.\nGrievous, determined to stop the clone production on Kamino, sent a team of BX-series droid commandos to seize Rishi Station from the clone troopers stationed there. After the commando droids had taken control of the station, Grievous was contacted by their captain aboard his Munificent-class star frigate, who informed him that the outpost was secure, and that they managed to disable the alarm and activate the all-clear signal. Grievous ordered him to keep the signal activated, so as not to draw the Republic's attention and lose the element of surprise.\nAfter ending the transmission, a battle droid informed the general that their spy on Kamino, Asajj Ventress, was contacting him. Ventress assured Grievous that everything was ready for their invasion. Pleased, the general informed her that he had almost reached their rendezvous point. However, the station was soon visited by Clone Captain CT-7567 \"Rex\" and Clone Commander Cody, who were inspecting the station as part of a security checkup. The two clone officers soon discovered the outpost had been taken, and met with the survivors and retook the station from the commando droids. When communication with the droids was abruptly cut off, Grievous sent a battalion of B1-series battle droids to inspect the station and was informed that there were clones in the station. One of the clone troopers, CT-782 \"Hevy,\" sacrificed himself to destroy the base, which angered Grievous as he believed that the droids had blown it up instead. The base's destrution ended the all-clear signal and alerted the Republic fleet to Grievous's location. Upon the Republic's arrival, the Kaleesh cyborg immediately realized that his forces were heavily outgunned, and ordered his fleet to make a full retreat out of the system, therefore postponing the Kamino invasion.\nOnly a short time after the Malevolence offensive, Grievous launched another campaign, targeting Republic fleets in the galaxy's Outer Rim Territories by using the newly created Skytop Station, a Separatist battlesphere that served as a listening post. Able to locate and ambush Republic fleets without warning, Grievous moved his forces against the Republic's forces in the Outer Rim, and, due to the victories he gained, the Republic's foothold in the Outer Rim began to slip from their disastrous losses. Despite suffering some serious setbacks, Grievous continued on his march, leading the Separatists to numerous triumphs, leaving a trail of conquest and destruction across the galaxy and proving to be a nearly indestructible opponent for both the Jedi and the Republic. In a single month, he led Separatist forces in the invasion of several planets and the capture of vital hyperspace lanes leading to Bespin, Kessel, and Mon Calamari. Anakin Skywalker and his battle group fought against Grievous's forces in the campaign, but failed to stop Grievous's advance. After the Republic battle group at Falleen was wiped out, the fleet under the command of Grievous prepared to take the planet of Bothawui, which was of high strategic value and was currently being protected by Skywalker and a weary fleet of Republic cruisers.\nHis next move was to capture Bothawui, the Bothan homeworld and a vital intelligence planet for the Republic. However, Grievous pulled the Republic fleet out of hyperspace and engaged the Jedi and their clone troopers before they could reach Bothawui. Grievous reconsidered his decision to stop pursuing Skywalker's fleet in order to help coordinate attacks against Republic forces stationed near the planet Falleen. With the help of Count Dooku and Asajj Ventress, Grievous captured the planet for the Separatists before continuing on to Bothawui in the Mid Rim Territories to attack Skywalker's fleet with information from his spies. Realizing that attacking from above would put them at a disadvantage, Grievous moved the fleet through the asteroid field to engage Skywalker's fleet, knowing that the asteroids would protect him from any surprise attacks. Before Skywalker led Gold Squadron the engagement, this tactic allowed Grievous to damage the Republic cruiser.\nSkywalker then deployed into the Gold Squadron from his flagship, the Resolute, to try and draw out the general. As Grievous' fleet exited the asteroid field, it was able to severely damage one the Republic cruisers, but was quickly outflanked by All Terrain Tactical Enforcers hidden on the asteroids. Grievous was shocked and angered that Skywalker knew what he was planning to do, and ordered an immediate retreat. However, the battle droid commander was dumbfounded as to where to go, so Grievous abandoned his flagship and the droids in annoyance. He quickly fled in his personal starfighter, Soulless One, rather than risk destruction or capture. He fled, leaving the Separatist fleet to be destroyed. Both actions were indicative: Skywalker frequently chose bold, maneuvers, while Grievous fled as soon as he realized a battle was not in his favor. He was soon spotted by Skywalker, who attempted to pursue him in his Delta-7B Aethersprite-class interceptor but was soon sent spinning out of control as a result of the damage his fighter had sustained earlier in the fight. Meanwhile, Grievous had managed to power up the Soulless One's hyperdrive, allowing him to jump into hyperspace. The rest of Grievous' fleet however, was destroyed.\nFollowing his loss at Bothawui, Grievous contacted the Trandoshan salvager Gha Nachkt, and requested that he search the debris field for an astromech droid, telling him to rendezvous at Skytop Station on Ruusan's moon once the droid was located. The droid in question was R2-D2, the astromech droid of General Skywalker, with Grievous suspecting that he held vital military secrets within his memory banks that could aid the Separatists.\nLater, Grievous was contacted by Nachkt, who informed him that he had the droid in his possession and was en route to their rendezvous point. He also revealed that Skywalker had boarded his ship looking for it, and believing it to be valuable, requested more money than they had previously agreed upon. However, Grievous threatened him, telling Nachkt to not anger him and to arrive as fast as he could, or else there would be consequences.\nNot soon after, Grievous detected Skywalker's fighter's beacon, which had been activated by R3-S6, Skywalker's replacement astromech droid, who in reality was a Separatist spy. Having fallen into his trap, Grievous aboard his new command ship suddenly dropped out of hyperspace and attacked, destroying his hyperspace transport ring, preventing his escape, proceeding to launch an entire squadron of vulture droids to kill the Jedi, and ordered his cruisers to move in. However, Skywalker was rescued by the timely arrival of his apprentice Ahsoka Tano and the Twilight, Skywalker's freighter. The General then ordered his ships to prevent their escape, but the Twilight was able to navigate between the two battleships, causing them to collide with each other, destroying the vulture droids. The Jedi's ship then jumped to hyperspace. In his anger, Grievous physically decapitated an unfortunate battle droid who had pointed out to him that the Jedi had escaped.\nNachkt soon arrived at Skytop Station with R2-D2, and proceeded to disassemble the astromech droid and sift through his memory banks for any vital information. Grievous listened as Nachkt revealed that the data within the astromech had never been erased and contained a wealth of information that they could exploit. Trying to use this to his advantage, Nachkt demanded double the agreed price, but Grievous, having grown tired of his incompetence, proceeded to impale him with his lightsaber, killing him with Grievous cackling in his death. He was then informed by the spy R3-S6 that the Jedi had infiltrated the station in order to rescue the droid. Grievous ordered R3 to distract them until he arrived, and tasked his IG-100 MagnaGuards with taking care of the astromech while he confronted the Jedi.\nGrievous then found Skywalker's apprentice, Ahsoka Tano, along with Captain Rex and a squad of clone troopers. He engaged them in combat and managed to kill all of the clones except Rex and \"Denal,\" who were saved by the timely intervention of Ahsoka. As she confronted the general, she was quickly overpowered but successfully avoided his attacks, knowing that she couldn't defeat him on her own and was forced to retreat further into the station, with Grievous and R3 giving chase after her. While searching one of abandoned spare parts rooms for her, Grievous was informed that Skywalker had gone to rescue his astromech. He then had R3 go to the hangar and ensure that Skywalker would not escape. Hanging from the ceiling, Grievous found Tano and clamped a metal hand around the Padawan's throat, examining her fallen lightsaber with his free hand.\nBelieving he had won, Grievous taunted his prisoner, saying Skywalker would be next after he eliminated her. Despite Tano's claims that her Master would destroy Skytop Station, Grievous believed otherwise. However, Tano's beliefs proved true when the Republic squad detonated the explosives in the reactor room, crippling the listening post's repulsorlift systems. As the station shook from the impact, Tano managed to use her lightsaber to sever the hand clamped around her throat. Although Grievous attempted to slash her with one of his lightsabers, Tano retrieved her weapon and escaped through an air duct. Their objective complete and R2-D2 safely back with Skywalker, the Jedi made their escape. Grievous then retreated aboard the Soulless One as the station collapsed around him.\nWith the loss of the Malevolence, Grievous had been forced to command Munificent-class star frigates as his flag ships. This defeat brought a degree of satisfaction for the Neimoidian Viceroy Nute Gunray, who despised the General for receiving preferential treatment from Count Dooku. Eventually, Grievous decided he instead wanted the Providence-class Dreadnought Invisible Hand to fill the role of his flagship, demanding the vessel from Nute Gunray. Followed by Darth Sidious himself ordering Gunray to give Grievous the Invisible Hand. Gunray erupted with wrath but could not refuse. This was a terrible joy for the cyborg. The ship was indeed turned over to Grievous, who used it throughout the conflict in addition to other flagships. Like on the Malevolence before it, Grievous could command millions of droids from the bridge of the Invisible Hand. This ship would become known and feared throughout the war, posing a constant threat in key battles against the Republic.\nAt some point prior to the discovery of his lair by the Jedi, Jedi Master Neebo was on the moons of Sanjin. Neebo was attempting to protect refugees on the moons, but she was presumed missing. However, Jedi Master Kit Fisto and his former apprentice Nahdar Vebb later found her lightsaber among the trophies of the Jedi Grievous had murdered, and Vebb believed that what was in the room were trophies from the Jedi Grievous had killed. There were also rumors that Grievous once had a laboratory built on the moon of Gentes. During the war, Grievous ravaged the homeworld of a loathsome rascal named Ralakili, leaving the man with a hate for droids that culminated in him running droid fighting pits in the the Lodge on the planet Vandor.\nLater in the war, Grievous was instructed by his master to return to his fortress on the third moon of Vassek. After having lost a few campaigns, when the general fell short of Sith aspirations. When he arrived, he found that his MagnaGuards had been deactivated. Count Dooku, having laid a trap for the general in order to test his abilities, lured the Jedi and clones to Grievous's fortress into believing Nute Gunray was there even though he wasn't. With the Jedi having infiltrated the base and with his bodyguards deactivated, the Count had hoped to punish Grievous for his recent failures. In the fight that ensued, Grievous was damaged and his pet roggwart Gor, was killed. However, he was soon repaired by his droid EV-A4-D, and continued on his hunt for the Jedi. Grievous eventually caught up with them and dispatched the remaining clone forces. Grievous then engaged Padawan Nahdar Vebb in a fierce duel; due to his multiple limbs, Grievous easily killed Vebb with a dirty, but well-timed blaster shot. Fisto saw the duel and his former apprentice's death on video, along with Grievous threatening and intimidating him.\nThe cyborg General then went on to fight against Jedi Master Kit Fisto. After a lengthy duel in which Grievous's MagnaGuards arrived to assist him, Fisto fled aboard his ship and escaped the planet, making his way back to Coruscant, knowing the general's hideaway was. Shortly thereafter, Grievous contacted Dooku and told him that he had defeated the Jedi, but that Fisto had escaped. Dooku congratulated Grievous on his victory but stated that he could have done better and that there was still room for improvement. He paid a high and harsh price for failing the Sith.\nOn the orders of Grievous, EV-A4-D was recovered and reconstructed in no time, and continued to served the cyborg until the Clone Wars ended.\nAt some point after the Jedi infiltrated his lair, Grievous hunted two Jedi on Ledeve. He killed a Mikkian Jedi in the forest, collecting her lightsaber from her body, and tracked down her Padawan, waiting for him atop his T-6 shuttle. Grievous ignited all four blades and leaped at the apprentice, killing him. He obtained the boy's lightsaber, as well as a datapad revealing the location of the Jedi Temple. Pleased with his find, Grievous set out through the jungle to find the ancient structure, and this was repaying them for breaking into his home by entering theirs.\nGrievous scaled the temple and entered it, discovering a hallway of Jedi statues. Reminded of his own statues on Vassek, believing those to have been earned where the Jedi were not, Grievous reduced the statues to rubble before moving on. He evaded several traps set within the temple, climbing the ceiling to avoid a pit of lava and dodging spikes. He scrambled under other booby traps and eventually came to the central chamber. Believing the temple's secrets to be his, Grievous reached into a waterfall in an effort to obtain a shining sigil from within, but was unable to grasp it. Blaming a sensor error, Grievous kept trying to grab the image until he grew angry enough to fling himself into the raging water.\nThe general found himself floating in a strange, cosmic landscape, and was addressed by ephemeral voices that mocked his quest for knowledge and his own cybernetic upgrades. Grievous then was made to appear as he once was, in his original Kaleesh body, as the voices accused him of seeking to destroy a power he did not understand. Grievous felt his limbs detaching from his body, watching in shock as he was unmade, and was left as little more than a collection of bodily organs floating in the void, the voices still mocking him for being \"small.\" Grievous emerged from the waterfall unscathed, and attacked the flow with his blades, but was unable to cause any damage to the shining entity within. Disgusted, Grievous left the temple and sent its coordinates to a Providence-class Dreadnought in orbit. He ordered the ship to fire, and the ensuing laser strike obliterated the entire temple, leaving only a smoldering crater that Grievous observed until nightfall. Secure in the belief that he had burned the entity he encountered, Grievous departed—missing the sight of a glowing sigil amidst the devastation.\nLater in the war, Grievous led the blockade of Felucia, which became the site of a fierce battle that came close to ending in disaster for the Republic's forces under Skywalker, Kenobi, and Tano. Eventually, the Separatist Droid Army was able to push their forces off Felucia, securing the strategic planet. Prior to the Second Battle of Geonosis, Grievous used his fleet to attack and invade the planet Dorin to push the Republic out of Geonosis, but the forces led by Skywalker and Tano defeated Grievous's forces on Dorin, allowing them to soon join Ki-Adi-Mundi and Kenobi for the second invasion of Geonosis.\nAt some point during the war, General Grievous managed to ambush Jedi Master Eeth Koth's flagship near the planet Arda in the Outer Rim. Grievous boarded the vessel with a force of battle droids and confronted Koth on the ship's bridge, where he revealed he had been looking forward to meeting the Jedi Master. Koth noted that Grievous's reputation, that of a murderer and coward, preceded him, Grievous disagreed and asked whether it was murder to kill the Jedi before kicking Koth back. The two began a brief, but intense duel, and, after Koth managed to Force push Grievous into a viewport, the General's MagnaGuards shocked Koth. Attacked from Grievous in the front and from the MagnaGuards from behind, Koth was defeated. Grievous stole Koth's lightsaber but instead of killing the Jedi as he normally would have, decided to imprison him.\nGrievous then sent a message to the Jedi Council, showing himself torturing Koth and promising to kill the Jedi Master, as he knew that it would be painful to the other members of the Order. He promised he would hunt down and eliminate the remaining Jedi.\nUnbeknownst to Grievous however, Eeth Koth had managed to communicate a secret message to the Council through the use of hand signals, telling them that he and Grievous were stationed in the Saleucami system. In response to Grievous's threat, the Council sent a team of their best Jedi, Obi-Wan Kenobi, Anakin Skywalker, and Adi Gallia to rescue the Jedi Master. Once they arrived, Kenobi sought out and engaged Grievous in an effort to distract him, while Skywalker and Gallia snuck aboard Grievous' ship to rescue Koth. However Grievous, having earlier deduced that he was being tricked, had laid a trap for the Jedi. Nonetheless, his attempts to stop them were futile and Skywalker and Gallia were able to successfully rescue Koth. Meanwhile, Grievous had managed to gain the upper hand in his duel with Kenobi, but his Commando Droids on his ship had been overwhelmed by Skywalker and Gallia. Unfortunately, his Recusant-class light destroyer, which had served as his flagship in the battle that had broken out, was taking heavy fire from Skywalker's trio of Star Destroyers and was nearly destroyed. Forced to withdraw from his duel and flee, the general attempted to land on the planet of Saleucami in a Trade Federation landing ship. However, the craft malfunctioned, and Grievous and the droids were forced to evacuate into escape pods.\nHowever, Obi-Wan Kenobi followed Grievous to Saleucami in an attempt to capture the cyborg general. Grievous recognized that he and his squad of B1-series battle droids needed to escape before they were located, only to then see Kenobi's Acclamator-class assault ship overhead. One of Grievous's battle droids reported that their escape pod's transmitter was destroyed, making it impossible to contact the fleet as Grievous had ordered. When the B1 stated that there was only one surviving escape pod, Grievous responded that they needed to reach it as fast as possible, as its transmitter could still be functional, and ordered for his units to find him a form of transportation. With Grievous using a reek for transport through the underbrush and having appropriated several eopies to be their pack animals, Grievous and his droids moved towards the escape pod in the wetlands.\nHowever, the General did not allow for his battle droids to ride on creatures for transport, draining the B1's power cells. The droids verbally complained about their low power, to Grievous's clear annoyance, but Grievous continued their march despite being told about their situation. Eventually, a B1 brought their situation up once more, but Grievous responded by using his green lightsaber to cut down the unit. Now scared, two other B1s said they had no more complaints, and their march continued into the later hours of Saleucami's day. However, Kenobi and his forces, having performed a robolobotomy on a B1 found at the landing craft's crash site, were able to locate Grievous's initial pod. Kenobi deduced they were heading for another pod and spoke with the clone trooper CT-5597 \"Jesse.\" The Jedi General reported that Grievous was on the move and ordered for Jesse and his squad to move towards the final pod, so that way the Republic could have all their possible firepower when confronting Grievous. Kenobi and his forces then moved to the west to catch the cyborg general.\nElsewhere, Grievous was frustrated that they had not reached the pod. One of his B1s, which were now running very low on power, responded that they were nearly there, although the unit's low power caused it to mix the sentence's words into the wrong order. Another B1 was able to clarify they were only a kilometer away, but both these droids ran out of power and closed down. Grievous and his remaining droids did make it to the pod, but the incoming Republic forces had come close enough to get a visual. Grievous immediately asked a B1 if their transmitter was working, knocking the B1 to the ground after hearing the unit did not know and had yet to use it. Grievous ordered another B1, who was surprised that Grievous had reached them, to send a signal to the fleet, but this droid then told Grievous that multiple life-forms were closing in. After hearing this, Grievous ordered for the droids to take up battle positions. One B1 fired a missile directly at the All Terrain Tactical Enforcer Kenobi was riding on, but the Jedi Master was able to jump off before it was hit and charged forward with his clone soldiers. As the battle raged, Grievous questioned where his shuttle was, but his answer eventually came when a Sheathipede-class transport shuttle flew overhead, which the General was relieved to see.\nKenobi ordered for an AT-TE to take the shuttle down, but, during its second landing attempt, a clone gunner reported that the mass-driver cannon was overheated. Kenobi ran in stop Grievous himself, but, after a B1 alerted Grievous that the Jedi was behind him, Grievous was able to block Kenobi's lightsaber. Engaging in a brief duel, Kenobi was able to disarm Grievous of one of his lightsabers, but the cyborg kicked Kenobi away. Climbing to the top of the escape pod, Grievous told the shuttle's B1 pilots to not land, and instead he fired an ascension cable to the bottom of the starship. The shuttle was then able to fly away from the Republic Army, leaving Kenobi crestfallen. While Kenobi told Clone Commander Cody to tell their cruisers to stop the shuttle, General Grievous was ultimately able to escape and continue to serve in the war.\nThe success of the Eeth Koth rescue was overshadowed by the Jedi's disappointment at not having won a significant victory. After Grievous escaped from his Republic pursuers on Saleucami, he saw that the world would be a good outpost. As a result, he deployed a large Separatist force, which fought an enemy blockade of Saleucami, to the planet.\nDespite the failure of their first attempt, Grievous and Ventress planned to launch another invasion of Kamino. However, a transmission between the two was intercepted by the Galactic Republic, and as a result the 501st Legion was deployed to Kamino in preparation for the impending attack. As the two conferred before the battle, Grievous decided to start their initial assault on Tipoca City, home of the Republic's cloning facilities. As Grievous engaged the Republic blockade, Ventress, with her Trident-class assault ships and AQ-series battle droids, attacked the city. As Grievous personally led the surface attack to distract the opposing garrison, he saw that Clone soldiers were superior to his droids. After the initial struggle, Grievous managed to break through the blockade and land on the planet with the remainder of his forces. Grievous was determined not to let his rival commander take all the glory. Furthermore, there was Obi-Wan Kenobi to kill, his longtime foe.\nOnce there, he proceeded to speak with Ventress about their objectives: Grievous would assault the clone trooper barracks while Ventress would get a sample of Jango Fett's DNA. During the assault, Ventress managed to acquire the DNA sample but her escape was prevented by Skywalker, and in the ensuing fight the sample was lost. Elsewhere, Grievous was confronted by Kenobi and the two engaged in a heated battle until a Trident ship destroyed the pier they were fighting on. Grievous, thinking Kenobi had been killed in the explosion, made his escape aboard a flight pod. He then rescued Ventress from Skywalker and the clones. Both Separatist commanders failed in their tasks and were forced to flee. Clone production soon resumed, and the Separatists were confronting an ever-increasing number of clones for the rest of the war.\nDooku, at the behest of his master, ordered Grievous to arrange an attack on Coruscant. Grievous managed to accomplish this by assigning several infiltrator demolition droids disguised as cleaning droids. The demolition droids managed to sabotage Coruscant's Central power distribution grid, disabling power to the area while the Galactic Senate was voting on the Confederate–Republic peace initiative, effectively ending the initiative.\nAfter the Confederacy of the Independent Systems successfully forced the Republic forces off Felucia and established several outposts on the planet, their victory from the previous battle affected the Republic's war efforts and it would be weeks before they could mount another offensive. During the Second Battle of Felucia, Republic forces fought to reclaim the planet from the Separatists, General Skywalker and his Padawan Tano both had opportunities to redeem themselves, which they led the onslaught into enemy-held territory with a substantial force of clone troopers. Grievous sent reinforcements to one of his own checkpoints on Felucia, which was overseen by the T-series tactical droid TZ-33, in retribution for their advances in an effort to take control of the whole system. This included a fresh detachment of battle droids being deployed, which the Republic forces strategically targeted. However, the Republic captured the Separatist base in short order, gaining control of Felucia and the surrounding region.\nPrior to the Battle of Mon Cala, the Mon Calamari King, Yos Kolina, was assassinated under suspicious circumstances. Grievous' fleet had already seized control of much of the surrounding space, and the Republic dispatched Anakin Skywalker and Senator Padmé Amidala in an attempt to quell the tensions. In turn, the Separatists sent the bloodthirsty karkarodon warlord Riff Tamson to represent their interests.\nThe Trade Federation and later the Separatist army have long desired to take control on the planet following their humiliating defeat at the Battle of Naboo. This time, Count Dooku was in charge of the plan, with Grievous on his side. The planet Naboo had long been a prize for Dooku because of its connections to Palpatine as the head of the Republic.\nLater during the Clone Wars, Grievous suffered a defeat when he attempted to invade Naboo. Senator Amidala and Anakin Skywalker's involvement, unbeknownst to Grievous, disrupted Rish Loo's plans. Jar Jar Binks  met the Separatist leader and was horrified to discover it was General Grievous. Jar Jar distracted Grievous in a series of negotiations long enough for the Gungan Grand Army to shut down Grievous's invasion force, but the cyborg eventually lost patience. Pursuing a terrified Binks out of his shuttle, he was faced with his shut down forces and surrounded by the militiagungs, who were obviously afraid of his presence.\nGrievous killed several militiagungs, but General Roos Tarpals intervened and engaged him in a duel. Although he was mortally wounded by the cyborg, Tarpals allowed Grievous to pass through him, knowing that he had no chance against the Separatist General, and he gave himself as a sacrifice to get close enough to shock the cyborg with a close-range electropole thrust, which impaled Grievous through his chest. The attack shorted out the cyborg's internal systems, allowing nearby warriors to easily capture him when the Gungan Army bombard the injured general with energized projectiles and successfully captured him. Fortunately for Grievous, Dooku captured Skywalker and forced Padmé Amidala to agree to a prisoner exchange. But Grievous would soon have the opportunity to demonstrate that he was still helpful to his lords.\nFollowing his release, Grievous and his fleet, launched a surprise attack on a flagship commanded by Jedi Council member Adi Gallia traveling back to Coruscant from a mercy mission on Aleen. Grievous and his forces quickly boarded the ship and engaged the 91st Recon Corps. Grievous captured Gallia after a brief, but intense duel with the Council member. As a result of this act, Jedi Master Plo Koon planned a rescue mission and a group of Republic ships was immediately dispatched. Sometime later, the General attacked and destroyed a pirate ship for target practice. However, Grievous's ship was then boarded by Plo Koon and his forces, who rescued Gallia and forced Grievous to flee.\nAfter the failed assassination attempt on his life by his former apprentice Asajj Ventress, who had been aided by Mother Talzin and the Nightsisters from Dathomir, Dooku summoned Grievous. Dooku ordered him to attack Dathomir and wipe the Nightsisters out.\nGrievous then took a Separatist fleet to Dathomir and landed his forces on the planet. He had his Hyena-class Droid Bombers launch an airstrike on their village, before sending in his ground troops to attack them. Despite being severely outnumbered and outgunned, the Nightsisters were initially able to hold their ground. This prompted Grievous to deploy several of his Armored Assault Tanks, which escorted a lone Defoliator Deployment Tank in order to burn the forest, which successfully managed to drive the Nightsisters back. Unfortunately, Talzin had sought the assistance of Old Daka, the eldest of the Nightsisters, who used her magic to raise the Army of the Dead as reinforcements. With Ventress leading the charge, the Nightsisters pushed forward, destroying the Defoliator Tanks and fighting their way to the open field from where Grievous was commanding his troops. Both armies halted their positions opposite one another.\nVentress then challenged Grievous to a duel, proposing that if he won then Nightsisters would surrender to him, but if she won then Grievous and his army would leave Dathomir. The two then engaged in a fierce lightsaber duel and initially seemed equally matched, until Ventress severed one of Grievous' four mechanical arms and knocked him to the ground. Holding all the cards militarily, with no intention of honoring the result of the duel, and no longer entertained by the sport of it, Grievous ordered his battle droids to kill her. Ventress tried to fight them off, but was shot in her shoulder. As Grievous attempted to finish her off, a large wave of Nightsister zombies attacked him, with both armies once again engaging each other in combat. With the assistance of one of her fellow Nightsisters, Ventress was able to escape in the ensuing chaos.\nWhilst cutting down the attacking zombies, Grievous was contacted by Dooku, who was being magically attacked in a way similar to voodoo by Mother Talzin. Dooku ordered Grievous to follow the Nightsister magic to its source and kill Talzin before she could torture him to death. Grievous followed the green magic trail to the Nightsister village and a secret cave where both Talzin and Daka where performing their magic rituals, killing several Nightsisters on the way. Grievous then ordered one of his commando droids to create an entrance to the cave, where he violently murdered Daka, and prevented Talzin from further torturing Dooku, but had failed to kill Talzin in the end, who fled the battle. With Daka's death, all the arisen Nightsisters returned to the grave, leaving the rest outnumbered, and eventually massacred by Grievous' army. Unbeknownst to them however, Ventress had managed to survive the battle. Despite the efforts of Dooku and Grievous, whose intent was to eliminate the Nightsisters, they failed to achieve their goal.\nSometime after the battle, Dooku told Grievous that with the Nightsisters dead, there was no one to control the rogue Savage Opress, whose powers he felt growing, to which Grievous simply mocked Dooku's notion that Opress could pose a threat to them.\nHondo Ohnaka had previously held Count Dooku captive, and Dooku still had a grudge against the weequay. At that time, Grievous was overjoyed by Dooku's arrogant capture and the merciless treatment he received from Hondo Ohnaka's pirates. The General was later sent by Dooku to travel to the planet Florrum to overrun the pirates. In deep space, Grievous launched an all-out attack and then boarded Obi-Wan Kenobi's command ship without losing a single capital ship. He tore through the clone trooper ranks until he made his way to Kenobi, whom he proceeded to duel and overpower. However, Kenobi managed to escape and abandon his ship, but not before rigging it to self-destruct, forcing Grievous to retreat and abandon all the useful information in the ship's memory banks.\nSometime later, Grievous landed on Florrum with battle droids unloading row after row, unfolded and began to march in front of General Grievous, followed by super battle droids and droid commandos. He stalked out of his ship and took over pirate Captain Hondo Ohnaka's base in retaliation for Ohnaka's previous capture of Dooku. Grievous was soon informed that Ahsoka Tano, her fellow Jedi younglings, and a group of pirates had freed Ohnaka. He then ordered his tanks to level the prison section. As they were escaping, Grievous and STAPs pursued them and boarded their tank. Grievous then fought Tano and though she proved to be a much more formidable opponent than in their previous encounter, Grievous was still more than a match for her. As Ohnaka arrived in Slave I to save Ahsoka after a fierce duel, an exhausted Ahsoka jumps away from Grievous and lands on the Slave I's ramp. Hondo opened fire on Grievous, but was forced to retreat when Armored Assault Tanks arrived, leaving Grievous to laugh in victory. At some point afterwards, Grievous and his droids demolished the remains of Ohnaka's base and left Florrum.\nSometime later, Grievous sent an encoded transmission to other members of the Confederacy, but the transmission was also intercepted by the Jedi Council. However, Republic Intelligence was unable to break the new encryption technology used in the transmission, and the Republic feared this was leading to an upcoming major attack. In order to understand the transmission the Republic sent D-Squad, a group of Republic droids, to a Separatist dreadnought to retrieve an encryption module.\nNear the end of the war, a large Kyber Crystal was discovered. Torul Blom, the Governor of Pau City, began negotiations with Count Dooku. With the help of Sugi weapons dealer, he wanted to sell him the crystal. Grievous was sent by Dooku to acquire a massive kyber crystal from Sugi arms dealers led by Endente. The deal was to take place on the planet Utapau, with local Amani being used as bodyguards. At least two Magnaguards were present in the early days of the event, and more of them, as well as other droids, arrived later with Grievous. The Jedi Anakin Skywalker and Obi-Wan Kenobi learned of the arms deal when they came to the planet to investigate the mysterious death of Jedi Master Tu-Anh. They tracked down the crystal and stole it from those who were trafficking in it, but Grievous's forces were then able to claim it. They, however, continued their mission, following the crystal to the space above Utapau.\nThe pair of Jedi chased the ship carrying the crystal, but the pair themselves were being chased by Grievous in his fighter and several droid fighters. The crystal was brought to a Separatist supply ship, which the pair crashed their ship into the hyperdrive of. Choosing to do a \"number five special,\" they abandoned their craft in escape pods, but boarded the supply ship in different hangars. While Skywalker did not encounter resistance, only seeing one unarmed OOM pilot battle droid which he scared off, Kenobi was forced to deal with the crystal's droid escort. After Kenobi cut down several battle droids, Grievous and two vulture droids entered the hangar. Kenobi demanded that his nemesis surrender, and the two engaged in a brief duel, with Grievous quickly overpowering Kenobi, resulting in Obi-Wan's capture.\nWhile Grievous prepared an execution chamber for Kenobi, battle droids secured the crystal, with it eventually being taken to the ship's vault. Skywalker was able to eventually free Kenobi and the pair eventually reclaimed the crystal. The pair learned that the crystal could fire back energy, such as laser fire, which they used to fight their way to the hangar. When they had secured a ship, Obi-Wan made several AATs fire at the crystal, causing it to overload. While the crystal's explosion destroyed the ship, Grievous chased after the Jedi in his fighter. The pair ultimately escaped into hyperspace while the explosion grew, destroying the Separatist fleet above the planet, and Grievous was flung into space in his starfighter. With the destruction of the massive kyber crystal, he had once again failed to fulfill the tasks assigned by his ruthless superior.\nWithin months of the arms deal, the Confederacy launched an invasion of Utapau, which Grievous took part in, after deciding the planet could serve as a hiding place for the Separatist Council. During this invasion, the general's preferred vehicle was a TSMEU-6 personal wheel bike. Grievous refused to be opposed by the planet's ruling Utapaun Committee, he caused the MagnaGuard to kill all of their members, much to Tion Medon's horror. Grievous' demands forced the Port Administrator to submit, and a small Confederate base was established in his city. Before long, a massive modified core ship had taken over much of the city's Level 10, serving as the command center for the Separatist droids. Within the core ship that landed in Pau City churned out the battle droids required to keep the local population in line. Additionally, Grievous's invading forces had constructed command centers and self-replicating Techno Union factories.\nGrievous was later seen with Dooku on the Separatist capital planet of Raxus Secundus where Dooku was receiving the Raxian Humanitarian Award. Grievous was in charge of security, and he briefly fought Quinlan Vos, who was there on orders of the Jedi Council to kill Dooku. Vos ambushed the general and his droids to prevent them from assisting Dooku, who was under attack by Ventress, Vos' partner in the assassination. Grievous reaches for the two lightsabers at his waist, but Vos uses the Force to grab them. Grievous charged toward Vos, who predicted this, stepping aside and slicing off one of his hands at the wrist with his comlink still attached. Suddenly, Grievous spread all four arms wide, then charged. Vos met him halfway. As they clashed in midair, Grievous' momentum forced them back toward the wall. He clenched his right hands around Vos's throat and threw him hard, attempting to crash him onto the walkway's unforgiving stones. However, Grievous's mistake was letting him out of his grasp and Vos locked him in a chamber.\nAfter escaping the security center, Grievous attacked Ventress, but Vos kicked him, causing him to tumble over the railing but dragging Ventress down with him below the balcony. Grievous landed on top of her with his metallic foot pressing into her throat. Grievous then grabbed Ventress and threw her down to the level below. Despite surviving her fall, he brutally beat her; the earlier blow to the head should have killed her and knocked her out for at least a few seconds. Grievous leaped at Ventress, but was sent staggering backward by a kick she delivered with her bare foot, after she charged at him. He growled, clearly surprised, and was joined by his battle droids. Eventually, the assassination failed, and Vos was captured.\nAfter Zabrak Nightbrother Maul had escaped from Sidious, unknowingly falling into his plan to lure out and destroy Talzin, and was tracked to the Death Watch-controlled moon of Zanbar, Grievous was ordered by Dooku to hunt down Sidious' former apprentice. Dooku then ordered him to direct his entire droid fleet at Maul's recently formed crime syndicate—the Shadow Collective and ordered him to destroy his army and wound his pride, but not to kill him. This was in order for him to draw out Mother Talzin, Maul's mother and one of the most powerful beings in the galaxy. Grievous thought it foolish to keep Maul alive, but Dooku reminded Grievous that it was not wise to question the plans of Darth Sidious, and that he as Dooku's apprentice would carry out his orders to the fullest degree. Grievous then moved his fleet to Zanbar and launched several landing craft to destroy the Mandalorian warriors, starting off the Battle of Zanbar.\nBasing his calculation on their experience compared to the clones they normally fought, Grievous knew that the chances of his droid army gaining a victory in this battle were unlikely. Deploying his droids after telling them as such, Grievous watched the fighting unfold from a landing craft until he spotted Maul on the battlefield. After sending out four of his IG-100 MagnaGuards to weaken Maul, Grievous emerged from his ship and engaged at least one Mandalorian super commando in battle, easily killing him with his lightsabers. Maul disposed of the Magnaguards and turned his attention to the cyborg general and engaged Grievous in single combat. Neither Maul nor Grievous was able to gain the upper hand in the duel, but Grievous, per his orders, taunted Maul, telling him that the battle was lost.\nHowever, Maul had held several Gauntlet fighters in reserve and ordered them to drop firebombs onto the battlefield. This left both factions' resources almost depleted. Maul, realizing Zanbar was lost, fled into a Gauntlet fighter and retreated from Grievous. Grievous then contacted Count Dooku via hologram and informed him he had fulfilled his master's wishes; Maul was on the run. Dooku then congratulated Grievous. Maul now believed the Sith were out to destroy him and his Syndicate, but would not learn of their true intentions until it was too late. Grievous knew their goal was the witch Talzin, but did not understand what value Maul held for the Witch. Dooku told him all would be revealed as their plans unfolded.\nAfter leaving Zanbar, Dooku rendezvoused with Grievous, gathering the fleet after Separatist spies reported that Mandalorian warships were amassing on the planet of Ord Mantell, confirming Maul was in league with the Black Sun who controlled the planet. Grievous once again questioned the Dark Lord's obsession with destroying Mother Talzin; Dooku explained to Grievous that Talzin was an older and fouler creature than Grievous understood, and that she would have to be destroyed before she disrupted Darth Sidious' plans. Grievous' super tactical droid Tey-Zuka reported to the cyborg general that a lone transport shuttle had left Dathomir moments ago, with Ord Mantell being a possible destination. Dooku believed Talzin was aboard and ordered the fleet to move to Ord Mantell.\nSoon they arrived and Grievous ordered the fleet to begin bombarding the city from orbit. With the city now in ruins, the landing crafts began their assault. Grievous believed Maul's forces would soon be on the run but became suspicious when he realized he had not seen any Mandalorian warships. Tey-Zuka calculated that they had been destroyed before they could lift off but Grievous knew better—they were planning a sneak attack. The Gauntlet fighters appeared from behind Ord Mantell's moon, attacking the Separatist fleet. Grievous had been lured into a trap. Tey-Zuka reported a fighter had attached itself to the hull of Grievous' Providence-class Dreadnought—but before the droid could finish, Maul interrupted. He gave Grievous an ultimatum; either he shut down the battle droids that were killing his troops—or he would die.\nWith the General dismissing his threats, Maul then charged Grievous, tackling him into a transparisteel viewport. Dooku had also been captured as well. Maul contacted Sidious via hologram after traveling to Vizsla Keep 09, threatening to kill them both unless he met Mother Talzin's demands. Sidious refused, instead stating he had no further use for them. Maul decided not to kill them, but ordered Grievous to the brig. Grievous told Dooku that it would be unfortunate if the next time they met he would have to add Dooku's lightsaber to his collection.\nDooku, who was still on the bridge of the ship, later used the Force to unlock Grievous' cell. Grievous escaped, killing the Mandalorians that were guarding him and several more while searching for a way off the ship. He soon found an escape pod, ejecting from the carrier and escaping from Maul.\nShortly afterward, Grievous regrouped with Darth Sidious aboard the Scimitar; which was originally Maul's personal starship; and they made their way to Dathomir where Dooku's signals were emanating from; just as Sidious predicted. Sidious ordered Grievous to cloak the ship from view and make their way to Dathomir's surface. They landed and the pair approached a chamber said to hold a stone column that was the heart of Mother Talzin's power. The chamber was located very near the Nightbrother village where Maul was born.\nGrievous blew an opening in the wall of the chamber, entered and stated he was about to kill Maul. Sidious followed, stating only the Dark Lord's plan shall rule the galaxy. Dooku appeared, though he was now possessed by Talzin, who at the time was still unable to take physical form. The four engaged in lightsaber combat; Grievous attacked Maul while Sidious freed his apprentice from Talzin with the use of Force lightning. Talzin returned in the flesh while Sidious told her she was going to die here. Maul took advantage of this distraction and used the Force to shove Grievous through the opening the explosion had created. Sidious attacked Talzin with a Force lightning barrage while Talzin defended Maul and herself with magick. Despite drawing strength from her son, she was unable to withstand the combined power of Darth Sidious and Count Dooku. Grievous reentered the chamber calmly striding towards the now beaten Talzin; Grievous then ignited his lightsabers and plunged them through the witch's chest. The magicks rush out of her body once and for all. The retreating Maul looked on in horror as Talzin's body turned to stone.\nAs the Droid Army attacked the nearby Nightbrother village, Darth Sidious took a moment to congratulate Dooku and Grievous; Maul's future had been erased while theirs was more certain than it had ever been. At some point following these events, the Confederacy launched an effort to retake the planet Christophsis as revenge for its previous defeat. Because of how personal winning the planet was to Dooku, Ventress suspected that Grievous would be involved in the battle. Having allied with the Jedi and the rescued Quinlan Vos to try and kill Dooku again, she informed the Jedi Council of such, but their efforts ended in failure when Dooku escaped and Ventress, acting to save Vos, was killed. Grievous rescued Dooku, but Vos had redeemed himself.\nGrievous fought Jedi General Depa Billaba on Haruun Kal. There his troops decimated her clone troops, while he personally engaged the Jedi Master in a duel and almost ended her life. Six months after his victory over Billaba, later, between the conversations of Rackham Sear and Kleeve, Sear discussed his plan with Kleeve. Sear suggested attacking the temple on Coruscant by destroying the main tower as a symbol of resistance to the Order. Even though the Kage captain had been properly prepared and the bounty hunter, Cad Bane, had provided them with the building plan, Kleeve first opposed it because it was a suicide mission, but Grievous interrupted, noting that the Kage warrior was a patriot, and believing that the benefits from this mission would outweigh its cost.\nHe and General Kleeve then sent in their top explosives expert, Captain Rackham Sear to carry out a bombing on the Jedi Temple. After Captain Sear's mission failure, Grievous then went to Kardoa with Kleeve and Sear's brother, Colonel Coburn Sear. There, Grievous saw Billaba leading the Republic forces. Grievous then demanded that she must die. However, Kleeve saw his obsession with killing Jedi as a distraction and warned against attacking before he left for Kaller. Grievous left as well for Mygeeto. However, he left Colonel Sear to deal with Billaba and her forces.\nGrievous then waited for Billaba and her forces to come to Mygeeto. There, he and Colonel Sear confronted Billaba and her apprentice, Caleb Dume. The General was able to duel her again during the Third Battle of Mygeeto and after having one of his hands cut off by Billaba, was able to get the upper hand in the fight and slashed her with one of his lightsabers, seriously wounding her. Despite this, she continued fighting Grievous; however, he was forced to flee when Billaba's clone troopers surrounded him. He told her that he regretted letting her live.\nUltimately, the Republic held all the momentum for the third year of the war. Despite Grievous's successes on Dathomir, Florrum, and elsewhere, the Confederacy of Independent Systems was driven out of both the Core and Midrim worlds and were pushed to the Outer Rim Territories, and, in the campaign known as the Outer Rim Sieges, to blockade several key Separatist worlds, the Republic Military kept up the pressure. The Separatists were prevented from directly attacking the capital by Republic keeping the Nexus Route coordinates secure and was unable to use the Hydian Way to cut through the Republic's Core Worlds to reinforce worlds throughout the galaxy, and the Hutts controlled the more circuitous Triellus Trade Route, which prevented them from moving troops and supplies between their Spinward and trailing territories. This makes the Separatists particularly vulnerable to the Republic's coordinated series of sieges and drains the Separatist Council's fighting spirit.\nA significant victory was required to weaken the Republic's resolve and the intensity of its assaults. However, it seemed that the CIS could recover and emerge victorious when Count Dooku informed Grievous with the news that he was expecting. Darth Sidious handed these coordinates to Grievous' fleet, along with a plan to kidnap the Supreme Chancellor of the Republic, to leap directly from the Outer Rim to Coruscant. Towards the end of the war, a Separatist surrender seemed as though it would come in due time, but the sieges also encompassed when Grievous launched a massive offensive, pushing the Republic to the brink. The Jedi Council has sent its Generals, far from the Core Worlds, to support the beleaguered clones in reaction to this overwhelming attack.\nGathering his forces for an attack on the Core's heart, Grievous thought that such an attack will cause the recall of Republic forces participating in the Outer Rim Sieges, therefore removing or at least rendering the blockades permeable. It was a risky gamble that, if successful, could signal the end of the conflict. At one point during the sieges, Grievous was aboard the bridge of a starship. During the sieges, Grievous attempted to take control of the shipyards on the planet Anaxes, where the Republic owned a number of important shipyards. Grievous's desire led to a bloody battle. Additionally, Grievous played a decisive role in the outbreak of conflict between the Wookiees and the CIS. For the Separatists, Kachirho was a key place because it was simple to defend while also being an excellent landing strip for droids. Grievous, however, was primarily interested in the Claatuvac Guild Archives, which contained a large number of unknown space roads.\nInitially, the Wookiees attempted to remain neutral in the conflict, but the importance of the planet compelled both sides to enter into a series of negotiations with the royal families of Kashyyyk to tru and persuade them to join their cause. However, Grievous became impatient of waiting for a decision favorable to his interests and ordered to prepare a large-scale attack, thinking that the threat would \"persuade\" the Wookiees to accept the conditions posed by Count Dooku and his allies. The invasion began with a failed attack on Kachirho's refinery. At the same time, the Wookiees Chieftain Tarfful was captured by Trandoshans in an Independent mission. However, his decision turned out to be a serious mistake. The Wookiees responded furiously and declared all-out war on the forces that threatened to invade them, kicking off the Battle of Kashyyyk.\nWith the Republic Military busy with the Outer Rim Sieges raging across the galaxy's spiral arms, Coruscant was left with fewer defenses. With Republic strategists unworried, Sidious arranged for Grievous to launch a massive assault to capture his own alter ego, Supreme Chancellor Sheev Palpatine. Grievous, however, was entirely unaware of Palpatine's real identity. Dooku had previously relocated his command post to Grievous' flagship, the Invisible Hand, allwoing him to be close to Grievous and ensure he followed his orders. Although Grievous posed no threat to the Sith Master, Sidious did not want any setbacks to his plans. The Coruscant Home Defense Fleet was caught off guard, and, with the chaos and Confederacy navy providing cover, Grievous and a strike team could land on Coruscant's surface. In space, Droid tri-fighters quickly decimated Republic ARC-170 fighter squadrons, while droid fighters flying to the battle on the surface supported the battle droids with their passes, spraying enemies on the ground with fire, immobilizing Jedi Masters Yoda and Mace Windu long enough for Grievous to act.\nDooku remained in orbit as Grievous took a large force of MagnaGuards with him to distract any Jedi during his escape. Grievous landed in the Executive District and then appeared in Palpatine's apartment, accompanied by his electrostaff-equipped MagnaGuards. Despite Shaak Ti and Corobb's best efforts to get Palpatine to safety, Grievous fought his way through the Jedi and great amount of security forces, killing Jedi Roron Corobb, whose lightsaber he claimed, during his hunt for Palpatine. He also incapacitated Ti using electrified cables and claimed her weapon as well. He then took the Chancellor aboard his flagship the Invisible Hand, leading him to the still-waiting Dooku in Communications tower, where Dooku took charge of keeping Palpatine captive. Grievous was also warned by Dooku that the Jedi would stage a rescue mission. Grievous had already captured Palpatine and returned to his flagship by the time the Coruscant Home Fleet had finally established assault positions.\nBefore Grievous could escape into hyperspace with the captured Chancellor, Republic reinforcements arrived into the battle with the Invisible Hand as their main target. While the Home Fleet moved to prevent Grievous from reaching a jump point from which the Separatist leaders could escape, thus keeping the Invisible Hands in the midst of the battle, a rescue squad under Kenobi and Skywalker, who had rushed to Coruscant from the planet Yerbana upon learning of Grievous's attack, raced to board the Inivisible Hand while Commander Honor Salima of the Home Fleet rallied her vessels to stop the Separatists from escaping or disengaging. Amid the slugging match that the battle devolved into, Kenobi, Skywalker, and Clone Flight Squad Seven raced forward despite squadrons of droid fighters confronting them, resulting in many of the clone pilots being shot down. However, the two Jedi managed to board the Invisible Hand and race toward its Conning tower to save Palpatine. Upon returning to the bridge, Grievous was informed of the Jedi incursion by his Neimoidian captain, but the cyborg merely laughed at how Dooku's prediction had come true.\nFighting past the battle droids who tried to stop them, the two Jedi make it to Palpatine and were confronted by Dooku, whose presence proved to be fortunate for the Republic; the two clashed with Dooku until Skywalker bested the Separatist Head of State and killed on Palpatine's orders. His death was a major blow to the CIS. Meanwhile, the Invisible Hand was surrounded by Home Fleet Strike Group Five under by Lorth Needa, who demanded its surrender. Needa did not believe Grievous's claims that Palpatine was a prisoner on board. Although he gave the cyborg ten minutes to prove himself before his ships opened fire, Grievous did not surrender. Informed by one of his OOM pilots that they had located the Jedi in Hallway 328, Grievous had them trapped within a ray shield and escorted to the birdge by droids. Still unaware that Dooku had been killed, Grievous was overjoyed to have captured his old adversary Kenobi and finaly meet the legendary Skywalker.\nThe general was already overjoyed at his victory and control over the entire fleet when he was briefly distracted by Skywalker's droid R2-D2. Using that, the Jedi broke free of their bonds and destroyed IG-101 and IG-102, leaving them free to corner Grievous. Realizing that the odds were stacked against him, the general declared that Kenobi had lost and shattered the front window of the cruiser with an electrostaff. Kenobi, Skywalker and the Chancellor managed to stay in the ship, but Grievous was sucked into space. Using a grappling hook built into his arm and his clawed feet to latch onto the hull of the ship, Grievous made his way back onboard to reach the escape pods. After ejecting the rest to trap the Jedi and the Chancellor inside, Grievous escaped in an escape pod of his own. As it had been for months, Soulless One was still docked on a small landing platform on Utapau. Grievous had thus been unable to use his personal starfighter during the battle, which ended up working in his favor because he would have lost it with the Invisible Hand. The Grievous's escape pod was found by the Lucrehulk-class Battleship Profusion. With Palpatine out of his grasp, Grievous ordered the fleet to retreat before he escaped into the Outer Rim.\nWith a full third of the Separatist fleet used in the battle over Coruscant having suffered major damages and failures, much of the navy was decimated and could not follow Grievous to safety. Despite Dooku's death also marking a major blow to the Separatist cause, Grievous succeeded him as Head of State and rose in rank to lead the entire Separatist Alliance, leaving him with complete control over Separatist forces. Despite the usefulness of such a promotion, Grievous remained subservant to Sidious. After the Jedi successfully foiled the kidnapping, Grievous launched a desperate and brutal counterattack across numerous star systems. Despite being used in that campaign, the legions of battle droids Grievous could command were severely depleted.\nIn the final weeks of the Clone Wars, Grievous boarded his personal Sheathipede-class transport shuttle, bringing with him an occupying force headed for the secured planet of Utapau in the Outer Rim, where the Executive Separatist Council was hiding. Grievous himself despised the planet after his failure to acquire a kyber crystal thanks to Skywalker and Kenobi. However, Grievous had returned to the planet at the head of a contingent, deriving some satisfaction in taking the Pau'un leaders' prisoner and beginning to transform their capital into a droid factory. On the tenth level, Grievous and his droid forces docked their Separatist ship. Under the direct order of Dooku's Master, Darth Sidious, Grievous was to relocate the Council to the planet Mustafar. Sidious also told him to remain on Utapau until he had recruited a new apprentice to join their cause. Grievous failed to realize he was being tricked again.\nIn the days after the Battle of Coruscant, the Republic received word that Grievous was hiding on Utapau, with Sidious, under his alter-ego of Chancellor Palpatine, claiming to Skywalker that Clone Intelligence located the general. With the war coming to its close, Sidious no longer needed Grievous as his pawn, as the cyborg had played his role; all of Grievous's campaigns had served to distract the Jedi Order from learning of the Sith conspiracy unfolding around them on Coruscant. Although Palpatine advised the Jedi Council to send Skywalker to challenge Grievous, they felt a Jedi Master was needed to finally defeat the cyborg warrior, so Kenobi was sent to confront him. With the recent death of Count Dooku, the presence of the Separatist Council on Utapau, and significant victories over the Separatists gave the task a new sense of urgency. Capturing General Grievous was now perhaps a real chance to put an end to the Clone Wars once and for all. However, it wasn't the first time Jedi General Obi-Wan Kenobi had been tasked with capturing Grievous. Kenobi would need reinforcements for the mission, he joined with his Republic troops led by Commander Cody to help him.\nUpon his arrival on Utapau, when meeting Tion Medon, Port Administrator of Pau City who initially assured him that all was well. But was told in whispered that General Grievous was here, they are being held hostage and Grievous is a force to be reckoned with. Midon requested for General Kenobi and his army for help in freeing the people of Utapau from the Separatist occupation. After learning the cyborg was based on Level 10, Kenobi watched as Grievous spoke to the Separatist Council, and though Nute Gunray doubted Grievous' ability to keep them safe, they followed his orders and left just moments before Kenobi would jump down to Grievous. It was a momentary inconvenience to have to order Nute Gunray and the Council to go to Mustafar, though he took some pleasure in confirming the Neimoidian' weakness. In a move unknown to the General, Sidious had warned the Republic of his presence on Utapau: Grievous was now an obstacle to completing his plans.\nKenobi jumped down from a bar above and greeted Grievous, who applauded his audacity before ordering his bodyguards to kill the Jedi Master. After Kenobi handily defeated Grievous' bodyguards, the droid army prepared to open fire. However, Grievous ordered them to back away as he decided to engage Kenobi himself, eager to kill Kenobi himself in revenge from the last time they have fought, as well as to prove he was worthy of Sidious. He immediately split his arms in four and engaged the Jedi Master in one last duel. But the injuries to his left side had not yet been treated and, as a consequence to either his negligence or a lack of spare parts, he was unable to fight as well as he used to. The two had fought before, and both were aware of their opponent's ability; it would not be an easy fight.\nThe Jedi and cyborg engaged briefly along a walkway suspended above the hanger's lower levels. Kenobi, who had learnt a thing or two from his multiple duels, predicted Grievous' blows, limiting Grievous to walking down the catwalk, allowing him to neutralize Grievous' usual fighting style. After a few encounters with the cyborg and getting used to Grievous's movements, soon, one of Grievous's clawed mechanical hands fell to the deck along with the lightsaber he held. Furious, Grievous launched a wild attack, but he had lost focus. As a result, Grievous lost another hand and weapon a few seconds later to Kenobi before Cody and the 212th arrived, ambushing the droid army. Fighting broke out all over Pau City between droid and clone forces. Grievous continued to threaten Kenobi, but Kenobi ended the initial duel with a tremendous Force push that disarmed the general. Dazed and unarmed, Grievous crawled towards his speeders like a spider.\n\nPursued by Kenobi on a varactyl named Boga, after a prolonged chase and running duel, the two soon crashed onto Grievous' private landing platform, where the Soulless One was docked. Obi-Wan recovered quickly and took the electrostaff. He disarmed him again by swinging Grievous's blaster away as he landed several hits on him, knocking him down and thrust the moose into his abdomen, but the cyborg managed to kick Kenobi. Despite that, he once boasted to Kenobi that he would never arm his bodyguard with a weapon that could harm him.\nUnarmed, the opponents engaged in bare-handed combat; suddenly Obi-Wan was at a disadvantage, and was nearly beaten. However, Kenobi managed to rip open Grievous' chest plates, revealing Grievous' gut-sack. Alarmed, the cyborg tossed Kenobi aside. Grievous laughed as he approached Obi-Wan, wounded but far from defeated. The Jedi attempted to kick him in the leg, but he was almost able to break his shin. Grievous laughed even harder and flung Obi-Wan off the platform, but the Jedi manipulated his position via Force and caught hold of the edge. Grievous saw his moment coming, and would finally kill his greatest enemy. He charged Kenobi with an electrostaff, preparing to finish off his old adversary with the killing blow. However, Kenobi used the Force to summon Grievous' blaster, shooting Grievous five times in his exposed gut-sack and making the cyborg scream in pain as his remaining biological components ignited. The shots incinerated the cyborg general from the inside burning the fluid that protects his surviving organs, finally destroying him and leaving his empty shell to fall to the ground.\nAfter years of seemingly unstoppable terror, the general's reign of terror and murderous streak came to an end, ultimately eliminating the threat. With Grievous's death, the conflict that had claimed countless lives appeared to be coming to an end. On other battlefields, Jedi generals felt victory was at their fingertips. All that remained of Grievous was the lifeless shell that was his cyborg remains; the so-called improvements he had sacrificed so much of himself to have were left on the ground by Kenobi, who walked to the empty shell and threw down the blaster, sparing his rival one more look before returning to the battle.\nIronically for Grievous, his wish to see a galaxy devoid of the Jedi Order was all but fulfilled, but only after his death; a short time after Grievous's demise, Sidious, using his alter ego of Chancellor Palpatine, ordered the clone troopers across the galaxy to execute Order 66, turning the soldiers against their own generals. Escaping from his clone troopers, Kenobi survived and fled Utapau aboard the Soulless One, running past the remains of his cyborg rival one final time but sparing Grievous no glance. Once he was defeated, Darth Sidious was able to step up and claim credit for the Separatists' loss. After 100 years, the Sith were able reclaim control of the galaxy. With the Jedi all but destroyed, Sidious transformed the Republic into the First Galactic Empire and had also managed to turn Anakin Skywalker to the dark side of the Force, making him the Sith Lord Darth Vader.\nFollowing the success of Order 66, the Imperial Inquisitors, or simply Inquisitors, were a small and mysterious group of Force-sensitive Jedi hunters recruited by Darth Sidious and trained by Darth Vader, led by a former Jedi Temple guard, the Grand Inquisitor. In a very different way than General Grievous had, the Brothers and Sisters of the Order of Inquisitors, stripped of their identities and assigned numbers corresponding to their enlistment orders, perverted what the Jedi stood for. Similar how the cyborg General's hand could spin while wielding a weapon, the red blades of the Inquisitorius lightsabers could rotate while the hilt remained stationary in relation, creating a deadly circle of light.\nSometime between 19 BBY and 3 BBY, Maul traveled to Damanos, an ash-gray planet, in search of a Sith castle. While in the castle, Maul experienced a vision of Grievous, who approached him and recalled the last time they had met, when he had killed his precious mother while he watched. Grievous taunts him about how his sworn enemy, Kenobi, stole his vengeance from him, further asking if it brought him any comfort or peace knowing that the person who killed his mother was dead. The two engaged in a duel in which Maul cut off two of Grievous's hands and then the other. However, one of his mechanical legs kicked out, catching Maul off guard, driving him into his chest and knocking him back. Then he continued to torment Maul, asking him about his mother, brother, and how his master abandoned him when he fell. How he never leaves those behind. Despite how powerful Maul's attacks are, Grievous continues to defend himself and never makes an attack. Ultimately, Grievous was destroyed, just as Maul dreamed for so long by thrusting his blade into him, as he had done to his mother on Dathomir. Maul had defeated his enemy, but he was still gripped by the same rage that Grievous, or the spectre in his form, had foretold.\nBy 14 BBY, five years after the Empire took power, it was rumored that Vader was a counterpart to Grievous that Palpatine had been holding in reserve. Also during that year, Moff Wilhuff Tarkin returned to Coruscant to meet with Emperor Palpatine. While in the Imperial Palace, Rear Admiral Nils Tenant reunited with Tarkin and asked if he had been in the Western Reaches. Tarkin, who had actually been stationed at Sentinel Base as part of Project Stardust, claimed he had and was still hunting Grievous's former allies. Over the succeeding years and decades after the entire Nightsisters were wiped out, those who had survived waited for the right moment to avenge their fallen sisters. However, the survivors were unaware that the armored being wielding a lightsaber was General Grievous himself. In the aftermath of Order 66, fallen Jedi Taron Malicos lied to the Nightsister Merrin about Grievous' massacre of the Nightsisters in an attempt to manipulate her into teaching him magick. Malicos claimed that the Jedi had been the ones who ordered the massacre. It wasn't until five years after Order 66 that Merrin learned the truth from Cal Kestis. Another survivor of Grievous's massacre, Deathstick, daughter of Shelish, has carried the weight of knowing that she once belonged to something larger than herself, and it was taken away.\nYears after Grievous' death, an Imperial researcher named Cylo began working on the creation of cybernetically-enhanced individuals; these individuals were designed to be possible replacements for Darth Vader as the Emperor's apprentice. One such individual, Karbin, had a cybernetic body installed by Doctor Cylo, who claimed to have been inspired by the body of Grievous.\nSome time after the Battle of Endor, Temmin Wexley implied that he had downloaded some of Grievous' old programming into Mister Bones, his robotic B1 battle droid bodyguard. Wexley had indeed added Grievous's programming to his B1, though he did not fully appreciate who the deadly cyborg had been despite his programming being the most significant of the \"moves\" he added. Among Bones' memories was one of wielding four lightsabers with four hands and the blades spinning, like how Grievous had once dueled.\nBetween 31 and 32 ABY, while on their way to learn more about the long-dead Jedi and their history, Karr Nuq Sin, RZ-7, and Maize Raynshi made their first stop at Utapau. Nuq Sin recalled learning about the planet where Grievous was killed, effectively ending the war, at a school on the desert planet Merokia.\nFor all the suffering he had spread throughout the galaxy, Grievous was held in high regard by at least one Kaleesh; during his travels across the galaxy, an artist met the Kaleesh, who bragged about Grievous, though not by name. The artist wrote down in his journal that he was told about a revered warrior who supposedly had cybernetic upgrades for combat. When the artist's notes were published by the Graf Archive at some point after the Battle of Oetchi in 34 ABY, they were accompanied by information on Grievous and the Kaleesh.\nAt some point, the owner of the store, Dok-Ondar's Den of Antiquities, a Ithorian collector named Dok-Ondar, came into possession of the Kaleesh mask and the cloak which he wore as a cyborg displayed in his shop.\nHalf century after the Kaleesh warlord gained galactic infamy for his role leading the Separatist droid army, Grievous was referenced in several works stemming from the planet Batuu, including a toy of the cyborg general that was sold at Black Spire Outpost on the planet. After the Battle of Crait in 34 ABY, Grievous's old enemy Hondo Ohnaka featured Coruscant in his book Galactic Explorer's Guide and, due to his role in the Battle of Coruscant, included Grievous in the \"Rogue's Gallery\" section for the planet.\nA Kaleesh warlord who stood at 2.16 meters in height, Grievous, born as Qymaen jai Sheelal, possessed red colored skin and slit-pupiled golden eyes, as well as an elongated facial structure with slitted nostrils alongside a series of four spiky growths which protruded from his chin. Often donned with a Kaleesh mask sculpted from the skull a Mumuu, a hostile predator native to his homeworld of Kalee, Grievous wore the mask throughout the duration of his people's war with the Huk. With a desire to become the leader of the largest and greatest military force within the entire galaxy, as well as possess the capability to combat Jedi, whom he had perceived as nearly invincible as a result of their powerful connection to the Force, the Kaleesh also aspired to become a great warrior and gained the reputation of an infamous warlord who developed vast numbers of enemies.\nWhen transformed into a reconstructed cybernetic warrior following a gruesome shuttle crash, Grievous's brain was altered by Separatist engineers without conscience by the Kaleesh, which resulted in an increase in intelligence, agility and strength, as well as a deep and violent disposition for the Jedi following the false revelation by Count Dooku that the Jedi were responsible for his condition. As a result, Grievous was tall, and his metal-plate body resembled the form of a mechanical skeleton, similar to armor but welded together with no room for flesh. In almost any meeting, it was a powerful presence that could intimidate others. With his cybernetic transformation, Grievous received claw-like feet, as well as a set of arms which were capable of separating themselves into an additional set, as well as a skull-like Kaleesh mask that had been specifically sculpted for his new body, from which his eyes peered through revealed his being's cyborg nature. Furthermore, located behind a set of duranium teeth crafted to mimick those of the Karabbac beast from his homeworld, Grievous's hoarse voice was emitted from an ultrasonic vocabulator.\nAlongside a hatred for political matters, Grievous had developed an understanding that his involvement in the Clone Wars was an opportunity to eliminate the Jedi Order and command the Separatist Droid Army, as opposed to serving Dooku's political ambitions. However, as a result of his preeminent desire to eradicate the Jedi, many within the Confederacy, such as General Kleeve, considered his personal goals as a distraction which prevented his successes in the war. The general himself had a deplorable lack of a sense of humor and considered killing them to be a form of enjoyment, but he was able to put his duties ahead of it. He was quite proud of his position within the Separatist organizations and told others to refer to him as \"general\". He was also referred to as \"My lord\" by members of the Confederacy military, such as Asajj Ventress and TV-94.\nGrievous was known for his cruelty and ruthlessness and was seen as the Separatists' best general. Given his reputation, Grievous was feared throughout the galaxy as a strategic genius and for his hunting prowess. After Count Dooku, the Republic viewed General Grievous as the second biggest threat in the war. The Republic described Grievous as a mechanical horror, which appealed to deep-seated droid anxieties. Nothing strike more terror into the hearts of Republic soldiers quite like General Grievous. He was a symbol of terror across the galaxy, flying from one disaster to the next, whether he was sending armies against entire worlds or facing foes in close-up and deadly combat. One of the most terrifying and formidable combatants throughout the conflict, he was both a strategic mind and a battlefield nightmare. According to legend, even the Jedi shuddered when his name was mentioned and feared meeting him in battle, as none could match his sheer relentlessness and determination.\nBehind Grievous' mask laid one of the shrewdest military strategists of the era — one who isn't afraid to retreat when the odds turn against him, his superiors admired his circumspect choices and shrewd tactical decisions. On even the safest postings, CIS's limited and unreliable resources have convinced him of the value of having a speedy and reliable exit strategy. Grievous views retreat as more of a setback than denying the Republic complete victory. The general favored quick retreats from battles if endangered and regularly avoided capture by Republic forces; always slipping away to fight another day, which frustrated Republic commanders who sought his capture or death. Grievous, Trench, and their fellow commanders were placed in charge of the broader campaign objectives. General Grievous' campaigns against the Galactic Republic threatened the very existence of the Jedi Order. The brutal strategy he learned as a warlord required the Jedi to command clone troopers, which are made through technological advances. Many of the Jedi Council recognized the dangers to the Order, but they were pressured by the next incursion or the next loss of a world to the cyborg Separatist Leader. Another outlined in the legend of the Battle of Alamass, Separatist leaders believed Grievous could be relied upon to complete critical missions, for his record was nearly unblemished and he was highly regarded for his tactical insight, which provided the Separatists with numerous victories.\nWhile Count Dooku dealt with matters of state, including military operations for the Confederacy of Independent System, General Grievous supervised the logistics and tactics of its vast droid armies. The general oversaw a large number of capable admirals and generals recruited from across the Galaxy. He could impose better control over his forces, thanks to the droid commanders who eliminated the unauthorized thoughts and suggestions from underlings with internal strategic prowess. Only a few brilliant sentients, such as Admiral Trench, managed to stay in charge of offensive operations. Grievous sometimes enlists Commerce Guild forces for combat on rocky worlds or in urban areas, while OC-9 homing spider droids serve as heavy armor and siege weaponry, and modified Spelunker probe droids offer reconnaissance and sabotage.\nCold, calculating, vain, and unconcerned with the rules of combat outlined by the Galactic Accord of Systems, his cruelty was not limited to the field of battle. Civilians and other non-combatants suffered, with Grievous devastating the populations of entire worlds. His tactic was to exploit the compassion of his foes, targeting civilians and forcing his opponents to priorities the protection of innocents. This left his troops to focus on victory at any cost. The General was aware of the Jedi's soft spot for innocents, but he did not care about civilian casualties and exploited the Jedi Compassion for the clone troopers under their command, as he expressed during the attack on the Kaliida medical station. He disliked being paired with other commanders and taking orders, as it insulted his abilities as a leader and warrior. Because the cyborg saw the big picture, Dooku found Grievous a successful leader, who carried out a high-handed strategy like using hidden listening posts to ambush Republic fleets and attempting to invade Kamino to stop clone production. He used his agile fleets to his advantage throughout the war, disrupting the Republic with attacks on planets such as Falleen and Dorin. Unable to calculate where the droid general would strike next, the Republic became distracted and left previously conquered worlds to fall under Separatist control.\nBeing in command of the largest droid army ever created, even when Grievous made mistakes his setbacks were often only temporary. He did suffer defeats, however, General Grievous and Asajj Ventress' failures were never serious enough to undermine Darth Sidious' plans, both agents needed to be reminded that they were not irreplaceable. Grievous' reputation of being a cunning wraith who dived in and out of conflicts silently and swiftly served as a valuable weapon in the armory of the Confederacy of Independent Systems, and his personal starfighter was an continuation of that reputation. He regularly commanded naval engagements from his flagship dreadnought, the Invisible Hand, but his combat experience and brutality shined in hand-to-hand combat. Leading an army of droids, he unleashed his full power as a cyborg general but preferred to fight from the front lines, and was often surrounded by IG-100 MagnaGuards. He crushed all, even Jedi, who came within his reach in a terrifying display of lightsaber prowess as well as the strength and resilience of his mechanical body.\nNot only was General Grievous a callously brilliant strategist, but his own skills as a warrior made him a deadly opponent in his own right. The General demonstrated that one need not be strong in the Force to threaten even the greatest Jedi in combat, Grievous believed himself to be a superior warrior to all Jedi, frequently sought to prove himself in combat, and believed that his mechanical limbs made him superior to all foes. He had little understanding of the Force, though he believed that the improvements made to his body gave him a greater power than that of the Jedi he hunted. He replaced this gap of knowledge with an appetite for destruction, especially of the power he did not truly comprehend. However, transforming his body into a fighting machine left Grievous' organic anatomy weak inside his armor.\nGrievous' hatred for the Jedi was well known throughout the galaxy and was stated by him on many occasions. A feared Jedi hunter, he was well known for his brutality and ruthlessness. He took macabre delight in defeating Jedi on the battlefield. However, he was also quick to run from a fight when the tide was turned against him, often scuttling away to safety using all four limbs. This tactic worked, until his final encounter with his nemesis, Jedi master Obi-Wan Kenobi, with whom Grievous shared a fierce rivalry. The Jedi considered such devious tactics to be cowardly, but Grievous held no such notions of honor. Though Mace Windu and the rest of the Council branded Grievous a coward, the truth was that he was a relentless and experienced enemy, who despite not being able use the Force, defeated numerous foes.\nGrievous also showed signs of being sadistic and was only in it for the slaughter, and for Jedi like Obi-Wan Kenobi, he would spare the lightsaber in favor of a torture device to make their deaths slow and painful. He couldn’t even resist to broadcast the torture by hologram to the Jedi just to hurt them mentally. The General had supreme confidence in his own abilities, and was often arrogant, believing himself to be untouchable. Grievous also insisted on fighting Jedi personally whenever possible, even when injured, which betrayed a sense of recklessness and restlessness in the cyborg general. This was shown by his refusal to heed EV-A4D's advice to recuperate after his first bout with Kit Fisto and his former apprentice Nahdar Vebb. He acted recklessly again when he fought Obi-Wan on Utapau, which proved to be his undoing.\nGrievous was a collector, who took pride in his growing collection of war trophies, which was made up of the lightsabers of his defeated foes and the braids of Padawans struck down before their knighting. He was said to have captured or killed dozens of Jedi, including Jedi Master Neebo and the recently knighted Nahdar Vebb. By the end of the Clone Wars, he had about a hundred lightsabers in his macabre collection, which he collected from Jedi who became his victims and reveled using them. The general challenged Jedi Generals in hopes of adding their lightsabers to his collection, Anakin and Obi-Wan managed to avoid being included to Grievous' list of victims.\nGrievous kept a gloomy trophy room in his hidden lair and carried many stolen lightsabers in the lining of his cape, sometimes attached to his waist. Although Grievous killed many Jedi during the Clone Wars, his greatest prizes were the lightsabers of Pablo-Jill, Eeth Koth, Roron Corobb, and Shaak Ti. Nahdar Vebb's lightsaber was briefly a part of his collection but was lost when Kit Fisto reclaim it. At one point, Grievous gained the lightsaber of Jedi Master Jmmaar.\nHis vicious streak extended beyond the Jedi, as he personally killed Gungan General Tarpal on Naboo after killing several Gungans and massacred the Nightsisters of Dathomir. There, he showed no mercy as he wiped out the majority of the clan of witches, including the clan's elder, Daka, effectively eliminating resistance to the massacre. However, Mother Talzin escapes, but Sidious corners her on Dathomir, and Grievous has the honor of definitively ending her life.\nDespite his actions in the war, Grievous was loyal to both of his masters, Count Dooku and Darth Sidious, who both frequently viewed him as nothing more than a useful tool that played an important part in their plan for the Clone Wars. While Grievous had minor clashes with Dooku, he held great respect for the Confederacy's leader, who assisted him in his training and whose orders he followed. He shared his master's confidence, such as when Dooku informed him of Savage Opress's growing power, to which Grievous simply laughed at the notion that Opress could pose a threat to them. When Dooku was captured by some common pirates, Grievous was overjoyed at the fallen Jedi's frustration. However, hubris in battle was always risky, which resulted in Grievous's surprising capture by Gungans. Following Dooku's captured by Maul to Dathomir, Grievous was trusted enough to be Darth Sidious' only backup for their final confrontation with Talzin and Maul.\nWhen Count Dooku died at the hands of Anakin Skywalker, the cyborg general did not mourn his death. Grievous vowed that he would never forgive Dooku for leading the Republic to his home on Vassek. In a meeting with Darth Sidious and other Separatists, General Grievous learned of a new and even more powerful \"apprentice\" but never learned of their identity. Grievous wanted to prove his worth to Sidious and was determined to be the one to kill Obi-Wan Kenobi in revenge for their previous duel. Grievous also valued loyalty and patriotism in others, one of whom was Kleeve and Rackham Sear. He even praises Gha Nachkt's work in extracting data from R2-D2 and was seemingly intent on following through on their bargain, at least until Nachkt tries to demand more money.\nGeneral Grievous and Asajj Ventress shared a deep rivalry, implied a constant dispute between them, which often caused them to work separately. Even though they were technically on the same side, this suited Count Dooku only too well and was very much the Sith way. Grievous and Ventress were constantly tested and challenged by Dooku, who in turn was ruthlessly tested by Sidious. Grievous seemed to hold a little respect for her, as he praised her on her style and noted that they could be equals, but Ventress dismissed the idea. However, the general openly declared himself that he had always been superior to her. The two did shared a similar trait: a dislike for battle droids. One of many Separatist commanders that have grown frustrated by the droids' limitations under their command. Both also shared a deep hatred for the Jedi for their own reasons; for Grievous, the Jedi interfered in his war against the Yam'rii and sided with them, leaving his people to starve. While Ventress's hatred for the Jedi began when they abandoned her master on Rattatak.\nGrievous had always disliked Nute Gunray, the Neimoidian Viceroy who led the Separatist Council, Gunray, in turn, despised Grievous for Count Dooku preferential treatment of the cyborg. He threatened to kill Gunray, when the Neimoidian was brave enough to publicly criticize the cyborg. Gor was one of the few creatures that Grievous cared for, displaying a certain affection for his cyborg pet and being dismayed upon learning of the creature's death, which became another reason for his hatred of the Jedi. He also developed a kind of bond with his medical droid EV-A4-D, though he yelled at him from time to time and humiliated him, he let him criticize him without tearing him apart. Grievous shared his secrets with his medical droid, one of the few entitles in the galaxy who knew Grievous's secrets. Whenever the general in battle, A4-D take care for his master's pet.\nDespite leading the Separatists' droid armies, Grievous also had a disdain for battle droids, especially B1 models, considering them weak, incompetent, and manufactured to perform a mission far beyond their abilities. He was not afraid to demonstrate his frustration through physical cruel punishment, and would not hesitate to destroy or abandon them in an instant. Legend claimed he was so willing to harm them because, in some ways, the droids reminded him of his own flaws. Grievous's weakness was that he did not understand how much better his enhanced cybernetic abilities were than the slower-minded droids under his command. This habit often caused Dooku to remind Grievous that the droids were expensive and that they were made to follow orders, not question them.\nAccording to the legend, Grievous could not see the similarities between himself and the droids he harassed, believing that his organic heart made him stronger and better than the droids he tried to think he was nothing like. He is often displeased with the droid army's failure to fulfill his exacting standards, distracting him just after they had suffered a humiliating defeat but the general had little regard for them and took pleasure in being the commander of the largest droid army the galaxy has ever seen. Given how much General Grievous despised battle droids, one can imagine how resistant his mechanized MagnaGuards were to their lord's high expectations. He outfitted them with Kaleesh cloaks and head wraps echoed the outfits worn by his companions as a tribute.\nGeneral Grievous resembled something from a nightmare caused by the spice, rather than something from reality. He was more machine than living creature, but the slitted eyes that peered through the white mask revealed a terrible malice and beneath Grievous' bonelike armor beats the heart of an evil warlord. Grievous, a cyborg who was incredibly powerful, reacted violently and felt humiliated if anyone mistaken him for a droid. Even so, Grievous recognized that his new form was frightening. Grievous has claimed that he underwent a complete body reconstruction in an effort to gain an advantage over Jedi and sensitive about his upgrades, claiming them to be \"improvements\" to the droid EV-A4-D. He would come to reflect on the life he had lost after being transformed into a murderous cyborg with one obsession: killing Jedi. Legend specified in order to enjoy the benefits of both organic and inorganic lifeforms, he believed he could be as strong and versatile as a droid, with all the cunning, passion, and capacity for emotion of an organic being.\nThe legend of the Battle of Alamass made further claims about Grievous's mental state; despite his military prowess, the general was still unhappy, for though he changed his body, he was not satisfied with his fate in life. In truth, he would never find peace or completion in the continued modification of his form, for deep down he sought escape, and no matter how much he might change what he was, he could never change who he was. The general, however, being a creature who was ruled by his heart, however, the general could never see that in himself. As a result, the general who would become a cyborg was a troubled soul, and he expressed his troubles by the only means he knew how-violence. Grievous became angrier and more vengeful he became, lashing out at anybody he thought was weak.\nThe pathological hatred he felt toward the Jedi, against whom he had sworn to exact a terrible vengeance for crimes against him and his people, caused Grievous to target Jedi one by one. After the catastrophic intervention of the Galactic Republic and Jedi in a conflict between his people and the Huk decades earlier, Grievous believed it is his duty to rid the galaxy of Jedi \"filth.\"\nAlthough devoid of a powerful connection to the Force, Grievous was a highly skilled warrior who was capable of proficiently wielding lightsabers in combat against his enemies as a result of the training received from Count Dooku. A master of several forms of lightsaber combat, Grievous was capable of quickly adapting to the fighting styles implemented by his opponents. Furthermore, due to the enhancements provided to him by his cybernetics, the Kaleesh often utilized and relied on his strength and agility during his encounters with Jedi.\nA skilled lightsaber combatant who specialized in the form known as Jar'Kai, which contributed to his personalized style of combat, Grievous utilized the advantage of his additional limbs during battle with others, which thereby allowed him to wield four lightsabers as a result and employ a personalized variation to overwhelm opponents. With three key elements: fear, surprise, and intimidation. One of the most significant elements in undermining an enemy's abilities is surprise. Throughout the duration of his time as a warrior, Grievous clashed blades with numerous Jedi, such as Jedi Master Obi-Wan Kenobi on several occasions throughout much of the Clone Wars, as well as Ahsoka Tano, the Padawan of Anakin Skywalker, whom he was able to quickly overpower in their first encounter by rendering her unconscious for several seconds after tossing her to the side during their aboard Skytop Station, where he utilized intimidation tactics, such as roaring, to discourage his opponent. However, while Tano had improved by the time of their second encounter on the planet Florrum, as she utilized the Force to gain an advantage, Grievous was once again able to overpower the Padawan through the implementation of his additional limbs and clawed feet.\nAccording to the Kaleesh himself, he was able to withstand assaults from strike teams of Jedi. Members of the Jedi Council struggled to challenge the Kaleesh cyborg, such as Eeth Koth; Grievous dueled Koth and was able to push him back, although he then used his MagnaGuards to subdue him. He dueled Kit Fisto despite being weakened from recent damages; Grievous's lightsaber skills were superior to the Jedi Master Kit Fisto and was able to at least held his own, even after having lost one hand until the MagnaGuards arrive and corner Fisto. Once, Grievous fought Master Adi Gallia in the middle of a firefight, defeating her and taking her as prisoner. When battling Obi-Wan Kenobi, they often fought to a stalemate or an interruption, on Caliban; onboard Grievous' superweapon battle cruiser, the Malevolence; aboard the cruiser Steadfast in the Saleucami system; on Kamino; and aboard Kenobi's command ship the Negotiator near Florrum.\nAlthough Grievous almost defeated Kenobi multiple times, Grievous successfully defeated him above Utapau, yet was later slain on that same planet by him. Their great battle to the death has become legendary. He fought Depa Billaba in at least two different duels; he severely injured Depa Billaba and nearly killed her in their first duel such that she fell into a coma for six months. In their second duel on Mygeeto, Billaba cut off two of his upper hands, although Grievous landed a glancing blow on her back. At some point, Grievous even confronted young Caleb Dume, the Padawan of Depa Billaba. During his mission to capture the Chancellor, Grievous dueled Shaak Ti; Ti managed to fight further, but Grievous managed to get the upper hand. He ensnared her with electrified cables, which knocked her unconscious.\nBeside the Jedi, he was also able to compete with opponents such as Asajj Ventress in two different duels; he first dueled her on Dathomir. Later, during the mission to assassinate Count Dooku, Grievous had tumbled over a railing while grabbing Ventress along with him. He landed on top of her with his foot pressing into her throat and grabbed Ventress with his four hands, throwing her down to the level beneath. Though Ventress managed to survive her fall, she was able to fight off Grievous. Earlier in that mission, he also fought Quinlan Vos; an unarmed Grievous overpowered an armed Vos, clashing in midair, knocking Vos back toward the wall. Initially, Vos snatch two lightsabers away from the general and then cut off one of Grievous's hand. Though Vos struggled, he locks him in a chamber. Grievous also encountered the former Sith Lord Maul, whom Grievous considered too dangerous to let live; in two separate duels to a stalemate, at least making the two equals.\nHe chose a very unorthodox style while contending with the Jedi, using his four arms to his advantage. While Grievous had no Force ability, he countered his lack of supernatural abilities with his upgraded cybernetics: his artificial limbs and cybernetic systems allowed the reflexes and agility that made him deadly to the Jedi whom he ran into. He could split his two arms into four, allowing him to wield four lightsabers at once. He also used his mechanical arms to rotate his lightsabers so rapidly that they became pinwheels of destructive energy. Most Jedi he came across were quick enough to avoid this strategy. He could also rotate his torso; when clones piled on top of him during the Battle of Saleucami, he used that ability to throw the troopers off him. Grievous was able to deflect a number of boomas from Gungans before being subdued by Tarpals, and he was able to deflect blaster bolts, even multiple ones, by whirling his lightsabers from two clones, Grey and Styles while Dume and Billaba surrounded him from behind. Even perfectly blocked a lightsaber strike from behind and in front.\nGrievous was very fast as he was able to use his cybernetics to crawl on the ground and make a quick escape if he needed to. Even after his legs were severed, the cyborg was able to escape since his limbs allowed him to climb onto the roof. He even dodged refracted beams from a giant kyber crystal after Obi-Wan had shot it several times, causing it to overload. Not only was he fast, but he also had enhanced strength as he utilized his four arms, and sometimes two arms in hand-to-hand combat, fighting with a unique style with his bare hands, being able to lift, throw, smash, and choke his opponents. He also uses his powerful magnetized claws to kick, grab, and throw his opponents, crushing them under his feet. His durasteel feet were magnetized and so sharp that they were effectively talons, allowing him to climb walls and ceilings with ease, even grab a weapon like an electrostaff, which he could then transfer to his hand. He was capable of lifting a varactyl off his body, and pushing his way through and crushing the armor and skulls of Mandalorian soldiers with his bare hands and feet.\nAside from his growing collection of stolen lightsabers, Grievous was willing to go to any length and use any weapon to win a battle. Sometimes, he would surprise his opponent by taking out one of his extra arms to subdue them. The General did this when he blocked Nahdar Vebb's lightsaber with his own while he grabbed a blaster with another arm, allowing him to shoot Vebb several times in the torso. Against Obi-Wan Kenobi, he used one of his arms to grab him and threw him to the ground, then attempted to crush him beneath his mechanical feet.\nGrievous was very durable due to his cybernetics, and could even resist explosions from fuel barrels, but his biological remains weren't. He could face even the most fearsome opponent without concern of pain or wounds because to the loss of nerve endings and easily destroyed limbs. He also didn't have to hold back his onslaught for fear of retaliation. Although he frequent took damage in battle, where he returned on occasion for repairs and medical examinations. The cyborg, unharmed by his injuries, could afford to lose a limb or two in battle, unlike most foes, which would only slow him down but not stop him.\nHe was unhurt from taking damage on different occasions; unhurt from being hit with the Force hard enough to fracture a ship's window, even unhurt from being tackled against the ship's window, but seemed to have little effect on him. He was still able to escape after being Force pushed into a ceiling and then falling down, although he did lose two lightsabers. Grievous took no damage after his speeder crashed into a herd of varactyls and later, he suffered no damage walking through Talzin's force field as it was bombarded with Force lightning by Sidious and Dooku. Grievous' mechanical body was equipped with duranium armor plating protecting his limbs, a torso made with durasteel, and a chest-plate cover for his internal organs, which would deflect blaster bolts. Grievous's mechanical body allowed him to operate in the vacuum of space and underwater for short periods without additional life support, he was also immune to poisons and toxins.\nGrievous was also a competent strategist as he used his massive army to overwhelm his opponents. He led a devastating campaign in the Outer Rim, crushing multiple legions and fleets along the way. In the Battle of Bothawui, he commanded his fleet through Bothawui's planetary ring using asteroids to his advantage, knowing that it would protect him from any surprise attacks. This tactic allowed Grievous to damage a Republic cruiser until his adversary Skywalker knew what he was planning to do. Grievous's threat was serious enough for the Council to dispatch a team of their best Jedi: Obi-Wan Kenobi, Anakin Skywalker and Adi Gallia, when he captured Eeth Koth and used him to mock the Jedi Council. He was able to correctly anticipate the Republic's movements during the Battle of Saleucami. Grievous aware that the clones were superior to his droids and was also able to fool the Republic forces during the Battle of Kamino, with his ships taking heavy casualties, but Obi-Wan Kenobi eventually identified his plan. Later, he led his ships to victory against Kenobi's and took over his flagship without losing a single capital ship. Kenobi was considered one of the Republic's best generals.\nHe can calculate with certainty, based on experience that the odds are against them at the Battle of Zanbar. Grievous’s army crushes Maul's Shadow Collective in two consecutive battles, even on the verge of victory at Ord Mantell. He was also able to recognize that Maul had yet to deploy warships during the Battle on Ord Mantell. Tey-Zuka calculated that the enemy ships had been destroyed, but then their dreadnought was hit, and Grievous recognized that they had been lured into a trap. He managed to lure Depa Billaba into a trap, cutting off her exits and surrounding her with droids on Mygeeto. He also had an advantage because he could directly command his battle droids with his two antennae built into his head and even access the system via comlinks built into his cybernetic systems, directing the Invisible Hand's defense.\nGrievous was not only skilled in lightsaber combat, as he also owned a custom DT-57 \"Annihilator\" blaster pistol called the \"Grievance Striker.\" He occasionally also use other weapons, such as the model of blaster pistol, DC-17, with which he slew Jedi Knight Nahdar Vebb. Grievous was equipped with grapple lines built into his wrist, which he could launch the line at a long distance to attach to things. The General gained a reputation as a talented flier and piloted a customized Belbullab-22 starfighter known as the Soulless One. He was skilled enough to avoid and escape Anakin Skywalker's starfighter.\nGrievous was developed for the 2005 movie Star Wars: Episode III Revenge of the Sith as a new villain on the side of the Confederacy. He was introduced in \"Chapter 20\" of the animated series Star Wars: Clone Wars, which aired over a year before the film's release, but his appearances in that series have been relegated to the Legends continuity. In Revenge of the Sith, actor Gary Oldman was originally cast to voice the character, but union complications forced Oldman to step away from the film. The actor was replaced by Matthew Wood, the film's supervising sound editor who would go on to voice Grievous in the 2008 animated series Star Wars: The Clone Wars.\nDuring the development of Revenge of the Sith, Grievous was created when it was clear that, with Dooku dying early in the film, the movie would need a new villain. Director George Lucas requested Lucasfilm's art department make a \"droid general,\" specifying that the character needed to be reminiscent of the Original trilogy's Darth Vader without being a copy of the famous Sith Lord. Lucas also noted to the crew that Grievous needed to clearly and visually be a cyborg, denying early designs that depicted his mask with robotic photoreceptors. Amongst the artists who made designs for Grievous were Derek Thompson, Erik Tiemens, Alex Jaeger, and Warren Fu; the latter was the man whose concept was made into Grievous, even thought it was only a quick sketch that he was not very impressed by. Lucas, meanwhile, was instantly impressed by the drawing.\nWhen interviewed The Star Wars Archives: Episodes I–III, 1999–2005, Wu stated Grievous's white coloration was created to be the opposite of Darth Vader's black suit, further noting that, within Chinese culture, the color of white represents death. Another one of Fu's concept drawings for Grievous was made into his IG-100 MagnaGuards. Grievous's design was finalized around the end of 2002, only six months before shooting for the movie began. Before Matthew Wood was cast in the role of Grievous, British actor Gary Oldman was offered Grievous' role. Oldman expressed excitement at joining the film and was slated to provide Grievous' voice at Skywalker Ranch during post-production of Revenge of the Sith, but it turned out that the film was being developed by filmmakers who weren't part of the Screen Actors Guild, of which Oldman is member from, leading Oldman to decline the role out of respect and solidarity to the Guild and to avoid violating the union's rules.\nDuring production, the crew found it hard to film the duel between Kenobi and Grievous when the cyborg warlord uses all four of his hands. After considering having one actor sit atop another or having one suspended from the ceiling to achieve the tall general's multiple armed attack run, it was decided to use two stunt performers, with one standing in front of the other, to achieve the scene, but it was decided this strategy did not work out. Their next idea was to have one performer learn both Grievous's above and below attacks, allowing the complete attack run to be assembled out of both passes in post-production. In the end, it was decided that Grievous should lose several of his hands quickly to make filming easier on the crew, explaining why Grievous only briefly uses all four of his limbs to duel in Revenge of the Sith.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Grievous",
  "/wiki/Grievous/Legends",
  "/wiki/Template:Cleanup",
  "/wiki/Template:Update",
  "/wiki/Brotherhood",
  "/wiki/Obi-Wan_3",
  "/wiki/Star_Wars_(2015)_15",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Star_Wars_Helmet_Collection_25",
  "/wiki/Talk:Grievous",
  "/wiki/Kalee",
  "/wiki/19_BBY",
  "/wiki/Utapau",
  "/wiki/Kaleesh",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Grievous%27s_family",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Confederacy_military",
  "/wiki/Dooku",
  "/wiki/Lightsaber_combat",
  "/wiki/IG-100_MagnaGuard",
  "/wiki/Reproduction",
  "/wiki/Warlord",
  "/wiki/Commanding_officer",
  "/wiki/Clone_Wars",
  "/wiki/Standard_year",
  "/wiki/Republic_Era",
  "/wiki/General",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Supreme_Martial_Commander_of_the_Separatist_Droid_Armies",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Cybernetics",
  "/wiki/Droid",
  "/wiki/Army",
  "/wiki/The_galaxy",
  "/wiki/Planet",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi_Order",
  "/wiki/Homeworld",
  "/wiki/Wild_Space",
  "/wiki/Kaleesh-Yam%27rii_war",
  "/wiki/Yam%27rii",
  "/wiki/Huk",
  "/wiki/Time",
  "/wiki/Star",
  "/wiki/Blood",
  "/wiki/Ear",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Sidious",
  "/wiki/Darth",
  "/wiki/Count_of_Serenno",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Cyborg",
  "/wiki/Sabotage_of_Grievous%27_shuttle",
  "/wiki/Grievous%27_shuttle",
  "/wiki/Death",
  "/wiki/Lightsaber_duel",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Commander",
  "/wiki/Jedi_hunter",
  "/wiki/Lightsaber",
  "/wiki/Weapon",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Standard_day",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Coruscant",
  "/wiki/Capital",
  "/wiki/Supreme_Chancellor",
  "/wiki/Flagship",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Invisible_Hand",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Mustafar",
  "/wiki/Battle_of_Utapau",
  "/wiki/Grievous%27s_mother",
  "/wiki/Grievous%27s_father",
  "/wiki/Huk_sector",
  "/wiki/Slavery",
  "/wiki/Insect",
  "/wiki/Species",
  "/wiki/Star_system",
  "/wiki/Youngling",
  "/wiki/Czerka_Arms",
  "/wiki/Outland_rifle",
  "/wiki/Galactic_Republic",
  "/wiki/Military_rank",
  "/wiki/Soldier",
  "/wiki/Cloak",
  "/wiki/Sword",
  "/wiki/Shield_(physical_armor)",
  "/wiki/Bodyguard",
  "/wiki/Izvoshra",
  "/wiki/Realspace",
  "/wiki/King",
  "/wiki/Wookiee_warrior",
  "/wiki/Kashyyyk",
  "/wiki/Skrilling",
  "/wiki/Sith",
  "/wiki/Count",
  "/wiki/Sith_Master",
  "/wiki/Politics",
  "/wiki/Jedi",
  "/wiki/Force_power",
  "/wiki/The_Force",
  "/wiki/Battle_droid",
  "/wiki/File:ISubmitToNoOne-LoG.ogg",
  "/wiki/Raxus_Address",
  "/wiki/Separatist_Crisis",
  "/wiki/Serenno",
  "/wiki/San_Hill",
  "/wiki/Chairman",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Archduke",
  "/wiki/Geonosis",
  "/wiki/Geonosian",
  "/wiki/FX-9_surgical_assistant",
  "/wiki/FX-6",
  "/wiki/Doctor",
  "/wiki/Brain",
  "/wiki/Bone",
  "/wiki/Lung",
  "/wiki/Eye",
  "/wiki/Heart",
  "/wiki/Duranium",
  "/wiki/Limb",
  "/wiki/LX-44_robotic_leg",
  "/wiki/Sensor",
  "/wiki/Helmet",
  "/wiki/Computer_monitor",
  "/wiki/Reptile",
  "/wiki/Nose",
  "/wiki/Black_hole",
  "/wiki/Mouth",
  "/wiki/Armorplast",
  "/wiki/Armor",
  "/wiki/Synthskin",
  "/wiki/Grievous%27_first_lightsaber",
  "/wiki/Unidentified_Jedi_(friend_of_Dooku)",
  "/wiki/Alien",
  "/wiki/Holovid",
  "/wiki/Cybernetic",
  "/wiki/Actuator",
  "/wiki/EV-series_medical_droid",
  "/wiki/Medical_droid",
  "/wiki/EV-A4-D",
  "/wiki/Technician",
  "/wiki/Cape",
  "/wiki/Mumuu",
  "/wiki/Kaleesh_cloak",
  "/wiki/Grievous%27s_fortress",
  "/wiki/Vassek_3",
  "/wiki/Vassek",
  "/wiki/Roggwart",
  "/wiki/Gor",
  "/wiki/Galaxy",
  "/wiki/Cloning",
  "/wiki/Stalgasin_hive",
  "/wiki/Geonosian_catacombs",
  "/wiki/Force-sensitive",
  "/wiki/The_Grievous_Legion",
  "/wiki/Battle_group",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Clone_trooper",
  "/wiki/Republic_Military",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Moon_of_Staggec",
  "/wiki/Unidentified_valuable_item",
  "/wiki/Senator",
  "/wiki/Yarua",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Viiveenn",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Cerean",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Pablo-Jill",
  "/wiki/Duel_over_Duro",
  "/wiki/Duro",
  "/wiki/Unidentified_satellite_city",
  "/wiki/Plasma",
  "/wiki/Pablo-Jill%27s_lightsaber",
  "/wiki/Jmmaar",
  "/wiki/Jmmaar%27s_lightsaber",
  "/wiki/Mercenary",
  "/wiki/AD-W4",
  "/wiki/Hissrich",
  "/wiki/Currency",
  "/wiki/Operation_on_Hissrich",
  "/wiki/Mace_Windu",
  "/wiki/Mace_Windu%27s_squad",
  "/wiki/Hologram",
  "/wiki/Mace_Windu%27s_lightsaber",
  "/wiki/Battle_of_Parein_II_4",
  "/wiki/Parein_II_4",
  "/wiki/Parein_II",
  "/wiki/Sannen",
  "/wiki/TSMEU-6_personal_wheel_bike",
  "/wiki/Water",
  "/wiki/Alamass",
  "/wiki/Battle_of_Alamass",
  "/wiki/Republic_stronghold",
  "/wiki/Unidentified_tactical_droid_(Alamass)",
  "/wiki/Battle_on_Caliban",
  "/wiki/Caliban",
  "/wiki/Clone_Marshal_Commander",
  "/wiki/CC-2224",
  "/wiki/Squad",
  "/wiki/Galactic_Accord_of_Systems",
  "/wiki/Qubey",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Blaster",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Gunship",
  "/wiki/Infiltration_of_the_Stellar_Rise",
  "/wiki/Stellar_Rise",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi_artifact",
  "/wiki/Lozz_Beraf",
  "/wiki/Anap_Ree-Di",
  "/wiki/Barracks",
  "/wiki/Soul",
  "/wiki/Jocasta_Nu",
  "/wiki/Lightspeed",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Rotta",
  "/wiki/Hutt",
  "/wiki/Navy",
  "/wiki/Confederacy_of_Independent_Systems_Navy",
  "/wiki/Subjugator-class_heavy_cruiser",
  "/wiki/Malevolence",
  "/wiki/Bridge_(starship)",
  "/wiki/Warship",
  "/wiki/Malevolence_Campaign",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Battle_of_the_Phu_system",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Ares_Nune/Canon",
  "/wiki/Abregado_system",
  "/wiki/Plo_Koon%27s_fleet",
  "/wiki/Plo_Koon",
  "/wiki/Clone_Commander",
  "/wiki/Wolffe",
  "/wiki/Triumphant",
  "/wiki/Battle_of_Abregado",
  "/wiki/Mega-ion_cannon",
  "/wiki/Fleet",
  "/wiki/Deflector_shield",
  "/wiki/Star_Destroyer",
  "/wiki/Escape_pod",
  "/wiki/Clone_Sergeant",
  "/wiki/Sinker",
  "/wiki/CT-4860",
  "/wiki/Ahsoka_Tano",
  "/wiki/G9_Rigger-class_light_freighter",
  "/wiki/Twilight",
  "/wiki/Battle_of_the_Ryndellia_system",
  "/wiki/Convoy",
  "/wiki/Ryndellia_system",
  "/wiki/Battle_of_the_Kaliida_Nebula",
  "/wiki/Kaliida_Nebula",
  "/wiki/Ion_cannon",
  "/wiki/Obi-Wan_Kenobi%27s_taskforce",
  "/wiki/Negotiator",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Soulless_One",
  "/wiki/Dead_Moon_of_Antar",
  "/wiki/Starfighter",
  "/wiki/Luminara_Unduli",
  "/wiki/Nadiem",
  "/wiki/Clone_Intelligence",
  "/wiki/Balmorra_system",
  "/wiki/Standard_week",
  "/wiki/Kamino",
  "/wiki/Rishi_Station",
  "/wiki/BX-series_droid_commando",
  "/wiki/Defense_of_Rishi_Station",
  "/wiki/Rishi",
  "/wiki/Unidentified_BX-series_droid_commando_captain_(Rishi_Station)",
  "/wiki/Munificent-class_star_frigate",
  "/wiki/Spy",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Clone_trooper_officer",
  "/wiki/Battalion",
  "/wiki/B1-Series_battle_droid",
  "/wiki/CT-782",
  "/wiki/Skywalker%27s_fleet",
  "/wiki/File:InterceptedTransmissions-DoaD.ogg",
  "/wiki/Skytop_Station_campaign",
  "/wiki/Skytop_Station",
  "/wiki/Battlesphere",
  "/wiki/Listening_post",
  "/wiki/Bespin",
  "/wiki/Kessel",
  "/wiki/Mon_Calamari",
  "/wiki/Falleen_battle_group",
  "/wiki/Falleen",
  "/wiki/Battle_of_Falleen",
  "/wiki/Bothawui",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Battle_of_Bothawui",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Resolute",
  "/wiki/Cruiser",
  "/wiki/All_Terrain_Tactical_Enforcer",
  "/wiki/Grievous%27s_frigate",
  "/wiki/Delta-7B_Aethersprite-class_light_interceptor",
  "/wiki/Trandoshan",
  "/wiki/Gha_Nachkt",
  "/wiki/R2-D2",
  "/wiki/Ruusan",
  "/wiki/Moon",
  "/wiki/File:JediTrackingBeacon-DoaD.ogg",
  "/wiki/Vulture%27s_Claw",
  "/wiki/R3-S6",
  "/wiki/Grievous%27s_Munificent-class_star_frigate_(outer_corridor_of_space)",
  "/wiki/Mission_to_sweep_outer_corridor_of_space",
  "/wiki/Hyperspace_transport_ring",
  "/wiki/File:InteruptPlaytime-DotD.ogg",
  "/wiki/Denal",
  "/wiki/Neimoidian",
  "/wiki/Viceroy",
  "/wiki/Nute_Gunray",
  "/wiki/Neebo",
  "/wiki/Sanjin",
  "/wiki/Refugee",
  "/wiki/Kit_Fisto",
  "/wiki/Nahdar_Vebb",
  "/wiki/Neebo%27s_lightsaber",
  "/wiki/Laboratory",
  "/wiki/Belsus",
  "/wiki/Gentes",
  "/wiki/Ralakili",
  "/wiki/The_Lodge",
  "/wiki/Vandor",
  "/wiki/File:ProudWarrior-LoG.ogg",
  "/wiki/Mission_to_Vassek_3",
  "/wiki/Ledeve",
  "/wiki/Unidentified_Mikkian_Jedi",
  "/wiki/Unidentified_Jedi_Padawan_(Grievous)",
  "/wiki/T-6_shuttle",
  "/wiki/Datapad",
  "/wiki/Jedi_Temple_(Ledeve)",
  "/wiki/Destruction_of_the_Ledeve_Jedi_Temple",
  "/wiki/Felucia_blockade",
  "/wiki/Felucia",
  "/wiki/First_Battle_of_Felucia",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/Battle_near_Dorin",
  "/wiki/Dorin",
  "/wiki/File:CowardAndMurderer-GI.ogg",
  "/wiki/Capture_of_Eeth_Koth",
  "/wiki/Eeth_Koth",
  "/wiki/Steadfast_(Venator-class)",
  "/wiki/Arda",
  "/wiki/Force_push",
  "/wiki/Viewport",
  "/wiki/Eeth_Koth%27s_lightsaber",
  "/wiki/Jedi_High_Council",
  "/wiki/Saleucami_system",
  "/wiki/Adi_Gallia",
  "/wiki/Grievous%27s_Recusant-class_light_destroyer",
  "/wiki/Recusant-class_light_destroyer",
  "/wiki/Saleucami",
  "/wiki/C-9979_landing_craft",
  "/wiki/B1-series_battle_droid",
  "/wiki/Acclamator-class_transgalactic_military_assault_ship",
  "/wiki/Transmitter",
  "/wiki/Reek",
  "/wiki/Eopie",
  "/wiki/Power_cell",
  "/wiki/Standard_hour",
  "/wiki/Robolobotomy",
  "/wiki/CT-5597",
  "/wiki/Kilometer",
  "/wiki/Missile",
  "/wiki/Sheathipede-class_transport_shuttle",
  "/wiki/Clone_gunner",
  "/wiki/Mass-driver_cannon",
  "/wiki/Ascension_cable",
  "/wiki/Invasion_of_Saleucami",
  "/wiki/Battle_of_Kamino",
  "/wiki/501st_Legion",
  "/wiki/Tipoca_City",
  "/wiki/Trident-class_assault_ship",
  "/wiki/AQ-series_battle_droid",
  "/wiki/Bombing_of_Coruscant%27s_central_power_distribution_grid",
  "/wiki/Infiltrator_demolition_droid",
  "/wiki/Cleaning_droid",
  "/wiki/Central_power_distribution_grid",
  "/wiki/Galactic_Senate",
  "/wiki/Confederate%E2%80%93Republic_peace_initiative",
  "/wiki/Second_Battle_of_Felucia",
  "/wiki/TZ-33",
  "/wiki/Battle_of_Mon_Cala",
  "/wiki/Yos_Kolina",
  "/wiki/Karkarodon",
  "/wiki/Riff_Tamson",
  "/wiki/Battle_of_Naboo",
  "/wiki/Naboo",
  "/wiki/Skirmish_on_Naboo",
  "/wiki/Rish_Loo",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Gungan",
  "/wiki/Boss",
  "/wiki/Lyonie",
  "/wiki/Gungan_Grand_Army",
  "/wiki/Militiagung",
  "/wiki/Roos_Tarpals",
  "/wiki/Electropole",
  "/wiki/Battle_of_Patitite_Pattuna",
  "/wiki/Mission_to_Aleen",
  "/wiki/Aleen",
  "/wiki/91st_Mobile_Reconnaissance_Corps",
  "/wiki/Rescue_of_Adi_Gallia",
  "/wiki/Talzin",
  "/wiki/Nightsisters",
  "/wiki/Dathomir",
  "/wiki/Battle_of_Dathomir",
  "/wiki/Hyena-class_Droid_Fighter/Bomber",
  "/wiki/Armored_Assault_Tank_Mk_I",
  "/wiki/Defoliator_Deployment_Tank",
  "/wiki/Daka",
  "/wiki/Army_of_the_Dead",
  "/wiki/Luce",
  "/wiki/Savage_Opress",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Mission_to_Florrum",
  "/wiki/Weequay",
  "/wiki/Ohnaka_Gang",
  "/wiki/Florrum",
  "/wiki/Pirate",
  "/wiki/Attack_on_Obi-Wan_Kenobi%27s_fleet",
  "/wiki/Battle_on_Florrum",
  "/wiki/Single_Trooper_Aerial_Platform",
  "/wiki/Slave_I",
  "/wiki/D-Squad",
  "/wiki/Aut-O%27s_flagship",
  "/wiki/Encryption_module",
  "/wiki/Kyber_Crystal",
  "/wiki/Torul_Blom",
  "/wiki/Governor",
  "/wiki/Sugi",
  "/wiki/Endente",
  "/wiki/Amani_tribe_(Clone_Wars)",
  "/wiki/Amani",
  "/wiki/Mission_to_Utapau",
  "/wiki/Tu-Anh",
  "/wiki/DH-Omni_Support_Vessel",
  "/wiki/Unidentified_freighter_(Utapau)",
  "/wiki/Hyperdrive",
  "/wiki/Number_five_special",
  "/wiki/Hangar",
  "/wiki/OOM_pilot_battle_droid",
  "/wiki/Laser",
  "/wiki/Invasion_of_Utapau",
  "/wiki/Utapaun",
  "/wiki/Tion_Medon",
  "/wiki/Port_Administrator",
  "/wiki/Core_ship",
  "/wiki/Level_10",
  "/wiki/Pau_City",
  "/wiki/Techno_Union",
  "/wiki/Raxus_Secundus",
  "/wiki/Raxian_Humanitarian_Award",
  "/wiki/Mission_to_Raxus_Secundus",
  "/wiki/Quinlan_Vos",
  "/wiki/Jedi_Council",
  "/wiki/Zabrak",
  "/wiki/Nightbrothers",
  "/wiki/Maul",
  "/wiki/Escape_from_the_Spire",
  "/wiki/Death_Watch",
  "/wiki/Zanbar",
  "/wiki/Shadow_Collective",
  "/wiki/Battle_of_Zanbar",
  "/wiki/Mandalorian_super_commando",
  "/wiki/Kom%27rk-class_fighter/transport",
  "/wiki/Dathomirian",
  "/wiki/Ord_Mantell",
  "/wiki/Black_Sun",
  "/wiki/ST-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/Tey-Zuka",
  "/wiki/Talzin%27s_shuttle",
  "/wiki/Ord_Mantell_City",
  "/wiki/Battle_of_Ord_Mantell",
  "/wiki/Transparisteel",
  "/wiki/Vizsla_Keep_09",
  "/wiki/Dooku%27s_lightsaber",
  "/wiki/Scimitar",
  "/wiki/Cloaking_device",
  "/wiki/Nightbrother_village",
  "/wiki/Second_Battle_of_Dathomir",
  "/wiki/Force_lightning",
  "/wiki/Magick",
  "/wiki/Second_battle_of_Christophsis",
  "/wiki/Christophsis",
  "/wiki/Battle_of_Haruun_Kal",
  "/wiki/Depa_Billaba",
  "/wiki/Haruun_Kal",
  "/wiki/Depa_Billaba%27s_battalion",
  "/wiki/Rackham_Sear",
  "/wiki/Kleeve",
  "/wiki/Kage",
  "/wiki/Bounty_hunter",
  "/wiki/Cad_Bane",
  "/wiki/Kage_Warriors",
  "/wiki/Bombing_at_the_Jedi_Temple",
  "/wiki/Imperial_Palace",
  "/wiki/Kardoa",
  "/wiki/Coburn_Sear",
  "/wiki/Skirmish_on_Kardoa",
  "/wiki/Depa_Billaba%27s_second_battalion",
  "/wiki/Kaller",
  "/wiki/Mygeeto",
  "/wiki/Third_Battle_of_Mygeeto",
  "/wiki/Kanan_Jarrus",
  "/wiki/Outer_Rim_Sieges",
  "/wiki/Nexus_Route",
  "/wiki/Hydian_Way",
  "/wiki/Triellus_Trade_Route",
  "/wiki/Shipyard",
  "/wiki/Anaxes",
  "/wiki/Battle_of_Anaxes",
  "/wiki/Kachirho",
  "/wiki/Claatuvac_Guild",
  "/wiki/Chief",
  "/wiki/Tarfful",
  "/wiki/Rescue_of_Tarfful",
  "/wiki/Battle_of_Kashyyyk",
  "/wiki/Coruscant_Home_Defense_Fleet",
  "/wiki/Droid_tri-fighter",
  "/wiki/Aggressive_ReConnaissance-170_starfighter",
  "/wiki/Federal_District",
  "/wiki/Palpatine%27s_apartment",
  "/wiki/Roron_Corobb",
  "/wiki/Conning_tower",
  "/wiki/Yerbana",
  "/wiki/Honor_Salima",
  "/wiki/Clone_Flight_Squad_Seven",
  "/wiki/Home_Fleet_Strike_Group_Five",
  "/wiki/Lorth_Needa",
  "/wiki/Standard_minute",
  "/wiki/Hallway_328",
  "/wiki/Ray_shield",
  "/wiki/IG-101",
  "/wiki/IG-102",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Profusion",
  "/wiki/Head_of_State",
  "/wiki/Unidentified_Sheathipede-class_transport_shuttle_(Grievous)",
  "/wiki/File:GrievousDeath.ogg",
  "/wiki/Varactyl",
  "/wiki/Boga",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Order_66",
  "/wiki/Galactic_Empire",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Inquisitor",
  "/wiki/Jedi_Temple_Guard",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Brother/Sister",
  "/wiki/Inquisitorius",
  "/wiki/Double-bladed_spinning_lightsaber",
  "/wiki/3_BBY",
  "/wiki/Damanos",
  "/wiki/Force_vision",
  "/wiki/14_BBY",
  "/wiki/Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Rear_Admiral",
  "/wiki/Nils_Tenant",
  "/wiki/Western_Reaches",
  "/wiki/Sentinel_Base",
  "/wiki/Project_Stardust",
  "/wiki/Taron_Malicos",
  "/wiki/Merrin",
  "/wiki/Cal_Kestis",
  "/wiki/Deathstick",
  "/wiki/Shelish",
  "/wiki/Cylo",
  "/wiki/Galactic_Emperor",
  "/wiki/Karbin",
  "/wiki/Battle_of_Endor",
  "/wiki/Temmin_Wexley",
  "/wiki/Mister_Bones",
  "/wiki/31_ABY",
  "/wiki/32_ABY",
  "/wiki/Karr_Nuq_Sin",
  "/wiki/RZ-7",
  "/wiki/Maize_Raynshi",
  "/wiki/Unidentified_school",
  "/wiki/Desert",
  "/wiki/Merokia",
  "/wiki/Unidentified_artist",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Graf_Archive",
  "/wiki/Battle_of_Oetchi",
  "/wiki/34_ABY",
  "/wiki/Dok-Ondar%27s_Den_of_Antiquities",
  "/wiki/Dok-Ondar",
  "/wiki/Standard_century",
  "/wiki/Batuu",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Battle_of_Crait",
  "/wiki/Galactic_Explorer%27s_Guide",
  "/wiki/Karabbac",
  "/wiki/Ultrasonic_vocabulator",
  "/wiki/Lord",
  "/wiki/Admiral",
  "/wiki/Trench",
  "/wiki/Commerce_Guild",
  "/wiki/OG-9_homing_spider_droid",
  "/wiki/Spelunker_probe_droid",
  "/wiki/Collector",
  "/wiki/Padawan_braid",
  "/wiki/Mother_Talzin%27s_clan",
  "/wiki/Witch",
  "/wiki/Ky_Narec",
  "/wiki/Rattatak",
  "/wiki/Dream",
  "/wiki/Spice",
  "/wiki/Jar%27Kai",
  "/wiki/Standard_month",
  "/wiki/Booma",
  "/wiki/CC-10/994",
  "/wiki/Styles",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Durasteel",
  "/wiki/Life_support",
  "/wiki/Poison",
  "/wiki/Dreadnought",
  "/wiki/Antennae",
  "/wiki/Comlink",
  "/wiki/DT-57_%22Annihilator%22_blaster",
  "/wiki/Blaster_pistol",
  "/wiki/Grievance_Striker",
  "/wiki/DC-17",
  "/wiki/Belbullab-22_heavy_starfighter",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith#DVD_release",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Clone_Wars_Chapter_20",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/Star_Wars_Legends",
  "/wiki/Gary_Oldman",
  "/wiki/Matthew_Wood",
  "/wiki/2008",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Original_trilogy",
  "/wiki/Photoreceptor",
  "/wiki/Derek_Thompson",
  "/wiki/Erik_Tiemens",
  "/wiki/Alex_Jaeger",
  "/wiki/Warren_Fu",
  "/wiki/The_Star_Wars_Archives:_Episodes_I%E2%80%93III,_1999%E2%80%932005",
  "/wiki/2002",
  "/wiki/Skywalker_Ranch",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/The_Prequel_Trilogy_Stories",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_3",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_4",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_5",
  "/wiki/Hyperspace_Stories_1",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales_5",
  "/wiki/Star_Wars_Insider",
  "/wiki/Galactic_Tales:_Saber_Truth",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Rising_Malevolence",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/Destroy_Malevolence",
  "/wiki/Rookies",
  "/wiki/Downfall_of_a_Droid",
  "/wiki/Duel_of_the_Droids",
  "/wiki/Lair_of_Grievous",
  "/wiki/Age_of_Republic_-_General_Grievous_1",
  "/wiki/Bounty_Hunters_(episode)",
  "/wiki/Senate_Spy",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Grievous_Intrigue",
  "/wiki/The_Deserter",
  "/wiki/R2_Come_Home",
  "/wiki/ARC_Troopers",
  "/wiki/Sphere_of_Influence",
  "/wiki/Hostage_Crisis",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Padawan_Lost",
  "/wiki/Shadow_Warrior",
  "/wiki/Nomad_Droids",
  "/wiki/Deception",
  "/wiki/Massacre",
  "/wiki/The_Lost_Nightsister",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Brothers",
  "/wiki/Revenge_(episode)",
  "/wiki/A_Test_of_Strength",
  "/wiki/Bound_for_Rescue",
  "/wiki/A_Necessary_Bond",
  "/wiki/Almost_a_Jedi",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark_(audiobook)",
  "/wiki/Secret_Weapons",
  "/wiki/Revival_(episode)",
  "/wiki/Sisters",
  "/wiki/Age_of_Republic_Special_1",
  "/wiki/A_Death_on_Utapau",
  "/wiki/In_Search_of_the_Crystal",
  "/wiki/Crystal_Crisis",
  "/wiki/The_Big_Bang",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_1",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_2",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_3",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_4",
  "/wiki/Kanan_7",
  "/wiki/Kanan_8",
  "/wiki/Kanan_9",
  "/wiki/Kanan_10",
  "/wiki/Kanan_11",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/The_Revenge_of_the_Sith",
  "/wiki/The_Revenge_of_the_Sith_-_The_Film_Novel",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/Revenge_of_the_Sith_(Golden_Book)",
  "/wiki/Revenge_of_the_Sith_Read-Along_Storybook_and_CD",
  "/wiki/The_Last_Adventure",
  "/wiki/5-Minute_Star_Wars_Stories_(2015)",
  "/wiki/The_Phantom_Apprentice",
  "/wiki/The_Duel_for_Peace",
  "/wiki/5-Minute_Star_Wars_Stories_Strike_Back",
  "/wiki/Shattered",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Aftermath_(episode)",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/A_New_Dawn_(novel)",
  "/wiki/A_New_Dawn_(audiobook)",
  "/wiki/The_Ghosts_of_Maul",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Thrawn:_Alliances_(audiobook)",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!",
  "/wiki/The_Mighty_Chewbacca_in_the_Forest_of_Fear!_(audiobook)",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Obi-Wan_Kenobi_(Galaxy_of_Adventures)",
  "/wiki/Darth_Vader_(2015)_6",
  "/wiki/Doctor_Aphra_(2016)_21",
  "/wiki/Crimson_Reign_2",
  "/wiki/Bounty_Hunters_24",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Force_Collector",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_Ashcan",
  "/wiki/The_Droid_with_a_Heart",
  "/wiki/Myths_%26_Fables",
  "/wiki/Myths_%26_Fables_(audiobook)",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/LEGO_STAR_WARS:_Celebrate_the_Season",
  "/wiki/All_I_Want_For_Life_Day",
  "/wiki/LEGO_Star_Wars:_Revenge_of_the_Sith_(Scholastic)",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Exit_from_Endor",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/From_Trenches_to_Wrenches:_The_Roger_Story_(episode)",
  "/wiki/Lo,_I_am_Manufactured",
  "/wiki/LEGO_Star_Wars_Terrifying_Tales",
  "/wiki/LEGO_Star_Wars_Battles",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Grievous",
  "/wiki/Category:Images_of_Grievous",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Workbook:_2nd_Grade_Writing",
  "/wiki/Star_Wars_Workbook:_Kindergarten_Writing_%26_ABCs",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Ships_of_the_Galaxy",
  "/wiki/Star_Wars_Jedi_Master_Magazine_2",
  "/wiki/Star_Wars_Jedi_Master_Magazine_3",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_30",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_40",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_43",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_52",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_54",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_59",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_65",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_75",
  "/wiki/Star_Wars:_A_Galaxy_at_War",
  "/wiki/Asajj_Ventress:_A-Typical_Anti-Hero",
  "/wiki/Star_Wars_Insider_159",
  "/wiki/Star_Wars:_The_Force_Awakens:_Head-to-Head",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_6",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_8",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_15",
  "/wiki/Star_Wars_Helmet_Collection_16",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_112",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_116",
  "/wiki/Star_Wars:_OBI-123",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Star_Wars_Helmet_Collection_28",
  "/wiki/Star_Wars_Helmet_Collection_29",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Star_Wars_Helmet_Collection_39",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Star_Wars_Helmet_Collection_48",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Clone_Wars",
  "/wiki/LEGO_Star_Wars_Episode_III:_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Lightsaber_Battles",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_20",
  "/wiki/Droid_Directory",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_31",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_40",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_53",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_57",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars_Lightsabers:_A_Guide_to_Weapons_of_the_Force",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/The_Art_of_Solo:_A_Star_Wars_Story",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_13",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars_Bust_Collection_16",
  "/wiki/Star_Wars_Bust_Collection_17",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars",
  "/wiki/Electronic_Arts",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Servants_of_Strife_Squadron_Pack",
  "/wiki/Sith_Infiltrator_Expansion_Pack",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Convergence_(Star_Wars:_Destiny)",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Star_Wars_Helmet_Collection_62",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Star_Wars_Helmet_Collection_69",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Star_Wars_Helmet_Collection_77",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Insider_188",
  "/wiki/The_Grievous_Growl",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/BTL-B_Y-Wing_Expansion_Pack",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Star_Wars:_Legion",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_23",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_47",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2021",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Lightsabers_and_Jedi_Equipment",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Yoda_and_Other_Users_of_the_Force",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Star_Wars:_The_Tiny_Book_of_Sith",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/The_Clone_Wars_Begin",
  "/wiki/Emperor_Palpatine",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Melee_and_Ranged_Weapons",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/The_Star_Wars_Book_of_Monsters,_Ooze_and_Slime",
  "/wiki/Battle_Droids_and_Other_War_Droids",
  "/wiki/Naval_Armament_and_Equipment",
  "/wiki/The_Clone_Wars_(Star_Wars_Encyclopedia)",
  "/wiki/Mace_Windu_and_Other_Force_Users",
  "/wiki/Bespin_and_Other_Outer_Rim_Planets",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Obi-Wan_Kenobi_(Star_Wars_Encyclopedia)",
  "/wiki/Sixth_Scale_Figures",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Ships_of_the_Republic_and_Separatists_(I)",
  "/wiki/Geonosis_and_Other_Outer_Rim_Planets",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Protocol_and_Service_Droids",
  "/wiki/Star_Wars:_The_Clone_Wars_-_The_Official_Collectors_Edition",
  "/wiki/Star_Wars_Inside_Intel:_The_Nightsisters",
  "/wiki/Land,_Sea_and_Air_Speeders_(I)",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_15",
  "/wiki/Ships_and_Vehicles",
  "/wiki/Ships_of_the_Republic_and_Separatists_(II)",
  "/wiki/Tank,_Vehicle_and_Other_Mechanized_Droids",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Maul:_From_Sith_Lord_to_Crime_Lord",
  "/wiki/The_Grand_Army_of_the_Republic",
  "/wiki/The_End_of_the_Clone_Wars",
  "/wiki/Mustafar_and_Other_Outer_Rim_Planets",
  "/wiki/Assassin,_Security,_and_Combat_Droids",
  "/wiki/The_Separatists",
  "/wiki/Imperial_Officers_and_Agents",
  "/wiki/Star_Wars:_The_Mini_Book_of_Lightsabers",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Ships_and_Vehicles:_Selection_(I)",
  "/wiki/Ships_and_Vehicles:_Selection_(II)",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2023",
  "/wiki/Ezra_Bridger_and_Other_Force_Users",
  "/wiki/The_Heroes_of_Naboo_and_Other_Characters_From_the_Galaxy",
  "/wiki/Saw_Gerrera_and_Other_Characters_From_the_Galaxy",
  "/wiki/Index",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Made_Easy",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/22_BBY",
  "/wiki/24_BBY",
  "/wiki/29_BBY",
  "/wiki/Knights_of_Fate",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Ambush",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Marvel_Comics",
  "/wiki/Holocron_Heist",
  "/wiki/Water_War",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/June_29",
  "/wiki/2017",
  "/wiki/Star_Wars_Bust_Collection_37",
  "/wiki/The_Cyborg_and_the_Jedi",
  "/wiki/Secrets_of_the_Sith",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Imperial_Era",
  "/wiki/Mission_to_Malachor",
  "/wiki/Malachor",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/In-universe",
  "/wiki/Poe_Dameron",
  "/wiki/Amilyn_Holdo",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Star_Wars:_The_Complete_Saga",
  "/wiki/June_12",
  "/wiki/2022",
  "/wiki/June_14",
  "/wiki/September_16",
  "/wiki/2004",
  "/wiki/October_8",
  "/wiki/2015"
 ]
}