{
 "name": "Griff_Halloran",
 "display_name": "Griff Halloran",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Starfighter Corps",
      "Imperial Starfighter Corps",
      "Ace Squadron",
      "Team Colossus"
     ]
    }
   ]
  }
 ],
 "content": "Griff Halloran was a human male pilot who served with the Ace Squadron during the era of the New Republic. Prior to his time flying defense for the Colossus refueling station, he served as a TIE fighter pilot in the Imperial Navy.\nLike his teammates, Halloran was an accomplished pilot who owned a starfighter, suited to his attributes. The Black Ace was an extensively modified TIE/ln space superiority starfighter; Halloran designed the modifications himself in order to turn his racer into a unique and fearsome machine that emphasized raw power.\nGriff Halloran was a pilot who spent time in flight school and joined the Imperial Navy. Around the time of the Battle of Endor, Halloran, along with his commanding officer, Imanuel Doza, defected from the Galactic Empire after Doza had come to the point where he'd had enough, offering Halloran a choice between staying and fighting for a corrupt Empire or to leave with him and start new.\nDuring the era of the New Republic, Halloran was flying defense for the Colossus refueling station, continuing to fly the colors of the former Empire while serving with Ace Squadron—a team of exceptional starfighter pilots—during his time as a pilot and racer.\nGriff was present at the Aces' Lounge in Doza Tower when fellow Ace pilot Hype Fazon gave the mechanics Tamara Ryvora, Neeku Vozo, undercover Resistance spy Kazuda Xiono, and BB-series astromech droid BB-8 a tour of the building. Unknown to everyone, Xiono was on a mission to spy on Major Elrik Vonreg, who had come to negotiate a First Order offer of protection with Captain Doza.\nWhile Griff and his fellow Aces were escorting a shipment, the pirate leader Kragan Gorr and his Warbird gang, at the behest of the First Order, launched a second raid on the Colossus. Though the pirates were rebuffed, this raid convinced Captain Doza to reconsider the First Order's protection offer.\nGriff later competed in the Platform Classic against his fellow Aces, galactic racing champion Marcus Speedstar, and Speedstar's estranged older brother and garage owner Jarek Yeager. During the first phase of the race, Griff disabled fellow Ace Bo Keevil's racer Yellow Ace, causing it to crash in the sea. Griff and the other racers then ascended into space and did a deep dive with their engines switched off. After passing through the re-ignition hoop, Griff tried to ram Speedstar's ship but failed. Griff was forced to eject from his racer Black Ace to avoid an accident. Speedstar ultimately won the race and was able to use the prize money to free his friend Oplock from the Guavian Death Gang.\nGriff and his fellow Aces were later socializing at the Aces' Lounge when Torra gave her friend Xiono a tour of Doza Tower. Griff remarked that Captain Doza better get the racers going since it had been a long time since they had seen action. Unknown to everyone, Xiono was on a another mission to spy on Captain Doza's meeting with First Order emissary Commander Pyre.\nGriff took part in a race with his fellow Aces. Torra initially held the lead but used up her booster fuel too early. This allowed Hype to take the lead and maintain his title.\nLater, Griff and his fellow Aces took part in a mission to escort an incoming freighter. Though Griff grumbled about why they were all needed, Hype responded that they need to work together. Hype was proven right when the freighter had trouble landing and the Aces had to work together to slow its descent.\nDuring the Bibo incident, Griff and his fellow Aces defended the Colossus against Bibo's mother, a rokkna sea monster. Despite their efforts and the assistance of Kazuda Xiono, they were unable to stop the rokkna. Griff informed Captain Doza that they were unable to repel the sea creature, prompting the Captain to allow them to use missiles. Kaz's friend Neeku Vozo managed to end the assault by returning Bibo to his mother.\nFollowing the kidnapping of their fellow Ace Torra Doza, Griff and his fellow pilots were dispatched in pursuit of her kidnappers. Torra was rescued by Major Elrik Vonreg, who convinced Captain Doza to accept First Order protection.\nMuch of Griff Halloran's personality was reflected in his personal starship, the Black Ace. Favoring a unique and fearsome design, Halloran's customized ship was an aggressively powerful and aerodynamic machine, although to some observers his extensive modifications were regarded as too drastic.\nHalloran was a human male with gray hair, gray eyes, and light skin, and stood 1.83 meters tall.\nGriff Halloran was an accomplished pilot whose abilities enabled him to fly and race alongside the best pilots on the Colossus platform. In addition, he was a skilled mechanic who made many personal modifications and extensive refittings to his own Imperial-issue TIE/ln space superiority starfighter.\nDuring the Cold War, Griff Halloran wore a modified flight suit which included parts of the equipment utilized by TIE fighter pilots. His black flight helmet was also designed by the former Empire, although he customized it by adding white paint to the faceplate.\nGriff Halloran is a character created and developed for the Star Wars Resistance animated series. He is voiced by Stephen Stanton, who voiced Wilhuff Tarkin in Star Wars: The Clone Wars and Star Wars Rebels.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Meet_the_Resistance",
  "/wiki/Star_Wars_Insider_186",
  "/wiki/The_Disappeared",
  "/wiki/No_Escape:_Part_2",
  "/wiki/Star_Wars_Resistance_Season_Two",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Ace_Squadron",
  "/wiki/Team_Colossus",
  "/wiki/Pilot",
  "/wiki/New_Republic",
  "/wiki/Time",
  "/wiki/Colossus",
  "/wiki/Fuel",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Imperial_Navy",
  "/wiki/Starfighter",
  "/wiki/Black_Ace",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Battle_of_Endor",
  "/wiki/Commanding_officer",
  "/wiki/Imanuel_Doza",
  "/wiki/New_Republic_Era",
  "/wiki/Galactic_Concordance",
  "/wiki/Squadron",
  "/wiki/Aces%27_Lounge",
  "/wiki/Doza_Tower",
  "/wiki/Hype_Fazon",
  "/wiki/Tamara_Ryvora",
  "/wiki/Neeku_Vozo",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Kazuda_Xiono",
  "/wiki/BB-series_astromech_droid",
  "/wiki/BB-8",
  "/wiki/Mission_to_Doza_Tower",
  "/wiki/Major",
  "/wiki/Elrik_Vonreg",
  "/wiki/First_Order",
  "/wiki/Captain",
  "/wiki/Kragan_Gorr",
  "/wiki/Warbird_gang",
  "/wiki/Second_raid_on_the_Colossus",
  "/wiki/Platform_Classic",
  "/wiki/Marcus_Speedstar",
  "/wiki/Jarek_Yeager",
  "/wiki/Bo_Keevil",
  "/wiki/Yellow_Ace",
  "/wiki/Re-ignition_hoop",
  "/wiki/Oplock",
  "/wiki/Guavian_Death_Gang",
  "/wiki/Second_mission_to_Doza_Tower",
  "/wiki/Commander",
  "/wiki/Pyre",
  "/wiki/Bibo_incident",
  "/wiki/Bibo%27s_mother",
  "/wiki/Rokkna",
  "/wiki/Bibo",
  "/wiki/Kidnapping_of_Torra_Doza",
  "/wiki/Starship",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Cold_War",
  "/wiki/Flight_suit",
  "/wiki/Flight_helmet",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Stephen_Stanton",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars_Rebels",
  "/wiki/The_Recruit",
  "/wiki/Fuel_for_the_Fire",
  "/wiki/The_High_Tower",
  "/wiki/Synara%27s_Score",
  "/wiki/The_Platform_Classic",
  "/wiki/Secrets_and_Holograms",
  "/wiki/The_Need_for_Speed",
  "/wiki/Sixty_Seconds_to_Destruction",
  "/wiki/Bibo_(episode)",
  "/wiki/The_Doza_Dilemma",
  "/wiki/Descent_(episode)",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/Live_Fire",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/The_Engineer",
  "/wiki/Rendezvous_Point_(episode)",
  "/wiki/The_Voxx_Vortex_5000",
  "/wiki/Kaz%27s_Curse",
  "/wiki/Breakout",
  "/wiki/The_Mutiny",
  "/wiki/The_New_World",
  "/wiki/No_Place_Safe",
  "/wiki/The_Escape",
  "/wiki/Star_Wars_Resistance_Racer",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_185",
  "/wiki/Star_Wars_Resistance:_Meet_the_Pilots",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2019_Topps_Star_Wars_Resistance_Surprise_Packs",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_Resistance",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/The_Star_Wars_Book",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ace_Squadron_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)"
 ]
}