{
 "name": "Grigmin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    }
   ]
  }
 ],
 "content": "Grigmin was a Human male stunt pilot who operated Grigmin's Traveling Airshow, a traveling barnstorming company, during the era of the Galactic Civil War. Grigmin was regarded as highly arrogant by many of his associates and employees, including the Corellian smuggler Han Solo, who worked for Grigmin as pit crew for a brief period in 2 BBY. The two clashed frequently, and Solo ultimately quit his job by upstaging Grigmin during a performance on the planet Saheelindeel.\nA Human male, Grigmin earned fame during the era of the Galactic Civil War as a talented stunt pilot, a career he pursued after winning a heavyweight championship in unarmed combat. After his fighting days ended, Grigmin took his flying skills on the road by operating a barnstorming outfit called Grigmin's Traveling Airshow. Grigmin primarily plied his trade on backwater worlds, dazzling natives with tricks on a variety of outmoded craft, including a clunky, old airspeeder, a jetpack and an X-222 high-altitude fighter for his grand finale.\nIn 2 BBY, Grigmin picked up a pair of smugglers, Han Solo and Chewbacca, as his pit crew. Grigmin and Solo clashed frequently over Grigmin's arrogance and overtaxing of his speeder, concerns Grigmin constantly ignored. Things came to a head with Solo during a trip to the backwater world of Saheelindeel, where Grigmin's tricks attracted a large crowd of the indigenous Saheelindeeli. Between repairs to Grigmin's airspeeder, Solo received a lucrative job offer to deliver learning materials to a university on Brigia, giving him the opportunity he had been waiting for to leave Grigmin behind. Wanting to take a shot at Grigmin on the way out, Solo borrowed an acquaintance's cobbled-together barge and upstaged him on his grand finale, infuriating Grigmin with his display of superior flying abilities.\nTall, broad-shouldered and handsome, Grigmin was regarded by many around him, especially Han Solo, as an infuriatingly arrogant man who had a much greater assessment of his flying skills than was merited. In addition, many of his employees and those who had dealings with him regarded him as a deadbeat—although he paid, he did not always do so regularly. Grigmin felt himself far above the locals he entertained with his stunt flying, backing up his highhanded attitude with a confidence coming from the knowledge that due to his unarmed combat expertise, few would dare to take a swing.\nGrigmin first appeared in Han Solo and the Lost Legacy, a novel written by Brian Daley and released in 1980.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Grigmin%27s_Traveling_Airshow",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Saheelindeel",
  "/wiki/Airspeeder/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/X-222_fighter",
  "/wiki/Chewbacca/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Saheelindeeli",
  "/wiki/University/Legends",
  "/wiki/Brigia/Legends",
  "/wiki/Fadoop",
  "/wiki/Skybarge",
  "/wiki/Han_Solo_and_the_Lost_Legacy",
  "/wiki/Brian_Daley",
  "/wiki/1980",
  "/wiki/A_Guide_to_the_Star_Wars_Universe",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}