{
 "name": "Griggor_Tower",
 "display_name": "Griggor Tower",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Gamandar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "One blue",
      "one red implant"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Griggor Tower was a Human male Imperial Admiral who led the subjugation of the Iskalon system during the Galactic Civil War. Under Tower's command, Imperial forces rendered Telfrey uninhabitable and enslaved the people of Gamandar, subsequently making the world his headquarters. In 3 ABY. Tower also devastated nearby Iskalon by generating a massive tidal wave, after learning that the Iskalonian School was harboring a group of Rebel agents that included Luke Skywalker. Outraged that Tower had endangered Skywalker's life, the Sith Lord Darth Vader—who wanted the Rebel alive for his own purposes—ordered the Admiral's execution.\nA Human male, Griggor Tower joined the Imperial Navy and reached the lofty rank of Admiral by the height of the Galactic Civil War. Tower led an upswell of Imperial activity in the Iskalon system, which attracted the attention of the Rebel Alliance. Tower met the growing unrest with brutal subjugation, occupying the waterworld of Iskalon, enslaving the populace of neighboring Gamandar—which became the site of his citadel—and rendering Telfrey, homeworld of Rebel provocateurs Yom Argo and Tay Vanis, uninhabitable. After the devastation of Telfrey, the aquatic species of the Iskalonian School sent ambassadors to Gamandar to meet with Tower—the Admiral smashed their water tanks and left them to suffocate, proclaiming that was the only peace their attempts at diplomacy would yield. However, the Iskalonians continued to give Tower pause. Reading further into a comment made by one of the Iskalonian ambassadors, Tower began to research the \"Iskalon effect,\" the concept that a world-spanning tidal wave on Iskalon could be triggered by a single large impact.\nIn time, Tower would find reason to cause the Iskalon effect. In 3 ABY, a group of Rebel agents arrived on Iskalon in order to investigate Vanis' whereabouts, and several of their number—led by Lando Calrissian and Chewbacca—followed a tip from an Iskalonian named Kendle to search further on Gamandar. Unbeknownst to them, Kendle was an informant for Tower, who notified the Admiral that the Rebels were en route. Once Tower received word that the Rebel ship was more than halfway between Iskalon and Gamandar, he ordered a missile launch that triggered the Iskalon effect and devastated Iskalonian society, including the destruction of the planet's the main settlement of Pavillion and the death of the School's ruling Primor. Not long after, Tower entertained Calrissian—posing as a smuggler named \"Drebble\"—at his citadel, as the Rebels probed for information on Vanis. Knowing their true identities, Tower imprisoned them almost immediately.\nHowever, Tower had made a crucial miscalculation. One of the Rebels left behind on Iskalon during the tidal wave was Luke Skywalker, the hero of the Battle of Yavin, who was a highly desired target of the Sith Lord Darth Vader. Vader was furious to learn that Tower had endangered Skywalker's life, and made haste immediately to exact punishment. Tower had begun interrogating the captured Rebels for information on Vanis when he was interrupted by K-3PX, a protocol droid assigned to the citadel that was secretly in Vader's service—K-3PX, with a squad of stomtroopers in tow, informed Tower that he was under arrest on Vader's orders. A disheveled Tower was dragged in front of Vader via hologram, and despite the discovery that survivors had been discovered in the ruins of Pavillion, Vader had Tower summarily execution.\nA one-eyed Human male—his missing eye was replaced with a distinctive red prosthetic—Griggor Tower was ruthless and violent in his subjugation and oppression of the Iskalon system. Tower had utter contempt for the Iskalonian School and its people, waiting for a reason to annihilate them with the Iskalon effect. While these qualities served him well in ruling Iskalon with an iron fist, they did not always endear him to his superiors—Darth Vader in particular regarded him as a arrogant brute. Despite his bluster, Tower retained a subservient attitude towards Lord Vader, although his desperate attempts at appeasement did not save him from execution on Gamandar.\nGriggor Tower appeared as a primary antagonist in three issues of the original Marvel Star Wars comic series in 1983, written by Mary Jo Duffy and illustrated by Ron Frenz.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Gamandar",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Iskalon_system",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Telfrey",
  "/wiki/Telfrey_Holocaust",
  "/wiki/Planet/Legends",
  "/wiki/Iskalon/Legends",
  "/wiki/Iskalon_effect",
  "/wiki/Iskalonian",
  "/wiki/The_School",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Gamandar_Citadel",
  "/wiki/Homeworld/Legends",
  "/wiki/Yom_Argo",
  "/wiki/Tay_Vanis",
  "/wiki/Species/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Kendle",
  "/wiki/Missile/Legends",
  "/wiki/Pavillion",
  "/wiki/Primor_(Inleshat)",
  "/wiki/Smuggler/Legends",
  "/wiki/Barpotomous_Drebble/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/K-3PX",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Death/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/1983",
  "/wiki/Mary_Jo_Duffy",
  "/wiki/Ron_Frenz",
  "/wiki/Star_Wars_(1977)_74",
  "/wiki/Star_Wars_(1977)_75",
  "/wiki/Star_Wars_(1977)_76",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Magazine_11",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Marvel_Series",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}