{
 "name": "Grimorg",
 "display_name": "Grimorg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3999 BBY",
      "Ambria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bogga the Hutt"
     ]
    }
   ]
  }
 ],
 "content": "Grimorg was a male Weequay enforcer in the employ of the Stenness Node–based crime lord Bogga the Hutt around 4,000 years before the Battle of Yavin. Grimorg was an officer on Bogga's flagship, Enforcer One, and used the warship to hunt down beings who had crossed the Hutt crime lord. He also served as a palace enforcer for Bogga at the crime lord's estate on the moon Vo Dasha.\nIn 4,000 BBY, Grimorg helped capture a team of ore-siphoning pirates, led by Finhead Stonebone, who were attacking a Nessie ore hauler. Grimorg brought Stonebone to Vo Dasha and left him at Bogga's mercy. Bogga spared Stonebone and forced him to take a team of pirates and enforcers, which included Grimorg, to Ambria to retrieve a lost shipment of Adegan crystals and eliminate Bogga's sworn enemy, Jedi Master Thon. Grimorg traveled with the group to Ambria, and the crystals were soon found in Master Thon's compound. Surprisingly, Thon refused to put up a fight, and Grimorg assisted in securing him to be taken back to Bogga. However, while Grimorg was doing this, the group was attacked by Thon's Jedi apprentice, Nomi Sunrider. Sunrider cut a swath through the invading crew with her lightsaber, and Grimorg was soon struck down.\nGrimorg, a male Weequay, worked as an enforcer for the Stenness Node–based crime lord Bogga the Hutt around 4,000 years before the Battle of Yavin. Grimorg was one of Bogga's most loyal palace enforcers and spent most of his time hunting down and capturing individuals who crossed the crime lord. He was also able to convince several of his Weequay clan members to join Bogga's enforcer gang. Grimorg's group was extremely successful, and as of 3999 BBY, Grimorg had not failed in any of his hunts. When searching for a target, Grimorg served aboard Bogga's flagship, the dreadnought Enforcer One, where he had the unenviable job of keeping control of the many Weequays, Nikto, Klatooinians, and Vodrans who served as crew hands and boarding troops.\nIn 3999 BBY, Grimorg, while serving on the Enforcer One, came across a group of pirates in the process of siphoning valuable ore from a Nessie Ithullian ore hauler in the Stenness Node. The Enforcer One tasked one of Bogga's pilots, Dreebo, to defend the ore hauler, but Dreebo's starfighter was quickly destroyed. As the pirates, led by Finhead Stonebone, boarded the hauler, the Enforcer One appeared in the vicinity and caught the pirate ship in its tractor beam. With the pirates captured, Grimorg ordered that the Enforcer One go to Bogga's estate on the moon of Vo Dasha. Upon landing on the moon, Grimorg brought a chained Stonebone, along with Stonebone's pirate associates, to Bogga. Grimorg shoved Stonebone into the dirt in front of the crime lord, leaving the pirate's fate in Bogga's hands. Bogga offered the pirate a chance to be redeemed, telling him that his crimes would be forgiven if he performed a task—going to the desolate planet Ambria to retrieve a lost shipment of Adegan crystals and eliminate Bogga's sworn enemy, Jedi Master Thon. Stonebone initially refused, prompting Bogga to unleash his hssiss pet, Ktriss, on Stonebone's first mate, Roko. Ktriss slaughtered Roko, scaring Stonebone into consenting to Bogga's offer.\nAfter Stonebone's agreement, a group consisting of imprisoned pirates and Hutt enforcers was formed to journey to Thon's compound on the Ambria. Grimorg joined the menagerie, and the group set out for Ambria in a convoy containing several sail barges. As the convoy traveled across the wastes of Ambria, Grimorg sighted Thon, along with his Jedi apprentice, Nomi Sunrider, on the planet's surface. Grimorg ordered the barge's gunmen to fire on the Jedi, but Thon was able to deflect the salvos with the Force. The convoy touched down near Thon's compound, and to their great surprise, Thon refused to fight back. As Grimorg worked to secure Thon and bring him onto their barge as a prisoner, one of Bogga's enforcers discovered the Adegan crystals in the compound. However, the discovery triggered a brawl between the enforcers and the pirates over who would receive credit for the retrieval of the jewels. Grimorg did not directly participate in the showdown at first, as he was still attending to the captive Jedi Master. Although he soon joined in, he fared poorly and was thrown to the ground by one of Stonebone's pirates. While the two groups were distracted by the brawl, Sunrider activated her lightsaber and attacked them. Despite Grimorg's encouragement of the band to kill the Jedi, he was soon slain by Sunrider.\nGrimorg was very gruff and rude toward his prey and held great disdain for Bogga the Hutt's opponents, especially pirates. He was very loyal to Bogga, who saw him as capable enough to be one of his top men. He despised Thon, calling the Tchuukthai Jedi Master \"a beast.\" However, he held respect for Thon's abilities in combat.\nWielding a pulse-wave rifle in combat, Grimorg was an extremely successful enforcer in the employ of Bogga. He and his Weequay clan members possessed a valuable skill that they called short-range communication. This ability allowed Weequays of the same clan to communicate through complex combinations of pheromones. Short-range communication allowed Grimorg and his clan members to easily corral and corner their prey.\nGrimorg first appears in the second issue of Star Wars: Tales of the Jedi — The Saga of Nomi Sunrider, the second story arc of the Tales of the Jedi comic book series, written by Tom Veitch and released over late 1993 to early 1994. He later reappears in the third and final issue of the arc, in which he is killed. In these issues, he is illustrated by David Roach. Further information on Grimorg is given in the 1996 reference book The Essential Guide to Vehicles and Vessels, and he was later given entries in the Star Wars Encyclopedia in 1998, the third edition of A Guide to the Star Wars Universe, Third Edition, Revised and Expanded in 2000, and The Complete Star Wars Encyclopedia in 2008.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/3999_BBY",
  "/wiki/Ambria/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Bogga",
  "/wiki/Bogga%27s_enforcer_gang",
  "/wiki/Stenness_Node",
  "/wiki/Crime_lord/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Core_Galaxy_Systems_Dreadnaught",
  "/wiki/Enforcer_One_(dreadnaught)",
  "/wiki/Warship/Legends",
  "/wiki/Bogga%27s_estate",
  "/wiki/Moon/Legends",
  "/wiki/Vo_Dasha",
  "/wiki/Finhead_Stonebone%27s_pirate_gang",
  "/wiki/Ore/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Finhead_Stonebone",
  "/wiki/Nessie",
  "/wiki/Ithullian_ore_hauler",
  "/wiki/Adegan_crystal/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Thon",
  "/wiki/Crystal/Legends",
  "/wiki/Ambria_Jedi_Enclave",
  "/wiki/Skirmish_on_Ambria",
  "/wiki/Padawan/Legends",
  "/wiki/Nomi_Sunrider",
  "/wiki/Lightsaber/Legends",
  "/wiki/Death/Legends",
  "/wiki/Time/Legends",
  "/wiki/Grimorg%27s_clan",
  "/wiki/Flagship/Legends",
  "/wiki/Nikto/Legends",
  "/wiki/Klatooinian/Legends",
  "/wiki/Vodran_(species)/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Dreebo",
  "/wiki/Gruna%27s_ore_hauler",
  "/wiki/Starfighter/Legends",
  "/wiki/Marauder_Starjacker",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Hssiss",
  "/wiki/Ktriss",
  "/wiki/First_Mate/Legends",
  "/wiki/Roko",
  "/wiki/Prison/Legends",
  "/wiki/Sail_barge/Legends",
  "/wiki/Gunner/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Tchuukthai",
  "/wiki/Pulse-wave_blaster",
  "/wiki/Short-range_communication",
  "/wiki/Pheromone/Legends",
  "/wiki/Tales_of_the_Jedi_4",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Saga_of_Nomi_Sunrider",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(comic_series)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Tom_Veitch",
  "/wiki/1993",
  "/wiki/1994",
  "/wiki/Tales_of_the_Jedi_5",
  "/wiki/David_Roach",
  "/wiki/1996",
  "/wiki/The_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/1998",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/2000",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Horse%27s_Mouth",
  "/wiki/Star_Wars_Insider_27",
  "/wiki/Tales_of_the_Jedi_Companion"
 ]
}