{
 "name": "Grimshaw",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kyuzo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "\"Old\" Grimshaw was a Kyuzo male who lived on the planet Jaresh. Shortly after the Battle of Hoth, Grimshaw's cousin Nyessa met with representatives of the Alliance to Restore the Republic and asked them to aid in confronting the Imperial presence on Jaresh. After initially refusing, the Rebel's leader Princess Leia Organa agreed to help and asked Nyessa if there was a barn they could hide in before the battle began. Nyessa suggested Grimshaw's as it overlooked the corral being used by the Imperials to hold the locals' livestock and claimed that Grimshaw could be trusted despite being her cousin. During the battle two of the Rebels rushed from the barn to attack the Imperials, while the commando Lokmarcha remained inside and provided cover fire.\nGrimshaw was first mentioned in the novel Moving Target: A Princess Leia Adventure, which was written by Cecil Castellucci and Jason Fry, and was released as a part of the Journey to Star Wars: The Force Awakens publishing program; which occurred on September 4, \"Force Friday\", 2015.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kyuzo",
  "/wiki/Gender",
  "/wiki/Planet",
  "/wiki/Jaresh",
  "/wiki/Battle_of_Hoth",
  "/wiki/Nyessa",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Grimshaw%27s_barn",
  "/wiki/Jowloon_corral",
  "/wiki/Commando",
  "/wiki/Lokmarcha",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure",
  "/wiki/Cecil_Castellucci",
  "/wiki/Jason_Fry",
  "/wiki/Journey_to_Star_Wars:_The_Force_Awakens",
  "/wiki/September_4",
  "/wiki/Force_Friday",
  "/wiki/2015",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure_(audiobook)"
 ]
}