{
 "name": "Grinder_(Corellian)",
 "display_name": "Grinder  (Corellian)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Short"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None",
      "but has a thick beard"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Seraphs"
     ]
    }
   ]
  }
 ],
 "content": "Grinder was a Corellian swoop mechanic and the de facto second-in-command of the Black Seraphs, a Corellian swoop gang, in which he served as the chief mechanic.\nHe was short, bald, bearded and muscular and considered a very unpleasant person. His muscular arms and torso were covered in colorful tattoos, and his personal hygiene was questionable. He rarely bathed, and his hands were permanently covered in grease. He always wore his racing outfit out of fear that it might get stolen.\nHis personality was anything but sympathetic. He never spoke kindly to anyone and would not lend a helping hand without some sort of reward. He was loyal towards the leader of the Black Seraphs, Sunny Bounder, but only selectively so, and he would not hesitate to rat her out for the right reward.\nWhat he lacked in personality, he made up for as a mechanic, having savant skills with swoop and speeder bike engines. He was also decent with a vibroknife and a blaster.\nGrinder serves as an antagonist, with rival status, in the role-playing game modular encounter scenario Taming the Dragon as part of the Suns of Fortune supplement. His selective loyalty is specified by the possibility that, if offered enough credits or leadership of the Black Seraphs by the player characters, he may not only reveal Sunny Bounder's secrets but also help the player characters fight Bounder.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Eurrsk_Thri%27ag",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black_Seraphs",
  "/wiki/Corellian/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Swoop_gang/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Sunny_Bounder/Legends",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Vibroknife",
  "/wiki/Blaster/Legends",
  "/wiki/Suns_of_Fortune",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Taming_the_Dragon"
 ]
}