{
 "name": "Groff_Ditcher",
 "display_name": "Groff Ditcher",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Groff Ditcher was a brutish human male who worked as the foreman of Tibidon Station, a sand whaling station on the desert planet Tatooine. In 9 BBY, he shoved his employee Padu Cherd and threatened to pay him nothing when Cherd complained at only receiving half pay. Obi-Wan Kenobi scowled at Ditcher but said nothing, causing the foreman to scoff. Ditcher later pushed to the front of a line for water in Anchorhead but had the water thrown from his hand by the former Inquisitor Reva Sevander.\nGroff Ditcher was a brutish human male who worked as foreman of Tibidon Station, a sand whaling station established to harvest meat from the carcass of a large tibidon sand whale in the deserts of the planet Tatooine. Following one shift at the site in 9 BBY, Ditcher stood by a GNK-series power droid with a payment dispenser attached to its head as the laborers used their punch discs to collect their credits for the day.\nAfter collecting his payment, laborer Padu Cherd complained that it was only half and pleaded with Ditcher for the rest, but the foreman shoved Cherd away and warned that he would pay him nothing at all if he spoke another word. Obi-Wan Kenobi, the last laborer in the line, then scowled at Ditcher as he approached, but when the foreman asked if Kenobi had anything to say, the laborer silently took his payment and moved on to board the transport back to the town of Anchorhead. Ditcher scoffed and then began speaking to other workers at the site in an alien language.\nSometime later, Ditcher was in Anchorhead, where he pushed to the front of a line for water being served by the cart vendor Dardin Shull from a portable vaporator. Pushing the old man at the front of the queue out of the way, Ditcher took a filled cup from Shull's hands as the vendor frowned at him.\nThe foreman questioned if Shull had something to say, but the former Inquisitor Reva Sevander, who stood in the line behind him, answered him instead. Ditcher told her to wait her turn, but using the Force she threw the water from his hand and glared at him as he silently backed away. She then questioned Shull on the whereabouts of the moisture farmer Owen Lars.\nGroff Ditcher was a brutish man and a bully. He pushed and threatened Padu Cherd when the laborer pleaded for his family's sake and tried to intimidate Kenobi, Shull, and Reva, although he backed away after seeing the latter use the Force. Ditcher had light skin, brown hair, and green eyes.\nDitcher wore a light brown shirt, a brown belt over a black apron, brown pants, brown gloves, and brown boots.\nGroff Ditcher was portrayed by Heath McGough in the Obi-Wan Kenobi television series, where he first appeared in the first episode which aired on May 27, 2022. Ditcher's name is not spoken in the episode but appears in the credits.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Groff_Ditcher",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/File:Cherd-Ditcher-OBK1.ogg",
  "/wiki/Foreman",
  "/wiki/Tibidon_Station",
  "/wiki/Tibidon_sand_whale",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/9_BBY",
  "/wiki/Padu_Cherd",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Water",
  "/wiki/Anchorhead",
  "/wiki/Inquisitor",
  "/wiki/Reva_Sevander",
  "/wiki/File:Ditcher-Something-OBK1.ogg",
  "/wiki/Foodstuff",
  "/wiki/GNK-series_power_droid",
  "/wiki/Payment_dispenser",
  "/wiki/Punch_disc",
  "/wiki/Credit",
  "/wiki/Standard_day",
  "/wiki/Alien",
  "/wiki/Language",
  "/wiki/Dardin_Shull",
  "/wiki/Portable_vaporator",
  "/wiki/The_Force",
  "/wiki/Moisture_farmer",
  "/wiki/Owen_Lars",
  "/wiki/File:Ditcher-Moving-OBK1.ogg",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Heath_McGough",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Part_I",
  "/wiki/May_27",
  "/wiki/2022",
  "/wiki/Part_VI",
  "/wiki/Obi-Wan_Kenobi:_A_Jedi%27s_Return",
  "/wiki/Category:Audio_files_of_Groff_Ditcher",
  "/wiki/Category:Images_of_Groff_Ditcher",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}