{
 "name": "Grommik Kurthson",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Czerka Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Grommik Kurthson was a Human male security officer for the Czerka Corporation that operated prior to the Cold War.\nIn 3643 BBY, Grommik was a Czerka corporation security guard at their secret base on Tatooine. The expedition was sent to study an artifact uncovered on Tatooine which was in fact a Rakatan mind prison that contained The Imprisoned One. When the relic was activated, it killed all the scientists and animating their remains, which left Kurthson the only survivor. He only managed to survive after sealing off the base trapping the possessed scientists inside. Following this he set up a moisture farm on Tatooine and lived an isolated life in it's deserts.\nWhile living on the desert planet, Grommik encountered a Republic spacer who assisted him in repairing his broken equipment. In exchange for information about the secret base. But just after the task was complete, Gayem Leksende, a rogue Czerka operative, appeared via hologram, claiming responsibility for sabotaging his equipment to lure any potential interlopers to him. Gayem's airship then unleashes bombardment on Grommik's farm and dropped assassins droids to kill the occupants. Grommik led the space to his safe room to survive the bombardment. With Gayem presuming they would asphyxiate to death, Grommik then revealed his hidden escape tunnel. He then provides the hero with the locations of the data caches required to uncover the secret base.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/3643_BBY",
  "/wiki/Tatooine/Legends",
  "/wiki/Rakata/Legends",
  "/wiki/Mind_prison",
  "/wiki/The_Imprisoned_One",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Gayem_Leksende",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}