{
 "name": "Groodo",
 "display_name": "Groodo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Esseles"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation"
     ]
    }
   ]
  }
 ],
 "content": "Groodo the Hutt—the brother of Rigorra and the father of Boonda—operated what he claimed to be 'legitimate' business interests, particularly in starship manufacturing, during the waning years of the Galactic Republic.\nThe crimelord's luxurious domicile was a five-level palace located a kilometer east of Calamar—the capital city of Esseles in the Darpa sector and a major center of hypernautics and advanced hyperdrive specialization. The Hutt's huge fortress compound included a factory and was surrounded by a high wall. Groodo's criminal activities were fronted by 'legitimate' business interests in Esseles, including the operation of his successful compound factory that specialized in the manufacture of customized hyperdrive engines. While still maintaining ownership of the factory, he later turned it over to his son Boonda when he focused his energies on the development of Groodo Starship Yards, his modular industrial satellite that orbited Esseles. The starship yard had the unusual feature of a mammoth enclosed hangar. The practicality of orbital yards was that they allowed for the construction of large starships in zero gravity. But since enclosed hangars restricted movement around the ships during construction, their only good use was to maintain secrecy. Groodo's hangar was large enough to conceal a 400-meter-long starship: it was, of course, in due time, the construction site of the ill-fated, full-size replica of the legendary Sun Runner.\nResponsible for the Bartokk attack on Trinkatta Starships' factory on Esseles in 33 BBY, Groodo had been hired by the Trade Federation to build a small but powerful hyperdrive. Darth Maul eradicated Groodo's plans to steal from Trinkatta both the hyperdrive prototype and the 50 Vulture-class droid starfighters its manufacture would power. But instead of killing him, Maul left Groodo to live on in fear.\nIn 23 BBY, Groodo at last was able to produce a counterfeit of the ancient transport vessel, the Sun Runner, which he intended to use to destroy the Fondor Shipyards in the Tapani sector, in order to gain more business for his own factories. The replica ship was deliberately distressed to make it look four thousand years old, but outfitted with a state-of-the-art power source, navigational equipment, and armaments. Groodo's scheme, carried out in collusion with Senator Rodd and Hurlo Holowan, to both destroy the shipyards and take over and destroy the Fondor Spaceport and surface factories was foiled, however, by the Jedi Bultar Swan, Obi-Wan Kenobi, Anakin Skywalker, Mace Windu, and Kit Fisto.\nGroodo enlisted the help of his brother, the Balmorra warlord Rigorra, to create false evidence, using all the necessary resources and technology, that would blame Groodo's own son, the relatively innocent Boonda, for concocting the entire scheme to wreak havoc on the starship yards of Fondor.\nSoon thereafter, however, Groodo was hunted down by both Jango Fett, the bounty hunter who was hired by Darth Tyranus to take the Hutt alive, and hunters Cradossk and his son Bossk, who were simultaneously hired for the job  by Wat Tambor, Foreman of the Techno Union and a member of the Separatist Council. Fett, in the end, was the one to achieve the task at Rigorra's castle on Balmorra, and he turned Groodo over to Darth Tyranus alive. The Sith Lord, impressed with the concept of the Sun Runner scheme hatched by Groodo, Senator Rodd and Holowan—and with the ingenuity, ambition, talent, and secrecy they demonstrated—wished to recruit them to his cause.\nGroodo, a very old and \"incredibly corpulent\" Hutt, spared few luxuries—in life, in general, but also on his private cruiser. Like most Hutts, however, his aesthetic tastes were questionable. Groodo's cruiser had broad decorative fins, large oval viewports, and a lurid color scheme of red, orange, and yellow; Groodo's lush cabin was lined with striped animal pelts. Everything was designed for maximum visibility and to show off Groodo's considerable wealth.\nThough Groodo indulged in many pleasures, revenge was at the top of his list: the Hutt actually looked forward to being wronged, so that he might exact vengeance upon his enemies.\nGroodo's palatial compound on Esseles was defended by a squadron of Razor Eaters, vicious assassin droids designed by Hurlo Holowan; their razor-sharp teeth could bite through virtually anything. Jango Fett was forced to contend with Groodo's Razor Eaters when on his Darth Tyranus-commissioned search of the Hutt and his accomplices, Rodd and Holowan.\nGroodo enjoyed eating handfuls of crawling mukkmaggots. Beyond being a favorite food, they helped to steady his nerves. Having been made a warlord of Balmorra by his brother, Groodo also indulged himself in Rigorra's fermented-beverage cellar, to which Groodo was given a key.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Esseles/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Rigorra",
  "/wiki/Boonda/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Palace",
  "/wiki/Calamar",
  "/wiki/Capital/Legends",
  "/wiki/Darpa_sector",
  "/wiki/Hypernautics",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Fortress/Legends",
  "/wiki/Factory/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Satellite/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Shipyard/Legends",
  "/wiki/Gravity/Legends",
  "/wiki/False_Sun_Runner",
  "/wiki/Sun_Runner",
  "/wiki/Bartokk",
  "/wiki/Trinkatta_Starships",
  "/wiki/33_BBY/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/23_BBY/Legends",
  "/wiki/Fondor_Shipyards/Legends",
  "/wiki/Tapani_sector/Legends",
  "/wiki/Hypermatter_annihilator",
  "/wiki/Navigational_sensor",
  "/wiki/Sensor_jammer/Legends",
  "/wiki/Guided_missile/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Rodd",
  "/wiki/Hurlo_Holowan",
  "/wiki/Fondor_Spaceport",
  "/wiki/Jedi/Legends",
  "/wiki/Bultar_Swan/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Cradossk/Legends",
  "/wiki/Bossk/Legends",
  "/wiki/Wat_Tambor/Legends",
  "/wiki/Foreman/Legends",
  "/wiki/Techno_Union/Legends",
  "/wiki/Separatist_Council",
  "/wiki/Balmorra/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Fondor_Space_Patrol",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Viewport",
  "/wiki/Razor_Eater",
  "/wiki/Millennium_Falcon_(novel)",
  "/wiki/Millennium_Falcon_(audiobook)",
  "/wiki/Episode_I_Adventures_3:_The_Fury_of_Darth_Maul",
  "/wiki/Episode_I_Adventures_4:_Jedi_Emergency",
  "/wiki/Star_Wars_Adventures_1:_Hunt_the_Sun_Runner",
  "/wiki/Star_Wars_Adventures_2:_The_Cavern_of_Screaming_Skulls",
  "/wiki/Star_Wars_Adventures_3:_The_Hostage_Princess",
  "/wiki/Star_Wars_Adventures_4:_Jango_Fett_vs._the_Razor_Eaters",
  "/wiki/Star_Wars_Adventures_5:_The_Shape-Shifter_Strikes",
  "/wiki/Star_Wars_Adventures_6:_The_Warlords_of_Balmorra",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_140",
  "/wiki/Wizards.com",
  "/wiki/Hutt!_Hutt!_Hutt!",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Episode_I_Adventures_1:_Search_for_the_Lost_Jedi",
  "/wiki/Episode_I_Adventures_2:_The_Bartokk_Assassins"
 ]
}