{
 "name": "Grox",
 "display_name": "Grox",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lasat"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grox's pirate crew",
      "Tech Masters"
     ]
    }
   ]
  }
 ],
 "content": "Grox was a male Lasat who led a pirate crew aboard a cruiser during the Galactic Civil War. At one point he lost one of his eyes, which he replaced with a cybernetic eye. Grox's pirate crew regularly sold scavenged goods to the Tech Masters, who paid well for their work. Some time after the Battle of Yavin he encountered Luke Skywalker and Leia Organa as the two searched for the missing medical transport Nema aboard the Millennium Falcon. The pirate cruiser sent out out a distress call, which Skywalker and Organa responded to. When they approached with the Millennium Falcon, the pirate ship captured the YT-1300 light freighter with a clamp, and siphoned its power. Grox then led a boarding party onto the Falcon, consisting of the Nephran Mirack, the Quarren Kragan Gorr and an assassin droid nicknamed PALLAS-Eleven. Finding only an apparently empty ship, due to the Millennium Falcon's crew hiding in a secret compartment, Grox ordered his crew to bring the ship to the planet Trionak, where they planned to sell it to the Tech Masters.\nGrox first appeared in the 2018 junior novel Choose Your Destiny: A Luke \u0026 Leia Adventure, which allows readers to make choices as they read, with one official canon path. While Grox does not come face to face with Luke Skywalker and Leia Organa in the canon path, he does in alternate paths. In one path, Grox discovered Skywalker and Organa hiding in Han Solo's. Threatening them with his bo-rifle, Grox warned Skywalker not to fight back with his lightsaber and the two were captured. In another path, Skywalker and Organa attempt to fight Grox's pirate crew in a head on fight and are quickly overwhelmed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lasat",
  "/wiki/Gender",
  "/wiki/Cybernetics",
  "/wiki/Eye",
  "/wiki/Tech_Masters",
  "/wiki/Pirate",
  "/wiki/Galactic_Civil_War",
  "/wiki/Scavenger",
  "/wiki/Currency",
  "/wiki/Battle_of_Yavin",
  "/wiki/Luke_Skywalker",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Transport",
  "/wiki/Nema",
  "/wiki/Millennium_Falcon",
  "/wiki/Starship",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Nephran",
  "/wiki/Mirack",
  "/wiki/Quarren",
  "/wiki/Kragan_Gorr",
  "/wiki/Assassin_droid",
  "/wiki/PALLAS-Eleven",
  "/wiki/Planet",
  "/wiki/Trionak",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Grox",
  "/wiki/2018",
  "/wiki/Choose_Your_Destiny:_A_Luke_%26_Leia_Adventure",
  "/wiki/Han_Solo",
  "/wiki/Bo-rifle",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Lightsaber"
 ]
}