{
 "name": "GrrKack",
 "display_name": "GrrKack",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Paradise system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ugor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "GrrKack was an Ugor Tax Chaplain during the Galactic Civil War. He operated from the Paradise system and greeted anyone who visited in search of ancient pieces of salvage from the system-spanning junkyard. Backed by two Ugor Tax Enforcers, the Tax Chaplain escorted pilgrims to the ship of the Chief Tax Chaplain, ArrGack. GrrKack was responsible for alerting pilgrims to the High Ugorian Law in effect in the Paradise system. He and his superior officer, ArrGack, were open to bribes for exemptions to certain of these stipulations.\nGrrKack wore a suit of rhodium-plated combat armor with a screw-top helmet and brandished four mega-flame guns, two needle-launchers, and six boring-lasers in multiple pseudopodia. A loudhailer incorporated into his suit amplified GrrKack's deep, mournful voice, although his mastery of the device was far from perfect. Like other Ugors, GrrKack hated Squibs, considering them demons fit for little more than sacrifice to the Angel of Taxations and Imports.\nGrrKack features as a minor antagonist in the adventure Scavenger Hunt, written by Brad Freeman and published by West End Games in 1989 for Star Wars: The Roleplaying Game. The Ugor meets the player characters when they enter the Paradise system and thus serves as their introduction to the Ugor species. Despite his fearsome appearance and arsenal of weaponry, the adventure indicates that the players should try to get past GrrKack and the other Ugors by negotiation with and cajoling rather than aggression.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Paradise_system",
  "/wiki/Ugor/Legends",
  "/wiki/Tax_Chaplain",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Tax_Enforcer",
  "/wiki/Chief_Tax_Chaplain",
  "/wiki/ArrGack",
  "/wiki/Rhodium",
  "/wiki/Armor/Legends",
  "/wiki/Mega-flame_gun",
  "/wiki/Needle-launcher",
  "/wiki/Boring-laser",
  "/wiki/Loudhailer/Legends",
  "/wiki/Squib/Legends",
  "/wiki/Demon/Legends",
  "/wiki/Angel_of_Taxations_and_Imports",
  "/wiki/Scavenger_Hunt",
  "/wiki/Brad_Freeman",
  "/wiki/West_End_Games",
  "/wiki/1989",
  "/wiki/Star_Wars:_The_Roleplaying_Game"
 ]
}