{
 "name": "Grub  (Ambassador)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Evocii"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Grub was a male Evocii ambassador of the Hutt Cartel Supreme Mogul Karagga during the Galactic War. Following the Annexation of neutral systems by Karagga the Hutt in 3639 BBY, and in view of a possible armed conflict between the Cartel and the reconstituted Sith Empire, Grub was sent to mediate on the Hutt's behalf with the Empire's ambassador Rove aboard the Ziost Shadow. Grub tried to downplay Karagga's aggression, yet as the negotiations stalled, Rove authorized an Imperial strike team to shuttle down to the surface of Hutta to discuss the matter with Karagga face-to-face. The negotiations having broken apart, the confrontation ended in violence as Karagga was killed, leaving the leadership position of the Hutt Cartel vacant.\nA male Evocii, Grub served the Hutt Cartel as an ambassador during the Galactic War between Galactic Republic and Sith Empire. Around 3639 BBY, Grub was aboard the Sith Empire's capital ship Ziost Shadow, meeting Ambassador Rove of the Imperial Diplomatic Service, as an Imperial strike team arrived.\nDespite his Evocii people being greatly mistreated by the Hutts, Grub worked as their representative.\nAmbassador Grub appears in the 2011 video game Star Wars: The Old Republic, in Update 1.1 \"Rise of the Rakghouls\". He is featured in the Empire-sided operation \"Karagga's Palace,\" as part of the quest \"Best Foot Forward.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Grub_(disambiguation)",
  "/wiki/Evocii",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Ambassador/Legends",
  "/wiki/Supreme_Mogul",
  "/wiki/Karagga",
  "/wiki/Galactic_War",
  "/wiki/Annexation_of_neutral_systems",
  "/wiki/Hutt/Legends",
  "/wiki/3639_BBY",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Rove_(Ambassador)",
  "/wiki/Ziost_Shadow",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Imperial_Diplomatic_Service",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/2012",
  "/wiki/Galactic_Standard_Calendar"
 ]
}