{
 "name": "Gruk  (Gamorrean)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gamorrean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.5 meters"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Gruk, or Green Gruk, was a male Gamorrean pirate who was the leader of a small pack of other Gamorreans. In 0 ABY, Gruk was on the space installation known as StarForge Station when the Alliance to Restore the Republic privateering frigate Far Orbit showed up there, looking for more crew. Gruk joined the ship, primarily because he liked to fight.\nGruk, also known as Green Gruk, was a male Gamorrean pirate who led a small pack of fellow Gamorrean warriors. In 0 ABY, during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic, he was present on the space station StarForge Station, which was located in the Mid Rim's StarForge Nebula. That year, the Alliance privateering EF76 Nebulon-B escort frigate Far Orbit visited the station looking for new hands, as some of the crew of the Far Orbit had just mutinied from under Imperial control before becoming privateers. Gruk signed up for a berth on the frigate, though it was because he liked to fight rather than an interest in what the privateers were doing.\nAlthough Gruk was given a spot on the ship, he would not obey any orders unless they came from a person who had bested him in a physical contest. If someone beat Gruk in a fight, the Gamorrean and his pack would become the followers of that individual. At some point during Gruk's service aboard the Far Orbit, a strong Human engaged the Gamorrean in a duel and ended up suffering a broken back. In retaliation, a group of Human crewmen began attacking certain fellow alien crewers with clubs, and soon isolated beatings occurred, the targets of which were both Humans and non-Humans.\nMeasuring 1.5 meters tall, Gruk was a large, smelly, and warty green Gamorrean who liked to fight. A leader of a pack of members of his species, he would not take orders from anyone who had not beaten him in a test of physical strength. Gruk joined the privateers not because he cared about striking back at the Empire, but because he wanted to fight. As a Gamorrean, he ate almost anything but was a messy eater.\nGruk wielded an axe and wore studded leather armor as well as bracelets, earrings, armbands, and rings. Additionally, Gruk wore two morrts, which were parasitic creatures. Intimidating, Gruk was good at melee fighting and was fairly good at making repairs to armor. He also had the survival skills it took to stay alive on the Gamorrean homeworld of Gamorr.\nGruk first appeared in the adventure scenario Preparing for War, published in 1998's The Far Orbit Project, by Timothy S. O'Brien. The book was a supplement to West End Games' Star Wars: The Roleplaying Game and was a sequel of sorts to the previous publication, Pirates \u0026 Privateers, carrying on that book's theme by following the Far Orbit's adventures. Gruk was provided as a sample character who could join the ship's crew at StarForge Station, and it is up to the players if he gets a berth on the ship. However, as Gruk will not obey any leader unless that person has personally bested him, this article assumes a player-character beat Gruk. The size of the Gamorrean's pack can be determined by rolling a die in the game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Gamorrean/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Canon",
  "/wiki/Gruk",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/StarForge_Station",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Privateer/Legends",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Far_Orbit",
  "/wiki/Frigate/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Mid_Rim",
  "/wiki/StarForge_Nebula",
  "/wiki/Standard_year/Legends",
  "/wiki/Mutiny_on_the_Far_Orbit",
  "/wiki/Roleplaying_game",
  "/wiki/Starship/Legends",
  "/wiki/Unidentified_Human_(Far_Orbit)",
  "/wiki/Alien/Legends",
  "/wiki/Club/Legends",
  "/wiki/Species/Legends",
  "/wiki/Axe",
  "/wiki/Leather/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Bracelet/Legends",
  "/wiki/Piercing/Legends",
  "/wiki/Ring/Legends",
  "/wiki/Morrt",
  "/wiki/Parasite/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Gamorr/Legends",
  "/wiki/Preparing_for_War",
  "/wiki/1998",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/Timothy_S._O%27Brien",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Standard_week/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Scum_and_Villainy_(sourcebook)",
  "/wiki/Children_of_the_Jedi_(novel)",
  "/wiki/The_Essential_Atlas"
 ]
}