{
 "name": "Grumme Vinn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Grumme Vinn was a male Duros spacer and free-trader who operated during the Galactic Civil War. He was the captain of the Corsa-Vinn, and aided the Rebel Alliance in resisting the Galactic Empire.\nA male Duros born into a family of smugglers, Grumme Vinn turned away from his heritage once he was old enough to learn about the dishonest living his parents made in the smuggling trade. Finding no pride in his family, Grumme ran away from home and intended to redeem the Vinn family name by starting up a legal transportation business. He inherited his family's former smuggling vessel, a dilapidated Ghtroc Class 720 freighter named the Corsa-Vinn, which he flew along the backwater hyperlanes of the Outer Rim Territories.\nHowever, Vinn's intention of running a successful cargo hauling business did not go as planned, and years of upholding his moral code took their toll, leaving him with a worn and wrinkled appearance. In later years the grumpy captain took whatever legitimate jobs he could find, including hauling supplies to settlements, transporting passengers, and running specialty cargo for picky clients. He generally had little to do with smugglers, preferring his own company, and earned few friends. On several occasions he was almost conned into taking on hidden contraband by crooked drop point agents, but Grumme remained noble despite considering his moral code more of a burden as he grew older.\nUnlike the smugglers in his family and the lawless individuals of the Outer Rim Territories, Grumme Vinn maintained a strong moral code, considering himself a legitimate and noble businessperson. However, he was not an optimistic Duros, and many of his attempts at legal business failed by upholding his code, which he came to see as a burden in later years. Vinn refused to consort with smugglers, avoiding them in spaceports by preferring to sit alone in a dark corner, and had few friends. He tended to regard everyone with an equal measure of suspicion, although did not carry a blaster to protect himself.\nIn his later years, Grumme Vinn was a sour and grumpy individual, and his physical appearance deteriorated with the pressures of maintaining his moral code. His face became worn and wrinkled, and his wide eyes began greying over. He flew the Ghtroc Industries Class 720 freighter Corsa-Vinn, and typically wore spacer's coveralls and carried a datapad.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Corsa-Vinn",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Ghtroc_Industries/Legends",
  "/wiki/Class_720_freighter",
  "/wiki/Hyperlane",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Platt%27s_Smugglers_Guide",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Duros",
  "/wiki/Star_Wars_Gamer_2"
 ]
}