{
 "name": "Grunta",
 "display_name": "Grunta",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Muunilinst"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dug"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Barely one meter"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nal Kenuun"
     ]
    }
   ]
  }
 ],
 "content": "Grunta was a Dug male podracer who lived in the city of Pilaan on the planet Muunilinst. In 0 ABY, a few months after the Battle of Yavin, Grunta encountered the Rebels Luke Skywalker, Leia Organa, Han Solo, Chewbacca, and Tobin Elad on the outskirts of Pilaan.\nAs the Rebels were trying to find a way to meet with the Muun Nal Kenuun, Grunta offered to arrange a meeting with Kenuun, whom he worked for as a podracer, in exchange for one hundred credits. Instead, the Rebels were led into an ambush by four Dug companions of Grunta armed with blasters and riding swoops. During the brief fight, Solo blasted one of the swoops' starboard engines, and it crashed on Grunta, killing him instantly.\nGrunta was a Dug male who resided in the city of Pilaan on the planet Muunilinst. He worked as a podracer pilot under the employ of Nal Kenuun, a feared Muun gambler. In 0 ABY, a few months after the Battle of Yavin, Grunta met the Rebels Leia Organa, Luke Skywalker, Han Solo, Chewbacca, and X-7, the latter of whom the Rebels were unaware was actually an Imperial assassin secretly using the alias Tobin Elad.\nInside a cantina located outside Pilaan, the Rebels attempted to find information on how to contact Kenuun, but they were unsuccessful as the locals refused to cooperate. Grunta approached the Rebels and offered to arrange a high-stakes game—with a ten thousand–credit buy-in—with Kenuun in return for a hundred-credit fee. Solo agreed to the proposition, and the Rebels followed Grunta deep to the city's outskirts.\nInstead of a high-stakes game, the Rebels were led by Grunta into an ambush by four of his fellow Dugs flying swoops and armed with blasters. Grunta demanded that they hand over all of their credits, and the Rebels decided to fight back. After a short skirmish, the Dugs chose to retreat as one of them was killed by Solo, who shot the starboard engine of the pilot's swoop, crashing it with a fiery explosion. Grunta, who was wrestled into the ground by Chewbacca, was also among those who perished in the brief melee when the swoop's remains crashed into him.\nAfter the ambush, the Rebels were captured by Imperial stormtroopers working for Kenuun, who, upon meeting them in his home, revealed he had a homing droid shadow Grunta as a precaution due to his penchant for trouble, enabling Kenuun's stormtroopers to capture the Rebels. Kenuun offered the Rebels a deal in which one of them would take Grunta's place in an upcoming podracing event in exchange for a datacard that Kenuun had taken from Mak Luunim, a Rebel Alliance contact on the planet. The datacard contained a set of secret financial accounts that the Rebellion desperately needed, as most of their funds had been lost after the planet Alderaan was destroyed. As retrieving the datacard was their mission in the first place, Skywalker agreed to take Grunta's spot.\nWith Grunta's death, all of Kenuun's fellow Muuns who were competing against him were overjoyed at the news. One Muun in particular, Chenik Kruun, was known to be cold-blooded and emotionless yet, according to Beeerd, Kruun almost smiled when he heard of Grunta's demise, delighted at the prospect of finally being able to beat Kenuun in a race. When Han Solo admitted to having a part in Grunta's death, a crowd of podracing pilots and crewmen gathered inside a large tent near the racetrack, where they passed time before the race, and cheered the news. Haari Ikreme Beeerd, who was a crewman for another podracer, even befriended Solo and treated the crowd to another round of drinks.\nGrunta was short and scaly and was barely a meter tall, which was shorter than most Dugs. Nal Kenuun described Grunta as someone possessing a talent for trouble, which was why he had a homing droid keeping track of the Dug. When he was not racing, Grunta engaged in the armed robbery of individuals with the help of his Dug companions.\nGrunta was a character created by author Alex Wheeler for the 2008 novel Rebel Force: Target, the first volume in the Rebel Force series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/0_ABY/Legends",
  "/wiki/Muunilinst/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Nal_Kenuun",
  "/wiki/Podracer/Legends",
  "/wiki/City/Legends",
  "/wiki/Pilaan",
  "/wiki/Planet/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/X-7",
  "/wiki/Muun/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Blaster/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Death/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Unidentified_Muunilinst_cantina",
  "/wiki/Fire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Nal_Kenuun%27s_apartment",
  "/wiki/Homing_droid",
  "/wiki/Podracing/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Mak_Luunim",
  "/wiki/Alderaan/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Chenik_Kruun",
  "/wiki/Blood/Legends",
  "/wiki/Podracer_(profession)/Legends",
  "/wiki/Time/Legends",
  "/wiki/Haari_Ikreme_Beeerd",
  "/wiki/Gilag_Pitaaani",
  "/wiki/Droid/Legends",
  "/wiki/Alex_Wheeler",
  "/wiki/2008",
  "/wiki/Rebel_Force:_Target",
  "/wiki/Star_Wars:_Rebel_Force",
  "/wiki/A_New_Hope:_The_Life_of_Luke_Skywalker",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/0_ABY"
 ]
}