{
 "name": "Gruu Dunrik",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Gruu Dunrik was a male Human doctor who was once a Jedi Initiate who studied at the Coruscant Jedi Temple in the waning years of the Galactic Republic. Despite passing through the Temple academy, Dunrik was never selected by a Jedi Master for further training as a Padawan and therefore left the Order.\nSeveral decades later, Dunrik was serving as a medical officer in the Alliance to Restore the Republic on Aargonar 3.\nA Force-sensitive Human, Gruu Dunrik received training in the ways of the Force at the Coruscant Jedi Temple. An Initiate in the Temple's academy, Dunrik successfully graduate from the academy with intentions to study as a Guardian; however he was not selected as a Padawan by a Jedi Master in the time following his achievement. Per the Order's strict bylaws, Dunrik could not progress without a master and was therefore not permitted to remain at the Temple.\nDunrik's life after he left the Order is unknown; he may have left the Order completely, or been reassigned to the Jedi Service Corps, most likely the Medical Corps as he would later find work as a medic after the rise of the Galactic Empire and the disbanding of the Jedi Order. As he was not a member of the Order during the Clone Wars, Dunrik did not fall victim to the Great Jedi Purge. When the oppression of the Empire spurned rebellion, Dunrik joined the Alliance to Restore the Republic as a medical officer and was stationed at the Alliance's bases on Aargonar 3. During his time with the Alliance, Doctor Dunrik longed to see the Order restored, and would try and intercept any Force-sensitives that he detected. Using his minimal knowledge in the Force, Dunrik sought to unlock the hidden potential within his patients with the thought that one day they could pose a threat to the Galactic Emperor himself.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Aargonar_3",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Jedi_Service_Corps/Legends",
  "/wiki/Medical_Corps/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Aargonar_3_rebel_base",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Rebellion_Era_Sourcebook"
 ]
}