{
 "name": "Gryyzak",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Alliance Against Zakuul"
     ]
    }
   ]
  }
 ],
 "content": "Gryyzak was a male Wookiee Senator of the Galactic Republic in the aftermath of the Zakuul–Republic treaty.\nIn 3631 BBY Gryyzak's friend Hylo Visz offered him an invitation to ally with the Anti-Zakuul Alliance, but lost his signal in the Alderaan system. On the surface of Alderaan, Gryyzak was supposed to meet with a Talz senator at the Parliament, but the meeting was interrupted by an attack by the ferocious Talz Broonmark, forcing both Senators into protective custody. Broonmark chased the senators and their bodyguards and eventually killed all except Gryyzak. When he was about to finish him off, the Alliance Commander arrived, sent by Hylo Visz to check up on Gryyzak. Broonmark explained that he wanted to kill the Wookiee for his peacekeeping efforts with the Talz, which Broonmark saw as robbing them of their true nature. The Alliance Commander refused to allow an innocent to be killed and Broonmark attacked him, refusing to be spared after being defeated. Gryyzak then expressed his thanks to his rescuer and provided his aid to the Alliance.\nGryyzak appears in Star Wars: The Old Republic: Knights of the Fallen Empire during Broonmark Alliance alert mission. The only way to recruit Broonmark is through a dark side option allowing him to kill Gryyzak, any attempts to negotiate with him are in vain as long as the Wookiee is alive. An exception is made to the Sith Warrior who can manage to ward off Broonmark from killing the Senator. The Wrath is able to recruit Broonmark as a companion, and enlist Gryyzak's aid in the fight against Arcann. If Gryyzak is killed during this encounter and Broonmark is recruited, Hylo will express her disgust regarding the overall outcome of the mission and vows to never let Broonmark near her or her smugglers on Odessen.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Eternal_Alliance",
  "/wiki/Senator/Legends",
  "/wiki/Zakuul%E2%80%93Republic_treaty",
  "/wiki/3631_BBY",
  "/wiki/Hylo_Visz",
  "/wiki/Alderaan_system/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Talz/Legends",
  "/wiki/Broonmark",
  "/wiki/Alliance_Commander",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Arcann",
  "/wiki/Odessen",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}