{
 "name": "Guania",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Guania was a male Wookiee who lived on the planet Kashyyyk at the end of the Clone Wars in 19 BBY. In that year, Jedi Masters and clone troopers of the Galactic Republic came to the Wookiee world and helped its inhabitants resist an assault by the Separatist Droid Army in one of the final battles of the war. After the battle droids surrendered, however, all Jedi were declared enemies of the Republic and were targeted for execution. The war promptly ended, and Guania and many other Wookiees began to clean up the battleground on Kashyyyk and salvage leftover machinery. Days after the fighting, the Human liaison Cudgel informed Guania, the hunter Lachichuk, and two other Wookiees that a group of traders had arrived on Kashyyyk and were asking questions about Jedi. The Wookiees confronted them with bowcasters drawn until they learned that the traders were actually Jedi on the run, at which point they brought the fugitives to see the Wookiee General Tarfful and his friend Chewbacca.\nThe Wookiee male Guania lived on his species' homeworld of Kashyyyk in 19 BBY, the final year of the galaxy–spanning Clone Wars. In that year, a large battle was fought on Kashyyyk in the city of Kachirho. Aided by several Jedi Masters and clone troopers of the Grand Army of the Republic, Wookiee warriors resisted a ground assault by the droid army of the Confederacy of Independent Systems. Although the battle droids surrendered, clone troopers across the galaxy suddenly attacked their Jedi Generals after the Republic's Supreme Chancellor declared all Jedi to be enemies of the government. The Chancellor then brought the war to an end and had all Confederate battle droids shut down, which prompted the Republic forces to depart Kashyyyk. Guania joined in a large Wookiee effort to clean up the site of the battle and salvage the machinery that was left over.\nDays later, Guania was outside of Kachirho at a busy landing platform that saw traders frequently make planetfall. He was with the famed hunter Lachichuk and two other Wookiees when the group was approached by Cudgel, a Human liaison who understood the Wookiees' Shyriiwook language. Cudgel informed them that a group of traders had just arrived and were asking questions about Jedi, and Guania and his companions followed the Human to the traders' ship. They brandished their bowcasters and demanded to know what the newcomers' interest in Jedi was, and the trader Olee Starstone stated that they were Jedi on the run who were looking for other survivors of the Great Jedi Purge. Her defiant comrade Siadem Forte contradicted her in an effort to protect their identities, and Guania began to suspect that they were bounty hunters who were seeking Jedi contracts. However, when Starstone named the Jedi Generals who had fought on Kashyyyk and pleaded for the group's help, the sympathetic Wookiees disabled their weapons, and Lachichuk suggested that they move to a private location in Kachirho.\nAlong with Cudgel, the Wookiees led the Jedi to a Wroshyr tree that stood in the middle of the city and ascended it in a turbolift until they reached a central control room. Inside were the Wookiees Chewbacca and General Tarfful, friends of the Jedi Order who had helped the Jedi Master Yoda flee the planet from clone troopers, and Lachichuk briefed them on the situation. They informed Starstone that there were no surviving Jedi left on the planet and offered her and her companions safe haven, but a chime from one of the room's consoles at that moment told everyone present that forces of the Galactic Empire—the government that had succeeded the Republic after the war—were landing on Kashyyyk in search of renegade Jedi. A brawl between Wookiees and Imperial stormtroopers back at the landing platform escalated into a large battle that the Empire decisively won, and thousands of Wookiees were rounded up as Imperial slaves.\nLike other Wookiees who were present in and around Kachirho following the end of the Clone Wars, Guania was sympathetic to members of the Jedi Order who were in hiding during the Great Jedi Purge. He was suspicious of Olee Starstone and her companions when they came to Kashyyyk and began to make inquiries about Jedi, and he was wary of the possibility that they were bounty hunters working against the Jedi. Guania was observant of the fact that they had arrived in a military transport and that they looked as though they could account for themselves in a fight. When Starstone confirmed beyond doubt that she and her comrades were Jedi, Guania relaxed his guard.\nGuania was created by author James Luceno for his 2005 novel Dark Lord: The Rise of Darth Vader. The book is set in the immediate aftermath of the events of George Lucas's film of the same year, Star Wars: Episode III Revenge of the Sith, and it includes cameos by several Wookiees who also appear in the film, including Tarfful, Chewbacca, and Lachichuk. Bob Vitas, another Star Wars author, has posited that \"Guania\" was a typo on Luceno's part and that he intended for the character to be Guanta, another Wookiee from the film. Regardless of Luceno's intent, separate entries for Guania and Guanta in 2008's The Complete Star Wars Encyclopedia—co-written by Vitas—solidified their existence as two distinct characters.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Battle_of_Kashyyyk/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Mission_to_Mustafar/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cudgel_(Human)",
  "/wiki/Hunting/Legends",
  "/wiki/Lachichuk/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Bowcaster/Legends",
  "/wiki/General/Legends",
  "/wiki/Tarfful/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/City/Legends",
  "/wiki/Kachirho/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Ground_warfare",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Shyriiwook/Legends",
  "/wiki/Language/Legends",
  "/wiki/Drunk_Dancer",
  "/wiki/Olee_Starstone",
  "/wiki/Siadem_Forte",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Wroshyr_tree/Legends",
  "/wiki/Turbolift/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Battle_of_Kashyyyk_(19_BBY)",
  "/wiki/Slavery/Legends",
  "/wiki/Transport/Legends",
  "/wiki/James_Luceno",
  "/wiki/2005",
  "/wiki/Dark_Lord:_The_Rise_of_Darth_Vader",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Bob_Vitas",
  "/wiki/Star_Wars",
  "/wiki/Guanta/Legends",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Republic_82",
  "/wiki/Star_Wars_Chronicles:_The_Prequels",
  "/wiki/May_21",
  "/wiki/2007",
  "/wiki/December_4",
  "/wiki/2011",
  "/wiki/Star_Wars:_Revenge_of_the_Sith:_The_Visual_Dictionary"
 ]
}