{
 "name": "Gubacher",
 "display_name": "Gubacher",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Parwan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic left hand"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Strategic Advisory Cell",
      "Strategic Advisory Cell",
      "Jedi Order",
      "Galactic Empire",
      "Project Celestial Power",
      "Project Celestial Power"
     ]
    }
   ]
  }
 ],
 "content": "Gubacher was a male Parwan engineer who served the Galactic Republic during the Clone Wars. He was an artificial intelligence specialist and operated a research and development lab in the Jedi Temple on Coruscant, working closely with the Jedi in designing spy droids. Gubacher was a part of the Republic's Strategic Advisory Cell, and worked with many other members of the Cell in constructing a massive mobile battle station for the Republic, which would later be known as the Death Star.\nIn the second year of the Clone Wars, Gubacher outfitted the astromech members of D-Squad, who were to steal an encryption module from a Separatist cruiser, with various upgrades to aid them on their mission. At the end of the Clone Wars, the Republic was transformed into the Galactic Empire, which continued work on the battle station project. Gubacher was still involved with the project during the early years of the Empire's reign.\nA male Parwan, Doctor Gubacher was an engineer who served the Galactic Republic and Jedi High Council during the galaxy-spanning conflict fought against the Confederacy of Independent Systems known as the Clone Wars. Gubacher specialized in artificial intelligence, and maintained a research and development lab within the Jedi Temple on the planet Coruscant, home of the Jedi Order and capital of the Republic. Gubacher worked closely with the Jedi, receiving the task of outfitting droids associated with the Order with modifications for certain missions after the start of the Clone Wars. As such, he designed droids for use in espionage and surveillance and ensured the Order's droids were kept in peak condition. The emergence of the Separatist threat saw the creation of the Republic's Strategic Advisory Cell, as well as the Cell's Special Weapons Group, which was tasked with developing advanced weapons for use in the Clone Wars. As a member of the Special Weapons Group, Gubacher signed the Official Secrets Oath, forbidding him from discussing the Group's projects with others, even the Jedi.\nAfter the Second Battle of Geonosis, which saw the Republic's capture of Geonosian archduke Poggle the Lesser, Supreme Chancellor Sheev Palpatine of the Republic presented schematics for a mobile battle station to the Strategic Advisory Cell during their second meeting. Poggle informed the Republic that Separatist leader Count Dooku had supplied his hive with the plans, who then went on to further refine them. Though the Geonosian claimed to have no knowledge of any Separatist battle station currently in development, most Advisory Cell members refused to believe this assertion, as intelligence believed the Separatists were indeed in the process of constructing their own battle station. Facing the threat of a potentially devastating Separatist weapon, the Republic set to work constructing their own, making use of the Separatist's schematics. To aid in the development of the station, Gubacher formed an artificial intelligence team which designed augmented overseer droids to manage the labor force working on the battle station.\nGubacher was one of 150 individuals to attend a Strategic Advisory Cell meeting in the Strategic Planning Amphitheater of the Republic Center for Military Operations on Coruscant. From the front row of the amphitheater, the Parwan doctor announced that the first phase of the battle station project was complete.\nIn the second year of the Clone Wars, the Jedi Council assembled of astromech droids, all of whom belonged to members of the Jedi Order, in order to steal an encryption module from a Separatist Dreadnought, so that the Republic could crack a new code used by the Separatists. Prior to their mission, the droid team, that was dubbed D-Squad and placed under the command of Republic Colonel Meebur Gascon, visited Gubacher at his laboratory on Coruscant. The droids, R2-D2, M5-BZ, QT-KT, and U9-C4 were all taken in to receive generous upgrades to assist them on their mission, however the pit droid WAC-47 was not to receive a single upgrade, as Gascon had made him the role of pilot. R2-D2 was given drastic improvements to his rocket thrusters, that would allow him to be more mobile in the air, and remain airborne for longer periods of time.\nGubacher gave QT-KT a deployable magnet, which could draw in potentially hazardous objects and nullify them. U9-C4 was given an energy weapon to use for defensive purposes. Finally, M5-BZ's memory bank was removed to make room for a mobile command center for the tiny Colonel Gascon, to allow him to remain undercover on his mission. Their upgrades complete, Gubacher sent D-Sqaud on it's way, but not before expressing giddy enthusiasm over each upgrade he gave, as well as sympathy for BZ's loss.\nGubacher was still a member of the cell working on the Republic's battle station project when the Republic was swiftly transformed into the Galactic Empire by the once Supreme Chancellor turned Emperor Sheev Palpatine. In the early years of the Empire's reign, Gubacher was still significantly involved in the project that became the first Death Star.\nDoctor Gubacher was a male blue-skinned Parwan, who, in fitting with his species' biology, possessed three eyes and four tentacles with which to maneuver himself. He also possessed a three-fingered cybernetic left hand.\nGubacher was a brilliant scientist who specialized in artificial intelligence, a skill that served him well as a leader of the Jedi Temple research and development lab. He visibly derived great joy from his work, and, unlike many, Gubacher displayed empathy and respect for droids.\nGubacher first appeared in the fifth season episode of the television show Star Wars: The Clone Wars \"Secret Weapons,\" which aired on December 1, 2012. He was voiced by Dee Bradley Baker, who also voiced the clone troopers in the show.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gubacher",
  "/wiki/Gubacher/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Gubacher",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Parwan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Galactic_Republic",
  "/wiki/Strategic_Advisory_Cell",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Project_Celestial_Power",
  "/wiki/Engineer",
  "/wiki/Clone_Wars",
  "/wiki/Artificial_intelligence",
  "/wiki/Jedi_Temple_research_and_development_lab",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Jedi",
  "/wiki/Spy",
  "/wiki/Droid",
  "/wiki/Battle_station",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Standard_year",
  "/wiki/Astromech_droid",
  "/wiki/D-Squad",
  "/wiki/Mission_to_steal_a_Separatist_encryption_module",
  "/wiki/Encryption_module",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Imperial_Era",
  "/wiki/Doctor",
  "/wiki/Jedi_High_Council",
  "/wiki/The_galaxy",
  "/wiki/Planet",
  "/wiki/Capital",
  "/wiki/Republic_Special_Weapons_Group",
  "/wiki/Official_Secrets_Oath",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/Geonosian",
  "/wiki/Archduke",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Death_Star_plans",
  "/wiki/Death_Star",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Stalgasin_hive",
  "/wiki/Space_station",
  "/wiki/Strategic_Planning_Amphitheater",
  "/wiki/Imperial_Inspectorate_HQ",
  "/wiki/Dreadnought",
  "/wiki/Colonel",
  "/wiki/Meebur_Gascon",
  "/wiki/R2-D2",
  "/wiki/M5-BZ",
  "/wiki/QT-KT",
  "/wiki/U9-C4",
  "/wiki/DUM-series_pit_droid",
  "/wiki/WAC-47",
  "/wiki/Emperor",
  "/wiki/Eye",
  "/wiki/Amy_Beth_Christenson",
  "/wiki/The_Clone_Wars:_Season_Five",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Secret_Weapons",
  "/wiki/December_1",
  "/wiki/2012",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Clone_trooper",
  "/wiki/Category:Images_of_Gubacher",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Catalyst:_A_Rogue_One_Novel_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Five",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/Ambush"
 ]
}