{
 "name": "Guila_Angira",
 "display_name": "Guila Angira",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Raddus",
      "Oetchi system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Resistance navy",
      "Resistance navy"
     ]
    }
   ]
  }
 ],
 "content": "Guila Angira was a human male lieutenant in the Resistance fleet during their war against the First Order. In 34 ABY, he served on the bridge of the MC85 Star Cruiser Raddus under Captain Idrosen Gawat during the evacuation of the Resistance base on the planet D'Qar and died when the First Order destroyed the bridge in an attack on the fleet after it exited hyperspace following the lightspeed jump from D'Qar.\nGuila Angira was a human male who served in the Resistance during their war against the First Order. After the Resistance successfully destroyed the First Order's Starkiller Base in the year 34 ABY, Angira was amongst the Resistance forces that evacuated from their base on the planet D'Qar. During the evacuation, he held the rank of lieutenant and served as the gunnery officer on the bridge of the MC85 Star Cruiser Raddus under the command of Captain Idrosen Gawat.\nAs the Resistance transported its last personnel off D'Qar, the First Order fleet arrived and attacked, but after the Resistance's forces successfully destroyed the First Order Dreadnought Fulminatrix, the Raddus successfully jumped to lightspeed with the rest of the Resistance forces and escaped.\nMuch to the surprise of the Resistance's commanders, the First Order managed to track them through lightspeed and quickly caught up with them after the Raddus and other vessels exited hyperspace. In the attack that followed, Angira was killed along with most of the highest ranking members of the Resistance when the bridge of the Raddus was destroyed by missiles fired from two TIE/fo space superiority fighters. Those on the bridge who were not killed in the initial blast were sucked out into the vacuum of space, with only General Leia Organa managing to survive the ordeal.\nAngira had dark skin, brown eyes, and black hair.\nWhile on the Raddus, the lieutenant wore a brown, brimoss-fiber uniform tunic with black pants, a brown belt, and a pair of brown service boots.\nGuila Angira was portrayed by Aki Omoshaybi in the film Star Wars: Episode VIII The Last Jedi, which was released on December 15, 2017. The character was not named in the film, but received identification in Star Wars: The Last Jedi: The Visual Dictionary, a reference book written by Pablo Hidalgo and released in conjunction with the film.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/34_ABY",
  "/wiki/Raddus_(MC85_Star_Cruiser)",
  "/wiki/Oetchi_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Resistance_navy",
  "/wiki/Lieutenant",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/MC85_Star_Cruiser",
  "/wiki/Captain",
  "/wiki/Idrosen_Gawat",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/Resistance_base",
  "/wiki/Planet",
  "/wiki/D%27Qar",
  "/wiki/Death",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Hyperspace",
  "/wiki/Lightspeed",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Starkiller_Base",
  "/wiki/Standard_year",
  "/wiki/Gunnery_officer",
  "/wiki/Transport",
  "/wiki/First_Order_Navy",
  "/wiki/Mandator_IV-class_Siege_Dreadnought",
  "/wiki/Fulminatrix",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Realspace",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Aki_Omoshaybi",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/December_15",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/The_Last_Jedi_Adaptation_1",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/StarWars.com"
 ]
}