{
 "name": "Gula_Dwan",
 "display_name": "Gula Dwan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Before 1000 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Apprentices",
     "values": [
      "Hetton"
     ]
    }
   ]
  }
 ],
 "content": "Gula Dwan was a Duros bounty hunter and assassin. A Force-sensitive, he was selected by the wealthy Human Loranda to teach her son, Hetton, about the Force. However, Hetton found Dwan to be a worthless teacher, and after a short time, he killed him.\nA male Duros, Gula Dwan was a bounty hunter and an assassin. He was also Force-sensitive and had learned a number of minor Force powers throughout his life, such as the ability to levitate small objects. At some point before 1000 BBY, Dwan was recruited by Loranda, a wealthy Human female from the planet Serenno. Loranda sought someone to teach her son, Hetton, in the ways of the Force and had stumbled upon the Duros. She offered him a large sum of money; as someone who was motivated by credits, Dwan eagerly accepted.\nHowever, Hetton found that Dwan had little to teach him. Thanks to his family's substantial wealth, Hetton was able to discover a number of Sith artifacts and old volumes. From the manuscripts that he recovered, Hetton learned more about the Force than he had been taught under Dwan. After his skills surpassed Dwan's own, the pupil killed his teacher at the urging of his mother.\nGula Dwan was a being motivated by money. He was willing to work for whomever would pay him the most, no matter their ideals. After being contacted by Loranda, he agreed to work for her and teach her son, as she had promised to pay him a great deal of credits. However, Dwan was a subpar teacher. Hetton quickly grew tired of his instructor, considering Dwan a simple mercenary who happened to be Force-sensitive, and he was eager to kill Dwan when the time came.\nDwan had minor Force-sensitivity and used his connection to the Force to guide his actions.\nGula Dwan was created for the 2007 novel Darth Bane: Rule of Two, written by Drew Karpyshyn. Dwan never makes a physical appearance; he merely receives a brief mention by Hetton.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/1000_BBY",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Red",
  "/wiki/Hetton",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Human/Legends",
  "/wiki/Loranda",
  "/wiki/The_Force/Legends",
  "/wiki/Death/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Serenno/Legends",
  "/wiki/Currency/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/2007",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/Drew_Karpyshyn",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Guide_to_Alien_Species"
 ]
}