{
 "name": "Gume_Saam",
 "display_name": "Gume Saam",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ishi Tib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Techno Union",
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Gume Saam was a male Ishi Tib senator who represented the Techno Union in the Galactic Republic prior to and during the Clone Wars. During the conflict, he secretly furthered the interests of the Confederacy of Independent Systems.\nSaam was a male senator for the Techno Union in the Galactic Senate, having taken on the role sometime before the Clone Wars. Some time between 29 BBY and 22 BBY, Jedi Grand Master Yoda, Jedi Master Mace Windu, and Jedi Master Bant Eerin launched a fake kidnapping of Yoda to test Jedi Knight Obi-Wan Kenobi and Padawan Anakin Skywalker, including using a squadron of battle droids, which had been manufactured by the Techno Union, as a diversion. Unaware that it was a test, Kenobi suggested approaching Saam, though Windu noted he was not supportive of the Jedi Order. Due to this, the Jedi Knight suggested going to the Union headquarters on Skako Minor, though Skywalker realized a droid's head also had a non-Union symbol. This sign actually belonged to the Nova Crime Syndicate, which pointed Kenobi and Skywalker to the Wheel and then Glee Anselm, where they found Yoda and learned it had been a test.\nFollowing the Battle of Geonosis, Saam was with Supreme Chancellor Sheev Palpatine and several other senators who oversaw the deployment of the newly formed Grand Army of the Republic from Coruscant.\nDuring the Clone Wars, Saam tried to push a bill that would deregulate the banks in the Republic Senate while allowing for additional funds for clone troopers, but was rejected due to Bail Organa saying that the Senate should table any emergency bill until it was time to deregulate the banks, which Mas Amedda supported. Following that session of the senate, Saam spoke with Banking Clan senator Nix Card and Trade Federation Senator Lott Dod. Saam told them that he tried to push the bill, but Card knew that it was unlikely the senate would deregulate the banks. Dod thought the problem was Naboo's Senator Padmé Amidala causing Saam to say that she should be taken care of, but the Neimoidian warned him that assassinating her is more harder then he thinks and the Muun agreed due to his beliefs on how the Banking Clan and the Trade Federation were about business and not violence while thinking that even if Senator Amidala was murdered the Senate wouldn't deregulate the banks so Card instead suggested that Coruscant should be attacked to force the senate to deregulate the banks. Saam said he liked the plan, but Card insisted no one cared what he thought.\nAfter the Separatist Senate voted to open peace talks with the Republic, Saam and his supporters were shocked to hear of this development. Saam said that they needed war to make profits for themselves. They were assured when Count Dooku told them that chances of peace would disappear after their attack. During the Senate's vote on the peace initiative, Saam and his supporters were surprised that Dooku's attack was late. However, when the power went out due to the demolition droids, all the senators believed they were under attack. Saam then told the Senate that the attack was confirmed to have been carried out by the Separatists and demanded that they pay for what they have done. Thus, the Senate deregulated the banks, pleasing the Ishi Tib and allowing the future of more troops to become a reality.\nGume Saam first appeared in Star Wars: Episode II Attack of the Clones.\nSaam was voiced in Star Wars: The Clone Wars by Phil LaMarr, also the voice of Senators Bail Organa and Orn Free Taa. In the credits for \"Heroes on Both Sides,\" he was mistakenly identified as \"Gume Sam.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gume_Saam",
  "/wiki/Gume_Saam/Legends",
  "/wiki/Ishi_Tib",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Techno_Union",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Dooku",
  "/wiki/Senator",
  "/wiki/Clone_Wars",
  "/wiki/Time",
  "/wiki/29_BBY",
  "/wiki/22_BBY",
  "/wiki/Jedi",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Jedi_Master",
  "/wiki/Mace_Windu",
  "/wiki/Bant_Eerin",
  "/wiki/Rescue_of_Yoda",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/Squadron",
  "/wiki/Battle_droid",
  "/wiki/Jedi_Order",
  "/wiki/Skako_Minor",
  "/wiki/Droid",
  "/wiki/Nova_Crime_Syndicate",
  "/wiki/The_Wheel",
  "/wiki/Glee_Anselm",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Geonosis",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Coruscant",
  "/wiki/Lott_Dod",
  "/wiki/Republic_financial_reform_bill",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Mas_Amedda",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Nix_Card",
  "/wiki/Trade_Federation",
  "/wiki/Naboo",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Neimoidian",
  "/wiki/Muun",
  "/wiki/Separatist_Senate",
  "/wiki/Confederate%E2%80%93Republic_peace_initiative",
  "/wiki/Count",
  "/wiki/Bombing_of_Coruscant%27s_central_power_distribution_grid",
  "/wiki/Infiltrator_demolition_droid",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Gume_Saam",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Phil_LaMarr",
  "/wiki/Orn_Free_Taa",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Choose_Your_Destiny:_An_Obi-Wan_%26_Anakin_Adventure",
  "/wiki/Pursuit_of_Peace_(short_story)",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Databank_(website)",
  "/wiki/Obi-Wan_and_Anakin_2",
  "/wiki/Standard_year",
  "/wiki/Mission_to_Carnelion_IV",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Reproduction",
  "/wiki/Rogue_One",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/41_BBY",
  "/wiki/Carnelion_IV",
  "/wiki/Obi-Wan_and_Anakin_5"
 ]
}