{
 "name": "Gunda Mabin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aqualish"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Right leg"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Blazing Claw"
     ]
    }
   ]
  }
 ],
 "content": "Gunda Mabin, also known as Gunda the Terrible, Buccaneer of the Blazing Claw, Mabin the Dread, and Captain Long-Tusk, was a female Aqualish pirate queen during the Age of the Empire who led the Blazing Claw. Due to Mabin's activities, the Galactic Empire gave a warrant to terminate, and believed Mabin to be lurking in the Relgim Run seeking to plunder the Cassandran Worlds. Mabin was believed to operate from a location inside the Maelstrom Nebula.\nMabin had a scar about her left eye and a cybernetic right leg. She led a pirate fleet of a hundred ships plus her own, the Bloody Bones.\nAt some point, Mabin served under Captain Carabba as a \"cabin cub\" and eventually first mate before killing Carabba and taking over as the leader of the pirate gang. Later, Mabin would capture Hondo Ohnaka and took coaxium, Onyx pearls, serrated vibroblade, DX-13 blaster pistol, Elixir of Omwat's Grace, Fine oro-weave vest trimmed with nerfwool, Rhen-Orm biocomputer module, chromium hand mirror, sixteenth vintage Whyren's Reserve and Maz Kanata's Journal from him. Inventory of the assets taken was recorded in the book that would become known as the Smuggler's Guide.\nDuring the fifth sidereal cycle the twenty-third, Mabin led the crew of Bloody Bones to a treasure buried on Moldour 14 using the guide, while other ships of her fleet were sent along the outer Hydian Way and as far as spillways of Ashcan Reach as a distraction for the Galactic Empire and Dharus Buccaneers.\nAt some point Gunda Mabin fell asleep during the travel and was waken up twelve hours ago. Twelve hours later, during the fifth sidereal cycle the thirty-first, Gunda noticed that that Bloody Bones sprung a coaxium leak since they left the Port of Ottega, and immediately took the ship out of hyperspace at the busiest stretch of the Atrian Merchants' Causeway hyperlane in hopes of saving her ship from exploding due to a leak. Gunda steered the ship alongside a Ghtroc star yacht, then Bloody Bonnes attacked it with a broadside fusillade that splashed across the yacht's deflector shields, splintering them in places.\nThen, Hawson threw open the starboard hatch and Handsome Tar tossed magnesium burners through the magnetic field that fixed against the yacht's hull, marking a two-meter circle. One shot from a powder kicker knocked that piece of hull inward, which allowed the boarding party inside the yacht. A fight broke out, where Grullbug kill several opponents, white clouds from flash bombs lingered in the air. Following a fight, Hawser changed yacht's transponder code to Zeta Zeta Zeta. The yacht's captain was thrown out in the airlock, and the others hastily surrendered the lockcodes for the ship's coaxium.\nDuring the fifth sidereal cycle the thirty-third, the Bloody Bones was repaired by using stolen coaxium and a welded deck plate as a fine reactor patch. While finishing the repairs, Punter died from the excesss of radiation. Gunda remarked that perhaps he should have refrained from waking her up.\nDuring the fifth sidereal cycle the thirty-fifth, Navigator Puckwale reported that they would reach Moldour 14 in the morning, and Gunda Mabin proclaimed that she will forever be Pirate Queen of the Outer Rim Territories.\nDuring the fifth sidereal cycle the thirty-sixth, after Gunda slipped the Bloody Bones into a Moldour orbit, Patchwork Fiddich pulled a pistol from his coat and pointed it at her. Six of Gunda's crew sided with Patchwork, and others didn't move. They stared at each other, as she noticed he still bore the scar of the Burning from captain Carabba, until Gunda used quickfire tooth hidden inside her mouth, coating conspirators in green flame, as they fell to the deck, Mabin's loyal followers drew their blades and killed mutineers, except Fiddich, who she killed herself.\nDuring the fifth sidereal cycle the thirty-seventh, upon reaching their destination, the moon Moldour 14, the crewmember Poppy found the right sinkhole on the correct island, then they set the droids digging. The rays of sunup revealed the vault at the bottom of the sandy pit. Fur-Bite then unsealed the vault, but was killed by a trap that fired a saberdart into the pirate's neck. The other traps in the vault failed to fire, and Mabin and the remaining crew claimed the precious meleenium, hyperbarides, and prismatic crystals inside before leaving the moon.\nDuring the fifth sidereal cycle the forty-first, the crew of Bloody Bones charted their course for the second Kanata treasure, yet a shadow on the aft sensor troubled Gunda. She feared that the Dharus Buccaneers were skulking in their wake. On the fifth sidereal cycle the forty-third, however, the pursuer wasn't a Dharus pirate, but a privateer hired by the governor of the Maldrood Oversector. A day later, during the fifth sidereal cycle the forty-fourth, Gunda Mabin primed the cannons of the Bloody Bones for fighting and engaged in the starfighter combat over the unnamed planet with the privateer.\nMabin wrote about her experiences on Moldour throughout the journey, with the Master Codebreaker, Cornelius Evazan and Doctor Chelli Lona Aphra annotating the pages with their own comments when the book later fell into their possession.\nFollowing the dogfight, Gunda Mabin crash-landed her ship on the planet. Krastic Tarta later claimed that he found both the privateer's starship and Bloody Bones to be abandoned, and found only the Smuggler's Guide on board the Mabin's starship, which he decided to keep safe on the Arkanian Dawn.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gunda_Mabin",
  "/wiki/Gunda_Mabin/Legends",
  "/wiki/Aqualish",
  "/wiki/Gender",
  "/wiki/Limb",
  "/wiki/Blazing_Claw",
  "/wiki/Pirate",
  "/wiki/Pirate_king",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Warrant_to_terminate",
  "/wiki/Relgim_Run",
  "/wiki/Cassandran_Worlds",
  "/wiki/Maelstrom_Nebula",
  "/wiki/Eye",
  "/wiki/Cybernetics",
  "/wiki/Bloody_Bones",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Gunda_Mabin",
  "/wiki/Carabba",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Coaxium",
  "/wiki/Onyx_pearl",
  "/wiki/Serrated_vibroblade",
  "/wiki/DX-13_blaster_pistol",
  "/wiki/Elixir_of_Omwat%27s_Grace",
  "/wiki/Fine_oro-weave",
  "/wiki/Nerf",
  "/wiki/Biocomputer",
  "/wiki/Chromium",
  "/wiki/Mirror",
  "/wiki/Whyren%27s_Reserve",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Book",
  "/wiki/Sidereal_cycle",
  "/wiki/Moldour_14",
  "/wiki/Hydian_Way",
  "/wiki/Ashcan_Reach",
  "/wiki/Dharus_Buccaneers",
  "/wiki/Standard_hour",
  "/wiki/Port_of_Ottega",
  "/wiki/Atrian_Merchants%27_Causeway",
  "/wiki/Hyperlane",
  "/wiki/Ghtroc_star_yacht",
  "/wiki/Deflector_shield",
  "/wiki/Hawson",
  "/wiki/Magnetic_field",
  "/wiki/Grullbug",
  "/wiki/Flash_grenade",
  "/wiki/Hawser",
  "/wiki/Transponder_signal",
  "/wiki/Punter",
  "/wiki/Radiation",
  "/wiki/Navigator",
  "/wiki/Puckwale",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Moldour",
  "/wiki/Orbit",
  "/wiki/Pistol",
  "/wiki/Coat",
  "/wiki/The_Burning",
  "/wiki/Captain",
  "/wiki/Fire",
  "/wiki/Moon",
  "/wiki/Fur-Bite",
  "/wiki/Kamino_saberdart",
  "/wiki/Meleenium",
  "/wiki/Hyperbaride",
  "/wiki/Privateer",
  "/wiki/Maldrood_Oversector",
  "/wiki/Standard_day",
  "/wiki/Starfighter_combat",
  "/wiki/Master_Codebreaker",
  "/wiki/Cornelius_Evazan",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Krastic_Tarta",
  "/wiki/Arkanian_Dawn",
  "/wiki/Star_Wars:_Smuggler%27s_Guide"
 ]
}