{
 "name": "Gunn Yage",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fel Empire",
      "Darth Krayt's Galactic EmpireImperial Navy181st Imperial Fighter Wing",
      "1st Imperial Center Core Defense Squadron",
      "Imperial Navy181st Imperial Fighter Wing",
      "1st Imperial Center Core Defense Squadron",
      "181st Imperial Fighter Wing",
      "1st Imperial Center Core Defense Squadron",
      "Empire-in-exile"
     ]
    }
   ]
  }
 ],
 "content": "Gunn Yage was a Human female pilot in the Imperial Navy around 137 ABY. Piloting Skull One—a Predator-class starfighter—under the call sign of \"Gunner\", she led Skull Squadron. Yage was the daughter of Rulf Yage and Nyna Calixte, making her the maternal half-sister of Cade Skywalker.\nGunn Yage was the daughter of Moffs Nyna Calixte and Rulf Yage, the latter of whom raised her like the son he wished he had. Growing up despising her mother for abandoning them to pursue a relationship with Grand Admiral Morlish Veed, Gunn eventually gained her father's respect after climbing through the ranks with no preferential treatment. She served in the 181st Imperial Fighter Wing, eventually reaching the rank of captain and earning command of Skull Squadron.\nThe pilots under her command matched her own exacting standards, and included Tev Rimon, Jae Akura, and Brodie Coburn. It was said that they would do anything for her. Around 137 ABY, Gunn led Skull Squadron in the pursuit of a vessel they believed to be Cade Skywalker's ship, the Mynock, on Coruscant. They were unable to catch him when Cade dove down into the undercity of the planet. Upon returning to their hangar, Gunn was berated by her father for failing to capture him, and was told to meet him for dinner the next evening at a restaurant called the Naboo Queen.\nWhile eating dinner with her father, Gunn's mother Nyna Calixte showed up. After calling her mother a rancor, she said she believed that the vessel she and her men engaged the day before was indeed the Mynock. Shortly thereafter, Skull Squadron engaged the Mynock again, but this time the Wookiee Chak was the pilot. When it seemed as though Gunn was about to disable the ship, she was informed by Captain Skolitz of Moff Yage's orders to disengage and abort the mission.\nAfter destroying a stray Galactic Alliance vessel, Gunn was contacted by her mother and given the mission to stop pirate attacks on Imperial shipments in the Outer Rim, along with an agent of Calixte's named Morrigan Corde, to put her black ops training to its fullest. Upon arrival on Tatooine, Yage met with Moff Nieve Gromia, who hadn't heard from Corde in a many years. Gromia presented the latest intel regarding the pirates, which Gunn recognized their ship as the Mynock, which belonged to Cade Skywalker, who was using the name \"Luke Skywalker\" as an alias. Gunn was sent to apprehend Cade. Unbeknownst to Gunn, Gromia contacted Black Sun Vigo Lun Rask, who sent a trio of assassins to kill her and Cade before Corde arrived.\nGunn located her unknown half-brother in a cantina in Mos Eisley and captured Cade by flirting with him and then spiking his drink, making him drowsy. She then contacted Morrigan Corde and informed the older woman of her success. However, Corde was not pleased that Gunn had told Gromia about Cade. Gunn replied that she was only following regulations by reporting to her senior officer; Corde countered that black ops did not apply. She warned Gunn that there was a leak on the Moff Council, and Gunn may become a target. Gunn, however, refused to believe her, stating that Corde was acting like her mother. On the way to Imperial Station Bravo, Cade caused Gunn to crash her X-34 landspeeder by Force choking her.\nAfterward, they were attacked by the assassins and were forced to flee and collaborate to survive due to a sandstorm. Cade was going to leave Gunn to die, but the Force ghost of Luke Skywalker led them to the Lars homestead to wait out the storm. There, Gunn insulted the Jedi Order, only to be lectured by Cade. Gunn then told Skywalker that her father was the \"Hero of Ossus.\" When Cade said that Rulf was a monster, Gunn revealed that her father never saw himself as a hero and was only following orders. After the massacre he was drunk for a week and had never been the same. The revelation that Rulf and Gunn had softer sides placated Cade and Gunn went to sleep. She awoke to the Anzati assassins Sint and Nakia Yoru trying to steal her and Cade's soup and once again she counted on her half-brother for survival.\nThe siblings eventually defeated the Anzati pair, killing Sint in the process. They left the homestead to find Corde and Syn killed the Blood Carver. Corde reprimanded Yage for not waiting for her, and sent her to find evidence of Gromia's involvement in the attempted assassination.\nDiscreetly returning to Gromia's base, Gunn searched through her manifests and learns that items she had purchased are too expensive for a Moff's salary, proving that she was corrupt. During a confrontation with Gromia, Gunn learned the truth about her family ties with Cade Skywalker and Morrigan Corde; Gromia had looked in both Corde and Calixte's files in an attempt to ruin Calixte, and found that they were the same person and that Calixte was once Kol's wife and Cade's mother. Gunn refused to believe this, and in the scuffle Gromia was shot. She died telling Gunn to use the new information to ruin her mother.\nSkull Squadron was later selected to take part in Operation: Thunderstroke, an effort ordered by Regent Veed to capture Roan Fel, who was to meet with representatives of the Jedi Order on the planet Agamar. En route to Agamar, Gunn learned that her squadron had been selected to pilot a new type of starfighter and met the Sith overseer of the starfighter pilots: Darth Rauder, who warned Gunn of the price for disobeying her orders.\nAs the battle between the Sith Imperial and the Fel loyalist forces raged on Agamar's orbit, Gunn was ordered by Lady Rauder to kill an ejected pilot loyal to Fel. Gunn refused to do so, since she saw that as murder, prompting Rauder to torture her using the Force. To spare Gunn from such a choice, \"Crasher\" Rimon took the shot and killed the helpless pilot, much to Rauder's anger. Gunn was clearly apalled, but kept on fighting. The battle ended with Roan Fel's escape, but the capture of Princess Marasiah Fel.\nSome days later, Skull Squadron also took part on the attack on Da Soocha and its moon Napdu. Da Soocha was poisoned in the same manner as Dac had been, while Napdu was subject to orbital bombardment. A number of civilian vessels attempted to flee, but Lady Rauder classified them as enemy combatants and ordered their destruction. Despite the protests of both \"Crasher\" Rimon and \"Storm\" Akura, who confirmed the vessels to be unarmed, Gunn nevertheless ordered her pilots to target the escaping ships.\nA few months later, in the final year of the Second Imperial Civil War, Gunn Yage was at her father's side aboard the Star Destroyer War Hammer. After keeping the secret of her mother's dual identity for so much time, she felt the need to inform her father that Nyna Calixte and Morrigan Corde were one and the same. However, Gunn was interrupted by a holocomm communication with Morlish Veed. The Grand Moff revealed that Yage's mother was a spy for Roan Fel, and thus he executed her for betraying the Empire.\nSoon after, the Sith learned of a secret Jedi Temple on Taivas. Assembling an armada of Sith and Imperial fighters, the Empire attacked Taivas. After suffering initial friendly fire casualties due to Taivas' atmosphere, the Sith-Imperials sent in their ground forces. During this time, Yage and her squadron engaged in aerial combat with the Jedi. During the fight, the Mynock entered the fight and Yage was ordered to shoot it down. Torn between duty and personal sentiment, she was outraged that her Sith superiors had ordered her to kill her own half-brother.\nAs the Jedi and their allies held their ground, Darth Krayt ordered his forces to redouble their efforts. With an entire fleet of Krayt's new capital ships and starfighters, along with a legion of newly-bred Sith troopers, Darth Nihl launched a relentless assault on the Jedi's position. The new wave of attacks, however, resulted in a major case of friendly fire, thus resulting in the deaths of their own compatriots, including Moff Geist.\nAs the battle raged on, Jedi Master T'ra Saa ordered the ships that formed the Hidden Temple to take flight and escape. Aboard one of these ships, Masters Tili Qua and K'Kruhk took a number of Jedi younglings to safety. Sensing their presence aboard the ship, Darth Rauder ordered Skull Squadron to destroy it. But Rauder's order turned out to be the final straw for Captain Gunn Yage, who could not bring herself to murder defenseless children. Hence, she came to the Jedi's defense by shooting down Rauder's starfighter, killing her Sith superior in act of repentance for her service to the Sith. Upon fully realizing that the Sith were evil and without honor, Yage denounced the Galactic Empire of Darth Krayt and re-avowed her former allegiance to Roan Fel. When she informed her father of the reasons behind her defection, Moff Yage followed his daughter's example and turned against the regime that he hated for forcing him to commit many atrocities over the years. After killing the Sith who was in charge of the War Hammer, Moff Yage also announced his defection and called on his fellow officers to join him.\nPrior to the conflict's conclusion, Corde revealed herself to be alive to Gunn and Rulf. Both appeared to be pleased by the revelation of Corde's survival. The war ultimately came to an end in a final battle on Coruscant. Gunn Yage's Jedi half-brother, Cade Skywalker was responsible for killing Darth Krayt, thus delivering the Galaxy from the Dark Lord's reign while the remnants of the One Sith dispersed into hiding.\nAs the daughter and only child of a career officer, Gunn Yage was born as a virtual military brat who was expected to follow in her father's footsteps. Under Moff Rulf Yage's supervision, Gunn was raised to believe in principles such as honor and duty, discipline and courage. Aside from her exceptional skills as a Imperial pilot, Yage was also a gifted leader who commanded the respect of her fellow pilots within Skull Squadron. Although she had been born as a girl to a father who wanted a boy, she was fiercely loyal to Moff Yage and persevered to prove herself as a worthy heir to their family name.\nDespite Yage's close relationship to her father, she suffered from abandonment issues with her mother, Moff Nyna Calixte, who left the family and eventually became the lover of Grand Moff Morlish Veed. For years, Yage harbored feelings of contempt and resentment towards Calixte. She was initially devoted to serving Darth Krayt and the Galactic Empire, but inwardly she felt disdain for the Sith's brutal policies. Thus, she outwardly celebrated her father as the \"hero of Ossus,\" even though the massacre of the Jedi weighed heavily on his conscience.\nA steadfast Imperialist, she resented the members of the Jedi Order as enemies of the Empire. Upon discovering that she and Cade Skywalker were half-siblings who had the same mother, Yage was shocked almost to the point of total disbelief. Although the revelation did nothing to change her bitter resentment towards Calixte, she chose to not destroy her mother by revealing the details of Calixte's past to the other Moffs.\nCaptain Yage's service to Darth Krayt's Galactic Empire came to an abrupt end when she realized that she could no longer serve the Sith without sacrificing her honor in the process. Though she knew next to nothing about her half-brother, Yage had no interest in murdering her half-brother; the thought of killing innocent children—even those raised and trained by the Jedi—was also an abhorrent crime in her eyes. In the end, Gunn Yage's moral code caused her to condemn the Sith as unethical and without honor.\nWhen designing Yage's appearance, artist Jan Duursema considered many different looks before finding inspiration from a particular hairstyle worn by her niece. The look reminded her of Kara Thrace, aka \"Starbuck\", from Battlestar Galactica, and Duursema believed it was a risky move given the similarities between the characters. She chose it due to the look suiting the character, but fans of Star Wars: Legacy ultimately did make comparisons between Yage and Starbuck.\nIn the sixth issue of Star Wars: Legacy—War, Yage's hair is drawn significantly longer than usual.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fel_Empire",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/181st_Imperial_Fighter_Wing/Legends",
  "/wiki/1st_Imperial_Center_Core_Defense_Squadron",
  "/wiki/Empire-in-exile",
  "/wiki/Jae_Akura",
  "/wiki/Pilot/Legends",
  "/wiki/137_ABY",
  "/wiki/Predator-class_fighter",
  "/wiki/Starfighter/Legends",
  "/wiki/Call_sign",
  "/wiki/Rulf_Yage",
  "/wiki/Morrigan_Corde",
  "/wiki/Cade_Skywalker",
  "/wiki/Coruscant/Legends",
  "/wiki/Yage_family",
  "/wiki/Moff/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Morlish_Veed",
  "/wiki/Captain/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Tev_Rimon",
  "/wiki/Brodie_Coburn",
  "/wiki/Mynock_(Helot-class)",
  "/wiki/Skull_Squadron_Hangar",
  "/wiki/Padm%C3%A9_Amidala%27s_apartment",
  "/wiki/Rancor/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Chak_(Wookiee)",
  "/wiki/Skolitz",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Nieve_Gromia",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Vigo/Legends",
  "/wiki/Lun_Rask",
  "/wiki/Assassin/Legends",
  "/wiki/Gusha%27s_Luck",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Imperial_Station_Bravo",
  "/wiki/X-34_landspeeder/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Mission_to_Tatooine_(Gunn_Yage)",
  "/wiki/Force_ghost",
  "/wiki/Lars_homestead",
  "/wiki/New_Jedi_Order",
  "/wiki/Alcohol/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Anzat_(species)",
  "/wiki/Sint_Yoru",
  "/wiki/Nakia_Yoru",
  "/wiki/Soup_(Anzati)",
  "/wiki/Blood_Carver",
  "/wiki/Operation:_Thunderstroke",
  "/wiki/Agamar/Legends",
  "/wiki/Sith-Imperial_starfighter",
  "/wiki/Darth_Rauder",
  "/wiki/Torture/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Marasiah_Fel",
  "/wiki/Devastation_of_Da_Soocha",
  "/wiki/Da_Soocha",
  "/wiki/Napdu",
  "/wiki/Dac",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/138_ABY",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/War_Hammer",
  "/wiki/Holocomm/Legends",
  "/wiki/Hidden_Temple_(Sith%E2%80%93Imperial_War)",
  "/wiki/Taivas",
  "/wiki/Attack_on_the_Hidden_Temple",
  "/wiki/Dragon_ship",
  "/wiki/Annihilator-class_starfighter",
  "/wiki/Darth_Krayt%27s_Sith_trooper",
  "/wiki/Darth_Nihl",
  "/wiki/Geist",
  "/wiki/Jedi_Master/Legends",
  "/wiki/T%27ra_Saa",
  "/wiki/Tili_Qua",
  "/wiki/K%27Kruhk",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Battle_of_Coruscant_(Second_Imperial_Civil_War)",
  "/wiki/Yage",
  "/wiki/Ossus/Legends",
  "/wiki/Massacre_at_Ossus",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Legacy%E2%80%94War_6",
  "/wiki/Star_Wars:_Legacy%E2%80%94War",
  "/wiki/Legacy_(2006)_14",
  "/wiki/Legacy_(2006)_15",
  "/wiki/Legacy_(2006)_19",
  "/wiki/Star_Wars:_Legacy:_Tatooine",
  "/wiki/Legacy_(2006)_44",
  "/wiki/Legacy_(2006)_45",
  "/wiki/Legacy_(2006)_46",
  "/wiki/Legacy_(2006)_48",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Legacy%E2%80%94War_2",
  "/wiki/Legacy%E2%80%94War_3",
  "/wiki/Legacy%E2%80%94War_4",
  "/wiki/Legacy%E2%80%94War_5",
  "/wiki/Category:Images_of_Gunn_Yage",
  "/wiki/Legacy_(2006)_0",
  "/wiki/Legacy_(2006)_0%C2%BD",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Star_Wars_Insider",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_118",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_121",
  "/wiki/Legacy_(2006)_37",
  "/wiki/Legacy_(2006)_38",
  "/wiki/Legacy_(2006)_39",
  "/wiki/Jedi_Council_Forums",
  "/wiki/February_3",
  "/wiki/2013"
 ]
}