{
 "name": "Gupat_Roshti",
 "display_name": "Gupat Roshti",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kiros"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.98 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  }
 ],
 "content": "Gupat Roshti was a Togruta male who served as the governor of the planet Kiros during the Clone Wars. His colony of 50,000 Togruta were kidnapped and sold into slavery after Count Dooku formed an alliance with Zygerrian slavers.\nGupat Roshti was the governor of the planet Kiros during the Clone Wars. When the Zygerrian Slave Empire, represented by Darts D'Nar, Roshti's people were kidnapped and sold as slaves. Roshti's Togrutan colony was taken over, with D'Nar setting up in the Governor's tower. Roshti pleaded for help with Count Dooku and the Confederacy of Independent Systems.\nThe Sith Lord approved the plea and sent battle droids to occupy Kiros and \"protect\" his people. However, the Sith Lord's real intentions were to kidnap the Togruta, not protect them. When the plight of Roshti and his people reached the Galactic Republic, Jedi Master Obi-Wan Kenobi, Jedi Knight Anakin Skywalker, Padawan Ahsoka Tano, Clone Captain CT-7567 \"Rex,\" Clone Commander CC-2224 \"Cody,\" and clone troopers from the 501st and the 212th attempted to help the Togrutas. However, they could not stop Roshti and his people from being taken offworld and brought to Zygerria.\nOn Zygerria, the Togrutans were auctioned off. Although the Jedi had pursued Roshti and his people to help free them, their attempt to set them free during the auction was foiled by the Queen of Zygerria, Miraj Scintel, and her royal guard. Roshti, now joined by Kenobi and Rex in servitude, were transported to the slave processing facility on Kadavo.\nSimilar to most Togrutas, Roshti was peaceful, quiet and dependent on others. He refused to let his people go to war and believed that peace was the answer. Roshti cared deeply about Kiros and his people, and would do anything to keep the Togruta safe.\nRoshti wore a long-sleeved shirt that was dull green in color. White segments adorned this shirt, while intricate, golden patterns decorated these white segments. A thick, sturdy brown belt was worn around his waist; one rectangular, closed pocket was placed on the right side of this belt. Draped over Roshti's shoulder was a thin, wrinkled purple piece of material.\nTight, dark purple pants were worn over his legs while white, metal boots were worn on his feet. The boots reached up to Roshti's knees and were sealed up by dark yellow buttons.\nGupat Roshti first appeared in the Star Wars: The Clone Wars episode \"Kidnapped,\" the eleventh episode of the show's fourth season.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gupat_Roshti",
  "/wiki/Roshti",
  "/wiki/Kiros",
  "/wiki/Togruta",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Governor",
  "/wiki/Planet",
  "/wiki/Clone_Wars",
  "/wiki/Artisan_colony",
  "/wiki/Slavery",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Zygerrian",
  "/wiki/Zygerrian_Slave_Empire",
  "/wiki/Darts_D%27Nar",
  "/wiki/Governor%27s_tower",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Sith_Lord",
  "/wiki/Battle_droid",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Clone_trooper",
  "/wiki/501st_Legion",
  "/wiki/212th_Attack_Battalion",
  "/wiki/Zygerria",
  "/wiki/Royal_Slave_Auction",
  "/wiki/Jedi",
  "/wiki/Queen_of_Zygerria",
  "/wiki/Miraj_Scintel",
  "/wiki/Zygerrian_royal_guard",
  "/wiki/Kadavo_slave_processing_facility",
  "/wiki/Kadavo",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Gupat_Roshti",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Kidnapped",
  "/wiki/The_Clone_Wars:_Season_Four",
  "/wiki/Slaves_of_the_Republic",
  "/wiki/Escape_from_Kadavo",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Helmets",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)"
 ]
}