{
 "name": "Gura_Tran",
 "display_name": "Gura Tran",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 50 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Believers",
      "Thaereian military"
     ]
    }
   ]
  }
 ],
 "content": "Gura Tran was a Human male who worked as a spy for the Believers Sith cult during the waning years of the Galactic Republic. Tran infiltrated the Thaereian military, the armed forces of the Thaereian system, and in around 20 BBY he was assigned to represent the Thaereians in secret negotiations with the separatist Confederacy of Independent Systems. Tran boarded a Separatist corvette for travel to the Core Worlds but en-route the vessel was bombarded in the Ando system by a Republic strike force crippled. Tran survived the assault and attacked a Republic boarding party sent to investigate the wrecked warship.\nGura Tran was a Human male who was born in around 50 BBY and who served as a spy for the Believers Sith cult during the last years of the Galactic Republic. Tran was part of a small Believer cell and received little information on the cult's plans beyond what he needed for his missions. He infiltrated the Thaereian military, the armed forces of the Thaereian system, and during the Clone Wars was appointed by the Thaereians as their official liaison to the separatist Confederacy of Independent Systems.\nAround 20 BBY, Tran conspired with Sheel, a Tarasin Force witch of the Wyrd coven, to devise a plot discredit the Jedi—an order of Force users—and the government of the planet Cularin by planting evidence implicating both groups in having had dealings with the Separatists. Carrying some flimsiplast documents and a datacard setting out details of the plan on person within a magna-sealed seem on his belt, Tran boarded a Separatist corvette alongside Sheel to conduct negotiations with the Separatists on how the scheme could be implemented. Aboard the vessel, Tran and Sheel kept to themselves; few among the ship's crew, including the corvette's second-in-command Lieutenant Rame Cartroll were familiar with the pair's reason for coming aboard the vessel, though the corvette's captain knew more. While en-route to the Core Worlds, the Separatist ship made a stopover in the Ando system so that Tran could deliver some important information to a Separatist base sited on a planetoid in the star system.\nBefore Tran could call upon the Separatist base, the corvette fell under attack from a task force of the Galactic Republic, leaving the vessel crippled. Tran was one of only three sentient beings aboard the stricken corvette to survive the assault and around the time of the attack he consumed a vial of a drug that rendered the user immune to Force-based mind influence. Concerned that the wrecked warship was at imminent risk of depressurizing, Tran donned a padded flight suit for protection and he took shelter in a corridor leading to the corvette's bridge, accompanied by the Techno Union droid representative Solenoid.\nThe heroes of Cularin, a group of freelance agents from the Cularin system, boarded the damaged corvette to search for survivors and to gather intelligence. Recognizing the operatives as allies of the Jedi, Tran ambushed the agents, planning to kill them and seize their starship to escape the damaged warship. Solenoid assisted Tran in his assault and the Believer spy stood behind the droid to use Solenoid as cover while sniping at the heroes of Cularin with his blaster pistol. However, Tran's attack was unsuccessful and he was defeated by the freelance agents.\nBefitting of his vocation as a spy, Tran had a nondescript appearance; he was of an average build, dark hair and dark eyes and was regarded as good looking by those around him, though not to an extent that would make him remembered by those he encountered. He was a fanatical supporter of the Believers and had a passionate hatred for the Jedi. Though a Believer spy, he also supported the Thaereian military with patriotic fervor; he viewed that Cularin, a planet policed by the Thaereian military, would be better off as a full Thaereian protectorate because he considered that the Thaereians combated crime and brought stability to the system.\nTran was trained to resist interrogation and had formidable combat skills. When he became stranded aboard the wrecked Separatist corvette, Tran became desperate to escape though found that the conditions aboard the crippled vessel prevented him from utilizing his combat skills to his full proficiency. He was equipped with a vibroblade and a modified BlasTech DY-225 Heavy Blaster Pistol.\nGura Tran appeared in Decision: Almas, a roleplaying adventure by Ronald A. Heintz that was published by RPGA in 2004. The adventure is set within Star Wars Legends continuity and serves as the first instalment of the Decisions trilogy of the Living Force roleplaying campaign. In the adventure, the player characters roleplay as the heroes of Cularin and engage in combat with Tran aboard the damaged Separatist warship. It is possible for the players characters to capture Tran, in which case he refuses to disclose to his captors any intelligence. It is also possible for Tran to be killed in the fight and for his body to be taken away by the the Republic forces who then find upon his person the documents evidencing his plot to discredit the Jedi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/50_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Believers",
  "/wiki/Thaereian_military",
  "/wiki/Decision:_Almas",
  "/wiki/Spy/Legends",
  "/wiki/Sith_cult/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Army/Legends",
  "/wiki/Thaereian_system",
  "/wiki/20_BBY/Legends",
  "/wiki/Thaereian",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Unidentified_Separatist_CR90_corvette",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Mission_to_the_Ando_system",
  "/wiki/Ando_system/Legends",
  "/wiki/Strike_Force_Cularin",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Sheel",
  "/wiki/Tarasin",
  "/wiki/The_Force/Legends",
  "/wiki/Witch/Legends",
  "/wiki/Wyrd",
  "/wiki/Coven/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Cularin_Government",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Flimsiplast/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Magna-seal",
  "/wiki/Lieutenant/Legends",
  "/wiki/Rame_Cartroll",
  "/wiki/Captain/Legends",
  "/wiki/Separatist_Ando_system_base",
  "/wiki/Unidentified_Ando_system_planetoid",
  "/wiki/Star_system/Legends",
  "/wiki/Corvette/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Time/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Padded_flight_suit",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Techno_Union/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Solenoid",
  "/wiki/Cularin_system",
  "/wiki/Death/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/BlasTech_Industries/Legends",
  "/wiki/DY-225_Heavy_Blaster_Pistol",
  "/wiki/Ronald_A._Heintz",
  "/wiki/RPGA",
  "/wiki/2004",
  "/wiki/Decisions_trilogy",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Decision:_Coruscant",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/Night%27s_Homecoming",
  "/wiki/Wizards.com",
  "/wiki/Over_Thaere"
 ]
}