{
 "name": "Gurney_(Human)",
 "display_name": "Gurney  (Human)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Zelka Forn's medical facility",
      "Exchange"
     ]
    }
   ]
  }
 ],
 "content": "Gurney was a Human male from Taris who lived in the Upper City during the Sith Empire's occupation of that world. He worked as Zelka Forn's assistant in Zelka Forn's medical facility; however, he also worked as an informant for the crime lord Davik Kang through Zax the Hutt.\nWhen Zelka expressed an interest in obtaining a sample of the rakghoul serum to the amnesiac Revan, Gurney was present and overheard his boss conversing with the newcomers. As Revan and Carth Onasi were leaving the clinic, Gurney approached them, informing Revan that Davik was also interested in acquiring a sample of the serum, and that he was willing to pay much more in credits than Zelka would ever be able to—all that Revan would have to do was present the serum to Zax, who worked at the Lower City Bounty Office. However, believing that the serum should be used to benefit the Outcasts, and other citizens of the planet, Revan gave the serum to Zelka, who was able to synthesize it in mass quantities. Afterward, Gurney expressed his outrage.\nAt first, Gurney would come off as uninterested in conversation, and would direct strangers to talk to Zelka instead. However, Gurney would later reveal himself as a greedy man, who believed in putting yourself first before others. He was willing to share any secrets with the Sith or the Exchange, for a price. He also greatly admired Davik Kang, seeing him as a role model rather than a criminal.\nIf the player decides to give the serum to Zax, Zelka will express his disappointment at the price Davik charges, and Gurney will congratulate the player and mention that he received a hefty finder's fee.\nIf the player talks to Gurney while wearing the Sith armor, he'll say that for a price, he'll tell the Sith anything they need to know.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gurney",
  "/wiki/Taris/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Zelka_Forn%27s_medical_facility",
  "/wiki/Exchange",
  "/wiki/Revan/Legends",
  "/wiki/Rakghoul_serum",
  "/wiki/Zax",
  "/wiki/Upper_City",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Planet/Legends",
  "/wiki/Zelka_Forn",
  "/wiki/Crime_lord/Legends",
  "/wiki/Davik_Kang",
  "/wiki/Hutt/Legends",
  "/wiki/Carth_Onasi",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Lower_City",
  "/wiki/Outcasts_(Taris)",
  "/wiki/Sith_trooper_armor/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}