{
 "name": "Gus_(Drall)",
 "display_name": "Gus  (Drall)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Drall"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Gus was a male Drall who was affiliated with the pilot Tala and her comrade Conevor during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. During the war Conevor made a bet with a group known as the Silestro Privateers that Tala could beat their leader Jostero in a swoop race, putting up his starship as a bet. During the race between Tala and Joestro, which took place on the planet Corellia, Gus contacted Tala several times using a comm unit, much to here annoyance, informing her and Conevor that the privateers planned to kill them no matter the outcome. He claimed to have a plan they could follow to avoid this, and shortly afterwards Tala finished the race in first place, beating Joestro. As the privateers prepared to attack Tala along with Gus and Conevor, who had been waiting at the finish line, a speeder belonging to the Corellian Security Force arrived and both groups involved in the race fled. Gus considered riding a swoop easy enough that he expected Tala to be able to listen while driving.\nGus was first mentioned in a short narrative at the start of Suns of Fortune, a sourcebook released in 2014 for Fantasy Flight Games Star Wars: Edge of the Empire roleplaying system.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gus_(disambiguation)",
  "/wiki/Drall_(planet)",
  "/wiki/Gender/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Tala_(pilot)",
  "/wiki/Conevor",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Silestro_Privateers",
  "/wiki/Jostero",
  "/wiki/Swoop/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Comm_unit/Legends",
  "/wiki/Privateer/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Suns_of_Fortune",
  "/wiki/2014",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Edge_of_the_Empire"
 ]
}