{
 "name": "Gutodj",
 "display_name": "Gutodj",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chevin"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Gutodj was a Chevin merchant who worked on the planet Wielu during the Clone Wars, a conflict between the Galactic Republic and the Confederacy of Independent Systems. On Wielu, Gutodj sold blasters from a stall in an area known as the Market Ward where the Chevin would cry out advertising its wares. The smuggler Rook Pryce approached Gutodj about buying a new blaster from the merchant, but the Chevin informed him that the crime bosses that controlled much of Wielu had forbidden anyone from doing business with the untrustworthy smuggler. This ban extended to Pryce's new co-pilot, Sal'ma Ben Bobo, who was in fact the Jedi Master Obi-Wan Kenobi in disguise, and the Chevin refused to even give them information as to where the Shistavanen criminal T'mott Zoat was. As the pair left Gutodj warned Kenobi to not trust Pryce, due to his history of not honoring contracts. Gutodj had blonde hair, brown eyes, green skin and whilst at the market wore a brown robe.\nGutodj first appeared in The Clone Wars: The Smuggler's Code, a digest sized comic book released in 2013. It was written by Justin Aclin and illustrated by Eduardo Ferrara.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chevin/Legends",
  "/wiki/Color/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Wielu",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Rook_Pryce",
  "/wiki/Crime_lord/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Shistavanen/Legends",
  "/wiki/T%27mott_Zoat",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/The_Clone_Wars:_The_Smuggler%27s_Code",
  "/wiki/Star_Wars_comic_books",
  "/wiki/2013",
  "/wiki/Justin_Aclin",
  "/wiki/Eduardo_Ferrara"
 ]
}