{
 "name": "Gyla_Petro",
 "display_name": "Gyla Petro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kalgo 13"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Sidereal Era AS-5667"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Petro",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Gyla Petro was a Human female from Kalgo 13. An Imperial scientist and a member of the Senex-Juvex region's House Petro, she was the only surviving member of a research party massacred by plants on Kashyyyk. She later joined Han Solo for a journey to Constancia.\nGyla Petro was a born into the aristocratic family House Petro. At some point she became a member of New Worlds as a biologist. Some of these biologists along with some Imperial soldiers traveled to the planet Kashyyyk in order to obtain some roots of the Orga plant. When the soldiers destroyed plants to make a pathway through the forest, the plants got upset and started killing the Imperials. Gyla was the only survivor due to the intervention of Han Solo and Chewbacca. After being saved, Gyla was taken to a Wookiee city on the back of a Sureggi and participated in the celebration of Life Day. However, shortly afterwards, Solo ended up captured by Imperials and forced to descend to the lowest and foulest level of Kashyyyk, which led to suspicion of Petro being an Imperial spy.\nSometime later, Gyla was traveling aboard the Millennium Falcon with Han Solo and Chewbacca. Han received as SOS message from Luke Skywalker and found the droids R2-D2 and C-3PO in the wreckage of Luke's ship. Upset at the detour, Gyla noted that she didn't ask to join a mission of mercy. C-3PO explained Luke's mission to Han, further upsetting Gyla. She thought Han was just a smuggler and not a member of the Rebel Alliance. Gyla wanted to leave when Han piloted the ship away from Imperial forces, though she had no choice but to come along for the ride. As the Millennium Falcon escaped Imperial forces by going through Constancia's ring, Gyla continued to beg to be let go. Han escaped from the Imperials and piloted the ship into a hidden base inside the ring. Once landed, Han got off to investigate while Gyla stayed aboard. Luke, Gamine and Sharlee were at this base and once it was deemed safe, Gyla came off the ship. Everyone devised a strategy to get Gamine to the surface of the planet. Han would go with Sharlee and hijack a TIE fighter while Gyla, Luke, Gamine, Chewbacca, R2-D2 and C-3PO would fly towards the surface in the Millennium Falcon. The distraction worked, and once the Falcon made it to the surface, they were all celebrated as heroes.\nPetro's suspected status of espionage for the Empire was later included in her files on the planet Fusai, specifically on the Rebel-owned BRT supercomputer Mistress Mnemos, although Mnemos was unaware of the exact details behind why she was suspected of being a spy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Petro_(disambiguation)",
  "/wiki/Kalgo_13",
  "/wiki/Sidereal_Era",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_Petro",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Senex-Juvex/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Constancia/Legends",
  "/wiki/Orga/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Sureggi/Legends",
  "/wiki/Life_Day/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Gamine",
  "/wiki/Sharlee",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Gyla_Petro_(file)",
  "/wiki/Fusai/Legends",
  "/wiki/BRT_supercomputer",
  "/wiki/Mistress_Mnemos",
  "/wiki/The_Constancia_Affair",
  "/wiki/Star_Wars_Special:_The_Constancia_Affair",
  "/wiki/The_Kashyyyk_Depths",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Collector_3",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Daniel_Wallace",
  "/wiki/StarWars.com"
 ]
}