{
 "name": "Gyylghrard",
 "display_name": "Gyylghrard",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Between 69 BBY and 48 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 18 BBY 4 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Gyylghrard was a male Wookiee prisoner at the Imperial Correctional Facility on Kessel.\nGyylghrard was born on the planet Kashyyyk between 69 BBY and 48 BBY.\nDuring the Imperial Era, Gyylghrard accepted being sent as a prisoner to the Imperial Correctional Facility on Kessel, in order to delay or prevent the enslavement or execution of his family. He kept a record of his entire stay on Kessel, using several pieces of flimsi. During his incarceration, he suffered several injuries. His arm was broken during a fight when he defended his Sullustan friend, and his leg was fitted with a bionic replacement due to an undisclosed accident.\nWhen a group of young Wookiees were sent to the facility, he befriended them and was convinced into helping them secretly celebrate Life Day. He obtained Corellian ryshcates, candles, and sparksticks from the Jawa overseeing the food storage.\nWhile celebrating the event, the young Wookiees used the occasion to stage a breakout. Overloading their electronic shackles with the sparksticks, they easily overpowered the stormtroopers guarding them. The guards found their blasters drained of any power. The adult slaves joined the insurrection and the fighting reached the launch bays. Here, the stormtroopers managed to recharge their weapons and with orders from the warden Dewt Kluskine, they set their weapons to kill and opened fire on the slaves. Gyylghrard was knocked unconscious with a stun baton hit to the head, and later learned the aftermath from a trustee named Moruth Doole.\nChoosing to believe that the youngsters managed to escape the prison, this idea gave him hope and enabled him to survive for a few more years. It was also that time when he promised to himself that the warden would pay for the massacre. He began earning Doole's trust and started behaving like a model prisoner. He soon found himself assigned by Doole to the Garrison Moon as a janitorial aide.\nJust a few months of serving as a janitor on the Kessel Correctional Facility which was located on the Garrison Moon, Gyylghrard was surprised with another promotion: he was to be included in the honor guard of the warden himself. He was given a used Gamorrean battle armor and ceremonial poleaxe and made to accompany the warden during a visit from a Twi'lek crime lord. During the negotiations, he realized that someone could kill the warden if that someone was prepared to die as well. With this knowledge, he began formulating a plan.\nEventually, Kluskine was decapitated by Gyylghrard with the poleaxe before being killed by stormtroopers.\nA Toydarian called Fossco, witnessed Kluskine's and Gyylghrard's deaths when visiting the Garrison Moon under the orders of his employer, Jabba the Hutt, and wrote about it in his own memoirs.\nGyylghrard's journal was later uncovered during General Lando Calrissian's failed attempt to reopen the spice mines.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/69_BBY/Legends",
  "/wiki/48_BBY/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kessel_prison",
  "/wiki/Kessel/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Imperial_Era",
  "/wiki/Gyylghrard%27s_journal",
  "/wiki/Flimsiplast/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Unidentified_Sullustan_(Kessel)",
  "/wiki/Life_Day/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Ryshcate",
  "/wiki/Sparkstick",
  "/wiki/Jawa/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Warden/Legends",
  "/wiki/Dewt_Kluskine",
  "/wiki/Stun_baton/Legends",
  "/wiki/Moruth_Doole",
  "/wiki/Life_Day_massacre",
  "/wiki/Garrison_Moon",
  "/wiki/Kessel_Correctional_Facility",
  "/wiki/M%27uhk%27gfa",
  "/wiki/Ceremonial_poleaxe",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Unidentified_Twi%27lek_crime_lord",
  "/wiki/Toydarian/Legends",
  "/wiki/Fossco",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/General/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Jedi_Search",
  "/wiki/Wizards.com",
  "/wiki/Kessel:_Hell_in_Space",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi"
 ]
}