{
 "name": "Ha'zel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Singing Mountain Clan"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Singing Mountain Clan"
     ]
    }
   ]
  }
 ],
 "content": "Ha'zel was a sage of the Singing Mountain Clan on the planet Dathomir that lived at the time of the Galactic Civil War. She could often be found in a large room in the Singing Mountain Clan Stronghold where the ceiling was covered with a bright image of the galaxy.\nHa'zel used to maintain several old shrines created long ago by witches of the past. However as she got older, she lost the strength to travel the wilds and tend to the altars herself. So when a young spacer arrived at the clan's stronghold and gained favor with the clan mother, Ha'zel asked them for help to ensure that the shrines weren't lost to time. The spacer agreed to help her and repaired the Altar of inner calm, Altar of dominance, Altar of wisdom and Altar of power. When the spacer returned, Ha'zel thanked them and rewarded them with Allya's Holocron.\nHa'zel was a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies.\nShe asked players of the Trader profession to repair several altars for her as part of the Witches of Dathomir Theme Park.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Singing_Mountain_Clan",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Singing_Mountain_Clan_Stronghold",
  "/wiki/The_galaxy/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Sony"
 ]
}