{
 "name": "Haako",
 "display_name": "Haako",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chadra-Fan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Highest bidder"
     ]
    }
   ]
  }
 ],
 "content": "Haako was a Chadra-Fan male who worked as an informant and scout during the Second Imperial Civil War. A long-time inhabitant of the Wheel, he kept no strict allegiance to any faction and worked for everyone who offered him credits at a given time. In 137 ABY, he provided information about the former Jedi Cade Skywalker to Jor Torlin, an agent for Sith Intelligence and Assassination, confirming that Skywalker was aboard the space station. After this, Haako proceeded to use his network of informants in an effort to determine Skywalker's location, per Torlin's instructions.\nHaako, a Chadra-Fan male, was born at some point before the end of the Sith–Imperial War. After the war's final battle in 130 ABY, Haako set up residence in the Wheel, a large space station located in the Besh Gorgon system in the Mid Rim. During this time, he made his living as an informant and scout for various employers, always willing to sell his information to anyone who could pay him in credits. Haako's services were used on occasion by the Sith agent Jor Torlin, a former Sith adept working for the intelligence division of Darth Krayt's Galactic Empire.\nSeven years later, during the Second Imperial Civil War, Haako contacted Torlin and informed him that the bounty hunter and former Jedi Cade Skywalker, for whom the Dark Lord of the Sith Darth Krayt was searching, was aboard the Wheel. The Chadra-Fan was instructed by Torlin to keep track of Skywalker's whereabouts. However, Skywalker left the station and Haako was unable to ascertain the bounty hunter's destination. Haako met with Torlin, who gave the Chadra-Fan a flimsiplast of Skywalker's portrait to confirm whether Haako had seen the same individual. Haako confirmed this and then left Torlin after being instructed by the agent to keep searching for Skywalker's location and to find out if he had been seen with any companions. Haako used his structure of informers in an attempt to find Skywalker.\nThe Chadra-Fan male Haako was an enthusiastic individual whose loyalty was for sale, depending on the amount of credits a potential employer was offering. He made sure he was cognizant of the people who visited the Wheel, always seeking to use his information as a potential means of income. He could speak and understand Basic and the Chadra-Fan. Haako possessed a hold-out blaster pistol, a comlink, a credit chip, and a datapad.\nHaako was created by John Ostrander, the writer of the Star Wars: Legacy comic series, for the first issue of the Trust Issues story arc. He was drawn by Colin Wilson in the comic, which was also Legacy's ninth issue. Haako later received entries in The Complete Star Wars Encyclopedia and the Legacy Era Campaign Guide.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Chadra-Fan/Legends",
  "/wiki/Rune_Haako/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Time/Legends",
  "/wiki/The_Wheel/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/137_ABY",
  "/wiki/Jedi/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Jor_Torlin",
  "/wiki/Agent/Legends",
  "/wiki/Sith_Intelligence_and_Assassination",
  "/wiki/Space_station/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Battle_of_Caamas",
  "/wiki/130_ABY",
  "/wiki/Besh_Gorgon_system/Legends",
  "/wiki/Mid_Rim",
  "/wiki/One_Sith",
  "/wiki/Sith_Acolyte",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Bounty/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Flimsiplast/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Chadra-Fan_(language)/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Credit_chip/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_9",
  "/wiki/Star_Wars:_Legacy:_Trust_Issues",
  "/wiki/Colin_Wilson_(artist)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Category:Images_of_Haako"
 ]
}