{
 "name": "Hadiya",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shikaakwa"
     ]
    },
    {
     "name": "Died",
     "values": [
      "25",
      "805 BBY",
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nine Houses",
      "Despot Army"
     ]
    }
   ]
  }
 ],
 "content": "Hadiya, the Despot Queen, was a female Twi'lek who united the crime barons of her homeworld of Shikaakwa and then conquered the rest of the Tython system. When the Je'daii Order challenged her in 25,805 BBY, Hadiya led the Despot Army to the planet Tython to begin the Despot War. The Despot Queen slew many Je'daii in battle on Tython, though her death at the hands of the Je'daii Daegen Lok at the Je'daii temple of Kaleth brought the Despot War to an end.\nA female Twi'lek, Hadiya came to power on the planet Shikaakwa in the Tython system. She began to unite the Nine Houses of Shikaakwa, subjugating the Houses' crime barons with the help of her chief advisor Bakko, the Iktotchi Ka'un Damm, and her \"fists\"—the Devaronian Shri-Lan and the Human Gav Vannar. When the current head of Clan Ryo refused to join her, Hadiya killed him and his eldest son. Following the execution of his father and brother, the young Volnos Ryo pledged fealty to Hadiya. With all Nine Houses of Shikaakwa sworn to her, Hadiya declared herself Queen.\nHaving taken control of her homeworld, Hadiya moved on to the other worlds of the Tython system, conquering them and earning the title of \"Despot Queen.\" However, Hadiya refused to submit to the authority of the Force-wielding Je'daii Order, and she sparked the Despot War in 25,805 BBY in order to conquer the entire Tython system. Hadiya's forces, the Despot Army, invaded the Je'daii homeworld of Tython with the intent of destroying the Je'daii. During the fighting, Hadiya was approached by a Je'daii Ranger named Daegen Lok who claimed to have defected from the Order and was willing to pledge his sword to the queen. Agreeing to have Lok by her side, Hadiya was impressed by his ruthlessness and quickly promoted him to general within her army.\nLaunching her attack on the Je'daii Temple of Kaleth with Lok by her side, Hadiya fought on the front lines, killing the mother and father of Shae Koda at the gates of the Temple. Despite her superior numbers, Hadiya's armies were ultimately outmatched by the Je'daii but were still willing to fight to the death. By the time they had reached Kaleth, Hadiya had taken Lok as her lover and allowed him to sleep in her tent beside her during the evenings. Late in the battle, Lok caught Hadiya asleep one evening and drew a small dagger. While Lok hesitated, Hadiya awoke and attacked her assailant, slashing at his right eye and scarring his brow before he grabbed her with the Force and killed her. Without their cruel queen to drive them onward, the Despot Army collapsed in on itself and Je'daii Lok was hailed a hero for his part in her demise. Hadiya was replaced by a weak Kral, or overlord, who was easily manipulated by the heads of the Nine Houses in the years after the Despot War.\nA charismatic leader, Hadiya was described by her lover, Daegon Lok, as cruel and beautiful as well as highly persuasive. As a political force, Hadiya was able to rally all of the planets of the Tython system to her cause by demonizing the Je'daii and the Force.\nFirst mentioned in Star Wars: Dawn of the Jedi 0, Hadiya first appeared in Dawn of the Jedi: Force Storm 1, and she has been referenced in various subsequent issues of the Dawn of the Jedi series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Shikaakwa",
  "/wiki/25,805_BBY",
  "/wiki/Tython/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nine_Houses",
  "/wiki/Despot_Army",
  "/wiki/Baron/Legends",
  "/wiki/Tython_system/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Planet/Legends",
  "/wiki/Despot_War",
  "/wiki/Death/Legends",
  "/wiki/Daegen_Lok",
  "/wiki/Kaleth",
  "/wiki/Bakko",
  "/wiki/Iktotchi/Legends",
  "/wiki/Ka%27un_Damm",
  "/wiki/Devaronian/Legends",
  "/wiki/Shri-Lan",
  "/wiki/Human/Legends",
  "/wiki/Gav_Vannar",
  "/wiki/Volnos_Ryo%27s_father",
  "/wiki/Clan_Ryo",
  "/wiki/Volnos_Ryo",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Je%27daii_Ranger",
  "/wiki/General/Legends",
  "/wiki/Shae_Koda%27s_mother",
  "/wiki/Shae_Koda%27s_father",
  "/wiki/Shae_Koda",
  "/wiki/Kral_(title)",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi_0",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_1",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi",
  "/wiki/Category:Images_of_Hadiya",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_4",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_2",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_4",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_5",
  "/wiki/Dawn_of_the_Jedi:_Force_War_2",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}