{
 "name": "Hagrin Zeed",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Talusian government"
     ]
    }
   ]
  }
 ],
 "content": "Hagrin Zeed was a male Human politician who served as the Prime Minister of Talus during the Galactic Civil War. Zeed was involved in various criminal activities, including selling stolen Imperial documents, bribery and murder.\nIn 1.5 ABY Zeed and his Minister of Protocol, Haleen Snowline, employed the services of an unsuspecting spacer to help them with supposedly official government business.\nWhen the Tralus and Talus Liberation Party came into possession of evidence of Zeed's wrongdoings, Snowline paid a spacer to deliver a payment to the Liberation Party. But when the Liberation Party kept the evidence, Snowline labeled the party activists as terrorists that supposedly stole valuable state secrets. She asked the spacer to attack and kill the \"terrorists\" and retrieve the evidence, leaving no survivors.\nZeed himself sold copies of Imperial reports he had purchased from a data slicer. He paid the spacer to deliver the reports to a courier that would deliver it to an former Imperial who according to Zeed was still interested in Imperial projects. Soon after these events the spacer was sent again to meet a courier and bring him a package that turned out to be a credit disc containing bribe money from the Corporate Sector Authority. Zeed had by now begun to rely on the spacer's services for his criminal activities. Next he sent the spacer to track down one of his employees who had allegedly embezzled credits from the public trust. He warned the spacer that accomplices of the thief, dressed as CorSec officers, would try to interfere. The spacer killed these men and brought the thief, who insisted that Zeed was a thief himself, back to Dearic.\nIt didn't take long before Zeed had another task for the spacer: he paid the adventurer to track down one of Zeed's aides that had run off and tried to blackmail him. He ordered the aide's execution, assuring the spacer that he would handle all the paperwork to make this execution legal. When the spacer returned after killing the aide, Zeed advised him to lay low for a while and not to contact him.\nHagrin Zeed was a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies prior to its closure on December 15, 2011. He could be found in the capitol building in Dearic where he offered several quests to players.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Talus/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Politics/Legends",
  "/wiki/Prime_Minister/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Minister_of_Protocol",
  "/wiki/Haleen_Snowline",
  "/wiki/Tralus_and_Talus_Liberation_Party",
  "/wiki/Terrorist/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Corellian_Security_Force",
  "/wiki/Sony",
  "/wiki/December_15",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed:_Prima_Official_Game_Guide"
 ]
}