{
 "name": "Haja_Estree",
 "display_name": "Haja Estree",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hidden Path"
     ]
    }
   ]
  }
 ],
 "content": "Haja Estree was a human male con artist who worked on the planet Daiyu during the reign of the Galactic Empire. A master of illusion, Estree ran a scam on Daiyu where he convinced people he was a Jedi—Force-sensitive peacekeepers that had been hunted and killed by the Empire—and helped those in need, in exchange for credits for his services. He partnered with the young boy Jayco who would find potential clients and lead them to Estree. Estree helped a mother and her son get off Daiyu, while former Jedi Master Obi-Wan Kenobi watched. Kenobi approached Estree and told him he required his services in finding a kidnapped girl, the Alderaanian Princess Leia Organa. Estree agreed to help after Kenobi uncovered his scam, and directed Kenobi to a spice den.\nShortly after, when the Inquisitor Third Sister put a bounty on Kenobi, Jayco informed Estree of the bounty and they went to go locate him. Estree found Kenobi and Organa, but not before bounty hunter droid 1-JAC came up behind the pair. Estree shot 1-JAC and gave Kenobi instructions to get to a cargo transport that would lead to the planet Mapuzo. Kenobi reluctantly agreed, and Estree informed him he was not alone, and said he would try to delay the Inquisitors as long as possible. Estree found the Third Sister in an alley, but she quickly realized he wasn't a Jedi, before probing his mind for Kenobi's location.\nNow wanted by the Empire, Estree headed for the planet Jabiim, where he regrouped with members and refugees of The Path—an anti-Imperial network that sheltered Jedi and force-sensitive beings—as well as Kenobi and Organa. Estree watched over Organa at the request of Kenobi after the latter had gone on to face the Third Sister. After the Imperial raid on the facility and the subsequent escape from the planet, the members of the Path fled from the Imperial Star Destroyer Devastator and Sith Lord Darth Vader. Kenobi decided to part ways with the Path to buy them time, and Estree promised he would get Organa back home. Estree also comforted Organa after she grew angry with Kenobi for leaving her.\nDuring the reign of the Galactic Empire, Haja Estree resided on the planet Daiyu, working as a con artist. In his scam, he posed as one of the Jedi, Force-sensitive peace-keepers who were hunted by the Empire after their Jedi Order was destroyed in 19 BBY. Helping those in need in return for a sum of credits, his performance of a Jedi included using remotes to close the shutters of his building and magnets to summon his comlink to create an illusion of using the Force. The con man also employed the help of the boy Jayco as well a contact at a spaceport on Daiyu who he could pretend to use a Jedi mind trick on over his comlink and \"convince\" him to give individuals safe passage through the port.\nIn the meantime, Estree maintained ties with an anti-Imperial network known as \"the Path.\" The Path used a series of safehouses to smuggle real Force-sensitives, who were thus fugitives of the Empire, to the Outer Rim Territories world of Jabiim to receive new identities to go into hiding. He notably had contact with Captain Tala Durith, an undercover Imperial officer on the Mid Rim mining planet Mapuzo who had become disillusioned with the Empire and chose to help with the network.\nIn 9 BBY, Estree helped the Force-sensitive boy Corran and his mother flee Daiyu, pretending to use the Force to trick his contact into letting the pair through to a transport to the planet Corellia at Gate 3-C. Corran's mother complimented Estree's apparent Force abilities and paid him all of her credits as payment for his services. When she promised to never forget Estree, the fake Jedi stressed that she must as his safety depended on it. Estree then urged Corran and his mother away to their transport before informing his contact that he would take a quick break once the pair had left.\nUnbeknownst to Estree, former Jedi Master Obi-Wan Kenobi had been led to his lair by Jayco and was watching the encounter from the edge of the room. Kenobi revealed himself, claiming that he was looking for a Jedi. Estree asked how his visitor had gotten into the room, but Kenobi continued, specifying that he was looking for a kidnapped girl, the Alderaanian Princess Leia Organa. Estree introduced himself as a Jedi and explained that he helped people in need in return for credits, asking for a sum of 800 credits to locate and take Kenobi to the girl. The fake Jedi also offered Force tricks for a total of a thousand credits, only for Kenobi to raise a blaster pistol to his chest and reveal his magnetic devices.\nHaving been found out by Kenobi, Estree asked if his visitor would tell others about his con, leading the fugitive Jedi to blackmail the con man into helping him find Organa. Estree immediately agreed, promising Kenobi that he could be trusted. The con man thus pointed Kenobi in the direction of a spice den was located. Using Estree's information, the Jedi infiltrated the spice den and extracted Organa. However, the Third Sister, a member of the Empire's Jedi-hunting organization of the Inquisitorius, had also arrived to hunt Kenobi, and chose to send out a bounty on the Jedi across Daiyu's city to help find her target.\nJayco went and informed Estree about Kenobi's bounty, revealing to the con man who the visitor really had been. Estree called it embarrassing that they had missed out on the bounty and took up a blaster to go and find Kenobi. In reality, Estree wanted to help get Kenobi to the anti-Imperial network on Mapuzo. The con artist caught up with his old visitor and Organa at an alleyway near the spaceport, gunning down the bounty hunter droid 1-JAC before it could attack the pair. Kenobi believed Estree was coming for his bounty, but the con man instead gave him instructions to go to an automated cargo port and use a tracking fob to take the automated vessel transport eight to Mapuzo.\nKenobi asked Estree how he could trust him since he was a criminal, and Estree replied that he had made bad decisions, but he wanted to make amends. He added that he got Corran and his mother to safety, and he would do the same for Kenobi, adding that he would stall the Inquisitors as long as he could. Estree then cornered the Third Sister in an alley, continuing his act as a Jedi. The Inquisitor quickly figured out he wasn't one, but still knew where Kenobi was. She probed his mind with the Force and found where he had sent Kenobi, leaving Estree in the alley to pursue her target.\nFollowing his encounter with the Third Sister, Estree became wanted by the Empire and arrived on Jabiim. When Kenobi arrived with Kawlan Roken—a leader of the Path—from rescuing Organa from the Inquisitors' fortress, Kenobi greeted Estree who informed him that he had nowhere else to go. Estree also joked that now he knew what it felt like being a real Jedi, and that The Path headquarters was a good place for business. After the Imperial Star Destroyer Devastator—the flagship of Sith Lord Darth Vader—arrived over Jabiim, Estree worked with the other refugees locking down all the entrances of the facility. Kenobi later asked Estree to keep an eye on Organa while she delved into the vents trying to open the main hangar door, to which Estree replied that he was not a babysitter, but had no choice but to agree as Kenobi was called away.\nWhile Estree watched Organa, the Third Sister and her forces attacked the facility in hopes of capturing Kenobi, which resulted in a number of deaths on both sides. Tala Durith used her blaster to close off one of the blast doors to the main hangar before she sacrificed herself. After the attack halted, Kenobi agreed to surrender to the Third Sister and Vader, which prompted the former con-man to ask if he was going to fight Vader. Kenobi replied that Vader knew he would to anything to protect the refugees, and handed Estree his lightsaber, blaster, and imagecaster, once again asking Estree to keep an eye on Organa. After Organa opened up the hangar bay doors, Estree dropped Kenobi's imagecaster while running to the transport. A decoy transport took off from the base which Darth Vader pulled down with the force, before the true transport made its escape. Following the escape, the Third Sister found Kenobi's imagecaster that Estree had dropped.\nFleeing Jabiim, the transport was pursued by the Devastator and possessed a faulty hyperdrive. As a result, Kenobi decided he would part ways with the refugees as it would give Roken time to fix the ship and escape, much to Organa's anger. Estree advised Kenobi to give Organa some space and promised he would get Organa to her home planet of Alderaan as soon as Kenobi was clear. Estree also spoke to Organa, consoling her before Kenobi returned to speak to her and say his farewells. Kenobi and Organa later regrouped on Alderaan.\nAs a master of illusion and a criminal, Estree's motivation for his scam was to attain more credits. He enlisted the help of Jayco who found potential clients and led them to his lair, using magnets and remotes to sell his fake Jedi scam. Estree carried a fake lightsaber at his hip on the outside of his robes, whereas most Jedi concealed their lightsabers underneath their robes. He later decided to help Kenobi's escape, saying that he wanted to make amends.\nDespite his criminal activities and lies, Estree genuinely wanted to help Kenobi. He was also loyal to the Path, keeping in touch with Tala Durith on Jabiim, although he said that the Path's headquarters was a good location to conduct his scam. Estree later assisted The Path in escaping from Jabiim, finally earning Kenobi's trust. Estree had black hair and light colored skin.\nEstree used a series of remotes to close the shutters of the building to make it look like he was using the Force, as well as magnets to summon his comlink. He also carried a fake lightsaber on his hip. He owned a blaster pistol that he was capable with.\nPortrayed by Kumail Nanjiani, Haja Estree first appeared in \"Part II\" of the live-action Disney+ series Obi-Wan Kenobi, which aired on May 26, 2022. The character was teased beforehand as well, first being mentioned in an interview with Nanjiani and later being shown in the teaser trailer for the series, which was released on March 9, 2022.\nWriter Joby Harold felt that having a fake Jedi would be a fun thing to add to Star Wars, leading to the creation of the con artist Haja Estree. Estree was shown pretending to use the Force to close the shutters in the second episode to make it clear that he's a fraud. Harold wanted that scene because director J.J. Abrams told him it should be a massive moment when Jedi use the Force and it must be earned. Nanjiani landed the role after director Deborah Chow pitched the project to him and he agreed.\nTo prepare for his role, Nanjiani re-watched all the Star Wars films, as well as looking up different techniques that con-men used to scam their marks. The actor believed it was very fun to portray a con-man in the context of Star Wars, as well as playing a fake Jedi in general.. The actor described the character as a \"street-level con-man guy who then gets embroiled in stuff that's way too big for him.\" Nanjiani elaborated that Estree had a complicated morality, with a \"pull and push inside of him\", making the choice between doing the right thing and making money, which made the choice he eventually makes much richer.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Featured_article_nominations/Haja_Estree",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Hidden_Path",
  "/wiki/Con_artist",
  "/wiki/Planet",
  "/wiki/Daiyu",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Jedi",
  "/wiki/Force-sensitive",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Death",
  "/wiki/Credit",
  "/wiki/Youngling",
  "/wiki/Jayco",
  "/wiki/Corran%27s_mother",
  "/wiki/Corran",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Mission_to_Daiyu",
  "/wiki/Kidnapping_of_Leia_Organa",
  "/wiki/Alderaanian",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/The_Den",
  "/wiki/Inquisitor",
  "/wiki/Reva_Sevander",
  "/wiki/Bounty",
  "/wiki/Bounty_hunter",
  "/wiki/Droid",
  "/wiki/1-JAC",
  "/wiki/Transport_eight",
  "/wiki/Mapuzo",
  "/wiki/Mind_probe_(Force_power)",
  "/wiki/Brain",
  "/wiki/Jabiim",
  "/wiki/Attack_on_Jabiim",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Devastator",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Time",
  "/wiki/Alderaan",
  "/wiki/Jedi_Order",
  "/wiki/Order_66",
  "/wiki/19_BBY",
  "/wiki/Magnet",
  "/wiki/Comlink",
  "/wiki/The_Force",
  "/wiki/Haja_Estree%27s_contact",
  "/wiki/Daiyu_spaceport",
  "/wiki/Mind_trick",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Captain",
  "/wiki/Tala_Durith",
  "/wiki/Imperial_officer",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Mining",
  "/wiki/9_BBY",
  "/wiki/Transport",
  "/wiki/Corellia",
  "/wiki/Gate_3-C",
  "/wiki/Parent",
  "/wiki/Currency",
  "/wiki/Blaster_pistol",
  "/wiki/Spice",
  "/wiki/Hunting",
  "/wiki/Inquisitorius",
  "/wiki/Hunt_for_Obi-Wan_Kenobi",
  "/wiki/Daiyu_city",
  "/wiki/Blaster",
  "/wiki/Spaceport",
  "/wiki/Tracking_fob",
  "/wiki/Unidentified_automated_transport",
  "/wiki/Kawlan_Roken",
  "/wiki/Rescue_of_Leia_Organa",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Blast_door",
  "/wiki/Hangar",
  "/wiki/Lightsaber",
  "/wiki/Imagecaster",
  "/wiki/Hyperdrive",
  "/wiki/Robe",
  "/wiki/Jedi_robes",
  "/wiki/Hair",
  "/wiki/Kumail_Nanjiani",
  "/wiki/Part_II",
  "/wiki/Disney%2B",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/May_26",
  "/wiki/March_9",
  "/wiki/2022",
  "/wiki/Joby_Harold",
  "/wiki/Star_Wars",
  "/wiki/J.J._Abrams",
  "/wiki/Deborah_Chow",
  "/wiki/Category:Images_of_Haja_Estree",
  "/wiki/Part_III",
  "/wiki/Part_V",
  "/wiki/Part_VI",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Obi-Wan_Kenobi_Companion",
  "/wiki/Star_Wars_Insider_214",
  "/wiki/Databank_(website)",
  "/wiki/Part_I",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Entertainment_Weekly",
  "/wiki/May_20",
  "/wiki/March_11",
  "/wiki/June_3",
  "/wiki/Obi-Wan_Kenobi:_A_Jedi%27s_Return"
 ]
}