{
 "name": "Hala",
 "display_name": "Hala",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "34 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Hala was a female Human slave on Tatooine in the final years of the Galactic Republic, before the Clone Wars. She was the mother of Amee, a close friend of Anakin Skywalker, and was owned by Yor Millto.\nAfter being taken in a slave raid by the pirate Krayn, Hala showed defiance to the slavelord, who, because of that defiance, murdered her and took a small silver-bell necklace off her body to wear as a trophy. Anakin would later recognize this bell when he himself was taken by Krayn as a prisoner-slave in 29 BBY; that the crime-lord wore the trinket on his belt betrayed the grave meaning behind it, and it enraged the boy.\nHala was avenged by Skywalker when he confronted Krayn in battle as he fled the rebellious uprising of his own slaves: the Jedi Padawan impaled the pirate with his recently constructed lightsaber.\nHala's bell, as depicted in the Jedi Quest comics, was gold, not the original silver bell that appears in Jude Watson's Jedi Quest: Path to Truth story. But the comics' permutation of the bell is made to equate with the bell of Anakin's Ilum temple Force vision before he crafts his first lightsaber: the same gold bell that Hala is seen to wear about her neck in the comics is the bell of Skywalker's Crystal Caves vision —the bell that musically and pleasingly sounds, rolls toward and stops at the Padawan's feet, and pours forth blood, which spills over the boy's boots. Interestingly, the comics' main image of Hala wearing a glinting bell around her neck is rendered, it seems, in tones that suggest blood-red.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/34_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Amee/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Yor_Millto",
  "/wiki/Pirate/Legends",
  "/wiki/Krayn",
  "/wiki/29_BBY/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker%27s_first_lightsaber/Legends",
  "/wiki/Star_Wars:_Jedi_Quest_(comic_series)",
  "/wiki/Jude_Watson",
  "/wiki/Jedi_Quest:_Path_to_Truth",
  "/wiki/Ilum/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/Crystal_Caves",
  "/wiki/Jedi_Quest_2",
  "/wiki/Jedi_Quest_3",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_55",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}