{
 "name": "Haleen_Snowline",
 "display_name": "Haleen Snowline",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Talus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Haleen Snowline was a female Human who worked as the Minister of Protocol for Hagrin Zeed, the Prime Minister of Talus. She lived and worked in Dearic.\nSnowline was involved in Zeed's criminal activities. Sometime following the Battle of Yavin in 0 BBY, she paid a spacer to deliver a bribe from Zeed to the Tralus and Talus Liberation Party who had acquired evidence of Zeed's wrongdoings. When the Liberation Party let Snowline know that they still had the evidence and that the Prime Minister could expect to hear from them again, Snowline had the spacer attack the Liberation Party members. She described them as terrorists that had stolen valuable state secrets. The spacer retrieved the evidence, leaving no survivors. Now that the spacer had proven to be a valuable asset, he was allowed to meet the prime minister.\nHaleen Snowline was a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies prior to its closure on December 15, 2011. She could be found in the capitol building in Dearic where she offered two simple quests to players.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Talus/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Minister_of_Protocol",
  "/wiki/Hagrin_Zeed",
  "/wiki/Prime_Minister_(Talus)",
  "/wiki/Dearic/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Tralus_and_Talus_Liberation_Party",
  "/wiki/Terrorist/Legends",
  "/wiki/Sony",
  "/wiki/December_15",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed:_Prima_Official_Game_Guide"
 ]
}