{
 "name": "Halidrell_Setsyn",
 "display_name": "Halidrell Setsyn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Baras"
     ]
    }
   ]
  }
 ],
 "content": "Halidrell Setsyn was a Human female who served as one of Darth Baras' operatives during the Cold War.\nOver the years, Setsyn ran Baras' slaving operation on Nar Shaddaa. She came into the Sith Lord's service unexpectedly after taking over from his previous operative–she tricked the slaver out of a large number of credits and some of his stock, not knowing who he worked for. Before Setsyn could escape the planet, Baras contacted her and offered the position that had suddenly opened up.\nIn 3643 BBY, Setsyn assisted Baras' apprentice in their plan to eliminate Dellocon, one of Baras' former secret agents, and Rathari, a rival Sith Lord who offered him protection. Under her guidance, Baras' apprentice thwarted Rathari's deal with the Hutt Cartel, which also resulted in the death of the his apprentice Girik, and later destroyed the Sith Lord's forces sieging Republic outpost Shylon, at Nar Shaddaa's Upper Industrial Sector. Unfortunately for Setsyn, Rathari was able to track down and assault her base, killing her after a brief confrontation\nLater, Baras expressed his condolences for her loss and admitted to having a soft spot for her.\nA witty flirt and able liar, she was able to talk her way both into and out of trouble. She had a tendency to overreach but had become proficient at escaping death as a result.\nHalidrell Setsyn is the NPC responsible for starting Nar Shaddaa's first missions within the Sith Warrior storyline, playable in Star Wars: The Old Republic. Male Sith Warriors can flirt with her.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/3643_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Darth_Baras",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Standard_year/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Dellocon",
  "/wiki/Rathari",
  "/wiki/Hutt_Cartel",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Girik",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Death/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}