{
 "name": "Hallio_Bas",
 "display_name": "Hallio Bas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Skako Minor"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3 ABY",
      "Skako Minor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Skakoan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pink"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Son-tuul Pride"
     ]
    }
   ]
  }
 ],
 "content": "Hallio Bas was a male Skakoan from the planet Skako Minor. He made an agreement with the Galactic Empire to bring them looters on Skako Minor. Around 3 ABY he worked as a guide for the criminal syndicate known as Son-tuul Pride to lead them to the workshop on Skako Minor. He met with the mercenaries hired by Son-Tuul Pride on Son-tuul and then they traveled, onboard a patrol transport, to Skako Minor. There, Bas led them into an Imperial trap. The Imperials wanted to execute the mercenaries, but before they could do so, the leader of the mercenaries, Doctor Chelli Aphra, detonated her genetically-modified pet, killing Bas.\nAt some point, Hallio Bas made an agreement with the Galactic Empire to bring them looters on Skako Minor in the hopes that they would cease their occupation of the world. Around 3 ABY, he made an arrangement with the criminal syndicate Son-tuul Pride to lead them to the workshop of Wat Tambor on Skako Minor; however, in truth he planned on handing them over to the Imperials. He met with a group of mercenaries hired by Son-Tuul Pride on the planet Son-tuul. Before they could travel onboard their patrol transport to Skako Minor, though, their leader, Doctor Chelli Aphra was ordered by her superior to leave one of the mercenaries behind. She chose the swordsman known as the Violet Ghost and they left his at the Son-tuul Spaceport.\nThe mercenaries traveled to Skako Minor Bas led them through the fungal forest, explaining to Aphra the story of Tambor and the Techno Union. However, they soon bumped into an Imperial ambush which Bas had arranged and he pleaded with the Imperials to leave Skako Minor. The Imperials refused his request and prepared to execute the mercenaries. Aphra then gave Bas her pet genetically-engineered tooka Flufto. Bas held the Tooka when she detonated it, killing him and the Imperials.\nHallio Bas was a male Skakoan with dark green skin and pink eyes. He was keen for the Empire to leave his planet and attempted to bargain this by leading looters into their custody.\nHallio Bas wore a suit which was adapted for pressurized hydrogen sulphide. Over it, a pink cloak covered his body.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Skako_Minor",
  "/wiki/3_ABY",
  "/wiki/Skakoan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Son-tuul_Pride",
  "/wiki/Planet",
  "/wiki/Wat_Tambor%27s_workshop",
  "/wiki/Mercenary",
  "/wiki/Son-tuul",
  "/wiki/Mission_to_Skako_Minor_(Son-tuul_Pride)",
  "/wiki/LAAT/le_patrol_gunship",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Wat_Tambor",
  "/wiki/Rabael_Dir_Glorio",
  "/wiki/Son-tuul_Spaceport",
  "/wiki/Techno_Union",
  "/wiki/Tooka",
  "/wiki/Flufto",
  "/wiki/Doctor_Aphra_(2016)_15",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Accresker_Jail",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Crimson_Reign_3",
  "/wiki/Jeremoch_Colton",
  "/wiki/Wreckage-prison",
  "/wiki/Standard_year",
  "/wiki/The_Archivist",
  "/wiki/Prisoner",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Death"
 ]
}