{
 "name": "Hallux",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Isobe"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sephi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Isobe royal family"
     ]
    }
   ]
  }
 ],
 "content": "Lord Hallux was the monarchic ruler of the planet Isobe. His children were Thelan and Althea.\nLord Hallux was a male Sephi who reigned over the people of Isobe during the Imperial Era. Under his rule, the sale of rare Tynzo crystals overwhelmed Isobe with wealth. At one point, however, the lord's son, Captain Thelan, started a crystal smuggling ring. Eventually, law enforcement caught a member of that ring, a young human named Jun Sato. To add insult to injury, the human had begun a sentimental relationship with Hallux's daughter, Princess Althea. Although Sato defended himself, the Lord of Isobe found him guilty of the charge, and banished him from the planet forever.\nIn the years that followed, Hallux dealt with a disruption of the Tynzo market caused by Thelan's undercutting. Eventually, Althea died. The day after the princess' burial, Jun Sato, now a Commander in the Alliance to Restore the Republic, was brought before Hallux, accompanied by fellow Rebel Sabine Wren. The Lord of Isobe learned from the Rebel commander that Thelan had been behind the smuggling ring all along, undercutting him for all those years. Hallux ordered his guards to take the prince away, and gave Sato one hour to pay his respects at Althea's grave.\nHallux was a broad-shouldered, peach-skinned Sephi with green eyes. At the time of Sato's return, his hair was still brown, and he sported a full beard with a pointed mustache.\nThe Sephi lord loved his daughter, as attested by both the engraving on her tombstone and the fact that he personally carved a Tynzo crystal into a heart in her honor. When Thelan's treason was revealed, Hallux took it with apparent calm, simply noting that his son had made it his life's work to disappoint him. Although the Sephi's grudge against Sato did not go away, even in light of the revelation, Hallux still allowed the Rebel an hour to mourn Althea.\nLord Hallux first appeared in \"Never Far Behind,\" a 12-page comic story written by Jeremy Barlow and illustrated by Cosmo White. The story was published under the German title \"Unvergessen\" in the 39th issue of the German Star Wars Rebels Magazine, which was released on December 20, 2017.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Isobe",
  "/wiki/Sephi",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Isobe_royal_family",
  "/wiki/Lord",
  "/wiki/Monarchy",
  "/wiki/King",
  "/wiki/Planet",
  "/wiki/Thelan",
  "/wiki/Althea",
  "/wiki/Imperial_Era",
  "/wiki/Tynzo_crystal",
  "/wiki/Crystal",
  "/wiki/Captain",
  "/wiki/Human",
  "/wiki/Jun_Sato",
  "/wiki/Prince",
  "/wiki/Standard_year",
  "/wiki/Death",
  "/wiki/Standard_day",
  "/wiki/Burial",
  "/wiki/Commander",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Sabine_Wren",
  "/wiki/Standard_hour",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Heart",
  "/wiki/Never_Far_Behind",
  "/wiki/Jeremy_Barlow",
  "/wiki/Cosmo_White",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/December_20",
  "/wiki/2017"
 ]
}