{
 "name": "Halorum",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "A species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Apprentices",
     "values": [
      "Lost and Found"
     ]
    }
   ]
  }
 ],
 "content": "Halorum was a female member of a species. She was a proprietor of the salvage store, Lost and Found on the planet Banas. She kept a strict no refund policy and was skeptical of individual stealing from her store.\nDuring the Galactic Civil War, Commander Luke Skywalker and Princess Leia Organa traveled to Banas to determine if the planet was suitable for a Alliance to Restore the Republic base. They hid out in Halorum's store to figure out what the Imperial interest were on Banas. Halorum kept a close eye on the rebels, when a mother and her child ran in asking for safety as the snowtroopers prepared a sweep. At first she refused, but then Leia paid her for a doll and her silence. She agreed to help and led the rebels to the back, where she hid them underneath hides and carpets.\nWhen the Imperials arrived, they questioned Halorum on the whereabouts of Organa and Skywalker, but Halorum refused to give them away. The officer then ordered the store to be searched with her store being ransacked.\nAfterwards, Halorum realized the repercussions her and the others would feel from the Empire. But she gave the directions of her cousin, Moular who would help them off the planet. Organa offered her an opportunity to join the rebellion, but she refused, not wanting to take sides.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_species_(Banas)",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Lost_and_Found",
  "/wiki/Planet",
  "/wiki/Banas",
  "/wiki/Galactic_Civil_War",
  "/wiki/Commander",
  "/wiki/Luke_Skywalker",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Mission_to_Banas",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Eye",
  "/wiki/Parent",
  "/wiki/Youngling",
  "/wiki/Cold_weather_assault_stormtrooper",
  "/wiki/Doll",
  "/wiki/Imperial_officer",
  "/wiki/Moular",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Halorum",
  "/wiki/Hyperspace_Stories_2"
 ]
}