{
 "name": "Ham",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Unit Five-Two-D",
      "Table five",
      "Table five"
     ]
    }
   ]
  }
 ],
 "content": "Ham was a human male prisoner of the Galactic Empire that served time in an Imperial Prison Complex on the moon Narkina 5. He worked in Unit Five-Two-D as one of the seven men on table five, assembling complex machinery for the Empire during twelve hour shifts. In 5 BBY, the prisoner Cassian Andor, using the alias \"Keef Girgo,\" was added to table five after they lost a member. During Andor's first shift with Ham, their table scored lowest in the room and so were all shocked with electricity as punishment before returning to their cells.\nOver many shifts, the table learned to work smoothly as a unit with their new member, even looking like they might get the highest score during some shifts. However, Ham and the others became concerned when their elderly tablemate Ulaf began to struggle with the work as his health declined. Ulaf eventually collapsed during a shift after suffering a massive stroke, and was euthanized soon after. Following Ulaf's death, Andor and Kino Loy, the shift manager of Unit Five-Two-D, revealed to Ham and the others that the Empire was never going to release them and would simply transfer them to another prison when their sentence ended. Ham and the rest of the unit then began to plot their escape from the prison, seeing it as the only way they would ever leave.\nThe following day, the unit began their shift as normal while waiting for Ulaf's replacement to be brought in. Once the new prisoner was brought into the room, Ham and the prisoner Xaul feigned a fight to distract the Imperial guards, allowing Andor to the jam the lift bringing the new prisoner down. Ham and the others then began hurling components at the Imperials in the room, and when the Imperials tried to electrocute the prisoners, the power shorted out due to a flood that had been created in the rest room. Xaul was then killed by the guards, after which Ham ran to climb up to the Imperial control room.\nOnce the control room was captured, Andor armed Ham, who then led a group of prisoners to help take control of another control room on Level 5. Ham cried out for the prisoners inside the room to join the escape attempt before moving on to shoot down several Imperials attacking a group of prisoners led by Ruescott Melshi. After Andor and Loy took control of the prison's command center and powered down the entire building, Ham and many others joined them on Level 8, where he was one of the first to leap to his freedom in the waters surrounding the prison.\nBy 5 BBY, the human male Ham was a prisoner of the Galactic Empire, serving out a sentence in an Imperial Prison Complex on the moon Narkina 5. In the prison, Ham was assigned to table five of Unit Five-Two-D, the day shift of the second floor on Level 5. Each day, he and the six other men on his table worked a twelve hour shift putting together complex Imperial machinery.\nIn 5 BBY, the number of remaining days in Ham's sentence was doubled along with those of ever other prisoner under the Empire's new Public Order Resentencing Directive. The following month, table five lost one of its members, causing it to fall behind in the constantly evaluated competition against the other tables in the room. Cassian Andor, a new inmate who had been brought in under the alias \"Keef Girgo,\" was assigned to fill the empty slot on table five. An hour before the end of a shift, Andor was brought in by the guards. Ham and the rest of the unit ceased work and went on program, placing their hands behind their heads, planting their feet on the ground, and keeping their eyes forward. Once Kino Loy, the unit manager for Unit Five-Two-D, ordered the room back to work, Ham returned to the machinery as Loy explained the system to Cassian.\nOnce Andor approached the table, the prisoner Jemboc introduced him to Ham and the other members of table five; Xaul, Taga, Ulaf, and Ruescott Melshi. Ham remained silent while the others discussed if Loy would give them a pass for being ten behind in score, but after the others paused when Melshi remined them of Andor's name, Ham shouted at them to return to work. After receiving a call from the guards, Loy announced that the whole room would be entering a sprint segment for the final thirty-nine minues of the shift. At the end of the shift, table five were electrocuted via the facility's tunqstoid steel floor for being the least productive table. Following the shift, Ham and the other members of the table looked haggard as they crossed the skybridge back to their living quarters.\nOnce the unit was back in their cells, Ham listened silently from his cell with his arms crossed as the rest of table five questioned Andor about how people outside the prison had reacted to the Public Order Resentencing Directive. When Andor responded that he had never heard of it, the others were shocked and Loy soon ordered them all back into their cells for the night. Thirty shifts later, Ham and the rest of his unit submitted to mass decontamination before picking up fresh uniforms and starting a shift where they worked smoothly together and had a chance of winning the shift.\nIn the shift following the suicide of the prisoner Veemoss, table five was once again working smoothly and discussed trying to push for the highest score, which would earn them flavoring in their food as a reward. Ulaf, the oldest member of table five, asked for help as his hand was giving him problems, so Andor offered to switch places. When Taga questioned the switch, Ham stated that Andor was faster, causing Taga to chastise Ham for his bluntness. Ham and the rest of the unit later had to stop working and go on program once Veemoss's replacement arrived.\nWith an hour left in the shift, the group discussed what was happening next. Two minutes later, Ulaf asked what was next again, causing a concerned Ham to point out that they had already been told. Ulaf became defensive and hurried the table to keep working, but as they did, Ham exchanged a worried glance with Xaul. After the shift, the unit was held for an unusual amount of time in the sky bridge, with Taga eventually reporting that other units were signalling that something had happened on Level 2. As Ham and the others grew disquieted, Loy called for quiet, but as he did so the lighting dimmed as the power dropped out momentarily. After Loy again called for quiet, an alarm blared and Ham and the others went on program, before being allowed to return to their cells. At the next shift change, word began to spread that two whole shifts had been killed by the Empire, causing tensions to rise. Ham had to step back out of the way when Loy attacked Melshi for saying that the dead prisoners had been set free.\nLoy ordered everyone to ignore the rumor and work as normal on the next shift, but Ulaf continued to struggle. At the end of the shfit, Ham and the others went on program as table one was summoned up to be punished for their low score, but Ulaf was unable to stand and collapsed against the table. Xaul and Andor quickly covered the ailing prisoner as he continued to suffer. As the shifts crossed back across the skybridge at the end of the shift, Ulaf collapsed again so Loy summoned a medtech and he and Andor remained with Ulaf while Ham and the others returned to their cells. However, by the time the medtech, Doctor Rhasiv, arrived, it was already to late for Ulaf, who had suffered a massive stroke, and so the medic euthanized him.\nAfter Andor and Loy returned to the cells, they announced Ulaf's death to Ham and the others, but also revealed that Rashiv had told them why the men on two had been killed: the Empire had made a mistake and placed a prisoner who had been released from Level 4 back on Level 2, revealing to the prisoners there that they would never be released, only transferred to another prison. Knowing that escape was now their only means of ever leaving prison, the entire unit began planning an uprising based around the arrival of Ulaf's replacement the next day. They were ordered to cross the skybridge in silence and then worked as normal at their tables until the replacement arrived. Shortly before the replacement arrived, Ham prompted Andor to take a toilet break, during which Andor sawed through a water pipe that would flood the room. Nervous, Taga asked Ham where Andor was, but Ham and Xaul told him to be calm.\nAs Ulaf's replacement was prepared to be brought out, Xaul and Melshi began distributing parts to Ham and the others. As the replacement was then lowered into the room on a lift, Andor, having returned from the flooding rest room, gave a signal to Xaul and Ham. The pair then staged a fight, with Xaul attacking Ham and drawing the guards' attention. Using the distraction, Andor jammed the lift halfway through its descent and Loy ordered the unit to start damaging their equipment. Ham and Xaul ceased fighting and began hurling the metal components at the Imperials, as the prisoner Birnok and Ulaf's replacement attacked the guard on the lift.\nAs the Imperials gave the order for the floor to be electrified, Ham and the others scrambled onto tables as Loy shouted a warning. Once the electricity was activated, the water from the flooding rest room caused it to short out, plunging the room into darkness. With the floor now safe, Loy gave the order to attackand other prisoners began charging the lift. Ham and Xaul remained in cover behind a table, but after stepping out to hurl a rivet, Xaul was shot dead. Ham cried out as his fellow prisoner fell, then charged at the lift.\nAndor killed the three Imperials above as Ham climbed, and the prisoners had soon taken over the control room. After killing two more guards as they arrived, Andor threw Ham a DH-17 blaster pistol from the guards' weapon rack. Ham led a group of armed inmates including Jemboc and Taga away from the control room, separating from Andor, Loy, and Melshi. His group attacked the Imperials in the control room of another unit's room on Level 5, and once the Imperials were dead, Ham rushed out onto the balcony overlooking the room and shouted for its occupants to join the escape attempt. He then ran back inside the control room and lowered the lift for the other unit, who began cheering and climbing up. Ham continued with his team, coming upon a trio of Imperials that were attack Melshi's group in a separate control room. Ham shot the three foes in the back and then led his team up another stairway without stopping.\nMeanwhile, Andor and Loy had captured the command center for the entire prison and forced the Imperials there to shut down the hydro power for the building. Loy announced the uprising over the comms to the entire prison, causing the remaining units to rise up. Ham and the others then reached Loy and Andor on Level 8 and together the prisoners ran to a ledge looking out over the ocean surrounding the prison. As the others stared down, Ham yelled to the rest before leaping over the edge and down into the water, with the others soon following, bar Loy, who could not swim. Ham and the others then began to swim to freedom, with at least some making it to shore safely.\nWhile imprisoned on Narkina 5, Ham learned the power of staying quiet while other prisoners chattered. He cried out after seeing Xaul die, and led other prisoners during the prison break, being one of the first to take the leap into the water and freedom. Ham had light skin, dark brown hair, blue eyes, and spoke basic with an accent.\nAs a prisoner of Narkina 5, Ham wore paper-thin, white and orange prison scrubs with no footwear. He used a riveting tool and a laser solder gun while working at table five.\nHam was portrayed by Clemens Schick in the television show Andor, first appearing in the eight episode, \"Narkina 5,\" which aired on October 26, 2022.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Unit_Five-Two-D",
  "/wiki/Table_five",
  "/wiki/Prisoner",
  "/wiki/Galactic_Empire",
  "/wiki/Narkina_5_Imperial_Prison_Complex",
  "/wiki/Moon",
  "/wiki/Narkina_5",
  "/wiki/Standard_hour",
  "/wiki/5_BBY",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Ulaf",
  "/wiki/Death",
  "/wiki/Kino_Loy",
  "/wiki/Xaul",
  "/wiki/Guard",
  "/wiki/Level_5_(Narkina_5)",
  "/wiki/Ruescott_Melshi",
  "/wiki/Level_8",
  "/wiki/Water",
  "/wiki/Prison",
  "/wiki/Standard_day",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Public_Order_Resentencing_Directive",
  "/wiki/Standard_month",
  "/wiki/Limb",
  "/wiki/Eye",
  "/wiki/Jemboc",
  "/wiki/Taga",
  "/wiki/Standard_minute",
  "/wiki/Tunqstoid_steel",
  "/wiki/Suicide",
  "/wiki/Veemoss",
  "/wiki/Foodstuff",
  "/wiki/Medic",
  "/wiki/Doctor",
  "/wiki/Rhasiv",
  "/wiki/Birnok",
  "/wiki/DH-17_blaster_pistol",
  "/wiki/Ocean",
  "/wiki/Hair",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Clothing",
  "/wiki/Andor_(television_series)",
  "/wiki/October_26",
  "/wiki/2022",
  "/wiki/Category:Images_of_Ham",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/One_Way_Out",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/August_10"
 ]
}