{
 "name": "Hamato_Xiono",
 "display_name": "Hamato Xiono",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Hosnian Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Xiono family",
      "New Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Hamato Xiono was a human male senator in the New Republic Senate and the father of Resistance operative Kazuda Xiono, alongside Kazuda's mother. During the latter years of Republic rule in the galaxy, Senator Xiono facilitated his son's entry into a New Republic Defense Force academy which, in turn, led to Kazuda's service in the New Republic Defense Fleet's Starfighter Corps. When the First Order destroyed Hosnian Prime, Hamato, Kazuda's mother, and the rest of their family survived, as they had been off-planet during the cataclysm. Following the loss of the New Republic, Senator Xiono contacted his son, warning him of the danger his activity as a Resistance spy had placed his family in.\nSenator Hamato Xiono was a politician who served in the Galactic Senate of the New Republic years after the Galactic Civil War. He was also the father of Kazuda Xiono, who was born to Kazuda's mother and Hamato in 14 ABY. The parents raised their son on the New Republic capital planet Hosnian Prime, their Xiono family living with a wealthy status in its aristocracy. When Kazuda attempted to compete in his first race, his father was against it, telling his son that he wasn't ready. Nonetheless, Kazuda won, proving his father wrong and winning an aurodium trophy. Hamato facilitated his son's service to the New Republic by supporting his enrollment in a New Republic Defense Force academy, and ensured that Kazuda's training was put to use by helping him join the New Republic Defense Fleet. This allowed Kazuda to pursue his aspirations of becoming a highly skilled pilot.\nIn 34 ABY, Kazuda contacted Senator Xiono shortly after his rendezvous with the Resistance during the waning months of the Cold War. Believing the First Order, a successor state to the Galactic Empire, threatened the Republic's place in the galaxy, Kazuda decided to join the Resistance but also felt compelled to inform Hamato about his decision. Contacting his father via a scrambled hologram transmission on a CR90 corvette, Kazuda intended to ask him for assistance. However, Kazuda ultimately changed his mind after Hamato—who regarded the Resistance as extremists—chastised his son for getting \"mixed up\" with them, and berated him for asking for help.\nAfter Kazuda had begun his service as a Resistance spy, being deployed to the planet Castilon, he encountered the Aleena Grevel, who harassed him over an allegedly owed 1,500 credits after Kazuda had thrown a holodart into the gorgmonger Bolza Grool. The young Xiono professed that he didn't have enough credits on him, but that he could contact his parents to help pay what he owed. Later that same day, Kazuda lamented how much of his life had progressed with his father's intervention, and resolved that he would succeed in his mission—as well as his race against racer Torra Doza—without his father's help. During his mission, Hamato's son told the Resistance astromech droid BB-8 about his father's pushback in his childhood, and how his trophy stood as a charm of luck due to his victory in spite of his father.\nDuring the First Order occupation of the supertanker fuel depot Colossus, Kazuda was arrested by stormtroopers and later escaped. Following this, First Order Security Bureau agent Tierny showed mechanic Tamara Ryvora Kazuda's New Republic service record on a datapad, which identified Hamato as his father.\nLater during the same year, the First Order rose from the Unknown Regions and proclaimed the end of the New Republic, firing Starkiller Base's superlaser and destroying the Hosnian system. Upon witnessing this, Kazuda became horrified, fearing that his father was gone, along with his friends and the Senate. Fortunately for him, Xiono and the rest of his family had survived the cataclysm by being off-world. Following the Battle of Castilon, and the Resistance's evacuation from D'Qar, Senator Xiono contacted his son via a special coded message, he and Kazuda's mother having tried to contact him for days. He assured Kazuda that his mother and the rest their family had survived as they had been off-planet during the cataclysm. When his son urged him to meet the Resistance at D'Qar, Hamato refused, as the First Order had identified Kazuda as a spy. Senator Xiono then warned his son that bounty hunters would be after him before the transmission cut. Despite his father's warning, Kazuda resolved to continue his service to the Resistance.\nAfter Kazuda went on the run alongside the inhabitants of the Colossus, the group eventually found what they believed to be refuge on the planet Aeos Prime. Choosing to continue the fight against the First Order, the younger Xiono resolved to leave and join the Resistance's forces. He then bid Captain Imanuel Doza of the Colossus farewell, explaining that he understood that, while Doza and the Colossus' in habitants wished to stay out of the fight, it wasn't who he was in spite of his father's wishes. Despite this, Kazuda remained with the Colossus following the First Order's arrival on the planet.\nHamato Xiono was a human male. Coming from a position of wealth and influence, the senator was able to support his son Kazuda Xiono's aspirations to become a New Republic pilot. Although Hamato was willing to aid Kazuda in his endeavors, he felt that his son relied on him for everything—from entering the academy to joining the New Republic Navy. Adversely, Kazuda felt that his father's support was not for him, but for his father himself.\nSenator Xiono regarded the Resistance as a band of extremists and was disturbed by his son mentioning their organization. Ultimately, Kazuda kept his relationship with the Resistance a secret from his father, hoping to achieve something on his own without the senator's help for once. However, upon learning of his family's survival of the Hosnian Cataclysm, Kazuda urged his father to find the Resistance, a request Hamato refused, believing it would place their family in too much danger.\nHamato Xiono first appeared via a blurred hologram in \"The Recruit\", the first episode of Season One of the animated television series Star Wars Resistance, which first premiered on Disney Channel on October 7, 2018. The character was first identified as \"Hamato Xiono\" in \"Descent\", the nineteenth episode of Resistance's first season, which premiered on Disney Channel on March 3, 2019. He was first fully pictured in the second episode of Resistance's second season, \"A Quick Salvage Run\", which premiered on Disney Channel on October 13, 2019. He had a very specific costume design in order to better establish the character as a relatively wealthy Senator with military ties at a moment's notice. Tzi Ma provided the voice for the politician.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Hosnian_Prime",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Xiono_family",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Senate",
  "/wiki/Senator",
  "/wiki/Parent",
  "/wiki/Resistance",
  "/wiki/Kazuda_Xiono",
  "/wiki/Kazuda_Xiono%27s_mother",
  "/wiki/Standard_year",
  "/wiki/New_Republic_Era",
  "/wiki/The_galaxy",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/New_Republic_Academy",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/New_Republic_Starfighter_Corps",
  "/wiki/First_Order",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Politics",
  "/wiki/Galactic_Civil_War",
  "/wiki/14_ABY",
  "/wiki/Capital",
  "/wiki/Planet",
  "/wiki/Aurodium",
  "/wiki/Kaz%27s_lucky_trophy",
  "/wiki/Pilot",
  "/wiki/File:GrevelHarassingKaz.ogg",
  "/wiki/34_ABY",
  "/wiki/Mission_to_rendezvous_with_the_Resistance",
  "/wiki/Standard_month",
  "/wiki/Cold_War",
  "/wiki/Galactic_Empire",
  "/wiki/Hologram",
  "/wiki/Unidentified_CR90_corvette_(Resistance)",
  "/wiki/Brain",
  "/wiki/Mission_on_the_Colossus_platform",
  "/wiki/Spy",
  "/wiki/Castilon",
  "/wiki/Aleena",
  "/wiki/Grevel",
  "/wiki/Credit",
  "/wiki/Holodarts",
  "/wiki/Gorgmonger",
  "/wiki/Bolza_Grool",
  "/wiki/Standard_day",
  "/wiki/Race_between_Kazuda_Xiono_and_Torra_Doza",
  "/wiki/Racer",
  "/wiki/Torra_Doza",
  "/wiki/Astromech_droid",
  "/wiki/BB-8",
  "/wiki/Occupation_of_the_Colossus",
  "/wiki/Supertanker_fuel_depot",
  "/wiki/Colossus",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Mission_to_contact_the_Resistance",
  "/wiki/First_Order_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Tierny",
  "/wiki/Technician",
  "/wiki/Tamara_Ryvora",
  "/wiki/Datapad",
  "/wiki/File:HamatoCalls.ogg",
  "/wiki/Unknown_Regions",
  "/wiki/Starkiller_Base",
  "/wiki/Superlaser",
  "/wiki/Hosnian_system",
  "/wiki/Death",
  "/wiki/Battle_of_Castilon",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/D%27Qar",
  "/wiki/Bounty_hunter",
  "/wiki/Hunt_for_the_Colossus",
  "/wiki/Aeos_Prime",
  "/wiki/Captain",
  "/wiki/Imanuel_Doza",
  "/wiki/Escape_from_Aeos_Prime",
  "/wiki/New_Republic_pilot",
  "/wiki/Navy",
  "/wiki/The_Recruit",
  "/wiki/Star_Wars_Resistance_Season_One",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Disney_Channel",
  "/wiki/October_7",
  "/wiki/2018",
  "/wiki/Descent_(episode)",
  "/wiki/March_3",
  "/wiki/2019",
  "/wiki/Star_Wars_Resistance_Season_Two",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/October_13",
  "/wiki/Tzi_Ma",
  "/wiki/The_Triple_Dark",
  "/wiki/Station_Theta_Black_(episode)",
  "/wiki/No_Escape:_Part_1",
  "/wiki/No_Escape:_Part_2",
  "/wiki/Into_the_Unknown",
  "/wiki/No_Place_Safe",
  "/wiki/StarWars.com",
  "/wiki/March_4",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/Resistance_to_the_End",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/Databank_(website)",
  "/wiki/Athena_Yvette_Portillo",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Resistance_Revisited",
  "/wiki/Star_Wars_Insider_190",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Bloodline_(novel)",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/February_29",
  "/wiki/2020",
  "/wiki/October_12"
 ]
}