{
 "name": "Hamar-Chaktak",
 "display_name": "Hamar-Chaktak",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Herglic"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  }
 ],
 "content": "Hamar-Chaktak was a Herglic merchant based in the Freeworlds Territory of the Tapani sector who owned the Cargo Consolidated, Incorporated shipping company.\nLike many Herglics, Hamar had a bulky frame and a loud booming voice that he used to gain attention and respect. He had pale smooth skin and would always wear lavish robes and expensive jewelry.\nHamar was a successful and wealthy merchant who dealt in a number of legal cargoes such as foodstuffs, ore and occasionally bacta. He was also known to have participated in illegal activities such as smuggling and slaving.\nA selfish individual, Hamar cared for little else but wealth and the preservation of his reputation. He was, however, able to make a good show that he cared for others but in reality he had no problem ruining others lives to get what he wanted.\nLike most of his species he was drawn to the temptations of gambling, but was better than most at resisting the lure, having apparently learned the hard way that the odds of making a profit through gambling was slim. He did, however, have a weakness for gambling on Cracian thumper races and could often be found at the track on Tallaan placing a bet.\nDuring the Rebellion era prior to the Battle of Hoth Hamar-Chaktak was involved in a scheme to steal bacta. He told a group of Rebel agents, interested in obtain a shipment of bacta, that he would assist them in obtaining a bacta transport. He pretended to be a Rebel sympathizer but in reality he did not favor either the rebellion or the Empire. In truth the bacta transport that they targeted called Theta-2Y was owned by Hamar himself. He planned to hide a group of his mercenaries on the bacta transport and subdue the rebels once they had captured the vessel. He then planned on faking the ships destruction and claiming from the huge insurance policy he had on the bacta and the ship . Furthermore he planned to sell the bacta transport to a pirate for 75,000 credits and the bacta to the rebel alliance for another 25,000.\nHamar-Chaktak also owned a corvette called the Crusader and a Eliall-class container ship. As well as the professional mercenaries Hamer also employed a Vaathkree henchman called Valka.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Herglic/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Pink",
  "/wiki/Freeworlds_Territory",
  "/wiki/Tapani_sector/Legends",
  "/wiki/Cargo_Consolidated,_Incorporated",
  "/wiki/Bacta/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Species/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Cracian_thumper",
  "/wiki/Tallaan",
  "/wiki/Rebellion_era",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/B-12_Bacta_Transport",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Theta-2Y",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Crusader_(corvette)",
  "/wiki/Eliall-class_cargo_barge",
  "/wiki/Vaathkree_(species)",
  "/wiki/Valka",
  "/wiki/West_End_Games",
  "/wiki/The_Bacta_Heist",
  "/wiki/Tapani_Sector_Instant_Adventures",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}