{
 "name": "Hanna Ding",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "34 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arkanian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Hanna Ding was a female Arkanian Jedi Padawan serving the Jedi Order and the Galactic Republic as a Commander on the Grand Army of the Republic. Stationed at the Coruscant Jedi Temple during the latter stages of the Clone Wars, Ding participated in the Apprentice Tournament of 19 BBY.\nA Force-sensitive female Arkanian, Hanna Ding was a member of the Jedi Order, living at the Coruscant Jedi Temple and training in the ways of the Force. At the academy there, Ding was graceful and particularly fond of lightsaber combat as opposed to grappling, but her methods be predictable. After she graduated from the academy, Ding became eligible to become a Padawan to a Jedi Master.\nWhen the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, Ding was stationed at the Temple, and by this time had constructed a green-bladed lightsaber. Throughout the war, Ding secretly feared that one day she would die outside the Temple's walls on the battlefield. In 19 BBY, Ding participated in the Jedi Temple Apprentice Tournament, administrated by Jedi Master Ilena Xan. Ding was openly critical of fellow Padawan Tallisibeth Enwandung-Esterhazy, claiming that she was using unorthodox trickery and was manipulating the rules. In the second round of the Tournament, Ding was pitted against Enwandung-Esterhazy, fighting the dark. Ding refused to give into her frustration when her opponent repeatedly attempted to deceive her, and ended up being kicked in the chest. Still, Ding managed to gain the upper hand, and believed she had her opponent beaten. At that moment, Enwandung-Esterhazy grabbed her lightsaber blade, which was set at a low setting, and managed to get Ding in a strangle hold, forcing the Arkanian to surrender. Ding was then eliminated from the competition.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/34_BBY/Legends",
  "/wiki/Arkanian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Temple_Apprentice_Tournament",
  "/wiki/19_BBY/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Ilena_Xan",
  "/wiki/Tallisibeth_Enwandung-Esterhazy",
  "/wiki/Yoda:_Dark_Rendezvous",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}