{
 "name": "Hantic",
 "display_name": "Hantic",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Before 3000 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Otoh Langua",
      "Gungan Grand Army"
     ]
    }
   ]
  }
 ],
 "content": "Hantic was a male Ankura Gungan who was the boss of the city of Otoh Langua on the planet Naboo in the year 3000 BBY. During a period of war between the Gungans around that time, Otoh Langua's treasury was severely depleted, forcing the city's inhabitants to continue fighting. Eventually, Hantic was visited by Boss Gallo, who was attempting to unite the Gungans against Rogoe, the boss manipulating the war. Hantic told Gallo that Otoh Langua would join his cause if he found a way to restore the city's wealth, which Gallo did by destroying one of Rogoe's spaceports. Hantic thanked Gallo for aiding his city and contributed forces to Gallo's Grand Army.\nHantic was a male Ankura Gungan who lived on the planet Naboo and served as the boss of the city of Otoh Langua in the year 3000 BBY. During Hantic's reign in Otoh Langua, Naboo's various Gungan cities were at war with each other, and as a result Otoh Langua lost a vast amount of its resources, forcing Hantic to continue fighting until he could find a solution. In the war Otoh Langua also formed a rivalry with the city of Otoh Jahai, whose Boss accused Hantic of stealing his city's Sacred Staff, an important religious artifact. However, Hantic denied the claim and had not actually stolen the staff.\nEventually, Gallo, the former boss of the ruined city of Otoh Sancture, came to Otoh Langua as part of his crusade to unite the Gungan tribes against Boss Rogoe, who was controlling the war and had destroyed Gallo's city. Gallo asked Hantic if he had stolen the staff from Otoh Jahai, where he had previously visited and had agreed to find it, but Hantic stated that he did not have the staff. Hantic then told Gallo that if he somehow restored Otoh Langua's wealth, he would join Gallo's cause. On advice from his ally Marsune, Gallo and his militiagungs attacked a spaceport that belonged to Rogoe and stole its supplies to give to Hantic. In turn, Hantic thanked Gallo for helping him and donated four Kaadu Cavalry members, domesticated bipedal kaadu mounted with cannons on their backs, to Gallo's Grand Army.\nDuring the war against the other Gungan tribes, Hantic, a green-skinned member of his species, was forced to keep his men fighting in order to sustain his city but was very willing to seek a peaceful solution when Gallo asked him to cease combat. Hantic was also quite offended when Gallo asked if he had stolen Otoh Jahai's Sacred Staff and remarked that the other city was crazy for saying so.\nThe boss of Otoh Langua was first described as a voice heard by the player in Star Wars: Galactic Battlegrounds: Prima's Official Strategy Guide by Steven L. Kent,—released on November 7, 2001—before appearing in the LucasArts video game Star Wars: Galactic Battlegrounds, released on November 11, 2001. Hantic appeared in the second level of the Gungan campaign, \"The Gungan who would be Boss.\" Hantic's profile image is used for several other Gungan boss characters in the game, and his voice actor was uncredited.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Naboo/Legends",
  "/wiki/3000_BBY",
  "/wiki/Gungan/Legends",
  "/wiki/Ankura/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Otoh_Langua/Legends",
  "/wiki/Gungan_Grand_Army/Legends",
  "/wiki/Boss/Legends",
  "/wiki/City/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/War_of_the_Gungan_tribes",
  "/wiki/Time/Legends",
  "/wiki/Gallo/Legends",
  "/wiki/Rogoe/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Otoh_Jahai",
  "/wiki/Tenko",
  "/wiki/Sacred_Staff",
  "/wiki/Staff/Legends",
  "/wiki/Otoh_Sancture",
  "/wiki/Destruction_of_Otoh_Sancture",
  "/wiki/Marsune_(Gungan)",
  "/wiki/Militiagung/Legends",
  "/wiki/Rogoe%27s_spaceport",
  "/wiki/Kaadu_Cavalry",
  "/wiki/Kaadu/Legends",
  "/wiki/Cannon/Legends",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Steven_L._Kent",
  "/wiki/November_7",
  "/wiki/2001",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/November_11",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/The_Essential_Atlas"
 ]
}