{
 "name": "Hantor_Loftus",
 "display_name": "Hantor Loftus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic",
      "New Republic Intelligence Service",
      "New Republic Intelligence Service"
     ]
    }
   ]
  }
 ],
 "content": "Captain Hantor Loftus was a Human male from the planet Tatooine who lived in Mos Entha during the Galactic Civil War. He operated as a member of the Alliance to Restore the Republic, with significant interactions with smugglers sympathetic to the Alliance. In the period following the Battle of Yavin, Loftus was responsible for derailing Project Lasercutter, an Inquisitorius-led initiative aimed at capturing Rebel-aligned smugglers.\nCaptain Loftus later joined the New Republic Intelligence Service, still based on Tatooine. In 12 ABY, Loftus led a recovery and incarceration team to recover survivors from a raid by New Republic agent Kyle Katarn on an Imperial Remnant recruiting base on the planet. Loftus reported directly to N.R.I. official Mon Mothma on the outcome of the mission, requesting that Katarn stay out of future N.R.I. intelligence-gathering missions due to his aggressive techniques.\nHantor Loftus was a Human male and a resident of the desert planet Tatooine, located in the Arkanis sector of the Outer Rim Territories. At some point after the Battle of Yavin, during the Galactic Civil War, Loftus was an agent for the Alliance to Restore the Republic, holding the rank of captain. He became aware of an Imperial initiative named Project Lasercutter, which aimed to capture smugglers sympathetic to the Rebel Alliance in order to undermine Rebel supply lines. Setting up a temporary base of operations in a hotel complex in the settlement of Mos Entha, Loftus ordered a number of missions designed to foil this project. Initially, he recruited a spacer to intercept and kill an Imperial agent targeting a smuggler on Tatooine. Shortly afterward, Loftus received word that the Imperials were targeting Jaxa Lian, one of his most reliable smugglers. Enlisting the spacer a second time, Loftus paid for Lian to be escorted back to his base of operations.\nWith the safe return of Lian, Loftus focused on uncovering the source of the Empire's accurate information. Eventually, Loftus discovered a spy placed in the Alliance recruiting program, a native of Naboo known as Lidek Baws. Baws was to meet his Imperial overseers out in the desert, prompting Loftus to send the spacer after him. The spacer directly confronted Baws and killed him and the other Imperials. Until then, Loftus had believed the Imperial Security Bureau was responsible for Project Lasercutter; however, he then discovered that it was actually directed by members of the Inquisitorius, a top-secret division of Imperial Intelligence. Loftus knew that if they could kill the Project's lead Inquisitor, the loss would set Project Lasercutter back by months, if not permanently derailing it. Therefore, he sent the spacer on another mission to kill the lead Inquisitor, after warning the spacer that the Inquisitors were deadly opponents and rumored to be able to use the Force. With these warnings in mind, the spacer was able to kill the Inquisitor.\nAfter the Rebel Alliance transitioned into the New Republic, Loftus became a member of the New Republic Intelligence Service, the successor to earlier Rebel spy networks and the Senate Planetary Intelligence Network. By 12 ABY, Loftus held the rank of captain in this service. That year, New Republic agent Kyle Katarn raided an Imperial Remnant headquarters on Tatooine, which had been recruiting from amongst the populace. Katarn routed the Imperials and also killed the ringleader, who claimed to be \"Reborn.\"\nLoftus liaised with the recovery and incarceration team sent to Tatooine as a follow up to Katarn's mission; however, they discovered only one Imperial survivor, who was left terrified from the encounter with Katarn. Loftus sent the prisoner on to Coruscant for furthering interrogation, along with a preliminary report on the mission that was directed to Mon Mothma, a former New Republic Chief of State now working for N.R.I. In the report, Loftus requested that Katarn be sent on no more \"intelligence-gathering missions,\" criticizing what he saw as an overzealous approach.\nCaptain Hantor Loftus was a member of the Alliance to Restore the Republic, a revolutionary organization aimed at overthrowing the Galactic Empire. In this capacity, Loftus organized a number of missions aimed at killing Imperial personnel. He continued in service under the New Republic with the same rank. On at least one occasion, he reported directly to Mon Mothma, a highly-placed official within New Republic Intelligence. In this situation, Loftus was prepared to \"humbly request\" that agent Kyle Katarn cease working on intelligence-gathering missions, knowing that the recommendation might overstep professional bounds. Loftus had light skin, brown hair, and brown eyes.\nBy the time he was operating in Mos Entha, Hantor Loftus had acquired pirate weapons for his personal use.\nLoftus was first named in the N.R.I. Reports, a series of weekly in-universe updates published on the LucasArts website in the build-up to the release of the 2002 video game Star Wars: Jedi Knight II: Jedi Outcast. These reports were later included in the README file of the computer game. Loftus later made an appearance as a non-player character in the MMORPG Star Wars Galaxies, produced by Sony Online Entertainment. Known as Captain Loftus in the game and in associated Prima Games strategy guides, he was also given the first name Hantor in the game itself.\nIn Star Wars Galaxies, Loftus gave out four quests to player-characters, staging from Mos Entha. He was removed from the game following the New Game Enhancements made in 2005. In Star Wars Galaxies: An Empire Divided Quick Reference Guide, Loftus' statistics listed him as a level 10 NPC, with 356 experience points.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Captain/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mos_Entha/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Project_Lasercutter",
  "/wiki/Inquisitorius/Legends",
  "/wiki/12_ABY/Legends",
  "/wiki/Mission_to_Tatooine_(Kyle_Katarn)",
  "/wiki/Kyle_Katarn",
  "/wiki/Imperial_Remnant",
  "/wiki/Empire_Reborn_base",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Mos_Entha_hotel",
  "/wiki/Desert/Legends",
  "/wiki/Arkanis_sector/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jaxa_Lian",
  "/wiki/Time/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Lidek_Baws",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Senate_Planetary_Intelligence_Network",
  "/wiki/Standard_year/Legends",
  "/wiki/Reborn",
  "/wiki/Prisoner/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/N.R.I._Reports",
  "/wiki/In-universe",
  "/wiki/LucasArts",
  "/wiki/2002",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Jedi_Knight_II:_Jedi_Outcast",
  "/wiki/Sony",
  "/wiki/Prima_Games",
  "/wiki/Star_Wars_Galaxies#New_Game_Enhancements",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided_Quick_Reference_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/Hantor_Loftus/SWG",
  "/wiki/Star_Wars:_Complete_Locations_(2005)"
 ]
}