{
 "name": "Haplif",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 18 BBY",
      "Celwis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Agbui"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark red and off-white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grysk Hegemony"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jixtus"
     ]
    }
   ]
  }
 ],
 "content": "Haplif was a telepathic male Agbui who served the Grysk Hegemony operative Jixtus. Haplif possessed a talent for reading and analyzing cultures, which he proudly utilized in service to his employer. Under orders from Jixtus, Haplif instigated a tragic civil war on a planet that came to be known as \"Sunrise.\" Thereafter, Haplif attempted to orchestrate the demise of the Chiss Ascendancy by sparking a civil war between three of its Forty Great Families.\nDuring his plot against the Chiss, Haplif stayed with rancher Xodlak'phr'ooa \"Lakphro\" on the Ascendancy planet Celwis for several months. The Agbui attempted to kill his host before departing, but the rancher defeated Haplif and killed his erstwhile guest in self-defense.\nAt the behest of Jixtus, Haplif orchestrated a civil war on the planet Sunrise in under six months. During the civil war, which took place around 19 BBY, Haplif pushed both sides to use destructive flat-blast artillery shells, which would later cause Frosif to be triggered into a trauma response to similar sounds. Haplif's war left most of the native population dead and ravaged the sky and surface of the planet. The Agbui and the Grysk Hegemony subsequently took over Sunrise and mined the world for nyix.\nA group of two hundred refugees, led by the Magys, escaped their planet, heading towards the Paccosh homeworld of Rapacc. Unlike many of the worlds of the Chaos populated by sentient species, Sunrise never had a long-range communications triad. Jixtus had told Haplif to leave no witnesses. However, Haplif had neither military forces at his disposal nor a comms triad on Sunrise, so he could neither kill the refugees nor contact Jixtus to have them killed. Instead, he contacted the forces of the Nikardun Destiny, giving them the refugees' vector and telling them that the refugees were raising an army against the Nikardun. Thereafter, the Nikardun military came to occupy and subjugate the Rapacc system, where the refugees settled a city.\nAfter successfully orchestrating the destruction of Sunrise, Haplif's master Jixtus sent the Agbui to infiltrate, learn about, and ultimately try to destroy the Chiss Ascendancy from within. To prepare, Haplif and a number of other Agbui including Shimkif and Frosif posed as cultural nomads traveling the Chaos in order to learn about the Ascendancy.\nIn doing so, Haplif came to travel with the Chiss midager Coduyo'po'nekri , whom he manipulated into organizing a meeting with Councilor Xodlak'uvi'vil  on the Chiss Ascendancy planet Celwis. While residing on Celwis on farmland owned by Rancher Xodlak'phr'ooa , Haplif influenced Lakuviv into believing that the Agbui possessed a valuable nyix mining settlement. By flooding the market of Celwis with underpriced nyix brooches and acting naive about the metal's value, Haplif and his companions manipulated Councilor Lakuviv into attempting to secure the mine for the Xodlak family. At the same time, two other Chiss families were manipulated into claiming the supposed mine.\nThough the resulting conflict threatened to grow into the civil war that Haplif had intended, Senior Captains Mitth'raw'nuruodo and Irizi'in'daro of the Chiss Expansionary Defense Fleet managed to put a stop to it by destroying the false mine. Haplif never learned that his plan had failed, however. Just as Haplif his Agbui companions prepared to leave Celwis, Lakphro confronted him; having realized that his guest was up to something. Haplif attempted to kill the rancher, but Lakphro managed to defend himself, killing his former guest who was left for dead by his fellow Agbui.\nHaplif was supremely confident, even arrogant, about his abilities. He hated leaving any job uncompleted, even if all that remained was \"mop-up.\" While Haplif enjoyed causing mass-scale destruction, he disliked killing others with his hands as his telepathic sense of touch would cause him strong unpleasant feelings while killing someone.\nHaplif often presented a façade of good humor and cheer, although he secretly thought many of the individuals he interacted were stupid, boring or spoiled. While Haplif had a strong desire to finish his task so he could return to an unspecified home, he found satisfaction while dying in his belief that the plot against the Chiss would come to fruition.\nHaplif and other Agbui had a limited form of telepathy, based on physically touching other sentient beings. Haplif claimed to be particularly gifted with that ability, which he insisted allowed him to understand, manipulate, and even destroy entire species. Haplif took pride in using his knowledge of others' desires and motivations to manipulate them. He likened such knowledge to having a \"handle\" belonging to an ax which he could weaponize for his own goals.\nBecause of Haplif's exceptional interpersonal skills including manipulation, Jixtus put Haplif in charge of interacting with Chiss and learning about Chiss culture, out of the fifty Agbui \"cultural nomads\" in Haplif's traveling group. While Shimkif also possessed touch-based telepathy, she was more skilled than Haplif in administration but less skilled at manipulating people. Therefore, she was put in charge of keeping the Agbui starship and crew in working order while Haplif was tasked with manipulating Chiss.\nHaplif of the Agbui first appeared in the 2021 novel Thrawn Ascendancy: Greater Good by Timothy Zahn, in which he played the role of the primary antagonist and a major point-of-view character. Haplif's role in Greater Good was similar to the role played by Pathfinder navigator Qilori of Uandualon in that novel's 2020 prequel, Thrawn Ascendancy: Chaos Rising, although Haplif was much more involved in Jixtus' machinations than Qilori was in those of Yiv.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Haplif",
  "/wiki/18_BBY",
  "/wiki/Celwis",
  "/wiki/Agbui",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Grysk_Hegemony",
  "/wiki/Jixtus",
  "/wiki/Qilori",
  "/wiki/Telepathy",
  "/wiki/Sunrise%27s_civil_war",
  "/wiki/Planet",
  "/wiki/Sunrise",
  "/wiki/Jixtus%27s_plan",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Great_Families",
  "/wiki/Chiss",
  "/wiki/Farmer",
  "/wiki/Xodlak%27phr%27ooa",
  "/wiki/Standard_month",
  "/wiki/Death",
  "/wiki/19_BBY",
  "/wiki/Flat-blast_artillery_shell",
  "/wiki/Frosif",
  "/wiki/The_Magys%27s_people",
  "/wiki/Mining",
  "/wiki/Nyix",
  "/wiki/Refugee",
  "/wiki/The_Magys",
  "/wiki/Paccosh",
  "/wiki/Rapacc",
  "/wiki/Unknown_Regions",
  "/wiki/Communications_triad",
  "/wiki/Nikardun_Destiny",
  "/wiki/Yiv%27s_battle_forces",
  "/wiki/Rapacc_system",
  "/wiki/Unidentified_city_(Rapacc)",
  "/wiki/Shimkif",
  "/wiki/Coduyo%27po%27nekri",
  "/wiki/Core_name",
  "/wiki/Councilor_(Chiss_Ascendancy)",
  "/wiki/Xodlak%27uvi%27vil",
  "/wiki/Farm",
  "/wiki/Unidentified_settlement_(Agbui)",
  "/wiki/Nyix_brooch",
  "/wiki/Xodlak_family",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Irizi%27in%27daro",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Sentience",
  "/wiki/Ax",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Timothy_Zahn",
  "/wiki/Navigator",
  "/wiki/2020",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Nikardun_conquests",
  "/wiki/Yiv",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Clone_Wars",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Ahsoka_Tano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Attack_on_the_Paataatus"
 ]
}