{
 "name": "Harc Seff",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ishi Tib"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Harc Seff was a Ishi Tib who was present in the Hutt crime lord Jabba Desilijic Tiure's palace on the planet Tatooine in 4 ABY. Seff witnessed a performance by the Max Rebo Band and applauded when they finished their song. The Ishi Tib was then present when Princess Leia Organa arrived disguised as the bounty hunter Boushh looking to claim the bounty on the Wookiee Chewbacca.\nThe Ishi Tib Harc Seff spent time in the palace of the Hutt crime lord Jabba Desilijic Tiure on the planet Tatooine in the year 4 ABY. While in the palace, Seff viewed a performance of the song \"Jedi Rocks\" by the Max Rebo Band in the Hutt's courtroom and applauded when the band finished. Jabba then called for a repeat of the song, but during the second performance the Hutt dropped the slave Oola into the pit containing his pet rancor Pateesa underneath the throne room.\nAfter the performance Princess Leia Organa arrived in the throne room disguised as the bounty hunter Boushh in order to claim the bounty on the Wookiee Chewbacca. While Jabba and Organa haggled over the price of the bounty, Seff stood in front of the bounty hunter Boba Fett and the dancers Rystáll Sant and Lyn Me. Organa then shocked those present in the courtroom by activating a thermal detonator in order to threaten Jabba into paying more. The ploy amused Jabba and he agreed to pay more, satisfying Organa and causing her to de-activate the detonator. Organa and her allies later killed Jabba above the Pit of Carkoon.\nHarc Seff had green skin and yellow eyes.\nHarc Seff wore a blue tunic over a white shirt while at Jabba's palace.\nHarc Seff first appeared in the 1997 special edition re-release of the film Star Wars: Episode VI Return of the Jedi, in which the character was portrayed by an uncredited extra. Seff went unnamed until the character appeared on a card in the Special Edition Limited set of Decipher's Star Wars Customizable Card Game released in 1998. According to a Star Wars CCG fan site, Seff was named as an anagram of Decipher employee Mark Schaffer.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Harc_Seff",
  "/wiki/Harc_Seff/Legends",
  "/wiki/Ishi_Tib",
  "/wiki/Color",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/4_ABY",
  "/wiki/Max_Rebo_Band",
  "/wiki/Jedi_Rocks",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Bounty_hunter",
  "/wiki/Boushh",
  "/wiki/Bounty",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Standard_year",
  "/wiki/Slavery",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Boba_Fett",
  "/wiki/Ryst%C3%A1ll_Sant",
  "/wiki/Lyn_Me",
  "/wiki/Thermal_detonator",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Death",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/1997",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Special_Edition_Limited",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/1998",
  "/wiki/Tuckerization",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2015_Topps_Star_Wars_Force_Attax_The_Force_Awakens",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/August_15",
  "/wiki/2005",
  "/wiki/November_3",
  "/wiki/2022"
 ]
}