{
 "name": "Hardhear",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "14 BBY",
      "Chandar's Folly"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chadra-Fan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Wilhuff Tarkin's hunting team"
     ]
    }
   ]
  }
 ],
 "content": "Hardhear was a Chadra-Fan male who worked as a tracker with his grandson Sissian during the reign of the Galactic Empire. The pair were hired by Governor Wilhuff Tarkin to help him track down the Sith Lord Darth Vader on the planet Chandar's Folly. The two Chadra-Fan were part of a group of twenty that participated in the hunt, but by the of night of the eighth day, only eight remained. Vader then ambushed the survivors while they traveled through an area full of crystal formations that created echo and prevented Hardhear from pinpointing the Sith's location with his hearing. As the group tried to flee, Vader used the Force to choke and kill Hardhear.\nHardhear was a Chadra-Fan male who used his species exceptional hearing to work as a tracker during the reign of the Galactic Empire. At some point between the Invasion of Mon Cala in 18 BBY and the Battle of Yavin in 0 BBY, Hardhear and his grandson Sissian were hired by Governor Wilhuff Tarkin to help him hunt the Sith Lord Darth Vader, who had requested the challenge from Tarkin himself. The pair of Chadra-Fan and seventeen other hunters accompanied Tarkin to the planet Chandar's Folly, where the hunt was to take place.\nHardhear and Sissian were able to detect Vader from a great distance by hearing the sound of his constant mechanical breathing through a cybernetic breathing apparatus, and on the second day of the hunt the group tracked him down to a copse of thurian trees where they lost four men unsuccessfully trying to kill him with fire. On the sixth day they lost another six men while disarming Vader of his lightsaber and escaping with it.\nOn the night of the eighth day, Sissian spotted Vader near the group's camp wearing a cape made from the skin of a Valath. Tarkin and his seven remaining men then left the camp, and the Governor warned Hardhear and Sissian to listen carefully for Vader since his cape would make him difficult to see. The hunters then headed into a area full of crystal formations on the border of the Stormlands.\nAmongst the crystals, Hardhear hear the sound of Vader, but was unable to detect which direction he was coming from due to echoing caused by the crystals. Tarkin ordered his men to retreat, but as they fled Vader lifted Hardhear off the ground using the Force and choked him to death. Two more of the hunters died before the group escaped and Sissian and the others bar Tarkin were killed soon after after making camp in the Stormlands.\nHardhear spoke in broken Galactic Basic Standard and often paused mid-sentence. When fleeing from Vader he did not panic and remained disciplined. He had brown hair, gray skin, black eyes and was missing the top half of his left ear.\nHardhear wore an orange jumpsuit and a green backpack.\nHardhear first appeared in the 2018 comic book Darth Vader  18, which was written by Charles Soule and illustrated by Giuseppe Camuncoli.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/14_BBY",
  "/wiki/Chandar%27s_Folly",
  "/wiki/Chadra-Fan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Wilhuff_Tarkin%27s_hunting_team",
  "/wiki/Sissian",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Planet",
  "/wiki/Hunt_on_Chandar%27s_Folly",
  "/wiki/Crystal",
  "/wiki/Sith",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Death",
  "/wiki/Species",
  "/wiki/Invasion_of_Mon_Cala",
  "/wiki/18_BBY",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/Cybernetics",
  "/wiki/Standard_day",
  "/wiki/Thurian_tree",
  "/wiki/Darth_Vader%27s_lightsaber",
  "/wiki/Cape",
  "/wiki/Valath",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Ear",
  "/wiki/Clothing",
  "/wiki/Backpack",
  "/wiki/2018",
  "/wiki/Darth_Vader_(2017)_18",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Tarkin_(novel)",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/Second_Sister",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Great_Jedi_Purge",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Darth_Vader_(2017)_13"
 ]
}