{
 "name": "Hargrev",
 "display_name": "Hargrev",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Dread Executioners",
      "Dread Executioners"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Silthar"
     ]
    }
   ]
  }
 ],
 "content": "Hargrev was a male Human Sith Lord of the reconstituted Sith Empire during the Galactic War.\nThe former apprentice of Darth Silthar,Hargrev was considered by some higher Lords to be something of a sadistic lunatic, obsessed with pain, fear and power. He was not taken seriously as a result, and considered unlikely to achieve the rank of Darth.\nDespite this, Hargrev was dispatched by Darth Rictus of the Dark Council to lead an expedition to the volcanic moon of Oricon, where the feared Dread Masters had made their lair following the death of Dread Master Styrak on Darvannis. After contact was lost with the expedition, Darth Marr dispatched the heroes of the Empire, involved in the release of the Dread Masters from their imprisonment on Belsavis, to make contact with him.\nShortly after seeing action on Oricon, Hargrev began to see through some of his wrongdoings. Witnessing the Dread Masters' actions, he admitted that he was not as terrible as he thought, and that the Masters had gone too far for any person, even Sith, to follow. He acknowledged that they needed to die. Hargrev underwent some change on the planet, caring more about saving the people under his command and trying his best to prevent them from becoming insane.\nAfter the defeat of the Dread Masters, Hargrev offered the Empire's heroes if they wanted to salvage the Masters' technology or destroy it.\nHargrev is a character in the 2011 Star Wars: The Old Republic video game. He appears during the Oricon missions for Imperial players.\nWhen the Imperial player complete the Oricon missions and Operations, when asked what to do with the remaining Dread Masters' technology, the player can either choose to destroy it  or have Imperial forces occupy the Masters' fortress .",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Hargrev",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dread_Executioners",
  "/wiki/Darth_Silthar",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Galactic_War",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Rictus",
  "/wiki/Dark_Council",
  "/wiki/Oricon",
  "/wiki/Dread_Masters",
  "/wiki/Styrak",
  "/wiki/Darvannis",
  "/wiki/Darth_Marr",
  "/wiki/Belsavis/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel"
 ]
}