{
 "name": "Hari Seldona",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Hari Seldona was an Alderaanian poet who wrote many famous odes about the planet Alderaan, and was so famous that she traveled among the galaxy reading them to any who would listen.\nAs a young poetess, Hari Seldona studied ancient literature at the Byron College of Aldera. She lived in the university campus, which overlooked the lake to the south of the city. She was the girlfriend of Soltan Wostikian, the founder of the rebellious band Red Line. This band became the voice of the oppressed, drawing attention to the poor and the marginalized. This was not well received in the upper reaches of power, and Wostikian was murdered a few month before the Battle of Yavin.\nAfter the death of her boyfriend, Seldona and other surviving members of Red Line became involved with the Alderaanian Resistance movement.\nAfter the Galactic Civil War erupted, Hari Seldona would venture off Alderaan and read her poems to the passerby. She was doing so in the Corellian sector when the first Death Star destroyed Alderaan. She immediately dropped out of sight to avoid Imperial reprisal, though would occasionally appear unannounced, read her poetry and speak out against the New Order, disappearing before stormtroopers could arrive.\nThe illustration of Hari Seldona seen in The Illustrated Star Wars Universe is actually concept art of Leia Organa on Endor for Return of the Jedi. The artwork is by Nilo Rodis-Jamero.\nThe character's name is similar to Hari Seldon, a character in Isaac Asimov's Foundation novels.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Poet/Legends",
  "/wiki/Planet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Byron_College",
  "/wiki/Aldera/Legends",
  "/wiki/Aldera_lake",
  "/wiki/Band/Legends",
  "/wiki/Red_Line",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Corellian_sector/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/The_Illustrated_Star_Wars_Universe",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Endor/Legends",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Nilo_Rodis-Jamero",
  "/wiki/The_Art_of_Star_Wars_Episode_VI:_Return_of_the_Jedi",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_24",
  "/wiki/Casus_Belli",
  "/wiki/Pr%C3%A9lude_%C3%A0_un_Nouvel_Espoir",
  "/wiki/Casus_Belli_103"
 ]
}