{
 "name": "Harkos",
 "display_name": "Harkos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Harkos was a Nikto bounty hunter that operated in Black Spire Outpost on the planet Batuu on the edge of Wild Space in the Outer Rim. He had a reputation for being a bounty hunter whose list many people did not want to end up on. It was generally considered dangerous to visit Oga's Cantina in the outpost if one had a bounty on their head due to the fact that Harkos frequented the venue.\nThe vicious Harkos was so highly skilled, he had no need to take on small jobs. He was able to focus on high-profile targets from the most influential clients.\nHarkos was announced as a character that would make appearances in the theme park land Star Wars: Galaxy's Edge at the Walt Disney Parks and Resorts panel at the D23 Expo on July 16, 2017. The themed lands opened in 2019, first at Disneyland in Anaheim, California and then at Walt Disney World in Orlando, Florida. Harkos' picture was first revealed during December 16, 2017, \"Galactic Nights\" event, where a promotional trading card showed him waving his fist menacingly at a patron, with the text \"Trouble's Brewing at the Cantina\" written in either Aurebesh or High Galactic.\nSince the opening of the land, Harkos has yet to be seen in person but appeared in the book Star Wars: Galaxy's Edge: Traveler's Guide to Batuu. He can also be seen briefly in an animated Star Wars Galaxy of Adventures Fun Facts video.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nikto",
  "/wiki/Kajain%27sa%27Nikto",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Wild_Space",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Oga%27s_Cantina",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/July_16",
  "/wiki/2017",
  "/wiki/2019",
  "/wiki/December_16",
  "/wiki/Aurebesh",
  "/wiki/High_Galactic",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Star_Wars_Galaxy_of_Adventures_Fun_Facts",
  "/wiki/Star_Wars:_Galaxy%27s_Edge_trading_cards",
  "/wiki/StarWarsKids.com",
  "/wiki/October_27",
  "/wiki/2020"
 ]
}