{
 "name": "Harkov",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Garrett"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Admiral Harkov's fleet",
      "Admiral Harkov's fleet",
      "Alliance to Restore the Republic",
      "Admiral Harkov's fleet",
      "Admiral Harkov's fleet"
     ]
    }
   ]
  }
 ],
 "content": "Harkov was an admiral who served in the Imperial Navy during the Galactic Civil War. Shortly after the Battle of Hoth, he was charged with bringing an end to the Sepan Civil War, and succeeded in bringing order to the system. However, during the campaign, he also supplied Imperial arms to both sides. Around the same time, Harkov began negotiating his defection to the Alliance to Restore the Republic, promising to take the fleet under his command with him for a high enough price. Though Harkov took measures to cover his tracks, going so far as to kill Admiral Mordon when the Imperial began to get suspicious, details of his dealings eventually came to light, and Imperial investigators began to close in on the admiral, forcing him to complete his defection ahead of schedule. However, Harkov was frustrated in his attempt to defect by the Secret Order of the Emperor and Imperial forces under the command of Darth Vader. Despite the assistance of his Rebel allies, the Imperials eventually captured him, and he was interrogated and executed by the Dark Lord of the Sith.\nHarkov appeared to be like any other admiral in the Galactic Empire, commanding the Victory-class Star Destroyer Protector with a small fleet under his command, including the EF76 Nebulon-B escort frigate Akaga. However, all was not as it seemed. By 3 ABY, the admiral had begun to take chances, selling Imperial weapons and equipment to any groups willing to pay. He also began to contemplate defecting to the Alliance to Restore the Republic provided he could get a suitably high price for his services.\nHarkov was almost exposed when a leak allowed Admiral Mordon to learn of his potential treachery. Harkov was aware that, if news of his deceit and possible defection were to get out, the Empire's retribution would be swift and deadly, so he moved quickly against Mordon and had the admiral murdered. An investigation into Mordon's death was launched, but the investigators were unable to identify the culprit, and Mordon's death was officially declared to be due to natural causes.\nShortly after the Battle of Hoth, Harkov had a secret rendezvous with leaders of the Alliance, including Mon Mothma, and announced his intention to defect, promising that his fleet would defect with him. Though the Rebels distrusted him, their need for experienced officers made them willing to take the risk, and they agreed to enter negotiations over his price.\nOne of his last assignments as an Imperial admiral was to pacify the Sepan system, which was in the grips of a civil war between the inhabitants of Ripoblus and Dimok, and to prevent the conflict from spreading to neighboring systems. The Empire was unaware at the time that Harkov had been supplying both sides in the war with weapons and equipment, but conflicting reports led the Secret Order of the Emperor to begin to question his handling of the situation.\nAn hour after Harkov briefed his crew on the forthcoming campaign, the Protector jumped to hyperspace and arrived in the Sepan system in time to stop a Dimok attack on a Ripoblus convoy. During the mission, Maarek Stele, a newly transferred TIE pilot acting on orders from the Secret Order, discovered Imperial armaments aboard one of the ships in the Ripoblus convoy, and ships were quickly launched to retrieve the weapons. Soon after, the Protector moved to stop a Ripoblus reprisal raid on the Dimok scientific research installation Youst. Again, the Secret Order instructed Stele to inspect the facility, leading to the discovery and subsequent recovery of further weapons. Both discoveries threatened to lead the Secret Order back to Harkov, and the admiral warned Stele not to exceed his orders in the future.\nHarkov next led the Protector into action to rescue Ripoblus scientists who were fleeing the war aboard the IPV-1 System Patrol Craft Glas and seeking asylum. The Imperial forces had to fend off attacks from both Ripoblus and Dimok forces to secure the safety of the refugees. Following this, Imperial Intelligence learned of a rendezvous between the Ripoblus and Dimok leaders near Sepan 8 as the two factions looked to unite against the Empire, and the Imperials mounted an attack to capture them. The operation was a success, but as it turned out, the ships at the meeting were actually carrying the children of the Ripoblus and Dimok leaders, intended to be used as hostages to ensure that each side complied with their new treaty.\nDuring the mission to capture the Sepan leaders, Stele located additional Imperial equipment aboard the cargo ferry Godendag and the Assassin-class corvette Runka, further evidence that somebody was selling arms to both sides. After the battle, Harkov was contacted on a priority comlink channel as the investigation into who was selling Imperial equipment continued. Discrepancies in the Protector's supply manifests had led the investigators to Harkov's flagship, but Harkov attempted to deflect the investigators' questions to the ship's quartermaster.\nWith both sides united against the Empire, the Imperials had no choice other than to force a resolution. To this end, the Protector was to take a consignment of new TIE Avenger starfighters to replace the TIE Fighters and TIE Interceptors lost in the previous missions. The Protector traveled to Gerbaud 2 to rendezvous with the Ton-Falk-class escort carrier Tropsobor. With an attack from Ripoblus and Dimok forces expected, several pilots were to fly cover for the transfer. The Secret Order had reason to suspect that another ship would be coming to the rendezvous location, and instructed Stele to watch for anything unusual. Shortly after the enemy attack was repelled and the transfer was completed, Stele inspected the incoming shuttle Omlaut to discover that it carried a high-ranking member of the Rebel Alliance. Harkov immediately disciplined Stele for his apparent inability to stick to orders and warned that his curiosity might get him into trouble.\nThe Omlaut docked with the Protector, and the Rebel was taken immediately to Harkov's private ready room for a meeting with the admiral. The Secret Order concluded that Harkov was responsible for the chronic shortages of supplies and had been attempting to cover his black-market dealings with both sides in the Sepan Civil War and, apparently, the Rebel Alliance. A member of the Secret Order later presented their suspicions to Darth Vader, who instructed them to bring him evidence before he moved against Harkov.\nAfter the Imperials inflicted heavy losses on both sides in the Sepan Civil War, the two factions had little choice other than to accept peace under Imperial rule. Leaders of both worlds were brought to the Protector, where Harkov addressed them, declaring the war over and promising that cooperation with the Empire would bring peace and prosperity.\nShortly after the end of the Sepan Civil War, the Secret Order had Stele transferred away from Harkov. However, as they closed the net on Harkov, they later had Stele transferred back to the Protector to assist them. A few days after Stele's arrival, Harkov met with his closest advisors. He feared that Stele may have been a spy for Emperor Palpatine, and that this could have compromised his plans to defect to the Alliance, which he expected to be completed within a few days. Vondruln, one of Harkov's advisors, was instructed to ensure that Stele was eliminated and to make it look like an accident.\nStele was instructed to show two rookie pilots how to clear a minefield in an unshielded craft. As Stele set about clearing the minefield, Harkov personally gave the order for his wingmen, actually experienced pilots, to eliminate him. However, the Secret Order had anticipated Harkov's actions, and had arranged for the Nebulon-B2 frigate Osprey to come to Stele's rescue. As Stele fled towards the Osprey, the Rebel MC40a light cruiser Margaret arrived to rendezvous with the Protector, which quickly dispatched a shuttle carrying one of Harkov's officers. Stele was able to avoid pursuing TIE Avengers and Rebel X-wings, and escaped on the Osprey.\nHarkov was furious about Stele's escape. His plan had been exposed, and he was now at war with the Empire, leaving him with no choice other than to join the Alliance immediately, and unable to get even a decicred for his defection. Harkov summarily executed Vondruln for his failure. With the Protector now dependent on the Rebels for supplies, Harkov fled to the Rebel supply outpost DS 5 in the Parmel system.\nImperial Assault Gunboat recon units were quickly dispatched to investigate several possible locations for the Rebel base in an effort to locate Harkov. The Emperor had dispatched Lord Vader to interrogate and execute Harkov, so the recon units were under instructions to locate him and report back. They were not to engage Harkov's forces, though they were to destroy any Rebel supply stores they encountered. It was Stele's recon unit that eventually located DS 5, and with it the Protector. The Imperials proceeded to cut off Harkov's supply lines, initially at the station, by destroying the cargo containers.\nWithin an hour of the recon flight's return, the Imperials launched again and destroyed a supply convoy, headed for DS 5, consisting of BFF-1 bulk freighter group Karflo, the modular conveyor group SoroSuub, the two container transports Morgath 1 and Morgath 5 and the CR90 corvette group Sundog. With Harkov cut off from supplies, he was unable to conduct even limited operations, and the Protector was effectively stranded. However, Harkov was not given time to think and adjust his plans, as the Empire launched another quick attack, weakening his starfighter corps with their own TIE Avengers.\nThe Empire planned an assault to board and capture the Protector. Harkov anticipated this attack and attempted to throw them off his scent by abandoning ship and taking refuge on DS 5, ordering the Protector to jump into hyperspace. However, during the attack on his starfighters, Stele inspected Harkov's shuttle, the Toten, and discovered the admiral's subterfuge.\nWith Harkov's location exposed, the Empire prevented his escape by using probe droids to watch for his escape while they planned their final attack. The Rebels quickly laid a minefield and called for assistance from the frigate Olinor. However, before the frigate arrived, the Empire launched their attack. Assault Gunboats fought defending starfighters, while Gamma-class ATR-6 assault transports moved against the platform itself. Harkov made one final attempt to flee aboard the YT-1300 light freighter Geddawai, but his ship was disabled by Maarek Stele.\nAfter Lord Vader arrived in the system aboard the Imperial-class Star Destroyer Garrett, the Geddawai was boarded and captured by a stormtrooper transport. Under stormtrooper guard, Harkov was taken to the Garrett and brought before the waiting Sith Lord. Bitter and defiant, Harkov attempted to resist the Dark Lord, refusing to answer any questions during his short interrogation. He was soon punished for his defiance as Vader used the Force to lift Harkov into the air and crush him.\nThough Harkov was dead, the Protector and the Akaga were, with the help of Rebel forces, able to evade Imperial forces until, trapped by the Immobilizer 418 cruiser Harpax, they were finally destroyed by the Garrett's forces. However, during this campaign, another high-ranking Imperial officer turned on the Empire, as Grand Admiral Demetrius Zaarin used the distraction to mount a coup against the Emperor.\nHarkov was a thin man whom, upon first seeing him, Maarek Stele considered to look sleep-deprived and erratic. He had a strong voice that carried his authority as a senior Imperial officer, but Stele found it edgy and his accent unpleasant. Harkov seemed to care little for any cause, and was willing to sell equipment to anybody willing to pay for it. Likewise, his attempted defection to the Rebel Alliance was motivated by desire for profit rather than any belief in the Rebel ideals.\nHe could also be a difficult commander to work under. He maintained a high level of security and ran his ship very strictly, discouraging his subordinates from acting outside of their orders or asking unnecessary questions, all of which led to low morale on board. In one instance, when Captain Trace made a joke during a briefing by Harkov, the admiral struck him. Trace would later advise Stele that he would be better off if he avoided the admiral's attention.\nHarkov was created for the 1994 LucasArts video game Star Wars: TIE Fighter, in which he was voiced by Nick Jameson. With the player in the role of Maarek Stele, Harkov features heavily in the early portions of the game, first as the player's commanding officer, and later as the main antagonist. In an interview in The Lucasfilm Fan Club Magazine 22, Lawrence Holland, project leader and designer of TIE Fighter, explained that the events of the Sepan Civil War were conceived to show the Empire at its best, stopping interplanetary disputes and establishing the infrastructure that would lead to prosperity. Harkov was intended to be the antithesis of this and abuses his position to prolong the war and profit at the expense of others. The character's story was later expanded in TIE Fighter: The Official Strategy Guide, by Rusel DeMaria.\nFollowing the release of Star Wars: Galactic Battlegrounds, LucasArts ran a competition to design a level for the game. The \"Harkov's Defection\" scenario by Antonio Cusano was one of the grand-prize-winning levels, and it, along with the other winning levels, was included with the Clone Campaigns expansion pack and made available for download on the LucasArts website. The scenario expanded on Harkov's meeting with Mon Mothma, during which he first discussed his defection. However, the scenario shows Darth Vader knowing of Harkov's defection from the start, contradicting events as portrayed in TIE Fighter and TIE Fighter: The Official Strategy Guide. In the scenario, Harkov is depicted with the same image used for his fellow Imperial officer Hindane Darcc.\nHarkov starts the scenario with only two escorts and must reach Mon Mothma's base safely, fighting his way through Imperial forces, including dark troopers and Sith apprentices, sent by Vader to capture him. Harkov soon finds an abandoned transmitter, which he uses to signal the Alliance base. However, an Imperial attack has destroyed the bridge leading to the base, so Harkov, joining forces with Rebel troops, must take the longer path through the forest. Along the way, he discovers two Imperial prisons that can be raided to rescue some Rebel troops and a captive Jedi. Harkov's forces eventually reach a small Rebel outpost, only to find it has been decimated by an Imperial attack. Proceeding to Mon Mothma's main base, Harkov can locate and rescue several prisoners from the Rebel outpost and must fight his way past a pair of All Terrain Armored Transports with the help of Rebel T-47 airspeeders. After destroying the Imperials' own camp, Harkov is finally able to reach Mon Mothma and begin negotiations while the furious Vader vows revenge.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/3_ABY/Legends",
  "/wiki/Garrett_(Star_Destroyer)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Admiral_Harkov%27s_fleet",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/File:Harkov1.ogg",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Sepan_Civil_War",
  "/wiki/Sepan_system",
  "/wiki/Mordon",
  "/wiki/Prophets_of_the_Dark_Side",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/Protector_(Victory_I-class)",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Akaga",
  "/wiki/Death/Legends",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/File:HarkovSpeech-TF.ogg",
  "/wiki/Ripoblus",
  "/wiki/Dimok",
  "/wiki/Star_system/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/First_Battle_of_the_Sepan_system",
  "/wiki/Maarek_Stele/Legends",
  "/wiki/TIE_pilot",
  "/wiki/Starship/Legends",
  "/wiki/Battle_of_Science_Station_Youst",
  "/wiki/Scientist/Legends",
  "/wiki/Science_Station_Youst",
  "/wiki/Second_Battle_of_the_Sepan_system",
  "/wiki/IPV-1_System_Patrol_Craft",
  "/wiki/Glas",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Sepan_8",
  "/wiki/Battle_of_Sepan_8",
  "/wiki/Cargo_ferry",
  "/wiki/Godendag",
  "/wiki/CR92a_Assassin-class_corvette",
  "/wiki/Runka",
  "/wiki/Comlink/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Quartermaster/Legends",
  "/wiki/TIE/ad_starfighter",
  "/wiki/Starfighter/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Gerbaud_2",
  "/wiki/Ton-Falk-class_escort_carrier",
  "/wiki/Tropsobor",
  "/wiki/Raid_on_the_Tropsobor",
  "/wiki/Pilot/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Omlaut",
  "/wiki/Black_market/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Vondruln",
  "/wiki/Space_mine",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Wingmate/Legends",
  "/wiki/Battle_of_the_minefield",
  "/wiki/Nebulon-B2_frigate",
  "/wiki/Osprey",
  "/wiki/MC40a_light_cruiser",
  "/wiki/Margaret",
  "/wiki/Shuttle/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Decicred/Legends",
  "/wiki/DS_5",
  "/wiki/Parmel_system",
  "/wiki/Alpha-class_Xg-1_Star_Wing/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Raid_near_DS_5",
  "/wiki/Cargo_container/Legends",
  "/wiki/Attack_on_the_DS_5_convoy",
  "/wiki/BFF-1_bulk_freighter/Legends",
  "/wiki/Karflo",
  "/wiki/Modular_conveyor",
  "/wiki/SoroSuub_(CNVYR)",
  "/wiki/Container_transport",
  "/wiki/Morgath_1",
  "/wiki/Morgath_5",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Sundog",
  "/wiki/Battle_at_DS_5",
  "/wiki/Toten",
  "/wiki/File:HarkovPays-TF.ogg",
  "/wiki/Probe_droid/Legends",
  "/wiki/Frigate/Legends",
  "/wiki/Olinor",
  "/wiki/Capture_of_DS_5",
  "/wiki/Gamma-class_ATR-6_assault_transport",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Geddawai",
  "/wiki/Lord/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Delta-class_DX-9_stormtrooper_transport",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Immobilizer_418_cruiser/Legends",
  "/wiki/Harpax",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Demetrius_Zaarin",
  "/wiki/Zaarin_insurrection",
  "/wiki/Captain/Legends",
  "/wiki/Hamo_Blastwell",
  "/wiki/1994",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_TIE_Fighter",
  "/wiki/Nick_Jameson",
  "/wiki/The_Lucasfilm_Fan_Club_Magazine_22",
  "/wiki/Lawrence_Holland",
  "/wiki/TIE_Fighter:_The_Official_Strategy_Guide",
  "/wiki/Rusel_DeMaria",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Antonio_Cusano",
  "/wiki/Hindane_Darcc/Legends",
  "/wiki/Dark_trooper",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Rebel_trooper/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/T-47_airspeeder/Legends",
  "/wiki/Category:Audio_files_of_Harkov",
  "/wiki/Category:Images_of_Harkov",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Dark_Side_Illuminated",
  "/wiki/LucasArts_Update",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/TIE_Fighter_Collector%27s_CD-ROM:_The_Official_Strategy_Guide",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_67",
  "/wiki/Welcome_On_Board",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Destruction_of_the_Glory",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Standard_year/Legends"
 ]
}