{
 "name": "Hark'r",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Noehon"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Reekeene's Roughnecks"
     ]
    }
   ]
  }
 ],
 "content": "Captain Hark'r was a male Noehon who served Reekeene's Roughnecks as a Supply Master aboard Home.\nHark'r was a male Noehon merchant who happened to pass close to Home, a Tsukkian water freighter used by Reekeene's Roughnecks as their headquarters and was promptly incarcerated. Afraid that Hark'r would sell information regarding the ship to the Galactic Empire, the leader of the Roughnecks, Lens Reekeene, gave Hark'r a choice. The first option was that he could spend the duration of the Galactic Civil War on a primitive planet with no starship traffic or access to communications equipment. The second option was that he could spend the war working aboard Home. The Noehon chose the latter option, reasoning that his chances for escape were better aboard the Roughnecks ship.\nHark'r's natural aptitude for organization and management led Reekeene to assign him to oversee the commissary and supply department for the Roughnecks. Reekeene did not trust him, and kept a close eye on him. Hark'r, for his part, was terrified of Reekeene, and constantly attempted to bribe new Roughneck recruits to smuggle him off the ship.\nConsidered to be pudgy for a Noehon, Hark'r had green skin and four arms. He spoke perfect Basic with a clipped accent similar to those living in the Core Worlds. He used precise pronunciation and used insincere phrases such as \"my dear fellows,\" \"old chap,\" and \"dear boy.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Noehon",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Reekeene%27s_Roughnecks",
  "/wiki/Captain/Legends",
  "/wiki/Supply_Master/Legends",
  "/wiki/Home",
  "/wiki/Merchant/Legends",
  "/wiki/Tsukkian_water_freighter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Lens_Reekeene",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Star_Wars_Campaign_Pack",
  "/wiki/Classic_Campaigns",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}