{
 "name": "Harko Wolley",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Intarsa League"
     ]
    }
   ]
  }
 ],
 "content": "Harko Wolley was a male Human was a member of the Intarsa League, a criminal faction led by the Force Adept Dersa Welles that operated in the Cularin system during the waning years of the Galactic Republic. In around 31 BBY, Wolley and his League compatriots were traveling in a shuttle near to the planet Cularin when they were attacked by a rival criminal faction and crash-landed in the grounds of the Blue Star Centre, a philosophical research facility. Wolley and the other Intarsa League members quickly moved to seize the Blue Star Centre and hold the facility hostage, and Wolley took up a defensive position within the building's offices. However, the Heroes of Cularin—a band of freelancers who operated in the Cularin system—attacked the facility and defeated Wolley and the rest of the Intarsa League to liberate the hostages.\nWolley was a thug with limited intelligence and he preferred to follow the lead of his superiors rather than to make decisions for himself. He was loyal and fiercely protection Dersa Welles and was determined to make sure that she did not come to harm.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Intarsa_League",
  "/wiki/Force_Adept",
  "/wiki/Dersa_Welles",
  "/wiki/Cularin_system",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Blue_Star_Centre",
  "/wiki/Philosopher/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Star_system/Legends",
  "/wiki/Skirmish_in_the_Blue_Star_Centre",
  "/wiki/Operation_Blue_Star"
 ]
}