{
 "name": "Harkun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3641 BBY",
      "Korriban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireSith OrderSith Academy",
      "Sith Order",
      "Sith Academy"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Sith Acolytes:Darth NoxFfon AltheKoryBalekWydrGerrNilocSeferissJaxunArgogXivhkalrainikLana Beniko",
      "Darth Nox",
      "Ffon Althe",
      "Kory",
      "Balek",
      "Wydr",
      "Gerr",
      "Niloc",
      "Seferiss",
      "Jaxun",
      "Argog",
      "Xivhkalrainik",
      "Lana Beniko"
     ]
    }
   ]
  }
 ],
 "content": "Harkun was a male Human and a member of the Sith Order who lived during the era of the Great Galactic War. Harkun was trained as an acolyte on the Sith graveyard world of Korriban and upon graduation became entwined within the Sphere of Ancient Knowledge as an inferior to a supervisor at the academy, the Sith Lord Zash. By the time of the Cold War between the reconstituted Sith Empire and the Galactic Republic, Harkun had been elevated to the rank of an Overseer of acolyte training on Korriban, conducting the brutal process which ultimately turned hopeful initiates into Sith Lords. Around 3643 BBY, the Overseer was tasked by Zash to gather a new class of pupils from the low-born slave classes of the Empire, so that a student worthy of becoming her new apprentice might be identified. Harkun, a severe xenophobe and classist, begrudgingly complied and took six new acolytes from the Empire's slave pens and brought them to the academy for tutelage and evaluation.\nHoping to manipulate the process to ensure the continuing domination of high-born Sith, Harkun secretly brought in the acolyte Ffon Althe, who had received advanced training from across the Empire and was far more adept at Sith techniques than the new slave recruits. However, throughout his direction of the new class of acolytes, Harkun's designs were repeatedly foiled by a young slave-turned-acolyte who, through savvy and skill, managed to overcome all of the Overseer's challenges. As a result, Harkun fostered an intense hatred for this acolyte and specifically schemed to ensure their downfall, despite Lord Zash's favorable views on the new student. Towards the end of the training and evaluation period, when only Althe and Harkun's unfavored acolyte remained, Zash ordered that the Overseer send the surviving acolytes on a final mission to retrieve a star map once belonging to the ancient Sith Lord Tulak Hord from a danger-filled tomb on Korriban's surface. Harkun attempted to give Althe an advantage over the other acolyte, but was confounded by interference from Zash, who ensured the success of Harkun's least favorite pupil.\nAs punishment for his attempted manipulations, Harkun was forced to watch Zash execute Althe before taking the other acolyte as her apprentice. The Sith Lord and her new pupil departed Korriban shortly thereafter, leaving Harkun to continue as an Overseer at the academy. Several years later, after the death of Lord Zash and the elevation of her apprentice to the rank and title of Lord Kallig, Harkun was asked yet again to gather a new class of acolytes from which Sith Lords could select an apprentice. Again Harkun fulfilled his duties as Overseer, managing a class of six new students; the group was initially offered to the elder Sith Lord Darth Thanaton, but he passed, allowing Lord Kallig to select an apprentice from the group. Harkun loyally served Kallig's interests, but found himself unable to accept the ultimate success of another slave-turned-acolyte, the Kaleesh warrior Xivhkalrainik. Lord Kallig, who was impressed with the Kaleesh, chose not to tolerate Harkun's protests and instead killed the man with concentrated blasts of Force lightning.\nA male Human, Harkun became an Overseer at the Sith Academy of Korriban. During the Cold War, Harkun had been tasked by Lord Zash to test a group of acolytes so that she may select a suitable Sith apprentice. Among those acolytes was an aspiring Sith Inquisitor - descended from the forgotten Sith Lord Aloysius Kallig - who Harkun treated with contempt because of their slave heritage. Harkun personally championed the Sith Pureblood acolyte Ffon Althe and made every effort to knock the slave-born acolyte out of the competition, including the dismissing of the acolyte's legitimate work, bribing the other acolytes to kill him/her, sending him/her to near-impossible tasks, and so forth.\nThroughout these trials, Harkun would have the initiates under his charge eliminated, but the soon-to-be Inquisitor always persisted. For the final task, Harkun sent Ffon ahead to find the star map from the tomb of Naga Sadow. However, Zash, having favored the Inquisitor, showed up to reveal how to free the Dashade Khem Val from his imprisonment in the tomb to access the star map. Ultimately, the Inquisitor succeeded where Ffon could not. Nonetheless, Harkun took the map off the Inquisitor and passed it to Ffon so he could take credit. When Zash arrived to receive her new apprentice, she easily saw through Ffon's lie and questioned it; he quickly admitted the truth out of fear of Zash. To punish Harkun for attempting to go behind her back, Zash killed Ffon, thus claiming the Inquisitor as her new apprentice. This infuriated Harkun, who threatened to harass the Inquisitor wherever the young Sith went, though this proved to be an empty threat.\nSometime later, the Inquisitor - now a powerful Lord of the Sith and heir to the legacy of both Lord Kallig and Tulak Hord - returned to Korriban, searching for a new apprentice to replace Corrin and Kaal, two apprentices that were purged by Darth Thanaton. During this time, Harkun treated Kallig with utmost respect and was supposedly less harsh to the new batch of acolytes, even claiming that any of their deaths was not caused by him. Harkun put his credits on the Gran acolyte, but, much as Zash had done, Kallig's eye fell upon one particular acolyte: the Kaleesh known as Xalek.\nAfter returning periodically to observe the progresses of the acolytes, Harkun mentioned that Xalek possessed a determined glint in his eye, which reminded him of Kallig. However, it seemed that they were both wrong when the Twi'lek acolyte Seferiss showed up, but Harkun was wrong again when Xalek shortly appeared afterward. Xalek then killed Seferiss, which angered Harkun as it was a blatant disregard for Sith tradition and went against the academy rules. Kallig tried to reason with Harkun, but when it was quite clear he still remained defiant, Kallig released a bolt of Force lightning and killed Harkun.\n Harkun's physical appearance was a signature one with dark brown hair, light blue eyes, freckles, a goatee, and a tattoo on his right eye. Harkun is polite toward his superiors, Sith Purebloods, and any person who has high-ranking heritage. He is openly rude and cruel towards slaves, aliens , and those who he considers weak. He demonstrated this when he executed Kory, after she was deemed unworthy by Spindrall. Despite his apparent disdain towards the Sith Inquisitor Kallig, he allows him to continue his training despite being mocked whenever he tries to insult him. This is probably because Kallig has not shown signs of weakness. It is more likely however, that he doesn't execute Kallig because he would be afraid of being in trouble with Lord Zash, as she favored the Inquisitor. When Ffon Althe suggested killing Kallig together with the Overseer, Harkun told him that it would be much easier to make Kallig's death seem more like an accident if it were to occur in one of the tombs, rather than in his office.\nHarkun was capable of Force lightning, and wielded a single bladed Sith lightsaber.\nDuring the quest where Xalek becomes Kallig's apprentice, Harkun's fate depends on the conversation choices made. The conversation choices depend on the answer to Harkun's protests regarding Xalek's murder of the acolyte Seferiss instead of finish the quest; most chains of dialogue will lead to Harkun walking away, declaring that he would inform Thanaton of what happened. If Kallig shows an apathetic disregard for the \"tradition\" of executing slaves guilty of murder  or tells Harkun that his \"defiance is foolish and misplaced\" , Harkun will state his concern that the Empire will fall \"if the rules of subterfuge and skill give way to blind murder\", giving three options: Either simply taking Xalek and leaving, Force-persuading Harkun that there was no murder and giving up his lightsaber to the apprentice, or killing him with Force lightning. If Harkun is spared, he will reappear near the end at the Sphere of Ancient Knowledge, where he will be one of those servants that bow before Kallig after the latter is seated on the Dark Council. It is possible to customize the Sith Warrior class to make the head of the character appear identical to that of Harkun's. Ironically, it isn't possible to do this as the Sith Inquisitor. This is either because he is a warrior, or the game designers didn't want the player to look exactly like another character in the storyline.\nHe will also send a message to the Hunter or Cipher Nine if either one completed the misson \"Dreams of Korriban\" on Hutta.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3641_BBY",
  "/wiki/Korriban",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Order_(Sith_Empire)",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Sith_Acolyte",
  "/wiki/Darth_Nox",
  "/wiki/Ffon_Althe",
  "/wiki/Kory",
  "/wiki/Balek",
  "/wiki/Wydr",
  "/wiki/Gerr",
  "/wiki/Niloc",
  "/wiki/Seferiss",
  "/wiki/Jaxun",
  "/wiki/Argog",
  "/wiki/Xivhkalrainik",
  "/wiki/Lana_Beniko",
  "/wiki/Sith/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Planet/Legends",
  "/wiki/Sphere_of_Ancient_Knowledge",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Zash",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Overseer_(Sith)",
  "/wiki/Sith_training",
  "/wiki/3643_BBY",
  "/wiki/Slavery/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Speciesism",
  "/wiki/Tulak_Hord",
  "/wiki/Tomb_of_Naga_Sadow",
  "/wiki/Death/Legends",
  "/wiki/Darth_Thanaton",
  "/wiki/Kaleesh/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Aloysius_Kallig",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Dashade/Legends",
  "/wiki/Khem_Val",
  "/wiki/Corrin",
  "/wiki/Kaal_(Human)",
  "/wiki/Gran/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith_lightsaber/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Dark_Council",
  "/wiki/Hunter_(individual)",
  "/wiki/Cipher_Nine",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/The_Final_Trial",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}