{
 "name": "Harlon_Grer",
 "display_name": "Harlon Grer",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jarea Kaela"
     ]
    }
   ]
  }
 ],
 "content": "Harlon Grer was a Force-sensitive Human male bounty hunter active during the reign of the Galactic Empire.\nA Force-sensitive Human, Harlon Grer found employment as a bounty hunter during the Galactic Civil War. After his home was destroyed by the Empire because of the locals' sympathies for the Rebel Alliance, Grer continued to take any mission he could take, even if it meant working for the Empire. Carrying a modified long rifle and a heavy blaster pistol, Grer took a job to eliminate a Quermian witch in the swamps of Karalle. Wearing a armored jumpsuit, Grer felt an evil in the swamps as he waited in the trees above the witch's hut. Finding Jarea Kaela deep in meditation, Grer fired a shot at her head but quickly realized he had shot a mannequin. Before he could react, Kaela had ignited her lightsaber and her nexu, Hassi, had surrounded him. While Grer initially hoped to outsmart her because of her blindness, he was seduced by her kindness, and her offer to train him. He only agreed to be trained by Kaela when his employer, an Imperial Inquisitor, stepped out of the forest with a squad of stormtroopers ready to kill them both. Recognizing his fate lay in the hands of Kaela, Grer raised his blaster and opened fire on the Imperials",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Jarea_Kaela",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Quermian/Legends",
  "/wiki/Jumpsuit/Legends",
  "/wiki/Meditation/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Nexu/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Savage_Spirits"
 ]
}