{
 "name": "Harlon_Fane",
 "display_name": "Harlon Fane",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Corellian Corporate Council"
     ]
    }
   ]
  }
 ],
 "content": "Harlon Fane was a Human male, a savvy corporate tycoon who served as Chairman of the Corellian Corporate Council on Corellia during the Cold War and the Galactic War between the Galactic Republic and the resurgent Sith Empire.\nAfter a long and successful tenure as an executive with the largest starship manufacturer in the galaxy, Harlon retired from active control of the company to a more prestigious and influential position as the manufacturer's representative on the Corellian Corporate Council–a group comprised of major industry leaders devoted to influencing Corellian politics to corporate advantage.\nWhen the Sith Empire conquered Corellia he decided to oppose the Sith and entered in the resistance, becoming a leader and a very important financier. So Darth Tormen sent his hunter to capture him. Cornered by the Hunter in his own office, Fane attempted to bribe the mercenary to show leniency. The Hunter was willing to consider his offer if he cleared the huge bounty on the Hunter's head. Fane feigned compliance, before activating his personal shield and ordered his security guards to subdue the Hunter. However, his guards were no match for the Mandalorian. Fearing for his life, Fane pleaded to be spared, promising to leave Corellia but the Hunter wouldn't have it, as Tormen needed him. Seeing he had no options, Fane deactivated his shield and surrendered. The Hunter later presented to Tormen Harlon Fane frozen in carbonite. As he was unfrozen, Fane was forced by Tormen to sign a treaty dictating Corellia's secession from the Republic. After signing the treaty, he was executed for treason against the Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/3640_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Corellian_Corporate_Council",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Darth_Tormen",
  "/wiki/Hunter_(individual)",
  "/wiki/Carbonite/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}