{
 "name": "Harmon Sho",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Zeltros"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nagai"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nagai"
     ]
    }
   ]
  }
 ],
 "content": "Captain Harmon Sho was a Nagai who served under Den Siva during the Nagai–Tof War. Sho succeeded in capturing several important Alliance dignitaries who were present on Zeltros for celebration. After capturing Alliance commanders such as Generals Han Solo and Lando Calrissian, Sho talked with his superior Lieutenant Den Siva about the next course of action. Siva told the Nagai Captain to bring the captives to the rendezvous point, and after the transmission ended, Sho herded the captives away to be loaded onto a Nagai transport ship.\nUnknown to Sho, Siva had been captured by Tof forces who were forcing the Nagai commander to set his people up for an ambush. As Sho and the rest of the Nagai under his command arrived at the rendezvous point, they were surprised to see that Siva was waiting for them, presumably to give them new orders. As Siva told the Nagai that they would no longer be placing their captives on transport ship, a Tof force led by Bargthron ambushed and killed several of the Nagai, inadvertently freeing the Alliance dignitaries.\nSho was badly injured by the Tof attack and lay dying on the Zeltros palace floor. Sho surveyed the scene as an Alliance force attacked the Tofs and freed the remaining captive Alliance members. Sho became furious as the Alliance laughed over their victory while his men lay bleeding on the battlefield. Sho propped himself up on his elbow and prepared to shoot at Dani, Luke Skywalker, and Leia Organa as they gathered with the rest of the Alliance members. C-3PO saw what Sho was preparing to do but was unable to act in time. Luckily for the Alliance, Den Siva executed his subordinate in part because of his hidden love for Dani. Sho's death marked the end of the Battle of Zeltros, and Siva began to negotiate terms for a future alliance between the Nagai and the Alliance.\nHarmon Sho is represented by two drastically different looking Nagai during his transmission with Den Siva. However, the Nagai with the topknot is the one that is executed by Siva at the end of the battle, showing that the second appearance of the Nagai captain should probably be attributed to artist error.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Harmon_(disambiguation)",
  "/wiki/4_ABY/Legends",
  "/wiki/Zeltros/Legends",
  "/wiki/Nagai",
  "/wiki/Gender/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Den_Siva",
  "/wiki/Nagai%E2%80%93Tof_War",
  "/wiki/General/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Tof",
  "/wiki/Bargthron",
  "/wiki/Dani",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/C-3PO/Legends",
  "/wiki/Battle_of_Zeltros",
  "/wiki/Star_Wars_(1977)_104",
  "/wiki/Star_Wars_(1977)_105",
  "/wiki/Star_Wars_(1977)_106",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_University_of_Sanbra_Guide_to_Intelligent_Life:_The_Marvel_Series",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}