{
 "name": "Harn_(Imperial)",
 "display_name": "Harn  (Imperial)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Royal Imperial Academy",
      "Imperial Officer Corps",
      "Royal Imperial Academy"
     ]
    }
   ]
  }
 ],
 "content": "Harn was a human male Imperial officer who served as a commander at the Royal Imperial Academy on Coruscant in the years leading up to the Galactic Civil War. He oversaw the training of cadets, including Thane Kyrell and Ciena Ree, among others.\nCommander Harn was an instructor at the Royal Imperial Academy on the Imperial capital of Coruscant. Around 4 BBY, he instructed a course teaching Imperial cadets how to operate and maintain their TIE fighters. One class assignment involved students building laser cannons out of spare parts. During one class, the Jelucani cadet Thane Kyrell's laser cannon was found to have been sabotaged. After consulting with the door panel's computer, Harn found that the purported saboteur was fellow Jelucani Ciena Ree.\nRee was summoned to Commandant Deenlark's office. Ree's friend Jude Edivon found evidence that the door panel's data log had been tampered with and informed Harn. Harn and Edivon submitted the information to Deenlark. Harn listened as Edivon explained her theory that whoever had sabotaged Kyrell's ship cannon had also sabotaged the door panel. She speculated that Kyrell had perpetrated the sabotage in order to keep up his high class rankings. Deenlark accepted Edivon's theory and penalized both Kyrell and Ree. In fact, the laser cannon incident had been staged by the Academy's Office of Student Outcomes in order to discourage local loyalties and to redirect the cadets' loyalties towards the Galactic Empire.\nHarn was an Imperial commander who served as an instructor at the Royal Imperial Academy, specializing in teaching cadets how to operate and maintain their TIE fighters. He was a stern instructor who did not smile and sometimes murmured in class. Harn expressed anger when he discovered that another cadet had purportedly sabotage Kyrell's TIE fighter cannon. He supported Edivon's theory that someone had sabotaged both the TIE fighter cannon and the door panel's data log.\nHarn first appeared in Claudia Gray's 2015 junior novel Lost Stars, which was released as part of the Journey to Star Wars: The Force Awakens multimedia promotional franchise.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Royal_Imperial_Academy",
  "/wiki/Imperial_officer",
  "/wiki/Commander",
  "/wiki/Coruscant",
  "/wiki/Standard_year",
  "/wiki/Galactic_Civil_War",
  "/wiki/Imperial_cadet",
  "/wiki/Thane_Kyrell",
  "/wiki/Ciena_Ree",
  "/wiki/Capital",
  "/wiki/4_BBY",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Cadet",
  "/wiki/Laser_cannon",
  "/wiki/Jelucan",
  "/wiki/Laser",
  "/wiki/Cannon",
  "/wiki/Computer",
  "/wiki/Saboteur",
  "/wiki/Commandant",
  "/wiki/Deenlark",
  "/wiki/Jude_Edivon",
  "/wiki/Starship",
  "/wiki/Office_of_Student_Outcomes",
  "/wiki/TIE_line",
  "/wiki/Claudia_Gray",
  "/wiki/2015",
  "/wiki/Lost_Stars",
  "/wiki/Journey_to_Star_Wars:_The_Force_Awakens",
  "/wiki/Lost_Stars_(audiobook)",
  "/wiki/Lost_Stars_(webcomic)"
 ]
}