{
 "name": "Harp_Allor",
 "display_name": "Harp Allor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chandrila"
     ]
    },
    {
     "name": "Born",
     "values": [
      "20 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Apprentice Legislature",
      "Apprentice Legislature"
     ]
    }
   ]
  }
 ],
 "content": "Harp Allor was a human female from the planet Chandrila who lived during the era of the Galactic Empire. Sponsored by Winmey Lenz, a Chandrilan senior senator, Allor became a member of the Apprentice Legislature in 3 BBY. She was described by fellow Apprentice Legislator Princess Leia Organa as being friendly, over-prepared, and unabashedly cheerful, and was one of several Apprentice Legislators to participate Cheif Pangie's pathfinding class organized by Queen Breha Organa of Alderaan.\nAs part of the Apprentice Legislature, Harp attended a pathfinding class arranged by Queen Breha Organa of Alderaan, alongside Princess Leia Organa, Chassellon Stevis, Sssamm Ashsssen, Amilyn Holdo, Kier Domadi, and an Ithorian, among many other students under the instruction of Chief Pangie of the Chandrilan Pathfinding Corps. The group hiked for five hours before finding a hoversled. Pangie told the students that it belonged to her, and thatthey must find their way back to the chalet by nightfall or be kicked from the class, before she departed.\nAs the group slowly made their way back, and Amilyn looked for snow owls, they argued over the pace they should be going. Harp rushed ahead, but slipped on ice, breaking her left ankle. This caused the group to argue, with some wanting to help Harp and others wanting to continue on, since each student had a tracker which could be used to find Harp after they had made it back. Leia, Kier, Sssamm, and Amilyn stayed with Harp while Chassellon led the rest of the class onward. The four managed to splint and bandage Harp's ankle and get her onto a travois to drag her back. Amilyn cracked a joke, saying \"Who would've guessed we'd encounter mortal peril so soon?\" This did little to cheer up Harp, who began to cry, apologizing for slowing the group down. Kier comforted her and they soon arrived at a snow-covered slope. Amilyn came up with the idea of making a toboggan out of a tent, and Sssamm held it together.\nChassellon along with his group arrived at sunset, when they walked into the great room they shocked to see that the five had made it before him with the injured Harp and were resting by the hearth and drinking mocoa, Harp resting her left foot on a sleeping Sssamm in the comfiest chair by the fire, floaty cream on the tip of her nose and a bacta bag on her foot. Pangie also lectured Chassellon and the others for their abandonment of Harp.\nAfter Harp's broken ankle had healed, she and the other Apprentice Legislators attended the opening of the Apprentice Legislature with Wilhuff Tarkin as the guest speaker and then the reception afterwards celebrating the promotion of Tarkin to the rank of Grand Moff. Harp was told by her sponsor Senator Lenz that he'd introduce her to Tarkin, to which she enthusiastically told her friends. Harp waved towards the senator who waved back.\nHarp and Leia also got into a spat with Kier who commented on the lack of impact the Imperial Senate had with Harp defending her sponsor and Leia defending her father Senator Bail Organa with the girls claiming that they both worked very hard.\nHarp attended the first real session of the Apprentice Legislature the next day which began with introductions before moving onto the first issue which was on where to build a new academy of aeronautical engineering and design. Harp argued in favour for the planet Harloff Minor however they ultimately picked the planet Arreyel which had been picked by Leia.\nThe entire assignment however had been a trick by the Empire as they used it as an excuse to take the radiation source that was beneath the planet's surface, shielded by a rock, in order to power factories. The population was given six weeks to evacuate with no compensation, with Grand Moff Tarkin apparently telling them they were lucky to not be fined for concealing the source from the Empire, and the Apprentice Legislature receiving a special commendation for recommending Arreyell.\nHarp later had her seventeenth birthday party on Coruscant with Senator Lenz personally reserving the venue, a water park, as a gift. Her friends attended the party including Leia though the princess admitted to herself that the entire day she felt as though she was going through every action and sentence as mechanically as a droid. It was the first time Leia had been out since she had found out about Arreyell and she still felt guilty over it.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Chandrila",
  "/wiki/20_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Human",
  "/wiki/Chandrilan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Apprentice_Legislature",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Winmey_Lenz",
  "/wiki/Senior_senator",
  "/wiki/3_BBY",
  "/wiki/Apprentice_Legislator",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Pangie",
  "/wiki/Pathfinding",
  "/wiki/Queen",
  "/wiki/Breha_Organa",
  "/wiki/Alderaan",
  "/wiki/Chassellon_Stevis",
  "/wiki/Sssamm_Ashsssen",
  "/wiki/Amilyn_Holdo",
  "/wiki/Kier_Domadi",
  "/wiki/Ithorian",
  "/wiki/Chief",
  "/wiki/Chandrilan_Pathfinding_Corps",
  "/wiki/Hoversled",
  "/wiki/Pathfinding_class_chalet",
  "/wiki/Snow_owl",
  "/wiki/Travois",
  "/wiki/Toboggan",
  "/wiki/Tent",
  "/wiki/Mocoa",
  "/wiki/Bacta",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Grand_Moff",
  "/wiki/Senator",
  "/wiki/Imperial_Senate",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Harloff_Minor",
  "/wiki/Arreyel",
  "/wiki/Standard_week",
  "/wiki/Birthday",
  "/wiki/Coruscant",
  "/wiki/Unidentified_water_park",
  "/wiki/Droid",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/Leia,_Princess_of_Alderaan_(audiobook)",
  "/wiki/Leia_Organa:_Ordeal_of_the_Princess"
 ]
}