{
 "name": "Harro Kelpura",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Anx"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Harro Kelpura was an Anx male Jedi Master who served as a scholar of the Jedi Order and the Galactic Republic on Coruscant. During the Clone Wars, he was investigating an alien escape pod that had been discovered near Wild Space years earlier. In 22 BBY, Kelpura responded to a break-in at his research laboratory with the pod's former occupant, Nuru Kungurama, but their freighter crashed during the investigation, knocking Kelpura unconscious. Soon after, he was brought to the Jedi Temple medical center.\nJedi Master Harro Kelpura of the Galactic Republic was an Anx scholar who was eager about his work in the Jedi Archives on the planet Coruscant. During the Clone Wars between the Republic and the Confederacy of Independent Systems, Kelpura was assigned to investigate an exotic alien escape pod that had been discovered eleven years earlier near Wild Space. The Jedi Nuru Kungurama had been found aboard the pod.\nKelpura soon moved the pod to a research laboratory in Coruscant's Dacho District, away from the Jedi Temple, as a safety precaution. Sometime afterward, fallen Jedi Master Count Dooku used Kelpura's claim that the scholar had deciphered data about the alien civilization that had made the pod to convert Kungrama's Master, Ring-Sol Ambase, to ally with him.\nIn 22 BBY, Kungurama, now leading the clone trooper unit Breakout Squad, arrived back on Coruscant after a series of missions. Kelpura met the squad at the Senate Building with Supreme Chancellor Palpatine and, on the suggestion of Master Kit Fisto, departed with the group for the Jedi Temple aboard Kungurama's freighter.\nEn route, Kelpura received a notification that his lab in the Dacho District had been broken into, so the group's freighter changed course to divert there instead. Upon arrival, the group saw that a Corona-class transport used by Kungurama's missing Master had gotten there first. Kungurama's freighter then crashed after impacting with a dropship that belonged to a bounty hunter who was assisting the missing Ambase.\nKelpura was knocked unconscious in the crash, while Kungurama went to confront his Master. After the confrontation ended, Kelpura and Ambase were sent to the Jedi Temple medical center. Days later, Kungurama visited both Jedi Masters, who were feeling much better.\nMaster Kelpura was eager about his research work and excited to show his discoveries to the escape pod's original occupant, Nuru Kungurama. Upon receiving the notification about the laboratory break-in, he insisted Breakout Squad change course to investigate. He spoke with a low, rumbling voice.\nHarro Kelpura appears in Ryder Windham's 2012 young-readers novel, Guardians of the Chiss Key, the fourth volume in the Star Wars: The Clone Wars: Secret Missions series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Harro_(disambiguation)",
  "/wiki/Anx/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Lore_Seeker",
  "/wiki/Coruscant/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Laboratory/Legends",
  "/wiki/Nuru_Kungurama",
  "/wiki/Freighter/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Dacho_District",
  "/wiki/Count_of_Serenno/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Ring-Sol_Ambase",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Breakout_Squad",
  "/wiki/Senate_Building",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Corona-class_transport",
  "/wiki/Sleight_of_Hand",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Skirmish_at_Moxonnic_Manufacturing",
  "/wiki/Standard_day/Legends",
  "/wiki/Ryder_Windham",
  "/wiki/2012",
  "/wiki/The_Clone_Wars:_Secret_Missions_4:_Guardians_of_the_Chiss_Key",
  "/wiki/Star_Wars:_The_Clone_Wars:_Secret_Missions",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}