{
 "name": "Harridax Kirill",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "the Regnant",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireImperial NavyVoidwolf's personal strike fleet",
      "Imperial Navy",
      "Voidwolf's personal strike fleet"
     ]
    }
   ]
  }
 ],
 "content": "Harridax Kirill, also known as the Voidwolf, was a male Human who served as a Grand Admiral of the Imperial Navy during the Great Galactic War, the Cold War and the Galactic War between the Sith Empire and Galactic Republic.\nHarridax Kirill was one of the Empire's most feared leaders. He started his career as a brutal criminal slaver on the Outer Rim before becoming an Imperial privateer.\nHis underworld experience made him an especially effective \"dirty fighter,\" but also antagonized the Imperial Armada's aristocratic officers who preferred to conduct war according to accepted strategies. He became ambitious enough to plan to take control of the galactic underworld for the Empire. The Voidwolf cemented his position with the Empire by capturing a Jedi vessel filled with Force-sensitive children. He personally led the boarding party that killed the Jedi defenders and took the young Padawans-to-be prisoner. When he delivered this \"gift\" to the Sith on Korriban for training, they promoted him from independent privateer all the way to the rank of Navy commander.\nDuring the Cold War, Imperial agent Darmas Pollaran had brokered a deal with Republic Senator Bevera Dodonna to betray the Republic. However, Rogun the Butcher caught wind of their dealings and had managed to imprison both individuals on Port Nowhere, only to be freed by a smuggler, who was an enemy of Rogun's. The two then spun a story that Rogun's a servant of the Voidwolf, convincing the smuggler to become a Republic privateer.\nThe Voidwolf kept his distance as he relayed missions for his lackeys to pass to the smuggler. After the smuggler completed a job on Balmorra, they went to Quesh to assist a group of privateers being grounded by the Voidwolf. When the smuggler stormed the Imperial base that tagged any unauthorized ship that attempted to leave, the Voidwolf was monitoring by hologram and chastised Commander Flayn for failing to notice that the smuggler was right behind him. The Voidwolf mocked the smuggler, revealing that he knew everything about the smuggler. Flayn then attempted to kill the smuggler, only to be killed in turn.\nUltimately, the smuggler joined with Vaz Traniff to raid the Imperial treasury ship, King's Ransom. When confronted by the smuggler, the three Moffs onboard called the Voidwolf for assistance. The Voidwolf did not hesitate to remind them that he outranked them. Though the Moffs reminded him that he was bound by the rules of warfare to send reinforcements, the Voidwolf revealed that the Republic and Empire had officially gone to war, and he exploited Article 17 of the Ziost Convention to justify destroying the King's Ransom just to kill the smuggler. However, his foe managed to escape.\nDeciding to continue exploiting the smuggler after they saved Dodonna from another of Rogun's bounty hunters, the Voidwolf planned on taking Rogun out of the picture. After the smuggler completed jobs on Belsavis and Voss, he finally confronted Rogun at his safehouse on Tatooine. At the same time, the Voidwolf sent two Pureblood Sith, Chane and Desora, to confront the two and reveal his deception. He assumed that two Sith would easily handle two criminals, but the smuggler and Rogun partnered up and survived the betrayal.\nThe Voidwolf then went to Corellia, influencing corrupt Corellian Councilor Caicos into convincing the Corellian Council to secede from the Republic. However, the smuggler had followed the Voidwolf to Corellia and, with Republic aid, exposed Pollaran, forcing Dodonna into hiding. But as the Senator was exposed, the Voidwolf felt he had no more use of her and had her indentured. The Voidwolf remained on his flagship, the Harrower-class dreadnought Regnant, in orbit, managing to amass a pirate fleet so he could attack the Republic shipyards and then invade the Core Worlds. However, the smuggler had managed to get onboard his flagship via Caicos' shuttle. Confronting their enemy on the bridge, the smuggler publicly challenged the Voidwolf for control of his pirate fleet and defeated him. The Voidwolf tried to flee, throwing a grenade at his opponent, but the smuggler threw the grenade back, killing the Voidwolf and assuming control of his fleet.\nFollowing the Voidwolf's death, his daughter Nexia Kirill swore to hunt down the smuggler responsible for killing her father.\nHarridax Kirill is voiced by Ron Bottitta.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Harridax_Kirill",
  "/wiki/3640_BBY",
  "/wiki/Regnant",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Navy_(Sith_Empire)",
  "/wiki/Voidwolf%27s_personal_strike_fleet",
  "/wiki/Voidhound",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Privateer/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Korriban",
  "/wiki/Darmas_Pollaran",
  "/wiki/Senator/Legends",
  "/wiki/Bevera_Dodonna",
  "/wiki/Rogun_Matt%27rik",
  "/wiki/Port_Nowhere",
  "/wiki/Balmorra/Legends",
  "/wiki/Quesh",
  "/wiki/Flayn",
  "/wiki/Vaz_Traniff",
  "/wiki/Treasury_ship",
  "/wiki/King%27s_Ransom_(treasury_ship)",
  "/wiki/Ziost_Convention",
  "/wiki/Belsavis/Legends",
  "/wiki/Voss",
  "/wiki/Tatooine/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Chane",
  "/wiki/Desora",
  "/wiki/Corellian_Council",
  "/wiki/Caicos",
  "/wiki/Harrower-class_dreadnought",
  "/wiki/Pirate/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Nexia_Kirill",
  "/wiki/Ron_Bottitta",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_3",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}