{
 "name": "Harron_Tavus",
 "display_name": "Harron Tavus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Havoc Squad",
      "Havoc Squad",
      "Sith Empire",
      "Imperial Military",
      "Imperial Military"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jek Kardan"
     ]
    }
   ]
  }
 ],
 "content": "Harron Tavus was a Human male lieutenant and later commander in the Republic Special Forces who fought in the Great Galactic War. He was friends with and fought alongside Jedi Orgus Din during the offensive in the Minos Cluster. Tavus was present when the reconstituted Sith Empire attacked the capital world of Coruscant and again fought alongside Din to repel the invaders, though they were ultimately unsuccessful. After the Treaty of Coruscant was signed, officially ending the war, Tavus accompanied Din on a diplomatic mission to Balmorra, during which they rescued Satele Shan and SP-99 from an adrift escape pod.\nAs cold war skirmishes engulfed the galaxy Tavus, at that time field officer of the Havoc Squad, began to lose faith in the Galactic Republic. He was stationed on Ord Mantell during a violent civil war, fighting the Imperial backed Mantellian Separatist Movement, where he and his squad prepared and carried out their defection to the Sith Empire.\nHarron Tavus observed the end of the Sith Empire's offensive in the Minos Cluster while serving as a lieutenant in the Republic Special Forces Division along with the Jedi Orgus Din. They later reported this to the Galactic Senate on Coruscant, and were present when the Sith forces attacked the capital world. He fired at the emerging Sith troopers just as Din engaged Sith Lord Darth Angral in lightsaber combat. When Din disengaged from combat with the Sith Lord and headed for the Jedi Temple, Tavus followed him, only to find the temple in ruins.\nLater, Tavus accompanied Din on a diplomatic mission to Balmorra in the wake of an incident precipitated by Din's former apprentice, Fortris Gall. While en route, they stumbled across a Republic escape pod at the same moment a Mandalorian cruiser was also approaching. Tavus warned off the Mandalorians, who refused to withdraw. Shots were fired, but Tavus and Din were able to recover the pod which held Jedi Knight Satele Shan and the droid SP-99. Shan updated her two rescuers on the Sith betrayal, and insisted that, after they notified Grand Master Zym, they attempt to rescue Master Dar'Nala, who was still a prisoner of the Sith Empire.\nSoon after however, Tavus received a transmission from Master Zym who informed them that they had intercepted an Imperial communications transmission that revealed that Dar'Nala had been executed. Soon after, Tavus went to Shan's quarters to comfort her, for which she was grateful.\nUpon arriving on Balmorra, Tavus and Din were greeted by Master Buryn, who revealed that fighting on the planet had resumed. Meanwhile, Din had ordered Gall to go to Dantooine to assist in ending the fighting there, with whom Tavus and Shan tagged along. During the ride, Tavus talked with Satele about developing a relationship.\nOnce they reached Dantooine, the commanding officer said Gall had already arrived and was helping them continue the battle against the Sith. Tavus agreed to leave the troops behind. He was later contacted by Gall to meet him at the ruins of the Jedi Enclave. When he saw SP-99 spying on him yet again, he shot and destroyed the droid.\nLater, Fortris Gall brought Tavus to the ruins of the old Jedi enclave where he revealed that he along with some other Jedi, not the Sith, were responsible for the bombing of the Senate Tower. Dar'nala, who hadn't been killed, then entered with a Wookiee bounty hunter named Dalborra, who was under her influence. Dar'nala was leading the group that wanted to disrupt the treaty to \"save\" the Republic. Tavus accused them of treason, but Dar'nala said that standing by while the Republic suffers under the treaty was the real treason. The trio then offered Tavus a chance to join them, since there were only a few more steps to take until Darth Baras would be framed as the one disrupting the treaty. Tavus agreed.\nThe group met Darths Baras and Angral at the crystal caves where Satele soon arrived as well. Dar'nala was revealed to be responsible for the attack on the Envoy. Baras tried to turn Satele to the dark side but she resisted. Tavus had Angral beaten and was about to kill him when Satele told him to stand down, as by killing Angral he would merely be playing into the Sith's hands. An infuriated Dar'nala called them both traitors and stated Satele broke her heart, and she would break Satele's in turn by killing Tavus, whom she sensed cared about the Lieutenant. Gall blocked the strike, saving Tavus' life, and turning on the now quite mad Dar'nala.\nDar'Nala was killed seconds later by Dalborra, who managed to escape the Dark Jedi's mind control. Satele gathered Tavus and Gall together and escaped the caves. They returned to the base, where Din announced that the Major in charge had finally seen reason and agreed to pull out.\nDuring the Cold War, Tavus became the commander of the elite Special Forces unit Havoc Squad. His squad consisted of his second-in-command Captain Zora  and Lieutenants Vanto \"Fuse\" Bazren, Bex \"Gearbox\" Kolos, and Ryler \"Needles\" Dorant. The squad eventually became disillusioned with the Republic, especially when the Senate chose to abandon him on Ando Prime. Thus, he chose to defect to the Empire. But in order to get into the Empire's good graces, he needed something of value.\nDuring the Ord Mantell Civil War, Havoc Squad was to retrieve a prototype bomb called the ZR-57. At the same time, a newly transferred Meteor was added to Havoc Squad. Tavus found the new recruit too idealistic and chose not to include the sergeant in his plans. Thus, when Havoc Squad, minus their new member, infiltrate the Mantellian separatist fortress, they purposely cut themselves off from base camp. Against Tavus' explicit orders, Lieutenant Aric Jorgan sent the Sergeant into the separatist base to find Havoc Squad, only to discover them ready to hand the ZR-57 to the Empire, unaware that the sergeant had previously deactivated it. Tavus decided to explain his intentions to the sergeant, but left the sergeant to die against an Imperial brigade. While he assumed the sergeant dead, Tavus himself was dead wrong. Not only did the sergeant survive, but the Republic military was aware of Tavus' betrayal. The sergeant was promoted to lieutenant and given command of a new Havoc Squad, placed under General Elin Garza's command to hunt down the traitors. Nonetheless, Tavus was able to lead hundreds of SpecForce operatives to defect.\nAfter learning that the loyalist Havoc recruit had survived and had taken out Needles and Captain Andrik, Tavus stole a prototype cloaking device from Cularin and stashed it on a derelict ship on the Outer Rim, anticipating that Havoc Squad would be sent to recover it. Once Havoc was aboard and disabled the security, Tavus addressed the squad via holo. He condemned the Havoc CO for killing his fellow defector, hypocritically labeling them heroes. He attempted to repulse his foes with the Imperial special forces unit Shadow Fist, cutting communications without confirming a kill, expecting that his former enemies-turned-allies would eliminate his nemesis but that failed.\n\nFollowing this skirmish, the new Havoc soon went on to hunting down and eliminating the remaining the traitors' operations, leaving only Fuse and Jek Kardan alive to return to the Republic. With the Empire becoming cross with him, Tavus called all remaining defectors to his flagship, the Harrower-class dreadnought Justice. Garza intercepted his transmission and dispatched Havoc Squad to confront Tavus. Havoc sabotaged the Justice, preventing it from going to hyperspace, killing Wraith in the process, before confronting Tavus on the bridge. After the Lieutenant defeated him, Tavus surrendered, feeling regret for his actions and how it had cost the lives of his men, and offered to work with General Garza and the Republic Special Forces to undo some of the damage he caused by the defection of Havoc Squad.\nAfter rejoining the Republic, Tavus sent a message and expressed his regrets and wished the new Captain of Havoc Squad luck.\nTavus was a very competent trooper in the Republic Special Forces who remained level-headed and decisive even under pressure, as shown by his actions during the Sacking of Coruscant. Instead of panicking at the vicious surprise attack, Tavus proceeded to engage the invading Sith forces with professionalism and precision, fighting at the side of Jedi Master Orgus Din. Tavus' confidence was also demonstrated in a tendency to be slightly cocky: he made several casual, flippant, and teasing remarks to Satele Shan following her rescue from a drifting escape pod. He was also capable of maintaining close relationships with others, as evidenced by his first-name-basis friendship with Jedi Master Orgus Din.\nAs the years went by, Tavus' faith in the Republic was swept away when the Senate abandoned Havoc on Ando Prime. He defected to the Empire because he believed it valued strength in its warriors. But as the new Havoc Squad eliminated his comrades one-by-one, Tavus nurtured a growing hatred for the recruit he failed to kill. Eventually cornered, Tavus sought to fight and avenge his friends' death. But in losing, he felt regret for his actions and realized that he's good as responsible for the old Havoc's downfall.\nDepending on the player's choices, Tavus surrenders and offers to work with Republic Special Forces to try and undo some of the damage caused by the defection of Havoc Squad under his leadership or dies on the Justice If the player suggests that he will go to trial, Tavus will resist, knowing that Garza would cover up his defection and he's good as executed, resulting in his death. Either way, he does not appear in person after the confrontation on The Justice -- if he is permitted to surrender, the player receives a message from him expressing his regrets and wishing the new Captain of Havoc Squad luck.\nThe player can also opt to personally execute him on the bridge of the Justice for Dark Side points, on the grounds of no mercy for traitors, an action that would be supported by Aric Jorgan.\nHarron Tavus is voiced by actor Michael Gregory in Star Wars: The Old Republic. Gregory also provides the voice for Nomen Karr.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Harron_Tavus",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Havoc_Squad",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Jek_Kardan",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Lieutenant/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Great_Galactic_War",
  "/wiki/Jedi/Legends",
  "/wiki/Orgus_Din",
  "/wiki/Minos_Cluster_Campaign",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Balmorra/Legends",
  "/wiki/Satele_Shan",
  "/wiki/SP-99",
  "/wiki/Escape_pod/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Separatist_War",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Angral",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Fortris_Gall",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mandalorian_cruiser",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Zym",
  "/wiki/Dar%27Nala",
  "/wiki/Buryn",
  "/wiki/Dantooine/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Wookiee/Legends",
  "/wiki/Dalborra",
  "/wiki/Treason/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Zora",
  "/wiki/Vanto_Bazren",
  "/wiki/Bex_Kolos",
  "/wiki/Ryler_Dorant",
  "/wiki/Ando_Prime/Legends",
  "/wiki/ZR-57_orbital_strike_bomb",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Aric_Jorgan",
  "/wiki/Elin_Garza",
  "/wiki/Andrik",
  "/wiki/Cularin/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Shadow_Fist",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/General/Legends",
  "/wiki/Harrower-class_dreadnought",
  "/wiki/Justice_(Harrower-class)",
  "/wiki/Hyperspace/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Nomen_Karr",
  "/wiki/Star_Wars:_The_Old_Republic,_Threat_of_Peace",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/3643_BBY",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_1:_Treaty_of_Coruscant",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_2:_New_Galactic_Order",
  "/wiki/Standard_year/Legends",
  "/wiki/3653_BBY",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Voidhound"
 ]
}