{
 "name": "Hartell",
 "display_name": "Hartell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Officer Corps",
      "Imperial Security Bureau",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Hartell was a female human who served as a major in the Imperial Security Bureau of the Galactic Empire. Following a meeting where the select committee of Imperial High Command granted Lothal a contract to expand its naval facilities, Governor Arihnda Pryce of the planet thanked Senator Domus Renking for his help outside the meeting room. Shortly after, Hartell entered the committee building and arrested Renking for bribing Governor Sanz of Kintoni.\nA female human, Hartell was an officer of the Imperial Security Bureau during the reign of the Galactic Empire. Holding the rank of major, Hartell was sent to arrest Senator Domus Renking on Coruscant per the Security Bureau's suspicion of Renking's use of bribery.\nMajor Hartell entered the building in which Renking was located as Governor Arihnda Pryce of Lothal accompanied the senator out of the Imperial High Command select committee's audience chamber. The pair, having worked alongside one another in pursuit of expanding Lothal's Imperial naval facilities only moments prior, congratulated each other as they made for the building's exit. Hartell proceeded towards the pair as they did so when the agent's infamous white ISB uniform caught the attention of Governor Pryce, though the fledgling Imperial continued to converse with her political rival.\nUpon reaching Senator Renking, Hartell asked for confirmation of his identity, which Renking did so cautiously as he spotted the infamous white ISB uniform. The Security Bureau agent then identified herself and requested that the senator follow her. With a darkened face, Senator Renking asked for her intent as passerby began to slow, taking interest in the drama. Although Hartell questioned whether her quarry truly wanted to have such a discussion at the scene, the irritated senator, with a rising voice, countered the major's questions and demanded to know his alleged charge in addition to who the claimant was.\nTo this, Major Hartell briskly replied that the Bureau itself pressed a charge of bribery against Domus Renking. The Imperial Senate member expressed surprise, though the ISB agent continued to speak, retelling Senator Renking's private dealings and bribe with Governor Sanz of Kintoni. Taken aback, the worried senator insisted that the ordeal was born of lies, thinking that Sanz turned him over to the ISB, though Hartell interjected evenly, revealing that the ISB knew of this conspiracy from another source, and that Governor Sanz was already into custody for interrogation.\nWith Hartell's revelation, Senator Renking realized that his situation was the doing of Arihnda Pryce. Pryce denied her part, however, and gestured to Major Hartell, telling Renking that his bribery of Governor Sanz was caught on recording. Astounded by Pryce's betrayal, Renking gave his former associate a final look as Hartell dismissed her and led the senator out the building. As the ISB agent and Renking left, the crowd gathered around them dispersed and resumed their activities.\nHartell was dressed in a white ISB tunic.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Major",
  "/wiki/Select_committee_of_Imperial_High_Command",
  "/wiki/Lothal",
  "/wiki/Imperial_Navy",
  "/wiki/Governor",
  "/wiki/Arihnda_Pryce",
  "/wiki/Planet",
  "/wiki/Senator",
  "/wiki/Domus_Renking",
  "/wiki/Sanz",
  "/wiki/Kintoni",
  "/wiki/Officer",
  "/wiki/Imperial_Era",
  "/wiki/Coruscant",
  "/wiki/Governor_of_the_Lothal_sector",
  "/wiki/Imperial_High_Command",
  "/wiki/Agent",
  "/wiki/Color",
  "/wiki/Politics",
  "/wiki/Imperial_Senate",
  "/wiki/Thrawn_(novel)",
  "/wiki/Thrawn_(audiobook)"
 ]
}