{
 "name": "Hary'nkel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Synred Vols"
     ]
    }
   ]
  }
 ],
 "content": "Hary'nkel was a male Twi'lek Jedi Padawan who served the Jedi Order and the Galactic Republic during the final decades of the Republic Classic era.\nA Force-sensitive Twi'lek, Hary'nkel was trained in the ways of the Force by the Jedi Order at their academy on the planet Almas. Selected for further training as a Padawan under the guidance of Sullustan Jedi Master Synred Vols, they traveled around the Cularin system on missions for the local Jedi Council.\nIn about 31 BBY, Hary'nkel and his master were part of an expedition team which, under the guidance of Master Kirlocca, trekked into the wastelands on Almas. While in the wastes, several of their colleagues inexplicable came under the influence of the dark side of the Force and attacked Master Kirlocca. Rushing to defend the Councilor, Padawans Hary'nkel and Misha Quor-Din as well as Master Vols and another Jedi were rebuffed as they tried to fend off their deranged peers. Overcome and outnumbered, Master Vols sacrificed himself in an effort to allow Hary'nkel, Quor-Din and the other Jedi to escape over the nearby cliff. Leaping from the cliff, Hary'nkel broke his leg in the fall from the cliff and placed himself into a healing trance. He was discovered shortly afterward by the Heroes of Cularin and he explained to them what had happened.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Synred_Vols",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Planet/Legends",
  "/wiki/Almas",
  "/wiki/Sullustan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Cularin_system",
  "/wiki/Almas_Council",
  "/wiki/31_BBY/Legends",
  "/wiki/Kirlocca",
  "/wiki/Almas_Wasteland",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Misha_Quor-Din",
  "/wiki/Force_healing/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Desert_Cries"
 ]
}