{
 "name": "Hask",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation"
     ]
    }
   ]
  }
 ],
 "content": "Viceroy Hask was a Neimoidian male who led the Trade Federation in the years prior to the Stark Hyperspace War in 44 BBY. He helped arrange a bacta shortage on the planet Thyferra, with the intention of raising demand and thereby increasing profits. The result was that bacta transports came under attack by pirates of the Stark Commercial Combine.\nHask's involvement in the scheme was discovered by the Jedi Tholme and Quinlan Vos while he met with co-conspirator Adol Bel of the Xucphra Corporation. That information was later utilized by Jedi Master Mace Windu to blackmail Hask and Trade Federation Senator Nute Gunray into providing ships to rescue embattled Galactic Republic forces on the planet Troiken. Gunray was credited for the intervention and eventually succeeded Hask as viceroy.\nHask was a Neimoidian male who served as viceroy of the Trade Federation as well as its representative to the planet Thyferra in the years prior to 44 BBY. That year, Hask and other members of the Neimoidian leadership of the Trade Federation formed an alliance with Adol Bel of the Xucphra Corporation, a producer of the medical substance bacta on Thyferra. Along with the pirate Iaco Stark, they planned to manufacture a bacta shortage by sabotaging a processing plant for alazhi, a key ingredient in bacta. The plan lowered the availability of bacta to the Galactic Republic and raised its price, thus improving the Trade Federation's profits as planned.\nStark and his organization, the Stark Commercial Combine, foiled Hask's plans by attacking bacta-carrying transports and selling their bacta contents at a lower rate than the Trade Federation. Members of the Jedi Order found the shortage suspicious, leading Jedi Master Tholme and his Padawan, Quinlan Vos, to travel to Thyferra to investigate. Concurrently, Republic forces, including several Jedi, were besieged by Stark's forces on the planet Troiken after negotiations with the Stark Commercial Combine failed, beginning the Stark Hyperspace War. The Republic was unable to provide ships to rescue them due to a virus Stark had prepared that sabotaged their navcomputers, rendering hyperspace travel unpredictable.\nOn Thyferra, Tholme and Vos overheard a meeting between Hask and Bel, where the latter was enraged that Stark's virus had disrupted their plans as the Xucphra Corporation could not safely transport the bacta they were concealing. Hask insisted that the Trade Federation was not to blame for Stark's actions, while Bel continued to complain and worried that the galaxy would turn on the company if its denizens discovered the conspiracy. Hask reminded Bel that it was his responsibility to keep their secrets safe, for he had heard that Jedi were investigating. Bel told him not to worry as there were HKB-3 hunter-killer droids on patrol and tried to focus the conversation on how they could transport bacta without using hyperdrives.\nAlthough they encountered the droids, Tholme and Vos escaped Thyferra and shared their discovery with the Jedi High Council. To relieve those left on Troiken, Jedi Master Mace Windu met with Hask and Trade Federation senator Nute Gunray on the planet Coruscant. The Jedi revealed that he knew about their involvement in the shortage and intimidated them into providing cruisers unaffected by the virus from the Trade Defense Force in exchange for concealing their role. Gunray received credit for the Trade Federation's contributions at the Fifth Battle of Qotile—the final battle of the war—which played a role in his ascension to Hask's position of viceroy.\nHask was willing to artificially force a bacta shortage to increase profits at the expense of the lives lost in the subsequent pirate attacks and the loss of bacta amongst poorer communities throughout the galaxy. In his meeting with Bel, Hask assured his co-conspirator that the Trade Federation was not responsible for damage Stark inflicted on their plans. He also reminded Bel of his role in keeping their malfeasance secret, especially from the Jedi. Hask had green skin and red eyes.\nHask wore purple robes with a blue collar and a purple headdress. During his meeting with Bel, he sat in a mechno-chair.\nHask appeared in flashbacks in the thirty-seventh issue of the 1998 Star Wars comic-book series. The issue, which was the second part of The Stark Hyperspace War arc, was written by John Ostrander, illustrated by Davidé Fabbri, and published by Dark Horse Comics on December 19, 2001. Hask's entry in the 2008 The Complete Star Wars Encyclopedia stated that his plans to profit from the bacta shortage were foiled by Stark's attacks, while Adol Bel's entry states that Hask, Bel, and Stark arranged the shortage together. This article assumes that Stark was involved in the shortage but betrayed Hask and Bel afterwards.\nFurthermore, the 2009 reference book The Essential Atlas by Jason Fry and Daniel Wallace stated that the bacta thefts were created as a ruse between the Trade Federation viceroy and Stark. Hask was assumed to be the viceroy upon the creation of his article on Wookieepedia, the free-to-edit and unofficial online Star Wars encyclopedia, in 2006, but his rank was only canonically confirmed in 2012's The Essential Guide to Warfare by Fry and Paul R. Urquhart. On the other hand, the comic arc portrays the attacks on bacta transports as legitimate. This article follows the comic's version of events.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Hask_(disambiguation)",
  "/wiki/The_Essential_Atlas",
  "/wiki/Star_Wars:_Republic:_The_Stark_Hyperspace_War",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Neimoidian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Trade_Federation_Viceroy",
  "/wiki/Standard_year/Legends",
  "/wiki/Stark_Hyperspace_War/Legends",
  "/wiki/44_BBY/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Thyferra/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Stark_Commercial_Combine",
  "/wiki/Mission_to_Thyferra",
  "/wiki/Jedi/Legends",
  "/wiki/Tholme/Legends",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Adol_Bel",
  "/wiki/Xucphra_Corporation",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/Captor-class_heavy_munitions_cruiser",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Troiken/Legends",
  "/wiki/Viceroy/Legends",
  "/wiki/Iaco_Stark",
  "/wiki/Alazhi/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Tionese_program",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/HKB-3_hunter-killer_droid",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Trade_Defense_Force",
  "/wiki/Fifth_Battle_of_Qotile",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Mechno-chair/Legends",
  "/wiki/Star_Wars_(1998)_37",
  "/wiki/1998",
  "/wiki/Star_Wars:_Republic",
  "/wiki/Star_Wars_comic_books",
  "/wiki/John_Ostrander",
  "/wiki/David%C3%A9_Fabbri",
  "/wiki/Dark_Horse_Comics",
  "/wiki/December_19",
  "/wiki/2001",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2009",
  "/wiki/Jason_Fry",
  "/wiki/Daniel_Wallace",
  "/wiki/Wookieepedia",
  "/wiki/Star_Wars",
  "/wiki/2006",
  "/wiki/Canon",
  "/wiki/2012",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Paul_R._Urquhart",
  "/wiki/Category:Images_of_Hask",
  "/wiki/39_BBY/Legends",
  "/wiki/36_BBY/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/30_BBY/Legends",
  "/wiki/Star_Wars_(1998)_36",
  "/wiki/Star_Wars_(1998)_39",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Time/Legends",
  "/wiki/Alaris_Prime_colonial_war",
  "/wiki/Alaris_Prime/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Mission_to_Mustafar/Legends",
  "/wiki/Mustafar/Legends"
 ]
}