{
 "name": "Hat_Lo",
 "display_name": "Hat Lo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Hat Lo was a human male crime lord who visited the Outlander Club on the planet Coruscant in 22 BBY with his consort and slave, Ayy Vida. While there, he availed himself of the private bar of the Baath brothers, who owned the club. Shortly after visiting the club, Lo boarded the AA-9 Freighter-Liner Jendirian Valley, which departed from Coruscant and traveled to the planet Naboo.\nHat Lo was a human male crime lord who was on the rise in 22 BBY, but not yet important enough to irritate or interest criminal syndicates like the Black Sun. On one cold and rainy night that year, Lo and his enslaved Twi'lek consort, Ayy Vida, took refuge in the warm and welcoming glow of the neon lights in the Outlander Club in the Uscru District of the planet Coruscant.\nThe club was already falling out of favor with the more daring members of the fashionable elite, but Lo's assiduous presence marked the the kind of clientele that began to be found at the club. Such was Lo's ascent over the owners of the club, the Baath brothers, that he availed himself of their private bar while Vida spoke with Achk Med-Beq, one of Lo's associates, and then entertained clients of the crime lord.\nShortly after visiting the club, Lo boarded the AA-9 Freighter-Liner Jendirian Valley, which departed from Coruscant's Westport carrying refugees and freighter trampers and traveled to the Mid Rim planet Naboo. During the journey, Lo sat in the hold of the freighter near the Jedi Anakin Skywalker and Senator Padmé Amidala, who were traveling incognito disguised as refugees.\nHat Lo had brown hair, light skin and blue eyes.\nHat Lo wore a floor-length blue robe with a very high collar.\nHat Lo appeared in the prequel trilogy film Star Wars: Episode II Attack of the Clones, which was released on May 16, 2002. In the current Star Wars canon, Hat Lo was first identified in the 2016 reference book Star Wars: Complete Locations.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Hat_Lo",
  "/wiki/Hat_Lo/Legends",
  "/wiki/Lo_(disambiguation)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Crime_lord",
  "/wiki/Outlander_Club",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/22_BBY",
  "/wiki/Slavery",
  "/wiki/Ayy_Vida",
  "/wiki/Baath_brothers",
  "/wiki/AA-9_Freighter-Liner",
  "/wiki/Jendirian_Valley",
  "/wiki/Naboo",
  "/wiki/Black_Sun",
  "/wiki/Water",
  "/wiki/Standard_day",
  "/wiki/Standard_year",
  "/wiki/Twi%27lek",
  "/wiki/Uscru_District",
  "/wiki/Achk_Med-Beq",
  "/wiki/Westport",
  "/wiki/Freighter_tramper",
  "/wiki/Mid_Rim",
  "/wiki/Freighter",
  "/wiki/Jedi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Robe",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/May_16",
  "/wiki/2002",
  "/wiki/Star_Wars",
  "/wiki/2016",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Category:Images_of_Hat_Lo",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Coruscant_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_50",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition"
 ]
}