{
 "name": "Hath Monchar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Neimoidia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "32 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation"
     ]
    }
   ]
  }
 ],
 "content": "Hath Monchar was a male Neimoidian Deputy Viceroy of the Trade Federation from the planet Neimoidia, between the years 33 and 32 BBY. Though initially one of Nute Gunray's key advocates, he eventually betrayed both his organization and its concealed ally, Darth Sidious, by foolishly attempting to sell information on their schemes to the highest bidder, a folly that would inevitably cost Monchar his life.\nIn 33 BBY, Hath Monchar alongside the like-minded Settlement Officer Rune Haako and captain Daultay Dofine had been welcomed into Viceroy Nute Gunray small inner circle and was thus one of the very few to be aware of the shaddy pact between the Trade Federation and the Sith. Together with the mysterious Sith Lord Darth Sidious, Monchar and his peers conspired to ensure Gunray's ascension as sole head of their organization, which would would allow them in turn to strengthen their own positions as the latter's prime supporters.\nFollowing the deaths of the members of the Trade Federation Directorate untraceably orchestrated by Sidious, Gunray became the unquestioned leader of the organization and placed Monchar and his other associates in the vacant seats of power. Later, however, the Deputy Viceroy would grow dissatisfied with the Federation's gullible gradual adherence to the dictates of the Sith and seemingly how it morphed their business into a war machine. Monchar ultimately betrayed Darth Sidious and Nute Gunray when he fled the latter's flagship, Saak'ak, with a Sith holocron storing intel about the upcoming Invasion of Naboo, foolishly hoping to make a fortune by selling it to the highest bidder.\nThe former Deputy Viceroy's treachery did not go unobserved and it attracted attention from both the Trade Federation and the Sith, both parties trying to retrieve the holocron and prevent him from spilling their secret plans. To this end, Darth Sidious sent his apprentice, Darth Maul, to track and hunt down Monchar as well as any of his contacts, therefore tying up all loose ends.\nMonchar attempted to sell the holocron to Darnada, a Black Sun vigo, in the Deep Space Demolition and Removal space station. Though granted an audience, the Dug crime lord laughed him off, disbelieving the Neimoidian's claims. Luckily for Monchar, he left Darnada immediately before Darth Maul himslef arrived to slaughter Darnada and his entire operation except Asa Naga who managed to escape and warn Alexi Garyn of the assassin - all part of another concurrent scheme of Darth Sidious.\nWeeks or months after the incident, Monchar went into hiding on Coruscant, where he attempted to sell the holocron to information broker Lorn Pavan, sending him a message and requesting that they meet at the Dewback Inn. When Lorn came before him and his bodyguard, a Trandoshan named Gorth, the Neimoidian revealed the nature of the valuable commodity he was in possession of and demanded that the former come at his cubicle in one hour to pay him 500,000 credits , or else he would find a more generous bidder.\nIn the hopes of silencing Monchar before Darth Sidious could discover the turncoat, Nute Gunray had Rune Haako hire bounty hunter Mawhi Lhinn to apprehend the rogue Neimoidian. Unknown to the two snivelling dignitaries, Darth Maul had finally tracked the ex-Deputy Viceroy to his domicile, where he proceeded to slaughter Gorth and two Quarren henchmen, before beheading Monchar himself while suspending him in the air with the Force - ultimately the Zabrak Sith warrior would complete his mission and recover the holocron for his Master.\nLike many of his kind, Hath Monchar was greedy and power-hungry, traits highly sought by Nute Gunray with whom he ingratiated himself, becoming one of the latter's closest underlings. He was not above throwing in with Darth Sidious to advance both his superior's and his own career, although only half-heartedly being as apprehensive of this mysterious ally similar to his colleagues. Though the Neimoidians' collaboration with their Sith patron yielded profitable results, Monchar would eventually turn on both Sidious and Gunray in an attempt to enrich himself through selling the holocron; he also claimed that he thought that members of his species were not supposed to be conquerors, but humble and successful traders. But Monchar was naive as well, for in spite of witnessing the extent of Sidious' grasp with the demise of the Trade Federation's governing board he honestly believed he could get away without suffering the consequences of earning the Dark Lord's ire.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Hath_Monchar",
  "/wiki/Cloak_of_Deception",
  "/wiki/Darth_Maul:_Saboteur",
  "/wiki/Neimoidia/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Jurnel_Arrant",
  "/wiki/Deputy_Viceroy",
  "/wiki/Planet/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Settlement_Officer/Legends",
  "/wiki/Rune_Haako/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Daultay_Dofine/Legends",
  "/wiki/Trade_Federation_Viceroy",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Trade_Federation_Directorate",
  "/wiki/Saak%27ak/Legends",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Darnada",
  "/wiki/Black_Sun/Legends",
  "/wiki/Vigo/Legends",
  "/wiki/Deep_Space_Demolition_and_Removal",
  "/wiki/Space_station/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Asa_Naga",
  "/wiki/Alexi_Garyn",
  "/wiki/Holocron/Legends",
  "/wiki/Lorn_Pavan",
  "/wiki/Dewback_Inn",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gorth_(Trandoshan)",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Mawhi_Lhinn",
  "/wiki/Kaldani_Spires_Residential_Apartments",
  "/wiki/Quarren/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Sith_Warrior",
  "/wiki/Sith_Master/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Hath_Monchar",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/Darth_Maul_(2000)_2",
  "/wiki/Darth_Maul:_Shadow_Hunter",
  "/wiki/End_Game",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/2012",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_6",
  "/wiki/The_Official_Star_Wars_Fact_File_13",
  "/wiki/The_Official_Star_Wars_Fact_File_16",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Phantom_Menace:_The_Expanded_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_21",
  "/wiki/The_Essential_Atlas",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_33",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}