{
 "name": "Haxim",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Falleen"
     ]
    },
    {
     "name": "Died",
     "values": [
      "7 BBY",
      "Falleen"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Falleen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "King Haxim, a Falleen male, was a member of House Sizhran and a provincial leader on his homeworld of Falleen before the Battle of Yavin. He sired two daughters and a single son, Xizor, whom Haxim groomed as heir to the throne. However, Xizor left Falleen to quench his wanderlust and never returned.\nIn 7 BBY, Haxim's previously flourishing Haxim's province was contaminated with an incurable flesh-eating bacterium after a mishap in a local Imperial biological weapons laboratory. The bacterium spread throughout the region, infecting natives and ravaging lands. Haxim calmly waited in his royal gardens, knowing death was inevitable; he only hoped that Xizor could avenge him. Haxim perished along with the majority of House Sizhran and the region's two hundred thousand inhabitants after Darth Vader ordered an orbital bombardment to contain the bacterium.\nHaxim was a Falleen male native to the planet of the same name, a member of the royal House Sizhran. Falleen was divided into a series of independent provincial kingdoms, which traded with each other but avoided conflict. Haxim was the ruler of one such kingdom, a flourishing region of around 200,000 inhabitants; he and his queen had three children, two daughters and a son named Xizor. Haxim resided in a palace just outside his region's main city, often spending time in the royal gardens.\nAs Haxim's only son, Xizor was the heir to the throne and was groomed to succeed his father. Like all Falleen princes, Xizor left his isolationist homeworld on a pilgrimage into the wider galaxy; it was hoped that such a pilgrimage would give an heir the skills required to govern his kingdom when the requisite time came. Xizor's pilgrimage, however, became permanent, and he never returned to Falleen in Haxim's lifetime; the young prince became enamored with his offworld lifestyle, joining the Black Sun criminal organization.\nAfter the creation of the Galactic Empire and the Declaration of a New Order, Darth Vader, Emperor Palpatine's enforcer, established a bacteriological research outpost in Haxim's capital city. In 7 BBY, after a laboratory mishap, a toxic, flesh-eating bacterium escaped the lab. It swiftly spread throughout the city, infecting and necrotizing Haxim's subjects; discord reigned in the city, with mass riots and violence. Haxim, sitting in his palace gardens, was informed of the disaster by heralds who had been to the city and seen first-hand the unstoppable effects of the deadly virus. Before long, the bacterium had infected the heralds, as well as numerous other palace staff, leaving Haxim alone in the gardens.\nHaxim knew that death was inevitable, and opted to remain calmly in the palace gardens, rather than vainly trying to escape. He did not want to survive if his kingdom did not. Haxim knew that if he did not perish from the virus, he would be killed by Imperial attempts to neutralize the virus and stop its dissemination via orbital bombardment. Haxim only hoped that Xizor, still offworld, could avenge the ruin of his native region and the death of his family members. As the king predicted, the Imperials, by the order of Darth Vader, instigated an orbital bombardment upon the Imperial lab and everything within a forty-kilometer radius, hoping to save billions of lives at the cost of thousands; the green turbolasers were Haxim's last sight.\nHaxim was incinerated, along with his wife, daughters, and practically every other member of House Sizhran. Haxim's great-niece Savan and Prince Xizor, both offworld, were the only survivors from Haxim's family. Total casualties were approximately 200,000 Falleen. As Haxim hoped, Xizor took to the task of revenge with zeal; he distanced himself from the disaster, erasing all Imperial records that connected him to House Sizhran, and began to plot his revenge against Vader immediately. A separate revenge plot, instigated by Zuur and Xora, was foiled by Vader in 0 ABY. Xizor ultimately failed in his own attempt: he died on Coruscant in 3 ABY, incinerated on Vader's command in the same vein as his father had been a decade prior.\nHaxim was a proud king, loyal to his domain and his people. He loved nature, spending much time in his royal gardens, basking in tranquility. Haxim hoped that his son would succeed him and groomed Xizor for the throne. He was dismayed by news of anarchy and infection among his subjects, and did not want to rule a mutilated kingdom. Haxim was calm and composed in the face of crisis; after being informed of the rampaging bacterium by his heralds, he remained in his gardens, contemplating the situation and waiting for his inevitable death, rather than trying to avoid it.\nXizor's father was first mentioned in Steve Perry's Shadows of the Empire novel, without being named. He was later named in The King's Requiem, a vignette featured in the Shadows of the Empire Sourcebook, written by Peter Schweighofer and published in 1996. He has received subsequent mention in Daniel Wallace's The New Essential Guide to Characters, The Official Star Wars Fact File and The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/West_End_Games",
  "/wiki/The_Treasure_of_Celis_Mott",
  "/wiki/Instant_Adventures",
  "/wiki/Falleen_(planet)/Legends",
  "/wiki/7_BBY/Legends",
  "/wiki/Falleen/Legends",
  "/wiki/Gender/Legends",
  "/wiki/King/Legends",
  "/wiki/House_Sizhran",
  "/wiki/Homeworld/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Xizor%27s_sister",
  "/wiki/Xizor%27s_second_sister",
  "/wiki/Xizor/Legends",
  "/wiki/Haxim%27s_province",
  "/wiki/Flesh-eating_bacterium",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Haxim%27s_royal_gardens",
  "/wiki/Death/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Xizor%27s_mother",
  "/wiki/Haxim%27s_palace",
  "/wiki/Haxim%27s_city",
  "/wiki/Prince/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Bacteriological_research_outpost",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Turbolaser/Legends",
  "/wiki/Savan",
  "/wiki/Zuur",
  "/wiki/Xora",
  "/wiki/0_ABY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Steve_Perry",
  "/wiki/Shadows_of_the_Empire_(novel)",
  "/wiki/The_King%27s_Requiem",
  "/wiki/Shadows_of_the_Empire_Sourcebook",
  "/wiki/Peter_M._Schweighofer",
  "/wiki/1996",
  "/wiki/Daniel_Wallace",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Shadows_of_the_Empire_(audiobook)",
  "/wiki/Shadows_of_the_Empire_(junior_novelization)",
  "/wiki/The_Mandalorian_Armor",
  "/wiki/Slave_Ship",
  "/wiki/The_Secrets_of_Star_Wars:_Shadows_of_the_Empire",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Official_Star_Wars_Fact_File_69",
  "/wiki/The_Official_Star_Wars_Fact_File_81",
  "/wiki/Star_Wars_Insider",
  "/wiki/Underworld:_A_Galaxy_of_Scum_and_Villainy",
  "/wiki/Star_Wars_Insider_89",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/The_Lesser_Evil",
  "/wiki/Empire_19"
 ]
}