{
 "name": "Haydnat Treen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kuat"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 37 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Senate",
      "Imperial Senate",
      "Galactic Federation of Free Alliances",
      "Galactic Alliance Senate",
      "Galactic Alliance Senate",
      "Imperial Remnant",
      "Lecersen Conspiracy"
     ]
    }
   ]
  }
 ],
 "content": "Haydnat Treen was a female Human who served as Senator of Kuat and the Kuat sector for many years, starting at the beginning of the Galactic Empire's reign until 44 ABY. In the first years of the Galactic Empire she served for one year as a senator in the Imperial Senate.\nDuring the Unification Summit, she orchestrated a kidnap attempt to remove Jagged Fel as head of the Imperial Remnant. The attempt failed as Fel managed to set off the alarm within the embassy and defeated Treen's stormtroopers. He later told his fiancée, Jaina Solo, that he suspected the Moffs but didn't suspect Moff Drikl Lecersen was behind it, despite his obvious attempts to overthrow Fel.\nLecersen, who was more a cautious plotter than an opportunist, led his investigation into who was behind the attempt. After removing any thoughts of suspicion on the other Moffs, he tracked several transactions through a Borleias bank which led him back to Senator Treen. He met Treen and asked her why she had tried to have Fel kidnapped. She revealed that the attempt was only one part of a larger plot to unify the Galactic Alliance and the Imperial Remnant into a new Galactic Empire with Lecersen as Emperor.\nAt the Kuat Embassy, Treen revealed her plans to Lecersen. She wanted to have Lecersen replace Fel, even temporarily, as Head of State in time so as to preside over the Imperial reunification with the Galactic Alliance, giving him all the credit and making him the second most powerful being in the galaxy, next to the Chief of State of the Galactic Alliance. The next step was to oust Galactic Alliance Chief of State Natasi Daala. For this she planned to use the Emergency Powers Act that the Senate had set up after the Second Galactic Civil War. The act declared that the Chief of State could not suspend the Senate and that the Appropriations and Disbursements Committee could freeze the government budget, therefore blocking the Chief of State's powers. Treen planned to manipulate the political crisis that followed, which she planned to use to force Daala to invoke the act. Treen believed that the public backlash would force her to resign and be replaced by the Imperial leader, whom by then would be Lecersen.\nSenator Fost Bramsin of Coruscant and the Chiefs of the Alliance Armed Forces already supported Treen's conspiracy. Lecersen asked her what she wanted in return; she said that she wanted to be made the new Grand Moff of the Coruscant sector and four dinners with him—hopefully enough to get him to propose to her which would make her his Empress.\nThe conspirators arranged a staged assassination attempt on Fel as he dined with the Solo family at the Pangalactus restaurant. As Lecersen had planned, the attack failed, and the Solos believed that Daala planned the attack.\nThe conspirators continued to plot an overthrow of Daala and were about to execute it when the Jedi enacted their own coup which was more powerful. By then, Treen knew that their plans would be in complete ruin if they did not adapt. She made a deal with the Jedi, which made the Triumvirate, led by Saba Sebatyne representing the Jedi, General Jaxton representing the Galactic Alliance Defense Force, and herself, representing the Senate. With this adaptation, the plans continued to eventually restore the Empire in her dream.\nAlthough Jaxton was later replaced by Wynn Dorvan as a member of the triumvirate, the conspiracy's plans continued unhindered, and they even brought in a new member in the form of fledgling Senator Kameron Suldar, secretly the Sith Lord Ivaar Workan. However, when Daala, who had escaped prison thanks to Boba Fett, figured out about Lecersen's involvement with the Freedom Flight and his membership in the conspiracy, she blackmailed him into joining her quest to take over the Imperial Remnant. Later, when Treen realized that something was wrong when Lecersen went missing, she quickly informed another conspiracy member, General Stavin Thaal, that they need to disband what they were doing. So Treen decided to kill a fellow conspiracy member, Coruscanti Senator Fost Bramsin, while making it look like he died of old age before she retired back to Kuat. The rest of the conspiracy fell apart as Thaal later forced Jaxton to commit suicide and Parova was killed by members of the Lost Tribe of Sith in order to frame ex-Jedi fugitive Tahiri Veila.\nFollowing the Galactic Alliance and Jedi Order's defeat of Abeloth and the Sith, Treen's involvement with the conspiracy became publicly known.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kuat/Legends",
  "/wiki/37_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Senate/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Senate",
  "/wiki/Imperial_Remnant",
  "/wiki/Lecersen_Conspiracy",
  "/wiki/Senator/Legends",
  "/wiki/Kuat_sector/Legends",
  "/wiki/44_ABY",
  "/wiki/Unification_Summit",
  "/wiki/Kidnap_attempt_in_the_Galactic_Empire_Embassy_Complex",
  "/wiki/Jagged_Fel",
  "/wiki/Head_of_State/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Moff/Legends",
  "/wiki/Drikl_Lecersen",
  "/wiki/Borleias/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Kuat_Embassy",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Emergency_Powers_Act_(Galactic_Alliance)",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Appropriations_and_Disbursements_Committee",
  "/wiki/Fost_Bramsin",
  "/wiki/Coruscant/Legends",
  "/wiki/Galactic_Alliance_Defense_Force",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Coruscant_sector",
  "/wiki/Operation_Duusha",
  "/wiki/House_of_Solo",
  "/wiki/Pangalactus",
  "/wiki/Jedi/Legends",
  "/wiki/Saba_Sebatyne",
  "/wiki/General/Legends",
  "/wiki/Senate",
  "/wiki/Wynn_Dorvan",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Ivaar_Workan",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Freedom_Flight",
  "/wiki/Stavin_Thaal",
  "/wiki/Coruscanti/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Tahiri_Veila",
  "/wiki/Abeloth",
  "/wiki/Fate_of_the_Jedi:_Backlash",
  "/wiki/Fate_of_the_Jedi:_Backlash_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)",
  "/wiki/Cal_Omas",
  "/wiki/28_ABY/Legends",
  "/wiki/40_ABY",
  "/wiki/Cha_Niathal",
  "/wiki/Darth_Caedus",
  "/wiki/41_ABY",
  "/wiki/Merratt_Jaxton",
  "/wiki/Padnel_Ovin",
  "/wiki/Rokari_Kem",
  "/wiki/Gial_Gahan",
  "/wiki/Nu_Toreena",
  "/wiki/Bail_Antilles_(Galactic_Alliance)",
  "/wiki/130_ABY",
  "/wiki/Gar_Stazi",
  "/wiki/Giddean_Danu/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Viqi_Shesh",
  "/wiki/43_ABY",
  "/wiki/Triumvirate_(Galactic_Alliance)"
 ]
}