{
 "name": "Hazram Namir's father",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 4 BBY and 0 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "The father of Hazram Namir was a human male who lived on the planet Crucival. He had formally fought clone troopers of the Galactic Republic back in the Clone Wars but retired from fighting after the Republic came out victorious. After Crucival fell into conflict between multiple factions, Namir's father warned Namir not to join them. Namir, though, ran away to join the Malkhanis. At least two years later, Namir bumped into his father again, who told him he could come home again. Namir declined, and his father left. He was later stabbed in the chest by a child and died.\nThe father of the human male Hazram Namir fought against the Galactic Republic's clone troopers during the Clone Wars. After the Republic won the war and was reorganized into the Galactic Empire in 19 BBY, Namir's father then retired and lived with Namir at their home on the Outer Rim planet Crucival. He told his son about the clone troopers and how the soldiers were made in batches by the Republic. Despite one side winning the Clone Wars, Crucival fell into conflict between factions that derived from the victors.\nBy the year 6 BBY, a clan named the Malkhanis, led by Warlord Malkhan, were rising in strength. Namir was warned by his father that the new faction was like every other competitor in Crucival's power struggle and would not prevail. However, after the Malkhanis' cheering could be heard from the cold confines of their home, and Namir was swayed into leaving to join the clan.\nWithin the following two years, Namir's father learned of the Malkhanis' collapse following Malkhan's death. Namir himself became a part of the Opaline Creed, a religious faction present at the settlement Templemarch. In 4 BBY, Namir's father spotted his son travelling towards Templemarch and called his name, putting his hand on Namir's shoulder. Namir impulsively elbowed his father in self-defense.\nNamir's father followed his son as he kept walking and asked him about the fall of the Malkhanis. When Hazram refused to stop for him, he then offered to hide him from the Creed. However, Namir compared the luxuries the Creed offered to his old life with his father and refused him. Namir's father walked away, never to see Hazram again. Namir's father was later stabbed in the chest by a child. Hazram learned of it sometime prior to his departure from Crucival in 0 BBY. Namir felt an emptiness upon learning of his father's death.\nHazram Namir's father was broad-shouldered and bald with a face that was leathery skinned.\nNamir's father wore a vest and shirt which was worn and patched with leather scraps.\nHazram Namir's father appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/4_BBY",
  "/wiki/0_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Hazram_Namir",
  "/wiki/Planet",
  "/wiki/Crucival",
  "/wiki/Clone_trooper",
  "/wiki/Galactic_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Parent",
  "/wiki/Malkhanis",
  "/wiki/Standard_year",
  "/wiki/Galactic_Empire",
  "/wiki/19_BBY",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Cloning",
  "/wiki/Trooper",
  "/wiki/Soldier",
  "/wiki/6_BBY",
  "/wiki/Warlord",
  "/wiki/Malkhan",
  "/wiki/Death",
  "/wiki/Opaline_Creed",
  "/wiki/Templemarch",
  "/wiki/2015",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Tion_Hegemony",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Malkhani_Insurrections"
 ]
}