{
 "name": "Heater  (henchman)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Heater was a high-ranking male henchman of Jabba the Hutt in Mos Eisley. He was fat and grotesque and therefore often posed as Jabba for public functions. He also operated a small luxury cruise business on Tatooine that capitalized on Luke Skywalker's infamy after the Battle of Yavin. His sail barge, Dune Princess, was constructed to be nearly identical to Jabba's personal sail barge Khetanna, though he made sure to keep it smaller as a point of respect to the Hutt. Jabba ordered that Heater hire bounty hunters to pursue Han Solo after the death of Greedo.\nIn the radio adaptation of A New Hope, a scene is included where Heater  confronts Han Solo at Docking Bay 94. This scene is very similar to the scenes deleted from the film with Declan Mulholland playing a Human \"Jabba\", as well as a scene with \"Jabba the Hut\"  in Star Wars  2. After the 1997 release of the \"Special Editions\" retconned these scenes to feature Jabba himself, these scenes were removed from canon.\nHeater is most likely the same character as the Fat Man from Timothy Zahn's Sleight of Hand: The Tale of Mara Jade, as their characterizations and backstory are identical. Heater appeared in The Essential Guide to Characters in November 1995 and the Fat Man was published in Tales from Jabba's Palace two months later, in January 1996. Andy Mangels, writer of the Essential Guide, has said that he drew information from manuscripts and novels that were not yet published, and given that another character conceived by Zahn appeared in the guide, it's extremely likely that some level of coordination occurred and the matching descriptions of Heater and the Fat Man aren't mere coincidence.\nIt has been speculated by some fans that since the early Marvel Star Wars appearances of Jabba the Hutt were based on Mosep Binneed, a Nimbanel later identified as Jabba's accountant, \"Heater\" and \"Jabba the Hut\" were actually aliases used by Binneed. It has also been speculated that Heater was a Human who resembled the \"Human Jabba\" portrayed by Mulholland. Mulholland's likeness was later used on the 2013 Topps Star Wars Illustrated: A New Hope trading cards that featured Heater. Previously, his appearance in the deleted scene had been used as the physical description of a different character, Opun Mcgrrrr.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Heater",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Heater_(henchman)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Dune_Princess",
  "/wiki/Khetanna/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Greedo/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Heater_(henchman)",
  "/wiki/Star_Wars_(radio)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Joel_Brooks",
  "/wiki/Docking_Bay_94/Legends",
  "/wiki/Declan_Mulholland",
  "/wiki/Star_Wars_(1977)_2",
  "/wiki/1997",
  "/wiki/List_of_changes_in_Star_Wars_re-releases",
  "/wiki/Retcon",
  "/wiki/Canon",
  "/wiki/The_Fat_Man",
  "/wiki/Timothy_Zahn",
  "/wiki/Sleight_of_Hand:_The_Tale_of_Mara_Jade",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/November",
  "/wiki/1995",
  "/wiki/Tales_from_Jabba%27s_Palace",
  "/wiki/January",
  "/wiki/1996",
  "/wiki/Andy_Mangels",
  "/wiki/Melina_Carniss",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Mosep_Binneed/Legends",
  "/wiki/Nimbanel/Legends",
  "/wiki/2013_Topps_Star_Wars_Illustrated:_A_New_Hope",
  "/wiki/Opun_Mcgrrrr",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Galaxywide_NewsNets",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/A_Guide_to_the_Star_Wars_Universe",
  "/wiki/Live-Action_Adventures",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/TheForce.net",
  "/wiki/July_31",
  "/wiki/1999",
  "/wiki/July_30",
  "/wiki/2019"
 ]
}