{
 "name": "Hedala_Fardi",
 "display_name": "Hedala Fardi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Thabeska"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fardi clan"
     ]
    }
   ]
  }
 ],
 "content": "Hedala Fardi was a Force-sensitive human female living on the planet Thabeska during the first year of the Galactic Empire. She was four years old and the youngest member of a branch of the Fardi clan, a wealthy smuggler family on Thabeska. Hedala was Force-sensitive, and able to sense danger from afar.\nWhile the Togruta former Jedi Padawan Ahsoka Tano was working as a mechanic and courier pilot for the Fardis, she befriended Hedala. Although most people could not distinguish between the various female cousins of Hedala's branch of the Fardi clan, everyone remembered Hedala. Her sister Chenna joked that this meant that Hedala would not be successful in a life of crime. Hedala's Force talents also made her extremely good at many of the games she played with her cousins, including a throwing game. Her cousins became so used to it that they didn't find anything unusual about her skill.\nTwo months before the one-year anniversary of Supreme Chancellor Sheev Palpatine's ascension as Galactic Emperor, Tano was working on one of the Fardis' droids when she saw several of the youngest Fardi cousins, including Hedala, playing in the shipyard, which they weren't allowed to do. Tano was about to shoo them away when a stack of crates the children were playing on began to fall, so she used the Force to save the children's lives. The other children did not realize what had happened, but Tano saw Hedala, who was too young to be included in the game, watching with a fascinated look on her face. Tano was certain that Hedala was the only one who had seen and understood what she had done, and three days later, she saw Hedala use telekinesis to move a small stone.\nShortly after the Empire Day festivities, when Tano had left Thabeska in an attempt to avoid Imperial attention, Hedala sensed a \"shadow\" in the Force, which turned out to be the Inquisitor known as the Sixth Brother. The Sixth Brother had come to Thabeska after receiving reports of a Force-sensitive on the planet, but he was not strong enough in the Force to track it to its source, resulting in him leaving. When Tano returned after briefly leaving the moon of Raada, Hedala later confided in Tano, who advised her to stay away from the \"shadow\" should she sense it again. Tano later told Hedala's uncle Fardi to safeguard the youngest of the clan because she was \"special\", which he understood to mean she could use the Force. Hedala was saddened by Tano's departure.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Hedala_Fardi",
  "/wiki/Thabeska",
  "/wiki/22_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Fardi_clan",
  "/wiki/Force-sensitive",
  "/wiki/Planet",
  "/wiki/Standard_year",
  "/wiki/Galactic_Empire",
  "/wiki/Smuggler",
  "/wiki/Togruta",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Chenna_Fardi",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Emperor",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Empire_Day",
  "/wiki/Parade",
  "/wiki/Inquisitorius",
  "/wiki/Sixth_Brother",
  "/wiki/Moon",
  "/wiki/Raada",
  "/wiki/Fardi",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Ahsoka_(audiobook)",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Reproduction"
 ]
}