{
 "name": "Heert",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Heert was a human male Imperial officer who served as an Attendant of the Imperial Security Bureau of the Galactic Empire during the Imperial Era. Heert served as the assistant to ISB Supervisor and Lieutenant Dedra Meero. He aided her when she investigated the theft of an Imperial N-S9 Starpath Unit from the Steergard Naval Yard.\nDuring the time of the Galactic Empire, Heert served as the assistant of Dedra Meero in the Imperial Security Bureau. In 5 BBY, he aided his superior in her office in the bureau building on the planet Coruscant. When Meero uncovered the presence of the starpath unit when reading reports of the Ferrix incident, she sent Heert to the office of Supervisor Blevin to request all further information regarding Ferrix. When the request was denied, Meero visited Blevin's office herself to discuss the matter.\nAs they continued to investigate various locations such as Hosnian Prime, Meero ordered Heert to leave her office as the time was late. Heert refused to leave however, wanting to stay if Meero was as well. Heert reassured her when she claimed that she didn't know what she was doing. He listed events in different locations such as Kessel, Fondor, Jakku, Base Cay, and Steergard. However, Meero agreed with the view that the events were too scattered to be organized, held by Major Partagaz.\nHeert again rebutted, claiming that Meero did not believe Partagaz. The lieutenant knew that if she were working against the Empire, she would disperse the activities and never climb the same fence twice, to which Heert replied that it was too random to be random. Meero then asked if they could check two more files each, to which Heert nodded, as the pair resumed their work.\nShortly thereafter, the payroll for an entire Imperial sector was later stolen from an Imperial installation on the planet Aldhani. Numerous bureau staff, including Heert and his superior Meero, were then summoned back to the meeting room, where they were informed by Partagaz that they should tell their staff and families that they were not be going home. The major then told those assembled that he wanted every Star Sector and Planetary Emergency Retaliation plan in the building to be ready for presentation by midnight.\nThe next day, Heert was present sat behind Meero at a meeting led by Colonel Wullf Yularen. The Colonel informed the staff present of the countermeasures being made following the Aldhani heist, including the introduction of the Public Order Resentencing Directive. During a discussion in Meero's office after the meeting, his superior expressed to the Attendant her belief that the attack on Aldhani was not a robbery, but rather that it was an announcement.\nSome time later, Heert and his fellow ISB Attendant Corv were sent to the Imperial Bureau of Standards by Meero to bring Syril Karn for interrogation at the ISB central office. When Karn revealed during interrogation that he was unable to read the Ferrix report before being dismissed from his job in the Morlana System, Meero and Heert had to leave to attend another meeting elsewhere in the building. As the pair left, Corv remained behind to give Karn a copy of the report to read.\nDuring this meeting, Heert's superior requested additional resources to hunt down Cassian Jeron Andor, who had been identified as one of the two culprits of the Ferrix incident. Although Meero and her staff were unable to identify Luthen Rael, who they had codenamed \"Axis\" for his centrality in the plot, she was nonetheless determined to hunt him down. Later that day, the ISB officers returned to the interrogation room. Meero determined that Karn's description of Rael was not of further use and left shortly thereafter, Heert falling in step behind her.\nUpon Meero's return to Coruscant from interrogating Salman Paak and Bix Caleen on Ferrix, Heert and Corv attended a meeting called by Major Partagaz with their superior. Meero discussed the list of Imperial equipment that Caleen had given after interrogation, which contained a targeting unit that was recovered from a safehouse operated by Maya Pei's rebel cell. Additionally, she was able to connect Axis to the events on Aldhani through Andor's return to Ferrix three days after the heist. When Partagaz stated that he believed the Aldhani connection to be a stretch, Heert brought up the fact that Caleen had revealed Andor was clean-shaven after his return. He further presented the fact that two soldiers at the Aldhani Garrison believed Andor looked similar to one of the rebels. Partagaz responded that the amplified interest made the connection to Aldhani worth following up.\nWhen Meero entered her office the next day, Heert informed her that Imperial authorities had detained a rebel pilot using a stolen Imperial masking unit, and that Attendant Corv was checking if the unit was off of their list. Heert's superior ordered him to send Doctor Gorst to interrogate the prisoner on the Destroyer above Steergard where he was being held. He responded that he had already sent out Gorst, and asked if she wanted to go as well. She replied that there was no time and dismissed him from the room after congratulating him on his work.\nAfter the interrogation of the prisoner, Heert and Meero attended a small meeting with Partagaz, Lagret, and two other attendants. During his interrogation, the prisoner claimed that he did not contact anyone during his escape attempt. Heert informed the room that the masking unit had been stolen from the Imperial naval yard in Lozash the previous year. Supervisor Lonni Jung and his attendant then arrived late to the meeting, having been offsite. Partagaz informed them about the capture of the rebel pilot, who was part of Anto Kreegyr's rebel cell. The major informed Jung that he believed that Kreegyr was unaware of the pilot's capture, and that the prisoner had revealed a planned raid on the Spellhaus Imperial power station.\nWhen Jung warned that the pilot would be counted missing soon, Lagret proposed destroying the ship and making it seem accidental. Heert's superior proposed the idea of fouling the ship, planting the pilot's body and allowing the ship to drift into traffic near Kafrene. As Meero and Heert left the conference room to see to this, Partagaz ordered Lagret and Jung to schedule a meeting with Military Intelligence about the planned raid on Spellhaus.\nA human male, Heert had dark hair, and brown eyes. He was strongly loyal to the Empire and his commanding officer Dedra Meero, remaining behind after hours to continue to assist her in reviewing records.\nHeert wore a gray Imperial officer's uniform with black breeches, two code cylinders and a rank insignia plaque with two blue tiles. He sometimes wore a black Imperial kepi with an officer's disk.\nHeert was portrayed by Jacob James Beswick in \"Aldhani,\" the fourth episode of the television series Andor, which aired on September 28, 2022. Prior to the episode's release, he was visually revealed in the first trailer for the show which aired on August 1, 2022.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Imperial_officer",
  "/wiki/ISB_Attendant",
  "/wiki/Imperial_Era",
  "/wiki/ISB_Supervisor",
  "/wiki/Lieutenant",
  "/wiki/Dedra_Meero",
  "/wiki/Imperial_N-S9_Starpath_Unit",
  "/wiki/Steergard_Naval_Yard",
  "/wiki/5_BBY",
  "/wiki/Dedra_Meero%27s_office",
  "/wiki/ISB_Central_Office",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Ambush_on_Ferrix",
  "/wiki/Blevin%27s_office",
  "/wiki/Blevin",
  "/wiki/Ferrix",
  "/wiki/Hosnian_Prime",
  "/wiki/Kessel",
  "/wiki/Fondor",
  "/wiki/Jakku",
  "/wiki/Base_Cay",
  "/wiki/Major",
  "/wiki/Partagaz",
  "/wiki/Sector",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani_dam",
  "/wiki/Aldhani",
  "/wiki/Colonel",
  "/wiki/Wullf_Yularen",
  "/wiki/Public_Order_Resentencing_Directive",
  "/wiki/Corv",
  "/wiki/Imperial_Bureau_of_Standards",
  "/wiki/Syril_Karn",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Luthen_Rael",
  "/wiki/Salman_Paak",
  "/wiki/Bix_Caleen",
  "/wiki/Maya_Pei",
  "/wiki/Maya_Pei%27s_cell",
  "/wiki/Aldhani_Garrison",
  "/wiki/Unidentified_rebel_pilot_(Anto_Kreegyr)",
  "/wiki/Doctor",
  "/wiki/Gorst",
  "/wiki/Destroyer",
  "/wiki/Steergard",
  "/wiki/Lonni_Jung",
  "/wiki/Anto_Kreegyr",
  "/wiki/Anto_Kreegyr%27s_group",
  "/wiki/Spellhaus",
  "/wiki/Imperial_Intelligence",
  "/wiki/Color",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Commanding_officer",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Imperial_kepi",
  "/wiki/Officer%27s_disk",
  "/wiki/Jacob_James_Beswick",
  "/wiki/Aldhani_(episode)",
  "/wiki/September_28",
  "/wiki/2022",
  "/wiki/August_1",
  "/wiki/The_Axe_Forgets",
  "/wiki/The_Eye",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/One_Way_Out",
  "/wiki/Kassa_(episode)",
  "/wiki/Star_Wars"
 ]
}