{
 "name": "Heimkes",
 "display_name": "Heimkes",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Attuma Duum"
     ]
    }
   ]
  }
 ],
 "content": "Heimkes was an individual employed by the mercenary Attuma Duum during the Clone Wars. In the year 21 BBY, he worked in Duum's asteroid base. Duum was playing both sides of the Clone Wars against each other, and he lured two opposing fleets to Cavamina Minor; their point of reversion from hyperspace was seeded with 600000 space mines. Duum ordered Heimkes to dim the lights in the control center so they all could see the spectacular results of the trap. The two fleets encountered the mines and started firing on each other. Meanwhile, the Force-sensitive Shon-Ju, in cooperation with the Jedi Knight Aayla Secura, had infiltrated the station to arrest Duum. Sabat, the chief of security, had captured the two, but Shon-Ju used the battle as a distraction to escape. He punched Sabat into a turbine, destroying it and him, and knocking out the deflector shield protecting the station from the asteroid field. Heimkes reported this fact to Duum, but was told not to worry as backup power systems were in place. Then Shon-Ju confronted Duum. Duum ordered everyone present to go to the casino level, and all gambling credits would be on Duum that night. With the control station evacuated, Duum and Shon-Ju engaged in hand-to-hand combat. Eventually, Shon-Ju got the better of the cyborg mercenary, but was prevented by the arrival of Secura, who had escaped herself. Secura and Shon-Ju started fighting, allowing Duum to escape. The station eventually succumbed to the damage and exploded, but not before Secura and Shon-Ju escaped.\nHeimkes appears in a few frames in the 2010 graphic novella The Clone Wars: Deadly Hands of Shon-Ju.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Attuma_Duum",
  "/wiki/Mercenary/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Attuma_Duum%27s_headquarters",
  "/wiki/Fleet/Legends",
  "/wiki/Cavamina_Minor",
  "/wiki/Hyperspace/Legends",
  "/wiki/Space_mine",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Shon-Ju",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Sabat_(mercenary)",
  "/wiki/Battle_of_Cavamina_Minor",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Casino/Legends",
  "/wiki/2010",
  "/wiki/The_Clone_Wars:_Deadly_Hands_of_Shon-Ju"
 ]
}