{
 "name": "Helder_Spinoza",
 "display_name": "Helder Spinoza",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bespin Wing Guard"
     ]
    }
   ]
  }
 ],
 "content": "Helder Spinoza was a human male member of the Bespin Wing Guard in Cloud City on the gas giant Bespin. When the smuggler Han Solo arrived in Cloud City in 3 ABY, Spinoza was among the guards who accompanied Cloud City's Baron Administrator Lando Calrissian onto Platform 327 in order to greet him.\nAfter Calrissian turned Solo over to the Galactic Empire as part of a deal, the Baron Administrator decided to turn on the Empire and save Solo's allies from Imperial custody. He had his aide Lobot lead Spinoza and several other guards in ambushing and capturing the Imperials escorting Solo's allies, freeing the prisoners and taking the Imperials to Cloud City's security tower.\nHelder Spinoza was a human male who served as a member of the Bespin Wing Guard of Cloud City on the gas giant Bespin during the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire. In 3 ABY, the Empire arrived on Bespin and forced Lando Calrissian, the Baron Administrator of Cloud City, to agree to a deal in which he would aid the Empire in capturing his old friend Han Solo, a smuggler working with the Alliance.\nSolo and a group of his allies soon arrived in Cloud City in the YT-1300 light freighter known as the Millennium Falcon and were directed to land on Platform 327. Spinoza and five other guards accompanied Calrissian and his aide Lobot out onto the platform to greet the new arrivals, which also included Princess Leia Organa, Chewbacca, and the protocol droid C-3PO. Initially the Baron Administrator greeted Solo in a hostile manner, but then laughed and embraced his old acquaintance, after which Lobot dismissed Spinoza and the other guards, causing them to march from the platform back inside the city.\nAfter being led into a trap by Calrissian, Solo and his allies were captured by the Empire and the smuggler was frozen in carbonite. Calrissian was then ordered to deliver Organa and Chewbacca to the starship of the Sith Lord Darth Vader, and escorted them with four stormtroopers and Imperial Lieutenant Sheckil. However, the Baron Administrator had decided to renegade on his deal with the Empire and aid the Alliance, contacting Lobot, who gathered Spinoza and several other guards.\nSpinoza, Lobot, and the other guards then ambushed Sheckil and the troopers in one of Cloud City's corridors and forced them to surrender at blaster-point. Calrissian gave orders for the Imperials to be quietly kept in the security tower, and Spinoza and the other guards then escorted the Imperials away, leaving Organa, Chewbacca, and C-3PO with Calrissian. Due to Calrissian's betrayal, the Empire took control of Cloud City, and the Baron Administer issued one final warning to its citizens telling them to leave before he fled himself with his new rebel allies.\nHelder Spinoza had light skin and black hair.\nSpinoza wore the gold-trimmed blue uniform of the Wing Guard, including a cap, red bracers, a black holster, and black boots. He used a Relby K-23 blaster pistol.\nHelder Spinoza first appeared in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. In the current Star Wars canon, Spinoza was first identified on an 2022 action figure released as part of the Star Wars Vintage Collection produced by Hasbro Inc.. The named originated in the Star Wars Legends continuity, where it was created by Tim Veekhoven for \"Rogues Gallery: The Cloud City Wing Guards\", an article published in Star Wars Insider 148 on March 11, 2014.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Helder_Spinoza",
  "/wiki/Helder_Spinoza/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bespin_Wing_Guard",
  "/wiki/Cloud_City",
  "/wiki/Gas_giant",
  "/wiki/Bespin",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/3_ABY",
  "/wiki/Baron_Administrator",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Platform_327",
  "/wiki/Galactic_Empire",
  "/wiki/Aide",
  "/wiki/Lobot",
  "/wiki/Security_tower",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Chewbacca",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/City",
  "/wiki/Carbonite",
  "/wiki/Starship",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Stormtrooper",
  "/wiki/Lieutenant",
  "/wiki/Sheckil",
  "/wiki/Blaster",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Hat",
  "/wiki/Holster",
  "/wiki/Boot",
  "/wiki/Relby_K-23_blaster_pistol",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars",
  "/wiki/2022",
  "/wiki/Star_Wars_Vintage_Collection",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars_Legends",
  "/wiki/Tim_Veekhoven",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_148",
  "/wiki/March_11",
  "/wiki/2014",
  "/wiki/Star_Wars_(2015)_33",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Databank_(website)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars_Insider",
  "/wiki/Titan_Magazines"
 ]
}