{
 "name": "Helen Goldenfield",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Helen Goldenfield was a Human female rancher who lived on Tatooine during the Galactic Civil War.\nBy the time of the Battle of Yavin, Helen Goldenfield lived in a ranch near the city of Mos Eisley with her husband Roric Goldenfield.\nIn 1 ABY, Helen and her husband had raised the ire of a local band of pirates who had established a hideout near their home. Roric had managed to capture and imprison some of the pirates in the basement of their home and had left to find an Imperial garrison to have them arrested. He left Helen to watch the pirates. While he was away, a spacer, who was on a quest for the Mark of Honor, arrived at their house. Being a gracious host, Helen let the spacer in. She asked if they would watch the prisoners for her while she took a break. The spacer agreed. During this time, the pirates pleaded with the spacer to let them out, but they refused and informed Helen of their intent to escape. At this time, Roric had finally returned with two Imperial dark troopers. The troopers arrested the pirates and led them out of the house. Helen and her husband thanked the spacer for their assistance, and the spacer left.\nHelen Goldenfield was an non-playable character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Helen Goldenfield was added to the game as part of the \"Hero of Tatooine\" questline, released with \"Publish 9\" on June 29, 2004.\nBecause Helen Goldenfield spawned under the generic \"commoner_human_female\" template, her appearance was randomized under one of twelve possible depictions. She appeared consistently a Human female, however.\nThe \"Hero of Tatooine\" questline was extensively revamped upon the introduction of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005, but the \"Honor\" portion involving the Goldenfield family was not altered.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Ranch",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Roric_Goldenfield",
  "/wiki/1_ABY/Legends",
  "/wiki/Sand_slum_pirates",
  "/wiki/Pirate_Base",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Garrison/Legends",
  "/wiki/Hero_of_Tatooine",
  "/wiki/Quest_of_the_Hero_of_Tatooine",
  "/wiki/Mark_of_Honor",
  "/wiki/Exogen-class_dark_trooper",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_29",
  "/wiki/2004",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}