{
 "name": "Heliesk",
 "display_name": "Heliesk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Rebel Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Heliesk was a Human male Imperial captain who commanded the Rand Ecliptic during the Galactic Civil War, with Biggs Darklighter and Derek Klivian as his executive officers.\nA captain in the Galactic Empire, Heliesk commanded the Imperial II-class frigate Rand Ecliptic on its first posting early in the Galactic Civil War. Recent Imperial Naval Academy graduates Biggs Darklighter and Derek \"Hobbie\" Klivian served under him as the frigate's first and second mate.\nAlthough Heliesk was a Rebel sympathizer and agent under the codename Starfire, he maintained his cover as a staunch Imperial, dismissing the Rebellion as absurd and doomed to failure.\nOn a routine sector patrol, the Rand Ecliptic encountered the Lark, a starship belonging to the Camblian Order of Eedoq, carrying 309 young people to the Clarion Scholars Academy on Daemen. Failing to provide proper Imperial identification, Captain Heliesk sent the TIE/LN starfighters of Twilight Squadron to disable or destroy the Lark, claiming it to be a suspected Rebel ship. Although squadron leader Darklighter ordered the ship to be safely disabled, it was destroyed by Tars Nandy. Contrary to Darklighter's protestations, Heliesk welcomed the incident, stating that it would save days of prisoner interrogations.\nThis apparent disregard for life sickened Darklighter, and incited him to mutiny aboard the Rand Ecliptic with one of the ship's rebel cells. During the mutiny, three other cells were revealed, one of which was led by Klivian, who took command of the frigate. Heliesk locked himself in his quarters, but was soon captured for his knowledge of Imperial communications codes and made a prisoner of war.\nAs depicted by Star Wars: Empire: Darklighter, the events of the mutiny on the Rand Ecliptic, and Heliesk's involvement in them, presented in this article differ from the account given by Hobbie Klivian in the short story \"Mutiny on the Rand Ecliptic\". According to \"Mutiny on the Rand Ecliptic\", Heliesk was a willing but covert participant in the defection of Klivian and Darklighter. As \"Starfire\", Heliesk was the Rebel contact of Lindy, a friend of Hobbie's with whom the defectors intended to jump ship while the Rand Ecliptic delivered rubindum ore to the Bestine system. In an effort to provide the Rebel Alliance with the rubindum without exposing his allegiance to the Empire, Heliesk led a squad of stormtroopers to Lindy's rebels' and the defectors' rendezvous, bringing the rebels aboard the Rand Ecliptic and giving Klivian a rank cylinder serving as a key to the ship's captain's quarters. There, Heliesk instructed Klivian and Darklighter to stage a mutiny with the rebels as their crew, delivering the ship and its cargo to the Alliance without breaking his Imperial cover.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Rand_Ecliptic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Biggs_Darklighter/Legends",
  "/wiki/Derek_Klivian/Legends",
  "/wiki/Imperial_II-class_frigate",
  "/wiki/Imperial_Naval_Academy",
  "/wiki/Frigate/Legends",
  "/wiki/First_Mate/Legends",
  "/wiki/Second_mate/Legends",
  "/wiki/Lark",
  "/wiki/Starship/Legends",
  "/wiki/Camblian_Order",
  "/wiki/Eedoq",
  "/wiki/Clarion_Scholars_Academy",
  "/wiki/Daemen",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Twilight_Squadron_(Imperial)",
  "/wiki/Squadron/Legends",
  "/wiki/Tars_Nandy",
  "/wiki/Mutiny_on_the_Rand_Ecliptic/Legends",
  "/wiki/Star_Wars:_Empire:_Darklighter",
  "/wiki/Mutiny_on_the_Rand_Ecliptic_(short_story)",
  "/wiki/Lindy",
  "/wiki/Rubindum",
  "/wiki/Bestine_system/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Code_cylinder/Legends",
  "/wiki/Empire_9",
  "/wiki/Empire_12",
  "/wiki/West_End_Games",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back",
  "/wiki/The_Movie_Trilogy_Sourcebook",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Empire_8"
 ]
}