{
 "name": "Hella_Br%C3%BCn",
 "display_name": "Hella Brün",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bequesh"
     ]
    }
   ]
  }
 ],
 "content": "Hella Brün was a Human female bodyguard who had served Bequesh, administrator of the Tanquilla Beach shadowport, for twenty years as of 8 ABY. A proficient martial artist, Brün projected a persona of being a brash, confident woman, when, in reality, she was actually a shy individual.\nHella Brün was a Human female who was employed as the chief bodyguard and aide for Bequesh, the administrator of the Tanquilla Beach shadowport. She began her employment in 12 BBY, and served Bequesh capably, accompanying him as he went about his business on the station and saving his life on several occasions. By 8 ABY, Brün had served in the position for two decades.\nA tall, sharp featured woman with a guarded smile, Hella Brün was outwardly brash and self-confident, but in private she was a shy individual. As befitting her station as a bodyguard, she was trained to use a blaster. She was also proficient in melee combat and unarmed combat, and specialized in a form of martial arts that emphasized striking pressure points on an opponent's body to inflict pain but no permanent injuries. Brün could be stealthy when the need arose, and could use her skills to intimidate others.\nKnowledgeable about alien species and cultures, Brün had a working understanding of bureaucracy and was familiar with the inner workings and business that went on aboard Tanquilla Beach. She could operate the weapon systems and shield systems aboard capital ships, and had experience with security systems and demolitions. Brün was also known to gamble.\nTo aid her in her duties, Brün was armed with a blaster pistol, and carried a comlink and datapad.\nHella Brün appeared in Shintel Downtime, the fourth RPG adventure in The DarkStryder Campaign written by Paul Sudlow and published in 1995.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bequesh",
  "/wiki/Bodyguard/Legends",
  "/wiki/Administrator/Legends",
  "/wiki/Tanquilla_Beach/Legends",
  "/wiki/Shadowport/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/12_BBY/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Shintel_Downtime",
  "/wiki/Roleplaying_game",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/Paul_Sudlow",
  "/wiki/1995",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/The_DarkStryder_Campaign,_Deluxe"
 ]
}