{
 "name": "Hemi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Republic"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Rebel Alliance Navy",
      "Rebel Alliance Navy"
     ]
    }
   ]
  }
 ],
 "content": "Hemi was a Mon Calamari male who served in the Alliance to Restore the Republic aboard the MC80A Home One Type Heavy Star Cruiser Republic, under the command of General Jan Dodonna. In 1 ABY, when the Galactic Empire launched an assault on the Alliance's Mako-Ta Space Docks and destroyed many rebel starships, Hemi served at General Dodonna's side and was killed when the Republic was destroyed during the assault.\nHemi was a Mon Calamari male who served in the navy of the Alliance to Restore the Republic under the command of General Jan Dodonna, stationed on the MC80A Home One Type Heavy Star Cruiser Republic. In 1 ABY, the Republic and several other cruisers were docked at the Mako-Ta Space Docks, a rebel space station, while being refitted with Shu-Torun technology. After completing the refitting, the cruisers attempted to jump to hyperspace but found their hyperdrives unresponsive; unbeknown to the rebels, the Shu-Torun people were secretly working for the Galactic Empire, and their technology was actually sabotaging the cruisers.\nIn the ensuing Imperial assault, the rebel cruisers were unable to scramble their starfighters in response as none of the cargo bay doors would open due to the Shu-Torun sabotage. The rebels discovered that only codes found on the flagship of Dark Lord of the Sith Darth Vader, the Executor, were capable of bringing the ships back online. After a group of rebels successfully recovered the codes, the Republic was brought back online and jumped into hyperspace. However, with the rest of the ships still stuck at the space docks, rebel heroes Luke Skywalker and Princess Leia Organa convinced General Dodonna to return to help the other ships.\nThe Republic returned to the assault and was used as bait for the Executor. Dodonna ordered Hemi to use all the firepower they had on Vader's flagship, after which the Mon Calamari reported to the general that the Star Destroyers were converging on them. Dodonna then ordered Hemi to signal the smuggler Han Solo to get the codes to the rest of the stranded rebel cruisers. After the rebel starships were able to provide the fleet the override codes to disable the Shu-Torun technology that had rendered them useless, Hemi reported to Dodonna that although all the remaining cruisers were now online, the Republic's engines were too damaged for them to go anywhere.\nAfter apologizing to Hemi and thanking him for his service, Dodonna ordered the fleet to scatter while the Republic, still taking heavy damage, would guard the rear. Shortly after, Hemi reported that all the cruisers were ready, so General Dodonna ordered again for them all to leave. The Mon Calamari told General Dodonna when the Alliance Fleet had escaped but informed him that the Republic's shields were failing. The general then sat back in his chair and expressed his pride for everyone he had fought with, including Hemi. The Republic was then destroyed, and both Dodonna and Hemi went down with it.\nHemi had gray skin and blue eyes. He followed his orders from his general and was willing to go down with the Republic to ensure the safety of the Rebel Alliance Fleet. Just prior to their ship's destruction, General Dodonna expressed his pride for Hemi and everyone else he had fought with.\nHemi wore a dark gray uniform with blue sleeves and a black belt.\nHemi appeared in the fifty-fifth issue of Marvel Comics' Star Wars comic series. The issue was written by Kieron Gillen, illustrated by Salvador Larroca, and published on October 3, 2018.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/1_ABY",
  "/wiki/Republic_(MC80A_Home_One_Type_Heavy_Star_Cruiser)",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/MC80A_Home_One_Type_Heavy_Star_Cruiser",
  "/wiki/Commanding_officer",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Galactic_Empire",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Starship",
  "/wiki/Death",
  "/wiki/Cruiser",
  "/wiki/Space_station",
  "/wiki/Shu-Torun",
  "/wiki/Hyperspace",
  "/wiki/Hyperdrive",
  "/wiki/Kingdom_of_Shu-Torun",
  "/wiki/Starfighter",
  "/wiki/Flagship",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Executor",
  "/wiki/Luke_Skywalker",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Star_Destroyer",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Fleet",
  "/wiki/Engine",
  "/wiki/Deflector_shield",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Star_Wars_(2015)_55",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_2015)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Kieron_Gillen",
  "/wiki/Salvador_Larroca",
  "/wiki/October_3",
  "/wiki/2018",
  "/wiki/Category:Images_of_Hemi",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Star_Wars_(2015)_51",
  "/wiki/Star_Wars_(2015)_54"
 ]
}