{
 "name": "Hendar",
 "display_name": "Hendar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Outcasts"
     ]
    }
   ]
  }
 ],
 "content": "Hendar was a Human male who was a member of the Outcasts and native of the Tarisian Undercity.\nAt some point in 3956 BBY Hendar left the safety of his Undercity village, venturing out into rakghoul-infested areas. He was pursued by a rakghoul as he returned, his wife, Hester, asked Trewin, the gatekeeper, to open the gate and let him back in. Unwilling to risk exposing the entire village to a rakghoul attack, Trewin reluctantly refused. It was then that the amnesiac Revan intervened, choosing to step outside the walls to help the stranger. Revan and Carth Onasi's combat skills were more than a match for the rakghoul, and Hendar was reunited with his wife.\nHe, like all the other Outcasts, left for the Promised Land when Revan later brought back enough evidence for Rukil, the village elder, to deduce its location. His reason for venturing into the open Undercity was not revealed, however it was likely that he was hoping to scavenge food or medicine from one of the Republic escape pods that had crashed nearby.\nIf the player takes too long to kill the rakghoul, it will catch and kill Hendar. If the player takes the dark path and chooses to let him die, his wife, Hester, will shout angrily at the player.\nIn the Xbox version of the game, Hendar is given a different face.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Outcasts_(Taris)",
  "/wiki/Rakghoul",
  "/wiki/Undercity_(Taris)",
  "/wiki/3956_BBY",
  "/wiki/Hester",
  "/wiki/Trewin",
  "/wiki/Revan/Legends",
  "/wiki/Carth_Onasi",
  "/wiki/Promised_Land",
  "/wiki/Rukil",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Xbox",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic"
 ]
}