{
 "name": "Hennix",
 "display_name": "Hennix",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "28 ABY",
      "Elphrona"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Luke Skywalker"
     ]
    }
   ]
  }
 ],
 "content": "Hennix was a Force-sensitive male Quarren Jedi Padawan during the New Republic Era who was part of the Jedi Order under Jedi Master Luke Skywalker. Following the destruction of the Jedi Temple of Luke Skywalker, Hennix along with Voe and Tai questioned Ben Solo. They were skeptical of his account that Master Skywalker had attacked him. When Solo tried to leave, Hennix and his fellow Jedi tried to detain him but Solo escaped after wounding Hennix. The three Jedi tracked Solo to the planet Elphrona where they fought a lightsaber duel. Hennix was killed and as a result Voe and Tai believed that Solo was lost.\nGrowing up, Hennix lived at Jedi Master Luke Skywalker's Jedi temple alongside his fellow trainees Ben Solo, Voe, and Tai. As a child, Hennix and his fellow pupils learned how to levitate rocks. He viewed the Force as a puzzle, taking an interest in the holocron of the High Republic Era Jedi Avar Kriss.\nShortly after Solo destroyed Skywalker's temple with a storm, Hennix along with Voe and Tai returned on their starship Verity. Searching for survivors, the three Jedi confronted Solo who told them that Master Skywalker had tried to kill him in his sleep. Solo told them they should leave but Hennix and his friends wanted to question him.\nDespite Tai's attempts to defuse the situation, Hennix and Voe drew their lightsabers. Voe attacked Solo but he froze her in mid-air and threw her into Hennix. The three Jedi tried to take on Ben but he used the Force to hurl burning wood and rubble at them. A piece of debris hit Hennix in the stomach, wounding him.\nWith Hennix wounded, Solo fled aboard his starship Grimtaash. The Jedi returned to the Verity. While Tai attended to Hennix's wounds, Voe pursued Ben's ship. However, Solo managed to escape by damaging one of the Verity's engines. Wile Voe and Tai debated how they should respond to Solo's actions, Hennix suggested that they track down Ben Solo's ship using a transponder inside his droid Geegee, who was aboard the Grimtaash.\nHennix, Tai and Voe managed to track Ben Solo down to the Jedi outpost on the planet Elphrona. They engaged Solo in a lightsaber duel. While Tai tried to calm Solo by probing into his mind, Voe pursued Solo, Force jumping onto a large rock. Hennix, who was unable to keep up with Voe, tried to tell her not to get too far because he could not catch up with her.\nVoe and Hennix tried to corner Solo, who Force pushed Voe off the cliff. A remorseful Solo tried to pull her to safety but was attacked by an enraged Hennix, who believed that Solo had sent her to her death. Managing to reach the cliff's peak, Hennix threw his lightsaber at Solo, but it was deflected, and, caught off guard, Hennix was killed by the oncoming blade. In an attempt to get the Jedi to stop following him, Solo buried Tai and Voe under two Jedi statues.\nWhile Solo fled offworld to find the Knights of Ren, Tai and Voe used the Force to free themselves from the rubble. After attending to their dying comrade, Voe and Tai resolved to avenge Hennix's death and to stop Solo, whom they regarded as lost.\nSolo later recounted Hennix's death to the Knights of Ren and their leader Ren. However, Ren considered Hennix's death not to be a \"good death\" since Solo had not intended to kill the Jedi. Nevertheless, he allowed Solo to accompany his Knights, believing that Solo could earn his place through a \"good death.\"\nHennix was a male Quarren with brown skin. He was a close friend of Ben Solo, Voe and Tai. He was known for approaching the Force as a puzzle which could understand through study. Solo noted that while Hennix knew he could not solve the mysteries of the Force, he would have been happy to spend his life trying. Hennix was regarded as smart and funny by the other apprentices at Skywalker's Jedi temple including Solo.\nAfter Skywalker attacked Solo, Hennix and Voe believed that Solo had destroyed the temple and killed Skywalker while Tai advised caution. Hennix came up with the idea of tracking Solo through hyperspace by following the transponder on his droid Geegee.\nLike Voe, Hennix believed that Solo needed to be stopped. When Solo Force pushed Voe down a cliff, an enraged Hennix tried to avenge her.\nHennix was Force-sensitive and wielded a blue lightsaber. Despite his Force powers and lightsaber skills, he was still outmatched by Ben Solo. Hennix was also interested in holocrons. While he could not understand Huttese, Hennix was fluent in Galactic Basic Standard.\nTai wore tan Jedi robes. He possessed a blue-bladed lightsaber with unique hilt. After his death at the hands of Solo, her fellow padawan Voe took his saber.\nHennix first appeared in the Marvel Comics comic mini-series Star Wars: The Rise of Kylo Ren, which premiered with the release of The Rise of Kylo Ren 1 on December 18, 2019. He was created by comic writer Charles Soule and illustrated by Will Sliney.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/28_ABY",
  "/wiki/Elphrona",
  "/wiki/Quarren",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Luke_Skywalker",
  "/wiki/Force-sensitive",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/New_Republic_Era",
  "/wiki/Jedi_Master",
  "/wiki/Destruction_of_the_Jedi_Temple",
  "/wiki/Jedi_Temple_of_Luke_Skywalker",
  "/wiki/Voe",
  "/wiki/Tai",
  "/wiki/Ben_Solo",
  "/wiki/Lightsaber",
  "/wiki/Duel_on_Elphrona",
  "/wiki/Telekinesis",
  "/wiki/The_Force",
  "/wiki/Holocron",
  "/wiki/High_Republic_Era",
  "/wiki/Avar_Kriss",
  "/wiki/Starship",
  "/wiki/Verity",
  "/wiki/Sleep",
  "/wiki/Grimtaash_(starship)",
  "/wiki/Droid",
  "/wiki/Geegee",
  "/wiki/Elphrona_Outpost",
  "/wiki/Force_jump",
  "/wiki/Force_push",
  "/wiki/Death",
  "/wiki/Knights_of_Ren",
  "/wiki/Ren_(human)",
  "/wiki/Huttese",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Jedi_robes",
  "/wiki/Tai%27s_lightsaber",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_The_Rise_of_Kylo_Ren",
  "/wiki/The_Rise_of_Kylo_Ren_1",
  "/wiki/December_18",
  "/wiki/2019",
  "/wiki/Charles_Soule",
  "/wiki/Will_Sliney",
  "/wiki/The_Rise_of_Kylo_Ren_2",
  "/wiki/The_Rise_of_Kylo_Ren_3",
  "/wiki/The_Rise_of_Kylo_Ren_4",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Luke_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Kylo_Ren_and_Other_Followers_of_the_Dark_Side",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY"
 ]
}