{
 "name": "Herana",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Skye"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "S'kytri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Patriarch Klarymére"
     ]
    }
   ]
  }
 ],
 "content": "Herana was a female S'kytri of the Lowland Clans of the planet of Skye. A member of the Patriarch's guard, she resided in the planet's capital city, the City of the Winged People.\nA green-skinned S'kytri of the Lowland Clans, Herana served as a Guardsman of the Patriarch Klarymére in 22 BBY. At this time, the crazed Arkanian mutant, Zeta Magnus had brought a pathogen to Skye and unleashed it on her people, declaring himself Magister in the process. Escorting the Patriarch to a rendezvous point with Jedi Knight Obi-Wan Kenobi and his two Padawans, Anakin Skywalker and Halagad Ventor, Herana collected the ammunition from the Jedi's clone commando companions and escorted them to the gates of the City of the Winged People high in the summits of a nearby mountain. Helping Ventor cross the bridge tot he Supreme Council Tower, she led the Jedi before the Supreme Council of the Highland Clans to discuss the future of the Tyrant which ruled over them. When Klarymére's daughter, Kharys contacted Aragh with news of the Patriarch's death, Herana joined Aragh and the other warriors of the S'kytri people to assault the slopes of Canaitith Mountain where they would do battle with the Evil Tyrant. Fighting valiantly against Magnus' thralls, the corrupted Outland Clans, Herana was slain during the battle when an Outlander ripped her throat out with his teeth.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Skye/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/S%27kytri",
  "/wiki/Gender/Legends",
  "/wiki/Color",
  "/wiki/Patriarch_(Skye)",
  "/wiki/Klarym%C3%A9re",
  "/wiki/Planet/Legends",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/City_of_the_Winged_People",
  "/wiki/Arkanian/Legends",
  "/wiki/Zeta_Magnus",
  "/wiki/Magister",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Halagad_Ventor",
  "/wiki/Clone_commando/Legends",
  "/wiki/Supreme_Council_of_the_Highland_Clans",
  "/wiki/Kharys",
  "/wiki/Aragh",
  "/wiki/Canaitith_Mountain",
  "/wiki/Outland_Clan",
  "/wiki/SkyeWalkers:_A_Clone_Wars_Story"
 ]
}