{
 "name": "Hereven Kev",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Hereven Kev was a Force-sensitive male Human who was born to Dayla Kev and Hereven, two scouts who were stranded on a hostile jungle world. The elder Hereven was killed while hunting during Dayla's pregnancy, and she brought up her son alone, raising him to despise the scout Milac Troper, who had abandoned Dayla and the elder Hereven to die on the world. Over the next decade, Hereven and his mother faced many ordeals as the struggled to survive and they consequently became more closely attuned to the Force. When Hereven was in his teens, he and his mother were rescued from the jungle world by the Wookiee outlaws Fahraark and Friyahrr. Though the Wookiees initially planned to sell the pair into slavery, Dayla persuade them to work with her instead, and the Kevs and the two Wookiees subsequently established a small safari outfitting and wilderness guide company.\nOver the years, Hereven's desire for revenge against Troper drove him to the dark side of the Force and he eventually became a dark side marauder. About twenty-five years after their rescue, Hereven and his mother hatched a plan to get back at Troper for the suffering that he had caused to them. During a peace conference that Troper was attending aboard the Ithorian Herdship Galactic Horizon, the Krevs and their Wookiee associates released various dangerous creatures aboard the vessel, driving Troper and his entourage deep into the heart of the herdship biosphere, while under constant attack. Hereven observed Troper's struggle via a viewscreen and twenty-four hours after Troper's ordeal had commenced, the Krevs confronted him in person and Hereven engaged in combat with Troper's security team.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Dayla_Kev",
  "/wiki/Hereven",
  "/wiki/Scout/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Death/Legends",
  "/wiki/Milac_Troper",
  "/wiki/Standard_decade/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Fahraark",
  "/wiki/Friyahrr",
  "/wiki/Slavery/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dark_side_marauder",
  "/wiki/Ithorian_Herdship/Legends",
  "/wiki/Galactic_Horizon",
  "/wiki/Starship/Legends",
  "/wiki/Viewscreen/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Welcome_to_the_Jungle",
  "/wiki/Star_Wars_Gamer_6"
 ]
}