{
 "name": "Herf_(Ithorian)",
 "display_name": "Herf  (Ithorian)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Surat Nuat's gang"
     ]
    }
   ]
  }
 ],
 "content": "Herf was an Ithorian gangster who worked for the Sullustan crime lord Surat Nuat, who operated on the Outer Rim planet of Akiva during the Age of the Empire. Shortly after the Battle of Endor, Herf along with fellow gangsters Toomata Wree and Makarial Gravin visited the teenage junk dealer Temmin Wexley's shop to confront him for stealing a shipment from one of their boss's crashed transports. While Makarial demanded Temmin's shop as restitution, Herf wielded a DLT cannon. He along with his companions were knocked out by Temmin's B1-series battle droid companion and body guard \"Mister Bones\". Temmin then told Mister Bones to dump the gangsters in the Kora Biedies.\nHerf was an male Ithorian gangster who was a member of Surat Nuat's gang following the Battle of Endor. After the local human Temmin Wexley stole a shipment from one of Surat's wrecked transports, Herf and his associates, the Abednedo Toomata Wree and the Koorivar Makarial Gravin, traveled to Temmin's store to confront the youth. Speaking in Ithorese, he told the youth that he had stolen from Surat Nuat, the \"goodly savior\" of Myrra. As compensation, the gangsters demanded that the boy handover his junkshop to them.\nInstead, Temmin activated his modified B1-series battle droid Mister Bones. Herf attempted to shoot the droid with his DLT cannon but Bones sliced it into three pieces. He then tackled Herf and slammed him straight into Tooms. Mister Bones then knocked Herf and Tooms out by banging their heads together. An interrogator droid then incapacitated Makarial before she could shoot Temmin with a blaster. Temmin then ordered Mister Bones to dump the unconscious gangsters into the Kora Biedies. Herf and his associates regained consciousness and later rejoined Surat and the other henchmen. Herf sustained a bruised eye during the fight but was otherwise unhurt. Herf was present when Surat and his minions captured the Zabrak bounty hunter Jas Emari, who was working for the New Republic.\nHerf was a gangster who associated with other criminals and worked for the crime lord Surat Nuat. As an Ithorian, he spoke Ithorese. He wore a threadbare coat and had a long DLT cannon slung over his shoulder. While he could shoot, he was no match for the modified B1 battle droid Mister Bones, who served Temmin Wexley.\nHerf first appeared as a minor villain in Chuck Wendig's 2015 novel Aftermath, which was published as part of the Journey to Star Wars: The Force Awakens series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ithorian",
  "/wiki/Gender",
  "/wiki/Surat_Nuat%27s_gang",
  "/wiki/Gangster",
  "/wiki/Sullustan",
  "/wiki/Crime_lord",
  "/wiki/Surat_Nuat",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Akiva",
  "/wiki/Imperial_Era",
  "/wiki/Battle_of_Endor",
  "/wiki/Toomata_Wree",
  "/wiki/Makarial_Gravin",
  "/wiki/Junk_dealer",
  "/wiki/Temmin_Wexley",
  "/wiki/DLT_cannon",
  "/wiki/B1-series_battle_droid",
  "/wiki/Mister_Bones",
  "/wiki/Kora_Biedies",
  "/wiki/Human",
  "/wiki/Transport",
  "/wiki/Abednedo",
  "/wiki/Koorivar",
  "/wiki/Ithorese",
  "/wiki/Myrra",
  "/wiki/Interrogator_droid",
  "/wiki/Blaster",
  "/wiki/Eye",
  "/wiki/Zabrak",
  "/wiki/Bounty_hunter",
  "/wiki/Jas_Emari",
  "/wiki/New_Republic",
  "/wiki/Cannon",
  "/wiki/Battle_droid",
  "/wiki/Chuck_Wendig",
  "/wiki/2015",
  "/wiki/Aftermath_(novel)",
  "/wiki/Journey_to_Star_Wars:_The_Force_Awakens",
  "/wiki/Aftermath_(audiobook)"
 ]
}