{
 "name": "Hermi Odle",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Baragwin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.1 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink-purple mottle"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Hermi Odle was a male Baragwin gangster who worked as a weapons specialist and as the personal armorer of the Hutt crime lord Jabba Desilijic Tiure, helping to craft defenses for the Hutt's palace on the planet Tatooine. He was part of a crowd that refused to back Jabba's majordomo, Bib Fortuna, when Boba Fett confronted Fortuna at the palace while looking for Jabba.\nIn 4 ABY, Odle was present in Jabba's throne room when the droids R2-D2 and C-3PO delivered a message to Jabba from the Jedi Knight Luke Skywalker, and laughed when the Hutt declared he would not be bargaining with the Jedi for the freedom of the smuggler Han Solo. He was later present when Skywalker arrived at the palace and killed Jabba's pet rancor Pateesa.\nHermi Odle was a Baragwin male gangster with a shady past who was on the payroll of the crime lord Jabba Desilijic Tiure as the Hutt's personal armorer. He also worked as a weapons specialist and helped to craft the defences of Jabba's Palace on the desert planet Tatooine, where he could often be found.\nShortly after the smuggler Han Solo was frozen in carbonite in 3 ABY, Odle walked past the bounty hunter Amanaman and Solo's ally Lando Calrissian as Calrissian asked Amanaman to keep an eye out for the bounty hunter Boba Fett for him. Jabba later put a bounty on Fett after the bounty hunter had Solo's frozen form stolen from him while trying to deliver it to Jabba. Fett then traveled to Jabba's Palace to confront the Hutt, but was greeted at the gate by the Hutt's majordomo, Bib Fortuna.\nFortuna explained that Jabba was unavailable as he was attending an auction for Solo being held by Crimson Dawn. A crowd including Odle then emerged behind Fortuna, some with their weapons aimed at Fett, as the majordomo suggested that the hunter leave. Fett instead spoke to the crowd, asking if it was worth potentially dying for Fortuna's sake. The crowd lowered their weapons, and Fett passed by Odle as he walked into the palace with Fortuna to see the auction invitation.\nIn 4 ABY, he was present in the palace when the droids R2-D2 and C-3PO arrived early one morning with a holographic message from their master, the Jedi Knight Luke Skywalker. In the message, Skywalker asked to bargain with Jabba for the freedom of Han Solo, a imprisoned smuggler that the Hutt held frozen in carbonite and displayed on his throne room wall, and gifted him the two droids as a sign of good will. After the recording finished, Jabba announced that he had no interest in giving up his favorite decoration, causing Odle, who was stood in front of Solo's frozen form, to laugh.\nOdle was later sleeping in one of the throne room's booths the morning after a night of celebrations at the palace following the capture of Princess Leia Organa after she had freed Solo from carbonite. As the Baragwin dozed alongside Jabba and many other court members, Skywalker arrived at the palace and used mind tricks to reach the throne room, where the Hutt's majordomo, Bib Fortuna, woke the crime lord up. As the court also rose, Skywalker demanded that Solo, Organa, and the Wookiee Chewbacca be released, threatening Jabba with a blaster pistol when he refused.\nJabba then dropped Skywalker, and the unfortunate Gamorrean guard Jubnuk, through a trap door into a pit below the throne room. The court watched as Jabba's pet rancor, Pateesa, devored Jubnuk before being killed by Skywalker, outraging Jabba. Odle remained in the booth, by this point standing, as Skywalker, Solo, and Chewbacca were dragged before the Hutt and sentenced to death. Jabba and much of his court then traveled to the Great Pit of Carkoon to witness the executions, but the captives managed to turn the tables on their captors and killed the crime lord and many of his followers.\nHermi Odle was a massive Baragwin who stood 2.1 meters. A bizarre creature, his head and lips fell to the level of his throat, which gave the impression that the gangster was a hunchback. However, wise members of Jabba's court knew that he was far more dangerous then his stopped posture, shuffling gait, and drooping lip suggested. He had yellow eyes and mottled pink and purple skin.\nOdle wore a tattered cloak and clothing which were all brown in color.\nIn the current Star Wars canon, Hermi Odle first appeared in the original trilogy film Star Wars: Episode VI Return of the Jedi, which was released on May 25, 1983. He was played by the mime artist Phil Herbert, who was credited as a mime artist on the film. The full costume was based on a maquette of the character and measured 201 centimeters tall, 308 centimeters in diameter, and 102 centimeters wide and was designed by Phil Tippett. Creature builder Kirk Thatcher thinks it may have been Tony McVey who built the outfit, likely in a single afternoon. The palace throne room scenes filmed between January 25 and February 8, 1982 on Stage 8 at Elstree Studios.\nThe character was listed as number 26 on list of creatures being made for the film from November 4, 1981, which gave Hermi Odle as its production name, but also had \"Hemmy Moroid\" as a nickname.\" Odle's name is likely a take on 'Hear Me Yodel'. In the film's second draft, Odle sat on C-3PO while Jabba's pet Salacious B. Crumb tormented the droid during the barge scene. R2-D2 then saved C-3PO by giving Crumb and then Odle electric shocks to force them off the droid. This scene was used in the Star Wars Legends novelization of the film by James Kahn, which was released prior to the film on May 12, 1983, therefore marking the character's first appearance in the Legends continuity. The name was first used in-universe in the current canon by the mobile card game Star Wars: Force Collection, which initially launched in 2013. Although the launch of Force Collection predates the Star Wars canon reset of 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Hermi_Odle",
  "/wiki/Hermi_Odle/Legends",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Baragwin",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Gangster",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Planet",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Boba_Fett",
  "/wiki/Throne",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Jedi_Knight",
  "/wiki/Luke_Skywalker",
  "/wiki/Jedi",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Death",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Desert",
  "/wiki/Carbonite",
  "/wiki/3_ABY",
  "/wiki/Bounty_hunter",
  "/wiki/Amanaman",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Eye",
  "/wiki/Bounty",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Crimson_Dawn",
  "/wiki/Standard_day",
  "/wiki/Hologram",
  "/wiki/Prisoner",
  "/wiki/Sleep",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Mind_trick",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/DL-18_blaster_pistol",
  "/wiki/Gamorrean",
  "/wiki/Jubnuk",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Mouth",
  "/wiki/Cape",
  "/wiki/Clothing",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/May_25",
  "/wiki/1983",
  "/wiki/Phil_Herbert",
  "/wiki/Phil_Tippett",
  "/wiki/Tony_McVey",
  "/wiki/January_25",
  "/wiki/February_8",
  "/wiki/1982",
  "/wiki/Elstree_Studios",
  "/wiki/November_4",
  "/wiki/1981",
  "/wiki/Salacious_B._Crumb",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi_(novel)",
  "/wiki/James_Kahn",
  "/wiki/May_12",
  "/wiki/In-universe",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/2013",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/The_Adventures_of_Luke_Skywalker,_Jedi_Knight",
  "/wiki/Star_Wars_(2020)_2",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/June_29",
  "/wiki/2012",
  "/wiki/January_18",
  "/wiki/2021",
  "/wiki/Star_Wars:_Chronicles",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Behind_the_Magic"
 ]
}