{
 "name": "Herosk Bal'far",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Herosk Bal'far was a male Bothan who lived during the time of the Galactic Civil War. Sometime following the Battle of Yavin in 0 BBY, Pooja Naberrie tasked a spacer with locating Bal'far and escorting him back to the city of Dee'ja Peak on Naboo. Although the spacer was attacked by Imperial Army troopers and stormtroopers, Naberrie's mission was completed.\nHerosk Bal'far was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011.\nPlayers who performed a series of quests for Pooja Naberrie had to locate Bal'far and escort him safely back to Dee'ja Peak. However, due to a bug, many of the NPCs in Naberrie's quests were not properly sequenced. For instance, in the quest to escort Bal'far, players actually encountered an individual known as Jumis, who was supposed to appear in the following quest. The character model for Herosk Bal'far likewise erroneously spawned for Naberrie's sixth and final quest, in which the player was supposed to encounter an individual named Melloc Fitzal. According to the game files, Bal'far could not be properly escorted, as the character , was not designated as an \"escort\" NPC. Nevertheless, it was possible for the player to complete the mission and advance to the next quest. This article assumes that the content of Naberrie's quest dialogue is canon in the Star Wars Legends continuity, and that Bal'far, not Jumis, actually appeared during her second quest.\nFurthermore, because Herosk Bal'far spawned under the generic \"noble\" template, his appearance was randomized under one of forty-two possible depictions. Species Bal'far could appear as included Bothans, Humans, Rodians, Trandoshans, Twi'leks, and Zabrak under either gender. Because the quest dialogue identified Bal'far as a male Bothan, this article assumes that the randomly generated male Bothan depiction is canon in the Star Wars Legends continuity. The questline that involved Bal'far was eventually removed from the game when Pooja Naberrie was relocated to Theed as part of the newly introduced Legacy Quest, released as part of Publish 25's New Game Enhancements on November 15, 2005.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Pooja_Naberrie/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/City/Legends",
  "/wiki/Dee%27ja_Peak/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Imperial_Army_trooper/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Jumis",
  "/wiki/Melloc_Fitzal",
  "/wiki/Canon",
  "/wiki/Species/Legends",
  "/wiki/Human/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Theed/Legends",
  "/wiki/November_15",
  "/wiki/2005"
 ]
}