{
 "name": "Hershel Sheridan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Hershel Sheridan was a male Human politician that lived on Corellia at the time of the Galactic Civil War.\nAround the time of the Battle of Yavin, Hershel ran for the office of mayor of the city of Kor Vella. His primary opponent during this election was Deel Draav. Both used foul tactics during the election, but in the end Sheridan lost the ballot, though not by much. According to CorSec officer Lon Cope, he took losing the election pretty badly.\nIn 1 ABY, Sheridan was killed by the Chirq Council, a powerful Corellia-based crime organization. He was shot in the head in his own house and a DL-44 blaster was put into his hand to make it look like he had taken his own life. The Chirq Council wanted to kill Mayor Draav and tried to make it look like Sheridian was the culprit. They left a scrap paper with his letterhead near a transmitter that had been used to relay threatening messages to Draav. An independent agent investigating the case for Lieutenant Cope found the paper and then discovered Sheridan's body with the blaster in his hand. Sheridan was thought to be the one responsible for the attempted murder and the case was closed.\nHowever Draav was later killed in a second assassination attempt and the case was reopened. Upon re-examining the body, the agent discovered that the blaster didn't have a power cell in it. Further investigations showed that Sheridan was murdered by the Chirq Council and didn't kill Draav.\nHershel Sheridan was a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies, prior to its closure on December 15, 2011. Hershel Sheridan was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006. His corpse could be found in his house in Kor Vella on Corellia. The player was asked by Lon Cope to investigate the attack on Deel Draav and during this quest discovered a scrap of paper in an abandoned bunker. The player then received a waypoint to Sheridan's house where the corpse was found. After Draav is murdered, the player had to examine the corpse a second time. This eventually lead to the discovery of the Chirq Council as well as several CorSec operations to eliminate the organization. These quests were part of the Legacy quest, the longest quest line in the game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Lon_Cope",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Politics/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Mayor/Legends",
  "/wiki/Kor_Vella/Legends",
  "/wiki/Deel_Draav",
  "/wiki/Corellian_Security_Force",
  "/wiki/Chirq_Council",
  "/wiki/Hershel_Sheridan%27s_house",
  "/wiki/DL-44_heavy_blaster_pistol/Legends",
  "/wiki/Power_pack",
  "/wiki/Sony",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Abandoned_Bunker",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}