{
 "name": "Hesker",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Imperial Guard",
      "Imperial Guard"
     ]
    }
   ]
  }
 ],
 "content": "Hesker was a male Human general of the Imperial Guard of the reconstituted Sith Empire during the Cold War.\nGeneral Hesker was a brilliant field tactician, an accomplished pilot and virtually unstoppable in battle. He first saw military action as a young man during the Sacking of Coruscant; assigned to the first wave of shuttles to land on the surface, his squad was intended for a diversionary role to draw initial Republic fire. But Hesker refused to be used as mere blaster fodder. Instead, he led his team in a furious assault that broke the Republic lines and transformed the battle into an Imperial rout.\nHe quickly gained recognition inside both the Imperial military and the Imperial Guard, and his deeds since firmly established his reputation as one of the Empire's greatest military heroes. During the Cold War, Hesker became the head of the Imperial Guard stationed on Corellia during the Battle of Corellia and aided the Imperial spacers during the raid on the Green Jedi Enclave. During the Galactic War, he was also in command during the Republic retaking of the planet when he was defeated by an individual aligned with the Republic and was captured.\nHe eventually made his way back to the Empire and was present on Ilum when Darth Malgus declared himself Emperor of the New Empire. Chosen as the Imperial strike team's pilot during the Battle of Ilum, he directed them and helped provide air support until he was shot down by Darth Serevin, ejecting at the last minute as his ship crashed into a ravine. After Serevin's death, the strike team stole his vessel, which Hesker used to pilot them to Malgus' space station. As the strike team fought their way to Malgus, he engaged in dogfights with the stealth armada. Following Maglus' defeat, he rescued the team from the space station, now on the verge of self-destruct. He later attended the debriefing along with the strike team and other key Imperial leaders.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Guard",
  "/wiki/General/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Battle_of_Corellia",
  "/wiki/Galactic_War",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Ilum/Legends",
  "/wiki/Darth_Malgus",
  "/wiki/New_Empire",
  "/wiki/Battle_of_Ilum",
  "/wiki/Darth_Serevin",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}