{
 "name": "Hethrir",
 "display_name": "Hethrir",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Firrerre"
     ]
    },
    {
     "name": "Died",
     "values": [
      "14 ABY",
      "Crseih Station"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Firrerreo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.78 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Goldcopper and cinnamon striped"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Order of the Sith Lords",
      "Empire Reborn"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Vader"
     ]
    }
   ]
  }
 ],
 "content": "Hethrir was a Force-sensitive Firrerreo male who was at one time, along with his lover Rillao, an apprentice of Darth Vader. His powers in the dark side of the Force would become a threat to not only his son Tigris, but also the children of Han and Leia Organa Solo. Under Emperor Palpatine, Hethrir held the office of Procurator of Justice and with the defeat of the Empire in 4 ABY, became the leader of the Empire Reborn insurgency.\nLord Hethrir, a Firrerreo, was presumably born on the Firrerreo homeworld of Firrerre during the last decades of the Galactic Republic. During the reign of Emperor Palpatine, he was handpicked by the Sith Lord Darth Vader to receive training as a Dark Jedi. Hethrir excelled in his training, and as a reward, was appointed Procurator of Justice, head of the entire Imperial justice system. The role was an anonymous one, during which he exiled thousands of prisoners in passenger freighters, and amassed a fortune from his exclusive ability to harvest body-wood.\nForeseeing the fall of the Empire, Lord Hethrir made preparations for this eventuality, and when it finally occurred, he fled taking his resources and followers with him into hiding. There he lay low, protected by the anonymity of his former position, plotting for a way to regain his position and restore the glory of the Empire. He developed a vision of an Empire Reborn, with himself as the new Emperor.\nTo achieve this goal, he knew he needed greater access to the Force, and so he also had Crseih Station constructed to serve as a mobile research center where experiments that tested the limits of realspace, hyperspace and otherspace. In 3 ABY, Crseih Station relocated to the Crseih system where it orbited a black hole and a crystallizing white dwarf star. Due to a combination of the disturbances in the Force of a crystallizing star and Hethrir's torturing of his prisoners, a mysterious alien known as Waru was brought into the galaxy from another dimension. He was a hideous, extradimensional, Force-sensitive mass of flesh that claimed to be a healer . In exchange for Force-sensitive victims to feed on, Waru would give Hethrir absolute power over the Force.\nSequestered alternatively on Crseih Station and his private worldcraft—a unique gift from the Emperor himself—Hethrir built up a broad power base. Hethrir financed his movement with a flourishing slave trade, supplied by the thousands of prisoners he had condemned and imprisoned in sleeper ships, including his own people, the Firrerreo. Hethrir believed that both he and the Empire would last a thousand years. Thus, after a thousand years, Hethrir planned to return to those freighters and awake their prisoners from their sleep, in the hopes that they would remember him as an all-powerful god whom they had to obey.\nHe established Crseih Research Station—under the alias Asylum Station—as the hub of this slave trade. Disgruntled Imperial lords, eager to regain their power and influence—such as the Lords Brashaa, Cnorec, and Qaqquqqu, and Lady Ucce—joined him, swearing an oath of secrecy and devotion, bringing with them numerous followers and starships.\nWith these finances the Empire Reborn purchased armament from gangsters such as the Rodian Reelo Baruk, and, using armor, shield generators, and power cores scavenged from the derelict Star Destroyers orbiting Endor, outfitted a fleet, with the Doomgiver as its flagship. Hethrir recruited Imperial Remnant Admiral Galak Fyyar to his cause in 10 ABY, financing many of his technological enterprises. Fyyar was known more for technological innovation than his skills as a military leader, but had worked closely with the Emperor before disappearing after his death. He consolidated their presence in the Outer Rim, while alliances with Deep Core warlords such as Admiral Harrsk were pursued to strengthen their Core support.\nWhen Hethrir and Rillao conceived a child, Darth Vader had high hopes for turning it to the dark side. Rillao, however, had other ideas, and spirited herself and Tigris  away. Hethrir eventually caught up with them and tortured Rillao, keeping Tigris as his servant.\nHethrir's military forces were led by Admiral Galak Fyyar. Despite an anti-alien bias, Hethrir made Desann  his right hand in the movement, entrusting him with the task of forming a Dark Jedi army. Searches for Force-sensitives on back water worlds such as Tatooine was the main form of recruiting for this army.\nThose with potential were abducted and taken to the worldcraft for indoctrination. Hethrir, with an ability to dampen others' Force abilities, would often prevent non-Humans from demonstrating any Force-ability, consigning them to be sold as slaves. Those Humans with Force-potential moved up the ranks of the Helpers, Proctors and Empire Youth. Many of Hethrir's trainees were taken to the temple of the Waru on Crseih Station to be \"purified\". Waru was posing there as a healer, but occasionally killed beings brought for healing, sucking in their strength.\nSeveral of Hethrir's Empire Youths, Force-sensitive individuals who had shown devotion to the Empire Reborn and had been \"purified\" by Waru, were entrusted to Desann by the Firrerreo. Desann, in addition to training those with talent, experimented with imbuing Human Empire Youths without much Force talent  with dark side powers, using Force crystals and ancient alchemical secrets of Sith origin.\nHethrir also sought the Valley of the Jedi, which had been revealed to exist by an ally, High Inquisitor Antinnis Tremayne. He tasked Desann with locating it, which he did by tricking the Jedi Knight Kyle Katarn into revealing its location. Desann led his students to the psychic bloodstain remaining at the site, quadrupling their innate powers with the leftover energy from the freed Jedi sprits that were once trapped there. These empowered Empire Youths came to be called the Reborn.\nEventually, however, Katarn and Skywalker dealt with Desann and the Reborn, hampering the Empire Reborn movement.\nDespite pressure mounting from his supporters, and the huge investment into research and training lost, Lord Hethrir still had control of the younger Empire Youth and affiliated indoctrination programs. Having run out of freighter children to sell, he began to steal them from Republic worlds. As such, he was still able to supply Waru with Force-sensitives, and keep his bargain alive. With the Republic preoccupied by Gilad Pellaeon's Orinda campaign, Hethrir received a brief reprieve, reorganizing some of his facilities such as that on Alzoc III. However, Kyle Katarn and the Republic continued to dog his steps, destroying that base, and killing some more of his precious few remaining Reborn. Rumors of abducted children also began to surface with Republic agent Winter sent out to investigate.\nStill, Hethrir knew that if only he could get Waru to empower him, he could realize his vision. What he needed was a child exceptionally strong in the Force that would enable the Waru to return to his home dimension and allow Hethrir to receive the boundless power he craved. Hethrir believed the Solo children would serve this purpose.\nFortuitously, Chief of State Leia Organa Solo was undertaking a tour of the Outer Rim worlds soon after in 14 ABY, and was taking her children along with her. While Mon Calamari and Gbu, the first planets on her itinerary would provide no opportunities, Munto Codru, the third planet on the tour, would provide the perfect arena for a kidnapping attempt. Its political system included ritualized \"coup abductions\" of noble children, who were later ransomed off unharmed. Hethrir correctly surmised that any pursuit or reprisals would be delayed under the assumption his kidnapping was only a part of the political sport.\nTemporarily blocking Leia's ability to sense her children, and using a pressure bomb to incapacitate the children's minders—the Wookiee Chewbacca and a local page—Anakin, Jacen, and Jaina Solo as well as the Munto Codru chamberlain's wyrwulf were captured and whisked away by skiff. They were shipped off planet to Hethrir's worldcraft, while Leia was still being advised to wait for a ransom request.\nOn his worldcraft, Hethrir told the children their parents were dead and that he would look after them from now on as their hold-father. The children were suspicious, however, and proved remarkably resistant to the programming. Hethrir assigned his own son, Tigris, to look after Anakin, and put the twins in with the rest of the imprisoned children, including a Chironian girl, Lusa. The kidnapped children caused much trouble at the station, using the Force to harass the young Proctors.\nThough held in separate cells, the Solo twins managed to escape their cells, taking a number of the other children with them. With the aid of a female sand dragon that Jacen communicated with, they escaped the entire compound and hid from the Proctors and Helpers in a swamp.\nMeanwhile, Leia and Chewbacca had been tracking Hethrir through the Force. They discovered a cluster of 24 sleeper ships, including one containing Hethrir's ex-mate, the Jedi healer Rillao. Five years earlier, Hethrir had imprisoned her in a web like torture device on the ship. This ship was full of Firrerreo that Hethrir had imprisoned as a sign of his loyalty to the Emperor, after which he destroyed their entire world. Joining their party, Rillao led Leia and Chewbacca to the bureaucratss of Chalcedon—a rival in the slave trade to Hethrir's own Asylum Station. Rillao revealed that Hethrir had stolen their son Tigris from her, hoping that he would succeed Hethrir as leader of his Empire Reborn. Upon realizing Tigris had no Force-potential, Hethrir had not even revealed his parentage to the boy, but kept him around as his personal servant.\nArriving at the worldcraft, Leia, Chewbacca, and Rillao rescued Jacen, Jaina and the other children in the Alderaan. They were too late to rescue Anakin though, for Hethrir had already departed for Crseih Station with a phalanx of Proctors, intending to relaunch the Empire Reborn and sacrifice Anakin in the temple of the Waru. Following close on his heels, the two mothers pursued.\nAlso on Crseih Station, Han Solo and Luke Skywalker were investigating reports of a lost Jedi, leaked by con-artist and former acquaintance of Solo, Xaverri. Xaverri had been on the station for a number of years and was deeply concerned about the \"healer\" Waru, and wanted them to investigate. Luke, however, seemed to be taken by the strange being, his judgment and Force ability crippled by the resonance of the nearby crystallizing star. He became distrustful of Han and Xaverri and convinced he needed Waru's help and healing.\nThe conflict came to a head, as the three parties met in the temple of the Waru. In a grand ceremony surrounded by all his supporters, Lord Hethrir planned to sacrifice Anakin on the altar of Waru. The newly arrived Rillao revealed to her son the truth about his father and, Tigris, realizing the infant Anakin had no choice in being \"purified,\" turned on Hethrir, preventing the sacrifice. The unbalanced Skywalker dove into the Waru in Anakin's place, forcing Han and Leia to follow. Hethrir, realizing that Luke was a better sacrifice than Anakin anyway, believed his plans were finally coming to fruition. Rillao, however, launched herself onto Hethrir in a furious attack.\nInside the golden ichors of the Waru, Han and Leia managed to draw Luke back, aided by the cries of the Solo children. Enraged by the missed opportunity and Hethrir's failure to fulfill his bargain, Waru consumed Hethrir instead. Using Hethrir's Force power, the being returned to its home dimension, presumably killing Hethrir.\nWith the crystallizing star dragged dangerously into the black hole, the entire Crseih Station was slaved to the  Millennium Falcon  and together they jumped into hyperspace to the Codru system. The remaining Proctors and many of Hethrir's supporters were rounded up and arrested on the station. With Hethrir, Fyyar and Desann killed, the Empire Reborn movement collapsed. Aware of its existence, Leia pledged to find the remaining Empire Youth saboteurs. Some remained at large and eventually joined Desann's former apprentice Tavion Axmis, in a Sith cult, called the Disciples of Ragnos. The cult was later destroyed by the joint efforts of Luke Skywalker, Kyle Katarn, and his new apprentice Jaden Korr.\nThe Republic claimed the worldship and Crseih Station, and returned the other kidnapped children to their families. Some of the children, most notably the Chironian Lusa, would go on to join the Junior Jedi Academy on Yavin 4. Crseih Station would eventually be moved to orbit the planet Pakuuni.\nHethrir's slaveships were recovered and the Firrerreo people would eventually settle on the planet Belderone, made welcome by another former dark Jedi, Flint. Hethrir's captured worldcraft would be studied by Republic engineers, including a former designer of the Death Star, Bevel Lemelisk, and the technology was later used in the New Class project.\nFinally, Hethrir's dream of a resurgent Empire would never be realized with the Imperial Remnant driven back to a paltry number of sectors in the Outer Rim. It would later sign a treaty with the Republic, the Bastion Accords, bringing to an end the long Galactic Civil War. Despite this, Hethrir's past actions, particularly his attitude towards alien individuals, would accelerate the growth of anti-Human sentiments among alien peoples and individuals such as Lusa, who joined the Diversity Alliance as a result.\nHethrir was a fully trained Dark Jedi, he was trained in lightsaber combat and the arts of the Dark side of the Force by Darth Vader, he could suppress other people Force potential, keeping them from using the Force and perform various feats of telekinesis including a technique that would cause a great nosebleed to an opponent before killing it. Despite his great power he knew he didn't have the same potential as young Anakin Solo and therefore planned to sacrifice him to Waru to increase his own power.\nIn Young Jedi Knights: Jedi Bounty, Hethrir is referred to as having been Human, despite the characters making this claim having known he was a Firrerreo. However, since these characters are affiliated to the anti-Human Diversity Alliance extremist organization, it may just be them deliberately spreading disinformation and anti-Human propaganda. This does not, however, explain why the Solo twins did not dispute the claim despite knowing it to be false. In fact, in Young Jedi Knights: Delusions of Grandeur, Jaina Solo comments that \"certainly Hethrir had been Human.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Firrerre/Legends",
  "/wiki/14_ABY/Legends",
  "/wiki/Crseih_Station",
  "/wiki/Firrerreo/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Dark_Side_Adept",
  "/wiki/Empire_Reborn",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Rillao",
  "/wiki/Force_power/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Tigris",
  "/wiki/Han_Solo/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Procurator_of_Justice",
  "/wiki/4_ABY/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Worldcraft",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Passenger_freighter",
  "/wiki/Body-wood",
  "/wiki/The_Force/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Crseih_system",
  "/wiki/Torture/Legends",
  "/wiki/Waru",
  "/wiki/Firrerreo_Genocide",
  "/wiki/Brashaa",
  "/wiki/Cnorec",
  "/wiki/Qaqquqqu",
  "/wiki/Ucce",
  "/wiki/Rodian/Legends",
  "/wiki/Reelo_Baruk",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Doomgiver",
  "/wiki/Imperial_Remnant",
  "/wiki/Admiral/Legends",
  "/wiki/Galak_Fyyar",
  "/wiki/10_ABY/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Deep_Core/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Blitzer_Harrsk",
  "/wiki/Emperor%27s_Retreat/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Humanocentrism",
  "/wiki/Desann",
  "/wiki/Chistori",
  "/wiki/Jedi_academy",
  "/wiki/Havet_Storm",
  "/wiki/Tatooine/Legends",
  "/wiki/Helpers",
  "/wiki/Proctor_(Empire_Reborn)",
  "/wiki/Empire_Youth",
  "/wiki/Artusian_crystal",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Valley_of_the_Jedi",
  "/wiki/High_Inquisitor",
  "/wiki/Antinnis_Tremayne",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Wound_in_the_Force",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Orinda_campaign",
  "/wiki/Alzoc_III/Legends",
  "/wiki/Mission_on_Alzoc_III_(Empire_Reborn)",
  "/wiki/Winter_Celchu",
  "/wiki/House_of_Solo",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gbu",
  "/wiki/Munto_Codru/Legends",
  "/wiki/Pressure_bomb",
  "/wiki/Wookiee/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Anakin_Solo",
  "/wiki/Darth_Caedus",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Chamberlain/Legends",
  "/wiki/Wyrwulf",
  "/wiki/Skiff/Legends",
  "/wiki/Hold-Parent",
  "/wiki/Chironian",
  "/wiki/Lusa",
  "/wiki/Mistress_Dragon",
  "/wiki/Sand_dragon/Legends",
  "/wiki/Jedi_healer/Legends",
  "/wiki/9_ABY/Legends",
  "/wiki/Base_Delta_Zero/Legends",
  "/wiki/Unidentified_boneless_species",
  "/wiki/Chalcedon/Legends",
  "/wiki/Alderaan_(yacht)",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Xaverri",
  "/wiki/24_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Black_hole/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Codru_system",
  "/wiki/Disciples_of_Ragnos",
  "/wiki/Jaden_Korr",
  "/wiki/Junior_Jedi_Academy",
  "/wiki/Pakuuni/Legends",
  "/wiki/Belderone/Legends",
  "/wiki/Flint",
  "/wiki/Death_Star/Legends",
  "/wiki/Bevel_Lemelisk",
  "/wiki/New_Class_Modernization_Program",
  "/wiki/Pellaeon%E2%80%93Gavrisom_Treaty",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Anti-Humanism",
  "/wiki/Diversity_Alliance",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Anakin_Skywalker",
  "/wiki/Young_Jedi_Knights:_Jedi_Bounty",
  "/wiki/Young_Jedi_Knights:_Delusions_of_Grandeur",
  "/wiki/Millennium_Falcon_(novel)",
  "/wiki/Millennium_Falcon_(audiobook)",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/The_Crystal_Star",
  "/wiki/Before_the_Storm",
  "/wiki/The_New_Rebellion",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/The_Deadly_Dozen",
  "/wiki/Star_Wars_Galaxy_Magazine_8",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_9",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File_104",
  "/wiki/Wizards.com",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/Ask_the_Master",
  "/wiki/Star_Wars_Insider_82",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/StarWars.com",
  "/wiki/Sony",
  "/wiki/Aliens_in_the_Empire",
  "/wiki/Threats_of_the_Galaxy",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Galactic_Hunters",
  "/wiki/Template:SWGTCG",
  "/wiki/Jedi_Academy_Training_Manual",
  "/wiki/Databank_(original)",
  "/wiki/N.R.I._Reports",
  "/wiki/Star_Wars:_Jedi_Knight_II:_Jedi_Outcast",
  "/wiki/Star_Wars:_Jedi_Knight_II:_Jedi_Outcast_demo",
  "/wiki/Star_Wars:_Jedi_Knight:_Jedi_Academy",
  "/wiki/Young_Jedi_Knights:_The_Emperor%27s_Plague",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Vision_of_the_Future"
 ]
}