{
 "name": "Hetton",
 "display_name": "Hetton",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Serenno"
     ]
    },
    {
     "name": "Died",
     "values": [
      "990 BBY",
      "Ambria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Great Houses of Serenno",
      "House Demici",
      "House Demici",
      "Anti-Republic Liberation Front",
      "Order of the Sith Lords"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Gula Dwan",
      "Darth Zannah"
     ]
    }
   ]
  }
 ],
 "content": "Hetton was a Human male who was related to the Demici family, one of the Great Houses of Serenno. From a young age he knew he was Force-sensitive, and as a young man was encouraged by his mother to search for means of training his abilities without having to pledge allegiance to either the Jedi or Sith. He used his family's wealth and connections to collect an array of artifacts and documents teaching him about the dark side of the Force.\nHe went on to form the Anti-Republic Liberation Front, a rebel organization that protested against Serenno's membership with the Galactic Republic. This, however, was a front for his true objective: the resurrection of the Sith following their near-total destruction after the Seventh Battle of Ruusan. Members of his order brought Darth Zannah before him after their failed kidnapping of former Supreme Chancellor Tarsus Valorum in 990 BBY. They believed her to be responsible for the failure of the plot, possibly by revealing it to the authorities.\nUpon witnessing her command of the dark side, Hetton pledged himself to becoming her apprentice, despite being over twice her age. He persuaded Zannah by granting her the sum of his collected knowledge and control of the Umbaran-trained Shadow Assassins that had come under his command following the defeat of Skere Kaan's Brotherhood of Darkness. Zannah \"agreed,\" on the condition that first they would have to defeat her own Master, Darth Bane. However, Hetton underestimated Bane, and Zannah led both him and his assassin bodyguards to their deaths.\nHetton was born on the Galactic Republic world of Serenno. Hetton's father died shortly after his birth, leaving his mother, Loranda, as head of the family. Being related to House Demici, one of the Great Houses of Serenno, Hetton's family held some sway in planetary politics. Because of this, his mother spent most of her time engaged in the political pursuits that would advance their family's position and wealth. As a result Hetton was raised almost exclusively by servants. From a young age, he knew that he could touch the Force, although the servants he was charged to concealed this from all others, including his mother. By the time Loranda discovered his abilities, Hetton was already a young man in his twenties—he convinced his mother to use the family wealth to search for means by which he could learn more about the Force. Having no allegiance to the Jedi or the Sith, and believing his skills could be used to increase the family's power and wealth, she agreed.\nLoranda hired Gula Dwan, a bounty hunter with some ability to sense and use the Force, to train her son. She also used some of their family's wealth to search for artifacts to supplement her son's learning. However, the artifacts and information Hetton used in conjunction with Dwan's training allowed him to surpass his Master's meager abilities. It was at this point that Hetton chose to embrace the dark side. Hetton realized through his study of artifacts that his \"Master\" did not truly understand the Force, and Dwan merely saw his abilities as a professional advantage. After discussion with his mother, they both agreed Dwan had ceased to be of use to Hetton. Loranda did not want the Jedi or Sith discovering her son's training, and so Hetton killed his former Master.\nIn 1006 BBY, the Sith Lord Skere Kaan began looking for Force-sensitives to join his Brotherhood of Darkness, believing vast numbers of Sith would crush the more numerous Jedi. Loranda implored Hetton to join the Sith and bring glory to their family. Hetton, however, was loathe to join them, as Kaan's promise of \"equality\" contradicted every other Sith artifact he had studied. He realized his mother only thought in governmental alliances and politics, and feared she would reveal him to the Sith. To avoid this, he took what he believed the only course left to him; he committed matricide, poisoning her in her sleep. He continued to hide from both Jedi and Sith for the duration of the New Sith Wars, all the while using his connections to continue seeking information on the ancient Sith to supplement his knowledge.\nFollowing the defeat of the Brotherhood on Ruusan, Hetton started gathering together followers who wanted to overthrow the Republic. Serenno held great influence both politically and economically, and had a thriving trade. Many people disagreed with the laws passed by the Republic Senate over all member worlds concerning certain goods and created many factions protesting against Republic membership. Hetton's connections from his family ties and his abundant funding ensured that his newly created Anti-Republic Liberation Front would quickly become one of the largest and most prominent rebellious groups. The members possessed better equipment and weapons, and professionally trained members like soldiers and guards were the norm rather than the exception.\nHetton was open to all species within his rebel movement, allowing the Lethan Twi'lek Kelad'den and the elusive Chiss Cyndra into the fold. He was also a leader whose opinions held much sway over his followers. Some, like Paak, were reluctant to follow the instructions of others without confirmation from their leader.\nDarth Zannah infiltrated a small band of ARLF members with the cover of an embassy worker, convincing them to attempt an abduction of the Republic envoy and former Supreme Chancellor Tarsus Valorum. However, the group's attempt was thwarted by Jedi Knight Johun Othone, Valorum's unofficial protector. The two survivors from the attack believed Zannah, as the most recent recruit, to have betrayed the syndicate and revealed the plot to Valorum. They found Zannah and brought her before Hetton.\nHetton watched in silent awe as Zannah used Sith sorcery on Cyndra, forcing her to witness her greatest nightmares until she clawed out her own eyes, leaving her mentally crippled, and again as she used the Force to free herself and used her lightsaber to reflect Paak's blaster bolts back upon himself. Once she was free of her guards, Hetton bowed before her.\nHetton took Zannah through his gallery of Sith artifacts, revealing to her all the elements of his past and how he came to learn of the dark side. He also revealed his true purpose for the Anti-Republic Liberation Front—a cover for the resurrection of the Sith and its domination of the Republic. Using the sum of his collected information and knowledge to sway her, he pledged himself to becoming her apprentice, promising her control over him and the eight Shadow Assassins he had in his employ. Hetton also revealed he had information that gave the coordinates to Tython and the resting place of Belia Darzu, a Sith Lord who was rumored to have mastered mechu-deru, the ability to infuse organic creatures with metal using the dark side. He also believed that Darzu had uncovered the secret of constructing holocrons.\nWith his new Master and Shadow Assassins by his side, Hetton flew to Ambria with the intention of killing Zannah's Master, Darth Bane. The assassins surrounded Bane, expecting him to die when attacked by their force pikes. However, the Sith Lord sensed their presence and was protected by his orbalisk armor. He killed the assassins, before turning on Hetton. Only at this point did Hetton see Zannah had deceived him to gain the sum of his knowledge, and Bane stabbed him through the chest with his lightsaber.\nBeing related to the Demici family, Hetton was born into a position of political power on Serenno. He was, therefore, taught from a young age about appearing as such. He carried himself with elegance and pride, maintaining a composed exterior around events that would cause discomfort to most others. By the point of his matricide he was a wealthy and influential political figure.\nHaving been raised in political circles, he had become a shrewd and cunning man, knowing how to achieve his own ends using persuasion and coercion. This political experience also allowed him to hide his true intentions from others, as he held the public appearance of supporting the Republic with the Great Houses while working to undermine it with the Anti-Republic Liberation Front.\nHetton was an ambitious man who sought power through the dark side; this overrode the planetary political power that his parents had focused on. This ambition drove him to kill both his former Master, Gula Dwan, and his mother, to allow his continued development in the dark side.\nDespite finding numerable Sith artifacts and relics, without proper training Hetton's ability to use the Force could not advance beyond a certain point. He would end up relying more on the connections he had formed and the Shadow Assassins he had as his bodyguards for his defense. However, he did train himself to use basic telekinesis and Force lightning, which he used unsuccessfully against Darth Bane. Although he procured a green lightsaber, he had little or no training in using it, as Bane identified by his stance and the way he held the weapon.\nHetton was created by Drew Karpyshyn. He first appeared in Darth Bane: Rule of Two and is killed by the title character. Hetton has two purposes within the novel. The first is the continuation of a key plot—Bane seeks to create a holocron, and Hetton has acquired information that can tell him how. The second purpose is to show that not all Sith were destroyed on Ruusan. The assassins Hetton commands are evidence that at least some of the Sith agents survived, and indicates that not all Sith joined Kaan's Brotherhood. Hetton later received mention in Karpyshyn's 2009 novel, Darth Bane: Dynasty of Evil.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Serenno/Legends",
  "/wiki/990_BBY",
  "/wiki/Ambria/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Great_Houses_of_Serenno",
  "/wiki/House_Demici/Legends",
  "/wiki/Anti-Republic_Liberation_Front",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Gula_Dwan",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Loranda",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/Kidnap_attempt_on_Serenno",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Tarsus_Valorum/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Umbaran/Legends",
  "/wiki/Sith_assassin/Legends",
  "/wiki/Skere_Kaan",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/Duel_on_Ambria",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Death/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Politics/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/1006_BBY",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith_artifact/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Ruusan/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Species/Legends",
  "/wiki/Lethan",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Kelad%27den",
  "/wiki/Chiss/Legends",
  "/wiki/Cyndra",
  "/wiki/Paak",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Johun_Othone",
  "/wiki/Sith_magic",
  "/wiki/Lightsaber/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Belia_Darzu",
  "/wiki/Mechu-deru",
  "/wiki/Holocron/Legends",
  "/wiki/Force_pike/Legends",
  "/wiki/Shiak",
  "/wiki/Darth_Bane%27s_lightsaber",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Drew_Karpyshyn",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/2009",
  "/wiki/Darth_Bane:_Dynasty_of_Evil",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/Darth_Bane:_Dynasty_of_Evil_(audiobook)"
 ]
}