{
 "name": "Hewpaj",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Coruscanti"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Blank Look Gang"
     ]
    }
   ]
  }
 ],
 "content": "Hewpaj was a male Human Coruscanti thief and a member of the Blank Look Gang during the Rise of the Empire era.\nAt some point during his time as a member of the gang he and Urnon Mossu were both chosen to steal a collection of Antique Twi'lek pots from the Galactic Museum in CoCo Town on the planet Coruscant for an anonymous wealthy client of the gang. The pair attempted this by having a female college infiltrate the museum and reprogram one of the ASP-7 labor droids that worked there to bring the pots to the museum's loading dock and walk off the edge with them into a waiting speeder, driven by Urnon. Hewpaj's job was to distract the museum staff with his sniper rifle from a nearby building until Urnon picked him up after collecting the stolen pots. However during their escape the pair were chased by a group of spacers which caused them to crash their stolen hot rod speeder into the Royal Icqui Aquaria. Both ended up in the tank of a Pierceskimmer where they were knocked unconscious and possibly devoured by the beast.\nHewpaj was a character in the saga edition Star Wars Roleplaying Game mini-adventure Art For Art's Sake and so the above biography assumes the adventure is completed as suggested in the article.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Coruscanti/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Blank_Look_Gang",
  "/wiki/Rise_of_the_Empire_era",
  "/wiki/Urnon_Mossu",
  "/wiki/Antique_Twi%27lek_pots",
  "/wiki/Galactic_Museum",
  "/wiki/CoCo_Town/Legends",
  "/wiki/Planet/Legends",
  "/wiki/ASP-7_labor_droid",
  "/wiki/Sniper_rifle/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Hot_rod",
  "/wiki/Speeder/Legends",
  "/wiki/Royal_Icqui_Aquaria",
  "/wiki/Pierceskimmer",
  "/wiki/Star_Wars_Roleplaying_Game_Saga_Edition_Core_Rulebook",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Art_For_Art%27s_Sake",
  "/wiki/Wizards.com"
 ]
}