{
 "name": "Hidden Bek lookout",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hidden Beks"
     ]
    }
   ]
  }
 ],
 "content": "This female Human member of the Hidden Beks swoop gang guarded the entryway to the Beks' base of operations.\nShe guarded the door of the Beks' base during the Bek–Vulkar gang war, even after the Sith Empire conquered Taris during the Jedi Civil War. When the amnesiac former Dark Lord of the Sith Revan along with Carth Onasi attempted to visit the Hidden Beks' base while searching for Jedi Knight Bastila Shan, she at first barred them passage. After Revan suggested that he help the Beks in their war, the guard admitted the pair, advising them to watch out for Zaerdra, the bodyguard of Bek leader Gadon Thek, and to not make any wrong moves.\nAfter Bastila was rescued at the Tarisian Season Opener, the guard warned Revan that the Black Vulkars would be looking for him so they could avenge the death of their leader, Brejik.\nAs a result of the gang war, she became suspicious of most strangers, and immediately thought that Revan was a Vulkar spy when he approached her, wishing to see Thek. However, she relented when Revan offered to lend his support to the Beks' cause. She was very loyal to Gadon, and refused to be swayed by offers of bribes.\nThe Bek lookout was first introduced in the computer and video game Star Wars: Knights of the Old Republic. If the player attempts to enter the base disguised as a Sith trooper, she will not let them in. Being a Hidden Bek, she will also help the player fight any Vulkars that come across in her line of sight.\nIf the player chooses to take the dark side path throughout the game, they will accept the offer from Kandon Ark to switch allegiance to the Black Vulkars. Before the player can enter the Tarisian Season Opener for the Vulkars, the dark-side player must then infiltrate the Bek Base and kill Gadon. After leaving the Bek base, the lookout will then attack the player.\nShe has a line where she recognizes the player as the winner of the swoop race, and if they raced for the Vulkars, she will declare intent of revenge and then attack. As this dialogue can only be initiated when she is non-hostile, and working for Kandon turns her hostile before the race occurs, this can only be seen by using glitches. After racing for the Hidden Beks and rescuing Bastila, you can still go kill Gadon. A Security skill of 91+ can open the \"Impossible\" locked doors that lead to Gadon where he will turn hostile. After killing him and exiting the base, you can hear this line from the lookout, despite the player never having raced for the Vulkars. However, she still remains invincible when glitching her this way.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hidden_Beks",
  "/wiki/Swoop_gang/Legends",
  "/wiki/Hidden_Bek_Base",
  "/wiki/Bek%E2%80%93Vulkar_gang_war",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Jedi_Civil_War",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Carth_Onasi",
  "/wiki/Rescue_of_Bastila_Shan",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Zaerdra",
  "/wiki/Bodyguard/Legends",
  "/wiki/Gadon_Thek",
  "/wiki/Tarisian_Season_Opener",
  "/wiki/Black_Vulkars/Legends",
  "/wiki/Brejik",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Sith_trooper_(Sith_Empire)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Kandon_Ark"
 ]
}