{
 "name": "Higgie Sethven",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Genasys"
     ]
    }
   ]
  }
 ],
 "content": "Higgie Sethven was a male Cerean who lived during the waning years of the Galactic Republic.\nSethven was a biochemist and he ran the shop Natural on the planet Cularin, along with the Humans Selima DeWitt and Percival Vale. In about 31 BBY, he discovered a drug that could be made from the star-mist plant, that caused nerve regrowth. He contacted the company Genasys about his discovery and they sent a security team to meet with him at Natural, to discuss his joining the company. However, Culpharm, a rival company, were tipped off and sent their own security team, to stop the meeting from happening. The Culpharm team attacked the Genasys team at Natural and Sethven sheltered on the upstairs floor of the shop, with DeWitt. They were eventually rescued from the shop by the Heroes of Cularin, who had stopped the firefight. Afterward, both Culpharm and Genasys offered Sethven lucrative job offers and he accepted the Genasys one and took up a position in the Genasys R\u0026D department. With the money he made from the star-mist, he made donations to the Bark Lovers' Alliance, but kept most of it himself and became very well off.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Genasys",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Biochemist",
  "/wiki/Natural",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Human/Legends",
  "/wiki/Selima_DeWitt",
  "/wiki/Percival_Vale",
  "/wiki/31_BBY/Legends",
  "/wiki/Star-mist",
  "/wiki/Culpharm",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Genasys_R%26D_department",
  "/wiki/Bark_Lovers%27_Alliance",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Higgie_Sethven",
  "/wiki/Find_the_Lady"
 ]
}