{
 "name": "Hija",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Hija was a human male who served as the chief gunnery officer of the Galactic Empire's Imperial I-class Star Destroyer Devastator. In the year 0 BBY, he was onboard the Devastator following the Battle of Scarif when it pursued the fleeing CR90 corvette Tantive IV, a Rebel Alliance vessel carrying stolen plans to the Imperial Death Star superweapon. After the Star Destroyer caught up with the corvette and stormtroopers successfully boarded the Alliance vessel, Hija was manning one of the Devastator's guns and noted an escape pod that had launched from the corvette, but was ordered not to shoot at it by gunnery captain Bolvan. The pod was carrying two Rebel droids carrying the plans, and in order to cover up his mistake, Bolvan later put through an order that required Hija to take part in an inspection of the Devastator's weapons, keeping him out of the way so he could not be questioned.\nHija was a human male who served in the Imperial Navy of the Galactic Empire during the Galactic Civil War between the Rebel Alliance and the Empire. In the year 0 BBY, he was stationed as a chief gunnery officer on board the Imperial I-class Star Destroyer Devastator, flagship of the Sith Lord Darth Vader. In that year, the Alliance attacked the Imperial Citadel Tower on the planet Scarif and managed to steal plans to the Empire's Death Star superweapon. The Devastator arrived at the climax of the battle, and gave chase when the Rebel CR90 corvette Tantive IV fled from Scarif carrying the plans.\nThe Devastator caught up with the Tantive IV in the Tatoo system, and there deployed stormtroopers to board the Rebel vessel. During the boarding, Hija was manning one of the Devastator's guns while sat next to Lieutenant Ciena Ree and witnessed several escape pods launch from the Tantive IV. One of these pods carried the Rebel droids R2-D2 and C-3PO, who had been given the Death Star plans by Princess Leia Organa; however, when Hija pointed the pod out, his superior officer Gunnery Captain Bolvan ordered him not to shoot, as there was no readings of life signs on board and Imperial regulations that tied gunnery officers' promotions to their kill ratios would label shooting an empty escape pod as a wasted shot.\nWhen the Death Star plans were not found on board the Tantive IV, Bolvan realized they must have been in the escape pod and panicked, going to fleet logistics liaison Arvira to see if they could help him avoid the consequences of his mistake. Arvira agreed to help Bolvan, and as part of the cover-up they told him to fill out Form INS-776-TX, which requested an immediate mid-cruise extra-vehicular-armament inspection. Such an inspection required the presence of the chief gunnery officer, and so Hija would have to join the inspection crew in climbing to each gun emplacement on the Devastator's exterior for the rest of the day in order to comply. This kept Hija out of the way and prevented him from being questioned over Bolvan's orders concerning the escape pod.\nHija had fair skin and brown hair. He claimed that going onto the exterior of starships while in space gave him spacesickness, and Bolvan believed that sending his subordinate onto the exterior of the Devastator would result in Hija hating him.\nHija wore a black Imperial officer's uniform with a cap.\nThe character of Hija was created for the film Star Wars: Episode IV A New Hope, which was released on May 25, 1977; however, he first appeared in the Star Wars Legends novelization of the film written by Alan Dean Foster and released on November 12, 1976. Hija's name was first used in the novel, but not in the film, and so it did not appear in canon until Hija was mentioned in the short story \"The Sith of Datawork\", which was written by Ken Liu and released as part of the From a Certain Point of View anthology book on October 3, 2017.\nThe actor playing Hija was not credited in A New Hope, but John Wreford has acknowledged playing the character according to the fan Web site Star Wars Autographs Online.\nActor John Forgeham also at one point claimed credit for the role, but later acknowledged he had in fact played Bolvan.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Hija",
  "/wiki/Hija/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Chief_gunnery_officer",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Devastator",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Battle_of_Scarif",
  "/wiki/CR90_corvette",
  "/wiki/Tantive_IV",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Starship",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Star_Destroyer",
  "/wiki/Corvette",
  "/wiki/Stormtrooper",
  "/wiki/Escape_pod",
  "/wiki/Gunnery_captain",
  "/wiki/Bolvan",
  "/wiki/Droid",
  "/wiki/Imperial_Navy",
  "/wiki/Galactic_Civil_War",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Citadel_Tower",
  "/wiki/Planet",
  "/wiki/Scarif",
  "/wiki/Tatoo_system",
  "/wiki/Lieutenant",
  "/wiki/Ciena_Ree",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Fleet_logistics_liaison",
  "/wiki/Arvira",
  "/wiki/Form_INS-776-TX",
  "/wiki/Standard_day",
  "/wiki/Hair",
  "/wiki/Realspace",
  "/wiki/Spacesickness",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Hat",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/May_25",
  "/wiki/1977",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Alan_Dean_Foster",
  "/wiki/November_12",
  "/wiki/1976",
  "/wiki/The_Sith_of_Datawork",
  "/wiki/Ken_Liu",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/October_3",
  "/wiki/2017",
  "/wiki/John_Wreford",
  "/wiki/John_Forgeham",
  "/wiki/Lost_Stars",
  "/wiki/Lost_Stars_(audiobook)",
  "/wiki/Lost_Stars_(webcomic)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_A_New_Hope_Cinestory_Comic",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_Updated_and_Expanded_Edition",
  "/wiki/July_25",
  "/wiki/2012",
  "/wiki/November_15",
  "/wiki/March_5",
  "/wiki/2016"
 ]
}