{
 "name": "Hinch_Beltane",
 "display_name": "Hinch Beltane",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Balmorra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Balmorra",
      "Galactic Empire",
      "Alliance of Free Planets",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Hinch Beltane was the Governor of Balmorra which was the primary manufacturer of AT-STs and SD-series battle droids.\nFollowing the Battle of Endor in 4 ABY, Balmorra was liberated by the Alliance of Free Planets and enjoyed freedom from foreign influence until 10 ABY, during the reborn Emperor Palpatine's insurrection. As a result, the planet's massive foundries were once again put into Imperial service. However, following the death of the first clone Emperor at the Battle of Pinnacle Base, the Balmorrans rebelled against Imperial rule and began supplying droids to the New Republic, thus angering the Imperials.\nIn response, the Emperor's Executor Sedriss QL initiated Operation Shadow Hand and sent a fleet under the Imperial-class Star Destroyer Avenger to punish Balmorra. When the fleet arrived in orbit over Balmorra, Beltane pretended to play innocent and demanded the meaning of the arrival of the fleet. In response, Sedriss accused him of arming the New Republic and demanded that he surrender immediately and be executed or the Imperials would wage war on Balmorra. Beltane replied by saying that the Imperials could not destroy Balmorra since it boasted foundries supplying advanced technology. In response, Sedriss ordered his troops to land on Balmorra in an attempt to press them into surrendering. A massive Imperial force including stormtroopers, SD-9-series battle droids and AT-STs were deployed near the planetary capital of Bin Prime, thus starting the Battle of Balmorra. He intended to capture the planet with the valuable factories intact. However, the Balmorrans were prepared for combat and deployed the new state-of-the-art SD-10 battle droids alongside Balmorran Defense Force soldiers. The SD-10s were programmed with tactics tailored to counter the older SD-9s, which were thoroughly outmatched.\nSedriss had anticipated this turn of events, and had his remaining ground troops withdraw. He than ordered his Shadow Droids to destroy the exposed Balmorran forces. The unorthodox fighters inflicted heavy casualties, but Beltane had his own secret weapon. He unleashed the advanced molecular-shielded X-1 Viper droids, which bested the Shadow Droids. After suffering heavy losses, Sedriss called off his attack. He sent down representatives to negotiate terms of peace. Balmorra won its freedom and in return would sell the Vipers to the Empire. However, he made an arrangement with New Republic to hijack a shipment of the new X-1 Vipers bound for Byss. He also supplied the Rebels with the itinerary and the registry numbers of the ships.\nIn the audio drama version of Star Wars: Dark Empire II, Beltane was voiced by Nick Jameson.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Balmorra/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/New_Republic/Legends",
  "/wiki/Governor/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/SD-series_battle_droid/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Pinnacle_Base",
  "/wiki/Executor_(Imperial_rank)",
  "/wiki/Sedriss_QL",
  "/wiki/Operation_Shadow_Hand",
  "/wiki/Fleet/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Avenger/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/SD-9-series_battle_droid",
  "/wiki/Bin_Prime",
  "/wiki/Battle_of_Balmorra",
  "/wiki/SD-10_battle_droid",
  "/wiki/Balmorran_Defense_Force",
  "/wiki/Shadow_Droid",
  "/wiki/X-1_Viper",
  "/wiki/Byss/Legends",
  "/wiki/Dark_Empire_II_(audio)",
  "/wiki/Star_Wars:_Dark_Empire_II",
  "/wiki/Nick_Jameson",
  "/wiki/Dark_Empire_II_1",
  "/wiki/Dark_Empire_II_4",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_I:_Remnant",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Collector_4",
  "/wiki/The_Essential_Guide_to_Droids",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_23",
  "/wiki/The_Official_Star_Wars_Fact_File_75",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Scavenger%27s_Guide_to_Droids",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut"
 ]
}