{
 "name": "Hirang Birren",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nithorn"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown and green"
     ]
    }
   ]
  }
 ],
 "content": "Hirang Birren was a Nithorn male who worked as a cruise ship talent scout and spent time on the yacht First Light in 10 BBY. While aboard, he began singing along with performers Aurodia Ventafoli and Luleo Primoc in his own guttural birdsong.\nThe Nithorn male Hirang Birren worked as a cruise ship talent scout during the reign of the Galactic Empire. In 10 BBY, Birren was attending a party aboard the First Light—the personal yacht of Dryden Vos, leader of the Crimson Dawn criminal organization—when it arrived on the planet Vandor.\nWhile on the starship, Birren listened to a musical performance by the singers Aurodia Ventafoli and Luleo Primoc, and unwittingly began singing along with them in his own guttural birdsong. With a drink in hand and a human woman on his arm, Birren walked past the outlaw Han Solo on the yacht's viewing platform. He then stood with the woman at one of the platform's windows to talk.\nBirren had a keen ear for music. He had brown-and-green skin and black eyes, as well as a recumbent crest of brown feathers with black stripes.\nDuring his time aboard the yacht First Light, Birren wore a black jacket over a yellow shirt, with black pants and shoes.\nHirang Birren was portrayed by puppeteer Brian Herring in the 2018 Anthology film, Solo: A Star Wars Story. Nithorn concept art for the film was drawn by senior sculptor Luke Fisher and titled \"Maverick 015 Version A.\" The mechanics of the Birren character's mask were built by Chris Clarke, who also controlled the mask's facial movements on set. Due to the limited vision that the mask allowed, Herring had puppeteer Colin Purves giving him directions through an earpiece during filming.\nOn the film's set, the character was known as \"parrot man.\" The reference book Solo: A Star Wars Story The Official Guide, written by Pablo Hidalgo and released alongside the film, officially identified the character as Hirang Birren—an anagram of Herring's name.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Nithorn",
  "/wiki/Planet",
  "/wiki/Birren",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Starship",
  "/wiki/Time",
  "/wiki/Yacht",
  "/wiki/First_Light",
  "/wiki/10_BBY",
  "/wiki/Musician",
  "/wiki/Aurodia_Ventafoli",
  "/wiki/Luleo_Primoc",
  "/wiki/Language",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Dryden_Vos",
  "/wiki/Crime_lord",
  "/wiki/Crimson_Dawn",
  "/wiki/Vandor",
  "/wiki/Music",
  "/wiki/Limb",
  "/wiki/Human",
  "/wiki/Han_Solo",
  "/wiki/Viewport",
  "/wiki/Ear",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Brian_Herring",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Luke_Fisher",
  "/wiki/Chris_Clarke",
  "/wiki/Colin_Purves",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Solo:_A_Star_Wars_Story_Ultimate_Sticker_Collection",
  "/wiki/The_Art_of_Solo:_A_Star_Wars_Story",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}