{
 "name": "Hirodin_Nasli",
 "display_name": "Hirodin Nasli",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 4 ABY",
      "Oridol Cluster"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "204th Imperial Fighter Wing",
      "204th Imperial Fighter Wing"
     ]
    }
   ]
  }
 ],
 "content": "Hirodin Nasli was a human TIE fighter pilot who flew in the Galactic Empire's 204th Imperial Fighter Wing. The pilot served in one of two squadrons that were stationed aboard the Quasar Fire-class cruiser-carrier Aerie when it tracked down the New Republic EF76 Nebulon-B escort frigate Hellion's Dare through the Oridol Cluster several weeks after the Battle of Endor. Nasli was given the nickname \"Puke\" by the pilots of the Hellion's Dare's escort squadrons—Hound Squadron and Riot Squadron—as the pilot sprayed laser cannon fire during combat. Nasli was ultimately killed during the pursuit by the A/SF-01 B-wing starfighter pilot Chass na Chadic.\nThe human TIE fighter pilot Hirodin Nasli served in the Galactic Empire's 204th Imperial Fighter Wing during the Galactic Civil War. Several weeks after the Battle of Endor in 4 ABY, Nasli was among the two TIE/ln space superiority starfighter squadrons aboard the Quasar Fire-class cruiser-carrier Aerie that pursued the New Republic EF76 Nebulon-B escort frigate Hellion's Dare and its two escort squadrons—Riot Squadron and Hound Squadron. The hunt was part of an effort conducted by the 204th's commanding officer, Colonel Shakara Nuress, to maintain the secrecy of the fighter wing's new base of operations in the Pandem Nai system.\nAfter driving the Hellion's Dare and its escort out of the Jiruus system, the Aerie and its TIEs, including Nasli, pursued the New Republic starships through the Oridol Cluster, picking off a number of New Republic fighters along the way. During these skirmishes, the New Republic pilots of Riot and Hound Squadrons labeled Nasli with the nickname \"Puke\" as a reference to the enemy pilot's favored tactic of repeatedly spraying laser cannon fire. The New Republic pilots also brought up Puke and the other Imperial pilots during conversations at their berths. However, after at least half a dozen engagements, Nasli was killed by the A/SF-01 B-wing starfighter pilot Chass na Chadic of Hound Squadron.\nNasli's death was celebrated aboard the Hellion's Dare as the first kill by the New Republic pilots. Fadime, the acting leader of Hound Squadron, remarked that the fallen TIE fighter pilot was never going to spray cannon fire childishly again and moved the name of \"Puke\" to the bottom of the list of Imperial pilots on a tactical board. The Aerie's TIE fighters continued to pursue the Hellion's Dare and its escort until the frigate was destroyed. Only Chadic and another pilot named Wyl Lark escaped the Imperial forces, both of which remembered the fighting numerous times after.\nWhile on a reconnaissance mission aboard a UT-60D U-wing starfighter/support craft at the planet Troithe at least a month later, Chadic recalled in her mind the Imperial pilots she had encountered in the Oridol Cluster, including Nasli, flying through the cluster's clouds. In 5 ABY, Lark engaged in a dogfight with Colonel Soran Keize, the 204th's commanding officer at the time. During the fight, Keize's firing patterns reminded his opponent of Nasli's favored tactic. In the midst of the Battle of Jakku that year, Lark was confronted by one of Nasli's old wingmates, Lieutenant Palal Seedia. After the pair scuffled, Seedia recited Nasli's name to her adversary, blaming him for the late pilot's death.\nHirodin Nasli was first mentioned as \"Puke\" in the 2019 novel Alphabet Squadron, the first volume in the Star Wars: Alphabet Squadron series, written by Alexander Freed. Nasli's full name was not identified until the third volume of Freed's series, the 2021 novel Victory's Price.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/4_ABY",
  "/wiki/Oridol_Cluster",
  "/wiki/Human",
  "/wiki/Galactic_Empire",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/File:Puke1.ogg",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Pilot",
  "/wiki/Squadron",
  "/wiki/Quasar_Fire-class_cruiser-carrier",
  "/wiki/Aerie",
  "/wiki/Attack_on_the_Hellion%27s_Dare",
  "/wiki/New_Republic",
  "/wiki/EF76_Nebulon-B_escort_frigate",
  "/wiki/Hellion%27s_Dare",
  "/wiki/Standard_week",
  "/wiki/Battle_of_Endor",
  "/wiki/New_Republic_pilot",
  "/wiki/Hound_Squadron",
  "/wiki/Riot_Squadron",
  "/wiki/Laser_cannon",
  "/wiki/Naval_warfare",
  "/wiki/Death",
  "/wiki/A/SF-01_B-wing_starfighter",
  "/wiki/Chass_na_Chadic",
  "/wiki/File:Puke2.ogg",
  "/wiki/Galactic_Civil_War",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Commanding_officer",
  "/wiki/Colonel",
  "/wiki/Shakara_Nuress",
  "/wiki/Fighter_wing",
  "/wiki/Pandem_Nai_system",
  "/wiki/Jiruus_system",
  "/wiki/TIE_line",
  "/wiki/Starship",
  "/wiki/Starfighter",
  "/wiki/Fadime",
  "/wiki/Cannon",
  "/wiki/Frigate",
  "/wiki/Wyl_Lark",
  "/wiki/Imperial_Military",
  "/wiki/Scout",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Planet",
  "/wiki/Troithe",
  "/wiki/Standard_month",
  "/wiki/Star_cluster",
  "/wiki/5_ABY",
  "/wiki/Battle_at_Chadawa",
  "/wiki/Soran_Keize",
  "/wiki/Imperial_officer",
  "/wiki/Time",
  "/wiki/Battle_of_Jakku",
  "/wiki/Standard_year",
  "/wiki/Lieutenant",
  "/wiki/Palal_Seedia",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Star_Wars:_Alphabet_Squadron",
  "/wiki/Alexander_Freed",
  "/wiki/2021",
  "/wiki/Victory%27s_Price",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}