{
 "name": "Hissal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Brigia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Brigian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "University of Rudrig"
     ]
    }
   ]
  }
 ],
 "content": "Hissal was a Brigian academic who, during the era of the Galactic Civil War, served on the Committee for Interinstitutional Assistance of the Tion Hegemony's University of Rudrig. In 2 BBY, Hissal became involved in an effort to open a branch of the university on his homeworld of Brigia, which caused the authoritarian New Regime that governed Brigia to name Hissal a traitor and a fugitive. Hissal was forced to hire Corellian smuggler Han Solo to deliver vital supplies to the new college—the clash with the New Regime that followed led to the destabilization of the planetary government.\nA Brigian native of the planet Brigia in the backwater Tion Hegemony, Hissal was an academic who by the era of the Galactic Civil War had become affiliated with the University of Rudrig's Committee for Interinstitutional Assistance. By 2 BBY, Hissal had become involved in an effort to open a branch of the university on Brigia, although the initiative was met with considerable opposition from the Brigian New Regime, which considered Hissal a fugitive from the state. As such, Hissal was forced to find alternative means to ship materials and teaching aids to the new college, fearing that the authorities would confiscate them upon delivery. Hissal learned of a capable smuggler in the region named Han Solo who was working as pit crew for a small-time stunt pilot on the backwater world of Saheelindeel. Hissal traveled to Saheelindeel and came to a deal with the Corellian, hiring Solo and his first mate Chewbacca to transport a shipment of educational materials, including an extremely valuable duplicator, to Brigia in exchange for two thousand credits.\nSolo and Chewbacca had nearly completed offloading the cargo with Hissal on Brigia when they were accosted by Brigian Internal Security Police, who surrounded Solo's Millennium Falcon as Hissal and the smugglers took refuge. Hissal stood and watched nervously as Solo negotiated with Chief Keek—the Brigian sprung into action when Solo and Keek's confrontation came to blasters, attacking the security chief from behind during the firefight. Although Keek was much physically stronger than Hissal and shrugged off his efforts, his interference allowed Solo to blast Keek over the head with a scroll-gun, knocking him out cold. After expelling Keek from the Falcon, Solo allowed Hissal to use the ship's communication systems to broadcast information undermining the New Regime, ultimately destabilizing the planet's government.\nA committed academic, Hissal was a tall, reedy purple-skinned Brigian who was devoted to his mission to bring higher education to his homeworld. Although uncomfortable with the prospect of resorting to illegal means to achieve that goal, Hissal was extremely opposed to the Brigian \"New Regime,\" regarding them nothing more than common \"hoodlums,\" and welcomed Solo's aid. Although not a fighter, Hissal went as far as to back up Solo with force in his fight with Keek, taking a few blows in order to help the Corellian win the battle.\nHissal made his sole appearance in the Star Wars Legends continuity in Han Solo and the Lost Legacy, a novel written by Brian Daley and released in 1980.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Brigia/Legends",
  "/wiki/Brigian",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/University_of_Rudrig/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Committee_for_Interinstitutional_Assistance",
  "/wiki/Tion_Hegemony/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/University/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Brigia",
  "/wiki/New_Regime",
  "/wiki/Corellian/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Grigmin",
  "/wiki/Saheelindeel",
  "/wiki/First_Mate/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Duplicator",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Internal_Security_Police",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Chief/Legends",
  "/wiki/Keek_(Brigia)",
  "/wiki/Blaster/Legends",
  "/wiki/Scroll-gun",
  "/wiki/Han_Solo_and_the_Lost_Legacy",
  "/wiki/Brian_Daley",
  "/wiki/1980",
  "/wiki/A_Guide_to_the_Star_Wars_Universe",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}