{
 "name": "Hlisk Squin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cularin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald"
     ]
    }
   ]
  }
 ],
 "content": "Hlisk Squin was a Human male who was the proprieter of a zoo known as the Bollin Exotic Animal Emporium, in the platform city of Bollin, in Cularin. His favorite \"pet\" was a fully-grown rancor. He presented the appearance of an earnest businessman.\nThe Emporium was actually a cover for Squid's secret, second career as a criminal. When Riboga the Hutt took over criminal operations within the Cularin system, Squin moved slaves for him using animal containers. When Nirama took over and ended slavery in that star system, Squin was able to hide his old connections. He also worked as a smuggler, picking up goods from the asteroid belt's pirates to be sold while on runs to get supplies for his many animals. He also wasn't above murder, as some of his competitors disappeared at times when his food budget was not as high as it should have been.\nHlisk Squin was bald with a red beard and had a drooping build. Bland of features, he was the type of person who could work in with the background without being noticed.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bollin_Exotic_Animal_Emporium",
  "/wiki/Platform_city",
  "/wiki/Bollin",
  "/wiki/Rancor/Legends",
  "/wiki/Riboga",
  "/wiki/Hutt/Legends",
  "/wiki/Cularin_system",
  "/wiki/Slavery/Legends",
  "/wiki/Nirama",
  "/wiki/Star_system/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Cularin_system_asteroid_belt",
  "/wiki/Pirate/Legends",
  "/wiki/Living_Force_Campaign_Guide"
 ]
}