{
 "name": "Hocce",
 "display_name": "Hocce",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ensign Hocce was a Human male medical technician who served aboard Death Star I during the Galactic Civil War. He looked older than his years, with shoulders bent over, as though carrying the weight of the Death Star on his back.\nDuring his service, Hocce always had a desire to help people, and knew he had found his ideal career when he started showing a natural talent for medicine. As his homeworld was located in the Galactic Core, Hocce was required to serve in the Imperial military, excelling as a medical technician, despite becoming appalled at witnessing some of the Empire's more cruel missions.\nHis service aboard the Death Star threatened to consume him, as the battlestation represented everything he despised about the New Order while he was forced to help keep it operational by tending the crew, due to his determination never to go against his vow of healing. Hocce sometimes dreamed of finding a planet far from conflict where he could ply his vocation in peace, but knew that, despite his low rank, Imperial Command would never let him leave the service, due to his high level of skill and dedication.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Death_Star_Technical_Companion",
  "/wiki/Death_Star_Technical_Companion_(Second_Edition)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}