{
 "name": "Hoclaw",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "40 ABY",
      "Valorum",
      "deep-space"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian Defense Force",
      "Confederation",
      "Decoy fleet",
      "Decoy fleet"
     ]
    }
   ]
  }
 ],
 "content": "Hoclaw was a Corellian who served as captain of the Valorum, a Victory-class Star Destroyer serving in the Corellian decoy fleet in 40 ABY during the Second Galactic Civil War. Hoclaw was sent by Five World Prime Minister Sadras Koyan to lure Jacen Solo, the Galactic Federation of Free Alliances Chief of State, into an ambush near Centerpoint Station. While she was able to engage Solo in false negotiations for a time, Hoclaw's efforts ultimately failed, and she died amidst the destruction of the Corellian decoy fleet when Centerpoint Station's hyperspace tractor beam was fired.\nHoclaw was a Corellian Human female from the planet Corellia, a part of the Corellian system. She served in the Corellian Defense Force in 40 ABY, during the Second Galactic Civil War, and held the rank of captain. Hoclaw was given command of the Victory-class Star Destroyer Valorum following the secession of Corellia from the Galactic Federation of Free Alliances.\nShe was sent by Five World Prime Minister Sadras Koyan as the head of a decoy fleet to lure Jacen Solo, Galactic Alliance Chief of State, into an ambush in deep-space near Centerpoint Station, an ancient space station located in the Corellian system that was armed with a powerful superweapon known as the hyperspace tractor beam. Hoclaw had orders to do so under the pretense of peace negotiations via holocam and had the authority to negotiate, if possible, a settlement involving Corellia returning to the Galactic Alliance.\nAlthough initially surprised that the Corellians had sent a mere captain to negotiate, having expected to negotiate with Koyan himself, Solo nonetheless attempted to push for the Corellian system to surrender to Alliance forces. Hoclaw went on to keep Solo occupied for some time, debating with him points such as the cost of rebuilding and what portion of it would Corellia be obligated to pay. She quickly demanded that Solo himself step down as Chief of State as an act of cooperation, indicating such a gesture would earn favor with the Confederation, a galactic government which arose in opposition to the Galactic Alliance. However, Solo refused and ruled out the suggestion.\nHoclaw's attempts at negotiation were rebuffed, with Solo growing impatient and threatening to make his terms harsher should she refuse his demands. Anticipating that the negotiations were a trap, Solo abruptly cut them off, granting Hoclaw ten minutes to accept his demands. It was during the break in negotiations that Hoclaw contacted Denjax Teppler, Corellian Minister of Information, who was onboard Centerpoint. Hoclaw informed him of the interlude and indicated that she believed she could continue stalling Solo, which would give the Corellians the time needed to make Centerpoint operational.\nUltimately, Hoclaw's stalling efforts failed. Aboard his personal Imperial II-class Star Destroyer, the Anakin Solo, Jacen Solo and his mother, Leia Organa Solo, determined based on the analysis of background noise from the Valorum's bridge that it only contained a skeleton crew and that the meeting was likely a trap. Centerpoint Station's hyperspace tractor beam was made operational moments later, with Corellia deploying numerous capital ships and starfighters from Force Yimi and Force Zexx to engage Alliance forces and keep them occupied until the station could be fired. Upon the weapon's activation, both the Corellian decoy fleet and the majority of the Galactic Alliance Second Fleet were destroyed, killing Hoclaw in the process, although both Jacen and the Anakin Solo escaped.\nA long-faced woman, Hoclaw rebuffed any attempt by the younger Jacen Solo to intimidate her. While she was never meant to reach a peace agreement with Solo, the captain nonetheless steadfastly stood her ground against his demands for surrender, instead insinuating the Chief of State's demands would only prolong negotiations while maintaining a friendly demeanor toward him. When Solo pushed for Corellia to pay for a large portion of rebuilding, she refused, calling his suggestion a vindictive presumption that Corellia was to blame for the conflict and noting that it would reduce the Corellian system to poverty for generations.\nHoclaw first appeared in Aaron Allston's 2007 novel Legacy of the Force: Fury, the seventh volume in the Star Wars: Legacy of the Force series.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Corellia/Legends",
  "/wiki/40_ABY",
  "/wiki/Valorum_(Victory-class)",
  "/wiki/Realspace/Legends",
  "/wiki/Human/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Corellian_Defense_Force/Legends",
  "/wiki/Confederation",
  "/wiki/Decoy_fleet",
  "/wiki/Captain/Legends",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Five_World_Prime_Minister",
  "/wiki/Sadras_Koyan",
  "/wiki/Darth_Caedus",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Battle_of_the_rendezvous_point",
  "/wiki/Centerpoint_Station",
  "/wiki/Time/Legends",
  "/wiki/Death/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Hyperspace_tractor_beam",
  "/wiki/Homeworld/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Corellian_system",
  "/wiki/Military_rank/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Holocamera",
  "/wiki/Currency/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Denjax_Teppler",
  "/wiki/Minister_of_Information_(Five_Worlds)",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Anakin_Solo_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Parent/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Force_Yimi",
  "/wiki/Force_Zexx",
  "/wiki/Galactic_Alliance_Second_Fleet",
  "/wiki/Aaron_Allston",
  "/wiki/2007",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Star_Wars:_Legacy_of_the_Force",
  "/wiki/Legacy_of_the_Force:_Fury_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com",
  "/wiki/Galactic_Architecture_101_and_the_History_of_Centerpoint_Station"
 ]
}