{
 "name": "Hodge",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mining Station Alpha"
     ]
    }
   ]
  }
 ],
 "content": "Hodge was a pilot, a chief officer miner and a man who was infected by the monster Spore.\nDuring the Galactic Civil War in 0 ABY, Hodge worked as chief officer of asteroid Mining Station Alpha, which meant that he had two other miners under his authority. One of them was Fandomar Nadon, Momaw Nadon's Ithorian wife. Hodge did not know that Ithorian visited his outpost to confirm that a tomb there was intact. Ithorians had buried a creature, Spore, on a tomb there centuries ago.\nHodge managed to discover the tomb and opened it. He was then infected by Spore, who would use Hodge's body as a host. Fandomar discovered that the tomb was opened, so she destroyed the Station and took Hodge with him, trying to kill Spore. She did not know that Spore was inside Hodge.\nThey reached Ithor, and a rescue party came after them. But Hodge/Spore attacked them using black vines coming from his mouth and eyes. Each of the vines infected any being it touched.\nHodge also threatened to infect Mammon Hoole and Tafanda Bay. However, Imperial Inquisitor Jerec offered Spore a chance to get off Ithor, if he infected the crew of his destroyer, Vengeance to enslave them. Spore accepted, intending to betray Jerec. He also tried to capture Fandomar and Tash Arranda.\nHowever, a group of space slugs attacked and destroyed the Vengeance. Spore was split into a thousand pieces and neutralized in the vacuum of space. He then went dormant and waited for someone to recover Hodge's body.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mining_Station_Alpha",
  "/wiki/Pilot/Legends",
  "/wiki/Miner/Legends",
  "/wiki/Spore",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Fandomar_Nadon",
  "/wiki/Momaw_Nadon/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Mammon_Hoole",
  "/wiki/Tafanda_Bay",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Jerec_(Inquisitor)",
  "/wiki/Vengeance_(Imperial-class,_Jerec)",
  "/wiki/Tash_Arranda/Legends",
  "/wiki/Exogorth/Legends",
  "/wiki/Galaxy_of_Fear:_Spore",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}