{
 "name": "Hoggon",
 "display_name": "Hoggon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Hoggon was a Human male spacer of short stature who was fascinated with the Jedi Order and its history. In 3986 BBY, he unwittingly helped war criminal and former Sith Lord Ulic Qel-Droma find a suitable world of exile—at first he suggested Yavin 4, but Qel-Droma chose to settle on Rhen Var. Immediately after delivering his client to his new home, Hoggon went to Exis Station, to witness the Jedi conclave that was taking place there. As he departed, he discovered that Vima Sunrider had been stowing away on his ship. The young girl, daughter of Jedi Master Nomi Sunrider, sought Qel-Droma's teachings, and when she showed a hologram of the man to Hoggon, he realized that it was the very same person he had taken to Rhen Var.\nDelivering the young girl to Rhen Var, Hoggon then decided to inform the Jedi of Qel-Droma's location, hoping that he would be privy to a battle between them and the exile. At first he took his information to Nomi Sunrider, but then chose to inform the Cathar Jedi Sylvar, who was highly critical of Qel-Droma. Taking Sylvar to Rhen Var, Hoggon watched on as she battled the exile. However, Sylvar was unable to kill Qel-Droma, and, seeing his opportunity to enter the history books, Hoggon shot Qel-Droma instead. As Hoggon had hoped, his deed was in fact included in historical documents written thousands of years later.\nBy 3986 BBY, the Human male Hoggon was captain of his own starship, although he was not in the best of situations financially. He took a particular interest in the exploits of the Jedi, particularly the events that had made up the Great Sith War. During that year, Hoggon was hired by an unidentified man to find a suitable place of solitude in the galaxy. Hoggon obliged, and first took his employer to Yavin 4, site of a decisive battle in the waning days of the Great Sith War. Landing on the moon's surface, Hoggon was anxious to attend the Conclave on Exis Station taking place elsewhere—a large meeting of Jedi Knights from all over the galaxy, and so he tried to sell Yavin 4's suitability to his client as quickly as possible.\nThe pair explored the Temple of Exar Kun as Hoggon told the story of how Sith Lord Ulic Qel-Droma had betrayed his compatriot, Exar Kun, at the Battle of Yavin 4, leading to Kun's final defeat. The client was dissatisfied with the location, however, and Hoggon was forced to look for a new candidate. His next choice was Rhen Var—a planet going through its ice age, and as a result, devoid of civilization. As he brought his ship into land, Hoggon narrowly avoided being crushed by a large block of ice falling from a nearby cliff side. Hoggon then showed his client some of Rhen Var's ruins—the taciturn man decided that Rhen Var was suitable for his purposes. Hoggon was pleased, as he would then be able to attend the Conclave on Exis Station.\nTraveling to Exis Station, Hoggon had to pay premium berthing rates on arrival. Debarking from his ship, he met with an old friend of his, Dakar, who, when paid, tipped him off as to a good location from which he could observe the conclave: an old air shaft overlooking the gathering hall. Making his way there, Hoggon watched on as the Cathar Jedi Sylvar passionately spoke out against the exiled former Sith Lord and Jedi Knight Ulic Qel-Droma. When the conclave was over, Hoggon departed on his ship, but soon discovered that young Vima Sunrider, daughter of Master Nomi Sunrider, had stowed away onboard. The young girl hoped to find Qel-Droma, and presented Hoggon with a hologram of him—to the spacer's surprise, it was the very same man he had taken to Rhen Var.\nThe young Sunrider offered to pay Hoggon well if he were to take her to Qel-Droma, and he obliged. Hoggon gave the young girl proper supplies and gear for traversing Rhen Var's frozen plains, and also gave her a transmitter, should she wish to contact him, before bidding her farewell. Several days later, while repairing his ship's autopilot, Hoggon began obsessing over the fact that his craft had played host to not only Ulic Qel-Droma, but Vima Sunrider. He deduced that Nomi Sunrider would not be particularly pleased with the developments, and that one of the Jedi should be told what had happened to the two. Musing over which particular Jedi to tell, Hoggon excitedly supposed that they would sent a battalion of Jedi Knights to Rhen Var to battle Qel-Droma. He then resolved to return to Exis Station, to tell the elder Sunrider of the development.\nBack at the station, however, Hoggon was refused audience by the Jedi Master, who had already learned of Vima's situation. Hoggon protested loudly as he was removed from Sunrider's presence, to no avail. Realizing that he needed to find another Jedi to inform, he remembered how Sylvar had railed against Qel-Droma during the conclave. The Cathar Jedi returned to Exis Station shortly afterward, and Hoggon approached her with his information. Angered, she picked the diminutive spacer up off the ground, but relented when she realized that he knew where Qel-Droma was. Hoggon then offered to take her to Rhen Var personally, and she obliged.\nReturning to Rhen Var once more, Hoggon chose to use an angle of approach to the ruins that he hadn't used before, to catch Qel-Droma off guard. Collecting his blaster, the spacer offered to help Sylvar battle Qel-Droma, but the Jedi declined the offer. She then debarked, and engaged the former Sith Lord in a duel, while Hoggon watched on, being particularly excited when Sylvar backed Qel-Droma up against a cliff. However, Qel-Droma, who had been trying to atone for his previous dark side transgressions, refused to fight her, and Sylvar found herself unable to strike him down. As she deactivated her lightsaber blade, Hoggon took it upon himself to shoot Qel-Droma through the chest. Sylvar turned on the spacer in a rage, but let him go free, since Qel-Droma's death had helped free her from the anger that had consumed her since the Sith War. Confused, Hoggon departed the scene as Qel-Droma died in Sunrider's arms.\nJust as he had hoped, Hoggon made his mark on history for his deed. In 36 ABY, Hoggon was mentioned in the writings of New Republic historian Voren Na'al, as the man who shot Ulic Qel-Droma.\nHoggon was fascinated with Jedi culture and history—despite not having been there, he was very familiar with how the Battle of Yavin 4, during the Great Sith War, had played out in years prior. The spacer was so engrossed with the Jedi that he was happy enough just to watch them, and was overjoyed when he met one in person. He also believed that he needed to be an important figure in Jedi history, and went out of his way to make sure that he was so. This belief led him to kill an unarmed Ulic Qel-Droma, although all he received from the Jedi for doing so was ire and disgust. In his eyes, he was a hero for having done so, and the act was a noble one. He was also an enterprising being, but not an inconsiderate one, taking measures to make sure Vima Sunrider was well-equipped when she debarked to track Rhen Var's wastelands.\nHoggon made his first appearance in Kevin J. Anderson's 1998 miniseries Star Wars: Tales of the Jedi - Redemption—specifically, Tales of the Jedi – Redemption 1. In the story, he played a supporting role.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/3986_BBY",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Rhen_Var/Legends",
  "/wiki/Exis_Station/Legends",
  "/wiki/Conclave_on_Exis_Station",
  "/wiki/Vima_Sunrider",
  "/wiki/Hoggon%27s_starship",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Nomi_Sunrider",
  "/wiki/Hologram/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Cathar/Legends",
  "/wiki/Sylvar",
  "/wiki/Duel_on_Rhen_Var",
  "/wiki/Captain/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Battle_of_Yavin_4_(Great_Sith_War)",
  "/wiki/Moon/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Temple_of_Exar_Kun",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Dakar_(port_administrator)",
  "/wiki/Transmitter/Legends",
  "/wiki/Autopilot/Legends",
  "/wiki/Battalion/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Death/Legends",
  "/wiki/36_ABY",
  "/wiki/New_Republic/Legends",
  "/wiki/Voren_Na%27al/Legends",
  "/wiki/Kevin_J._Anderson",
  "/wiki/1998",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_-_Redemption",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Redemption_1",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Star_Wars:_The_Clone_Wars:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Redemption_2",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Redemption_3",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Redemption_5",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Redemption_4"
 ]
}