{
 "name": "Holiday  (hologram)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sentient holographic lifeform"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female personality"
     ]
    }
   ]
  }
 ],
 "content": "Holiday was a fully sentient holographic lifeform who was Tharan Cedrax's assistant. During the Galactic Cold War, the two accompanied the Scorekeeper's Herald on a mission to stop the spreading of the Dark Plague.\nEven though Holiday was considered by strangers to be nothing more than a hologram, she was treated by Cedrax as a living person and even as his girlfriend. He once noted to his Jedi Companion that Holiday was a fascinating combination of science and beauty. Holiday returned Cedrax's affections, fascinated by his never-ending fount of ideas and technical genius. She did not mind him satisfying his physical needs with temporary flings, but easily became jealous if his attentions towards other women looked to be more serious. If confronted about the odd nature of their relationship and her mechanical nature, she became defensive and pointed out that she was no mere pleasure droid or hologram projection.\nBefore joining the Jedi Consular's team, Holiday once belonged to Glorzo, who merely thought of her as a holographic dancer and exotic technological toy. Cedrax's recognition of her capabilities contributed to her affection for him. While her origins are a mystery, Cedrax speculated that she was built by ancient precursors using technology that the Republic had not yet developed.\nCedrax's affection for Holiday culminated in a great sacrifice. He had been invited to the Luminatus Club, a secret society of the galaxy's finest scientific minds. To enter the society, he built a Vandyk Generator, a theoretical device thought impossible to actually construct. Realizing he could make it work only once, he faced a dilemma: he could use it to achieve everlasting scientific fame, or grant Holiday true sentience. In the end, he gave up scientific glory for her. When the Consular pointed out that sentience could change the nature of their relationship, Cedrax replied that he understood, but valued Holiday's life and development more.\nAfter the Jedi Consular went missing, Holiday left Cedrax to travel the Galaxy. During this time, she remained in touch with Cedrax and gifted him a new holographic assistant named Zebular, who took the form of a male Houk.\nDuring combat Holiday could distract enemies from her teammates and even imitate death. She was also a capable slicer and mathematical savant with knowledge of a wide range of sciences, all the better to assist the polymath Cedrax.\nHoliday was first introduced in the BioWare video game Star Wars: The Old Republic as a secondary companion for the Jedi Consular class, accompanying the primary companion Tharan Cedrax. She can distract enemies in combat, serving as one of Cedrax's abilities, and appears in cutscenes, where she is voiced by Tara Strong. Holiday's character model is of a light-skinned Human female with dark hair, with a pink and purple hologram overlay. In combat, her hologram skin layer will sometimes fail to appear, and she will instead appear as a standard Human NPC.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tharan_Cedrax",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/The_Barsen%27thor",
  "/wiki/Dark_Plague",
  "/wiki/Glorzo",
  "/wiki/Zebular",
  "/wiki/Houk/Legends",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Jedi_Consular",
  "/wiki/Tara_Strong",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}