{
 "name": "Hondo Ohnaka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sriluur",
      "Florrum"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.85 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ohnaka Gang",
      "Ohnaka Transport Solutions"
     ]
    }
   ]
  }
 ],
 "content": "Hondo Ohnaka, a Weequay male, was an infamous pirate and outlaw who operated throughout the galaxy. With a career spanning several decades, Ohnaka gained notoriety and often found himself involved in the tumultuous conflicts of his time. Although his exploits were primarily self-serving, he provided crucial aid and assistance during pivotal moments in the Clone Wars, Galactic Civil War, and First Order-Resistance War.\nBy the time of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, Ohnaka was the titular pirate king of the Florrum-based Ohnaka Gang. Ohnaka's first entrance into the conflict was a major one, as he managed to capture the leader of the Confederacy, Count Dooku, as well as the Jedi Generals Obi-Wan Kenobi and Anakin Skywalker. Ohnaka was unsuccessful in ransoming the trio, but his influence was far from diminished. Throughout the rest of the war, the pirate frequently encountered Kenobi, Skywalker, and Ahsoka Tano in both helpful and antagonistic roles. Ohnaka's tenuous relationship with the Republic was not reciprocated in the Confederacy, and his base was destroyed by Confederate General Grievous under the order of Dooku. Despite the destruction of his base and a brief fracture of his gang, Ohnaka managed to survive the duration of the war.\nThe end of the Clone Wars saw the rise of the Galactic Empire, under whose rule the Ohnaka Gang was broken up, and the once-great pirate cast adrift as a small-time smuggler and outlaw. While on his own, Ohnaka encountered several notable people during his exploits, chief among them the young Jedi fugitive and revolutionary Ezra Bridger. Ohnaka became an ally to Bridger and his rebel crew, the Spectres, in their fight against the Empire. Ohnaka's friendship with Ezra culminated in his help in liberating the planet Lothal from the grip of the Empire. Ohnaka authored the Book of Hondo, an outline of his philosophy that inspired many well-known outlaws, before later creating the shipping company Ohnaka Transport Solutions, which he ran on the planet Batuu.\nA male Weequay from the planet Sriluur, Hondo Ohnaka was born to his mother. While he was growing up, she taught him how to pick pockets and offered him advice that he would remember and use throughout his life. Early in his life, Ohnaka was sold into servitude and became a cupbearer and advisor to Porla the Hutt on Boonta, from whom he learned many tricks to illicit trade.\nHondo was not content being a servant, however, and he and several others escaped Porla to start a new life. The group chose the path of piracy, and soon Hondo led his new gang ambushing ships travelling in the remote region of space between the Corporate Sector and the Tion Hegemony. Eventually, the group found their way to Farana, a planet located in Wild Space. There, Hondo stumbled on an arsenal of starships belonging to a local collector. Hondo took an interest in his ships, and began a campaign wreaking chaos across Farana. Ohnaka accepted a bribe from the collector, but did not stop his forces. Eventually, the collector decided to just let Hondo take the ships with a promise of no retribution on the condition he leave Farana. Ohnaka accepted, and his gang was able to secure the fleet, including a Corona-class armed frigate and its six Flarestar-class attack shuttles. Now with a fleet of attack ships and a flagship, renamed the Acushnet, Ohnaka grew the prowess and reputation of his gang. Though the Acushnet could hold up to sixty-four crew members, Hondo chose to staff the ship with far fewer seasoned pirates to conduct his exploits.\nThe Ohnaka Gang settled on the relatively unknown Outer Rim world of Florrum, located in the Sertar sector. Hondo established his sprawling base of operations in the depths of a canyon, powered by a line of power couplings. Among the base's amenities were landing zones, a large detention center, a marketplace, and a dining hall. Hondo also secretly built a private hangar elsewhere on the planet, which housed his personal collection of starships, among them the Luxury 3000 space yacht Fortune and Glory. With little else on Florrum to drive attention to the planet, the Ohnaka Gang was able to flourish.\nUsing his fleet, Ohnaka conducted raids on backwater worlds with small communities, where his gang faced minimal authority and little resistance and could easily take hold of farming harvests and mining operations. He also had pet Kowakian monkey-lizards named Pilf Mukmuk and Pikk Mukmuk. At some point prior to the Clone Wars, Hondo had a romantic relationship with the bounty hunter Aurra Sing, but the two eventually separated. He was also friends with Jango Fett, whom Hondo saw as an honorable man.\nAt some point prior to the Invasion of Naboo, Hondo and members of his gang were invited to the Drazkel system to attend an auction held by the Xrexus Cartel in their base. Xev Xrexus, the leader of the Xrexus Cartel, hosted the event, with the main event being the auction of a kidnapped Jedi Padawan, Eldra Kaitis. Ohnaka and his crew joined the party alongside several other infamous and notable criminal groups, such as the Black Sun, Pyke Syndicate, and Hutt Cartel. With her guests gathered, Xrexus addressed her crowd and told them that they would be bidding for a Jedi Padawan, whose fate would be decided by the winner. Standing near Grakkus the Hutt and a group of Moogans led by Jee Kra, Hondo listened to Xrexus begin the event.\nXrexus started the bidding at 500,000 unmarked credits, and quickly Hondo and other crime lords began raising the price. The bidding raised to 750,000, then 900,000, eventually reaching 2 million credits. The bidding slowed, and Jee Kra took advantage and offered 2.5 million for the Jedi. Xrexus called out for 3 million, but Hondo and the other bidders did not raise the bid any further and confirmed Kra's victory. Although the auction was over, Xrexus held a party to console the losers, among them Ohnaka. Later, however, a group of bounty hunters raided Jee Kra's ship and killed him, taking Kaitis for their own. Xrexus had their ship bombed as it attempted to escape, sending it plummeting to the surface of moon below. With the ship and it's passengers still alive, Xrexus sent an alert to her guests that there would be a hunt, with a buy-in of 350,000 credits.\nOhnaka and his entourage were still on board Xrexus' ship and responded to her call. Returning to the auction hall, Xrexus told Hondo and the other criminals about her new game, and urged them to pay for entry so they could be planetside as soon as possible. Hondo paid the entry fee and traveled to the moon aboard the Acushnet. Over the course of the hunt, the bounty hunters, among them Aurra Sing and Cad Bane, managed to defeat the waves of hunting parties looking to capture Kaitis, among them a trio of Hondo's crew. During the skirmishes, Kaitis was killed, and Hondo, like other groups who had taken part in the hunt, decided to leave and prepared his ships for departure. While one of his Firestar shuttles was taking off, however, it was attacked by Sing and her comrades, who hijacked it and killed Ohnaka's crew onboard.\nDuring the Clone Wars, Hondo and his gang encountered Count Dooku, the leader of the Confederacy of Independent Systems and a Sith Lord. Dooku was on the run from the Jedi Knights Obi-Wan Kenobi and Anakin Skywalker and had crash-landed his solar sailer on the planet Vanqor, which lay a few parsecs away from Florrum. Dooku encountered Hondo and his gang salvaging his wrecked solar sailer. When Hondo offered to provide him passage offworld, Dooku accepted his offer, claiming he was above material wealth.\nOhnaka then transported Dooku to his base on Florrum. However, during the journey Ohnaka arranged for his Kowakian monkey-lizard Pilf to steal Dooku's lightsaber, as well as Skywalker's lightsaber, which Dooku had acquired during an earlier skirmish on Vanqor. Ohnaka and his men then took Dooku captive. Realizing that Count Dooku was an important Separatist leader, Ohnaka hoped that he could make a lot of money by selling Dooku to the Republic. Hondo contacted the Republic via hologram and displayed the captive Count to Supreme Chancellor Palpatine while demanding a ransom of one million credits worth of spice. Palpatine accepted Ohnaka's price and dispatched Kenobi and Skywalker to Florrum in order to verify the pirate's claims.\nKenobi and Skywalker arrived at Ohnaka's pirate base and were able to verify Dooku's identity. Having completed the transaction, Hondo invited his Jedi guests to banquet with his pirates. However, he drugged the two Jedi's drinks, causing them to fall unconscious. Ohnaka then took his Jedi guests hostage and imprisoned them in the same cell as Dooku. He wanted to ransom Kenobi and Skywalker so that he could triple the ransom. Unaware of the recent developments on Florrum, the Republic dispatched Senator Kharrus and the Gungan Representative Jar Jar Binks and a detachment of clone troopers to deliver the spice ransom to Hondo's gang and collect Count Dooku.\nOne of Ohnaka's pirates, Turk Falso, decided to double-cross his captain and steal the spice ransom for himself. Turk ordered his men to shoot down the Republic emissaries' shuttle, causing it to crash in the Doshar fields. Senator Kharrus, the clone trooper pilot \"Mack,\" and his co-pilot were killed during the crash, but Representative Binks and several clone troopers led by Commander Stone survived. While Turk's band hunted down the Republic emissaries, Turk misled Hondo by claiming that the Republic ship had been delayed. Turk's forces were later slaughtered by Binks' clone troopers, who had managed to tame several local skalders. Turk was the only survivor and falsely reported to Hondo that the Republic forces had sent an army instead of the ransom. Believing Turk's lies, Hondo sent several WLO-5 battle tanks to destroy the clone troopers.\nMeanwhile, Hondo had to deal with Count Dooku and his two Jedi captives who had made three escape attempts. Following the third attempt, he held Kenobi and Skywalker in a containment field. On the battlefield, Hondo's tanks were defeated after Jar Jar Binks entered one of the tanks to negotiate with Turk. Binks accidentally caused the tanks to ram into each other and knock out the power grid. This caused a black-out at Hondo's pirate base which allowed his three captives to escape. Dooku killed Turk and several other pirates before fleeing in one of Hondo's starships.\nMeanwhile the Weequay pirate captain himself was captured by Kenobi and Skywalker. Despite their unpleasant experiences with Ohnaka, Kenobi ordered his former Padawan Skywalker to release Hondo, since Dooku had escaped and they did not want to have any more troubles with the pirate gang. As a gesture of respect, Hondo ordered his forces to stand down. Praising the Jedi for their nobility, he allowed the Jedi and their clone troopers to leave his pirate base in peace. Before they left, Kenobi warned Ohnaka that Count Dooku now knew the location of his base and was not as forgiving as the Jedi foreshadowing events to come.\nFollowing his encounter with Count Dooku and the Jedi, Hondo and the Ohnaka Gang began raiding the fungi-covered planet of Felucia. They routinely raided a nysillin spice village, prompting the Felucian villagers to hire a band of four bounty hunters for their protection. These four bounty hunters were named Sugi, Embo, Rumi Paramita, and Seripas. Shortly later, Hondo's old Jedi adversaries Obi-Wan Kenobi, Anakin Skywalker, and his Padawan Ahsoka Tano visited the same village to investigate the disappearance of a Republic medical station orbiting the planet. The Jedi's arrival coincided with one of the Ohnaka gang's routine visits to the village.\nHondo began demanding that the villagers deliver a portion of their nysillin by the following morning. While visiting the village, he also attempted to buy-out the bounty hunters but Sugi rejected the offer. Ohnaka then discussed a \"business deal\" with the Jedi Knight Kenobi, who offered to pay the Ohnaka gang to take him and his Jedi companions to a Republic outpost. However, Ohnaka declined the venture on the grounds that he did not want any credits. After issuing his ultimatum to the villages, Hondo left the village to regroup with his pirate forces. Meanwhile, the Jedi and the bounty hunters worked together to train the Felucian villages to resist Hondo and his pirate gang.\nHondo sent one of his scouts to spy on the villages, but the scout was killed by Embo. After the scout failed to return, Ohnaka and his pirates assaulted the village. While Hondo led the assault from the cockpit of a tank, the rest of the gang charged the village on their speeder bikes. During the ensuing skirmish, Hondo used his tank to blast the village from atop a cliff, wounding Embo and killing the bounty hunter Rumi. Skywalker then engaged the Weequay pirate in a duel with his lightsaber, prompting Hondo to brandish his electrostaff in defense.\nThe Jedi eventually gained the upper hand and nearly kicked Hondo off the cliff. But Hondo managed to survive by clinging onto the ledge. Feigning submission, Ohnaka tricked Anakin into pulling him up. However, Ohnaka then attacked Skywalker and pushed him into the way of the repulsor tank's turret. While Skywalker managed to survive by jumping off the cliff before the shot hit, Hondo was able to take advantage of the chaos to make his escape, fleeing the planet and village along with his pirate gang.\nLater, Hondo was revisited by his former lover, the bounty hunter Aurra Sing. Sing was accompanied by Boba Fett, Bossk, and Castas. Sing had become Boba's mentor and was helping the youth to hunt down and kill the Jedi Master Mace Windu, who had killed his father Jango Fett during the First Battle of Geonosis. She had come to seek aid and refuge from the Republic, as well as to drop off Castas as he wanted to abandon the job since it had become too risky. Ohnaka refused to assist Sing and Boba with their quest, but offered them indefinite stay on Florrum. While in the bar with his guests, Hondo witnessed Aurra execute Castas for disclosing their whereabouts to other bounty hunters, hoping to make a profit.\nAurra's visit was followed by the arrival of the Jedi Master Plo Koon and Anakin's apprentice Ahsoka Tano, who had been tracking Boba and his associates. Hondo informed the two Jedi that Aurra and Boba were waiting in a bar and had set a trap for them. Following a brief skirmish, Aurra fled the bar in an airspeeder and was pursued by Ahsoka. While under capture by Koon, Hondo managed to convince the young Fett to reveal the location of the Republic hostages Admiral Shoan Kilian and a Clone officer, telling him that it is was what his father would want him to do. Fett complied and the Jedi were able to rescue the Republic hostages and capture Bossk. Far from the base, Aurra attempted to escape on Boba Fett's starship Slave I. However, Ahsoka damaged the starship's wing, causing it to crash. While Aurra was presumed dead by the Jedi, Hondo secretly rescued her and took possession of Slave I in lieu of Boba's incarceration.\nLater in the war, Ohnaka—at the behest of the Jedi General Anakin Skywalker—delivered several rocket launchers to rebel forces on Onderon during their civil war when the droid gunships proved to be too much for the rebels. Ahsoka was surprised to see him, and he quickly fled the planet along with his pirates when a droid patrol attacked the group.\nLater during the Clone Wars, Ohnaka and his pirate gang's Corona-class armed frigate intercepted and boarded the Jedi training cruiser Crucible, which was carrying the Padawan Ahsoka Tano, the architect droid Huyang, the astromech droid R2-D2, and six Jedi younglings Petro, Gungi, Katooni, Ganodi, Byph, and Zatt. These younglings had recently completed an initiation rite on Ilum. The Ohnaka Gang wanted to take the youngling's kyber crystals, which were highly prized on the black market. During the raid, Ohnaka and his pirates used a docking tube to board the Crucible. Following a struggle Huyang, R2-D2, and the younglings managed to break their ship free of the pirates and escape into space. However, Tano was sucked into the docking tube during the escape attempt and captured by Ohnaka, who regarded her as a valuable hostage and intended to turn her \"into profit.\"\nFollowing the raid, Ohnaka and his gang took Ahsoka Tano to their base on Florrum. There, he taunted the suspended Tano, and revealed that he intended to sell her to an underworld \"businessman\" who would pay \"handsomely\" for a beautiful female Jedi. He also threateningly claimed that the so-called \"businessman\" did not care whether Tano was delivered to him dead or alive. Later, the Ohnaka Gang was visited by a traveling carnival troupe led by the Dug manager Preigo. Unknown to Ohnaka, the six Jedi younglings had passed themselves as junior acrobats. The younglings managed to impress Ohnaka and his pirates during an entry act and subsequently convinced the drunken pirate captain to take part in the second act. While Hondo and his pirates were distracted, the youngling Katooni managed to free Tano and recover her lightsabers. When his pirates spotted the Jedi escaping and gave chase, Ohnaka was too intoxicated to take part in the pursuit.\nHondo Ohnaka stayed at his pirate base while his pirates attempted to recapture Ahsoka and her younglings in the wilderness. During this time, the pirate captain was subsequently visited by the Separatist military leader General Grievous and a droid army. Grievous opened a holo-communications channel with Count Dooku, who conferred with Hondo. In retaliation for his imprisonment during their first encounter, the Separatist leader had come to take over Florrum and to dismantle Ohnaka's arsenal. Despite his protests, Hondo was incarcerated by the Separatists who proceeded to dismantle his base and vehicles.\nMeanwhile, Tano and the younglings joined forces with the Ohnaka gang to rescue Hondo and to fight the Separatists. While R2-D2 distracted the Separatist droids with the pirate's tank, Ahsoka, the younglings and several of the pirates made their way into the pirate base and found Hondo's cell. With the encouragement of Hondo, the youngling Katooni managed to correctly assemble her lightsaber and free Hondo from his cell. After freeing the remaining pirates, Hondo and his Jedi rescuers managed to escape the prison section before it was leveled by Separatist tanks.\nDuring their escape, Ohnaka and his pirates attempted to flee the planet but the youngling Katooni managed to appeal to his sense of honor. Flying the repaired Slave I, Hondo managed to rescue Ahsoka and the remaining younglings from General Grievous, and together the surviving pirates and the Jedi escaped to a nearby Republic cruiser, where they were picked up by General Kenobi. When confronted by Kenobi about the attack on the Crucible, Hondo claimed that it was a rescue mission. Kenobi decided not to punish Hondo and the Ohnaka gang due to the assistance they had provided Tano and the younglings. Hondo departed but not before giving Katooni a final nod of approval for her actions on Florrum.\nIn the aftermath of the Separatist attack, Hondo acquired three new Corona-class frigates. Each of these ships were commanded by Ohnaka's captains, Jiro, Sabo, and Goru, as mobile bases to patrol the Florrum system and prevent another attack such as the Confederacy's. Because of the new ships, Hondo semi-retired the \"Acushnet\", which he stored on Florrum in an undisclosed location.\nHondo encountered a new challenge in the form of the Sith Lords Maul and his brother Savage Opress, who attempted to recruit Ohnaka's gang into an army that would serve the brothers. The brothers managed to lure several of the Ohnaka Gang aboard their starship and managed to bribe Jiro and Goru into flipping sides. Those that remained loyal to Hondo, including Sabo, were executed by the two brothers. Hondo witnessed the execution via hologram. Under the leadership of Maul and Savage Oppress, the turncoat pirates then launched an attack on Ohnaka's base on Florrum and claimed it for their own.\nFortunately for Hondo, he received reinforcements in the form of the Jedi Master Obi-Wan Kenobi and the Jedi Master Adi Gallia. Together with these Jedi reinforcements, Hondo and his pirates resisted the brothers' onslaught. During the fighting, Gallia was killed by Opress. Hondo retreated with the remainder of his loyalists, and when he asked Kenobi where Gallia was, he told him she was dead. Hondo was shocked, stating that he was speechless and that not even Kenobi could defeat the two \"crazies.\" Hondo's men managed to obtain a large turret and he ordered them to set up a trap for the traitors. Kenobi told Hondo to collapse the tunnel so that the brothers would be separated from the pirates; much to his anticipation, the two went after Kenobi while the pirates pursued Hondo and his men.\nHondo's men took out the large turret as the traitorous pirates pursued them, and they surrendered, knowing they were outmatched. Jiro, one of the traitorous captains, begged for mercy, and Hondo accepted him and the remaining pirates back into the gang. Hondo decided to celebrate the reunion by pillaging the brother's ship. As the pirates went out to meet with the brothers who were also retreating, Hondo reinvigorated his men by stating that they weren't that strong if Kenobi was defeating them alone. The two attempted to flee on their ship, which was shot down by one of Hondo's men. Hondo offered Kenobi a ride to the crash site to confirm if the two were dead. He believed that both of them had died in the crash, while Kenobi believed otherwise. Hondo and his men then looted the wreckage, obtaining credits and weaponry.\nSometime later, Ohnaka's Gang plundered the Steady On of its cargo and destroyed the vessel's fighter escort, unwittingly stealing the haul from rival pirate Lassa Rhayme and her gang, the Blood Bone Order. When Ohnaka was absent from Florrum, Rhayme set up a meeting with Jiro, concealing her true identity and pretending to be a member of her crew wanting to defect to Ohnaka. In addition to information on the Blood Bone Order, she offered Jiro her Jedi prisoner . This was all a ploy for Rhayme and Ventress to recover the cargo of the Steady On, which Ohnaka's Gang was unloading.\nAfter successfully getting Jiro to send most of his men to the bogus coordinates of the Blood Bone Order's fleet, Rhayme and Ventress took out most of the remaining pirates before being interrupted by the return of Hondo himself. Rhayme dueled the Weequay captain with Ventress' lightsaber, eventually disarming and holding him hostage until the Steady On's cargo was handed over to her, upon which she and Ventress left the system. At some point towards the end of the war, Fett reclaimed ownership of the Slave I from Ohnaka, who also mentored the young man in the bounty hunting profession for a time.\nAt some point after the rise of the Galactic Empire and the fall of the Republic, the Imperials broke up the Ohnaka Gang, forcing Hondo Ohnaka to continue his life of piracy alone. At some unknown point, Ohnaka antagonized the Rang Clan, causing the clan to place a bounty on his head. At some point, Ohnaka wrote the Book of Hondo.\nDuring the Imperial Era, Hondo and his protégé Quadoro were hired by Dok-Ondar to assist him in collecting a statue made of kyber crystal from Jedha City's Temple of the Kyber. Hondo was able to stun one of the Guardians of the Whills, but several more attacked him. After Quadoro was killed, Hondo and Dok-Ondar found a statue. After Dok-Ondar used a lightsaber to cut the statue, Hondo was confronted by Chirrut Îmwe. The two of them fought each other until Dok-Ondar convinced Îmwe to let them leave with the statue. Hondo and Dok-Ondar then boarded their ship and slipped past the Imperial blockade.\nAt one point Ohnaka was paid a significant amount of credits by a female Jedi for her to hide, a fact which reached the Imperial Inquisitorius.\nAt some point following 13 BBY, Hondo teamed up with IG-88 to collect the bounty on Qi'ra, a lieutenant in Dryden Vos' crime syndicate, Crimson Dawn. After IG-88 chased her through the streets of Ord Mantell and into an alley, Hondo emerged to capture her when she tried to escape into a building. Eventually though, Hondo was tricked and double-crossed by IG-88 when Qi'ra manipulated Hondo into revealing the bounty on his head was higher than both IG-88 and Qi'ra's combined. When IG-88 raised his vibroblade at Hondo, Qi'ra successfully subdued the pair and collected the bounties on both of their heads.\nAfter acquiring the book known as Smuggler's Guide in the lost-items office of Thikkiiana City on Kashyyyk, Hondo Ohnaka wondered what happened to it's previous owner, Tyro Viveca, but quickly dismissed the idea as his own concern, as long as he doesn't come looking for this logbook. He flipped through the pages and recognized the value of the name Maz Kanata, as many would pay for knowledge of buried treasures and secrets in this book. He also wondered if the book was fake, made to separate fools from credits, which inspired a new business plan.\nHe visited the planet Florrum to find the master forger, Bar the Rotter, in the Cellar of Penitence at the Church of Infinite Perception. Having persuaded Bar with a drink of Whyren's Reserve, Hondo left Florrum and set a course for Balmorra. Hondo next sought to find the Marquess, who could manipulate the Undervine network. Hondo planned for Bar to complete three logbook forgeries, and for Marquess to reach out for buyers on the anonymous Undervine to arrange three auctions, while bidders would be unaware of competing auctions.\nHondo organized the first auction in panopticon garret above the casino floor on the Zirtran's Anchor space station, renting the room for 5,000 credits. Hondo hoped to bring six bottles of Whyren's Reserve as refreshments until Bar found the storeroom key, which left him with half a bottle. The auction attracted agents from multiple syndicates and started with a bid at 75,000 credits, but was ended when Rang Clan used a document authenticator to verify the fake Maz Kanata's Journal and started a blaster fight, but Hondo was prepared for such a catastrophe.\nAt the first sign of a blaster, the Marquess jerked her neck to rattle the gears inside her headpiece, which made every screen on the walls flash white at the same time, blinding anyone who hadn't closed their eyes. But Xrexus Cartel's droideka remained and followed Hondo, Marquess, and Bar to the turbolift. Hondo closed the turbolift doors just before the droideka assumed attack stance, leaving behind Marquess and Bar, claiming that the turbolift wasn't big enough to fit three people. Hondo wondered if he should have held the doors open for others, but dismissed the thought as no one would benefit if he died. As he feared, the word spread on Undervine about the forgery of Smuggler's Guide, derailing Hondo's plans for the auction in the Boro-borosa system and the third auction.\nLater, Hondo found a polished stone among Bar's belongings that he used for meditation on teachings of the Church of Infinite Perception. He acquired a state of enlightenment when he took a stone with him to Kafrene bordellos leading him to return to his pirate ways. Ohnaka wrote about his experiences with the auction throughout his journey, with Lando Calrissian, Master Codebreaker and the archaeologist Chelli Lona Aphra annotating the pages with their own comments when the book later fell into their possession. Later, Hondo Ohnaka was captured by Gunda Mabin and lost Smuggler's Guide and others things to her.\nIn 4 BBY, Hondo Ohnaka took over the Devaronian crime lord Cikatro Vizago's starship, the Broken Horn. During the struggle, Ohnaka managed to disable Vizago's bodyguard droids by stealing his droid controller and imprisoned the Devaronian in a cell aboard the ship's brig. However, Vizago managed to send a distress signal before his capture that was picked up by Ezra Bridger and the astromech droid Chopper, who were members of the Spectres. The two rebels were cleaning the rebel starship Ghost which was parked on the planet Garel. Hearing Vizago's distress, Ezra and Chopper traveled on the Phantom and found the Broken Horn in orbit above Garel.\nThe two rebels boarded the Broken Horn and encountered Ohnaka in the ship's bridge. When questioned by Ezra, Hondo claimed that he had won the Broken Horn in a game of sabacc with Vizago. Not wanting to reveal his true identity, Ezra introduced himself as the smuggler and galactic entrepreneur Lando Calrissian. Shortly later, the Broken Horn was spotted and attacked by an Imperial warship. However, Ohnaka and his new-found rebel partners managed to escape due to the quick actions of Ezra and Chopper, who managed to power up the engines and make a jump into hyperspace. Impressed, Hondo offered Ezra the chance to assist him in selling five power generators at extortion rates. In the end, the two partners agreed to split their profits and to give Ezra two of the power generators. Not trusting Ohnaka fully, Ezra stole the pirate's droid controller and secretly handed it to Chopper for safekeeping.\nHondo and his new-found partners traveled to the frigid planet Nixus where they planned to sell the power generators to an unknown buyer at Nixus Hub 218. Upon landing at Nixus Hub 218, Ohnaka and Ezra discovered that their buyer was the Jablogian crime lord Azmorigan. Azmorigan was aware that the Rang Clan had placed a bounty on Ohnaka's head and he also recognized Ezra as one of the rebels who had helped Calrissian. Seeking revenge against both Hondo and Ezra for past wrongs, Azmorigan had them hoisted onto a loading dolly which would then catapult them into space. Azmorigan also planned to seize their power generators for himself. Before Azmorigan could exact his revenge, he was foiled by Chopper, who attacked him and his men. During the ensuing skirmish, Ohnaka and his rebel allies managed to turn the tables on Azmorigan and escape off-world with the generators and several stolen credits. Hondo also realized that Ezra was a Jedi after the youth wielded a lightsaber and used the Force to stop the dolly from hurling him into space.\nAfter escaping Nixus, Hondo and his rebel partners traveled back to Garel on the Broken Horn with the generators. When Ezra revealed his true identity and confided that he was feeling overwhelmed by his responsibilities to the rebellion and his Jedi training, Ohnaka suggested that the boy could become a \"pirate Jedi.\" Shortly later, Ezra and Chopper traveled down to the ship's brig where they discovered a captive Vizago. Vizago revealed that Hondo had actually shot him in the back with a stun gun and disabled his droids before seizing control of his ship. The two rebels freed Vizago and together they confronted Ohnaka on the bridge. While Ezra proposed that the two criminals split their profits and let him keep the generators, Vizago took the opportunity to snatch back his droid controller and order his droids to attack the intruders. Ohnaka managed to flee on the Phantom, taking the five power generators with him.\nUnknown to Hondo, the Phantom's autopilot had already been programmed to return to her mothership, the Ghost. Hondo landed in a spaceport in Garel City where he was surrounded by the other crew of the Ghost including the ship's captain Hera Syndulla and Ezra's master Kanan Jarrus. Shortly later, Ohnaka was rejoined by Ezra and Chopper, who had returned to Garel in an escape pod. The rebels allowed Hondo to keep his credits but seized the five power generators, which were used to alleviate an energy crisis on the planet Rinn.\nIn 3 BBY, Hondo contacted Ezra via a transmitter and told him to travel to Nixus Hub 218, where the Empire had captured two refugees. Ezra and the crew of the Ghost traveled to Nixus where they discovered that these two refugees were Lasat who has survived the fall of Lasan. The rebels managed to overpower their Imperial captors and rescue the refugees, who introduced themselves as the former Lasan High Honor Guard Gron and the female mystic Chava the Wise. This development both delighted and unnerved Garazeb Orrelios, the sole Lasat member of the crew of the Ghost who had believed that he was the last of his species. After the rescue, Ohnaka introduced himself as Ezra's mysterious contact and revealed that he had also tipped off the Empire to the refugees' arrival knowing that the rebels would arrive to save the day.\nWith Imperial reinforcements bound to show up, the rebels began their return trip to the Ghost. When Ohnaka inquired if he would be receiving payment, Ezra refused, which made the Weequay pirate very proud of his young friend, saying he had never had a student learn so quickly. After the rebels had left, Hondo was cornered by several stormtroopers. Always one to make a profit and double-cross his friends to save himself, Ohnaka led the Imperial troopers to the rebels, who were making their way through the halls of Hub 218. These stormtroopers were serving under the Imperial Security Bureau Agent Kallus, a perennial foe of the Spectres, who ordered his men to seize them alive. Before the Imperials could capture the rebels, Ohnaka secretly contacted Ezra and warned him of the approaching Imperials he had sent their way.\nThe stormtroopers engaged the crew of the Ghost in a fire fight within the halls of Nixus Hub 218. To help his rebel partners, Hondo secretly sealed several of the doors, preventing many of the stormtroopers from pursuing the rebels. Ohnaka's actions enabled the rebels to flee aboard the Ghost and escape into hyperspace. However, Hondo was not so lucky and he was captured by the stormtroopers. Ohnaka was then forced to help agent Kallus and Admiral Kassius Konstantine hunt down the rebels. Due to a tracker planted in the transmitter which he had used to contact Ezra, the Imperials were able to track down the rebel ship Ghost to an unstable star cluster in Wild Space.\nWhen the Ghost began penetrating the unstable star cluster, Hondo marveled that the rebels were trying a dangerous feat. This prompted Kallus to respond that they believed that they could. With Kallus' Imperial cruiser unable to follow the Ghost into the star cluster, Hondo remarked that Kallus should wait to catch them the next time. Kallus then responded that the rebels would be destroyed by the gravitational pull of the star cluster. Despite the odds, the rebels and the Lasat refugees managed to navigate safely through the maze due to Zeb's bo-rifle. They then rediscovered the legendary Lasat homeworld of Lira San, which was already populated by millions of Lasat and became a refuge for the two Lasat refugees.\nFollowing the events on Nixus Hub 218, Hondo was imprisoned by the Empire at the Imperial prison on Naraka. He shared his cell with the Ugnaught laborer Terba, who had been imprisoned for trying to escape the Imperial junkyard Reklam Station inside the planet Yarma. Reklam Station was being used to dismantle several decommissioned Republic starfighters including Y-wing starfighters. Seeking pecuniary reward and to escape the prison, Terba related the information to Hondo. Hondo then convinced the Spectres particularly his former one-time partner Ezra Bridger to rescue him in return for disclosing this valuable information. In 2 BBY, Ezra and his fellow rebels staged a rescue and managed to evacuate Hondo. However, Terba was killed during the escape attempt when he separated from the rebels after Hondo refused to give him a double share.\nAfter his escape, Hondo accompanied the Spectres back to Chopper Base on the planet Atollon. There, he tried to convince Hera to sell him the Ghost but was rebuffed by the rebel captain. Hondo then reiterated his demand for a ship equipped with a hyperdrive, detachable cargo bay, shield generator, and a crew. In response, the Phoenix Cell's Commander Jun Sato reminded the pirate that he would be paid only if his information was useful. Hondo then informed the rebels about Reklam Station and the Y-wings being dismantled there. At the urging of Rex and Ezra, Hera agreed to send a reconnaissance mission there to investigate Hondo's claims.\nHondo and Ezra's team including Rex traveled to Yarma in the assault shuttle Phantom. Since they could not travel there directly the Phantom exited hyperspace at Sereeda Waypoint. Hondo warned them that it was not a good idea since Sereeda was located in Mining Guild space. As Hondo had forewarned, the Phantom was intercepted by a Mining Guild patrol. Following a brief dogfight, the rebels fled into hyperspace and reached Yarma. Hondo then guided Sabine to Reklam Station, which lay inside the gassy planet's atmosphere. On the way, the rebels were ambushed by two DTS-series Dismantler Droids but managed to shoot them down. Despite being hit, Sabine managed to land the Phantom beneath one of the orbital station's platforms.\nAfter boarding the station, Hondo and the rebels encountered several Ugnaught laborers including Melch. While Ezra wanted to ignore them, Hondo spoke to the Ugnaughts and told them that he was Terba's friend and that the rebels had come to liberate them. Ezra then asked Hondo to convince Melch to shut down the conveyor belt. Following a skirmish with Imperial stormtroopers and dismantler droids, the rebels, Hondo and the Ugnaughts managed to steal five Y-wings. Hondo and the Ugnaughts followed Ezra to the command center but stopped to guard an Imperial landing craft in the hangar. After the station began to collapse, Hondo and his Ugnaught allies took the shuttle and fled offworld. Before leaving, Hondo contacted Ezra to thank him and his friends for rescuing him.\nWhen Ezra was later captured by the Imperial Viceroy Gar Saxon during a mission to the third moon of Concord Dawn, Ezra claimed that he worked as part of Hondo's scavenging party. However, Saxon was not fooled and continued interrogating his prisoner.\nHondo then tipped off Ezra about the rare creature, the Argora, being held a Class four container transport that acted as the Emperor's personal zoo. Hondo then boarded the transport where he found the Argora. Unfortunately, Hondo did not know which crate the Argora was in and inadvertently released the other captive creatures. As Hondo made his way to escape the creatures, he ran into the Spectres. At first, Hondo refused to hand the Argora over to them and told them that they had other things to worry about than stormtroopers.\nAs the creatures approached both Hondo and the Spectres, he then tried to make his escape. Hondo was then chased by Ezra, who demanded Hondo to surrender the Argora. Unfortunately, Hondo and Ezra were then confronted by stormtroopers under Dr. Hazlekk and Captain Zarda. As the stormtroopers prepared to fire, Hondo again made his escape when the rest of the Spectres arrived. Hondo and Ezra then worked together in trapping Hazlekk, Zarda and their stormtroopers behind a force field. Hondo then tried to make off with the Argora, but Ezra released it. Hondo then came under attack from it and decided to give it to the rebels. Hondo then boarded the Last Chance and left.\nLater, Hondo struck a business partnership with the Jablogian crime lord Azmorigan, who had acquired the flight plan for an Imperial cargo ship. Azmorigan had learned that the cargo ship was carrying treasures and proton bombs. The two partners and Hondo's Ugnaught crew ambushed the cargo ship near the planet Wynkahthu. However, the cargo ship drifted into the planet's stormy upper atmosphere. Hondo sent his Ugnaught crew to board the ship but most of them were lost due to the dangerous windy conditions. Only Melch survived the boarding and Hondo abandoned his last crew member to his fate.\nWith their plan in tatters, Hondo contacted his old friend Ezra Bridger and solicited the help of his rebel cell. While Hera was opposed to working with Hondo and Azmorigan due to their negative past encounters, she agreed to commit her crew and ship Ghost after learning that the cargo ship contained proton bombs, which the rebellion desperately needed. Following some discussion, Hondo and Azmorigan agreed to split the treasure while the rebels obtained the proton bombs. After assessing the situation, the rebels decided to board the cargo ship by leaping on its hull and then opening the cargo bay. They would load the cargo onto the ship by firing grappling guns.\nWhen the rebel recovery team assembled in the Ghost's cargo bay, Hondo tried to dissuade Azmorigan from coming by claiming that the recovery mission was too arduous for the frail Jablogian. However, Azmorigan insisted on coming along and threatened not to let the mission go ahead unless he came. After leaping onto the hull, Hondo, Azmorigan and the Spectres led by Zeb managed to find a manhole which led inside the ship. Hondo soon encountered Melch, who attacked him for abandoning him. At the urging of Zeb, Hondo admitted that he had contracted the rebels after losing his Ugnaught crew. Hondo managed to win Melch over by offering him a two percent share of the treasure.\nWhile Zeb was angry at Hondo's deception, Ezra tried to defend him by claiming he at least told half the truth. Hondo, Azmorigan, and the rebels managed to enter the cargo bay with the help of Chopper and Ezra. Once inside, Hondo and Azmorigan squabbled over the treasure while the rebels began preparations to load the proton bombs aboard the Ghost. Using grappling guns, they managed to fire two cables onto the Ghost. The rebels used the cables to tow the proton bombs aboard the Ghost.\nAfter Hondo tried to load one of his treasures with Ezra's help, Zeb objected and reminded Hondo that the rebels got to load their weapons first. After Azmorigan disappeared and Zeb vanished while trying to find him, Ezra tried to ask Hondo for help but the Weequay pirate was more concerned about his share of the treasure. Hondo also told Ezra that Azmorigan was his business partner and acquaintance. As a result, Ezra realized that Hondo only cared for himself. Ezra subsequently discovered that Zeb and Azmorigan had been locked in the brig by a DT-series sentry droid. He managed to free them but the rebels and Azmorigan were pursued by more sentry droids.\nWhen Ezra and the others returned to the cargo bay with sentry droids behind them, Hondo and Melch were attempting to load a crate onto the cables. Ezra told them to get ready to leave but Hondo insisted on taking the treasure. Amidst the confusion, Melch hid inside a crate; not trusting Hondo to save him. Hondo was unconcerned about Melch's disappearance and claimed that he had fallen to his death. Hondo and Azmorigan raced each other on the cables back to the Ghost while clutching to their cargo. Chopper, Ezra, and Zeb followed soon. The Imperial cargo ship then fell into the vortex and exploded, destroying everything aboard.\nBack aboard the Ghost, Hondo and Azmorigan fought over a chest only to discover a hidden Melch inside. While Hondo was disappointed at not getting his share of the treasure, he claimed to have learned the value of friendship. Melch punched him in the chest to indicate that he did not trust Hondo's words. Hera then ordered Hondo and his associates to continue their conversation on their stolen Imperial landing craft.\nAt the request of Hera Syndulla, the bounty hunter Ketsu Onyo located Hondo and Melch on the planet Seelos, where they were staying with the former Clone commandos Gregor and Wolffe. Hondo and the others present when at the modified AT-AT walker Joopa Base when Hera and Rex arrived on the Ghost. Hera had come to recruit Hondo and the others to help Ezra liberate his homeworld of Lothal from the Empire. While Hondo agreed with Wolffe that they had little chance of prevailing against the Empire, he admired Ezra's courage and said that there was nothing he would not do for the boy.\nDuring their journey to Lothal, Hondo convinced Hera to latch the Ghost onto the hull of a cargo ship in order to slip through the Imperial blockade of Lothal. Despite the misgivings of Hera and Kallus about his plan, the other rebels placed their trust on Hondo and latched onto the cargo ship once it had exited hyperspace. Hondo's ploy worked and the rebels were able to enter Lothal's atmosphere undetected. Upon arriving above the Lothal cliff dwelling, Hondo and Melch helped the rebels to route Governor Arihnda Pryce's attack force by shooting down two Imperial patrol transports.\nFollowing the battle, Hondo along with Melch and Ketsu met up with Ezra. When Hondo asked if he could take his leave, Ezra told him that their struggle was not over until they expelled the Empire from Lothal and showed that the Imperials could be defeated.\nFollowing the skirmish at the Lothal cliff-dwelling, Hondo took part in the Rebels' attack on the Imperial Complex, a mobile Imperial Planetary Occupation Facility. As part of their plan, the rebels used an unwilling Pryce to gain landing rights at the Dome. Hondo and Melch helped to capture the command center by distracting the officers and stormtroopers inside long enough for the other rebels to storm the room and force their surrender.\nAfter using a faux Protocol 13 to evacuate the entire Imperial garrison aboard the \"Dome,\" the rebels tried to fire up the Dome's engines only to be blocked by Grand Admiral Thrawn's Star Destroyer Chimaera. Thrawn managed to force Ezra to come to him to discuss an unconditional surrender by bombing Capital City. In Ezra's absence, the rebels adopted Sabine's plan to send two strike teams to recapture the power terminals that powered the Dome's deflector shield generator.\nWhile Melch pursued stormtroopers, Hondo joined Rex and Ketsu Onyo as Team A to secure the north tower's power terminal. Despite fierce resistance, the rebels managed to capture the power terminal. Hondo took out several of the stormtroopers when he thought Melch was killed. He then discovered that Melch had only been stunned. Shortly later, the rebels managed to raise the Dome's deflector shields before the Chimaera was able to restart their bombardment of the capital.\nAfter Ezra managed to summon a pod of purrgil to carry himself, Thrawn, and the Chimaera into the depths of space, the rebels were able to launch the Dome into Lothal's upper atmosphere. Hondo and the other rebels managed to escape before detonating the Dome, which wiped out the Imperial garrison on Lothal. This ended Imperial rule on the planet.\nSometime after the Battle of Yavin, Saponza, together with his partner, accepted a contract with Hondo, who had been watching Saponza's partner's work. The business venture involved undertaking various important jobs for a means of profit.\nDuring some point after the Battle of Yavin, Aphra and Just Lucky were known to have stolen some stuff for Hondo.\nAt some point after the Battle of Endor, a portrait of Ohnaka was hung inside Takodana Castle on Takodana.\nBy the time of the Cold War between the First Order and the Resistance, Ohnaka had begun a new endeavor, Ohnaka Transport Solutions, on the planet Batuu with his droid R5-P8. Despite claiming to be a legitimate business, Ohnaka's company was, in reality, a front for smuggling. While at Black Spire Outpost on Batuu, Ohnaka frequently recounted tales of besting a Jedi.\nWhen the Kendoh Voss and her gang traveled to Batuu in an attempt to scam Dok-Ondar out of the Sword of Khashyun, Ohnaka agreed to work with Dok-Ondar. He met with the gang at Ohnaka Transport Solutions, where Ohnaka learned from Voss that she needed his help to transport the sword through the First Order blockade after she stole it. Ohnaka reported to Dok-Ondar, unaware that Voss was watching him by use of a cam droid. Ohnaka demanded that Dok-Ondar tell him how he acquired the hilt, and after hearing the story, departed.\nAfter the Battle of Crait, a decisive confrontation of the First Order-Resistance War, Ohnaka was stationed at Bakkar Spire in Black Spire. At some point, the Millennium Falcon landed on Batuu, where Resistance members established a base outside the outpost. Ohnaka made a deal with Chewbacca to use the ship, and hired a temporary crew to take part in one of Ohnaka's jobs, where they were tasked with hijacking a First Order train containing coaxium.\nWhile searching for the Millennium Falcon, mercenary Bazine Netal was informed by the leader of the White Worms on Corellia that Ohnaka was in possession of the ship. With this information, Netal departed for Batuu to find Ohnaka.\nHondo Ohnaka was a self-centered, avaricious pirate who was solely concerned with getting the best business deal for himself. His avarice led him to kidnap and ransom several high profile prisoners during the Clone Wars including Count Dooku, and the Jedi Anakin Skywalker, Obi-Wan Kenobi, and Ahsoka Tano. These characteristics occasionally brought him into trouble with the Jedi, the Republic, the Separatists, and even his own men, who attempted to emulate his behavior to advance their own interests. Ohnaka's avarice and treacherous nature continued into the Age of the Empire by exploiting and betraying several \"business partners\" he collaborated with, including Cikatro Vizago, Ezra Bridger, and the Lasat refugees Chava and Gron. He believed every situation had the chance to be turned into one that could generate profits.\nDespite his selfish qualities, Ohnaka was still capable of honor and courage. On one occasion, he successfully convinced the young bounty hunter Boba Fett to reveal the location of two Republic hostages by telling Boba that it was the honorable thing to do, and calmly affirming that it what his father Jango would have done. On a later occasion, he joined forces with his former Jedi prisoner Ahsoka and several Jedi younglings to fight off General Grievous and his droid forces. Ohnaka admired the courage and devotion of the Jedi younglings, particularly the youngling Katooni.\nOhnaka also had a reputation as a reliable businessman who kept his word. He honored his promise to deliver several rocket launchers to General Skywalker's beleaguered Republic forces and their allies on Onderon. And, despite selling out the Rebels for a profit, Ohnaka didn't run off immediately. He warned Ezra of the incoming stormtroopers and helped the Rebels escape, showing that even though Ohnaka was keen to make a profit, he still didn't want any harm to come to Ezra. In fact, Ohnaka later affirmed that there was nothing he would not do to help Ezra.\nOhnaka also had a romantic relationship with the bounty hunter Aurra Sing, whom he secretly rescued after her ship had been shot down by Jedi forces. In addition, Hondo could speak Ugnaught which helped him to befriend several Ugnaught laborers including Terba. He used his command of the Ugnaught language to convince the Ugnaught laborers at Reklam Station to help the rebels steal Y-wing starfighters and to accept him as their leader. Ohnaka was also skilled at linking other people's interests to his own goals and ambitions. He sold the Phoenix Group information about Y-wing starfighters at Reklam Station in return for gaining a ship and crew. In the end, the rebels did not have to pay Hondo directly because he found a ship and crew at Reklam Station himself.\nThough Hondo's schemes were often frustrated or thwarted by the various Jedi he encountered, he never grew to resent them or hold a grudge, instead seeming to remember those adventures fondly and growing a liking for Jedi generally. He held a particular soft-spot for Obi-Wan Kenobi, whom he often greeted with a warm \"Kenobi!\", even as adversaries.\nOhnaka was also known for his flowery rhetoric and liked to refer to his Ugnaught crew as his \"short, fragrant family.\" While he claimed to regard his Ugnaught crew as his family, Ohnaka was not above abandoning them when danger arose. Ohnaka's betrayal angered Melch, who attacked him. However, Ohnaka managed to placate the Ugnaught by offering him a two percent share of the treasure instead of one. While Bridger trusted Ohnaka to a degree, and respected him as a tricky-but-friendly business partner, Hera Syndulla and Kanan Jarrus regarded him as a slippery and untrustworthy character. While Ohnaka claimed to care for his \"partners,\" he was known to put his pecuniary interests ahead of others .\nWhile Ohnaka thought that Ezra had little chance of success in liberating Lothal, he admired the boy's spirit and courage. Ohnaka's respect for Ezra led him to return the youth a favor by volunteering to assist in the planet's liberation. Despite dominating Melch in their relationship, Ohnaka regarded him as a friend. He was distraught when he thought that Melch had been killed, and shot several stormtroopers in rage. However, Ohnaka was elated when he discovered his friend had merely been stunned and quipped that Melch should not strive to be a hero; reflecting his sarcastic sense of humor.\nA notable trait of Ohnaka's business conduct was his distrust for hard currency. He preferred payment in expensive trade goods, such as spice or Nysillin.\nBy the time he met Ezra, Hondo Ohnaka was aging and his hair had turned gray.\nHondo Ohnaka was a competent and able leader who was able to keep his men in check and to lead the Ohnaka Gang on salvaging and raiding expeditions. During a skirmish on Felucia, Hondo showed a reasonable understanding of battle tactics. Ohnaka typically wielded a Weequay blaster pistol, but he was also skilled enough to handle an electrostaff in combat and managed to put up a decent fight against the Jedi Knight Anakin Skywalker, though he ultimately lost the duel. In addition, Ohnaka was also able to take on numerous opponents and fought several battle droids with a blaster and cutlass. On a later occasion, Ohnaka managed to outwit the crime lord Vizago and his body guards and seize control of his ship, the Broken Horn.\nHondo Ohnaka first appeared in the Cartoon Network The Clone Wars television episode \"Dooku Captured,\" which first premiered on January 2, 2009. He was voiced by Jim Cummings, who later reprised his role in several The Clone Wars episodes and the Disney XD television series Star Wars Rebels. Cummings has also voiced Hondo in the non-canon LEGO Star Wars: The Freemaker Adventures episodes \"The Test\" ) and \"The Storms of Taul\" ).\nHondo's name is derived from the Japanese film director Ishirō Honda and the actor Seiji Onaka, both of whom worked on entries of the Godzilla franchise. This decision was made by Clone Wars writer Henry Gilroy, though Gilroy notes that the pirate's first name was changed to \"Hondo\" by Star Wars creator George Lucas. Rebels executive producer Dave Filoni stated Ohnaka did in fact view Obi-Wan Kenobi as his friend, and after the Jedi were all but destroyed by the Empire, the pirate missed the Jedi Order because of the excitement they had brought to his life. He concluded his statement by saying Ohnaka was a Jedi sympathizer.\nAt Disney's 2017 D23 Expo, it was revealed that Hondo would be a part of the Star Wars: Galaxy's Edge park area. Artwork depicted Hondo and Chewbacca making a deal involving the Millennium Falcon, providing the back story for the Smuggler's Run attraction that will allow guests to fly on board the freighter. Hondo appears as an A-1000 animatronic in the pre-show, the second most-advanced figure Imagineering has built after the Shaman of Songs from Pandora: World of Avatar. The figure has 50 different functions and runs entirely on electronics for smoother animation. Jim Cummings provided the voice for both animatronic, as well for live-action video material in the Smuggler's Run attraction, while the live-action Hondo was performed by actor Robert Nairne. On August 28, Hondo led the dedication ceremony for the Disney World version of Galaxy's Edge.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Hondo_Ohnaka/Legends",
  "/wiki/Hondo",
  "/wiki/Dooku_Captured_(short_story)",
  "/wiki/Almost_a_Jedi",
  "/wiki/Kindred_Spirits",
  "/wiki/Bounty_Hunters_8",
  "/wiki/Doctor_Aphra_(2020)_22",
  "/wiki/Pirate%27s_Price",
  "/wiki/Star_Wars_Adventures:_Flight_of_the_Falcon",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Galaxy%27s_Edge:_Black_Spire",
  "/wiki/Galaxy%27s_Edge_3",
  "/wiki/Galaxy%27s_Edge_4",
  "/wiki/A_Crash_of_Fate",
  "/wiki/Black_Spire:_Return_to_a_Shattered_Planet",
  "/wiki/Halcyon_Legacy_4",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Sriluur",
  "/wiki/Florrum",
  "/wiki/Weequay",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Ohnaka_Gang",
  "/wiki/Ohnaka_Transport_Solutions",
  "/wiki/Pirate",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Civil_War",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Head_of_State",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Ahsoka_Tano",
  "/wiki/Battle_on_Florrum",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Skirmish_on_Florrum",
  "/wiki/Galactic_Empire",
  "/wiki/Ezra_Bridger",
  "/wiki/Spectres",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Lothal",
  "/wiki/Book_of_Hondo",
  "/wiki/Batuu",
  "/wiki/File:HondoQuotesMother-TGG.ogg",
  "/wiki/Planet",
  "/wiki/Hondo_Ohnaka%27s_mother",
  "/wiki/Advisor",
  "/wiki/Porla",
  "/wiki/Hutt",
  "/wiki/Boonta",
  "/wiki/Corporate_Sector",
  "/wiki/Tion_Hegemony",
  "/wiki/Farana",
  "/wiki/Wild_Space",
  "/wiki/Unidentified_collector",
  "/wiki/Corona-class_armed_frigate",
  "/wiki/Flarestar-class_attack_shuttle",
  "/wiki/Acushnet",
  "/wiki/Sertar_sector",
  "/wiki/Hondo%27s_complex",
  "/wiki/Luxury_3000_space_yacht",
  "/wiki/Fortune_and_Glory",
  "/wiki/Kowakian_monkey-lizard",
  "/wiki/Pilf_Mukmuk",
  "/wiki/Pikk_Mukmuk",
  "/wiki/Bounty_hunter",
  "/wiki/Aurra_Sing",
  "/wiki/Jango_Fett",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Drazkel_system",
  "/wiki/Auction_of_Eldra_Kaitis",
  "/wiki/Xrexus_Cartel",
  "/wiki/Xev%27s_hideout",
  "/wiki/Xev_Xrexus",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Eldra_Kaitis",
  "/wiki/Black_Sun",
  "/wiki/Pyke_Syndicate",
  "/wiki/Hutt_Cartel",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Moogan",
  "/wiki/Jee_Kra",
  "/wiki/Cad_Bane%27s_group",
  "/wiki/Cad_Bane",
  "/wiki/File:HondoWhatToDo-TGG.ogg",
  "/wiki/Skirmish_at_Vanqor",
  "/wiki/Sith_Lord",
  "/wiki/Jedi_Knight",
  "/wiki/Count_Dooku%27s_Punworcca_116-class_interstellar_sloop",
  "/wiki/Vanqor",
  "/wiki/Parsec",
  "/wiki/Dooku%27s_lightsaber",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Hologram",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Credit",
  "/wiki/Spice",
  "/wiki/Senator",
  "/wiki/Kharrus",
  "/wiki/Gungan",
  "/wiki/Junior_Representative",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Clone_trooper",
  "/wiki/Turk_Falso",
  "/wiki/Kharrus%27s_Nu-class_attack_shuttle",
  "/wiki/Doshar_fields",
  "/wiki/Clone_trooper_pilot",
  "/wiki/Mack",
  "/wiki/CC-5869",
  "/wiki/Skalder",
  "/wiki/WLO-5_battle_tank",
  "/wiki/Containment_field",
  "/wiki/Felucia",
  "/wiki/Nysillin/Legends",
  "/wiki/Felucian",
  "/wiki/Sugi_(bounty_hunter)",
  "/wiki/Embo",
  "/wiki/Rumi_Paramita",
  "/wiki/Seripas",
  "/wiki/Speeder_bike",
  "/wiki/Skirmish_on_Felucia",
  "/wiki/Electrostaff",
  "/wiki/Boba_Fett",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Castas",
  "/wiki/Jedi_Master",
  "/wiki/Mace_Windu",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Plo_Koon",
  "/wiki/Airspeeder",
  "/wiki/Admiral",
  "/wiki/Shoan_Kilian/Legends",
  "/wiki/Slave_I",
  "/wiki/RPS-6_rocket_launcher",
  "/wiki/Onderon_rebels",
  "/wiki/Onderon",
  "/wiki/Onderonian_Civil_War",
  "/wiki/HMP_droid_gunship",
  "/wiki/Crucible",
  "/wiki/Architect_droid",
  "/wiki/Huyang",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Jedi_Initiate",
  "/wiki/Petro",
  "/wiki/Gungi",
  "/wiki/Katooni",
  "/wiki/Ganodi",
  "/wiki/Byph",
  "/wiki/Zatt",
  "/wiki/Ilum",
  "/wiki/Kyber_crystal",
  "/wiki/Raid_on_the_Crucible",
  "/wiki/Preigo%27s_Traveling_World_of_Wonder",
  "/wiki/Dug",
  "/wiki/Preigo",
  "/wiki/Lightsaber",
  "/wiki/Tank_(vehicle)",
  "/wiki/Jiro",
  "/wiki/Sabo",
  "/wiki/Goru",
  "/wiki/Maul",
  "/wiki/Savage_Opress",
  "/wiki/Adi_Gallia",
  "/wiki/Steady_On",
  "/wiki/Lassa_Rhayme",
  "/wiki/Blood_Bone_Order",
  "/wiki/Asajj_Ventress",
  "/wiki/Ventress%27s_lightsaber",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Rang_Clan",
  "/wiki/Bounty",
  "/wiki/Imperial_Era",
  "/wiki/Quadoro",
  "/wiki/Dok-Ondar",
  "/wiki/Jedha",
  "/wiki/Jedha_City",
  "/wiki/Temple_of_the_Kyber",
  "/wiki/Guardians_of_the_Whills",
  "/wiki/Ki-Adi-Mundi%27s_lightsaber",
  "/wiki/Chirrut_%C3%8Emwe",
  "/wiki/Inquisitorius",
  "/wiki/13_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/IG-88B",
  "/wiki/Mission_to_Ord_Mantell_(Qi%27ra)",
  "/wiki/Qi%27ra",
  "/wiki/Lieutenant_(criminal)",
  "/wiki/Dryden_Vos",
  "/wiki/Crimson_Dawn",
  "/wiki/Ord_Mantell",
  "/wiki/Vibrosword",
  "/wiki/Book",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Thikkiiana_City",
  "/wiki/Kashyyyk",
  "/wiki/Tyro_Viveca",
  "/wiki/Maz_Kanata",
  "/wiki/Forger_(profession)",
  "/wiki/Bar_the_Rotter",
  "/wiki/Cellar_of_Penitence",
  "/wiki/Church_of_Infinite_Perception",
  "/wiki/Whyren%27s_Reserve",
  "/wiki/Balmorra",
  "/wiki/Marquess",
  "/wiki/Undervine",
  "/wiki/First_auction_of_Maz_Kanata%27s_Journal",
  "/wiki/Zirtran%27s_Anchor",
  "/wiki/Space_station",
  "/wiki/Blaster",
  "/wiki/Droideka",
  "/wiki/Turbolift",
  "/wiki/Boro-borosa_system",
  "/wiki/Meditation",
  "/wiki/Kafrene_bordellos",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Master_Codebreaker",
  "/wiki/Archaeologist",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Gunda_Mabin",
  "/wiki/4_BBY",
  "/wiki/Devaronian",
  "/wiki/Crime_lord",
  "/wiki/Cikatro_Vizago",
  "/wiki/Broken_Horn",
  "/wiki/IG-RM_bodyguard_and_enforcer_droid",
  "/wiki/C1-10P",
  "/wiki/Ghost",
  "/wiki/Garel",
  "/wiki/Phantom",
  "/wiki/Sabacc",
  "/wiki/Hyperspace",
  "/wiki/Nixus",
  "/wiki/Nixus_Hub_218",
  "/wiki/Jablogian",
  "/wiki/Azmorigan",
  "/wiki/Realspace",
  "/wiki/Skirmish_in_Nixus_Hub_218",
  "/wiki/Ezra_Bridger%27s_lightsaber",
  "/wiki/The_Force",
  "/wiki/Autopilot",
  "/wiki/Spaceport",
  "/wiki/Garel_City",
  "/wiki/Hera_Syndulla",
  "/wiki/Kanan_Jarrus",
  "/wiki/Escape_pod",
  "/wiki/Rinn",
  "/wiki/3_BBY",
  "/wiki/Transmitter",
  "/wiki/Refugee",
  "/wiki/Lasat",
  "/wiki/Siege_of_Lasan",
  "/wiki/Lasan",
  "/wiki/Lasan_High_Honor_Guard",
  "/wiki/Gron",
  "/wiki/Chava",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Stormtrooper",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Kassius_Konstantine",
  "/wiki/Star_cluster",
  "/wiki/Bo-rifle",
  "/wiki/Lira_San",
  "/wiki/Naraka_prison",
  "/wiki/Naraka",
  "/wiki/Ugnaught",
  "/wiki/Terba",
  "/wiki/Reklam_Station",
  "/wiki/Yarma",
  "/wiki/Starfighter",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/2_BBY",
  "/wiki/Rescue_of_Hondo_Ohnaka",
  "/wiki/Chopper_Base",
  "/wiki/Atollon",
  "/wiki/Hyperdrive",
  "/wiki/Deflector_shield_generator",
  "/wiki/Phoenix_Cell",
  "/wiki/Commander",
  "/wiki/Jun_Sato",
  "/wiki/Rex",
  "/wiki/VCX-series_auxiliary_starfighter",
  "/wiki/Sereeda_Waypoint",
  "/wiki/Mining_Guild",
  "/wiki/Gas",
  "/wiki/Atmosphere",
  "/wiki/DTS-series_Dismantler_Droid",
  "/wiki/Orbit",
  "/wiki/Melch",
  "/wiki/Mission_to_Reklam_Station",
  "/wiki/Sentinel-class_landing_craft",
  "/wiki/Hangar",
  "/wiki/Viceroy",
  "/wiki/Gar_Saxon",
  "/wiki/Mission_to_the_third_moon_of_Concord_Dawn",
  "/wiki/Third_moon_of_Concord_Dawn",
  "/wiki/Concord_Dawn",
  "/wiki/Argora",
  "/wiki/Class_four_container_transport",
  "/wiki/Emperor%27s_personal_zoo",
  "/wiki/Hazlekk",
  "/wiki/Zarda",
  "/wiki/Force_field",
  "/wiki/Last_Chance",
  "/wiki/Proton_bomb",
  "/wiki/Wynkahthu",
  "/wiki/DT-series_sentry_droid",
  "/wiki/Ketsu_Onyo",
  "/wiki/Seelos",
  "/wiki/Clone_commando",
  "/wiki/Gregor",
  "/wiki/Wolffe",
  "/wiki/All_Terrain_Armored_Transport_(original)",
  "/wiki/Joopa_Base",
  "/wiki/Lothal_cliff_dwelling",
  "/wiki/Governor",
  "/wiki/Arihnda_Pryce",
  "/wiki/LAAT/le_patrol_gunship",
  "/wiki/Imperial_Complex_(Lothal)",
  "/wiki/Imperial_Planetary_Occupation_Facility",
  "/wiki/Protocol_13",
  "/wiki/Chimaera",
  "/wiki/Purrgil",
  "/wiki/Battle_of_Yavin",
  "/wiki/Saponza",
  "/wiki/Saponza%27s_partner",
  "/wiki/Just_Lucky",
  "/wiki/Battle_of_Endor",
  "/wiki/Takodana_Castle",
  "/wiki/Takodana",
  "/wiki/Cold_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/R5-P8",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Kendoh_Voss",
  "/wiki/Kendoh_Gang",
  "/wiki/Sword_of_Khashyun",
  "/wiki/Cam_droid",
  "/wiki/Battle_of_Crait",
  "/wiki/Bakkar_Spire",
  "/wiki/Millennium_Falcon",
  "/wiki/Ancient_ruins",
  "/wiki/Chewbacca",
  "/wiki/Heist_on_a_First_Order_train",
  "/wiki/Coaxium",
  "/wiki/Bazine_Netal",
  "/wiki/Proxima",
  "/wiki/White_Worms",
  "/wiki/Corellia",
  "/wiki/Ugnaught_(language)",
  "/wiki/Nysillin",
  "/wiki/Weequay_blaster_pistol",
  "/wiki/Battle_droid",
  "/wiki/Cartoon_Network",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Dooku_Captured",
  "/wiki/January_2",
  "/wiki/2009",
  "/wiki/Jim_Cummings",
  "/wiki/Disney_XD",
  "/wiki/Star_Wars_Rebels",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/The_Test",
  "/wiki/July_25",
  "/wiki/2016",
  "/wiki/The_Storms_of_Taul",
  "/wiki/August_2",
  "/wiki/2017",
  "/wiki/Henry_Gilroy",
  "/wiki/Star_Wars",
  "/wiki/George_Lucas",
  "/wiki/Dave_Filoni",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Millennium_Falcon:_Smuggler%27s_Run",
  "/wiki/Freighter",
  "/wiki/Robert_Nairne",
  "/wiki/August_28",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Darth_Maul_(2017)_2",
  "/wiki/Darth_Maul_(2017)_3",
  "/wiki/Darth_Maul_(2017)_4",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/The_Gungan_General",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Bounty_Hunters_(episode)",
  "/wiki/Lethal_Trackdown",
  "/wiki/Assassin_(episode)",
  "/wiki/Tipping_Points",
  "/wiki/A_Test_of_Strength",
  "/wiki/Bound_for_Rescue",
  "/wiki/A_Necessary_Bond",
  "/wiki/Revival_(episode)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_159",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Triplecross",
  "/wiki/Star_Wars:_Forces_of_Destiny:_Volume_4",
  "/wiki/Brothers_of_the_Broken_Horn",
  "/wiki/Legends_of_the_Lasat",
  "/wiki/Star_Wars_Rebels:_Strike_Missions",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Endangered,_Part_1",
  "/wiki/Star_Wars_Adventures_(2017)_7",
  "/wiki/Endangered,_Part_2",
  "/wiki/Star_Wars_Adventures_(2017)_8",
  "/wiki/Star_Wars_Rebels:_Steps_Into_Shadow",
  "/wiki/Imperial_Supercommandos",
  "/wiki/The_Wynkahthu_Job",
  "/wiki/The_Occupation",
  "/wiki/A_Fool%27s_Hope",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Star_Wars:_Commander",
  "/wiki/Bounty_Hunters_10",
  "/wiki/The_Crimson_Corsair_and_the_Lost_Treasure_of_Count_Dooku",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_The_Crimson_Corsair_and_the_Crime_Lords_of_the_Barren_Rim",
  "/wiki/Star_Wars_Adventures_(2020)_7",
  "/wiki/Lando%27s_Luck",
  "/wiki/Lando%27s_Luck_(audiobook)",
  "/wiki/Flight_of_the_Falcon,_Part_5:_Grand_Theft_Falcon",
  "/wiki/Star_Wars_Adventures_(2017)_18",
  "/wiki/Pirate%27s_Price_(audiobook)",
  "/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
  "/wiki/Galaxy%27s_Edge_5",
  "/wiki/A_Crash_of_Fate_(audiobook)",
  "/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge_%E2%80%93_Last_Call",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Millennium_Falcon_-_Smugglers_Run",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/Star_Wars:_Galactic_Starcruiser",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/The_Sims_4_Star_Wars:_Journey_to_Batuu",
  "/wiki/Category:Audio_files_of_Hondo_Ohnaka",
  "/wiki/Category:Images_of_Hondo_Ohnaka",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Insider_Looks_Back",
  "/wiki/Star_Wars_Insider_150",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_69",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_72",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Hammerhead_Corvettes_Expansion_Pack",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Star_Wars_Helmet_Collection_49",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Millennium_Falcon:_A_3D_Owner%27s_Guide",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_11",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_43",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Book_of_Lists",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Jango_Fett%27s_Slave_I_Expansion_Pack",
  "/wiki/Fugitives_and_Collaborators_Squadron_Pack",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Unsung_Heroes",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Heroes_of_Rogue_One",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Tobias_Beckett_and_Other_Characters_From_the_Underworld",
  "/wiki/StarWarsKids.com",
  "/wiki/Protocol_and_Service_Droids",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Star_Wars:_The_Secrets_of_the_Bounty_Hunters",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_89",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Darth_Maul_(2017)_5",
  "/wiki/Dark_Disciple",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Allegiance_4",
  "/wiki/File:Hondo_Name_Origin.png",
  "/wiki/February_27",
  "/wiki/2019",
  "/wiki/February_28",
  "/wiki/November_23",
  "/wiki/File:NairneTweet06072019.png",
  "/wiki/December_11",
  "/wiki/August_29",
  "/wiki/December_2"
 ]
}