{
 "name": "Hong",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 BBY",
      "AX-456"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireStormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "Hong was a male Imperial stormtrooper Sergeant major assigned aboard the Star Destroyer Imperator as of 1 BBY. He was killed at the Battle of AX-456.\nHong was experienced with Cadets, and knew that almost everyone were too proud to ask for his advice. He witnessed several Omega Exercises where cadets served as Cadet Leaders, and could notice the nervousness during their task. Many of them were against Rebels, and knew that, despite what Imperial propaganda was saying, they did give a hard fight.\nDuring Cadet Leader Kyle Katarn's Omega Exercise on AX-456, Sergeant major Hong served as second officer to the platoon and Katarn knew that his report and opinion would count for his evaluation.\nExpecting bullying and sarcastic comments, Katarn kept his distance from Hong, hiding his stress and fear; Hong in turn tried to encourage him and reminded him that he would succeed if he follows the rules, and complimented him for loading his weapon like a veteran. He appreciated Katarn's rational approach to the military operation, but disapproved of his reluctance to execute Rebel prisoners of war.\nHong executed Katarn's commands and ordered Morley to break the entrance to the base. Once they secured the two airlocks, he killed a Rebel equipped with a vibroaxe. While regrouping, Hong advised the Leader to call for reinforcements before pressing on.\nHe led the charge that secured the next room and fifty feet of passageway where they encountered more oposition. Once they secured the corridor, he ordered the remaining platoon to scavenge for power paks and make a makeshift wall of droid parts before blowing the door at the end. Another fight ensued behind the door, and the Rebel presence was all but eliminated when Katarn ordered to stop firing, surprising Hong. Katarn hid his unwillingness to commit a massacre, saying that they don't need to waste their ammo on Rebels who surrendered.\nThe two-thirds of the original platoon that survived looked for the communications room, and Hong reprimanded Dendu for wasting ammo in his attempt to shoot a maintenance droid. In the control room Hong noticed on a monitor that a ship with reinforcements arrived, and suggested to kill everyone and escape while they had time, which Katarn objected, further surprising Hong. He complied, under protest, and ordered Jonsey and Haku to pull the memory modules and set explosive charges.\nHong and the rest were barricated in the cafeteria waiting to be rescued by reinforcements; they didn't expect that the Rebels would drill into the wall; Hong was killed once Rebels poured from the drilled hole.\nHong was small in body but had a strong voice. He had short hair and a moustache—a rarity among stormtroopers of his time.\nHong was supportive and encouraging to Cadet Leader Katarn and expressed his compliments when he was doing things right. He disagreed with the hesitation and reluctance of his men towards handling rebels. The man expressed such to Kyle Katarn and trooper Briggs in 1 BBY.\nIn the audio adaptation of Dark Forces: Soldier for the Empire, he was voiced by James Cada.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Hong",
  "/wiki/1_BBY/Legends",
  "/wiki/AX-456",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Sergeant_major/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Briggs_(stormtrooper)",
  "/wiki/Battle_of_AX-456",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Imperator_(Imperial-class)",
  "/wiki/Omega_Exercise",
  "/wiki/Cadet_Leader",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Executive_officer/Legends",
  "/wiki/Platoon/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Morley",
  "/wiki/Airlock/Legends",
  "/wiki/Vibro-ax/Legends",
  "/wiki/Blaster_power_pack/Legends",
  "/wiki/Dendu",
  "/wiki/Maintenance_droid",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Jonsey",
  "/wiki/Haku",
  "/wiki/Memory_module",
  "/wiki/Storm_commando",
  "/wiki/Time/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire_audio_drama",
  "/wiki/Category:Audio_files_of_Hong",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}