{
 "name": "Honnah",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "By 3 ABY",
      "Heva"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gamorrean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Beilert Valance's crew"
     ]
    }
   ]
  }
 ],
 "content": "Honnah was a Gamorrean female tracker who worked with the bounty hunter Beilert Valance in hunting down Darth Vader during the Imperial Era. Upon returning to her home in Fuacha, she discovered that her family had been slain by the Empire, earning her resentment for the regime. Prior to working with Valance, Honnah was considered the best tracker in the bounty hunting business. While on Heva, she was involved in a skirmish with Vader. Honnah managed to fend him off for a brief period of time, but was eventually killed by the Sith Lord.\nHonnah was Gamorrean female who, upon returning to Fuacha, discovered that her home was ravaged and her family had been slaughtered by the Empire. Honnah detested the Empire after the event.\nShe later became a tracker and hunted down the criminal Betah Bohden, killing him and all his guards single-handedly, and cementing her reputation as one of the best trackers in the bounty hunting business.\nHonnah's reputation caught the attention of the Hidden Hand criminal syndicate, and she was recruited by their messenger Gwi on a mission to hunt down Darth Vader. While recruiting the cyborg Beilert Valance, Gwi described Honnah as a ruthless fighter, speculating that she may have eaten Bohden's remains. The team she joined included Valance, the slicer Chio Fain, the bounty hunter Dengar, the droid Arr-Nine-Nineteen, and the sniper Urrr'k. However, Valance immediately destroyed Arr-Nine-Nineteen upon seeing him, revealing that the droid was a spy for the Hutt Clan. After the team finally assembled, they embarked on their mission to track down Vader on Valance's starship, the Broken Wing.\nHonnah and her team journeyed to the planet Arvina, where Valance shot down a number of TIE fighters on the way. Dengar was concerned that they may have attracted the Empire's attention and asked Honnah about her opinion. She remarked that the plan was insane, but Fain assured her that they would at least they would die doing what they loved. Upon arriving at the planet, Urrr'k stayed behind while Honnah and the rest of the team visited Fetya's Hollow, where Valance requested a number of weapons from Fetya. While in the building, Dengar asked the Gamorrean what Fain was doing, to which she replied they had a plan. He suggested that she should eat Fain if the plan goes sideways. However, Fetya turned on Valance and her team with her fellow criminals. The Empire suddenly arrived at Arvina after tracking Valance's amplified signal, allowing Honnah and her team to escape the planet.\nThe team's next destination was the Hidden Hand outpost on Heva, where they contacted the arms dealer Wef. Dengar and Honnah spoke with Wef while the others stayed behind and prepared their equipment. Honnah asked the Melbu about what information he could provide on the criminal syndicate, but they were unable to understand her. Dengar then reiterated her question in Basic. When the Empire arrived, Honnah and Dengar quickly positioned themselves on a cliffside and awaited Valance's orders. She witnessed the destruction of the Imperial II-class Star Destroyer Formidable, stating that she made her own luck. After Broken Wing crashed, the two then took aim at Vader.\nWhile waiting for Valance's signal, Fain suddenly rushed towards Vader. The Sith Lord deflected his blaster shots, knocking the rest of the team off balance. As Vader cut Fain's arms off, Honnah charged at Vader. Vader suddenly choked Fain and pushed him into the blade of Honnah's battle-ax, fatally wounding and killing him. As Valance dashed towards him with an electro-pulse, Vader sliced Honnah in half, killing her but giving the cyborg enough time to activate the device. He missed, however, and was immediately betrayed by Dengar, whose real client was the Empire. Valance was captured and interrogated, but Vader ultimately left him alive and invited him back to the Empire.\nHonnah has green skin, black hair and brown eyes. When Gwi introduced Honnah to Valance, he speculated that the Gamorrean may have eaten the remains of one of her targets due to her nature. She strongly resented the Empire after they had destroyed her home. She was fearless in the face of danger, hunting down and eliminating her targets with no hesitation. When facing down Vader, Honnah fought to her last breath.\nHonnah skills earned her the reputation as one of the best trackers in the business. While fighting Vader, she displayed her skills with her ax, managing to hold off the Sith Lord for a brief period of time. However, he ultimately overpowered and killed her.\nThroughout her entire career, Honnah mostly utilized a Gamorrean battle-ax. When Valance and his team prepared to attack Vader, she used a blaster rifle.\nHonnah made her debut in the first issue of the 2019 comic book series Star Wars: Target Vader, written by Robbie Thompson.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/3_ABY",
  "/wiki/Heva",
  "/wiki/Gamorrean",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Beilert_Valance%27s_crew",
  "/wiki/Bounty_hunter",
  "/wiki/Beilert_Valance",
  "/wiki/Hunting",
  "/wiki/Hunt_for_Vader",
  "/wiki/Anakin_Skywalker",
  "/wiki/Imperial_Era",
  "/wiki/Fuacha",
  "/wiki/Galactic_Empire",
  "/wiki/Sith_Lord",
  "/wiki/Death",
  "/wiki/Betah_Bohden",
  "/wiki/Hidden_Hand",
  "/wiki/Gwi",
  "/wiki/Cyborg",
  "/wiki/Slicer",
  "/wiki/Chio_Fain",
  "/wiki/Dengar",
  "/wiki/Droid",
  "/wiki/Arr-Nine-Nineteen",
  "/wiki/Sniper",
  "/wiki/Gita",
  "/wiki/Hutt_Clan",
  "/wiki/Starship",
  "/wiki/Broken_Wing",
  "/wiki/Planet",
  "/wiki/Arvina",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Fetya%27s_Hollow",
  "/wiki/Fetya",
  "/wiki/Heva_Hidden_Hand_outpost",
  "/wiki/Arms_dealer",
  "/wiki/Wef",
  "/wiki/Melbu",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Formidable",
  "/wiki/Blaster_pistol",
  "/wiki/Force_choke",
  "/wiki/Gamorrean_battle-ax",
  "/wiki/Electro-pulse",
  "/wiki/Torture",
  "/wiki/Blaster_rifle",
  "/wiki/Target_Vader_1",
  "/wiki/2019",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Target_Vader",
  "/wiki/Robbie_Thompson",
  "/wiki/Target_Vader_2",
  "/wiki/Target_Vader_3",
  "/wiki/Target_Vader_4",
  "/wiki/Target_Vader_5",
  "/wiki/Target_Vader_6",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Empire_Ascendant_1",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year"
 ]
}