{
 "name": "Honna",
 "display_name": "Honna",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarasin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Honna was a Tarasin female Force-sensitive slave.\nIn around 20 BBY, as a child, she was captured along with three fellow Tarasin children, Li'Iri, Tiscak and Kaj, due to their innate Force-sensitivity. Their captor, Chevin slaver Phylus Mon, jailed them in a cell in his slave zoo onboard the Animiasma. He also flogged all of the children with his three-tailed barbed whip.\nTheir disappearance did not go unnoticed: Jedi Master Lanius Qel-Bertuk knew of the kidnappings, and even suspected Phylus Mon, but still could do nothing to rescue them.\nThe children were kept in the cell, the only Force-sensitives in the zoo. They instinctively disliked fellow prisoner Halin Bok. Honna also managed to communicate with the Mantellian Savrips in another cell, Clu, Taf and Mev. The Savrip promised to go through the energy bars to rescue the children should anyone try to take them against their will. Honna was scared of that, because the energy bars could easily kill the Savrips should they ever try that.\nPhylus Mon surgically inserted an explosive near the heart of each of his slaves. The explosive would be activated in the case of Phylus Mon's death, but it could also be deactivated with the impact of an ion weapon. All the slaves in Phylus Mon's zoo were also regularly battered.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tarasin",
  "/wiki/Gender/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Li%27Iri",
  "/wiki/Tiscak",
  "/wiki/Kaj_(Tarasin)",
  "/wiki/Chevin/Legends",
  "/wiki/Phylus_Mon",
  "/wiki/Animiasma",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/Bin_Kohal",
  "/wiki/Mantellian_Savrip/Legends",
  "/wiki/Clu",
  "/wiki/Taf",
  "/wiki/Mev_(Savrip)",
  "/wiki/Heart/Legends",
  "/wiki/Death/Legends",
  "/wiki/Ion_blaster/Legends",
  "/wiki/A_Mon_Alone",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Night%27s_Homecoming"
 ]
}