{
 "name": "Horell",
 "display_name": "Horell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Czerka Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Horell, nicknamed The Black Death by the inhabitants of Nal Hutta, was a male Human who worked for the Czerka Corporation during the Cold War between the Galactic Republic and resurgent Sith Empire. In 3643 BBY, he held the job of senior administrator within the company and took a vacation to the planet Hutta. On Hutta, he began hunting the native Evocii species for sport, earning himself his nickname among the Evocii due to the color of his hunting gear. A Twi'lek named Var'soonta, who traded salvage to the Evocii, asked an Imperial-aligned individual to persuade Horell to stop killing his customers, and the individual found the Black Death's speeder and destroyed several of his droids. When the hunter confronted the individual, however, he was able to bribe them to leave him alone.\nHorell was a male Human senior administrator of Czerka Corporation who lived during the Cold War between the Galactic Republic and the resurgent Sith Empire. During the war, in 3643 BBY, he took a vacation to the planet Nal Hutta, the adopted homeworld of Hutt species. On Hutta, he began hunting the native Evocii species for sport, earning himself the name \"Black Death\" among his prey due to the black hunting gear he wore. He hunted in the swamps close to an Evocii work camp near Jiguuna, an industrial town controlled by a Hutt crime lord named Suudaa Nem'ro. Whilst hunting, the administrator traveled in a speeder with a number of hunting droids, whom he left to guard his speeder whilst he hunted. Initially, the Black Death only hunted rebellious Evocii, but soon turned to killing any he could find, including those from the work camp. From each Evocii he killed, he took their ears and teeth as trophies.\nA Twi'lek salvage dealer called Var'soonta, who ran a store in the work camp, offered to pay an Imperial-aligned individual visiting the shop to persuade the Black Death to stop killing Evocii, as it was bad for his business. The individual found the hunter's speeder and destroyed at least six of his droids, drawing his attention. The Black Death rushed to the speeder to stop the individual from destroying any more of his property. Outraged, he demanded to know what the individual wanted and when they claimed to be there to stop him killing Evocii, he refused to believe them, claiming no one cared enough about the Evocii to do so. He then offered to pay the individual to leave him alone so he could continue to hunt, which the individual accepted. The administrator paid the individual 122 credits as well as a Nal Hutta commendation and some gear, after which the individual left and the hunter returned to hunting.\nThe Black Death considered the Evocii he hunted to be equivalent to non-sentient species such as Akk dogs, which could also be found in Nal Hutta's swamps. Due to this, he had no moral issue with hunting them and did not believe that any other being could possibly have one either. He was greatly angered by the destruction of his property, but chose to pay those responsible to leave him alone rather than attack them. He was reasonably cowardly and, if threatened with physical violence, was quick to surrender. He also held great respect and fear for Nem'ro the Hutt. The Black Death had pale skin, black hair and green eyes.\nThe Black Death owned a number of hunting droids, which he took with him whilst he hunted, to guard a speeder he owned and used for transport in the swamps of Hutta. Whilst hunting, he wore black and yellow hunting gear and carried a Blaster rifle on his back.\nThe Black Death first appeared in the video game Star Wars: The Old Republic released by BioWare in 2011. He appears on the planet Nal Hutta, the starting planet for players of the Bounty Hunter and Imperial Agent classes, where he is involved in the quest \"Trophy Hunter\", in which player is asked to stop him from hunting Evocii. The player has the \"dark side\" option of accepting credits to leave the hunter alone, or the \"light side\" option of refusing his money. If they choose the \"light side\" option, they are given another choice, to kill him as a \"dark side\" option or to tell him Nem'ro is angry with him, causing him to flee the planet, as a \"light side\" option. This article assumes the player chose the first \"dark side\" option, as only players of the Bounty Hunter and Imperial Agent class can take this quest and both are Imperials, assumed to have full \"dark side\" alignment.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Black_Death",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/3643_BBY",
  "/wiki/Planet/Legends",
  "/wiki/Evocii",
  "/wiki/Species/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Var%27soonta",
  "/wiki/Homeworld/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Voam",
  "/wiki/Jiguuna",
  "/wiki/Crime_lord/Legends",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Speeder/Legends",
  "/wiki/Ear/Legends",
  "/wiki/Tooth/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sentience/Legends",
  "/wiki/Akk_dog/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Imperial_Agent",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}