{
 "name": "Horliss-Horliss",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bedlam Spirits"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple and pink"
     ]
    }
   ]
  }
 ],
 "content": "Horliss-Horliss was one of the four Bedlam Spirits, transdimensional beings that resided in the Bedlam Pulsar and appeared to have completely omnipotent powers over time and matter. Horliss-Horliss frequently argued with its fellow Spirits, especially Tilotny, but joined them in occasional experiments on the planet Bedlam. In one such experiment Horliss-Horliss killed Rebel leader Leia Organa by turning her heart to diamond, only for Organa to be restored to life soon after when the Spirit lost interest.\nHorliss-Horliss was one of four omnipotent, transdimensional beings known as the Bedlam Spirits, along with Tilotny, Cold Danda Sine and Splendid Ap. Most commonly encountered in the Bedlam Pulsar, the Spirits were said to reside in the \"whiteness\" within the fabric of hyperspace, and from time to time alighted upon the rocky planet Bedlam during their endless experiments upon the fabric of space-time and the nature of matter itself. On one visit to Bedlam during the Galactic Civil War, the four Bedlam Spirits happened upon a group of Imperial stormtroopers chasing after Rebel leader Leia Organa, who had been stranded on the world.\nBemused and intrigued by the \"tiny movers,\" the Bedlam Spirits began to experiment upon the organics—Horliss-Horliss, after discovering that Organa was kept alive by \"soft things\" within her body, killed Organa by turning her heart into a diamond. The Spirits lost interest soon afterward, and set Splendid Ap to restoring the organics to their previous state, although Splendid Ap mistakenly sent the stormtroopers 8,000 years back in time. Some knowledge of Horliss-Horliss and its fellow Spirits' existence filtered out in the wider galaxy in the decades to come, as visitors to Bedlam discovered impossibly transmuted materials and objects thrown wildly through time.\nAppearing as a shifting, wispy blob of purple and pink, Horliss-Horliss often argued with Tilotny, regarding its fellow Bedlam Spirit as shallow and jealous—in turn Tilotny derided Horliss-Horliss, while admitting that the being was clever. Horliss-Horliss was adept at a practice called \"metastyling,\" which was considered advanced by its fellow Bedlam Spirits, along with a number of other powers over matter, time, and life and death itself. Horliss-Horliss was intrigued by shape and substance, but quickly became bored with it soon after beginning experiments.\nHorliss-Horliss appeared in Tilotny Throws a Shape, a short comic story written by Alan Moore and illustrated by John Stokes, and originally appearing in The Empire Strikes Back Monthly 154 in the United Kingdom.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bedlam_Spirits",
  "/wiki/Color/Legends",
  "/wiki/Bedlam_Pulsar",
  "/wiki/Tilotny",
  "/wiki/Planet/Legends",
  "/wiki/Bedlam/Legends",
  "/wiki/Death/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Heart/Legends",
  "/wiki/Diamond/Legends",
  "/wiki/Cold_Danda_Sine",
  "/wiki/Splendid_Ap",
  "/wiki/Hyperspace/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Tilotny_Throws_a_Shape",
  "/wiki/Alan_Moore",
  "/wiki/John_Stokes",
  "/wiki/The_Empire_Strikes_Back_Monthly_154",
  "/wiki/The_Essential_Atlas"
 ]
}