{
 "name": "Horns",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Law's Squad",
      "Grand Army of the Republic",
      "Law's Squad",
      "Law's Squad"
     ]
    }
   ]
  }
 ],
 "content": "Horns was a clone trooper who participated in the Skirmish on Draay 2 under Jedi General B'ink Utrila. He wore the symbol of the Death Watch on his helmet.\nHorns was a clone trooper—a Human male cloned from the bounty hunter Jango Fett. Horns wore purple markings of the symbol of the Death Watch on his helmet. During the Clone Wars between the Galactic Republic and Confederacy of Independent Systems, Horns worked with fellow troopers Lieutenant Law, Cannon, and Glitch.\nHe participated in a mission to Draay 2 to locate the Gauntlet of Kressh the Younger under the command of Jedi B'ink Utrila and Padawan Rennax Omani. They found the Gauntlet but it was protected by Sarls. They made camp, and in the night were attacked by the Death Watch. Pre Vizsla was seeking to claim the Gauntlet for himself. Vizsla captured Padawan Omani, and forced the clone troopers to stand down. The Mandalorian saw Horns' symbol and subjected him to a test to join the Death Watch: execute Utrila. Horns refused and was about to be executed himself when Glitch ignited a lightsaber in his possession. Glitch briefly dueled Vizsla, then triggered the collapse of the Temple. The Jedi, troopers, and Mandalorians escaped, and Horns shot one of the Death Watch's jetpacks, forcing the being to crash into the canyon and Vizsla to order a withdrawal.\nHorns wore the symbol of the Death Watch on his Phase II clone trooper armor as he considered himself one of the deadliest clones of a great Mandalorian warrior, and the Death Watch were the most dangerous warriors in the galaxy. During the mission to the Temple, he attempted to demonstrate why he wore the marks when he charged the guardian droid, but was knocked away. When offered the chance to join the Death Watch, he refused to murder his Jedi General. Following their escape, he discarded his helmet, and joined in the remembrance of trooper Glitch.\nPre Vizsla, leader of the Death Watch, considered his behavior just another imitation.\nHorns appears in the 2012 comic, The Clone Wars: Defenders of the Lost Temple.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Law%27s_Squad",
  "/wiki/Jedi_General/Legends",
  "/wiki/B%27ink_Utrila",
  "/wiki/Death_Watch/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Color/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Law",
  "/wiki/Cannon_(clone_trooper)",
  "/wiki/Glitch",
  "/wiki/Draay_2",
  "/wiki/Gauntlet_of_Kressh_the_Younger",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Rennax_Omani",
  "/wiki/Sarl",
  "/wiki/Pre_Vizsla/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Phase_II_clone_trooper_armor/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/2012",
  "/wiki/The_Clone_Wars:_Defenders_of_the_Lost_Temple",
  "/wiki/Databank_(original)"
 ]
}