{
 "name": "Horst",
 "display_name": "Horst",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY; Trid",
      "Danuta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Major Horst was a Human male officer of the Galactic Empire who was stationed on the Mid Rim planet of Danuta. During the year 0 BBY, Horst commanded a patrol skiff that would circle the area surrounding the Danuta research facility that contained technical data for an Imperial superweapon known as the DS-1 Orbital Battle Station, or as it later came to be known, the Death Star. While he was the officer-of-the-day, the facility was raided by the mercenary Kyle Katarn, hired by the Alliance to Restore the Republic to steal the Death Star data. Horst was alerted to some explosion and attempted to eliminate the rebel threat, only to have his command car shot down and destroyed.\nA Human male, Horst joined the military ranks of the Galactic Empire sometime before 0 BBY. Eventually, Horst became an officer, attaining the rank of Major. Horst was assigned to the Mid Rim planet of Danuta at some point. The facility he protected, located in the capital city of Trid, contained the technical data for an Imperial superweapon known as the DS-1 Orbital Battle Station, or as it later came to be known, the Death Star. As a part of his assignment he would command a skiff to patrol the perimeter of the facility.\nAs the Empire tightened its grip on the galaxy, a band of freedom fighters known as the Alliance to Restore the Republic instituted Operation Skyhook, a mission that would see the retrieval of the Death Star plans, so that they could be analyzed for a weakness in the space stations structure. The Alliance eventually hired the mercenary Kyle Katarn, along with with rebel agent Jan Ors, to invade the Danuta facility. Katarn also managed to persuade an old friend and Imperial officer Meck Odom to aid in the mission as well.\nOne night that Major Horst was officer-of-the-day, Katarn eventually alerted the base to his presence. Major Horst had been assured by an officer  that he would intercept the rebel.\nMeanwhile, the security was disturbed by some minor explosion at the northern side of the perimeter, which was actually a makeshift bomb planted earlier by Jan Ors in order to create a diversion, and was enough to trigger some alarms. Horst assumed the issue was nothing more than a breach in the perimeter, but yearning for action against Rebels, Horst eagerly went to the task, along with the AT-ST that was on duty, and two squads of Imperial commandoes. In his command car, he sighted Ors' ship, the Moldy Crow, which intercepted the walker after a brief exchange of fire, before falling on the other car. It was too late when a shocked Horst ordered a retreat as his car was also shot down. The eager officer perished in the resulting explosion. Katarn ultimately stole the Death Star plans, and eventually a weakness was exposed, allowing the rebels to destroy the Death Star.\nHorst likened his charisma and abilities to that of a wolf, and after long working ours of nothing but patrol work, he was genuinely excited to see finally see some action. However, Horst underestimated his opposition due to a lack of intel, and was not prepared to go one-on-one with a starship, which led to his death.\nHorst first appeared in the novella Dark Forces: Soldier for the Empire as a minor character. Horst later received an entry in The Complete Star Wars Encyclopedia. However, the Dark Forces: Soldier for the Empire audio drama had a character named Horst who was completely different than the character described in the novella: a Major in charge of the night shift, who holds the Keycard, whom Katarn confronts to steal the key.\nThis article assumes that the Danuta facility had two wholly different individuals named Horst.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Horst_(Keycard)",
  "/wiki/0_BBY/Legends",
  "/wiki/Trid",
  "/wiki/Danuta",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Major/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Skiff/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Danuta_research_facility",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Operation_Skyhook",
  "/wiki/Mercenary/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Jan_Ors",
  "/wiki/Mission_to_Danuta",
  "/wiki/Meck_Odom",
  "/wiki/Squad/Legends",
  "/wiki/Imperial_commando",
  "/wiki/Moldy_Crow/Legends",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Wolf/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire_audio_drama",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Star_Wars:_Dark_Forces",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope"
 ]
}