{
 "name": "Hoth  (Jedi Lord)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kaal"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1000 BBY",
      "Ruusan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black/gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Army of Light",
      "Army of Light",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Johun Othone",
      "Dree Vandap",
      "Tal"
     ]
    }
   ]
  }
 ],
 "content": "Lord Hoth, born Rohlan, was a male Human and a famous Jedi Master and Lord who led the Army of Light against Lord Skere Kaan's Brotherhood of Darkness during the New Sith Wars until their final confrontation in the Ruusan campaign. Having joined the Jedi Order with a dream of single-handedly ending the Sith threat against the Galactic Republic, Hoth trained several students and rose to become the Coruscant Jedi Temple's battlemaster and the Supreme Commander of the Republic Military, building his army from whatever resources were available, including the recruitment of Force-sensitive children. Hoth fought Kaan and his forces across the galaxy, ultimately assaulting the Sith Lord's stronghold on the planet Ruusan.\nAided by his friend Pernicar and fellow Jedi Lord Valenthyne Farfalla, Hoth prosecuted the campaign against Kaan, facing challenges of low supplies, dwindling morale, and harsh conditions. Hoth's temper was as legendary as his battle prowess, and, after the death of Pernicar, a feud between Hoth and Farfalla almost delivered victory to Kaan. Despite their animosity, the pair reconciled, allowing Hoth to face his foe in a final confrontation. Knowing that the desperate Sith would utilize a dangerous Force power known as the thought bomb in an attempt to stave off defeat, Hoth went to face him anyway, forcing the Brotherhood of Darkness to destroy themselves in the process. Hoth's act of self-sacrifice saved the Republic and ended the Sith as a galactic threat for almost a thousand years.\nBorn on the planet Kaal during the Republic Dark Age, the Human male Rohlan was born into a respected lineage of Jedi Lords who stood sentinel over the Yushan sector. In his youth, Rohlan believed he had the power to end the Sith threat to the Galactic Republic single-handedly and make the galaxy a better place. To fulfill this dream he followed in his family's footsteps and joined the Jedi Order, constructing a blue-bladed lightsaber. During his teenage years, Rohlan became known as the Knight of Hoth, freeing the Corellian Trade Spine from Sith pirates during a showdown on the ice world Hoth. Once the Republic moved to ensure that the Trade Spine would not fall, Hoth traveled to Coruscant and received the title of Jedi Master and was nominated to be the Jedi Temple's battlemaster. While Hoth was greatly respected by his students, which included Initiates such as Dree Vandap, Tal, and Johun Othone, whom he selected as his Padawan, stories of Hoth's successes against the Sith were told in whispers around the Temple and kept quiet by the Jedi High Council.\nWhen the High Council attempted to raise Jedi Master Skere Kaan to prominence as the scourge of the Sith, the Order was dealt a serious blow when their protégé defected and founded the Brotherhood of Darkness. Realizing the failure of the Jedi High Council, Hoth left the Temple with a contingent of loyal Jedi Knights and rallied the banners of the Jedi Grand Council, mustering the support of all reigning Jedi Lords and massive forces from allies from the Javin Marches, Cularin, Corellia, and Kamparas. Together, Hoth's massive force attacked Kaan's Brotherhood under the banner of the Army of Light, a Jedi-led militia of Republic forces and loyal vassals. Strapped for resources and soldiers, Hoth gathered the ships and weapons of those Lords loyal to him, overseeing the conversion of freighters into warships and the recruitment of any Force-sensitive Republic citizens, including children, to augment the ranks of the rapidly dying Jedi and avoid their recruitment into the Sith Brotherhood.\nThough made in desperation and ill-equipped with nothing but the resources available to the participating Jedi Lords, the Army of Light under Lord Hoth saw resounding success, albeit at a heavy cost. Along with other Republic champions like Kiel Charny and Valenthyne Farfalla, Hoth drove the Brotherhood from the Cloak of the Sith and countless other worlds, including the planet which was his namesake, Dromund Kaas, and Malrev IV. This initial period of victory, however, eventually gave out. The Army of Light was outnumbered by the Brotherhood, and the Sith mounted their own offensive, taking key Republic planets and driving into the Core Worlds.\nHoth's response was to unify the Republic's dispersed forces, augmenting the Army of Light. Serving as a General for the Republic, Hoth won over half a dozen victories, became a HoloNet star, and, by 1003 BBY, had been made commander of the Republic Military. As they were still outnumbered, he shifted his strategy away from fighting massive armies and navies towards targeting the Sith themselves, particularly their leaders, the Dark Lords. To this end he focused many of his Jedi on an assault on the Sith-held world of Ruusan, hoping to draw Kaan's armies away from the Core. Kaan chose to take his Sith instead, intending to eradicate the Jedi in one blow.\nThe first three battles had been fought in space and had been quick and decisive. But the increased importance of Ruusan to both sides turned the conflict into a bloody stalemate of a ground war that ravaged the surface of the world. Hoth would spend the last two years of his life fighting for the planet.\nAs the strength of both sides dwindled, Hoth looked for ways to augment his diminishing Jedi forces. Not all Jedi had answered the call to come to Ruusan, believing Hoth had made the war into a personal vendetta and was only prolonging it, or simply choosing to support the Republic on other worlds, and now he sought their aid. Valenthyne Farfalla, whom Hoth had always disliked, volunteered to seek out those Jedi and ask for their help, believing that their refusal was in part due to Hoth's bluntness and that they would respond to his form of diplomacy and persuasion better. He left Ruusan, vowing to return with three hundred Jedi Knights. To preserve what strength he had until Farfalla returned, Hoth changed tactics from open combat to guerrilla warfare, using the planet's rainy season and its vast expanses of forest as cover.\nHoth had fought the Sith doggedly, but the death of his close friend Pernicar in a Sith attack shook his resolute manner for a time. The arrival of Farfalla shortly after the attack, too late to save his friend, drove a further wedge between the two Jedi. Sith tactics, too, had grown more ruthless with the arrival of the aggressive Sith Lord Darth Bane. The Dark Lords sent a decoy force to attack the Army of Light and then, using the dark side of the Force, summoned a massive wave of destruction that burnt the forests of Ruusan, slaughtering many. Only the timely arrival of Farfalla's reinforcements breaking through the Sith blockade saved them.\nBeaten down by the never-ending stalemate, the miserable conditions, dwindling troop morale, and the deaths of so many, Hoth began to seriously consider abandoning Ruusan to the Sith, though he knew that this would be a betrayal of all he stood for. The Jedi Master faced an impossible choice. During this crisis of faith, Pernicar appeared to him in a dream. Hoth asked for the advice of his old friend, as Pernicar had often given him while alive, and Pernicar told him to trust in the Force, to not give in to despair, and to mend the situation with Farfalla. After awaking, Hoth sent an apology to Farfalla through an envoy, and the two combined their forces to drive back the Sith. The Jedi at last had the advantage, and with Kaan fleeing into the hills and caves and the Army of Light's morale on the rise, Hoth decided to press forward and launch an assault on Kaan's base camp.\nThough he was prepared to do battle, Hoth wanted Kaan to surrender to spare them all from further bloodshed on both sides. Preparation for the final battle was not entirely hopeful. Hoth and Farfalla suspected a trap on the part of the Sith, and the Jedi Tal had a premonition of disaster. Still, the general saw no other choice and opted to press forward.\nHoth and Farfalla began their attack in the morning. Farfalla led the way, while Hoth brought up the rear. With the Dark Lords summoned by Kaan to the caves to prepare a thought bomb, a devastating burst of Force energy that would eradicate life within its range, the battle was over by the time Hoth's forces arrived, with most of the Sith taken prisoner alive and almost no casualties to the Army of Light. Hoth made his way towards Kaan's encampment but was stopped by Farfalla, who warned him of the thought bomb. Hoth, however, had already sensed it and knew that he had to stop Kaan from using it to cause even more destruction by either forcing him to detonate it on Ruusan or convincing him to surrender.\nHe and the Army entered the canyon where the mouth of the caves lay, past poles carrying the bodies and severed heads of the Jedi who had died in the previous battles. Leaving Farfalla and the bulk of the army outside the caverns and ordering them to get as far from the blast site as possible, he took one hundred Jedi, all volunteers, with him. Together they headed down the tunnels to Kaan's chamber, where he and the Dark Lords waited, the power of the thought bomb filling the air around them. Kaan greeted Hoth, and Hoth responded that the Sith Lord could not frighten him with the prospect of death. Seeing the madness that had come upon the man, Hoth then knew that Kaan would not surrender, and made a lunge at him, attempting to kill him before he could set off the thought bomb. He was too late, however, and with a clap of his hands, Kaan released the power of the dark side of the Force. Lord Hoth and all the Jedi with him were killed. Their spirits remained trapped within the caverns by the power of the thought bomb and would not be freed until Jedi Knight Kyle Katarn came to Ruusan over 1,000 years later.\nAfter Hoth's death, his former Padawan, Johun Othone, petitioned the Jedi and Republic to construct a memorial to the Army of Light on Ruusan. The Jedi turned down his request, wanting to let the tragedy be forgotten, but the Senate chose to honor it. Othone had a mausoleum constructed in what had become known as the Valley of the Jedi. A statue of Hoth was carved in the Valley, towering above those of the many other members of the Army. When Kyle Katarn visited this site one year after the Battle of Endor, he received a vision from the spirit of Tal, in which he saw Lord Hoth from Tal's perspective on the day of the last battle. Hoth was also honored with the central star of the Ruusan system receiving the name Hoth's Brand.\nAs a young man, Hoth was a dreamer who saw only resounding victory in his mind. He believed that he could single-handedly end the threat that the Sith posed to the galaxy, and he accordingly joined the Jedi Order and rose to the rank of Master. After winning several victories for the Republic during the New Sith Wars, Hoth became hardened against the galaxy. By the time of the final Battle of Ruusan, the once-idealistic youth had become a cynical and haggard veteran. His closest friend and main advisor was fellow veteran Pernicar.\nHoth was a very able military commander, having led Republic forces to a number of victories over the Sith. The ragtag Army of Light which he hastily raised was able to drive the Sith away from many planets, despite being ill-equipped and including children among its ranks. After unifying the Republic's dispersed forces, he believed that concentrating assaults on the Sith Lords themselves, rather than their armies, would draw the armies away from the Core.\nThough a leader of a mighty army, Hoth was a man devoted to peace. He was said to be a wily and stalwart general and a master of strategy, and was seen as a hero by the Republic. In the latter stages of the New Sith Wars, his exploits were widely known, even in isolated colonies in the Outer Rim Territories. However, as the war dragged on, Hoth became more and more consumed by his anger, and his inability to control his emotions nearly doomed the entire Jedi campaign.\nHoth clashed continually with his contemporary Lord Farfalla, whose foppish nature was the direct opposite of Hoth's own pragmatism. Unlike the charismatic Farfalla, Hoth had little time for diplomacy, and his blunt nature often brought him into conflict with his peers. Hoth only sought peace with Farfalla after being advised to do so by the recently killed Pernicar, who appeared to him in a dream. Pernicar also advised Hoth to trust in the Force; the words of wisdom solved a crisis of faith that Hoth was undergoing, in which he had seriously considered abandoning Ruusan to the Sith. Although he had not welcomed the idea, the increasingly desperate situation and the poor morale of his troops had weighed heavily on him. Ultimately, Hoth's decision to combine his forces with Farfalla turned the tide of the Ruusan campaign to their favor.\nLord Hoth was created by William C. Dietz for the 1998 graphic novella Dark Forces: Jedi Knight, in which he appears in a vision to Kyle Katarn. The character also features prominently in Darko Macan's 2001 comic series Star Wars: Jedi vs. Sith and in Drew Karpyshyn's 2006 novel Darth Bane: Path of Destruction. The icy planet of Hoth, famous for appearing in the 1980 film Star Wars: Episode V The Empire Strikes Back, shares a name with Lord Hoth, and although Valenthyne Farfalla remarks in Jedi vs. Sith that \"Lord Hoth's heart is as cold as an ice planet,\" Karpyshyn stated that, to his knowledge, there was no in-universe connection between the two. He further speculated that Macan intended the name to represent the character's cold, grim demeanor.\nHowever, 2012's The Essential Guide to Warfare finally established a connection between man and planet. Authors Jason Fry and Paul R. Urquhart were hesitant due to the world's isolation in The Empire Strikes Back—set in 3 ABY—but they ultimately decided to do so when the 2011 MMORPG Star Wars: The Old Republic established that it was a well-known planet thousands of years before the events of Jedi vs. Sith. Urquhart has stated that the decision paid quiet homage to a fantasy he had as a child of ancient Jedi Knights riding tauntauns on the icy world. Urquhart also speculated that Hoth may have been named after the famed Mandalorian Rohlan Dyre, who, at the times of the New Sith Wars, could have been viewed as a hero by Jedi troubadours. Urquart has also revealed that his original proposal for Hoth's birth name was Kyprianus von Urron zu Hoth and that the name of the character Makkor von Urron is intended to refer to this name.\nThere is a discrepancy in Hoth's description between Dark Forces: Jedi Knight and later sources. Jedi Knight describes him at the time of the Battle of Ruusan as \"a giant of a man with shoulder-length blond hair, a lantern-shaped jaw, and ice-blue eyes,\" while Jedi vs. Sith and all sources based on it show him to have gray hair and brown eyes.\nThere are also conflicting accounts of the battles of Ruusan between Jedi vs. Sith and Path of Destruction. The most significant of these differences is the timing of Pernicar's death with relation to Farfalla's arrival and his reconciliation with Hoth. Jedi vs. Sith has Pernicar killed in the Sixth Battle of Ruusan, when the Dark Lords of the Sith use the Force to unleash a firestorm across the surface of Ruusan. In Darth Bane: Path of Destruction, some time before the sixth battle, Pernicar and Hoth are traveling in a supply convoy in the forests of Ruusan when they are ambushed by the Sith. Pernicar is killed in the attack, but Hoth is saved by the timely arrival of Valenthyne Farfalla. Both stories share several common elements—these include Pernicar dying in the vicinity of Hoth, Farfalla arriving shortly after, and Hoth being angry at Farfalla over Pernicar's death before later apologizing. There has been no official explanation or harmonization of these two accounts.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Jedi_vs._Sith",
  "/wiki/Darth_Bane:_Path_of_Destruction",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Jedi_Master/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Hoth_(disambiguation)",
  "/wiki/Hoth/Legends",
  "/wiki/Kaal/Legends",
  "/wiki/1000_BBY",
  "/wiki/Ruusan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Army_of_Light/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Johun_Othone",
  "/wiki/Padawan/Legends",
  "/wiki/Dree_Vandap",
  "/wiki/Tal_(Jedi)",
  "/wiki/Lord/Legends",
  "/wiki/Jedi_Lord",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Skere_Kaan",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/Ruusan_campaign",
  "/wiki/Sith/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Battlemaster",
  "/wiki/Supreme_Commander_(Republic)",
  "/wiki/Republic_Military/Legends",
  "/wiki/Army/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Pernicar",
  "/wiki/Valenthyne_Farfalla",
  "/wiki/Death/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Thought_bomb",
  "/wiki/Standard_year/Legends",
  "/wiki/Republic_Dark_Age",
  "/wiki/Yushan_sector/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Corellian_Trade_Spine/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Grand_Council",
  "/wiki/Cularin/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Kamparas",
  "/wiki/Freighter/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Kiel_Charny",
  "/wiki/The_Cloak_of_the_Sith",
  "/wiki/Dromund_Kaas",
  "/wiki/Malrev_IV",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/1003_BBY",
  "/wiki/Commander/Legends",
  "/wiki/Navy/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Third_Battle_of_Ruusan",
  "/wiki/Realspace/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Farfalla%27s_Knights",
  "/wiki/Blockade/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Unidentified_envoy",
  "/wiki/General/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Force_ghost",
  "/wiki/Kyle_Katarn",
  "/wiki/Mission_to_Ruusan",
  "/wiki/5_ABY/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Valley_of_the_Jedi",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Star/Legends",
  "/wiki/Hoth%27s_Brand_system",
  "/wiki/Hoth%27s_Brand",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/Advisor/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/William_C._Dietz",
  "/wiki/1998",
  "/wiki/Dark_Forces:_Jedi_Knight",
  "/wiki/Darko_Macan",
  "/wiki/2001",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Drew_Karpyshyn",
  "/wiki/2006",
  "/wiki/Water/Legends",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/In-universe",
  "/wiki/2012",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Jason_Fry",
  "/wiki/Paul_R._Urquhart",
  "/wiki/3_ABY/Legends",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Tauntaun/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Rohlan_Dyre",
  "/wiki/Makkor_von_Urron",
  "/wiki/Sixth_Battle_of_Ruusan",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Darkness_Shared",
  "/wiki/Star_Wars_Gamer_5",
  "/wiki/Darth_Bane:_Path_of_Destruction_(audiobook)",
  "/wiki/Jedi_vs._Sith_1",
  "/wiki/Jedi_vs._Sith_2",
  "/wiki/Jedi_vs._Sith_3",
  "/wiki/Jedi_vs._Sith_4",
  "/wiki/Jedi_vs._Sith_5",
  "/wiki/Jedi_vs._Sith_6",
  "/wiki/Bane_of_the_Sith",
  "/wiki/Star_Wars_Gamer_3",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/Darth_Bane:_Dynasty_of_Evil",
  "/wiki/Darth_Bane:_Dynasty_of_Evil_(audiobook)",
  "/wiki/Echoes_of_the_Jedi",
  "/wiki/Category:Images_of_Lord_Hoth",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_129",
  "/wiki/Ultimate_Adversaries",
  "/wiki/Kyle_Katarn%27s_Tale",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars_Insider",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_85",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Heritage_of_the_Sith",
  "/wiki/Star_Wars_Insider_88",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Special_Edition",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Two",
  "/wiki/StarWars.com",
  "/wiki/The_Knight_Errant_Gazetteer",
  "/wiki/Book_of_Sith:_Secrets_from_the_Dark_Side",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/10_Key_Battles",
  "/wiki/Star_Wars_Insider_133",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut",
  "/wiki/Hero_of_Tython",
  "/wiki/1010_BBY",
  "/wiki/Skarch_Vaunk",
  "/wiki/990_BBY",
  "/wiki/Jace_Malcom",
  "/wiki/3640_BBY",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/Berethon",
  "/wiki/Newar_Forrth",
  "/wiki/Gale",
  "/wiki/Saleeh",
  "/wiki/Teepo",
  "/wiki/Revan/Legends",
  "/wiki/3962_BBY",
  "/wiki/3960_BBY",
  "/wiki/Rans",
  "/wiki/Stantorrs",
  "/wiki/3643_BBY",
  "/wiki/Palpatine/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/19_BBY/Legends"
 ]
}