{
 "name": "House_Cortess",
 "display_name": "House Cortess",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Planet(s) of origin",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Other locations",
     "values": [
      "House Cortess"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation",
     "values": [
      "Alderaan",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "House Cortess was one of the noble families of Alderaan that existed by the time of the Cold War. It was considered one of the oldest of the Alderaanian houses by this time. They were noted to had become a proxy of House Thul and thus allies of the Sith Empire. In this time, the House was led by Baron Peyar Cortess who commanded the family during a time when they faced the constant threat of Killik attacks.\nIn the Cold War era, Cipher Nine of Imperial Intelligence was dispatched to Alderaan to uncover the Eagle's terrorist network. The Imperial Agent met the Joiner contact Vector Hyllus and gained entry into House Cortess despite the initial hostile actions of Baroness Chay Cortess. After securing an audience with the Baron, the Cipher Agent managed to get a lead that Denri Ayl who was a respected Alderaanian mediator was tied to the terrorists after accessing the library records of House Alde.\nDuring this time, it was discovered that Baroness Cortess herself was also aiding the terrorists. The Imperial attempted to confront Chay Cortess, however, she instructed her guards to bar entry to the agent. This led to Vector Hyllus bringing in Killik support where they damaged the Cortess shield generator in the Glarus Valley. After fighting their way into House Cortess, the agent revealed the Baroness's betrayal to her husband Peyar Cortess. Later during the Galactic War, their son, Pashon, tracked down Nine after the agent's identity was leaked by Hunter, in an attempt to avenge his family but failed.\nMillennia later, during the Galactic Civil War, a member of the House Cortess joined the Rebellion against Palpatine's Galactic Empire: Gram Cortess became a skilled and trustworthy pilot within the Alliance Starfighter Corps.\nThe fate of House Cortess lies on the actions of the player in the Imperial Agent campaign. After revealing Chay Cortess's betrayal, Vector Hyllus arrives with Killiks who reveal that they intend to turn House Cortess into a new hive as part of the nest's territory. Baron Peyar Cortess pleads with the player to oppose the Killiks as he complied with the Empire. If the player sides with the Killiks, House Cortess is destroyed and handed over to the Killiks as a result, with all the inhabitants - including the slain, such as Captain Perovius - being turned into Joiners. If the player decides to support Baron Cortess, the House is spared.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/House_Cortess_(estate)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Alderaanian/Legends",
  "/wiki/House_of_Thul",
  "/wiki/Baron/Legends",
  "/wiki/Peyar_Cortess",
  "/wiki/Killik/Legends",
  "/wiki/Cipher_Nine",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Eagle",
  "/wiki/Imperial_Agent",
  "/wiki/Joiner",
  "/wiki/Vector_Hyllus",
  "/wiki/Chay_Cortess",
  "/wiki/Cipher_Agent",
  "/wiki/Denri_Ayl",
  "/wiki/House_Alde",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Glarus_Valley",
  "/wiki/Galactic_War",
  "/wiki/Pashon_Cortess",
  "/wiki/Hunter_(Star_Cabal)",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Gram_Cortess",
  "/wiki/Pilot/Legends",
  "/wiki/Alliance_Starfighter_Corps",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars_(2013)_2",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}