{
 "name": "House of Marek",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Matriarch(s)",
     "values": [
      "Mallie Marek"
     ]
    },
    {
     "name": "Patriarch(s)",
     "values": [
      "Kento Marek"
     ]
    },
    {
     "name": "Other locations",
     "values": [
      "Kashyyyk",
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Fragmented",
     "values": [
      "c. 18 BBY"
     ]
    },
    {
     "name": "Restored",
     "values": [
      "c. 1 BBY"
     ]
    },
    {
     "name": "Extinction of family name",
     "values": [
      "2 BBY"
     ]
    },
    {
     "name": "Affiliation",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Order of the Sith Lords",
      "Galactic Empire",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "The House of Marek was a Force-sensitive Human family that played a prominent role in the formation of the Alliance to Restore the Republic. Prior to the rebellion against the Galactic Empire, the Jedi Knight Kento Marek married Mallie, a fellow Jedi, despite emotional attachment being forbidden in the Jedi Order. The couple deserted the Order after Mallie became pregnant with Kento's child, fleeing to the Wookiee homeworld of Kashyyyk where they welcomed a son—the young but powerful Galen Marek. In the aftermath of the Clone Wars, the Sith Lord Darth Vader discovered Galen and, sensing the boy's potential, abducted him after murdering his father.\nBestowing the code name of \"Starkiller\" on Galen, Vader spent years training his apprentice in the ways of the Sith. Although the Rule of Two forbade him from taking a student while still apprenticed to a Sith Master, Vader encouraged Starkiller to grow stronger with the dark side of the Force so that they could overthrow Darth Sidious—the Galactic Emperor and reigning Dark Lord of the Sith. Starkiller longed to become a true Sith Lord, believing it was his destiny to rule the galaxy at Vader's side as the Dark Lord's apprentice. After Vader betrayed Starkiller, the former Sith assassin embraced his Jedi heritage and saved the nascent Rebel Alliance at the cost of his life. As a result, the Rebels adopted the Marek family crest as their official emblem.\nDespite the death of Galen Marek, his family's bloodline was preserved through a generation of clones engineered from his genetic code at the behest of Darth Vader, who endeavored to create a more powerful and obedient version of his former apprentice. In attempting to perfect the process of cloning a Force-sensitive template, the initial clones of Marek were deformed and psychologically unstable. The procedure was gradually stabilized, yielding better results yet each clone experienced an identity crisis caused by the memory imprints of their progenitor. In 1 BBY, a year prior to the Battle of Yavin, a renegade clone escaped from the cloning facility on Kamino.\nThe first known member of the family was Kento Marek, a member of the Jedi Order who fathered a son, Galen, with his wife, Mallie, also a Jedi. Kento first met Mallie when both serving as Jedi officers in the Grand Army of the Republic during the Clone Wars. Despite the Jedi Code's restrictions against attachments and emotional bonds, the two fell in love. After marrying in secret, the two discreetly left the Jedi Order to start a new life together.\nAfter exiling themselves and traveling from system to system, Kento and Mallie became fugitives—along with rest of their former Jedi comrades—once Order 66 had been issued. As the Galactic Empire executed a systematic extermination of the remaining Jedi, the Marek family sought to create a safe haven for themselves on Kashyyyk. Upon their arrival, they were welcomed by the native Wookiees who were sympathetic to the persecuted Jedi Order, thus allowing the Mareks to establish a more permanent home on the Wookiee homeworld.\nThe House of Marek lived on Kashyyyk for roughly ten years. During their time on the Wookiee homeworld, Mallie became pregnant and gave birth to Galen Marek—a prodigy of the Force. Even at a very young age, Galen was abnormally strong in the Force, far more powerful than both of his parents. Not long after Galen's birth, Mallie was killed by Trandoshan slavers and mercenaries while protecting a group of Wookiees. At some point during the Great Jedi Purge, while Galen was still a young child, the Sith Lord Darth Vader personally oversaw an Imperial assault on Kashyyyk after learning of the Jedi presence on the planet. Kento made his last stand in front of his hut, but was ultimately slain in front of his son by the Dark Lord.\nUpon discovering Kento's son, Darth Vader was genuinely shocked that a child could possess an immensely powerful connection to the Force at such a young age, much like himself in the past. After a moment of hesitation, Vader took the boy into his custody and secretly trained him as a Sith apprentice, thus violating the Rule of Two. Galen, known only to a select few by the codename \"Starkiller,\" overcame one brutal trial after another in order to perfect his role as Vader's personal assassin. At the same time, his childhood memories became repressed and ultimately forgotten as he became increasingly immersed within the dark side of the Force.\nAs Starkiller, the young \"Sith\" aspirant executed many assassination missions for his Master over the years, which eventually led to Jedi targets such as Rahm Kota, Kazdan Paratus and Shaak Ti. Nevertheless, his steadfast loyalty was eventually rewarded with Vader's treachery after Darth Sidious, publicly known as Emperor Palpatine, \"discovered\" Starkiller's existence. Upon learning that his \"death\" was faked in order to deceive the Emperor, Starkiller remained loyal to Vader while carrying out his greatest task—the formation of the Rebel Alliance. Even though the mission caused him to develop certain doubts about himself and his Master, Starkiller remained dedicated to his belief in the ultimate goal that he had long since been prepared for; to become a true Sith Lord upon the Emperor's death.\nHis faith in Vader was again misplaced when the Dark Lord betrayed him for a second time after Starkiller succeeded in bringing the Empire's most significant enemies together on Corellia. Enraged at yet another betrayal, Starkiller dropped his codename in favor of his birth name, Galen Marek, which he rediscovered from repressed memories during his last mission for Vader. Galen's eventual conversion to the Jedi way and the light side of the Force was made possible by certain factors—Vader's betrayals, his remembrance of certain moments in his forgotten life on Kashyyyk, and mostly his growing affection for Juno Eclipse.\nGalen's liberation from his role as Vader's secret apprentice would not last long. In an attempt to rescue the Alliance leaders from execution, he journeyed to the incomplete Death Star and confronted his former master. Darth Vader ultimately proved to be no match for his younger and more powerful disciple. Although he was initially tempted to kill Vader and take his place at Sidious's side, Galen chose to reject the darkness and fought the Emperor for the lives of his allies. In a selfless act of sacrifice, Galen Marek surrendered his own life to provide the Alliance leaders with enough time to escape from the Death Star, thus ending Kento Marek's bloodline with the death of the last scion of the Marek family.\nMarek's sacrifice not only ensured the survival of the Rebellion's founders, but also inspired other dissidents to take up arms against the seemingly invincible Galactic Empire. At the behest of Leia Organa, an Imperial senator from Alderaan, the Marek family crest was converted into the Alliance Starbird; a symbol of hope for countless Rebels to rally around in their struggle against the Empire.\nDespite the death of Galen Marek, his family's bloodline was ultimately preserved by his former Master's attempts to replicate a more powerful and loyal version of Starkiller. Deep within a cloning facility on the planet Kamino, Darth Vader initiated a clandestine operation dedicated to creating a perfect and stable clone of his fallen apprentice. Though the \"accelerated cloning process\"—an advanced but experimental version of the Kaminoan method of cloning—enabled Vader to engineer a clone to full maturity in a matter of weeks, the process was consistently undermined by setbacks such as physical deformities and psychological instability. As a result, the initial tests yielded poor results; the first series of the Marek clones were deformed and insane. The project was further complicated by the inherent difficulties of cloning Force-sensitives.\nAs the cloning process was gradually refined, new clones of Galen Marek were created with more stability than their precursors. But even these improved test subjects were destabilized as each clone succumbed to madness, brought on by the memory imprints of their progenitor. This form of flash training caused the clones to experience a sense of identity crisis, and thus they adopted certain characteristics of Marek's personality. While some clones were affected by memories of Marek's father, others were disturbed by recollections of the young boy whom Marek once was during his time on Kashyyyk. At least one clone was known to have been influenced by Marek's attachment to his droid PROXY. Overall, however, many of these clones' training was personally overseen by Darth Vader, who judged them all to be failures.\nAfter a long line of failures, Darth Vader hoped to finally find success with Subject 1138, a clone of Galen Marek who progressed far into his training enough to impress the Sith Lord. In order to discover if the clone was able to free himself from the influence of Marek's memories, Vader ordered him to destroy several training droids disguised as Rebel troopers. Unlike his template, the clone spared no feelings for the Rebel Alliance that Galen Marek helped to create. Yet even though he attacked them without hesitation, he could not bring himself to strike down a droid disguised as Juno Eclipse. As with the other failed subjects, this clone was incapable of rejecting all of the imprinted emotions of his progenitor. While he personally cared nothing for Marek's deceased parents or the Rebellion, he could not discard his genetically inherited feelings for Eclipse.\nWhen Vader declared him to be another failed subject like the rest who came before, the clone turned against his creator and fled from Kamino. Utterly fixated on the Human woman whom Marek fell in love with, the clone embarked on a single-minded journey to locate Eclipse. During his quest, he subsequently became known as \"Starkiller\", the former codename of Galen Marek during his time as Vader's secret apprentice. The clone, however, refused to acknowledge his template's codename—and especially Marek's birth name—as his own. From the clone's point of view, the names \"Starkiller\" and \"Galen Marek\" belonged to a different man.\nAlthough Darth Vader made the recapture of the renegade clone a high priority, he continued to concentrate his efforts into creating a single perfect clone of Galen Marek; a clone who was fit to stand at his side as a Sith apprentice. There were still other clones to choose from, including Subject 1157. Despite the \"hallucinations\" he suffered and his rejection of the memory imprints, a cloning technician noted that Subject 1157's development was very remarkable, especially in comparison to the failures who preceded him. At this time, however, Subject 1157 was still being developed within a cloning tank and had to be regularly sedated because of his increasingly volatile temperament.\nUnknown to Starkiller, another clone had been activated and tested through a variety of trials. Though he was originally confused and distracted by the memory imprints, including the ones of Juno Eclipse, the clone steadily strengthened his resolve as he continuously passed one test after another. As his success continued, the clone was made aware of his deceased progenitor's failings, as well as the failings of his cloned brethren who were unable to meet Darth Vader's expectations. Determined to not be just another disappointment in a long line of failed test subjects, the clone persevered in his trials in order to prove his worthiness. The lead cloning technician who oversaw his development was astonished by the clone's stability. The technician was pleased to discover that the clone compartmentalized his template's memories, which thus allowed him to separate the imprints from his own experiences. The clone, unaffected by the identity crisis that undermined his precursors, was able to progress farther than any of those who came before him.\nAs Darth Vader became more impressed with his latest test subject, the Sith Lord eventually judged the clone to be worthy enough to see the proof of his origin. Vader brought the clone into a cold chamber, located in Timira City, that contained the preserved corpse of Galen Marek. The clone, freed from the influence of Marek's memories, was unaffected by the revelation of what he already knew to be true: he was a clone and the real Starkiller was dead. By this time, the clone had become his own individual, a person who deeply hated his former self for the weaknesses that made him unfit to be a Sith. By the time of the Assault on Kamino, Darth Vader regarded the clone—who had become utterly immersed within the dark side of the Force—as his \"Dark Apprentice\"; the only perfect clone of the original Starkiller.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Marek_Oko%C5%84",
  "/wiki/Maarek_Stele/Legends",
  "/wiki/Makin_Marec",
  "/wiki/Human/Legends",
  "/wiki/Mallie_Marek",
  "/wiki/Kento_Marek",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Corellian_Treaty",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Galen_Marek",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Battle_of_Kashyyyk_(c._18_BBY)",
  "/wiki/Death/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Call_sign",
  "/wiki/Standard_year/Legends",
  "/wiki/Sith_training",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Code_of_the_Sith/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Rule_of_Two/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Battle_on_Death_Star_I",
  "/wiki/Alliance_Starbird",
  "/wiki/DNA/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Dark_Apprentice",
  "/wiki/The_Force/Legends",
  "/wiki/Prime_clone",
  "/wiki/Aberrant_clone",
  "/wiki/Clone_madness",
  "/wiki/Memory_flash",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Subject_1138",
  "/wiki/Escape_from_Kamino_(1_BBY)",
  "/wiki/Timira_City",
  "/wiki/File:Kento_2.jpg",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sith_assassin/Legends",
  "/wiki/Rahm_Kota/Legends",
  "/wiki/Kazdan_Paratus",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/File:SecretApprentice_tfu.jpg",
  "/wiki/Corellia/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Juno_Eclipse/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Imperial_Senate/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/File:Starkiller_clones.png",
  "/wiki/Kaminoan/Legends",
  "/wiki/Flash_training",
  "/wiki/File:Starkiller_Cato_Neimoidia.png",
  "/wiki/Sith_Training_Droid",
  "/wiki/Rebel_trooper/Legends",
  "/wiki/Subject_1157",
  "/wiki/Force_vision/Legends",
  "/wiki/Unidentified_cloning_technician",
  "/wiki/Cloning_tank",
  "/wiki/File:Dark_Apprentice_DT.png",
  "/wiki/Lead_Cloning_Technician",
  "/wiki/Assault_on_Kamino",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/The_Force_Unleashed_(novel)",
  "/wiki/Star_Wars:_The_Force_Unleashed_(comic)",
  "/wiki/Star_Wars:_The_Force_Unleashed_II",
  "/wiki/Star_Wars:_The_Force_Unleashed:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_29",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Force_Unleashed_II_(comic)",
  "/wiki/The_Force_Unleashed_II_(novel)",
  "/wiki/LucasArts"
 ]
}