{
 "name": "House_Teral",
 "display_name": "House Teral",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Patriarch(s)",
     "values": [
      "Lord Teral"
     ]
    },
    {
     "name": "Relatives",
     "values": [
      "House of Organa"
     ]
    },
    {
     "name": "Other locations",
     "values": [
      "House Teral",
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "House Teral was one of the noble houses of Alderaan that existed by the time of the Cold War. They were closely related to the royal family of House Panteer and had enjoyed several generations of growth as well as prosperity through trade and its connection to the royal house. During the Cold War era, House Ulgo usurped the throne leading to the effective destruction of House Panteer thus starting a period of discord for House Teral. The Teral's trade fortune was seen as a threat by the Ulgo's who saw it as a potential through which their Panteer cousins were able to rebuild. Thus, House Ulgo began a campaign against the Teral's holdings and property.\nKing Bouris Ulgo began to use his influence to shatter House Teral's trading contacts. House Teral had never been a military house, but the Ulgos' onslaughts had led to this Alderaanian family raising massive armies to fight back against their attackers. In this time, the Terals were a shadow of their former selves as the house was harried and nearly bankrupt. A further crippling blow to them was the death of their diplomatic delegate, officially judged as an accident though many knew that it was clearly an act of House Ulgo who would only be satisfied with the complete annihilation of House Teral.\nA peace summit was formed in this time between the noble houses that was being administered by Jedi Master Sidonie Garen though the Terals lacked an individual to represent their interests. The Jedi Consular succeeded in breaking an Ulgo siege of their holdings and showed the house was strong enough for a marriage alliance to be made between the Teral's and House Organa. In order to attain access to Master Garen, the Barsen'thor conducted tasks for House Teral which allowed the Jedi entry into the summit. Alek Teral also tasked a Republic official with protecting his house from a Killik assault on their holdings in the Alsakan Lowlands.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:House_Teral",
  "/wiki/Human/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Teral_(Lord)",
  "/wiki/House_of_Organa/Legends",
  "/wiki/House_Teral_(estate)",
  "/wiki/Alderaan/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/House_Panteer",
  "/wiki/House_Ulgo",
  "/wiki/King/Legends",
  "/wiki/Bouris_Ulgo",
  "/wiki/Alderaanian/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Sidonie_Garen",
  "/wiki/Jedi_Consular",
  "/wiki/The_Barsen%27thor",
  "/wiki/Jedi/Legends",
  "/wiki/Alek_Teral",
  "/wiki/Killik/Legends",
  "/wiki/Alsakan_Lowlands",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}