{
 "name": "House_Rist",
 "display_name": "House Rist",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Family type",
     "values": [
      "Noble house"
     ]
    },
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Planet(s) of origin",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Other locations",
     "values": [
      "House Rist estate"
     ]
    }
   ]
  }
 ],
 "content": "House Rist was an Alderaanian noble family who existed by the time of the Cold War who were legendary spies and assassins. Its origins were traced to a crime lord from the Exchange who provided illicit services to Alderaan's nobility. Following years of underhanded dealings, the crime lord was rewarded with his own lands and the Rists were legitimized as a minor noble house. Despite this ascension, the Rists did not abandon their criminal roots but instead discreetly plied their murderous art while enjoying the trappings of privilege. This in turn earned them favor and leverage when dealing with the other noble houses of Alderaan.\nIn time, House Ulgo sought out House Rist and managed to acquire them as a vassal. Though a controversial move, the promotion was a shrewd act which allowed the Ulgos to retain the sole claim to the Rists' vast underworld resources. After the death of Gaul Panteer, suspicion fell on both Rist and Ulgo as many believed that it was assassins from this house that were responsible for the Senator's death.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Noble/Legends",
  "/wiki/Human/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/House_Rist_(estate)",
  "/wiki/Alderaanian/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Spy/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Exchange",
  "/wiki/House_Ulgo",
  "/wiki/Gaul_Panteer",
  "/wiki/Senator/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}