{
 "name": "House of Thul",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Planet(s) of origin",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Earliest appearance",
     "values": [
      "Before 3700 BBY"
     ]
    },
    {
     "name": "Fragmented",
     "values": [
      "0 BBY"
     ]
    },
    {
     "name": "Affiliation",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "The House of Thul, also known as House Thul, was an ancient noble house of Alderaan, founded over 3,600 years before the birth of the Galactic Empire. During the Galactic Civil War, family members Bornan and Aryn Thul founded Bornaryn Trading, which would exist as a major trading entity for decades to come.\nWhen Alderaan was destroyed by the Galactic Empire, only a handful of House Thul family members were off-world.\nHouse Thul was founded long before the Great Galactic War by a wealthy and ambitious merchant who bought his way into the nobility. Around 3700 BBY, when House Thul was unable to marry into royalty, the house made a desperate bid for power by swapping an Organa infant for a Thul one and supported the changeling as a potential bride for the crown prince. However, a young Jedi exposed the plot, creating a scandal that forced the Alderaanian Parliament to exile the entire house from Alderaan.\nDespite attempts to maintain its pride and culture in exile, House Thul became impoverished and isolated in their offworld estates. Decades later, they were contacted by the Imperial Diplomatic Service, promising the Sith Empire's support in restoring them to glory.\nWhen Alderaan had withdrawn from the Republic, House Thul found itself in a bloody civil war against the Republic-backed House Organa. House Thul became even further entangled in Sith affairs when Darth Baras' apprentice arrived on Alderaan to hunt down the family of the Jedi Padawan Jaesa Willsaam. The House benefited greatly in its quest for the Alderaanian throne due to the various interventions of the Sith Warrior. The descendant of Aloysius Kallig, who was the apprentice of Darth Zash also met with House Thul in Zash's search for an artifact that once belonged to Tulak Hord.\nOver three millennia later, during the Galactic Civil War, Bornan and Aryn Thul founded Bornaryn Trading together. The corporation involved shipping, Tibanna gas processing, and droid production; and would come to include subsidiaries Industrial Automaton and Xtib.\nWhen Alderaan was destroyed by the Galactic Empire, Bornan and Aryn Thul were among the few Alderaanians who were off-world. Their company survived, and would continue to operate until and after the Swarm War; Bornan and Aryn's child, Raynar, trained at Luke Skywalker's Jedi Academy, before becoming a key figure during the Swarm War.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Thul_Fain",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:House_of_Thul",
  "/wiki/Human/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/3700_BBY/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Bornan_Thul",
  "/wiki/Aryn_Dro_Thul",
  "/wiki/Bornaryn_Trading",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Great_Galactic_War",
  "/wiki/Alderaanian_Parliament",
  "/wiki/Imperial_Diplomatic_Service",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jaesa_Willsaam",
  "/wiki/Darth_Nox",
  "/wiki/Aloysius_Kallig",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Darth_Zash",
  "/wiki/Tulak_Hord",
  "/wiki/Tibanna/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Industrial_Automaton/Legends",
  "/wiki/Xtib",
  "/wiki/Swarm_War",
  "/wiki/Raynar_Thul",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/The_Paradise_Snare",
  "/wiki/Young_Jedi_Knights:_Diversity_Alliance",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/Dark_Nest_III:_The_Swarm_War",
  "/wiki/The_Holonet",
  "/wiki/The_Art_and_Making_of_Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}