{
 "name": "Hovus Jorrick",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Serenno"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Borgin"
     ]
    }
   ]
  }
 ],
 "content": "Hovus Jorrick was a male Klatooinian who served as head of security at Borgin Castle during the Imperial era.\nAround 3 BBY, Jorrick met Imperial envoy Jahan Cross who was asking the head of House Borgin, Lord Rodas Borgin to allow him to join the flight on the Windrunner so he could protect Bron Dooku. Rodas said that Jorrick would be protecting the Count so to prove his point that he would be better at guarding the Count than the Klatooinian, Cross told Jorrick to shoot him. Jorrick did as instructed but before he could pull the trigger he was knocked down by Cross. Seeing this, Rodas replaced Jorrick with Cross and he did not accompany the cruse in the air ship.\nJorrick was then placed in charge of security at Otoh Dooku, protecting the young Count Dooku. Unfortunately, Candra Tymon and Cross took the boy, and escaped in Manta droid subfighters. Jorrick and his security pursued them in their sub-fighters . However, Jorrick was misled and informed that a Bongo was moving away fast. Jorrick and remaining security forces then pursued the bongo. He was then contacted by Lord Borgin, and was ordered to fall back and wait till Cross, Tymon and the boy land, then he would get the boy back.\nJorrick was able to do that. However, in addition to Cross and Tymon, he and his security force had to deal with bounty hunter Boba Fett. A firefight started and Jorrick was wounded in the chest by Cross. Despite his wound, Jorrick pursued Cross and Fett to get the boy. Just as they were arriving, they saw Fett fire a missile which apparently destroyed the shuttle and killed Tymon and the boy. He then informed Lord Borgin of this. However, unbeknownst to him the boy survived. At Borgin Castle, Jorrick was left to die of his wounds by Lord Borgin.\nHovus Jorrick first appeared in 2012, in the Agent of the Empire – Hard Targets 2 issue of the Star Wars: Agent of the Empire series of comics. In that particular issue, Jorrick's species was misspelt as \"Klahtooinian.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Serenno/Legends",
  "/wiki/Klatooinian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_Borgin/Legends",
  "/wiki/Rodas_Borgin",
  "/wiki/Borgin_Castle",
  "/wiki/Imperial_Period",
  "/wiki/Jahan_Cross",
  "/wiki/Windrunner/Legends",
  "/wiki/Bron_Dooku",
  "/wiki/Otoh_Dooku",
  "/wiki/Candra_Tymon",
  "/wiki/Manta_droid_subfighter",
  "/wiki/Bongo",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/2012",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_2",
  "/wiki/Star_Wars:_Agent_of_the_Empire",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_4",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Hard_Targets_5"
 ]
}