{
 "name": "Hrekin Thorm",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Fedalle"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Hrekin Thorm was an obese Human Senator from Fedalle and served in both the Imperial Senate and the New Republic Senate.\nLike his constituents, Hrekin Thorm was pragmatic and supported the dominant galactic power—so long as he and his homeworld benefited. During the reign of both the Galactic Empire and the New Republic Thorm used his homeworld's power and influence to his advantage.\nDuring his service in the New Republic Senate, Thorm cultivated ties between himself and a number of industries in the Core. Eventually he was appointed to the New Republic's Inner Council, where he continued to follow the crowd. Occasionally Hrekin Thorm showed a ruthless streak, but only when his target was already down. One prominent example of this was his suggestion that Kyp Durron be executed for the destruction of Carida.\nKevin J. Anderson originally intended for Hrekin Thorm to be Threkin Horm, the obese President of the Alderaanian Council who first appeared in The Courtship of Princess Leia. However, a typographical error was made and was noted. When The Jedi Academy Sourcebook was written, Hrekin Thorm was given a distinct biography to establish him as a character separate from Threkin Horm, thus making Hrekin Thorm a character who owed his existence to a typographical error.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fedalle/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Imperial_Senate/Legends",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/Inner_Council_(New_Republic)",
  "/wiki/Kyp_Durron",
  "/wiki/Carida/Legends",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Threkin_Horm",
  "/wiki/Alderaanian_Council",
  "/wiki/The_Courtship_of_Princess_Leia",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Champions_of_the_Force",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards"
 ]
}