{
 "name": "Hudu Shiv",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Death Watch",
      "Death Watch",
      "Dooku"
     ]
    }
   ]
  }
 ],
 "content": "Hudu Shiv was a Human male member of Death Watch during the Clone Wars. He was regarded as one of their best snipers. He was sent to work for Count Dooku in 21 BBY to ensure the assassination of Commissioner Langu Sommilor from the planet Kynachi before they reached Coruscant, and to further the plans of Dooku and his master using Jedi Padawan Nuru Kungurama. Shiv performed his assassination, but was unable to flee without being seen by the Jedi, and was forced to fake his own death to ensure Death Watch's anonymity.\nHudu Shiv was a Human male Death Watch assassin. In 22 BBY, Count Dooku contacted the Death Watch and requested a sniper, and Hudu Shiv was sent. Shiv arrived at Dooku's retreat on Kohlma, and after being tested with remotes to prove his prowess, he was sent on to Vaced with specific instructions to assassinate the Commissioner of Kynachi, Langu Sommilor.\nArriving on the planet Vaced, where Sommilor was going to meet with an escort, Shiv prepared an ambush outside of Vaced Spaceport, and was hidden under a camouflage net in a tree when Breaker, a member of the Galactic Republic unit Breakout Squad, was on patrol and stumbled upon Shiv's speeder bike Shiv knocked Breaker unconscious and tied him up, as he had been instructed to not allow anyone to know that a Mandalorian had been involved in the assassination.\nWhen Sommilor arrived on Vaced, Shiv used poison darts to kill him and the two KynachTech Industries pilots who accompanied him. Shiv prepared to go, leaving behind the utility belt of Jedi Master Ring-Sol Ambase as Count Dooku had instructed, when Ambase's Padawan Nuru Kungurama approached him on a stolen swoop with a swoop gang in hot pursuit. Shiv had been instructed to leave Kungurama alive, and attempted to elude them, but knowing the swoops were faster than his speeder bike, tossed a thermal detonator, knowing Kungurama would be able to avoid it. Kungurama dodged the detonator, but the explosion took out the swoop gang. When Kungurama followed Shiv into the canyon called Shattered Rock, now accompanied by the sole survivor of the gang, Gizman, Shiv circled around to ambush them. Shiv shot Gizz and caused the swoop to crash.\nShiv checked to see if the young Jedi was alive, and found him not only alive but conscious. The two fought a brief duel before the Hasty Harpy, the starship Kungurama had been traveling on, arrived. Shiv used his jetpack to flee, and when the Hasty Harpy followed him, he used his rocket to attack the ship. He returned to his Pursuer-class enforcement ship and, after detaching the lifeboat, sent the ship by remote control to follow the Harpy, and let it be destroyed, fooling Breakout Squad into thinking he was dead. The confrontation, though, also resulted in the damaging of the Hasty Harpy. Then he took the lifeboat to a nearby space station to wait for a Death Watch ship to pick him up, hoping to someday confront Kungurama again.\nDooku commented on Shiv's skill as a Death Watch sniper. Shiv took many precautions but was proud of his abilities and wore a heavily armed set of Mandalorian armor. Shiv was capable of piloting a variety of vehicles and could use a jetpack.\nHudu Shiv appeared in Ryder Windham's 2011 book The Clone Wars: Secret Missions 3: Duel at Shattered Rock.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Death_Watch/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Count/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Sniper/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Commissioner/Legends",
  "/wiki/Langu_Sommilor",
  "/wiki/Kynachi",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Nuru_Kungurama",
  "/wiki/22_BBY/Legends",
  "/wiki/Dooku%27s_castle_(Kohlma)",
  "/wiki/Kohlma",
  "/wiki/Vaced/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Vaced_Spaceport",
  "/wiki/CT-8863",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Breakout_Squad",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Poison_dart/Legends",
  "/wiki/KynachTech_Industries",
  "/wiki/Pilot/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Ring-Sol_Ambase",
  "/wiki/Swoop/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Shattered_Rock",
  "/wiki/Gizman",
  "/wiki/Hasty_Harpy",
  "/wiki/Starship/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Hudu_Shiv%27s_Pursuer-class_enforcement_ship",
  "/wiki/Space_station/Legends",
  "/wiki/Special:EditPage/:Hudu_Shiv",
  "/wiki/Mandalorian_armor/Legends",
  "/wiki/Ryder_Windham",
  "/wiki/2011",
  "/wiki/The_Clone_Wars:_Secret_Missions_3:_Duel_at_Shattered_Rock",
  "/wiki/The_Clone_Wars:_Strange_Allies",
  "/wiki/Star_Wars_Annual_2011"
 ]
}