{
 "name": "Huetrin_Jones",
 "display_name": "Huetrin Jones",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Resistance navy",
      "Resistance navy"
     ]
    }
   ]
  }
 ],
 "content": "Huetrin Jones was a human male who served as a captain and Flight Officer in the Resistance during its war against the First Order. Circa 34 ABY, Jones assisted Lieutenant Kaydel Ko Connix in evacuating the Resistance base on the planet D'Qar. When First Order Star Destroyers arrived at D'Qar during the evacuation, Connix instructed Jones to leave the base's munitions and get the remaining Resistance personnel aboard the departing transports.\nHuetrin Jones was a Flight Officer and captain in the Resistance navy during the war against the First Order. Shortly after the Battle of Starkiller Base in 34 ABY, which saw the destruction of the First Order superweapon, Jones was stationed at the Resistance base on the Outer Rim planet D'Qar, where he assisted in the Resistance's evacuation.\nDuring the frantic evacuation, as Jones and Lieutenant Kaydel Ko Connix strode across the base's landing field, he informed her that thirty pallets of cannon shells were still in storage. With time running short, Connix told Jones to leave the munitions and ensure that the remaining personnel boarded the lifeboats departing to the Resistance cruiser Raddus.\nHowever, as Connix finished speaking, several First Order Star Destroyers arrived in the D'Qar system, catching the pair's attention. Fearing that the First Order would send slicers and droids to scour the Resistance databanks, Connix ordered Jones to oversee the destruction of the computers before evacuating. Jones and Connix commanded the last lifeboat that left D'Qar, and their transport narrowly outran an orbital strike from the First Order dreadnought Fulminatrix.\nHuetrin Jones was a tall human male with light skin, blue eyes, brown hair, and a beard. He wore a badge on his tan uniform, displaying his rank as a naval captain.\nHuetrin Jones first appeared in the 2017 sequel trilogy film, Star Wars: Episode VIII The Last Jedi, which was written and directed by Rian Johnson. Jones has the first line of dialogue in the film. The character was portrayed by actor Jack Greenlees, who was credited as \"Resistance Evacuation Officer.\"\nJones was first named in Jason Fry's novelization and audiobook of the film, which were released in 2018. The character's role in the novelization differs slightly from the film: In the book, Jones speaks to Connix after the First Order's arrival at D'Qar, rather than before, and protocol droid PZ-4CO is also present. His first name of \"Huetrin\" was later provided in the 2019 reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Jones",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Resistance_navy",
  "/wiki/File:Jones-and-Connix.ogg",
  "/wiki/Captain",
  "/wiki/Flight_Officer",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/34_ABY",
  "/wiki/Lieutenant",
  "/wiki/Kaydel_Ko_Connix",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/Resistance_base",
  "/wiki/Planet",
  "/wiki/D%27Qar",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/U-55_orbital_loadlifter",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Starkiller_Base",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Cannon",
  "/wiki/Time",
  "/wiki/Star_Cruiser",
  "/wiki/Raddus_(MC85_Star_Cruiser)",
  "/wiki/Ileenium_system",
  "/wiki/Slicer",
  "/wiki/Droid",
  "/wiki/Databank",
  "/wiki/Computer",
  "/wiki/Transport",
  "/wiki/Orbital_bombardment",
  "/wiki/Mandator_IV-class_Siege_Dreadnought",
  "/wiki/Fulminatrix",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Resistance_rank_badge",
  "/wiki/Clothing",
  "/wiki/Military_rank",
  "/wiki/Navy",
  "/wiki/2017",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Rian_Johnson",
  "/wiki/Jack_Greenlees",
  "/wiki/Officer",
  "/wiki/Jason_Fry",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/2018",
  "/wiki/Protocol_droid",
  "/wiki/PZ-4CO",
  "/wiki/2019",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_The_Last_Jedi_Graphic_Novel_Adaptation",
  "/wiki/William_Shakespeare%27s_Jedi_the_Last:_Star_Wars_Part_the_Eighth",
  "/wiki/StarWarsKids.com",
  "/wiki/Category:Images_of_Huetrin_Jones",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}