{
 "name": "Huff_Darklighter",
 "display_name": "Huff Darklighter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Darklighter family"
     ]
    }
   ]
  }
 ],
 "content": "Huff Darklighter was the father of Biggs Darklighter, the brother of Jula Darklighter, the uncle of Gavin Darklighter, and a land baron on Tatooine.\nA native of Tatooine, Huff owned dozens of moisture farms on his home planet, and bought water from other farmers at cut-rate prices. Some of the water he used in his own hydroponics facilities, while most was sold to other settlers at a high profit. He used his ability to locate water to become one of the planet's largest food magnates. In turn, he used his wealth to make sure Biggs got everything he deserved from life.\nHuff was not above bribing the local officials—both planetary and Imperial—to maintain his stature. Huff was avidly anti-Imperial, believing they had destroyed democracy and ruled through fear, and did not approve of Biggs' choice to enlist in the Imperial Academy.\nHe held his son in highest regard, and truly believed that Biggs was the only hero of the Battle of Yavin. Huff went so far as to alter say that Wedge Antilles was less than a hero for leaving the battle, despite the fact that Wedge was ordered out by Luke Skywalker.\nAfter the Battle of Yavin, an antique Tusken King's rifle that belonged to Huff Darklighter's grandfather was stolen. Huff was very upset and one of his guards hired a spacer to retrieve the rifle. The spacer traveled to Naboo and managed to recover the rifle from the crime lord Borvo the Hutt.\nThe spacer later worked for Huff Darklighter. For a first mission, Huff requested the spacer to help his daughter Dera who had become obsessed with Tusken Raiders. The spacer met the woman in the desert and agreed to eradicate a tribe of vile Sand Peoples dwelling within a cave near the Darklighter estate. For a second mission, Huff asked the spacer to disrupt Sennex slave trade operations in Anchorhead. The spacer thus attacked a Sennex bunker on the outskirts of the city that posed as a research facility and killed a number of slavers. For all the services provided to his family, Huff Darklighter rewarded a polished krayt dragon skull to the spacer.\nIn 1 ABY, one of Huff's nieces was kidnapped by slavers working for Jabba the Hutt. However, she quickly managed to escape and called her uncle for help with her comlink. Huff Darklighter soon dispatched a spacer to rescue the woman before Jabba's henchmen tracking her showed up. The spacer found the woman lost in the desert and escorted her back safely to the Darklighter estate. Huff Darklighter later paid the spacer to eliminate the criminal leading Jabba's slaving ring.\nHuff tried to obtain ownership of the Lars moisture farm on Tatooine by initiating an alien landowner tax. The tax was geared toward breaking the alien Throgg's financial reserves, but Gavin's father intervened and bought the farm before Huff could enforce the tax. Huff's dealings with the Imperial prefect on Tatooine allowed him a greater latitude in his dealings, and he worked hard to keep his competition at bay. However, Huff wasn't perfect. He was tricked and swindled by Lirin Banolt, but managed to obtain an Imperial data disk containing information on the Eidolon Base weapons cache. The plans were stolen from his residence, but were eventually recovered by Rogue Squadron.\nHuff took control of much of the Eidolon weapons cache in the aftermath, and used some of the stormtrooper armor, repainted to dark blue, for his security forces. Much of the remaining equipment was provided to Rogue Squadron during the Bacta War. Huff attempted to start a bidding war between the Rogues and an unknown buyer represented by Booster Terrik, but upon learning that his long-time friend Wedge Antilles was seeking the equipment, Booster quickly switched his allegiance. He used his knowledge of Huff's Imperial dealings to blackmail the moisture farmer into giving the weapons to Wedge. When Huff attempted to haggle over the price, Booster informed him that he meant the weapons should be given away for free, but his daughter Mirax Terrik intervened, insisting that the Rogues would buy the weapons, but only at a fair price.\nIn the first edition of Galaxy Guide 1: A New Hope, he was called \"Huk Darklighter.\"\nHuff Darklighter appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Huff Darklighter was present in the original release of the game, being the main quest giver of the Darklighter's Estate questline. With the release of the \"Publish 25,\" a.k.a. the \"New Game Enhancements,\" on November 15, 2005, the Darklighter's Estate questline was deeply revamped. In addition to the overhaul of the entire storyline, Huff Darklighter had his appearance changed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Darklighter_family",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Parent/Legends",
  "/wiki/Biggs_Darklighter/Legends",
  "/wiki/Jula_Darklighter",
  "/wiki/Gavin_Darklighter",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Tusken_King_(rank)",
  "/wiki/Tusken_Cycler_rifle",
  "/wiki/Naboo/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Borvo",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Lowland_Basin",
  "/wiki/Tusken_Cave",
  "/wiki/Sennex",
  "/wiki/Slavery/Legends",
  "/wiki/Anchorhead/Legends",
  "/wiki/Sennex_Slave_Bunker",
  "/wiki/Krayt_dragon/Legends",
  "/wiki/Skeleton/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Huff_Darklighter%27s_niece",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Lars_homestead",
  "/wiki/Throgg",
  "/wiki/Lirin_Banolt",
  "/wiki/Eidolon_Base",
  "/wiki/Tatooine_Campaign",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Bacta_War",
  "/wiki/Booster_Terrik",
  "/wiki/Mirax_Terrik_Horn",
  "/wiki/Galaxy_Guide_1:_A_New_Hope",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Empire_8",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Battleground:_Tatooine",
  "/wiki/X-Wing:_Rogue_Squadron",
  "/wiki/X-Wing:_Rogue_Squadron_(unabridged_audiobook)",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/The_Movie_Trilogy_Sourcebook",
  "/wiki/Galaxy_Guide_1:_A_New_Hope_(Second_Edition)",
  "/wiki/Star_Wars_Screen_Entertainment",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Trilogy_Sourcebook,_Special_Edition",
  "/wiki/The_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/The_New_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Far_Horizons",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}