{
 "name": "Hugh_Sion",
 "display_name": "Hugh Sion",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Kazuda Xiono's team",
      "Kazuda Xiono's team",
      "Resistance",
      "Jade Squadron",
      "Jade Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Hugh Sion was a human male military pilot who served the New Republic in the years following the conclusion of the Galactic Civil War. Sion served in the starfighter corps of the New Republic Defense Force during the Cold War, flying a T-85 X-wing. He later joined the Resistance, flying a T-70 X-wing in Jade Squadron.\nIn 34 ABY, during the Cold War, Sion served in the New Republic Defense Force's Starfighter Corps as the pilot of a T-85 X-wing starfighter. He, along with fellow pilots Kazuda Xiono and Mia Gabon, were sent on a mission to rendezvous with Commander Poe Dameron of the Resistance in order to deliver intelligence. However, the three pilots were ambushed by Major Elrik Vonreg of the First Order, and he and Gabon were concerned that the mission would fail. Xiono ordered him and Gabon to flee into hyperspace while he covered them, reasoning that the mission could be completed just as well by one pilot, and promising to be right behind them. After the mission, Xiono disappeared and Sion believed he didn't make it. In actuality, he joined the Resistance and became a spy on the supertanker fuel depot Colossus.\nSion himself later joined the Resistance during the First Order-Resistance War, flying a T-70 X-wing starfighter and joined Jade Squadron under Commander Venisa Doza.\nBy the time of the blockade of Dantooine, the squadron had been decimated. Doza's husband, Captain Imanuel Doza, allowed them to travel to the Colossus for a mission. Once aboard, Sion was reunited with Xiono.\nJade Squadron and the Aces then joined forces to rescue Resistance recruits from Dantooine. The squadron traveled there and fought off a squadron of TIE fighters, although one Resistance shuttle was destroyed. They then returned to the Colossus, where Captain Doza pledged the station's support for their cause.\nSoon after, the citizens of the Colossus came face-to-face with the First Order in one last battle. Sion, along with Jade and Ace Squadron, defended the old station and blew up Commander Pyre's and Agent Tierny's Star Destroyer. Sion survived the battle, and rejoined with Kaz and others at Aunt Z's bar, celebrating their victory over the First Order.\nSion was a male human with blue eyes and light skin.\nHugh Sion was a character developed for the Star Wars Resistance animated series. He was voiced by veteran Star Wars actor, Sam Witwer.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Sion",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Hugh_Sion",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/New_Republic",
  "/wiki/Kazuda_Xiono%27s_team",
  "/wiki/Resistance",
  "/wiki/Jade_Squadron",
  "/wiki/New_Republic_pilot",
  "/wiki/Standard_year",
  "/wiki/New_Republic_Era",
  "/wiki/Galactic_Concordance",
  "/wiki/Galactic_Civil_War",
  "/wiki/New_Republic_Starfighter_Corps",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/Cold_War",
  "/wiki/T-85_X-wing",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/34_ABY",
  "/wiki/Starfighter",
  "/wiki/Kazuda_Xiono",
  "/wiki/Mia_Gabon",
  "/wiki/Mission_to_rendezvous_with_the_Resistance",
  "/wiki/Commander",
  "/wiki/Poe_Dameron",
  "/wiki/Major",
  "/wiki/Elrik_Vonreg",
  "/wiki/First_Order",
  "/wiki/Hyperspace",
  "/wiki/Spy",
  "/wiki/Supertanker_fuel_depot",
  "/wiki/Colossus",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Venisa_Doza",
  "/wiki/Blockade_of_Dantooine",
  "/wiki/Captain",
  "/wiki/Imanuel_Doza",
  "/wiki/Ace_Squadron",
  "/wiki/Dantooine",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Resistance_shuttle",
  "/wiki/Pyre",
  "/wiki/Agent",
  "/wiki/Tierny",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Z%27Vk%27Thkrkza",
  "/wiki/Aunt_Z%27s_Tavern",
  "/wiki/Eye",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Star_Wars",
  "/wiki/Sam_Witwer",
  "/wiki/The_Recruit",
  "/wiki/Rebuilding_the_Resistance",
  "/wiki/The_Escape",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Databank_(website)"
 ]
}