{
 "name": "Hugo_Treece",
 "display_name": "Hugo Treece",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "During or after 3 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Hugo Treece was a male Human who served as an Imperial commander who acted as governor of Cloud City after Darth Vader left the city.\nAs an Imperial officer, Treece served aboard several Star Destroyers and rose quickly through the ranks, eventually commanding the Imperial-class Punisher before being placed in charge of Cloud City.\nDuring Treece's time in Cloud City he decided to double the Tibanna gas production in order to cover up the fact that he was taking part of the profits for himself, thus becoming an embezzler. Since this required the Ugnaught laborers to work beyond their physical capacity, they decided to sabotage the operation by installing several talking bombs throughout the structure of Cloud City.\nThe Imperials quickly evacuated the city and Treece called in a squad of bombtroopers to disarm the bombs. When the troopers encountered their first bomb, they were startled to find that it could talk, and it apparently wanted to help the troopers disarm it, but it was a ruse as it was actually instructing the troopers to arm the bomb instead. The charge detonated and all of the Imperials were killed except for Treece, who soon found that the former administrator of Cloud City, Lando Calrissian, had returned. The two agreed to a truce in order to recover Lobot, who was also damaged by the Ugnaughts, in order to repair him and have him deactivate the remaining bombs. They were successful, but when all of the bombs had been found and disarmed, Treece turned on Calrissian and shoved him off the Cloud City platform to fall onto Ugnaught Surface floating a kilometer below. Lobot rushed to find a life-jet and jumped to save Calrissian, but Treece assumed them both to be doomed.\nRebel X-wing pilots Luke Skywalker and Shira Brie arrived in Cloud City to investigate the disappearance of Lando. Treece pinned down the two pilots with his blaster, and called for reinforcements. But when more Imperial troops arrived, so too did Lando and Lobot with the aid of the Ugnaught Action Tidings news crew and their floatboat. Lando attempted to bluff Treece by telling him that if the Empire didn't abandon Cloud City Lobot would re-arm the talking bombs, and destroy the city. Treece foiled his plan by shooting and disabling Lobot, the only one apparently able to re-arm the bombs without triggering their self-destruct mechanisms. But Luke used the Force to re-arm the bombs and warned the Imperials to evacuate, and even set off several explosions to emphasize his point. The Imperials, including Treece, retreated and left Cloud City to return to full operation again.\nLando decided to exact some revenge on Treece by sending the complete financial records of the funds he stole from Cloud City to the account of Darth Vader on Aargau. Treece vanished soon after, and was presumed executed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Farmer/Legends",
  "/wiki/Treece",
  "/wiki/Corellia/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Punisher",
  "/wiki/Tibanna/Legends",
  "/wiki/Ugnaught/Legends",
  "/wiki/Talking_bomb",
  "/wiki/Bomb_squad_stormtrooper",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Lobot/Legends",
  "/wiki/Ugnaught_Surface/Legends",
  "/wiki/Life-jet",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Lumiya",
  "/wiki/Blaster/Legends",
  "/wiki/Action_Tidings",
  "/wiki/Floatboat",
  "/wiki/The_Force/Legends",
  "/wiki/Aargau/Legends",
  "/wiki/West_End_Games",
  "/wiki/Freedom_No_More",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/Star_Wars_(1977)_56",
  "/wiki/Star_Wars_(1977)_57",
  "/wiki/Up_the_Intelligence_Ladder",
  "/wiki/Shadows_of_the_Empire_Sourcebook",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/Star_Wars_Trilogy_Sourcebook,_Special_Edition",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/Wizards.com",
  "/wiki/Rough_and_Tundra",
  "/wiki/Bespin:_Action_Tidings",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_24",
  "/wiki/Databank_(original)"
 ]
}