{
 "name": "Huhunna",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free AlliancesWraith Squadron",
      "Wraith Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Huhunna was a Wookiee female member of Sharr Latt's Wraith Squadron in 44 ABY during the mission to prove corrupt Galactic Alliance General Stavin Thaal's involvement with the Lecersen Conspiracy. When both Latt's Wraith Squadron unit and Bhindi Drayson's Wrath Squadron unit met on Vandor-3 to accomplish the same goals, both units became integrated even after Drayson died and they saw to Thaal being arrested for his crimes.\nWhen Darth Caedus attempted to burn Kashyyyk during the Second Galactic Civil War in 40 ABY, Huhunna made an oath to herself to mete out justice as she saw fit to corrupt military officers who abused their authority and privilege. Her actions against such officers made her largely unpopular among the military, but it was for this reason that she was recruited by Garik \"Face\" Loran by 44 ABY into Sharr Latt's unit of Wraith Squadron. The mission was one that Huhunna would take great pleasure in fulfilling: proving that corrupt Galactic Alliance General Stavin Thaal was guilty for his involvement in the Lecersen Conspiracy around the time of the Lost Tribe of Sith emergence.\nIn the mission to prove Thaal's guilt, Huhunna was placed on the world of Vandor-3 with fellow Wraith Thaymes Fodrick, where the Wookiee was disguised as a bartender in Ackbar City. It was here that both Fodrick and Huhunna spotted Myri Antilles, a member of Bhindi Drayson's unit of Wraiths. Later, during Latt's Wraith unit and Drayson's unit's infiltrations of Vandor-3's undergroung installation, where Thaal was running his criminal operations, Huhunna ran into Viull \"Scut\" Gorsat, and from there, they teamed up with their fellow Wraith units to escape the installation when they were found out. As the whole of the newly-integrated Wraith Squadron was being chased by the Thaal's Pop-Dogs military forces, Huhunna joined Drayson in jumping out of the airspeeder, piloted by Voort saBinring, carrying them all in order to shoot down some of their pursuits while Antilles and Jesmin Tainer went to call for help from the Galactic Alliance. Drayson and Huhunna's tactic worked, but Drayson was fatally shot. Huhunna carried the dying Wraith leader to Mount Lyss Meteorological Station, where the rest of Wraith Squadron holed up for several days. Huhunna's effort in carrying Drayson back alive proved in vain, for the Wraith Leader died in spite of the medical attention given by Latt's unit's field medic Drikall Bessarah.\nNevertheless, Wraith Squadron continued their mission under the assumed leadership of Voort saBinring, and they managed to escape from Vandor-3 via shuttle escorted by StealthX starfighters piloted by the legendary Wedge Antilles and Tycho Celchu. From there, Wraith Squadron proceeded to the planet of Kuratooine where Thaal was planning to retire as Thadley Biolan. SaBinring came up with a complicated but surefire idea that would finally bring Thaal to justice wherein Huhunna was partnered up with Jesmin Tainer with freeing fellow Wraith Turman Durra, disguised as a member of a fictitious species native to Kuratooine, was held as a guest as part of the plan. That proved futile when Durra turned out to have been able to free himself, but the three Wraiths managed to get away all the same. In the end, the overall events on Kuratooine caused by Wraith Squadron led to General Thaal's arrest and the squadron's smooth escape from the planet and back into the Galactic Alliance.\nHuhunna was created by veteran Star Wars author Aaron Allston for his tenth and most recent entry in the X-wing novel series, X-Wing: Mercy Kill.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Wraith_Squadron",
  "/wiki/Sharr_Latt",
  "/wiki/44_ABY",
  "/wiki/General/Legends",
  "/wiki/Stavin_Thaal",
  "/wiki/Lecersen_Conspiracy",
  "/wiki/Bhindi_Drayson",
  "/wiki/Vandor-3",
  "/wiki/Darth_Caedus",
  "/wiki/Battle_of_Kashyyyk_(Second_Galactic_Civil_War)",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/40_ABY",
  "/wiki/Garik_Loran",
  "/wiki/Lost_Tribe_of_Sith_emergence",
  "/wiki/Thaymes_Fodrick",
  "/wiki/Ackbar_City",
  "/wiki/Myri_Antilles",
  "/wiki/Glitterby_Base",
  "/wiki/Viull_Gorsat",
  "/wiki/Pop-Dogs",
  "/wiki/Airspeeder/Legends",
  "/wiki/Voort_saBinring",
  "/wiki/Jesmin_Tainer",
  "/wiki/Mount_Lyss_Meteorological_Station",
  "/wiki/Drikall_Bessarah",
  "/wiki/StealthX",
  "/wiki/Starfighter/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kuratooine",
  "/wiki/Thadley_Biolan",
  "/wiki/Turman_Durra",
  "/wiki/Star_Wars",
  "/wiki/Author/Legends",
  "/wiki/Aaron_Allston",
  "/wiki/Star_Wars:_X-Wing_(novel_series)",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)"
 ]
}