{
 "name": "Hulas",
 "display_name": "Hulas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Duro"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "GenoHaradan"
     ]
    }
   ]
  }
 ],
 "content": "Hulas was a Rodian Overseer of the GenoHaradan who tried to persuade the Jedi Revan to join the organization during his visit to Manaan.\nWhen Hulas heard of Revan's exploits, and his battle with Calo Nord, Revan was given a datapad which told him to meet Hulas on Manaan alone. Once there he tried to persuade him to hunt down Zuulan Sentar the Gran, Lorgal the Rodian, Vorn Daasraad the Gamorrean, Rulan Prolik the shapeshifter, and Ithorak Guldar the Selkath.\nHulas failed to mention to Revan, however, that he was one of the four leaders of the GenoHaradan, and Vorn, Rulaan and Ithorak were the remaining three. With their deaths, Hulas would become the sole ruler of a powerful organization, maybe even more powerful than the Exchange, since they were known only as a myth, or a rumor by most sentients.\nRevan turned down his offer, realizing that the GenoHaradan's request was unacceptable for a servant of the Jedi Code.\nIn the dark side story, Revan complies with Hulas' request.\nAt the end, when Hulas reveals himself as one of the four leaders of the GenoHaradan and now the sole ruler, there are two choices: either to allow him to leave and lead the GenoHaradan or call him out for his treachery. The latter ends with a challenge to single combat in the Dune Sea outside the walls of Anchorhead, on the planet Tatooine. However, the treacherous Hulas arrives with a large group of GenoHaradan assassins including J'ane Khan, even if Revan goes alone. In that choice, Hulas and his other GenoHaradan assassins are slain on the sands of Tatooine by the former Sith Lord, leaving the GenoHaradan leaderless.\nIf Revan kills the remaining Overseers after his encounter on the Leviathan, Hulas' spies would know exactly who he is. When Revan and Hulas meet again, Hulas reveals that he knew everything, but will keep it as a secret.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Duro/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/GenoHaradan",
  "/wiki/Overseer_(GenoHaradan)",
  "/wiki/Jedi/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Manaan/Legends",
  "/wiki/Calo_Nord",
  "/wiki/Datapad/Legends",
  "/wiki/Zuulan_Sentar",
  "/wiki/Gran/Legends",
  "/wiki/Lorgal",
  "/wiki/Vorn_Daasraad",
  "/wiki/Gamorrean/Legends",
  "/wiki/Rulan_Prolik",
  "/wiki/Changeling/Legends",
  "/wiki/Ithorak_Guldar",
  "/wiki/Selkath/Legends",
  "/wiki/Exchange",
  "/wiki/Sentience/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dune_Sea/Legends",
  "/wiki/Anchorhead/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/J%27ane_Khan",
  "/wiki/Assassin/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Skirmish_aboard_the_Leviathan",
  "/wiki/Leviathan_(Interdictor-class_cruiser)"
 ]
}