{
 "name": "Hunde Decan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lok"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    }
   ]
  }
 ],
 "content": "Hunde Decan was a male Zabrak who lived on the planet Lok during the time of the Galactic Civil War.\nDecan once owned a Corellian Fried Ice Cream Fryer, but lost the device. Sometime after 0 BBY, a spacer found the fryer, but it was broken. The spacer then decided to meet with Decan to ask if he could assist with fixing the fryer or making a new one. Decan gave the spacer a fryer basket that belonged to the fryer and told the spacer to speak to Amyva Va'new, an Ithorian who lived on the planet Talus.\nHunde Decan was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts. The game was shut down on December 15, 2011. In the game, he could be found out in the wilderness of Lok. He was part of the quest line \"Find out more about the Cooker\"  that started when the player inspected a broken ice cream fryer. The player then had to talk to several NPCs on different planets to gather more information about the fryer. When finished with the quest, the player was rewarded with a schematic for a Corellian Fried Ice Cream Fryer.\nThe quest line was added to the game with Chapter 9 in April 2008",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lok/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Corellian_Fried_Ice_Cream_Fryer",
  "/wiki/0_BBY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Amyva_Va%27new",
  "/wiki/Ithorian/Legends",
  "/wiki/Talus/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011"
 ]
}