{
 "name": "Hunter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Clone Force 99",
      "Clone Force 99",
      "Galactic Empire",
      "Imperial Army",
      "Imperial Army"
     ]
    }
   ]
  }
 ],
 "content": "\"Hunter\" was the nickname of a clone commando sergeant who served as the commanding officer of Clone Force 99 in the Grand Army of the Republic during the Clone Wars, fought between the Galactic Republic and the Confederacy of Independent Systems. He was genetically altered to have heightened senses and commanded his comrades who had their own unique mutations, in what they called the \"Bad Batch.\" Other members of the squad included Wrecker, Tech, and Crosshair, and later, Echo.\nIn 19 BBY, Hunter and Clone Force 99 were recalled from an insurrection on Yalbec Prime to the planet Anaxes by Commander Cody, who along with Captain Rex was planning an infiltration of a Separatist Cyber Center to discover why Republic forces were strategically outmaneuvered in the battle there. In the mission, Hunter demonstrated his squad's aggressive methods, leading full frontal charges and earning the respect of Captain Rex. After successfully infiltrating the Cyber Center, Rex and Tech discovered that their strategies had been compromised by Echo, a long-lost Advanced Recon Commando. Clone Force 99 joined Rex and Anakin Skywalker's mission to find Echo on Skako Minor. After rescuing Echo and facilitating the demise of Separatist Admiral Trench, Hunter extended an offer to the cybernetically-enhanced clone to join his crew, which Echo accepted.\nMost of the members' mutations and the ordeal Echo suffered prior to joining caused their inhibitor chips to fail, meaning Clone Force 99 was able to disobey Order 66. With the Proclamation of the New Order and the rise of the Galactic Empire from the shell of the Republic, Clone Force 99—with the exception of Crosshair, whose chip had functioned properly—defected with a child named Omega, and Admiral Wilhuff Tarkin ordered that they be hunted down.\nOne of the millions of clones of the human male bounty hunter Jango Fett grown on the planet Kamino, Hunter was the leader of the experimental unit Clone Force 99, also known by its members as \"The Bad Batch.\" The elite clone squad consisted of clone commandos with desirable genetic mutations, with Hunter's mutations giving him enhanced senses. He was able to feel electromagnetic frequencies from anywhere on a planet. Hunter served as a Clone Sergeant, commanding the sharpshooter Crosshair, strongman Wrecker, and the technology genius Tech. The group flew in an Omicron-class attack shuttle called the Marauder. Clone Force 99 was named after the Maintenance duty clone 99, who was killed in the Battle of Kamino. Aside from Crosshair, Hunter and the other members of Clone Force 99 were minimally affected by the inhibitor chips implanted in all clones by the Kaminoans.\nThroughout the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, Clone Force 99 had a 100% percent success rate in their missions, but had a reputation for their unorthodox methods and disobedience. Hunter lost count of the amount of missions they had completed, feeling that the action blurred together. The Force was known throughout the Grand Army of the Republic to clone troopers such as Jesse and Kix, although Captain Rex had not heard of them. At some point in the war, Hunter met Commander Cody, and Clone Force 99 was given at least one suicide mission by him, but the members could not articulate who their regular superior officer was. The members of Clone Force 99 also met and bonded with the family of the clone deserter Cut Lawquane on Saleucami during the war.\nIn 19 BBY, Clone Force 99 was fighting an Insurrection on Yalbec Prime, where Wrecker cut off the Yalbec queen's stinger, causing the males of the species to try to mate with them. During the insurrection, Commander Cody transmitted a request for Clone Force 99 to arrive on Anaxes. The Republic was losing the Battle of Anaxes, and to turn the tide Captain Rex and Cody plotted an attack with a small squad on a Separatist Cyber Center, with Cody selecting The Bad Batch for the mission. The squad nearly crashed the Marauder as it flew at high speed into Fort Anaxes. Hunter exited the starship first and apologized for their tardiness, explaining their encounter with the Yalbecs as an \"unforeseen complication.\" The sergeant vouched for the flaws and abilities of his brothers before enquiring about the nature of their mission, boarding a Low Altitude Assault Transport/infantry gunship and getting briefed en route to their destination.\nThe gunship was shot down by DSD1 dwarf spider droids, crashing in a canyon. Cody was trapped within the wreckage, and when Rex tried to help his friend Hunter stopped him and ordered Wrecker to help. Wrecker used his immense strength to lift the entire gunship and pull Cody out. Afterwards the clones saw an army of B1-series battle droid advancing towards them, and Rex advocated making a stand there. Hunter disagreed, as Clone Force 99 had their own methods and preferred taking the fight to the enemy. Hunter called out for Plan 82, shockwave, where the unit worked as a team, with Wrecker providing cover with a large piece of the gunship, and Tech calculating positions for Hunter to throw Electro Magnetic Pulse grenades at, which were shot by Crosshair to disable a wide field of droids. As more spider droids advanced Hunter gave the order to fan out, fighting droids with his DC-17 hand blaster and vibroknife. With the droids eliminated Rex complemented Hunter on the squad's work and suggested that they move out from their compromised position.\nAt a camp, Jesse inquired as to what Hunter's genetic enhancement was, with Kix joking that it was ability to put up with the other three. Tech explained Hunter's abilities to sense electromagnetic frequencies and stated that unlike maps, Hunter was never wrong. With Cody incapacitated, Rex took command of the mission, escalating tensions between Clone Force 99 and Rex's men to the point of a near brawl. Hunter had to step in to get Wrecker to put down Kix, and chastised the men for their actions and focused on the mission, agreeing to follow Rex's lead and complete the mission his way. When the clones arrived at a Separatist outpost that was easier to attack than evade, Hunter asked for Rex's orders, expecting an infiltration mission, but the captain agreed to lead a frontal assault in Bad Batch style, which excited Hunter. The clones broke into the Center and rode an elevator up to the command tower, eliminating many droids along the way. Hunter complemented Rex, that he was not bad for a \"Reg\"; a term the Bad Batch used for the rank-and-file clones.\nFrom the outpost the clones spotted the Cyber Center, and Tech discovered a platoon of droids heading there. Hunter correctly theorized that their destruction at the crash site had been noticed. To infiltrate the outpost the clones Hunter, Tech, and Wrecker stole speeder bikes to flank the Separatists from the rear while the other clones attacked the entrance. After Wrecker broke down the back door, the three clones entered the base and gunned down the B1 battle droids inside. Inside the base's command center, Hunter attacked two T-series tactical droids with his vibro-knife, leaving Tech to analyze the Separatist computers while he and Wrecker joined the assault at the entrance. After the squad eliminated the B1 battle droids, a Multi-Troop Transport arrived and dropped off a host of B2-series super battle droids. The droids pushed the clones back inside the Cyber Center, where Hunter had to forcefully recall a stunned Rex to back out. After being pushed outside the Center, the clones were picked up by Crosshair driving a stolen Separatist airspeeder. On returning to Fort Anaxes, Rex revealed that the Separatists tactical advantage was caused by CT-1409, an Advanced Recon Commando nicknamed \"Echo\" who was long believed to be dead.\nAt the base, plans for a mission to the source of Echo's signals on the planet Skako Minor were made. Hunter met Jedi Knight Anakin Skywalker and expressed concern that the general staff had not sanctioned the mission, on account on its far-fetched nature. Skywalker was certain that it would be approved and that the primary objective was to uncover the Separatists' strategic advantages, regardless of Echo's involvement. Hunter offered Clone Force 99 to the mission, if only to allow an \"I told you so.\" Skywalker and Rex left so the Jedi could contact his secret wife Padmé Amidala, while Hunter returned to wait at the Marauder with the Bad Batch. On the way to Skako Minor Rex and Skywalker asked about the Force's nature, with Hunter unsure of the amount of missions they had undertaken or who they regularly reported to.\nAs the Marauder approached Skako Minor, Tech called out that it would be a difficult landing, leading everyone to strap in. As the crew landed and discussed the world's native Poletecs, one riding a winged keeradak landed on the ship and caused it to shake violently. Hunter wanted the creature removed from his ship and ran outside, followed by the crew. More mounted keeradaks arrived as they tried to force the keeradak off, and one grabbed Skywalker and flew off. Crosshair shot a grapple onto it, which Hunter grabbed and informed Rex he was going for a ride. The clone was pulled into the air and began shooting at the keeradak's rider with his blaster, which he dropped when the rider maneuvered out of his aim. As the keeradaks and Poletecs neared their village Hunter detached his cable and landed on a ridge overlooking the settlement. He contacted Tech via comlink and informed Clone Force 99 to hone in on his signal.\nWhen they arrived Hunter informed them that the tribesmen were holding Skywalker, and Rex instructed them that they would move in and only disarm the Poletecs without casualties. Wrecker rolled a boulder down a cliff into the village, with the clones following behind. Hunter pointed his blaster at the chief, the one who had abducted Skywalker, and ordered Tech to translate the language through his gear. The translation revealed that Skywalker had only been taken because the Poletecs wanted to avoid further warfare on their planet, as had already been propogated by the presence of Techno Union Foreman and Separatist Council member Wat Tambor. The Poletecs agreed to escort the clones and Skywalker to Tambor's headquarters in the city of Purkoll. At a vantage point overlooking the city Hunter and Crosshair both gave knowing looks at Wrecker when Skywalker expressed hope that none of them were afraid of heights. When Tech observed that the signal thought to belong to Echo had disappeared, Hunter suggested that the signal may have been a trap and that Echo was truly dead.\nRex reacted angrily when Crosshair suggested his guilt over leaving Echo at the Citadel was driving the mission, leading Skywalker to instruct Hunter to take Clone Force 99 to look for an entrance while he discussed the matter privately with Rex. The commandos found an entrance to a tower base before Skywalker and Rex arrived; when they did Hunter informed them that Echo's signal was restored. The group took an turbolift up the tower and Skywalker's instructions to keep the mission quiet were ignored. Clone Force 99 blasted their way out of the turbolift and destroyed a group of D1-series aerial battle droids in the room they opened up to. Outside the room, Tech realized that Echo's signal was only present when he was transmitting data, leading Skywalker to split up the group to search every room in the tower. Hunter ran with Rex, Tech, and Wrecker.\nWhen the signal returned, Hunter identified the room it emanated from. As the group tried to enter it a transmission from Tambor appeared on a viewscreen, with the foreman stating that the clones' movements had been predictable and that Echo was gone, his mind a prisoner of the Separatists. A large group of aerial battle droids surrounded the clones and were ordered by Tambor to execute them. Hunter threw his knife to deactivate one droid and destroyed several in the group with his knife and blaster, along with Skywalker and Crosshair, who had joined them. After the initial group was destroyed Skywalker ordered Tech to open the door for Rex, and Hunter expressed his hope that the captain found what he sought. Rex found Echo indeed, wired into machinery in suspended animation.\nMore D1 battle droids arrived and were fought off by Hunter, Skywalker, Wrecker, and Crosshair. The Jedi ordered Hunter to continue the defence while he checked on Tech and Rex. The three clones were pushed into the room where Echo was held and closed the door, with Hunter and Crosshair using welders to seal it. As more droids surrounded the entrance Crosshair explained the amount of droids entering, with Hunter stating they could hold them off as long as necessary. The sergeant sealed another door leading into the room as the Separatists began piercing the first one with a decimator droid. Rex and Tech were able to unplug Echo from the machinery, in which time the lost clone identified a roof exhaust vent through which they could escape. Echo unlocked the vent using his cybernetic attachments, and Hunter exclaimed that the Decimator had nearly breached through the second door. To reach the vent Wrecker threw Hunter upwards first, who complained that a warning would have been appreciated.\nWrecker threw the other members of the squad into the vent and threw thermal detonators to destroy the decimator. As the squad navigated the exhaust pipes Echo explained that he had been given access to Techno Union databases, including building schematics. Echo led the group to a large outdoor pipe at a great height, where Hunter tried to assure the acrophobic Wrecker that they were near safety. However, D-1 battle droids surrounded the clones on both sides of the pipe. Tech used a recording of the keeradaks to summon the creatures to their location, where the clones and Skywalker jumped on the keerdaks to escape. Hunter and Tech were the last to jump, riding on the same keerdaak. Hunter took the role of steering the creature while Tech fired back at the D1 droids, who pursued them in flight.\nClone Force 99 returned to the Poletec village, unwittingly drawing the battle droids there. The Poletec chief was furious that war had come to their village, but Rex explained what the Techno Union had done to Echo and that it was time for the Poletecs to take a stand. As a large force of droids arrived at the village the inhabitants and clones united to fight them off, with Hunter dispatching several with his vibro-knife. After many D1 droids were defeated several Octuptarra tri-droids wrought havoc on the villagers. Rex led Hunter and Wrecker to fire at the droids from below, and after Skywalker's effective strategy of jumping onto the droids and damaging them up close was demonstrated, Wrecker threw Hunter and Rex onto one of the droids to deal with them.\nWith the Octuptarra droids brought down Wrecker helped Hunter up, and the sergeant complimented Skywalker's abilities. The Poletec sand the clones thanked each other for their assistance as Clone Force 99 boarded the Marauder to return to Anaxes.\nAfter returning to Fort Anaxes, Echo formulated a plan to restore the planet to Republic control. Jedi General Mace Windu would lead a force to retake the planet's assembly complex, while Clone Force 99 along with Skywalker and Rex would escort Echo to Separatist Admiral Trench's flagship, Invulnerable, where the clone could give false strategies to the Separatists. At the Marauder, Hunter asked Tech if they were ready to begin, which Tech answered in the affirmative. Aboard the ship Hunter enquired about Echo's plan, which was to transmit a code identifying the vessel to the flagship as a droid shuttle. Hunter commented that the plan was risky, even by Bad Batch standards.\nInside the ship Echo engaged with the interface in the comm vault to complete the plan. Echo sent a message to Trench to send all droid forces to the assembly complex, which Hunter was suspicious of as that would outnumber the forces led by Windu and fellow Jedi Master Obi-Wan Kenobi. True to his loyalties, Echo transmitted a signal to deactivate all of the droids at the assembly complex, turning the various battlefronts on Anaxes in the Republic's favor. Hunter was glad to learn that Echo had not been compromised by the Separatists. As Echo discovered and helped Windu disarm a bomb hidden in the assembly complex, Trench's droids discovered the signal originating within their ship and blocked it, knocking out Echo. Hunter realized that meant Trench knew their location, and the clones began to fight their way out of the vault against a horde of B2 super battle droids and B1 battle droids.\nAs they progressed through the ship's halls Wrecker cleared a path by rampaging through lines of droids with only his hands, at which Hunter expressed a level of empathy for his victims. As Skywalker, who had gone to retrieve the final part of the bomb's code from Trench, returned, Crosshair demolished a large number of droids by placing reflective pads on the ship's walls, ricocheting his blaster-fire throughout the walls. Wrecker was dismayed that his feet was outdone, but Hunter assured him that he would win next time, which Crosshair disputed. The clones escaped from Trench's flagship aboard the Marauder, and on returning to Fort Anaxes they were commended for their actions by Windu, as they had saved Anaxes. Kenobi commented that medals were in store for them.\nWhen the members of Clone Force 99 did not join Rex and the Jedi to receive their accolades, Echo enquired as to why. The clones responded that it was not their \"thing\" and Hunter asked Echo if he felt the same way. He identified that Echo's path had changed from that of the regular clones, and was welcome to join them if he could find them. Rex advised Echo to accept Hunter's offer, which he did. The members of Clone Force 99 showed their respect to Rex by saluting him, along with their newest recruit.\nAs the war drew to a close, Hunter and Clone Force 99 were stationed on the planet Kaller, where Republic forces led by Jedi General Depa Billaba were pinned down by the droid army. Billaba's Padawan Caleb Dume was sent to find reinforcements and recruited Clone Force 99, who rolled a boulder down a hill onto the oncoming battle droids. Hunter and Clone Force 99 then emerged from the forest, with Hunter using his vibroknife and blaster. Hunter then ordered Crosshair to deal with the Armored Assault Tanks, which he did by launching a cable between them, which allowed Wrecker to then push them off a nearby cliff. Clone Force 99 dealt with the remaining battle droids and return to the Republic trenches, where Hunter suggested that Billaba launch a counterattack. Billaba's subordinate commander CC-10/994, nicknamed \"Grey\" responded indignantly, reminding Hunter that the general was in command, but Billaba agreed and followed Hunter's advice.\nWhile Billaba's clones advanced Dume introduced his master to Clone Force 99, where she praised the force's abilities. She then inquired about the reinforcements that were expected, but Hunter explained that they were directed to the capital and that Clone Force 99 was their only provision. Tech then revealed that communications were anticipating the potential end of the war, as Jedi Master Kenobi was engaging Separatist General Grievous on Utapau, where Republic victory could result in the collapse of the Confederate command structure. The clones knew they still had to continue fighting on Kaller, and Hunter asked Billaba if she had orders or if they could apply their demonstrated expertise. Billaba asked Dume, who enthusiastically asked if he could join Clone Force 99, although Hunter asked him if he was prepared to move quickly along with them.\nClone Force 99 did not have the chance to participate in further battle. As they ran into the fray Grey received a transmission from Supreme Chancellor Sheev Palpatine to execute Order 66, an instruction given to clones to terminate the Jedi that was mandated by the inhibitor chips. Dume rushed back to help Billaba, who was surrounded by hostile clones, which the members of Clone Force 99 noticed. From a distance they watched Billaba's death and ran back as Dume ran away, heeding his master's final instruction to run. The Padawan told the clones to stay away from him and ran into the forest, while Hunter called for him to wait. Hunter and the other Clone Force 99 members were unaffected by Order 66 due to their genetic enhancements, and so were confused by the sudden betrayal of the Jedi. Hunter ordered Tech and Echo to talk to Grey to learn what they could, while he and Crosshair followed Dume.\nThe two clones spotted Dume hiding in a treetop; Hunter called for him to come down, but Crosshair, who unlike his compatriots was affected by the inhibitor chips, fired on the Padawan who escaped further into the forest. Hunter asked what Crosshair was doing, to which the sniper insisted that he was following orders. Hunter told him to stand down as they were unclear on what the orders were, while Crosshair muttered the phrase \"Good soldiers follow orders.\" After further pursuit Tech explained via transmission that the clones had been ordered to execute the Jedi in response to treason, an explanation that satisfied Crosshair but left Hunter more confused. Crosshair spotted Dume again and knocked out the tree branch he was under. On the ground Dume and Crosshair fought while Hunter protested, with the clone being knocked down.\nHunter told Dume to stay calm and that he was on his side, but Dume continued to run, unsure who to trust. The Padawan came to the edge of a ravine and turned to face Hunter, who removed his helmet and tried to explain that he was equally confused and not responsible for Billaba's death. Hunter asked Dume to come with him, but as the Padawan heard more clones coming he jumped over the ravine and escaped into the distance. Crosshair woke up and caught up to Hunter, who lied and said he had stunned the Jedi and caused him to fall into the ravine.\nAs the Marauder returned to Kamino, Crosshair questioned Hunter on his version of events, noticing that the sergeant had not been looking down into the ravine as one would when something had fallen down there. Hunter brushed off Crosshair's interrogation, insisting that he did not enjoy looking. On their home planet Hunter found it odd that clone shock troopers from the Coruscant Guard were present, and learned from one of them that the war had come to an end with Grievous's death on Utapau. Subsequently, as a pair of shock trooper pass by with a cover corpse on a stretcher, a lightsaber fell from it, leaving Clone Force 99 visibly disturbed by the shock trooper's callousness as he picked it up. Hunter quickly dismissed the same shock trooper's concern if there was problem and stated his squad would be returning to their barracks. While Clone Force 99 walked through Tipoca City's halls, Hunter observed that all the other clones were acting strange. Tech attempted to test that theory as he attempted to get the attention of a random trooper only to be rudely shoved aside.\nUpon re-entering their barracks, in response to Echo's complaints about the ambient odour in the room, Hunter assured him he would get used to it in time, though Crosshair rudely shoved his way past to make his opinion clear. As Echo and Wrecker begin to debate whether their mission on Kaller was a success, Crosshair called out Hunter for allowing Dume to escape, to which he shamelessly stated he found it wrong to execute their commanders without question and grew suspicious when Crosshair insisted they had to follow orders.\nEcho then turned the argument around to the fact that Billaba's clones, who served her loyally for years, would just suddenly turn on her without a second thought. Tech then explained that all clones were programmed to obey orders without questions, but the genetic mutations of Clone Force 99 inadvertently rendered them immune to the effects of the programming. However, Hunter questioned why Echo wasn't affected, as he was a reg before he joined their squad, to which Tech theorized that the damage he sustained on Skako Minor most likely damaged his programming.\nThe squad as soon summoned to a mass rally where they watched the Proclamation of the New Order delivered by Palpatine, which transformed the Republic into the Galactic Empire. While listening to Palpatine's speech, Hunter spotted a young Human female standing next to Nala Se, who soon vanished when he was distracted by Tech. As they departed the assembly, Hunter remained silent as Echo and Tech briefly debated with Crosshair the change in galactic government when he sensed the same girl approaching them from behind. The girl introduced herself as Omega, who was fascinated by the squad's exploits, addressing each member of the squad by name. As Hunter inquired the reason for her presence on Kamino, Nala Se interrupted, introducing the girl as her medical assistant. As the two parted the squad's presence, Hunter remarked that recent events have grown more and more strange.\nAt a mess hall, Hunter overheard other clones talking about an Imperial arriving to evaluate all the clones and informed his squad upon rejoining them. Suddenly, they were joined by Omega, much to their confusion, as no one ever willingly sat with them before. Confused by her determination to become closer to them, Hunter asked where her parents were. Before she could respond, a passing clone insulted Omega, provoking her into throwing food at the offending clone. Though Hunter managed to de-escalate the situation, Wrecker threw an entire tray for no reason, triggering a brawl that resulted in Echo being knocked.\nClone Force 99 later came to visit Echo in the med bay, where he was being overseen by Omega and AZI-345211896246498721347. As AZ-3 departed, Echo informed everyone that he spotted Admiral Wilhuff Tarkin in the mess hall and forewarned he wasn't a supporter of clones. Hunter informed him that they had been summoned by Prime Minister Lama Su. Though Omega insisted on joining them to take responsibility for the food fight, Hunter told her to keep her distance from his squad.\nJust as Clone Force 99 left the med bay, a squad of shock troopers informed them that they were to report to the training area, as Tarkin wanted to see them in action. To test their mettle, Clone Force 99 took part in a training simulation, which Tarkin escalated to have them fight against live rounds. With their training blasters useless against the new droids, Hunter signaled Tech and Wrecker to recreate a manuever they used on Felucia. As Hunter and Crosshair drew the majority of the droids' fire, Wrecker, Tech and Echo isolated and reprogammed one to use its blasterfire against its compatriots. As the squad seized the momentum, Hunter took down one droid with three stabs of his knife and cut off the arms of a second. However, as one last hostile droid dispatched the reprogrammed unit, knocking Tech off it, Hunter threw his knife at the droid's abdomen, prompting it to fire on him and Crosshair. Ultimately, Crosshair was able to shoot Wrecker's knife into the droid's head, ending the simulation.\nAs they return to their barracks, the squad began to argue with Crosshair at being thrown into a live fire simulation without warning when they were interrupted by Tarkin, forcing them to stand at attention. The Admiral stated that Nala Se spoke highly of her five enhanced clones and assigned them to deal with insurgent forces on Onderon, but gave minimal information about their targets. Prior to the mission, Omega had met Hunter at the docking bay and warned him not to trust Tarkin. On Onderon, they only found a group of militia and refugees led by Saw Gerrera, who informed the clones of the nature of the new Empire and that he was preparing for civil war. Gerrera let the clones leave to choose their own path while his people evacuated.\nAt the Marauder the clones discussed the developments, with Crosshair expressing contempt for his squad-mates' disobedience. Hunter soon shot down an Imperial probe droid and realized he should've listened to Omega, whom Tech identified as the fifth enhanced clone Nala Se was referring to. Clone Force 99 was arrested at Kamino after returning there to retrieve Omega, while Crosshair was taken out to have his inhibitor chip analyzed and its effects enhanced. In their holding cell along with Omega the clones worked out how to escape and retrieved their gear at their impounded ship. Crosshair arrived and fired on his former companions, but Hunter and Clone Force 99 managed to escape along with Omega. While in space the clones wondered where to go, and Hunter suggested that they knew someone at coordinates J-19 whom they could turn to.\nAs they travelled to Saleucami, Hunter and Echo found Omega and Wrecker passed out after they had explored the ship together. While Hunter admired Omega's inquisitiveness, Echo reminded him that she is a child and questioned what to do with her. After landing on the planet, Hunter fondly watched as Omega took joy in things such as fresh air and dirt, having been raised on the water planet of Kamino her entire life. Eventually, the group arrived at Cut's homestead and were welcomed in. Hunter introduced Echo and Omega to Cut and his family, and explained Crosshair's absence as being complicated. Cut revealed that Rex had passed through the previous day and spoke of behavioral modification chips causing clone troopers to turn on the Jedi, which Omega confirmed the existence of. Hunter then encouraged Omega to play with Cut's children while he spoke to Cut. The retired clone trooper revealed that he planned to move his family off-world to escape the Imperial occupation.\nLater, Hunter and Cut headed into town to book a shuttle. Cut explained that the Imperials had begun impounding both civilian and military ships to prevent citizens from leaving Saluecami undocumented. While browsing produce, a vendor revealed to the duo that travel off-world was impossible due to the new chain code policy. Back at the homestead, Cut's children decided to stop playing after their ball rolled beyond the farm's perimeter. Omega, however decided to run after the ball and retrieve it. After she retrieved the ball, Omega was attacked by a Nexu. Cut's wife, Suu, and Hunter were alerted by the children and rushed to Omega's defense. After the predatory creature had been fended off, Hunter angrily reprimanded Omega for wandering off. Cut reminded Hunter that the girl was not a soldier, and instead comforted Omega. Fearing for her safety, Hunter ordered Tech to forge chain codes for Cut and his family, Omega included.\nIn order to forge the chain codes, Tech had the squad's ship impounded and brought to the Imperial spaceport, where he would be able to hack into the Imperial database and forge the codes. As Tech and Echo secured the codes, Hunter and Wrecker arrived at the checkpoint with Cut and his family. Omega attempted to sneak the codes to Hunter and Cut, but was discovered by an Imperial Astromech droid, and was subsequently saved by Wrecker. Omega managed to deliver the codes, but Hunter reluctantly convinced her to depart off-world with the Lawquanes for her own safety. Meanwhile, Tech, Echo, and Wrecker were discovered by clone stormtroopers and an intense firefight ensued. Hunter rendezvoused with his squad and proceeded to lay down covering fire as Echo and Wrecker attempted to demagnetize the clamps holding down their ship. Before the squad could depart, Omega appeared and ran for the ship, having decided to not leave with Cut and his family. Hunter dispatched the clone stormtroopers that attempted to subdue her and lead her aboard the ship. The group managed to lift off and escaped the planet.\nLater, Omega apologized to Hunter and admitted that she had a lot to learn. Hunter admitted that he likewise had much to learn, and affirmed to Omega that she belonged with the squad.\nCrash Landing on the Ordo Moon\nHunter sees Omega relaxing against Gonky looking at a datapad, and says their position doesn't look comfortable for either of the two, Omega tells him that they're fine, and Hunter hands her a Ration bar, and gives Wrecker his, and Wrecker asks for another, but Hunter tells him that rations are low, Omega offers hers, but Hunter tells him that she doesn't have a place to sleep, and it wouldn't be right to take her food too, then Wrecker politely turns her offer down, then states how he's not used to having a kid around, to which Hunter states that neither of them are, but she's not complaining, then the lights flicker and Hunter tells Echo that he thought he fixed them, Echo tells him to add it to the list.\nThen the ship starts to shake wildly as the ship gets thrown out of hyperspace, Tech tells Hunter that's they're fine since it's not affecting life support, Echo tells them that the power capacitor is low and they should land , Hunter tells Omega to strap in, and tells everyone to hold on, they safely land on the Ordo Moon , Hunter asks if everyone's alright, while Omega asks if it's over .\nEveryone looks for the spare capacitor , Omega pulls out Crosshair's weapon kit trunk, Wrecker says he missed Crosshair despite Echo reminding him that he shot him, Tech tells them that his actions were because of his inhibitor chip, with Omega confirming that it was made to do, Hunter says that they have to find the capacitor, fix the ship, and get off of the moon.\nHunter was the nickname of a clone commando whose serial number remained a secret, not being told to others. A little gruff, but not unfriendly, Hunter habitually expressed himself in straight words, although, at times, he did show a sense of humor. Hunter was described as strong and stoic. During the battle of Anaxes, Hunter played a role as a mediator between the regular clones, such as Jesse and Rex, and the members of Clone Force 99. The sergeant had to deescalate rising tensions that resulted in physical actions, reminding the clones that they were on the same side.\nWhen Order 66 was initiated, Hunter was reluctant to follow it, and tried to keep the young Padawan Caleb Dume safe from the other clones. He was initially annoyed by the young enhanced clone Omega, warning her to stay away from them since the squad was \"nothing but trouble.\" However, Hunter took a liking to her and insisted on returning to Kamino to retrieve her even though it placed his squad at great risk, saying she was one of them. Hunter would then develop a strong bond with Omega, becoming very protective and acting as a parental guardian towards her.\nHunter demonstrated a strong sense of morality and knowledge of right and wrong, to the point of disobeying orders he felt were unjust. When Crosshair, one of Clone Force 99's members, turned on his own team and berated them for letting Caleb Dume live, Hunter responded without hesitation that he did what he felt was right. Similarly, he refused to eliminate the \"insurgents\" that Tarkin sent them to eliminate on Onderon, because they were civilians and refugees, not soldiers.\nHunter's appearance, unlike that of other members of Clone Force 99, closely resembled that of regular clone troopers and of his progenitor Jango Fett. Other clone troopers such as Jesse could not identify his distinctions from a regular clone trooper by comparison to the rest of Clone Force 99.\nThe entire left side of Hunter's face was tattooed with half of a skull. He had longish dark brown hair, and wore a red bandana at most times with a small white skull symbol.\nHunter's mutations granted him enhanced senses that allowed him to perceive electromagnetic frequencies, which meant while maps of enemy-controlled regions may be wrong, he rarely was. Hunter was an agile fighter, able to perform flips and kicks while coordinating his blaster-fire and strikes with his weapons. He was incredibly skilled with a number of weapons, but his favorite was his vibro-knife.\nIn combat, Hunter regularly utilized a DC-17 hand blaster, a DC-17m Interchangeable Weapon System, a vibro-knife, and during a mission in Corellia he carried another DC-17 hand blaster. He also demonstrated familiarity with weapons employed by enemy combatants, in particular, the E-5 blaster rifle and the DC-15a blaster carbine. Although combat-proficient with blasters, the sergeant preferred to engage opponents with his knife at close quarters. As an experimental clone commando, he wore a set of modified Katarn-class Commando Armor.\nGeorge Lucas envisioned the Bad Batch as a version of The Dirty Dozen with clones. Dave Filoni sketched their appearances, which Brent Friedman and Matt Michnovetz used to imagine the Bad Batch's voices and personalities. Matt and Brent worked with Dave to flesh out the characters and their story, where Hunter was inspired by the character of Billy Sole from the 1987 film Predator.\nHunter was to appear in a four-episode arc written by Michnovetz which starred the Bad Batch which now included \"Echo,\" alongside Yoda on Kashyyyk. At the \"Untold Clone Wars\" panel at Celebration Anaheim, Dave Filoni talked about the plot of the arc. He revealed that the characters would ride on \"giant ape lizards\" that were holy to the Wookiees. In one scene Tarfful would ask the tree spirits for permission to go into battle against the enemy, which was a Trandoshan and the Separatist Alliance. To get the enemy out of some of their cities they would have to burn some of the trees. The clones had no problem with it, but it was upsetting to the Wookiees. A part of the arc would be about the clones and the Wookiees finding a common ground to fight the Separatists. A story-reel clip was shown at the panel, which showed the Bad Batch and other Wookiees riding on the \"ape lizards\" and battling a new beast that was based on Kinraths from the Star Wars: Knights of the Old Republic game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Hunter_(disambiguation)",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Talk:Hunter",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Clone_Force_99",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/Clone_commando",
  "/wiki/Clone_Sergeant",
  "/wiki/Commanding_officer",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Gender/Legends",
  "/wiki/Squad",
  "/wiki/Wrecker",
  "/wiki/Tech",
  "/wiki/CT-9904",
  "/wiki/Echo",
  "/wiki/19_BBY",
  "/wiki/Insurrection_on_Yalbec_Prime",
  "/wiki/Anaxes",
  "/wiki/Commander",
  "/wiki/CC-2224",
  "/wiki/Captain",
  "/wiki/Rex",
  "/wiki/Cyber_Center",
  "/wiki/Battle_of_Anaxes",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mission_to_Skako_Minor_(Clone_Wars)",
  "/wiki/Skako_Minor",
  "/wiki/Admiral",
  "/wiki/Trench",
  "/wiki/Cyborg",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Order_66",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Omega",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Planet",
  "/wiki/Omicron-class_attack_shuttle",
  "/wiki/Marauder_(Omicron-class)",
  "/wiki/Maintenance_duty_clone",
  "/wiki/Clone_99",
  "/wiki/Death",
  "/wiki/Battle_of_Kamino",
  "/wiki/Kaminoan",
  "/wiki/Clone_trooper",
  "/wiki/CT-5597",
  "/wiki/Kix",
  "/wiki/Captain/Legends",
  "/wiki/Lawquane_family",
  "/wiki/Cut_Lawquane",
  "/wiki/Saleucami",
  "/wiki/Yalbec",
  "/wiki/Unidentified_Yalbec_queen",
  "/wiki/Yalbec_queen_stinger",
  "/wiki/Reproduction",
  "/wiki/Fort_Anaxes",
  "/wiki/Starship",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/DSD1_dwarf_spider_droid",
  "/wiki/Army",
  "/wiki/B1-series_battle_droid",
  "/wiki/Plan_82",
  "/wiki/Electro_Magnetic_Pulse_grenade",
  "/wiki/Droid",
  "/wiki/DC-17_hand_blaster",
  "/wiki/Vibroknife",
  "/wiki/Anaxes_Separatist_Security_Outpost",
  "/wiki/Platoon",
  "/wiki/Speeder_bike",
  "/wiki/T-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/Multi-Troop_Transport",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Separatist_airspeeder",
  "/wiki/Battle_of_Lola_Sayu",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi",
  "/wiki/Marriage",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Poletec",
  "/wiki/Keeradak",
  "/wiki/Qin_Yazal",
  "/wiki/Blaster",
  "/wiki/Poletec_village",
  "/wiki/Comlink",
  "/wiki/Chief",
  "/wiki/Poletec_language",
  "/wiki/Techno_Union",
  "/wiki/Foreman",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Wat_Tambor",
  "/wiki/City",
  "/wiki/Purkoll",
  "/wiki/Citadel",
  "/wiki/Purkoll_Tower_Base",
  "/wiki/Turbolift",
  "/wiki/D1-series_aerial_battle_droid",
  "/wiki/Viewscreen",
  "/wiki/Decimator",
  "/wiki/Thermal_detonator",
  "/wiki/Octuptarra_tri-droid",
  "/wiki/Mace_Windu",
  "/wiki/Anaxes_assembly_complex",
  "/wiki/Invulnerable",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Kaller",
  "/wiki/Depa_Billaba",
  "/wiki/Conquest_of_Kaller",
  "/wiki/Padawan",
  "/wiki/Kanan_Jarrus",
  "/wiki/Forest",
  "/wiki/Armored_Assault_Tank_Mk_I",
  "/wiki/CC-10/994",
  "/wiki/Battle_of_Utapau",
  "/wiki/Grievous",
  "/wiki/Utapau",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Force_jump",
  "/wiki/Imperial_shock_trooper",
  "/wiki/Coruscant_Guard",
  "/wiki/Tipoca_City",
  "/wiki/Nala_Se",
  "/wiki/Unidentified_clone_trooper_(cafeteria)",
  "/wiki/AZI-345211896246498721347",
  "/wiki/Felucia",
  "/wiki/Onderon",
  "/wiki/Saw_Gerrera",
  "/wiki/Galactic_Civil_War",
  "/wiki/Realspace",
  "/wiki/Chain_code",
  "/wiki/Nexu",
  "/wiki/Suu_Lawquane",
  "/wiki/Astromech_droid",
  "/wiki/Ration_bar",
  "/wiki/File:ILikeYourStyle-TBB.ogg",
  "/wiki/Vibro-knife",
  "/wiki/DC-17m_Interchangeable_Weapon_System",
  "/wiki/Mission_to_a_droid_decommissioning_facility",
  "/wiki/Corellia",
  "/wiki/E-5_blaster_rifle",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Katarn-class_Commando_Armor",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/George_Lucas",
  "/wiki/Dave_Filoni",
  "/wiki/Brent_Friedman",
  "/wiki/Matt_Michnovetz",
  "/wiki/1987",
  "/wiki/Yoda",
  "/wiki/Kashyyyk",
  "/wiki/Celebration_Anaheim_(2015)",
  "/wiki/Wookiee",
  "/wiki/Tarfful",
  "/wiki/Trandoshan",
  "/wiki/Kinrath/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Category:Images_of_Hunter",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Bad_Batch_(episode)",
  "/wiki/A_Distant_Echo",
  "/wiki/On_the_Wings_of_Keeradaks",
  "/wiki/Unfinished_Business_(episode)",
  "/wiki/The_Clone_Wars:_Season_7:_Volume_1",
  "/wiki/Aftermath_(episode)",
  "/wiki/Cut_and_Run",
  "/wiki/Replacements",
  "/wiki/Cornered",
  "/wiki/Rampage_(episode)",
  "/wiki/Decommissioned",
  "/wiki/Battle_Scars",
  "/wiki/Reunion",
  "/wiki/Bounty_Lost",
  "/wiki/Common_Ground",
  "/wiki/Devil%27s_Deal",
  "/wiki/Rescue_on_Ryloth",
  "/wiki/Infested",
  "/wiki/War-Mantle",
  "/wiki/Return_to_Kamino",
  "/wiki/Kamino_Lost",
  "/wiki/LEGO_STAR_WARS:_Celebrate_the_Season",
  "/wiki/The_Pumpkin_Batch",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Clone_Tales",
  "/wiki/Star_Wars_Insider_187",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_The_Clone_Wars:_The_Final_Countdown",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/StarWarsKids.com",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Inside_Intel:_Clone_Armor",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Bad_Batch",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Disney%2B",
  "/wiki/File:WreckerTweet.png"
 ]
}