{
 "name": "Hunter  (clone)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Frozen moon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "41.5 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dark Jedi",
      "Empire of the Hand",
      "Community"
     ]
    }
   ]
  }
 ],
 "content": "Hunter was a female clone of an unknown Sith or Jedi Human that was created in an Imperial research facility on a frozen moon in the Unknown Regions.\nA Human Sith-Jedi clone created and bred by the Galactic Empire in a research facility as part of a cloning program initiated by Grand Admiral Thrawn. Later, their group known as the Community, the clones overthrew and killed the Imperial forces that operated the research facility. For many years the clones resided in the lower levels of this facility and during this time, Hunter fell in love with Alpha and conceived with him two daughters, Blessing and Grace.\nIn 41.5 ABY, they escaped the facility by stealing the Predator, a CloakShape fighter, that had been flown to the moon by the Anzat Sith agent, Kell Douro. Alpha was killed during their escape by Jaden Korr who had also come there to investigate a Force vision.\nHunter and all of the other members of the Community, with the exception of the clone Soldier, suffered from a sickness as a result of their clone heritage. As they escaped from the research facility, they flew through the remnants of the Lignan cargo of the Harbinger, which had been destroyed a short time earlier. The Lignan enhanced the clones' perception of the Force but also accelerated the effects of their sickness.\nAt some point in the past, she and the other clones began to worship the entity known as \"Mother\" under the guidance of another clone, Seer. She believed that the illness was a test that had been set for the clones by Mother and ordered Soldier to fly them to a planet called Fhost so that they could obtain medication and planned for the clones to then travel to find Mother.\nOn Fhost, Seer, Soldier, Hunter and the serving members of the Community that had not succumbed to the illness, deserted the starfighter and stole a medical supply ship from the Farpoint Medical Center. While stealing the ship, Seer encountered the Jedi Knight Jaden Korr and the clones captured Khedryn Faal, a spacer associate of Korr.\nAfter their escape from Fhost on the medical ship, the clones headed towards Mother's location. Unfortunately, the Nyss Nenn, an Umbaran Sith agent who had stowed away aboard the ship showed himself and killed both Hunter and Runner.\nIn Riptide, the template for Hunter was never explicitly stated, but the color of her hair and eyes, the name \"Hunter\", and the fact that on the only two other female clones, one clone was Lumiya's and the other had black hair, strongly suggested Mara Jade Skywalker. However, Khedryn Faal personally knew Mara Jade Skywalker as he was rescued by her and Luke Skywalker from Outbound Flight and would have recognized her when he found her dead body.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Hunter_(disambiguation)",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Frozen_moon",
  "/wiki/41_ABY",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Empire_of_the_Hand",
  "/wiki/Community",
  "/wiki/Sith/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Imperial_research_facility",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Alpha",
  "/wiki/Blessing",
  "/wiki/Grace_(Human)",
  "/wiki/Predator_(Kell_Douro%27s_ship)",
  "/wiki/CloakShape_fighter/Legends",
  "/wiki/Anzat_(species)",
  "/wiki/Kell_Douro",
  "/wiki/Jaden_Korr",
  "/wiki/Force_vision",
  "/wiki/Soldier_(clone)",
  "/wiki/Lignan",
  "/wiki/Harbinger_(Sith_dreadnaught)",
  "/wiki/Mother_(Rakatan_entity)",
  "/wiki/Seer_(clone)",
  "/wiki/Fhost",
  "/wiki/Starfighter/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Farpoint_Medical_Center",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Khedryn_Faal",
  "/wiki/Spacer/Legends",
  "/wiki/Nyss_Nenn",
  "/wiki/Umbaran/Legends",
  "/wiki/Runner_(clone)",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Outbound_Flight",
  "/wiki/Crosscurrent",
  "/wiki/Riptide_(novel)"
 ]
}