{
 "name": "Huper Tenrecs",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Talpiddian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Exegol landing team",
      "Exegol landing team"
     ]
    }
   ]
  }
 ],
 "content": "Huper Tenrecs was a Talpiddian male weapons specialist who served the Resistance as an armorer for the base on the jungle moon Ajan Kloss. He was unrivaled in his repair skills, but had difficulty distinguishing the faces of his fellow personnel, instead recognising them by their equipment. In 35 ABY, he attended a meeting at the base where it was revealed that the Sith Lord Darth Sidious had returned with a Sith fleet at his disposal.\nHuper Tenrecs was a Talpiddian male who worked as a weapons specialist for the Resistance during their war against the First Order. He was part of the Resistance group that set up base on the jungle moon Ajan Kloss and acted as the base's armorer.\nIn 35 ABY, he was amongst the base personnel who attended a meeting following the return of the YT-1300 light freighter known as the Millennium Falcon from a intelligence gathering mission. Commander Poe Dameron informed those gathered that they had received data confirming that the Sith Lord Darth Sidious had returned and that a Sith fleet from the planet Exegol was going to reinforce the First Order.\nHe later stood beside the technician Klaud during a second meeting at the base in which Dameron laid out a plan to attack the forces of the First Order and Sith Eternal on the planet Exegol. Following the successful attack, Tenrecs joined in with the victory celebrations held at the base, hugging a human beside one of the RZ-2 A-wing interceptors that had returned from Exegol.\nTenrecs had unrivaled repair skills due to his visual acuity at close range, but was almost completely unable to identify other Resistance members, particularly humans, by their appearance, instead identifying them by the gear they carried. The Talpiddian had light skin, gray hair and black eyes.\nTenrecs wore a brown tunic with multi-colored stripes and brown pants. He had a brown belt and bandolier and carried a EL-16HFE blaster rifle with an acoustic aiming aid.\nHuper Tenrecs first appeared in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, played by creature performer Hugh Purves; and was first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Talpiddian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Exegol_landing_team",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Jungle",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/35_ABY",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Sidious",
  "/wiki/Final_Order",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Armor",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Mission_to_Sinta_Glacier_Colony",
  "/wiki/Commander",
  "/wiki/Poe_Dameron",
  "/wiki/Planet",
  "/wiki/Exegol",
  "/wiki/Technician",
  "/wiki/Klaud",
  "/wiki/Battle_of_Exegol",
  "/wiki/Sith_Eternal",
  "/wiki/Human",
  "/wiki/RZ-2_A-wing_interceptor",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Bandolier",
  "/wiki/EL-16HFE_blaster_rifle",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_(Screen_Comix)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Category:Images_of_Huper_Tenrecs"
 ]
}