{
 "name": "Hurd",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Mantellian Army",
      "Mantellian Army"
     ]
    }
   ]
  }
 ],
 "content": "Hurd was a Human male who served the Galactic Republic as part of the Mantellian army during the Cold War. He was stationed on the planet Ord Mantell during part of the war, where he fought against the Mantellian Separatist Movement in the Separatist War.\nHurd was a Human male who served in the Mantellian army during the Cold War, a conflict between the Sith Empire and the Republic. During the war he held the rank of Sergeant and was deployed on the Republic held planet of Ord Mantell in the Bright Jewel system of the Mid Rim,. Whilst stationed on the planet he and all Republic forces aided the corrupt local government in fighting the Mantellian Separatist Movement.\nWhilst stationed on Ord Mantell Hurd worked out of Fort Garnik, a Republic stronghold on the planet. During his time stationed at Garnik the Republic troopers under Hurd's control were responsible for guarding the Fort's medical supplies. Whilst guarding the supplies one of Hurd's soldiers fell asleep at his post and a Cathar named Yael, who was living in the refugee camp outside of Garnik at the time, saw an opportunity to take the supplies to help her fellow refugees. The guard awoke just in time to see the thief escape but managed to identify her gender and species to Hurd.\nHurd then asked a smuggler known as Ace and a member of Havoc Squad whom he encountered in Garnik to retrieve the medicine for him claiming that good men were dying without it. The pair using the guard's description of the thief tracked her down to the refugee camp and confronted her about the supplies. The Cathar admitted she'd taken them but said she no longer had them as Separatists had stolen them and taken them to Talloran village. The smuggler and trooper then managed to retrieve the supplies but chose to give the back to Yael to help the refugees instead of giving them to Hurd\nWhilst at Fort Garnik Hurd wore blue armor with four ammo pockets on the chest and a pair of beige pants with knee boots.\nHurd is a non-player character from the massively multiplayer online role playing game Star Wars: The Old Republic released by BioWare in 2011. Hurd is involved in the quest 'Mercy' in which players can chose to either give retrieved medical supplies to him or Yael, with giving the supplies to him being a dark side choice meaning this articles assumes players followed the light side choice and gave the supplies to Yael. Choosing the dark side option will result in the same reward being given to the player by Hurd being either Drelliad boots to smugglers or hardened plastifold boots to troopers. It is not possible for players of the Imperial faction to interact with Vray as there is currently no way Imperial characters can travel to Ord Mantell.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mantellian_Army",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Planet/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Separatist_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sergeant/Legends",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Fort_Garnik",
  "/wiki/Republic_trooper",
  "/wiki/Cathar/Legends",
  "/wiki/Yael",
  "/wiki/Species/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Canon",
  "/wiki/Smuggler/Legends",
  "/wiki/Voidhound",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Havoc_Squad",
  "/wiki/Talloran_village",
  "/wiki/Blue",
  "/wiki/Armor/Legends",
  "/wiki/Boot/Legends",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Drelliad_boots",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons"
 ]
}