{
 "name": "Hurd_Coyle",
 "display_name": "Hurd Coyle",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Hurd Coyle was a junk salvager. Following the Battle of Utapau, Captain Coyle rescued the clone pilot HOB-147 who was drifting in space and had missed Order 66. The clone's damaged fighter was brought onboard Coyle's ship and he was taken to the sickbay by his reprogrammed B1-Series battle droid.\nWhen HOB-147 woke, he attacked the battle droid thinking that he had been captured by the Confederacy of Independent Systems. When Coyle walked into the sickbay he stunned the clone with an electro-dart and chained him to a wall. The clone was left alone, allowing him to rip the metal chain from the wall. He walked through the ship, until he encountered a group of Jedi Younglings that Hurd was transporting including Nia, who he had met earlier, and Bon.\nWhen Coyle's ship was subsequently boarded by a group of clone troopers, HOB-147 told the commander that the Coyle had saved his life and that there were no Jedi aboard. The commander believed the pilot's lie and ordered his men back to their ship, sparing Coyle.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Scavenger/Legends",
  "/wiki/Battle_of_Utapau/Legends",
  "/wiki/Clone_trooper_pilot/Legends",
  "/wiki/HOB-147",
  "/wiki/Order_66/Legends",
  "/wiki/V-19_Torrent_starfighter/Legends",
  "/wiki/Hurd_Coyle%27s_ship",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Electro-dart",
  "/wiki/Youngling/Legends",
  "/wiki/Nia",
  "/wiki/Bon_(Jedi)",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/Salvaged",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_9"
 ]
}