{
 "name": "Hurst",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Apatros"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1008 BBY",
      "Apatros"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Outer Rim Oreworks Company"
     ]
    }
   ]
  }
 ],
 "content": "Hurst was a Human male cortosis miner on the planet Apatros during the decades leading up to the Battle of Ruusan in 1000 BBY. Hurst's wife died giving birth to their son, Dessel, which led to Hurst resenting his son and blaming him for his life's problems, specifically the death of his wife and being stuck working on Apatros. Hurst gave Dessel the nickname \"Bane\" and often beat his son. In 1008 BBY, Hurst died of a massive heart attack that was unknowingly caused by Dessel through the Force. Eventually, his son went on to become the Dark Lord of the Sith Darth Bane.\nHurst was born on the Outer Rim planet Apatros and eventually began working at the local cortosis mine owned by Outer Rim Oreworks Company. He was married, and, in 1026 BBY, his wife gave birth to Hurst's son, who was named Dessel. Hurst's wife died giving birth to Dessel, and Hurst was left to raise the child on his own. He subsequently blamed Dessel for all his troubles: his wife's death and being stuck working in the cortosis mine on Apatros. Hurst referred to his son as \"Bane,\" for he considered Dessel to be the bane of his existence. Hurst was a heavy drinker after his wife's death and often beat Dessel while intoxicated. His son began working in the cortosis mine at the age of thirteen, and other miners, including Hurst's good friend Gerd, often tormented and bullied Dessel. Hurst spent more time gambling and drinking than actually working, and often had to borrow credits from Outer Rim Oreworks to pay for his monthly room and board. The interest rate on the loans piled up year after year, and Hurst accumulated great debt.\nIn 1008 BBY, Hurst died of a massive heart attack after beating his son heavily in a drunken rage. After his death, Dessel was stuck with his father's debt. Dessel surmised that Hurst, who resented his son, would be happy that he was stuck with the bill. However, Dessel eventually escaped Apatros, joining the Sith army during the New Sith Wars against the Galactic Republic. After serving with distinction, Dessel's Force-sensitivity was discovered and he became Darth Bane, one of the most important and influential Dark Lords of the Sith in galactic history. Darth Bane named himself after the nickname \"Bane\" given to him by Hurst. Later on, as a Sith, Bane realized that he unknowingly caused Hurst's death with the Force.\nHurst greatly resented his son Dessel, blaming him for his wife's death in childbirth and most of his life's problems, such as being stuck working on Apatros. He drank heavily and was a gambler, and often beat Dessel while drunk. Hurst incited great anger in his son due to the beatings and him giving Dessel the moniker \"Bane,\" which led to his death when Dessel killed him with the Force.\nHurst first appeared in a flashback in Drew Karpyshyn's novel Darth Bane: Path of Destruction, and was later mentioned in its sequel, Darth Bane: Rule of Two. The character was also mentioned in Jedi vs. Sith: The Essential Guide to the Force, and was given an entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Apatros/Legends",
  "/wiki/1008_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Outer_Rim_Oreworks_Company",
  "/wiki/Gerd",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Cortosis/Legends",
  "/wiki/Miner/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/1000_BBY",
  "/wiki/Hurst%27s_wife",
  "/wiki/Death/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Heart/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Mining/Legends",
  "/wiki/1026_BBY",
  "/wiki/Gambling/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sith/Legends",
  "/wiki/Army/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Timeline_of_galactic_history/Legends",
  "/wiki/Drew_Karpyshyn",
  "/wiki/Darth_Bane:_Path_of_Destruction",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Darth_Bane:_Path_of_Destruction_(audiobook)",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/Darth_Bane:_Dynasty_of_Evil",
  "/wiki/Darth_Bane:_Dynasty_of_Evil_(audiobook)",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_21"
 ]
}