{
 "name": "Hurst Romodi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Virujansi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Less than 1.85 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Military",
      "Republic Military",
      "Galactic Empire",
      "Imperial Army",
      "Imperial Officer Corps",
      "Imperial Army",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Hurst Romodi was a human male who served in the Grand Army of the Galactic Republic during the Clone Wars and later became one of the first generals in the Galactic Empire's Army. As an Imperial officer, Romodi was involved in the pacification of the galaxy's Western Reaches, and took reconstruction measures in the aftermath of the Battle of Ogoth Tiir. Although Romodi eventually stepped back from service, Grand Moff Wilhuff Tarkin coaxed him out of retirement to participate in the completion of the Death Star project. After witnessing the first live test fire of the Death Star's superlaser on the Holy City of Jedha, the General served as an adjutant to Tarkin around the time of the Battle of Scarif.\nHailing from Virujansi, Hurst Romodi fought in the Clone Wars, a three-year pan-galactic conflict that pitted the Galactic Republic against the Confederacy of Independent Systems. When Sheev Palpatine replaced the Republic with a Galactic Empire of his own device at the end of the war, Romodi was a battle-scarred veteran, and he became one of the first generals in the new Imperial Army. Alongside Wilhuff Tarkin, he contributed to the pacification of the unruly Western Reaches. In the aftermath of the Battle of Ogoth Tiir, he took reconstruction initiatives, which later became a subject of discussion in Colonel Julyan's Strategy and Tactics class at the Arkanis Academy. After his retirement, Romodi was personally asked to return to the military to help in the readying of the Death Star project.\nToward the end of the Jedha insurgency in 0 BBY, Romodi was invited aboard the almost finished Death Star battle station, along with Grand Moff Tarkin and other officers, to witness the first live fire test of its superlaser, with the Holy City of Jedha as its target. The test was successful, and Tarkin immediately assumed authority over the Death Star, much to the discontent of its nominal commander, Director Orson Krennic of the Imperial Military Department of Advanced Weapons Research. Romodi stayed with the Grand Moff, serving as his aide aboard the battle station.\nIt was he who received General Sotorus Ramda's report that a Rebel incursion was occurring on Scarif, where the technical blueprints of the superweapon were kept. After relaying that information to Tarkin, Romodi was instructed to prepare the battle station's jump to hyperspace and inform Lord Vader of the situation. Once on the premises, the general enthusiastically suggested to target the Rebel Fleet with the Death Star, which Tarkin refused, stating Lord Vader will handle the fleet. Instead, the Grand Moff ordered a single reactor ignition and had it targeted at the Citadel Tower on Scarif. Romodi then gave directions to his aides to carry out Tarkin's order, and the superlaser fired, destroying the tower and impacting the planetary surface several kilometers away.\nNevertheless, the Empire's actions at Scarif proved insufficient. Prior to the destruction however, the Rebels had managed to transmit the plans of the Death Star to Princess Leia Organa aboard the consular ship Tantive IV. Although Lord Vader and his flagship the Devastator managed to capture the Tantive IV above Tatooine, Romodi feared that further leakage may have occurred during the interception. The general then sent Tarkin a high-priority communique, advising him to take immediate action to neutralize political and military opposition.\nA little later on, General Romodi participated in a meeting in the Death Star's conference room, during which Tarkin announced the disbanding of the Imperial Senate and Darth Vader assured that the stolen plans would soon be back in the Empire's hands. While Romodi's fellow general Cassio Tagge expressed concerns that the Rebel Alliance may discover a flaw in the Death Star, Admiral Motti brushed those aside. Eventually, the Death Star was brought to the Yavin system to confront Rebel forces over their headquarters on Yavin 4.\nHowever, Tagge had correctly assessed the rebel threat. Exploiting the presence of a thermal exhaust port in the superweapon's structure that had been deliberately designed by the scientist Galen Erso to be unstable, the Rebellion launched a successful assault on the Death Star, resulting in its explosion and the loss of every life on board including Governor Tarkin. Both Tagge and Romodi survived the destruction of the Death Star. However, even though Romodi had been highly favored, Emperor Palpatine chose to promote Tagge to Grand General, and placed him in charge of the entire Imperial military, commenting that there remained \"no one else he could use.\" But Tagge was then demoted for failing to stop the rogue cyborg agent Cylo and Vader executed him after being placed in charge of Death Squadron.\nAt some point between 3 ABY and 4 ABY, Romodi received an invitation from the criminal organization Crimson Dawn to an event where the captured Rebel Captain Han Solo would be put up for auction. He subsequently attended the auction, accompanied by Sub-Administrator Sly Moore and several officers. While the general thought that they should simply seize Solo instead of bidding, Moore objected that it would damage the Empire's working relationships with the criminal syndicates in attendance. Therefore, Romodi reluctantly agreed to let Moore use her innate Force abilities to prevent others from outbidding the Imperial delegation. Nevertheless, the sub-administrator's powers proved useless against the Hutt crime lords in the room, and Jabba Desilijic Tiure raised the bidding to one million credits, to Romodi's great displeasure. At that moment, much to everybody's surprise, Lord Vader himself made a striking entrance, claiming Solo for himself.\nRomodi was a light-skinned man with brown hair, which had heavily receded and started to turn gray by the time of the Battle of Scarif. One prominent vein could be seen bulging at his right temple. An experienced officer who had been through many battles, Romodi felt proud and enthusiastic about the technological terror of the Death Star. He had the favor of the Galactic Emperor himself. Romodi put alcohol in the standard-issue caf the Empire served to make it more enjoyable.\nIn his capacity as a general, Romodi wore a field gray, crease-free Imperial officer uniform made of gaberwool, like many other Imperial officers wore. On the left side of the upper chest, he sported a rank insignia plaque consisting of six yellow tiles arranged in a single row. He owned a bronze and silver flask for drinking.\nThe character of Romodi first appeared in the novelization of the 1977 movie Star Wars: Episode IV A New Hope, released several months prior to the film. Attending a meeting aboard the Death Star, he delivers a line that is instead given to Admiral Motti in the movie. Although his appearance in the novel rendered him a part of Expanded Universe continuity, it was unclear if Romodi actually appeared in the film until 2012 when author Jason Fry confirmed that he was the \"bald guy\" present at the meeting; a character whom the fan website Aveleyman identifies as being portrayed by Ian Selby, an actor listed as an Imperial Bureaucrat by Ann Skinner's continuity notes. In that same year, Fry and Paul R. Urquhart provided the first name of \"Hurst\" in the reference book The Essential Guide to Warfare.\nRomodi was first named in the 2015 novel Servants of the Empire: The Secret Academy, also written by Fry. Fry confirmed on his Twitter account that he intended him to be the Romodi from A New Hope.\nDuring the development of 2016's Rogue One: A Star Wars Story, the production crew took a look at everyone who is seated around the Death Star conference table in A New Hope, trying to pinpoint a character that could be easily recast to make an appearance in the new movie. Eventually, Romodi was chosen, and Andy de la Tour went on to portray the general in Rogue One. The full name of \"Hurst Romodi\" was given in the film's end credits.\nOn the social network Twitter, several French fans have humorously pointed out the resemblance between de la Tour's Romodi and the Mayor of Bordeaux Alain Juppé, prompting several French-speaking online media outlets to relay the information.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Hurst_Romodi",
  "/wiki/Hurst_Romodi/Legends",
  "/wiki/Romodi_Interstellar_Company",
  "/wiki/Tales_of_Villainy:_The_Short_Goodbye",
  "/wiki/Darth_Vader_(2020)_14",
  "/wiki/War_of_the_Bounty_Hunters_2",
  "/wiki/War_of_the_Bounty_Hunters_3",
  "/wiki/War_of_the_Bounty_Hunters_4",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Darth_Vader_(2020)_17",
  "/wiki/Darth_Vader_(2020)_20",
  "/wiki/Darth_Vader_(2020)_21",
  "/wiki/Darth_Vader_(2020)_22",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Virujansi",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_Military",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Airen_Cracken",
  "/wiki/Mon_Mothma",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/General",
  "/wiki/Imperial_officer",
  "/wiki/Western_Reaches_pacification_operations",
  "/wiki/The_galaxy",
  "/wiki/Western_Reaches",
  "/wiki/Battle_of_Ogoth_Tiir",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Project_Stardust",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Superlaser",
  "/wiki/Jedha_City",
  "/wiki/Jedha",
  "/wiki/Adjutant",
  "/wiki/Battle_of_Scarif",
  "/wiki/Standard_year",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Darth_Sidious",
  "/wiki/Colonel",
  "/wiki/Julyan",
  "/wiki/Strategy_and_Tactics",
  "/wiki/Arkanis_Academy",
  "/wiki/Jedha_insurgency",
  "/wiki/0_BBY",
  "/wiki/Death_Star",
  "/wiki/Battle_station",
  "/wiki/Director",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Imperial_Military_Department_of_Advanced_Weapons_Research",
  "/wiki/Sotorus_Ramda",
  "/wiki/Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/Superweapon",
  "/wiki/Hyperspace",
  "/wiki/Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Citadel_Tower",
  "/wiki/Kilometer",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Consular_ship",
  "/wiki/Tantive_IV",
  "/wiki/Devastator",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tatooine",
  "/wiki/Death_Star_conference_room",
  "/wiki/Dissolution_of_the_Imperial_Senate",
  "/wiki/Imperial_Senate",
  "/wiki/Cassio_Tagge",
  "/wiki/Admiral",
  "/wiki/Conan_Antonio_Motti",
  "/wiki/Yavin_system",
  "/wiki/Battle_of_Yavin",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Scientist",
  "/wiki/Galen_Walton_Erso",
  "/wiki/Galactic_Emperor",
  "/wiki/Grand_General",
  "/wiki/Cylo",
  "/wiki/Death_Squadron",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Crimson_Dawn",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Han_Solo",
  "/wiki/Sub-Administrator",
  "/wiki/Sly_Moore",
  "/wiki/Force-sensitive",
  "/wiki/The_Force",
  "/wiki/Force_power",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Credit",
  "/wiki/Hair",
  "/wiki/Alcohol",
  "/wiki/Caf",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Gaberwool",
  "/wiki/Rank_insignia_plaque",
  "/wiki/2017",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars_Legends",
  "/wiki/2012",
  "/wiki/Jason_Fry",
  "/wiki/Ian_Selby",
  "/wiki/Ann_Skinner",
  "/wiki/Paul_R._Urquhart",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/2015",
  "/wiki/Servants_of_the_Empire:_The_Secret_Academy",
  "/wiki/2016",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Andy_de_la_Tour",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_Adventures_(2020)_5",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_5",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/An_Incident_Report",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/Doctor_Aphra_(2020)_12",
  "/wiki/Bounty_Hunters_16",
  "/wiki/Star_Wars_(2020)_16",
  "/wiki/Darth_Vader_(2020)_16",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Onager-class_Star_Destroyer_Expansion_Pack",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars_Insider",
  "/wiki/From_Scarif_to_Yavin:_The_Psychology_of_War",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_War_of_the_Bounty_Hunters",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/May_27",
  "/wiki/2018",
  "/wiki/Jedi_Council_Forums",
  "/wiki/May_3",
  "/wiki/April_27",
  "/wiki/November_5",
  "/wiki/April_24",
  "/wiki/January_2"
 ]
}