{
 "name": "Hyne",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Preox-Morlana",
      "Pre-Mor Security Inspection team",
      "Pre-Mor Security Inspection team"
     ]
    }
   ]
  }
 ],
 "content": "Hyne was a human male who served as a Chief Inspector in the Pre-Mor Enforcement Inspection team by 5 BBY. After the Pre-Mor sentry guards Kravas Drezzer and Verlo Skiff were killed, Deputy Inspector Syril Karn made a report on the matter for Hyne, wishing to pursue the matter further. The Chief Inspector, though, ordered for an accident to be conjured, acknowledging Drezzer and Skiff's own offenses and wishing not to draw more attention from the Galactic Empire.\nKarn, however, continued to pursue the case, leading a team to the planet Ferrix to apprehend Drezzer and Skiff's killer, Cassian Andor. The mission was a failure and drew the Empire's attention. Imperial Security Bureau Supervisor Blevin took to the incident and put the Morlani system under Imperial jurisdiction. He briefed Hyne, Karn and Sergeant Linus Mosk on their immediate departure to transfer centers and their responsibility for the Ferrix incident, turning down the Chief Inspector's claim that he had no involvement.\nDuring the time of the Galactic Empire, the human male Hyne was served the Pre-Mor Enforcement, the security detachment of corporate polity known as Preox-Morlana which was based on the planet Morlana One, and rose to the title of Chief Inspector in the Pre-Mor Security Inspection team. In 5 BBY, the Pre-Mor sentry guards Kravas Drezzer and Verlo Skiff were killed in Morlana One's Leisure Zone when they harassed the visitor Cassian Andor. Deputy Inspector Syril Karn made a report on the incident for Hyne. Meanwhile, the Chief Inspector was preparing to attend an Imperial Regional Command review to report on crime rates.\nKnowing that Hyne was departing the Corporate Security Headquarters on Morlana One that morning, Karn completed his report on Drezzer and Skiff's deaths over the night following the incident and arranged a meeting with the Chief Inspector the latter's office. Hyne read through the report, asking about details of the Karn's investigation and remarking that he had been busy. After identifying modifications Karn had made to his own uniform, the Chief Inspector recognized Drezzer's name on the report, commenting on the sentry guard's past and calling him an unpleasant man. The pair then discussed the leads on Drezzer and Skiff's killer, the Deputy Inspector wishing to pursue the case further. Hyne then told Karn to stop, deducing to himself that Drezzer and Skiff had gotten themselves into an unwinnable fight. He asked the Deputy Inspector to conjure up a believable accident for a new report that made the two dead corpos look useful.\nKarn argued that the pair had been murdered, but the Chief Inspector stated that they had gotten into a fight and had broken several rules while they were meant to be on duty. Giving his colleague further instructions on the report, Hyne pointed that Karn looked stricken and made sure that the latter was absorbing the meaning of his request. Hyne further mentioned his meeting with Imperial Regional Command to Karn, adding that the Empire thinking less about Preox-Morlana was more desirable for the polity as well as the inspection team. Having collected his jacket, hat and suitcase, Chief Inspector asked Karn not to put his feet up in his absence and get the report sorted. Hyne thus left the office for he Regional Command review.\nDespite Hyne's request, Karn continued with his investigation, learning that the killer was Cassian Andor, a resident of the planet Ferrix. The Deputy Inspector had Sergeant Linus Mosk assemble a strike team of twelve corpos to apprehend Andor. The sergeant commended Karn and Hyne, the latter he believed to be approving of the investigation, for pursuing the killer of two of their own. However, the team's attempt to arrest the culprit ended in disaster, with as four corpo fatalities and a civilian death. The incident attracted the attention of the Empire's Imperial Security Bureau, and the sector's supervisor, Lieutenant Blevin, took action there, putting the Morlani system under permanent Imperial jurisdiction.\nAs the Empire began clearing stuff from the Corporate Security headquarters, Blevin took gathered Hyne, Karn and Mosk in Hyne's office, giving them instructions on handing in equipment. The three were told that they would immediately be taken to a transfer center and received any personal possessions from their quarters that the Empire had gotten round to inventorying. The supervisor further ordered them to holo-certify receipts as well as their involvement in the Ferrix incident. Hyne insisted that he had nothing to do with it, but was dismissed by Blevin, who scolded the apparent incompetence of the Pre-Mor enforcement.\nA human male, Hyne had light-colored skin, blue eyes, and white hair, including a mustache. As a high-ranking official, Hyne cared about incidents regarding the men serving under him but was not above deception in order to protect himself and those around him. When two of his men, Kravas Drezzer and Verlo Skiff, were murdered, Hyne instructed Syril Karn to lie to the public instead of getting to the bottom of the situation. He justified his actions by pointing out the offenses the late pair had committed and explaining that it would help the Empire stay out of their business.\nHyne wore the standard blue uniform of the Pre-Mor Authority, with orange features.\nHyne first appeared in \"Kassa,\" the debut episode of Tony Gilroy's live-action Disney+ series Andor which was directed by Toby Haynes and was released on September 21, 2022. The character was portrayed by Rupert Vansittart. Hyne was showcased beforehand in promotional images released by The Walt Disney Company on Getty Images.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Preox-Morlana",
  "/wiki/Pre-Mor_Security_Inspection_team",
  "/wiki/Chief_Inspector",
  "/wiki/Pre-Mor_Enforcement",
  "/wiki/5_BBY",
  "/wiki/Kravas_Drezzer",
  "/wiki/Verlo_Skiff",
  "/wiki/Death",
  "/wiki/Deputy_Inspector",
  "/wiki/Syril_Karn",
  "/wiki/Galactic_Empire",
  "/wiki/Planet",
  "/wiki/Ferrix",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Ambush_on_Ferrix",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Supervisor",
  "/wiki/Blevin",
  "/wiki/Morlani_system",
  "/wiki/Sergeant",
  "/wiki/Linus_Mosk",
  "/wiki/Imperial_Era",
  "/wiki/Politics",
  "/wiki/Morlana_One",
  "/wiki/Leisure_Zone",
  "/wiki/Imperial_Regional_Command",
  "/wiki/Corporate_Security_Headquarters",
  "/wiki/Free_Trade_sector",
  "/wiki/Lieutenant",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Kassa_(episode)",
  "/wiki/Tony_Gilroy",
  "/wiki/Disney%2B",
  "/wiki/Andor_(television_series)",
  "/wiki/Toby_Haynes",
  "/wiki/September_21",
  "/wiki/2022",
  "/wiki/Rupert_Vansittart",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/That_Would_Be_Me",
  "/wiki/Aldhani_(episode)",
  "/wiki/Narkina_5_(episode)",
  "/wiki/StarWars.com",
  "/wiki/Reckoning_(episode)",
  "/wiki/Star_Wars",
  "/wiki/September_30"
 ]
}