{
 "name": "Iaclyn_Stark",
 "display_name": "Iaclyn Stark",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Eclipse resort"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Stark family"
     ]
    }
   ]
  }
 ],
 "content": "Iaclyn Stark was a Human male, the son of Iaco Stark and Arris Rossum and the half-brother of Elli Stark.\nIn 3 BBY, Iaclyn lived in the Corporate Sector on Etti IV. He was in charge of all of Iaco Stark's holdings after his presumed death. He gave financial support to his sister Elli and stepmother Dah'lis but wasn't very close to either. Iaclyn constantly tried to force his sister into a marriage for a financial alliance. To force the issue, he prevented Elli from leaving the Corporate Sector.\nIaclyn was present at the Imperial embassy for a party that Jahan Cross and IN-GA 44 attended. He was particularly interesting in the HRD. He had a brief argument with Cross when he ran interference for Elli so she wouldn't have to talk to her brother. Iaclyn warned Cross not to interfere in his business.\nLater that night, after Cross and Dha'lis returned to the Stark Compound, Iaclyn spied on their tryst via cameras. He ambushed Cross and stunned him, and then shot and killed Dha'lis, telling her she had been talking too much. He then went to Cross's quarters with Emesh Nar and stunned Inga with an ion blaster. He ordered his droid Majordomo to ship IN-GA 44 to the Eclipse.\nIaclyn traveled to the Eclipse, and started to reprogram Inga with the Iron Eclipse computer virus. He was interrupted by Majordomo who informed him that Elli and Cross had entered his room at the Stark Compound and were breaking into his personal files. Iaclyn instructed Majordomo to immobilize his sister and kill the Imperial agent. Cross and Elli managed to escape Majordomo's ambush and traveled to the Eclipse space station aboard the Millennium Falcon to confront Iaclyn.\nIaclyn met them in a large room on the space station and Cross proceeded to point a blaster at Stark and demand his surrender. Elli Stark refused to take the chance of losing her only brother, and pointed her blaster at Cross. During this standoff, Iaclyn issued the protocol five order to all the droids in the room and commanded them to kill Cross. Iaclyn explained that the Iron Eclipse virus allowed him to override any droid programming and to give orders to a droid that would otherwise be impossible for the droid to carry out.\nCross was overwhelmed but before he could be killed, Elli pleaded with Iaclyn to spare him. Iaclyn agreed because of his feelings for her. He explained that it was extremely dangerous for her to be on the Eclipse space station and he had been trying to protect her for years. Iacyln revealed the fact Elli was not actually the daughter of Iaco Stark. However, Iaclyn still felt close to Elli because she reminded him of their mother, and did everything he could to keep her safe.\nWhile talking to Elli, Iaclyn was attacked from behind by Iaco Stark and impaled by a blade mounted on one his arms. Iaclyn's corpse was later used as a distraction by Cross when he threw it at Iaco during their fight.\nIaclyn was very protective of his half-sister Elli. He was very ruthless and had no compunctions about ordering the death of people who got in his way.\nIaclyn was a skilled computer programmer and was able to invent a sophisticated computer virus that enabled him to override a droid's command matrix.\nIn Agent of the Empire – Iron Eclipse 1, he is mistakenly identified as Iaculyn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Eclipse_station_(Reltooine)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Stark_family",
  "/wiki/Iaco_Stark",
  "/wiki/Arris_Rossum",
  "/wiki/Elli_Stark",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Etti_IV/Legends",
  "/wiki/Dah%27lis_Stark",
  "/wiki/Imperial_Embassy_(Etti_IV)",
  "/wiki/Jahan_Cross",
  "/wiki/IN-GA_44",
  "/wiki/Human_replica_droid",
  "/wiki/Stark_Compound",
  "/wiki/Emesh_Nar",
  "/wiki/Ion_blaster/Legends",
  "/wiki/Majordomo_(droid)",
  "/wiki/Iron_Eclipse",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Protocol_five",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_1",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_2",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_4",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_5"
 ]
}