{
 "name": "Iaco Stark",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Reltooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Droid body"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Stark Commercial Combine",
      "Commerce Guild",
      "Galactic Republic",
      "Confederacy of Independent Systems",
      "Rossum Droidworks"
     ]
    }
   ]
  }
 ],
 "content": "Iaco Stark was a Human male smuggler and pirate who initiated the Stark Hyperspace War between himself and the Galactic Republic and Trade Federation representatives. After his defeat at the Fifth Battle of Qotile he joined the Commerce Guild.\nYears before the Clone Wars the Republic had known peace for centuries while a few conflicts did burn in scattered patches of the galaxy, none of these conflagrations ever spread into a full-scale war. For this reason, the government came to easily rely on the Jedi Knights, letting its own armies shrink so that the term \"Republic military\" really described forces cobbled together from sector and systems resources rather than a unified galactic body.\nTaking advantage of this complacency was a cunning young pirate named Iaco Stark. The charismatic and bold smuggler maintained a pirate fleet that raided goods and sold them on the underworld market for considerable profit. He was able to undercut the prices of the Trade Federation, and became a folk hero of sorts to other pirates. Under his leadership, a coalition of smugglers, pirates, mercenaries, bounty hunters and assassins emerged in the Outer Rim. Ever seeking out airs of respectability, Stark named this criminal organization the Stark Commercial Combine.\nAt the request of the Trade Federation, the Jedi and Galactic Republic representatives sought to end Stark's campaigns at a conference on Troiken. Paranoid and power-hungry, Stark unleashed a navicomputer virus that crippled the few military ships the Republic had amassed. This led to the Stark Hyperspace War, the last sizable military conflict before the galaxy would become engulfed in a full-scale war.\nBefore the battle, Stark had amassed a fleet of ships and used them to steal goods from the Outer Rim Territories and then sell them back at ridiculously inflated prices . When he saw that he would lose the war, he betrayed his allies.\nAfter the battle ended, Stark joined the Commerce Guild, where he served as a legitimate businessman as of 30 BBY, despite the fact that he was now widely reviled in the Outer Rim. Stark became a business partner to the Tionese business mogul Dominic Raynor and for a time he dated the holo-starlet Riva Denais, though following an incident in the Corporate Sector that involved some Zanibar cannibals and a Sith amulet, Denais was reported missing and Stark had a permanent falling out with Raynor. At some point afterward, Stark acquired the Jubilee Wheel, a space station gambling facility situated in the Bright Jewel Cluster, and he subsequently launched a lawsuit against the Wheel, a rival luxury space station that was operated by Raynor. Stark accused the Wheel's operators of 5,073 counts of copyright infringement relating to similarities between the Wheel and the Jubilee Wheel, but Raynor successfully defended the case and proceeded to launch a counter-claim against Stark, seeking damages for suffering and emotional duress. However, after Stark enlisted the help of the celebrity attorney Qimberly Gaitag-Delio, Raynor was forced to give up control of the Wheel. During this time, Stark married Arris Rossum.\nStark had served with the Commerce Guild throughout the Clone Wars, but again changed allegiances when he saw that his side was losing. The day after the Battle of Coruscant, he jumped ship and fled to the Corporate Sector.\nAfterwords, Stark set up Rossum Droidworks and made a fortune selling droidekas and other droids throughout the sector. He fell fatally ill and became obsessed with creating the Eclipse station at Reltooine. It was there that he was decapitated in an industrial accident in 5 BBY and presumed dead.\nWhen Jahan Cross and Elli Stark infiltrated the spacestation, they were confronted by Iaclyn Stark who attempted to warn Elli that she was in grave danger. Iaclyn warned her Iaco was still alive because Iaclyn had grafted his head onto a droid body. Before he could convince her, he was killed by Iaco Stark. Iaco stated that he killed Iaclyn because he was flesh and blood and therefore weak. This was the same reason he chose to be grafted to a droid body instead of a clone. He re-initiated protocol five and ordered the droids present to kill Elli. She and Cross managed to reach the door of the room and attempted to escape only to find themselves face-to-face with IN-GA 44. Iaco ordered her to kill Cross and Elli, starting with Cross first.\nIaco ordered the droids under his control to subdue Elli while watching IN-GA 44 fire on Cross. He explained his plan for using the Iron Eclipse virus to take over the Galaxy to Cross but became upset when Inga was unable to kill Cross due to the deeply ingrained programming that prevented her from harming Cross. When Cross suggested Inga could eliminate both Cross and Stark by disabling the repulsorlift generators that kept Eclipse station aloft, Stark ordered all the droids under his command to chase down and stop Inga. Cross threw the corpse of Iaclyn at Iaco to distract him while the agent climbed on the back of Iaco's droid body. When Cross tried to strike Iaco in the head with a tool, Stark closed the faceplate on his helmet. Cross then used the tool he was wielding to damage the optical sensors on the faceplate. Stark opened his mask to see and continued to fight Cross. Iaco threatened to go kill Elli in hopes that it would cause Cross to make himself vulnerable.\nThe Imperial agent had other ideas, and lodged a fusioncutter in a cargo sled loaded with fuel cells and sent it on a collision course with Iaco. The resulting explosion knocked Iaco on his back and damaged several of the legs on his droid body. Cross left to try and escape from the sinking spacestation, assuming Stark to be dead. As the Imperial agent jumped aboard the Millennium Falcon to flee the dying station, he heard Stark call his name. Cross quickly entered the ship through the dorsal hatch and sealed it behind him, stranding Stark on top of the Falcon's hull. Han Solo inquired what the extra weight was on his ship and warned the crew it might prevent them from escaping the gravity well of the planet. Cross quickly climbed into the dorsal quad laser cannon and proceeded to blast Iaco Stark in the face, killing him and knocking his corpse off the ship.\nStark's droid body was a large dark blue oval with red highlights. It had eight total limbs; two arms with blades attached to them and six legs. Iaco's face was protected by a drop down faceplate that featured eleven red sensors.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Reltooine",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Stark_Commercial_Combine",
  "/wiki/Commerce_Guild/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Rossum_Droidworks",
  "/wiki/Tam_Gozon",
  "/wiki/Star_Wars:_Republic:_The_Stark_Hyperspace_War",
  "/wiki/Smuggler/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Stark_Hyperspace_War/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Fifth_Battle_of_Qotile",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Troiken/Legends",
  "/wiki/Navcomputer_virus",
  "/wiki/30_BBY/Legends",
  "/wiki/Tionese_(people)",
  "/wiki/Dominic_Raynor",
  "/wiki/Riva_Denais",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Zanibar",
  "/wiki/Sith_amulet",
  "/wiki/Jubilee_Wheel_(space_station)",
  "/wiki/Bright_Jewel_Cluster/Legends",
  "/wiki/The_Wheel/Legends",
  "/wiki/Lawyer/Legends",
  "/wiki/Qimberly_Gaitag-Delio",
  "/wiki/Arris_Rossum",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Droideka/Legends",
  "/wiki/Eclipse_station_(Reltooine)",
  "/wiki/5_BBY/Legends",
  "/wiki/Iaclyn_Stark",
  "/wiki/Protocol_five",
  "/wiki/Fusioncutter/Legends",
  "/wiki/Millennium_Falcon_(novel)",
  "/wiki/Millennium_Falcon_(audiobook)",
  "/wiki/Star_Wars_(1998)_36",
  "/wiki/Star_Wars_(1998)_37",
  "/wiki/Star_Wars_(1998)_38",
  "/wiki/Star_Wars_(1998)_39",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_1",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_2",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_4",
  "/wiki/Agent_of_the_Empire_%E2%80%93_Iron_Eclipse_5",
  "/wiki/Category:Images_of_Iaco_Stark",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_56",
  "/wiki/The_Official_Star_Wars_Fact_File_89",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Wizards.com",
  "/wiki/Meet_Iaco_Stark:_An_Expanded_Universe_Character",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Tinker,_Tailor,_Soldier,_Praji",
  "/wiki/StarWars.com",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_33",
  "/wiki/Databank_(original)",
  "/wiki/Millennium_Falcon_Owner%27s_Workshop_Manual",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Viva_Space_Vegas!_The_History_of_the_Marvelous_Wheel"
 ]
}