{
 "name": "Ianna_Cel",
 "display_name": "Ianna Cel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Taris Resettlement Initiative",
      "Taris Resettlement Initiative"
     ]
    }
   ]
  }
 ],
 "content": "Ianna Cel was a Human female doctor who was employed by the Galactic Republic during the Cold War.\nDoctor Cel was assigned to Waypoint Station Aurek on Taris during the reconstruction, where she was researching the rakghoul plague and treating Republic personnel who may have been contaminated.\nWhile stationed at Aurek, Cel was in a meeting with members of her team, consisting of an expert diagnostician, senior virologist, junior biologist, and offworld xenobiologist. A traveling hero caught her attention and she ended the meeting. Speaking with the hero, she hired them to assist in recovering an old sample of the rakghoul serum. She asked the hero to get a sample of the serum from the Death's Claw pirates, who had raided the ruins of the privately-owned Sepanik Memorial Hospital.\nWhen given the anti-virus, she realized it was outdated, and it would only protect a very strong individual temporarily. She asked the hero to take the serum and then get purposely infected with the plague. After doing so the hero was sent to Waypoint Station Draay to be analyzed by the medical droid there. The experiment proved to be a success and Doctor Cel told the hero she would begin synthesizing a cure for Republic personnel, and later a version to sell to the civilians of Taris.\nWhen the Empire invaded Taris, intend to crush Republic's reformation efforts, Cel encountered a new problem in a rogue Jedi Ki Sazen. Sazen fell to the dark side and killed Cel's colleagues Doctor Vernon and Professor Sadus Vraal when they proved unable to fix the Ultrawave Transmitter - a device created by Nasan Godera that could be used to control the rakghouls. Believing herself to be the last rakghoul expert on Taris, Cel escaped to the ruins of the Dynamet General Hospital and hid there from Sazen for weeks, until she was contacted and found by Republic Strategic Information Service agents \"Chance\" and \"Legate\". Unknown to her, Legate\" was an undercover Imperial Agent Cipher Nine, who used Cel to get to Sazen and the Ultrawave Transmitter. Cel trusted the Agent and planned to use herself as a bait to lure Sazen out, before being interrupted by Doctor Eckard Lokin, who offered to go in her place instead.\nIanna Cel was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. She gives Republic characters the mission \"Pirate Medicine\", where she asks them to recover a rakghoul serum from pirates, and upon its completion gives them another mission: \"Catalyst\". Cel asks the player to help gather information about the serum by letting themselves be infected with the rakghoul plague.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Taris_Resettlement_Initiative",
  "/wiki/Doctor/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Tower_command_station",
  "/wiki/Taris/Legends",
  "/wiki/Rakghoul_plague",
  "/wiki/Rakghoul_serum",
  "/wiki/Death%27s_Claw",
  "/wiki/Sepanik_Memorial_Hospital",
  "/wiki/Bomber_command_post",
  "/wiki/Jedi/Legends",
  "/wiki/Ki_Sazen",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Vernon",
  "/wiki/Professor/Legends",
  "/wiki/Sadus_Vraal",
  "/wiki/Ultrawave_Transmitter",
  "/wiki/Nasan_Godera",
  "/wiki/Dynamet_General_Hospital",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Imperial_Agent",
  "/wiki/Cipher_Nine",
  "/wiki/Eckard_Lokin",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011"
 ]
}