{
 "name": "Ibdun_Dand",
 "display_name": "Ibdun Dand",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarsunt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Resistance ground crew",
      "Resistance ground crew"
     ]
    }
   ]
  }
 ],
 "content": "Ibdun Dand was a Tarsunt male and the father to Resistance controller Vober Dand. While Ibdun was originally against his son joining the Resistance, fearing what might happen, he eventually joined himself after the Hosnian Cataclysm. Dand served as part of the ground crew alongside his son and celebrated with him and the rest of the Resistance following their victory at the Battle of Exegol.\nIbdun Dand was a Tarsunt male who initially forbade his son Vober Dand from joining the Resistance during their Cold War against the First Order; however, Dand disobeyed him and became a controller in the Resistance's Ground Logistics Division. After the First Order destroyed the entire Hosnian system during the Hosnian Cataclysm in 34 ABY, Ibdun joined his son as a member of the Resistance, serving alongside him in the ground crew.\nIn 35 ABY, he was amongst the personnel that was stationed in the Resistance base on the jungle moon of Ajan Kloss. As the Jedi Rey was joined by her allies while preparing to leave for the planet Pasaana on board the Millennium Falcon YT-1300 light freighter, Ibdun was working on a T-70 X-wing starfighter parked nearby. After the Resistance and its allies later defeated the First Order and the Sith Eternal above the planet Exegol, both Dands joined in with the celebrations that took place at the base. During the celebration, the Kessurian thilas Wilsa Teshlo patted Ibdun on the back while he stood with Vober and the pair cheered in celebration.\nIbdun Dand initially forbid his son from joining the Resistance because he feared the worse, but after the Hosnian Cataclysm revealed the ruthlessness of the First Order he came to appreciate his son's bravery. While serving in the Resistance he learned more about his son from the people they both worked with. Ibdun had gray skin, black eyes and graying hair typical of an ageing Tarsunt.\nIbdun Dand wore a yellow jumpsuit with a brown belt and gloves and an orange headset.\nIbdun Dand first appeared in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tarsunt",
  "/wiki/Smotl",
  "/wiki/Ib-Dunn",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Resistance_ground_crew",
  "/wiki/Parent",
  "/wiki/Controller",
  "/wiki/Vober_Dand",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Battle_of_Exegol",
  "/wiki/Cold_War",
  "/wiki/First_Order",
  "/wiki/Ground_Logistics_Division",
  "/wiki/Hosnian_system",
  "/wiki/34_ABY",
  "/wiki/35_ABY",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Jungle",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/Jedi",
  "/wiki/Rey_Skywalker",
  "/wiki/Planet",
  "/wiki/Pasaana",
  "/wiki/Millennium_Falcon",
  "/wiki/YT-1300_light_freighter",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Sith_Eternal",
  "/wiki/Exegol",
  "/wiki/Kessurian",
  "/wiki/Thilas",
  "/wiki/Wilsa_Teshlo",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Glove",
  "/wiki/Headset",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY"
 ]
}