{
 "name": "Ichi-Tan Micoda",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Geonosis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ichi-Tan Micoda was a male Human Jedi Knight serving the Jedi Order and the Galactic Republic during the final decades of the Republic Classic era. A Jedi Consular, Micoda worked closely with the Republic Diplomatic Corps.\nLike most of his peers, Ichi-Tan Micoda was probably discovered to be Force-sensitive in infancy and delivered to the Coruscant Jedi Temple for training in the ways of the Force. Sorted into a learning clan at the Temple academy, Initiate Micoda studied tirelessly in the Temple Archives to ensure that he passed his Trials to make up for his lack of talent in lightsaber combat. Despite graduating at the bottom of his class, Micoda passed none the less, as his teachers were impressed with his thorough understanding of galactic law. Selected to be Padawan by a Master who could expand on Micoda's burgeoning passion for political studies, Micoda became adept in the field of communication and negotiation. Constructing a blue lightsaber for himself, Micoda's Master eventually taught the boy everything he knew. Passing his Trials of Knighthood, Micoda continued his studies as a Jedi Knight, delving into the lore of the Jedi Consulars. Working under the guidance of the Council of Reconciliation with the Republic Diplomatic Corps, Micoda was most always stationed on Coruscant and could be found in the Third Hall of the Archives researching the politics and governments of a thousand star systems.\nIn 22 BBY, the rising tensions between the Galactic Republic and the Confederacy of Independent Systems came to a head when Knight Obi-Wan Kenobi, Padawan Anakin Skywalker and Senator Padmé Amidala were arrested on Geonosis and sentenced to death by the Separatist Council. Master of the Order Mace Windu assembled a massive strike team to rescue the captives, and Micoda was ordered to join. Landing on the plains of the desert world just outside the Petranaki arena, Micoda and his brother and sister Jedi stormed the complex, igniting his lightsaber amongst the many spectators that filled the arena's stands. Having never been a gifted swordsmen, Micoda hoped to gain the upper hand on the Separatist Droid Army by employing his unorthodox style of swift strikes and penetrating strokes. However, this tactic failed to defend Micoda from the sheer number of blaster rifles aimed at him. While fighting bravely, Micoda was ultimately overpowered and shot down by multiple assailants.\nIchi-Tan Micoda was portrayed by Marc Wendt in Attack of the Clones. As Wendt recounts in an article on StarWars.com, he was only a background extra seen for all of 36 frames on film, but the Lucasfilm Holocron database later expanded his character.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Jedi_Consular",
  "/wiki/Republic_Diplomatic_Corps/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Initiate_Clan/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Council_of_Reconciliation/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Separatist_Council",
  "/wiki/Master_of_the_Order/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Geonosis_strike_team",
  "/wiki/Petranaki_arena",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Marc_Wendt",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/StarWars.com",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Holocron_continuity_database",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Leland_Chee"
 ]
}