{
 "name": "Iden_Versio",
 "display_name": "Iden Versio",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vardos"
     ]
    },
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Retribution",
      "Starkiller Base system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Royal Imperial Academy",
      "Black Squadron",
      "Inferno Squad",
      "Royal Imperial Academy",
      "Black Squadron",
      "Inferno Squad",
      "Dreamers",
      "Alliance to Restore the Republic",
      "Danger Squadron",
      "Danger Squadron",
      "New Republic",
      "Inferno Squad",
      "Inferno Squad",
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Iden Versio was a human female soldier who served in the military of the Galactic Empire. A TIE fighter pilot in the Imperial Starfighter Corps, Iden became Commander of Inferno Squad, an Imperial Special Forces commando unit assembled by her father, Admiral Garrick Versio, in response to the destruction of the Death Star. Along with Agents Gideon Hask, Del Meeko, and Seyn Marana, she infiltrated the Dreamers and successfully destroyed them, though Marana died in the mission. Inferno Squad would later go on to participate in and conduct special operations for the Empire in the Galactic Civil War, and, in 4 ABY, participated in the Battle of Endor, which saw the death of Emperor Palpatine and the destruction of the second Death Star, resulting in the fracturing of the Empire with the lack of a line of succession and broken chain of command.\nIn the immediate aftermath of the battle, the secret Contingency was activated, and Messenger droids carried the final posthumous orders of the Emperor to select Imperial officers, among them Admiral Versio: Operation: Cinder was to begin at once. However, when climate disruption arrays targeted the Versio homeworld of Vardos as part of Operation: Cinder, Iden and Meeko both went rogue, escaping aboard the Corvus and surrendering to the Rebel Alliance. Iden and Meeko both agreed to help the Rebellion combat Operation: Cinder at the Battle of Theed, and ultimately decided to defect to the Rebellion and join the New Republic.\nRetaining her rank of Commander of Inferno Squad, Iden fought against the Imperial remnants throughout the final year of the Galactic Civil War, making attempts to capture Hask and her father. Inferno fought at the Battle of Jakku, where Iden and Shriv Suurgav answered several distress calls and fought against Hask, who was shot down by Iden. She later attempted to save her father aboard the Eviscerator, but her father declined her rescue attempt, choosing to go down with his ship, though he made peace with Iden in his final moments. Iden fled in an escape pod, crash landing on Jakku and reuniting with Del and Shriv.\nIden and Del went on to marry and had a daughter named Zay Versio. Twenty-nine years after the Battle of Jakku, Del went missing, and Iden, accompanied by Shriv and Zay, went in search of him. This led them back to Vardos, where they were met by Hask, who had survived the Battle of Jakku and become an officer of the First Order. He revealed to her that he had killed Del; and during a skirmish aboard his Resurgent-class Star Destroyer Retribution, during which they stole schematics for the First Order Dreadnought, he attempted to kill Zay as well, but Iden killed him first. Before his death, however, he managed to fatally wound her. Iden died in her daughter's arms as the Retribution came out of hyperspace into the Battle of Starkiller Base. Zay and Shriv went on to deliver the plans for the First Order dreadnought to the Resistance, whereupon Poe Dameron used them to take down the Fulminatrix during the evacuation of D'Qar.\nIden Versio was born and raised in the city of Kestro on the Core Worlds planet Vardos during the reign of the Galactic Empire. She was the daughter of Garrick Versio, an admiral in the Imperial Security Bureau; and Zeehay Versio, a premier artist in the Coalition for Progress who contributed to the design of propaganda posters. Following her father's example, Iden trained to become a soldier of the Empire, and to that end attended the Future Imperial Leaders Military Preparatory School on Vardos, and following that enrolled in the Imperial Academy on Coruscant, the Imperial capital world. Iden later graduated from the Imperial Academy with honors, at the top of her class.\nAssigned to the Death Star as a Senior Lieutenant, Versio was present for the Destruction of Jedha City in 0 BBY, in which Jedha City, an ancient city located on the desert moon Jedha, was destroyed by the Death Star's superlaser. The ensuing destruction also obliterated the ancient Temple of the Kyber, and killed Saw Gerrera and his group of rebels known as the Partisans.\nShortly after the destruction of Jedha City, Iden was present for the Battle of Scarif, in which the Death Star's superlaser was used to destroy an Imperial facility which had been infiltrated by rebels, who sought to steal the Death Star plans which were present at the Imperial facility. The ensuing blast wiped out an entire region, along with several rebel ships which had been trapped within Scarif's shield, though rebels on the ground were able to transmit a copy of the plans to a rebel ship in orbit. The plans were then transferred to a blockade runner under the command of Princess Leia Organa.\nAfter the capture of Organa, her home planet Alderaan was chosen by Grand Moff Wilhuff Tarkin as a suitable test of the Death Star's superlaser. Upon its arrival in the Alderaan system, the superlaser was charged, and on Tarkin's order fired, destroying Alderaan. As most personnel aboard the Death Star had been ordered to do, Iden looked on at the destruction of Alderaan.\nShortly after the destruction of Alderaan, Tarkin moved to destroy the moon of Yavin 4 and, with it, the Rebel leadership. In the ensuing Battle of Yavin, the Rebel Alliance launched fighters to attack the Death Star, resulting in Iden, under the callsign TIE Sigma Three, being deployed to intercept them as part of Black Squadron. When Iden's commander, Kela Neerik, informed the squadron that the Death Star was six minutes from firing range, Iden believed the Rebel fighters presented no threat to the Imperial station and questioned their deployment, but once she was warned not to waste Darth Vader's time, she kept silent and followed orders. During the course of the battle, Iden shot down several Rebel fighters. Ultimately, rebel pilot Luke Skywalker was able to fire a pair of proton torpedoes down the Death Star's thermal exhaust port, which triggered a chain reaction resulting in the battle station's destruction.\nThe Death Star exploded just as Versio was locking onto the BTL-A4 Y-wing starfighter piloted by Evaan Verlaine. Following the Death Star's explosion, Iden's TIE fighter was struck by debris from the station, causing her to lose control of her TIE. Barely able to dodge the debris from the battle station, Iden crash-landed on Yavin's moon, Yavin 4. There, she was able to steal a ship while the rebels celebrated their victory and returned to Imperial lines.\nIn response to the destruction of the Death Star, Garrick assembled Inferno Squad, which consisted of Iden, Gideon Hask, Del Meeko, and Seyn Marana. To determine who will be the initial leader of the squad, Garrick told each squad member to formulate a plan for their first mission; to expose Moff Jaccun Pereez for espionage. Determined to become the leader, Iden furiously planned and was chosen to lead the squad on the first mission. Iden's plan saw the squad infiltrate the wedding of Pereez's daughter Famma in pairs, with Iden and Hask giving Pereez, who was known to like various liquors, a drugged bottle of rare wine while Marana and Meeko recovered a datapad from this mansion. When the mission was a success, Iden was granted continued leadership privileges and was promoted to Captain. The squad also was granted a ship, the Raider-class corvette Corvus.\nOn their second mission, the squad was sent undercover to retrieve data from Bokk Naarg, an Imperial informant who worked with the Partisans. Iden led the mission from the Corvus while Hask was sent in to make contact with Naarg, but when Marana noticed Naarg and his companions were equipped with suicide bombs, Iden decided to go in to support Hask wearing stormtrooper armor. However, the bombs were detonated, with Iden and Hask barely escaping with a datachip and failing to bring in Naarg alive.\nTheir first significant mission was to neutralize the Dreamers, a rebel group that had risen from the ashes of the Partisans. Each squad member was given a different route to proceed to join the Partisans, with Iden pretending to defect from the Empire due to her attitude towards the Destruction of Alderaan. Iden wanted to tell her mother Zeehay of the plan, but Garrick insisted that for the deception to work, only the squad could know of the circumstances. Ultimately, Iden played her part and was arrested by Imperial officer Tarvyn Lareka after she told him that she was beginning to hate the Empire and what it stood for after the Death Star destroyed Alderaan. Iden was arrested for treason and, by Garrick's design, sent to be imprisoned on her homeworld of Vardos, where Gleb, the headmaster of the Future Imperial Leaders Military Preparatory School on Vardos, who was informed of the plan, would watch over her and make sure she was allowed to be rescued by the Dreamers. Iden, while being transported in a shuttle to the Dreamers' encampment on Jeosyn. In a short ceremony, she was introduced to the other members of the cell including The Mentor, Dahna, and Staven. Because of her life as a TIE Pilot, Iden was not trusted as much as the other members of the squad. She was ordered to clean and fix the armor of stormtroopers.\nEventually, the Mentor asked her to give a speech on the Holonet about the Empire's evils. She was to do this while standing over a stormtrooper who was guarding a small supply depot. Iden hated the idea of mocking a fellow Imperial to the Galaxy while he was slowly dying, but she was saved from this when the trooper died. After this, Dahna told her a gruesome truth. The bodies of the stormtroopers were fed to large scavengers called Crunchers. Dahna then invited her to practice marksmanship and go on a supply run. Iden denied the supply trip and got into contact with the rest of the squad with Del's droid. Now all of the squad could contact each other from distance without senior members listening in. Seyn contacted her about Lar Kantayan, an Imperial agent, in disguise as Azen Novaren. This puzzled Iden as he was the one who had brought her to the Dreamers. Seyn believed he was either a double agent or trying to bide his time in the Dreamers to get back in the ISB's good graces.\nAnother turning point in the mission would come after Seyn accidentally revealed that she could speak more languages than she had claimed. The Dreamer's accused her of being an Imperial spy, and Staven threw a vibroblade to Iden, telling her to interrogate her. Seyn then lunged at Iden and impaled herself on the blade, killing herself to keep the mission secret. Another big break for Inferno Squad was the entire Dreamers leaving the hideout. Iden went into the Mentor's bedroom and found his journal on a datapad. After slicing it, she read for a few hours and was shocked by the information she had digested. Later that night, the Mentor and Staven got into an argument about someone going through the Mentor's space. Staven then asked Gideon to kill the Mentor, as he was finally too tired by him. Iden followed the Mentor to the perch behind the amphitheater. Even though he had no way of seeing her without night goggles, the Mentor called out to her. He confessed about his info leak, and Iden thought about killing him and running, but sat and listened. He told her his whole story about joining the Dreamers. When he was done, she shot him and took the chip. She ran back to the main section of the hideout and discovered the bodies of all the Dreamers. Iden was outraged at Hask for disobeying her. Then, the large amount of mysterious statues in the caverns came to the hideout, coming to dispose of the dead.\nHer father grilled each of them during the debriefing for losing Seyn. However, the Admiral decided to grant Seyn a Posthumous Black Laurel for Service to the Empire and separate commendations for the rest of the team. Iden asked about her mother and Garrick was saddened to tell her that her mother had died three weeks after the squad had left. Her only joy was knowing that her father had told Zeehay about Iden's true loyalties. Iden slogged back to her private quarters and sobbed over the loss of so many individuals with whom she had grown close.\nInferno's next mission was to simply locate and kill blackmailers of a Moff. Iden conversed with Meeko about converting Piikow over to an Imperial scientist, but Iden whispered for him to be quiet. Iden brought out Tevraki whiskey and reminisced over their first toast. Del cleared his throat and uttered what Seyn had said that night. She then gave a toast to Inferno Squad.\nAround 4 ABY, Iden was willingly captured by the Alliance to Restore the Republic, planning to delete intercepted Imperial transmissions. She escaped the Invincible Faith with the help of Del Meeko's ID10 seeker droid after deleting Moff Raythe's intercepted transmission regarding the Imperial Fleet's position at Endor. After reuniting with Inferno Squad, they were sent to the Endor system.\nIden led Inferno Squad in the Battle of Endor and witnessed the destruction of the second Death Star. Knowing they were defeated, Inferno Squad looked to her for direction. Iden led several squads of stormtroopers to take an Imperial landing pad the rebels were attacking. After defeating a hijacked AT-ST, Inferno Squad fled in the remaining TIE fighters on the platform. In space, the Corvus's engines had been damaged, leading the captain to reroute power from the shields. Inferno Squad defended it from Y-wing bombers until its engines were back online. The Corvus then retreated to the rendezvous point with the remainder of the Imperial fleet at Endor. Iden led her troops to avenge their Emperor by hunting down the people responsible for his demise and the destruction of the second Death Star, namely Luke Skywalker.\nInferno Squad's next orders were to head to the Fondor shipyards to protect the Dauntless, while it retrieved experimental satellites for Operation: Cinder. During their stay, a small rebel fleet composed of one MC80 Star Cruiser, multiple CR90 corvettes, and several squadrons of starfighters arrived in system. The MC80's ion cannons disabled the Dauntless. Inferno Squad's TIE fighters launched, and Iden destroyed one CR90 and several U-wings that were trying to board the Destroyer. After receiving orders from Moff Raythe to destroy the cruiser's ion cannons, Iden and Hask boarded the ship and destroyed its cooling cells. Iden ejected the last cooling cell into space, which disabled a CR90. The corvette crashed into the ship, and Iden and Hask narrowly survived only by having ID-10 turn on the shields again. Iden then returned to her ship in the hangar and disabled the docking clamps of the shipyard. With his ship now free, Raythe ordered a full salvo of turbolasers on the MC80A, destroying it.\nAfter the Battle of Fondor, Inferno Squad was ordered to destroy one of the Emperor's personal observatories on the uncolonized world of Pillio. She ordered Agent Meeko to accomplish the mission. Unknown to her, however, Meeko came across an unlikely ally during the mission and decided not to destroy the observatory. After Del's mission, Iden briefed Inferno Squad on their next task: to extract Gleb from Vardos. They were told this was an element of the Emperor's contingency plan Operation: Cinder, but were not given further details about the mission.\nUpon arrival to Vardos, Iden learned Admiral Versio had deployed satellites above the planet to conjure an electrical storm as part of Operation: Cinder. Iden was furious, feeling the extermination of a people loyal to the Empire was immoral and unjustified. The Admiral ordered her to carry out the mission, clarifying that she was only to extract Gleb and nobody else. When Inferno Squad reached the Archive, where Gleb was waiting, an explosion caused by the electrical storm broke off some debris from the inside of the palace, crushing some citizens. Unable to stand the situation any longer, Iden and Meeko disobeyed Admiral Versio's orders and offered to evacuate some of the citizens via their ship, the Corvus. Gideon Hask, however, was adamant that they follow the original plan. Unbeknownst to Iden and Meeko, Hask had been given orders to kill them if they defected. When Hask drew his weapon to fire, Iden quickly disabled him by shooting him in the leg. Now traitors to the Empire, Iden and Meeko fought their way through Vardos to make it to the Corvus and escape.\nAlong the way, they stole an Imperial AT-AT and used it to destroy several anti-aircraft cannons that were targeting civilian shuttles trying to flee. After destroying the satellite dish, all turrets in the city were shut down. After destroying several AT-STs and TIE fighters and finally reaching the Corvus, Iden and Meeko defended the ship with crew members that chose to stay loyal to her, until the ramp was lowered and the Corvus escaped the system.\nAfter they escaped Vardos, Meeko and Iden contacted the Rebellion and surrendered. Shriv Suurgav, a Alliance officer, and Lando Calrissian talked with the now defected Inferno Squad, about either living a new life, or joining the fight against the Empire. Meeko and Iden joined the fight against the Empire's contingency plan on Naboo.\nIden and a fleet of other Rebel pilots engaged in the fight against a Star Destroyer and the weather satellites above the planet. Iden was successful in destroying the satellites, but she knew about an Imperial protocol that called for a jump to a safe location, and in this case, the target was Theed.\nOnce planetside, Iden met with General Leia Organa, where she was instructed to repair the power relays that would activate an ion pulse, deactivating all electronics in the surrounding area. With their weapons either destroyed or disabled, the Imperial forces immediately surrendered. After the battle, Iden, Meeko, and Leia formally met, to which Organa chastised them for all they had done to the Alliance. Iden apologized, and owned up to the facts that what she did was inexcusable, but she wanted to fight for what was right. Leia accepted her offer and welcomed Iden to the New Republic.\nSix months later, Iden received a call from Organa, asking her to find the missing General Han Solo on Takodana. Iden and Del arrived and helped him deal with some Imperial forces, allowing the smuggler and his partner Chewbacca to escape and prepare for the eventual liberation of Kashyyyk. They regrouped at the Corvus, where Iden spoke with Organa again, discussing the Imperial forces on Bespin and Sullust, and giving Iden the hope that her father could possibly be captured, and stopped. Organa agreed that this would be a huge advantage for the New Republic.\nIden and Meeko later traveled to Chinook Station on Bespin looking for Hask and bent on destroying a vital refueling station. Hask was overseeing a refuel operation on Admiral Versio's fleet. Iden and Meeko believed Hask could help them track down the Admiral. The two landed at the station, and went undercover as Stormtroopers. They traveled across the station and up the tower, but to their dismay, Hask had anticipated their arrival and had already evacuated leaving a message for them. Iden and Meeko fought their way through an ambush, successfully destroying one AT-ST. The X-wing starfighters where they had docked were too far away, so they settled on a cloud car. They then flew to the refueling station, destroying it and causing a chain reaction that annihilated the three Star Destroyers docking there.\nIden and Meeko regrouped with the crew of the Corvus, where she briefed Shriv, who later accompanied Calrissian, on an infiltration mission to an abandoned weapons depot on Sullust, where they were to steal weapons cache. Although the weapons were not recovered, Calrissian destroyed the factory to prevent the weapons from falling into Imperial hands. Iden picked up the two from an AT-ST that was close to being swallowed up by lava.\nRight after the destruction of the facility, Iden was informed by Admiral Gial Ackbar that all Republic ships were to go to Jakku, where the rest of the Imperial Navy was waiting.\nDuring the battle, Iden helped out the Republic by rescuing the crew of a downed CR90 under attack by Imperial walkers. Iden grabbed some macrobinoculars and ordered an orbital strike from the Unity. The rest of the crew retreated to the evacuation zone. Iden defended them from several shuttles and AT-ST until the Corvus evacuated them. She also went with Shriv to a downed Star Destroyer that was still launching TIE/sa bombers that were pinning down New Republic forces trying to assault an imperial base on Carbon Ridge. Iden and Shriv successfully planted charges in the hangar and shut it down. After helping the distress signals Iden flew back to the Corvus to discover from Meeko that her father had found them. The Corvus was disabled by some TIE fighters from Garrick's ship, as he was going to destroy it. Iden took out the fighters that were headed towards the Corvus, and seemingly defeated Hask in a lengthy dogfight. Iden's burning passion for her father led her to board the ship, and try to save him. While doing so, she crashed her X-wing on the hull of the destroyer, and almost fell. She climbed up through the gaping holes in the ship, and fought her way towards the bridge, where she met her father. Garrick recognized this as a rescue mission, but could not accept it, as he knew his daughter was much stronger than he was and that Gallius Rax also expected him to escape, stating Iden saw the weakness in the Empire, and didn't let it consume her and for her to live the life she deserved. Iden came to terms with him and the fact that her father was not leaving his post, and jettisoned an escape pod just as the destroyer crashed into the desert and was obliterated.\nMeeko found Iden's downed pod and helped her out. They then shared a kiss. Meeko told Iden that they had won the war, and it was all over. The moment was interrupted by Shriv, who invited them to come see the end of the battle and the final nail in the coffin for the Galactic Empire.\nFollowing the end of the Galactic Civil War, Iden married Meeko and they had a daughter together. However, twenty-nine years after the Battle of Jakku, Meeko went missing and Iden went in search of him. The First Order had discovered Del knowing the location of the man who possessed the map which would take them to Luke Skywalker's hideout, and so Kylo Ren was dispatched to retrieve the information. Successful in his interrogation, Ren ordered Hask, now a First Order officer, to clean up the mess. After a brief banter, Hask executed Del aboard the Corvus and ordered Gleb to cover up everything, except leave the ship for Iden to find on Pillio in order to lure her to Vardos.\nShortly after the death of Del Meeko, Resistance soldier and friend of Iden, Shriv Suurgav found the Corvus abandoned on Pillio. With the crew and Del gone, Shriv worried by this contacted Iden, who was flying in an asteroid field with her daughter, Zay. The duo then made their way to the Corvus, where Shriv told Iden and Zay the situation. The three began their search for Del, which led them to the planet Athulla, where they received a transmission from an Athullan asking if they found his people, only to realize they weren't Del. Before learning more on what the mysterious \"Project: Resurrection\" was, the transmission was cut off by a Jinata Security fleet commanded by Leema Kai, who had led the kidnappings of Athullans.\nIden and Zay managed to disable the fleet and eliminate Leema, with the J-Sec fleet surrendering and telling them about \"Resurrection,\" after Zay threatened to fire the Corvus's concussion missiles, which turned out to be a bluff.\nThis led them to believe Protectorate Gleb was holding Del prisoner on Vardos, where the Corvus headed next. After landing on the planet, they discovered the scars left behind from Operation: Cinder thirty years ago, as they were walking through the ruins Shriv and Iden spotted a bright red flash out in the distance. Making their way to the place where Del was supposedly being held, the two found Gleb dead on the floor, who was executed by Hask for failing to keep Project: Resurrection confidential, stating she had \"Outlived her usefulness and purpose to the First Order.\" He also taunted Iden stating he had waited for the day he could get revenge on her for her and Del defecting 30 years prior, revealing that he had killed Del and then would kill Zay next, stating the Republic's time was over and the First Order would rise up, with Iden realizing the flash of light she had seen earlier was the destruction of the New Republic thanks to Starkiller Base. To her horror, the Corvus was fired on and shot down by Hask's flagship, the Retribution. With confidence in his plans, Hask ordered Iden and Shriv to be interrogated and then executed, as well as the city burned.\nAs Iden and Shriv were escorted out of the building, fighting erupted between J-Sec and the First Order, giving Iden and Shriv an opportunity to escape to see if Zay had survived the crash of the ship. While fighting through both factions, they were able to discover several escape pod distress beacons, thanks to Iden's ID-10 Seeker Droid, whom Iden had named Dio. Going through the escape pods, they eventually reunited with Zay, who had set up a snipers nest. After the fighting was over Iden told Zay that Hask had killed Del and that she had a plan to board his ship and kill him, but Zay talked her down, telling her it wouldn't bring Del back. The crew then altered the plan and decided to board Hask's flagship in order to deliver any useful information to the Resistance.\nStealing two First Order TIE fighters, the company made their way to the Star Destroyer but discovered they were unable to make an ordinary landing. The Star Destroyer's crew eventually became suspicious of the unusual behavior and attacked them. After a period of dogfighting, Dio found an entrance into the ship through a heat exhaust port by the engines, which they blew open, just as the Star Destroyer was preparing to jump into hyperspace.\nSuccessfully making their way into the ship, Iden and her companions fought their way to a control room, which contained the schematics for a First Order Dreadnaught, but were unable to escape while the ship was in hyperspace, so Iden devised a plan to force the ship out of hyperspace by destroying the hyperdrive. While Shriv went looking for a suitable escape ship, Iden and Zay fought their way to the hyperdrive control platforms, fighting through Stormtroopers.\nBefore making their way to the last objective and planting the last explosive Iden had Dio reroute Reinforcements to make things easier. Just after arming the last explosive, Hask snuck up from behind Zay and held her at gunpoint while taunting Iden to shoot him. Realizing she couldn't shoot Hask without risking hitting Zay, Iden threw her blaster down into the hyperdrive core. Hask, disappointed in her cowardice, prepared to shoot her, but was interrupted by Zay, who managed to break free and redirect Hask's blaster shots away, only to be knocked off the platform in the process. Iden grabbed her daughter at the last second, but was caught off guard by Hask, who prepared to finish his old comrade off. Before doing so, Zay tossed her blaster to Iden, and she shot Hask, sending him falling to his death in the reactor core and avenging Del.\nWith Hask dead, Iden hauled Zay back to safety, and the two retreated into an observation room while watching the explosions go off, ripping a part of the hull open and prematurely forcing the ship out of hyperspace near Starkiller base. Happy that their plan had worked, Iden suddenly doubled over in pain and showed the worried Zay a bloodied part of her shirt where a stray blaster bolt from Hask's pistol had struck her earlier. Zay, shocked by this, tried to figure out a way to help her, but was reassured by her mother that there was no time and that as long as they would fight to keep others safe, even if it meant for them to die they would make a difference. After Iden told Zay that Dio needed to be brought back to the Resistance base and that she loved her, Iden finally succumbed to her injuries, and Zay was left alone, deeply saddened by her mother's death.\nImmediately afterwards, Shriv contacted Iden and Zay, who told him she was the only one left, assuring him that Iden make her death count, to which Shriv responded that she always did. Remembering her mother's last words, Zay left the Retribution along with Shriv as Starkiller Base was destroyed. Zay and Shriv then contacted General Leia Organa to send her the Dreadnought's schematics. Organa assured Zay that she was sorry for Iden's death, adding that the galaxy was far better with her in it. She then informed them that they were evacuating the planet and redirected Shriv and Zay to the Outer Rim in hope of finding hidden allies of the Resistance.\nSometime after the Battle of Crait, Zay contacted Organa and informed her they had some promising leads and whilst she hadn't found the allies Organa had asked for, they had tracked down some friends of Iden who once served the Empire but weren't aligned with the First Order. While doubting in recruiting them, Organa ultimately gave her approval to Zay as Iden had proven that some of the fiercest rebel fighters used to be on the other side before realizing that the peace and order they desired came at a too high price.\nBefore the evacuation of Vardos, Versio saw Emperor Palpatine as a great leader, and was fiercely dedicated to the Empire, due to her father's Imperial background and her planet's pro-Imperial sentiments. She believed that the Empire was the best hope for stability and peace in the galaxy, and existed to protect its citizens from terrorism and atrocities. She believed that the Empire should protect its own, and made a point to assist trapped stormtroopers during the Battle of Endor.\nIden possessed a stoic and occasionally intense personality, likely a product of her Imperial background. She recovered quickly from shock and thought quickly on her feet. However, she was also compassionate towards civilians and friendly, though professional, with her squadmates and crew.\nFollowing the destruction of the Death Star II, Iden became increasingly disillusioned with the Empire. She expressed anger at how the Emperor's attempted trap at Endor had led to military disaster, and grew increasingly frustrated with and suspicious of the opaque and secretive nature of Operation: Cinder. She thought the Empire was turning away from what it was meant to be. This ultimately led to her deserting the Empire during Operation: Cinder's destruction of Vardos, which she saw as a betrayal of Imperial values. Despite this she did not have hatred for Hask as he had been her childhood friend and only went for the leg.\nAfter her defection, her political views came to change. She viewed the Empire as tyrants for destroying her homeworld and countless others. Iden took a liking to the rebels during the subsequent Battle of Naboo, and eventually joined them full-time. At Jakku she was determined to end the Empire however she still did not like being Hask's enemy and she still cared for her father who she made a desperate attempt to rescue. Proving herself as one of the fiercest rebel fighters in spite of previously serving the Empire, Iden demonstrated Leia Organa that if the Empire did any good, was offering people what they thought they needed until realizing which was the right side and how high would be the price to get the order and peace they desired, reason for which Leia came to not judge her for her past. As part of the resistance she was determined to help defeat the First Order especially after learning how evil they were. After learning of Hask's murder of Del and involvement in the crimes of this new regime she did not hesitate to kill him. She also was a caring mother and was happy to see her daughter following her way.\nIden Versio was a character created for 2017 video game Star Wars Battlefront II, in which she was portrayed by Janina Gavankar. Before the games release, Gavankar read the audiobook adaptation of the novel Battlefront II: Inferno Squad, which featured Versio. From a development standpoint, Versio was intended to be one of the \"nobler heroes\" of the Empire.\nOn December 13, 2017, three new campaign missions for Star Wars Battlefront II featuring Versio were added, taking place during the rise of the First Order, not too long after the main campaign's ending. The \"Battle of Yavin Scenario Pack\" erroneously pictures Versio as flying a TIE/IN interceptor during the Battle of Yavin.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Iden_Versio",
  "/wiki/Vardos",
  "/wiki/34_ABY",
  "/wiki/Retribution",
  "/wiki/Starkiller_Base_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Royal_Imperial_Academy",
  "/wiki/Black_Squadron_(Galactic_Empire)",
  "/wiki/Inferno_Squad",
  "/wiki/Dreamers",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Danger_Squadron",
  "/wiki/New_Republic",
  "/wiki/Inferno_Squad_(Resistance)",
  "/wiki/Resistance",
  "/wiki/Soldier",
  "/wiki/Imperial_Military",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Commander",
  "/wiki/Imperial_Special_Forces",
  "/wiki/Commando",
  "/wiki/Admiral",
  "/wiki/Garrick_Versio",
  "/wiki/Battle_of_Yavin",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Agent",
  "/wiki/Gideon_Hask",
  "/wiki/Del_Meeko",
  "/wiki/Seyn_Marana",
  "/wiki/Infiltration_of_the_Dreamers",
  "/wiki/Death",
  "/wiki/Galactic_Civil_War",
  "/wiki/4_ABY",
  "/wiki/Battle_of_Endor",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Contingency",
  "/wiki/Sentinel_(Contingency)",
  "/wiki/Droid",
  "/wiki/Imperial_officer",
  "/wiki/Operation:_Cinder",
  "/wiki/Climate_disruption_array",
  "/wiki/Versio_family",
  "/wiki/Corvus_(Raider_II-class)",
  "/wiki/Battle_of_Theed",
  "/wiki/Battle_of_Jakku",
  "/wiki/Shriv_Suurgav",
  "/wiki/Eviscerator",
  "/wiki/Starship",
  "/wiki/Escape_pod",
  "/wiki/Zay_Versio",
  "/wiki/First_Order",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Mandator_IV-class_Siege_Dreadnought",
  "/wiki/Hyperspace",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Poe_Dameron",
  "/wiki/Fulminatrix",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/City",
  "/wiki/Kestro",
  "/wiki/Core_Worlds",
  "/wiki/Planet",
  "/wiki/Imperial_Era",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Zeehay_Versio",
  "/wiki/Artist",
  "/wiki/Coalition_for_Progress",
  "/wiki/Propaganda",
  "/wiki/Painting",
  "/wiki/Parent",
  "/wiki/Future_Imperial_Leaders_Military_Preparatory_School",
  "/wiki/Imperial_Academy",
  "/wiki/Coruscant",
  "/wiki/Senior_Lieutenant",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/0_BBY",
  "/wiki/Jedha_City",
  "/wiki/Desert",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/Death_Star",
  "/wiki/Superlaser",
  "/wiki/Temple_of_the_Kyber",
  "/wiki/Saw_Gerrera",
  "/wiki/Partisans",
  "/wiki/Battle_of_Scarif",
  "/wiki/Imperial_Center_of_Military_Research",
  "/wiki/Death_Star_plans",
  "/wiki/Deflector_shield_generator",
  "/wiki/Tantive_IV",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Homeworld",
  "/wiki/Alderaan",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Alderaan_system",
  "/wiki/Yavin_4",
  "/wiki/Callsign",
  "/wiki/TIE_line",
  "/wiki/Sigma_Three",
  "/wiki/Kela_Neerik",
  "/wiki/Space_station",
  "/wiki/Anakin_Skywalker",
  "/wiki/Pilot",
  "/wiki/Luke_Skywalker",
  "/wiki/Proton_torpedo",
  "/wiki/Thermal_exhaust_port",
  "/wiki/BTL-A4_Y-wing_starfighter",
  "/wiki/Evaan_Verlaine",
  "/wiki/Yavin_Prime",
  "/wiki/Moff",
  "/wiki/Jaccun_Pereez",
  "/wiki/Wedding_of_Famma_and_Yendiv_Bensek",
  "/wiki/Famma",
  "/wiki/Raider-class_corvette",
  "/wiki/Mission_to_the_Tellik_Four_Station",
  "/wiki/Bokk_Naarg",
  "/wiki/Stormtrooper_armor",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Tarvyn_Lareka",
  "/wiki/Gleb",
  "/wiki/Headmaster",
  "/wiki/Dreamers%27_encampment",
  "/wiki/Jeosyn",
  "/wiki/Lux_Bonteri",
  "/wiki/Dahna",
  "/wiki/Staven",
  "/wiki/Crunchers",
  "/wiki/Lar_Kantayan",
  "/wiki/Posthumous_Black_Laurel_for_Service_to_the_Empire",
  "/wiki/Piikow",
  "/wiki/Tevraki_whiskey",
  "/wiki/Escape_from_the_Invincible_Faith",
  "/wiki/Invincible_Faith",
  "/wiki/ID10_seeker_droid",
  "/wiki/Dio",
  "/wiki/Endor_system",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Realspace",
  "/wiki/BTL_Y-wing_starfighter",
  "/wiki/File:VersioHask-Orders-BFII.ogg",
  "/wiki/Fondor",
  "/wiki/Dauntless_(Imperial_II-class)",
  "/wiki/MC80_Star_Cruiser",
  "/wiki/CR90_corvette",
  "/wiki/Ion_cannon",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Raythe",
  "/wiki/Attack_on_Fondor",
  "/wiki/Pillio",
  "/wiki/Archive",
  "/wiki/Skirmish_on_Vardos",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Alliance_officer",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Naboo",
  "/wiki/Rebel_pilot",
  "/wiki/Star_Destroyer",
  "/wiki/Theed",
  "/wiki/General",
  "/wiki/Ion_pulse",
  "/wiki/Standard_month",
  "/wiki/Han_Solo",
  "/wiki/Takodana",
  "/wiki/Skirmish_on_Takodana",
  "/wiki/Chewbacca",
  "/wiki/Kashyyyk",
  "/wiki/Bespin",
  "/wiki/Sullust",
  "/wiki/Mission_to_Chinook_Station",
  "/wiki/Chinook_Station",
  "/wiki/Fleet",
  "/wiki/X-wing_starfighter",
  "/wiki/Cloud_car",
  "/wiki/Destruction_of_an_abandoned_weapons_depot",
  "/wiki/Abandoned_weapons_depot",
  "/wiki/Factory",
  "/wiki/Magma",
  "/wiki/Gial_Ackbar",
  "/wiki/Jakku",
  "/wiki/Imperial_Navy",
  "/wiki/Macrobinoculars",
  "/wiki/Unity_(Starhawk-class)",
  "/wiki/TIE/sa_bomber",
  "/wiki/Jakku_Observatory",
  "/wiki/Carbon_Ridge",
  "/wiki/Hull",
  "/wiki/Gallius_Rax",
  "/wiki/Lor_San_Tekka",
  "/wiki/Map_to_Skywalker",
  "/wiki/Ahch-To",
  "/wiki/Ben_Solo",
  "/wiki/First_Order_officer",
  "/wiki/Athulla",
  "/wiki/Jinata_Security",
  "/wiki/Leema_Kai",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Starkiller_Base",
  "/wiki/The_galaxy",
  "/wiki/Mission_to_the_Outer_Rim",
  "/wiki/Battle_of_Crait",
  "/wiki/Endor",
  "/wiki/2017",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Janina_Gavankar",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/December_13",
  "/wiki/Battle_of_Yavin_Scenario_Pack",
  "/wiki/TIE/IN_interceptor",
  "/wiki/Category:Audio_files_of_Iden_Versio",
  "/wiki/Category:Images_of_Iden_Versio",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Bounty_Hunters_28",
  "/wiki/Revelations_1",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Resistance_Reborn",
  "/wiki/Resistance_Reborn_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/Electronic_Arts",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Heading_into_Battle",
  "/wiki/Star_Wars_Insider_177",
  "/wiki/The_Fist_of_the_Empire",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/X-Wing_Second_Edition_Core_Set",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Spark_of_Hope",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Rebellion_in_the_Rim",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_61",
  "/wiki/Creating_a_Starship_Fleet",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_74",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Book_of_Lists",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_98",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Emperor_Palpatine",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Atomic_Mass_Games",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/A_New_Hope_-_The_Film_Novel",
  "/wiki/Time",
  "/wiki/April_15",
  "/wiki/June_6"
 ]
}