{
 "name": "Idrosen Gawat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Raddus",
      "Oetchi system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tanned"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mykapo system planetary defense forces",
      "Resistance",
      "Fleet Command",
      "Fleet Command"
     ]
    }
   ]
  }
 ],
 "content": "Idrosen Gawat was a human male, who after retiring from the planetary defense force of the Mykapo system, came to serve in the Resistance navy as captain and executive officer of the MC85 Star Cruiser Raddus during the war between the Resistance and the First Order. In 34 ABY, he was on the bridge of the Raddus with Admiral Gial Ackbar and General Leia Organa during the evacuation of the Resistance base on the planet D'Qar and died when the First Order destroyed the bridge in an attack on the fleet after it exited hyperspace following the lightspeed jump from D'Qar.\nIdrosen Gawat was a human male who led the planetary defense forces responsible for patrolling the Mykapo system. After decades of experience, Gawat retired from the defense force, but returned to action in his seventies when he joined the Resistance in order to oppose the First Order. When open war broke out against the First Order in the year 34 ABY, Gawat was captain and executive officer of the MC85 Star Cruiser Raddus.\nThe Raddus was the largest of four vessels used to evacuated the Resistance personnel from their base on the planet D'Qar. As the Resistance transported its last personnel off the world, the First Order fleet arrived and attacked, but after the Resistance's forces successfully destroyed the First Order Dreadnought Fulminatrix, the Raddus successfully jumped to lightspeed with the rest of the Resistance forces and escaped.\nMuch to the surprise of the Resistance's commanders, the First Order managed to track them through lightspeed and quickly caught up with them and attacked after the Raddus and other vessels exited hyperspace. Gawat was killed along with almost everyone else on board the primary bridge of the Raddus when two TIE/fo space superiority fighters successfully struck the bridge with missiles. Those who were not killed in the initial blast were sucked out into the vacuum of space, with only General Leia Organa managing to survive the ordeal.\nGawat had tanned skin, brown eyes, and white hair. After retiring, he was not quite ready to hang up his rank badge and so joined the Resistance in order to put his decades of experience to good use.\nWhile on the Raddus, Gawat wore a brown, brimoss-fibre uniform tunic with black Fleet officer's uniform trousers, a brown belt and a pair of dark brown service boots.\nIdrosen Gawat was portrayed by Togo Igawa in the film Star Wars: Episode VIII The Last Jedi, which was released on December 15, 2017. The character was not named in the film, but received identification in Star Wars: The Last Jedi: The Visual Dictionary, a reference book written by Pablo Hidalgo and released in conjunction with the film.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/34_ABY",
  "/wiki/Raddus_(MC85_Star_Cruiser)",
  "/wiki/Oetchi_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Mykapo_system_planetary_defense_forces",
  "/wiki/Resistance",
  "/wiki/Fleet_Command_(Resistance)",
  "/wiki/Mykapo_system",
  "/wiki/Resistance_navy",
  "/wiki/Captain",
  "/wiki/Executive_officer",
  "/wiki/MC85_Star_Cruiser",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Admiral",
  "/wiki/Gial_Ackbar",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/Resistance_base",
  "/wiki/Planet",
  "/wiki/D%27Qar",
  "/wiki/Death",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Hyperspace",
  "/wiki/Lightspeed",
  "/wiki/Standard_decade",
  "/wiki/Planetary_defense_forces",
  "/wiki/Cold_War",
  "/wiki/Standard_year",
  "/wiki/Starship",
  "/wiki/Transport",
  "/wiki/First_Order_Navy",
  "/wiki/Mandator_IV-class_Siege_Dreadnought",
  "/wiki/Fulminatrix",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Missile",
  "/wiki/Realspace",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Resistance_officer",
  "/wiki/Boot",
  "/wiki/Togo_Igawa",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/December_15",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi_Adaptation_1",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/StarWars.com"
 ]
}