{
 "name": "Igar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kuat"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Imperial Officer Corps",
      "Imperial Army",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Igar was a human male who served in the Galactic Empire's Imperial Army as a commander of an Imperial shield bunker on the moon Endor. In 4 ABY, the Jedi Luke Skywalker surrendered himself to Igar shortly before the Battle of Endor. Igar presented the prisoner to the Sith Lord Darth Vader, who then ordered the commander to search the surrounding area for Skywalker's allies.\nIgar was a human male who served the Galactic Empire as an Imperial Army commander during its Galactic Civil War against the Alliance to Restore the Republic. He was stationed on the moon Endor as one of the commanding officers of a garrison assigned to protect an Imperial command bunker. The bunker housed an SLD-26 planetary shield generator that was used to defend the DS-2 Death Star II Mobile Battle Station superweapon while it was under construction in orbit over the moon.\nIn 4 ABY, the Alliance sent a strike team to Endor to try and destroy the shield generator in preparation for an all out assault on the Death Star. Before the attack on the bunker began, the rebel Jedi Luke Skywalker purposefully surrendered himself to Igar while the officer was on patrol, in hope of being brought to his own father, the Sith Lord Darth Vader, whom he hoped to redeem. Igar questioned Skywalker as to whether there were other rebels nearby, but the Jedi lied and told the commander he was alone.\nIgar then rode with Skywalker in a All Terrain Armored Transport to the bunker's landing pad, where Vader landed in order to meet them. The commander exited the walker with his prisoner and three stormtroopers onto one of the pad's walkways and then handed Skywalker and the Jedi's lightsaber over to the Sith. He then requested permission to search the surrounding area for Skywalker's allies, having not believed his prisoner's lie.\nVader congratulated the commander then ordered him to search as he had requested, so Igar re-boarded the walker with the stormtroopers, leaving father and son alone on the walkway. Shortly after Igar's capture of Skywalker, the rebels attacked the shield bunker and managed to get inside, only to discover that Empire has prepared for their arrival and set up a trap. Despite this, the rebels ultimately managed to destroy the command bunker and shield generator, allowing the Alliance Fleet above the planet to destroy the Death Star.\nIgar had fair skin, brown hair and blue eyes. When Luke Skywalker lied about not having any allies with him on Endor, Igar saw through the lie and requested permission to hunt the rebels from Vader. He was initially smug when presenting Skywalker to Vader, but became less smug by the time he returned to the walker.\nIgar wore a gray officer's uniform including a cap, belt and boots. He rode in an All Terrain Armored Transport while on Endor.\nIgar first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. He was portrayed uncredited by actor William Hoyland in the film. The character was first named in the current canon in the 2015 reference book Ultimate Star Wars, with the name originating on a card in the 1999 Star Wars Legends Star Wars Customizable Card Game in the Endor Limited set.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Igar",
  "/wiki/Igar/Legends",
  "/wiki/The_Battle_of_Endor_and_the_Fall_of_the_Empire",
  "/wiki/Geonosis_and_Other_Outer_Rim_Planets",
  "/wiki/Kuat",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/File:Igar-Rebel.ogg",
  "/wiki/Commander",
  "/wiki/Endor_shield_generator_bunker",
  "/wiki/Moon",
  "/wiki/Endor",
  "/wiki/4_ABY",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Battle_of_Endor",
  "/wiki/Prisoner",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/File:Igar-Armed.ogg",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Imperial_officer",
  "/wiki/Garrison",
  "/wiki/Death_Star%27s_shield_generator",
  "/wiki/SLD-26_planetary_shield_generator",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Orbit",
  "/wiki/Endor_strike_team",
  "/wiki/Deflector_shield_generator",
  "/wiki/Death_Star",
  "/wiki/Parent",
  "/wiki/File:Vader-Igar.ogg",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Walker",
  "/wiki/Stormtrooper",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Sith",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Death",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Hat",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/William_Hoyland",
  "/wiki/2015",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/1999",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Endor_Limited",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Category:Audio_files_of_Igar",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_25",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}