{
 "name": "Igren_Demos",
 "display_name": "Igren Demos",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 17 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jiramma"
     ]
    }
   ]
  }
 ],
 "content": "Igren Demos was a Force-sensitive male Neimoidian criminal in service of the crime boss Jiramma, adjutant of the Hutt Darga Jiramma Mionne, on Cato Neimoidia during and immediately after the Clone Wars. He was killed along with his bodyguards by agents of Bail Organa while attempting to escape with his master's bargaining chip about the Jedi Master Denia.\nFollowing the declaration of the New Order, Igren worked in the lower levels of Darga the Hutt's palace on his homeworld where he supervised prisoners, including Jedi Master Denia, in the city of Zarra. Working alongside Darga, Igren was involved in the Sarlacc Project. But in truth, he was personally in connection with Inquisitor Valin Draco since it was revealed that he was force-sensitive. Secretly, he hoped to gain by Valin's own contacts to influence and take power over Darga's organization.\nIn 17 BBY, he kept a close eye on a group of agents that entered the palace secretly. He feared that his position could be compromised if these people started working for Darga. When Darga fled to Cloud City on Bespin, Igren was left to turn against the enemy, but instead made his own plans and to bring Darga's organization under his own rule. He quickly reported to Valin Draco and hoped that he would come to his aid because he believed that Denia could be easily beaten by the Inquisitor. In return for handing over the Jedi, Igren hoped Valin Draco and the Inquisitors would ensure that Darga would never return to Cato Neimoidia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/17_BBY/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jiramma",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Adjutant/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Darga_Jiramma_Mionne",
  "/wiki/Cato_Neimoidia/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Denia",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/New_Order/Legends",
  "/wiki/Darga_the_Hutt%27s_palace",
  "/wiki/City/Legends",
  "/wiki/Zarra/Legends",
  "/wiki/Sarlacc_Project",
  "/wiki/Valin_Draco",
  "/wiki/Darga%27s_organization",
  "/wiki/Cloud_City/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/A_Wretched_Hive_(Dawn_of_Defiance)"
 ]
}