{
 "name": "Ikka Gesul",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ikka Gesul was a Rebel sympathizer.\nIn 1 ABY, Ikka resided in the city of Mos Entha on Tatooine. While here, he learned news that a group of slavers were looking for him. He was sure that he would be killed, seeing as how he had information regarding their activities in the Outer Rim. To save his life, Ikka employed a spacer to help hunt down the murderers. The spacer tracked down the slaver, named Orga Presari, who was accompanied by two thugs. All three of the murderers were subsequently killed by the spacer.\nIkka was thankful to the spacer and told him that he would mention the heroic deed to his friends in the Alliance. However, Ikka had one final task for the spacer. Ikka learned that a technician named Taln Solwind could help him contact the Alliance. Ikka gave the spacer a message to deliver to the technician. The spacer obliged, and set out to the coordinates that Ikka had given him. Though the spacer was ambushed by another two thugs, they were quickly killed, and the spacer managed to hand the message over to Taln. Ikka was greatly thankful, and awarded the spacer with a gift, that used to belong to some slave girls.\nIkka Gesul was a Non-Player Character  in the MMORPG Star Wars Galaxies. In the game, the quests awarded Rebel Faction Points, but Imperial players could perform the quests as well.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/1_ABY/Legends",
  "/wiki/Mos_Entha/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Orga_Presari",
  "/wiki/Technician/Legends",
  "/wiki/Taln_Solwind",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided_Quick_Reference_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide"
 ]
}