{
 "name": "Illiet",
 "display_name": "Illiet",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Yag'Dhul"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Givin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Illiet was a Givin Dodecian during the Yuuzhan Vong War who was in command of Yag-prime, the space station orbiting Yag'Dhul. He had mathematical symbols painted on his exoskeleton, indicating his high rank among the Givin people.\nCorran Horn, Anakin Solo, and Tahiri Veila warned Illiet about a secret plot to lower the planetary defenses of Yag'Dhul in preparation for an invasion of the system. The plot against the Body Calculus was thwarted, though Illiet remained apparently unaware that one of his subordinates was a disguised Nom Anor. After weighing all the factors, Illiet and the Givin people decided to fight against the Yuuzhan Vong invasion of their system in the Battle of Yag'Dhul. Aware that the space station was almost certainly doomed, he evacuated all unnecessary personnel and offered the use of a Givin ship to the Jedi. He remained on the station during the battle. It is unknown whether the Yuuzhan Vong destroyed the Yag'Dhul station before retreating, but it was heavily damaged in the fighting.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Yag%27Dhul/Legends",
  "/wiki/Givin/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dodecian",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Yag-prime",
  "/wiki/Corran_Horn",
  "/wiki/Anakin_Solo",
  "/wiki/Tahiri_Veila",
  "/wiki/Body_Calculus",
  "/wiki/Nom_Anor",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Battle_of_Yag%27Dhul_(26_ABY)",
  "/wiki/Jedi/Legends",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}