{
 "name": "Illo_Vandin",
 "display_name": "Illo Vandin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Giju"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Herglic"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grey-green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark grey"
     ]
    }
   ]
  }
 ],
 "content": "Illo Vandin was a male Herglic gambler who resided on the Mid Rim world Ord Mantell during the Galactic Civil War.\nRising up from humble beginnings on Giju, Illo Vandin traveled to the Outer Rim as part of a smuggler's crew for much of his formative years. Stranded on Ord Mantell, Vandin made a name for himself on the gambling circuit and became incredibly wealthy. Financially backing up-and-coming gamblers on occasion, Vandin was fond of taking young professionals under his tutelage and serving as their manager. In addition, Vandin operated many smaller casinos in Worlport and abroad, bringing in additional revenue to his already sizable estate. Secretly, Vandin had dealings that circumvented the law. He established and ran operations in racketeering, loan sharking, and smuggling which cemented his position in the elite class of the planet. Residing in the Jewel District of Worlport, Vandin owned a modestly-sized villa with interior walls that were floor-to-ceiling aquariums holding exotic marine life. The estate was patrolled by guardsmen to act as bodyguards and protect his wealth. Despite this, Vandin still carried a heavy blaster pistol on his person.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Giju/Legends",
  "/wiki/Herglic/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gambler/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Planet/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Worlport/Legends",
  "/wiki/Racketeering",
  "/wiki/Loan_shark",
  "/wiki/Jewel_District",
  "/wiki/Aquarium/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Mask_of_the_Pirate_Queen"
 ]
}