{
 "name": "Illyan_Webble",
 "display_name": "Illyan Webble",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 BBY",
      "Mon Calamari"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Seraphan Industries"
     ]
    }
   ]
  }
 ],
 "content": "Illyan Webble was a Human male and the president of Seraphan Industries.\nAround 1 BBY, Webble's space yacht was disabled when a comet tore through one of the ship's solar sails, stranding him in space. The small vessel, having been sent adrift, crashed on an uncharted planet where he discovered the descendants of the Thelvin Order of Barundi, who worshiped the Yavin Vassilika. Webble gradually went insane while on the planet. He was the only one of his crew to escape the planet, where he was eventually captured by roving slavers.\nHowever, the slavers realized that Webble was completely insane and was no use as a slave. They dropped the raving-mad man off on the planet Kalkovak, where he wandered aimlessly, telling anyone who would listen about what he had seen on the uncharted planet. Eventually, the information reached Garindan, told by a trader who had encountered the man and deciphered from his insane musings that he had information on the fabled Yavin Vassilika. Garindan took the information back to Tatooine, where it was bought by the Hutt servant Jozzel Moffet. Garindan recounted the tale to Jabba, Embra, and Malta.\nJabba was interested in the information and organized a bet between the three Hutts on who would find the artifact first. The Hutts paid Garindan to keep the information secret so that no one else would search for the priceless relic. As the Hutts rounded up search parties to discover the whereabouts of Webble and subsequently the location of the uncharted planet, Webble stowed away on a ship in the Quarren Sector, which brought him to Mon Calamari.\nAfter arriving on the planet, he stole an impounded skiff and fled into one of the planet's oceans, trying to find passage to the Outer Rim Territories. However, the skiff was damaged, and just as Webble had left one of Mon Calamari's floating cities, his craft malfunctioned and sank into the water, where Webble was eaten by sea creatures. The native Knowledge Bank cataloged Webble's thoughts about the uncharted planet. When the hunters working for the Hutts arrived on Mon Calamari, they read Webble's thoughts from the Bank in order to discover the location of the planet containing the Vassilika.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Dac",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Seraphan_Industries",
  "/wiki/Malta",
  "/wiki/President/Legends",
  "/wiki/Yacht/Legends",
  "/wiki/Comet/Legends",
  "/wiki/Solar_sailer/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Thelvin_Order",
  "/wiki/Yavin_Vassilika",
  "/wiki/Slavery/Legends",
  "/wiki/Kalkovak",
  "/wiki/Garindan",
  "/wiki/Merchant/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Jozzel_Moffet",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Embra",
  "/wiki/Quarren_Sector",
  "/wiki/Skiff/Legends",
  "/wiki/Ocean/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Water/Legends",
  "/wiki/Knowledge_Bank",
  "/wiki/Underworld:_The_Yavin_Vassilika",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_121",
  "/wiki/The_Official_Star_Wars_Fact_File_132",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}