{
 "name": "Ilok",
 "display_name": "Ilok",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Ilok was a male Human who lived on the planet Coruscant during the last years of the Galactic Republic. Around 31 BBY, Ilok witnessed a speeder crash in the Coruscant undercity. The accident caused a fire and, outraged at the destruction caused by the collision, Ilok angrily confronted a group of spacers whom he believed were responsible.\nIlok was a male Human who resided in the undercity of the planet Coruscant during the last years of the Galactic Republic. Around 31 BBY, while walking through the Coruscant undercity with his associate, the Coruscani ogre Bartle, Ilok witnessed a speeder piloted by a group of Believer Sith-worshipping cultists collide with a nearby building. The crash ignited a fire and Ilok joined a crowd of disgruntled local residents who were drawn to the scene, outraged at the devastation that had been brought to their neighborhood. A group of spacers in pursuit of the cultists arrived at the wrecked speeder and an irate Ilok, suspecting that the spacers had caused the crash, angrily confronted them to express his displeasure.\nA fight soon broke out between Ilok and the spacers. A Ilok's direction, Bartle and three Trandoshan thugs who were among the crowd drawn to the crash site, Dure, Krood and Sounac, all joined the melee and attacked the spacers as well. Ilok, Bartle and the Trandoshans were subsequently defeated and the spacers departed to resume tracking the Believers.\nIlok had dirty brown hair and his body had an odor of a rotten eggs combined with pineapple juice. When the Believers' speeder crashed in the Coruscant undercity he was riled by the destruction that resulted and was determined to express his consternation to the spacers that he believed were responsible. In addition to Basic, Ilok was fluent in the language spoken by his Coruscani ogre associate Bartle.\nIlok wore a shirt and pants that looked as if they had been sown together from old towels. He was also equipped with a blast helmet and blast vest and was armed with a blaster pistol and vibroblade.\nIlok featured in Coruscani Dawn, a 2002 roleplaying adventure by Morrie Mullins that formed part of the Living Force campaign.\nIn Coruscani Dawn, the players roleplay as the spacers who encounter Ilok in the Coruscant undercity. When Ilok confronts them, the player characters can either attempt to defuse the tense situation via diplomacy or by applying a Jedi mind trick to Ilok, or instead by letting a fight break out. Ilok does not initiate combat with the player characters but fights back if provoked and commands Bartle to attack the spacers. If the player characters are in the middle or upper roleplaying experience tiers, Ilok and Bartle are joined in the brawl by a trio of Trandoshan thugs, otherwise the pair fight alone. If a fight does break out, it is possible for Ilok, Bartle and the Trandoshans to be incapacitated or killed. Alternatively, Bartle can stop fighting either due to fear of a lightsaber weapons if any of the player characters ate wielding such blades, or out of boredom, which momentarily distracts Ilok and allows the player characters to flee the scene. The adventure also advises that the players' encounter with Ilok and Bartle can be cut-out from the gameplay of the players are short of time.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Fire/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/City/Legends",
  "/wiki/Coruscani_ogre",
  "/wiki/Bartle",
  "/wiki/Pilot/Legends",
  "/wiki/Believers",
  "/wiki/Sith_cult",
  "/wiki/Sith_Cultist",
  "/wiki/Spacer/Legends",
  "/wiki/Coruscani_Dawn",
  "/wiki/Canon",
  "/wiki/Trandoshan/Legends",
  "/wiki/Dure",
  "/wiki/Krood",
  "/wiki/Sounac",
  "/wiki/Hair/Legends",
  "/wiki/Egg/Legends",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Language/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Blast_helmet/Legends",
  "/wiki/Blast_vest",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/2002",
  "/wiki/Roleplaying_game",
  "/wiki/Morrie_Mullins",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Mind_trick/Legends",
  "/wiki/Death/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Time/Legends",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Belly_of_the_Beaast"
 ]
}