{
 "name": "Ilosov",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "InterStellar Regulators",
      "Avesta family",
      "Avesta Militia",
      "Avesta Militia",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ilosov was a male Kadas'sa'Nikto who served with the mercenary group known as the InterStellar Regulators on the planet Makeb, where they acted as the planet's army and police force.\nDuring the Great Galactic War between the Sith Empire and the Galactic Republic, the Hutt Cartel saw an opportunity to seize neutral Makeb, and outbid the world for the Regulators services. While the rest of the Regulators turned on their former employers, Ilosov refused to betray his client for credits and left the mercenary group, siding with the business man Shalim Avesta, who had agreed to have Makeb join the Galactic Republic if the Republic would aid them. Ilosov was with Avesta in his office at the Avesta Plantation when one of the Republic's greatest hero's arrived, having been sent by Supreme Chancellor Leontyne Saresh to aid Avesta in retaking his homeworld. As Avesta greeted the hero and introduced Ilosov, a groundquake struck the area, one of several which had occurred since the Hutt invasion began. After Ilosov gave a status report on the effects of the quake, Avesta asked that the hero find his niece Lemda Avesta, who had been looking into the groundquakes to try and find a connection to the Hutts. Ilosov explained that Regulator forces had just pushed back forces that had been sent to find Lemda, and then stayed with Shalim after the hero left to protect him from any Hutt forces who discovered their rebellion.\nIlosov was skilled enough to work for the Interstellar Regulators, but refused to betray Makeb for credits like the rest of the mercenary group. He had green skin, no hair and brown eyes. Ilosov wore a red uniform and used a datapad.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nikto/Legends",
  "/wiki/Kadas%27sa%27Nikto/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Color/Legends",
  "/wiki/InterStellar_Regulators",
  "/wiki/Avesta_family",
  "/wiki/Avesta_Militia",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Makeb",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Hutt_Cartel",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Shalim_Avesta",
  "/wiki/Avesta_Plantation",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Leontyne_Saresh",
  "/wiki/Homeworld/Legends",
  "/wiki/Groundquake/Legends",
  "/wiki/Lemda_Avesta",
  "/wiki/Hutt/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Keylander_Station"
 ]
}