{
 "name": "Ima-Gun_Di",
 "display_name": "Ima-Gun Di",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kintan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.92 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Heliost Clan",
      "Heliost Clan",
      "Galactic Republic",
      "Outer Rim garrison",
      "Outer Rim garrison"
     ]
    }
   ]
  }
 ],
 "content": "Ima-Gun Di was a male Kajain'sa'Nikto Jedi Master who served the Jedi Order as a General during the Clone Wars. He was killed on Ryloth by Separatist droid forces while helping to save its people.\nIma-Gun Di was a Force-sensitive Kajain'sa'Nikto male who was taken in by the Jedi Order and trained to become a Jedi. He was part of the Heliost Clan under Tera Sinube, and during his clan's Initiate Trials dueled fellow youngling Yeeda with Gretz Droom and Qui-Gon Jinn watching.\nDuring the early stages of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, Di held the rank of Jedi Master and was sent to the planet Ryloth with a detachment of clone troopers to help defend the native Twi'lek population against a full scale Separatist invasion. The Republic forces fought valiantly alongside the Twi'lek Resistance; however, the Separatists were able to create a blockade around the world which prevented any supplies or reinforcements being delivered to Di and his men or the natives.\nDuring heavy fighting, Cham Syndulla, leader of the Twi'lek Resistance, approached Di and Clone Captain Keeli and informed the Jedi that their forces' food and energy supplies were running low. Di contacted Republic Admiral Dao, whose Venator-class Star Destroyer still remained in orbit, and requested that supplies be delivered as quickly as possible. Dao was unable to help, as his ship was low on fuel as well as ammunition and so instead he contacted the Jedi High Council to request aid. During the holographic transmission with the council, Dao's vessel was destroyed, leaving Di's forces without any support in the space above Ryloth .\nSeemingly alone, the Twi'leks and clones under Di's command were slowly pushed back by the Separatist forces, and their right flank soon collapsed, leaving the Separatists to close in on the Jedi's location. Despite spotty communications, Di promised Syndulla that the Republic would come through with reinforcements, but the Twi'lek was unconvinced and believing that the Separatists would soon overrun them ordered his people to leave. Keeli explained to Syndulla that without the right flank all of them were trapped and could not escape, and so would have to continue fighting the Separatists together.\nThe Twi'leks still began preparing to evacuate, but soon realized that the single Low Altitude Assault Transport/infantry that the Republic forces had left was not enough to carry them and their families. Di then created an alternate plan, in which the transport would be used as a bomb after its fuel systems were reconfigured. If the explosion was used to collapse one of the two routes leading to their position it would force the Separatists to confront them in the other, a narrow ravine. He explained that while the Republic held the ravine, the Twi'leks could escape by foot over the mountains. Keeli praised the plan and then informed the troops of their orders.\nAs the troops prepared for battle, Syndulla's subordinate Gobi Glie approached Di and informed him that Syndulla was still angry at being let down by the Republic. Di expressed his sympathies and told Glie to pass them on, warning that the Twi'leks would need to be quick, as he and the clones could only hold out for so long. He then ordered Keeli to check the transport was ready and prepared to engage the approaching Separatists. The LAAT/I's destruction successfully destroyed the pass, and so the Separatists moved to confront Di and his men in the ravine as planned.\nAs the Twi'leks fled, Di led his troops in battle at the ravine, deflecting many blaster bolts with his lightsaber as the Republic forces held their ground. The clones quickly began taking heavy casualties and Keeli was downed by the explosion of a thermal detonator. Believing his friend to be dead, Di moved to fight the huge Separatist force alone, but was surprised when Keeli got up and kept fighting. The pair then fought back to back, holding out as long as possible but were soon overwhelmed by fire.\nKeeli died first, briefly distracting Di long enough for the Jedi to take a blaster bolt to the abdomen. Di then receives word from a group of three Pelta-class frigates that they had broken through the blockade and were en route to deliver supplies to the Twi'leks. Seeing the ships fly overhead, Di is gladdened by the knowledge that the Twi'leks would live to fight another day, deflecting more bolts before eventually being overwhelmed and shot multiple times in the torso, killing him. The Battle of Ryloth would continue long after the Jedi Master's death, but would eventually end with a Republic victory, partly thanks to Di's sacrifice.\nDi was a Kajain'sa'Nikto male with orange skin and blue eyes. During the Battle of Ryloth, he had full faith in the Republic, believing that they would deliver reinforcements and aid even without any communications to confirm it. When they did not, he understood the anger of Syndulla. He was willing to sacrifice himself and his clone troopers in order to allow the Twi'lek Resistance and their families to escape. In his last moments, Di and Keeli held out alone, trying to make their last moments memorable ones. The Jedi was greatly pleased to hear that supplies had arrived, dying in the knowledge that his sacrifice to save the Twi'leks had not been in vain.\nWhile fighting on Ryloth, Di wore brown Jedi robes with white armored gauntlets that included a communicator. He used a blue-bladed lightsaber in combat.\nIma-Gun Di first appeared in \"Supply Lines,\" the third episode of season three of the television series Star Wars: The Clone Wars.\nIn Star Wars: The Clone Wars, Master Di was voiced by Robin Atkin Downes, who also voiced Cham Syndulla in the same episode.\nHis name, pronounced like \"I'mma gon' die,\" foreshadows his death in the episode.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ima-Gun_Di",
  "/wiki/Ima-Gun_Di/Legends",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Kintan",
  "/wiki/22_BBY",
  "/wiki/Ryloth",
  "/wiki/Nikto",
  "/wiki/Kajain%27sa%27Nikto",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Heliost_Clan",
  "/wiki/Galactic_Republic",
  "/wiki/Outer_Rim_garrison",
  "/wiki/Jedi_Master",
  "/wiki/Jedi_General",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Force-sensitive",
  "/wiki/Jedi",
  "/wiki/Tera_Sinube",
  "/wiki/Initiate_Trials",
  "/wiki/Yeeda",
  "/wiki/Gretz_Droom",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Planet",
  "/wiki/Clone_trooper",
  "/wiki/Twi%27lek",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Twi%27lek_Resistance",
  "/wiki/Cham_Syndulla",
  "/wiki/Clone_Captain",
  "/wiki/Keeli",
  "/wiki/Admiral",
  "/wiki/Dao",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Jedi_High_Council",
  "/wiki/Hologram",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Transport",
  "/wiki/Bomb",
  "/wiki/Gobi_Glie",
  "/wiki/Blaster",
  "/wiki/Lightsaber",
  "/wiki/Thermal_detonator",
  "/wiki/Pelta-class_frigate",
  "/wiki/Eye",
  "/wiki/Ima-Gun_Di%27s_lightsaber",
  "/wiki/Supply_Lines",
  "/wiki/Clone_Wars:_Season_Three",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Robin_Atkin_Downes",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Catalyst:_A_Rogue_One_Novel_(audiobook)",
  "/wiki/Voices",
  "/wiki/Yoda",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Clone_Wars_Begin",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)"
 ]
}