{
 "name": "Imara Vex",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Orphans",
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "Imara Vex was a human female bounty hunter who was active from the reign of the Galactic Empire through to the time of the New Republic. Having not seen her parents since she was young, Vex would later become a member of the bounty hunter Chanath Cha's Orphans alongside Ladybright and Sear. The Orphans became allies of Lady Qi'ra, leader of the Crimson Dawn criminal syndicate, and played a role in her plot to destroy the Sith Darth Sidious and Darth Vader and free the power structure of the galaxy. Vex and the other Orphans performed discreet attacks on other syndicates, turning them against one another and helping to cause the Syndicate War.\nFollowing the Empire's fall, Vex participated in the Hunters of the Outer Rim competition on the planet Vespaara, hoping to gain the attention of prospective clients.\nImara Vex grew up having not seen her parents since the time when she was too young to remember them, and would later be unsure whether they were alive or dead. Vex eventually came to be a professional bounty hunter, attaining a strong reputation. During the reign of the Galactic Empire, Vex was a member of the Orphans, a crew led by the bounty hunter Chanath Cha that also included Sear and the droid Ladybright. Operating aboard the starship Siroto, the members of the Orphans—as the name suggested—had gone through similar situations to Vex's own.\nBetween 3 ABY and 4 ABY, the Orphans allied with the resurgent Crimson Dawn criminal syndicate and its leader, Lady Qi'ra. Following Crimson Dawn's auction of the carbonite-frozen smuggler Han Solo, in which the syndicate revealed itself to the galaxy once more, Vex and the other Orphans gathered alongside Qi'ra's other assortied allies aboard the Vermillion, Crimson Dawn's fortress-flagship. Aboard the Vermillion, Qi'ra revealed to her allies the true nature of the galaxy; rather than the level power structure that she desired, it was instead ruled by the Sith—Darth Sidious, publicly Emperor Palpatine, and his apprentice Darth Vader— who she wished to destroy so that the galaxy could be free.\nAs part of Qi'ra's plot, the Orphans were dispatched to attack the other criminal syndicates in order to create havoc and sow distrust within the underworld. Their first target was a smash-processing lab of Black Sun on the planet Dantooine. Landing the Siroto on Dantooine, Vex waited at a distance from the facility while Cha, Sear, and Ladybright approached it. Vex shot the guards with her sniper rifle and the other Orphans entered and proceeded with their attack. When two Black Sun transports attempted to flee, Vex, unable to target them both before they were out of range, contacted her partners to inform them of the issue. As Sear made for the Siroto, Vex aimed toward and fired upon one of the transports, successfully hitting the vessel and destroying it.\nWith the other transport shot down by Sear, the Orphans' job was complete, and the crew anonymously uploaded images of the devastated facility on the shadowfeeds alongside a threat to Black Sun. The mission worked as the Orphans and Qi'ra had planned; Black Sun, believing one of its rivals was behind the attack but unsure which, intended to strike at all of them in order to send a message. Vex and the other Orphans continued their attacks at other syndicates, ensuring that they were never seen as being the real culprits. Combined with false rumors that Qi'ra was spreading about the Empire searching for the strongest syndicate to make a partnership deal with, the Orphans' attacks led to conflict between the syndicates and the outbreak of the Syndicate War. The war in turn received the attention of Palpatine, who called upon Vader to take action.\nFollowing the fall of the Empire and the rise of the New Republic, Vex continued to remain active as a bounty hunter. She took part in the Hunters of the Outer Rim tournament within The Arena on the Outer Rim planet Vespaara. Vex used the competition as a chance to showcase her talents to prospective clients.\nAs a bounty hunter, Imara Vex deliberately kept her personal and social life a mystery, refusing to talk about herself or open up to others. She also avoided attachments; knowing as little as possible about others guaranteed that she would have no personal objections to any of her jobs' targets, while ensuring that others knew little about her meant that they would have less to use against her.\nA human female, Imara Vex had brown skin and hair.\nA professional bounty hunter, Vex was always on the hunt for targets, ensuring that she never lost. She was a skilled sniper, able to hit targets from a great distance.\nVex concealed her face with a signature mask that made her an intimidating figure. She wielded a customized A280 blaster rifle, which she used as a sniper, that possessed a black and red coloration with an orange design, as well as a shoulder-mounted rocket launcher. Vex wore a brown jacket over a brown shirt and red chestplate, as well as dark red pants and brown boots. She also wore a gray belt and brown gloves with a red gauntlet on her left arm.\nImara Vex was created for the upcoming 2022 competitive combat game Star Wars: Hunters, published by Zynga and Lucasfilm Games, which entered soft launch on November 16, 2021. As one of the playable characters in Hunters, Vex serves as a Damage character. Prior to the release of the game, Vex first appeared in the fifth issue of the Star Wars: War of the Bounty Hunters comic series, written by Charles Soule, illustrated by Luke Ross and David Messina, and published by Marvel Comics on October 13, 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Vex_(disambiguation)",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Crimson_Reign_5",
  "/wiki/Star_Wars:_Hunters",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Orphans",
  "/wiki/Crimson_Dawn",
  "/wiki/Bounty_hunter",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/New_Republic",
  "/wiki/Parent",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Chanath_Cha",
  "/wiki/Ladybright",
  "/wiki/Sear",
  "/wiki/Lord",
  "/wiki/Qi%27ra",
  "/wiki/Sith",
  "/wiki/Darth_Sidious",
  "/wiki/Anakin_Skywalker",
  "/wiki/The_galaxy",
  "/wiki/Syndicate_War",
  "/wiki/Hunters_of_the_Outer_Rim",
  "/wiki/Planet",
  "/wiki/Vespaara",
  "/wiki/Time",
  "/wiki/Death",
  "/wiki/Droid",
  "/wiki/Starship",
  "/wiki/Siroto",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Vermillion_(Crimson_Dawn)",
  "/wiki/Fortress",
  "/wiki/Flagship",
  "/wiki/Galaxy",
  "/wiki/Galactic_Emperor",
  "/wiki/Sith_apprentice",
  "/wiki/Attack_on_the_Black_Sun_smash-processing_lab",
  "/wiki/Black_Sun_smash-processing_lab",
  "/wiki/Black_Sun",
  "/wiki/Dantooine",
  "/wiki/Sniper_rifle",
  "/wiki/Transport",
  "/wiki/Shadowfeed",
  "/wiki/The_Arena",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Hair",
  "/wiki/Sniper",
  "/wiki/A280_blaster_rifle",
  "/wiki/Missile_launcher",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Glove",
  "/wiki/Gauntlet",
  "/wiki/Limb",
  "/wiki/2022",
  "/wiki/Zynga",
  "/wiki/Lucasfilm_Games",
  "/wiki/November_16",
  "/wiki/2021",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Star_Wars:_War_of_the_Bounty_Hunters",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Charles_Soule",
  "/wiki/Luke_Ross",
  "/wiki/David_Messina",
  "/wiki/Marvel_Comics",
  "/wiki/October_13",
  "/wiki/Crimson_Reign_1",
  "/wiki/Hidden_Empire_3",
  "/wiki/Hunters:_Battle_for_the_Arena",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/Databank_(website)",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}