{
 "name": "Imri Cantaros",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Genetia",
      "Hynestia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 246 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Golden"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Douglas Sunvale",
      "Vernestra Rwoh"
     ]
    }
   ]
  }
 ],
 "content": "Imri Cantaros was a Genetian human male Padawan of the Jedi Order during the time of the High Republic. Spending time on both Genetia and Hynestia in his youth, Imri was later apprenticed to Jedi Master Douglas Sunvale, and was at one point stationed aboard the transport ship Steady Wing alongside Jedi Knight Vernestra Rwoh. When the ship was sabotaged by the Nihil marauders Gwishi and Klinith Da, Cantaros and several other individuals, Honesty Weft, Avon Starros, and J-6, escaped in a shuttle as the ship exploded. Master Sunvale was killed in the destruction of the ship, and Cantaros and the others eventually became stranded on the jungle moon Wevo.\nDuring his time on Wevo, he began to develop strong feelings of anger towards the pirates responsible for his master's death and eventually let those feelings boil over when he saw that the pirates were also stranded on the moon with them. He went rogue, disobeying Vernestra's orders to plan a strategy to subdue their enemies. He and Weft were captured by the pirates after their ambush failed, and Vernestra eventually rescued them. However, when Vernestra was in peril, Cantaros intervened, using a Force choke on Da. Vernestra cautioned him about using the Dark side of the Force, but Cantaros was desperate for revenge, even dueling Vernestra for a short time before he calmed down and realized the error of his ways.\nBy the time they were rescued by the Trandoshan Jedi Master Sskeer, Cantaros was disappointed in himself for his lack of composure and feared that he would be expelled from the Jedi Order. However, at the dedication of the new Starlight Beacon, Vernestra revealed that she would be taking over as his master and promised to help him grow in the ways of the Force. Cantaros was overjoyed and even cried with happiness, promising that he would not let her down and his new master echoing her confidence in him.\nSometime after the skirmish on Wevo, Cantaros and his master, on the request of Master Avar Kriss, performed an autopsy aboard the Starlight Beacon on the corpse of a Hutt trader that had been killed by Nihil raiders while attempting to transport Vratixian barley aboard their starship.\nCantaros was a tall and stocky young man, with short blonde hair. He wielded a blue lightsaber until that saber was subsequently destroyed and later forged a new lightsaber. He was a kind and caring person, comforting Weft at the loss of his father onboard the Steady Wing and friendly towards the quirky Starros. He was envious of Vernestra's advancement to the rank of Jedi Knight at such a young age and wished the Force would show him that he had an important role in the Jedi Order. He also harbored similar feelings for Vernestra's lightsaber because of the struggles he had with his own. As a Genetian, he had strong empathic abilities and was able to sense even the smallest changes in mood of those around him. Because of his abilities, when he was surrounded by many people, he became very overwhelmed. Cantaros could also manipulate the emotions of others, much to Rwoh's concern, when he 'dulled' Silas' jealousy and annoyance.\nImri Cantaros simultaneously debuted in the 2021 novels The High Republic: Light of the Jedi by Charles Soule and the junior novel The High Republic: A Test of Courage by Justina Ireland.\nChapter four of A Test of Courage states Cantaros is from Genetia, while chapter eighteen states he is from Hynestia. Ireland later offered an explanation for the discrepancy on Twitter, stating that Cantaros' parents could have each hailed from separate planets. The novel The High Republic: Out of the Shadows, also written by Ireland, later confirmed this was the case.\nChapter one of Into The Dark states that Reath Silas was looking forward to reuniting with Imri in particular. However, in chapter two of Out of the Shadows, when Vernestra asks Reath if he has met Imri, he states that he has not. There has, so far, been no explanation for the discrepancy.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Genetia",
  "/wiki/Hynestia_Prime",
  "/wiki/246_BBY",
  "/wiki/Human",
  "/wiki/Genetian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Douglas_Sunvale",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Padawan",
  "/wiki/Time",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi_Master",
  "/wiki/Transport",
  "/wiki/Starship",
  "/wiki/Steady_Wing",
  "/wiki/Jedi_Knight",
  "/wiki/Nihil",
  "/wiki/Raider",
  "/wiki/Gwishi",
  "/wiki/Klinith_Da",
  "/wiki/Honesty_Weft",
  "/wiki/Avon_Starros",
  "/wiki/J-6",
  "/wiki/Shuttle",
  "/wiki/Jungle",
  "/wiki/Moon",
  "/wiki/Wevo",
  "/wiki/Force_choke",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Trandoshan",
  "/wiki/Sskeer",
  "/wiki/Starlight_Beacon",
  "/wiki/Avar_Kriss",
  "/wiki/Hutt",
  "/wiki/Unidentified_Hutt_trader",
  "/wiki/Vratixia_renanicus",
  "/wiki/Lightsaber",
  "/wiki/Imri_Cantaros%27_second_lightsaber",
  "/wiki/Vernestra_Rwoh%27s_lightsaber",
  "/wiki/Force_empathy",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Imri_Cantaros",
  "/wiki/Category:Images_of_Imri_Cantaros",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Charles_Soule",
  "/wiki/The_High_Republic:_A_Test_of_Courage",
  "/wiki/Justina_Ireland",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_A_Test_of_Courage_(audiobook)",
  "/wiki/The_High_Republic_(2021)_3",
  "/wiki/The_High_Republic_(2021)_4",
  "/wiki/The_High_Republic_(2021)_5",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/Star_Wars_Insider",
  "/wiki/Starlight:_Shadows_Remain",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Star_Wars_Insider_208",
  "/wiki/Star_Wars",
  "/wiki/StarWarsKids.com",
  "/wiki/StarWars.com",
  "/wiki/Standard_week",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/The_Star_Wars_Book",
  "/wiki/232_BBY",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY"
 ]
}