{
 "name": "Ina'ganet'nuruodo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Csilla"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss AscendancyHouse NuruodoChiss Expansionary Defense Force",
      "House Nuruodo",
      "Chiss Expansionary Defense Force"
     ]
    }
   ]
  }
 ],
 "content": "Commander Ina'ganet'nuruodo, also known by the core name Ganet, was a Chiss military officer, a lean, sharp-faced woman, no longer young by Chiss standards. Along with Chief Navigator Peita Aabe, she was one of the leading figures in an attempt to assassinate Soontir Fel in 28 ABY, but she was taken into custody when the attempt failed.\nGanet was obviously opposed to Assistant Syndic Fel, and prepared to undertake extreme action against him. Fel identified her to his Jedi companions at the time as the \"phalanx commander for a rival Syndic\", implying that she led either a Household Phalanx under the authority of one of the Ruling Families, or else a Colonial Phalanx, the militia of one of the Chiss Ascendancy's twenty-eight colony worlds; but she claimed to speak on behalf of the front-line troops of the Chiss Expansionary Defense Force. Moreover, although the ostensible motive for her attack was an objection to the CEDF's own decision to aid the Jedi in their search for Zonama Sekot, the Chiss diplomat Aristocra Chaf'orm'bintrano later implied that more complex factors were at work.\nAccording to Formbi, Ganet's attack on Fel represented one of the final moves in a \"disagreement\" amounting to a low-level civil war between two factions among the Ruling Families, in the course of which Fel had already destroyed the lineage to which she belonged. To add to the confusion, Ganet's name would suggest that she was a member of the Nuruodo family, which all other sources have identified as one of the Ruling Families of the victorious faction to which Fel was aligned.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Ina%27ganet%27nuruodo",
  "/wiki/Csilla/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Nuruodo_family",
  "/wiki/Chiss_Expansionary_Defense_Force",
  "/wiki/Aristocra/Legends",
  "/wiki/Chaf%27orm%27bintrano",
  "/wiki/Commander/Legends",
  "/wiki/Chief_Navigator",
  "/wiki/Peita_Aabe",
  "/wiki/Soontir_Fel/Legends",
  "/wiki/28_ABY/Legends",
  "/wiki/Assistant_Syndic",
  "/wiki/Jedi/Legends",
  "/wiki/Household_Phalanx",
  "/wiki/Ruling_Families",
  "/wiki/Colonial_Phalanx",
  "/wiki/Zonama_Sekot/Legends",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_II:_Refugee",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}