{
 "name": "Ind",
 "display_name": "Ind",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Valarian Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "Ind was a female Gran criminal who lived on Tatooine during the Galactic Civil War. She worked for Lady Valarian.\nAfter the Battle of Yavin, Ind worked for Lady Valarian, the leader of the Valarian criminal syndicate, in Mos Eisley's Lucky Despot cantina. The Gran was one of the two main lieutenants of Lady Valarian, the other being the Chiss woman Kavas Urdano. Ind and Urdano had a very conflicting relationship as both rivaled to get Valarian's attention.\nIn 1 ABY, the conflict between the Hutt crime lord Jabba Desilijic Tiure and Lady Valarian, her biggest competitor on Tatooine, turned to open war. At that time, Kavas Urdano recruited skilled spacers to help her with several missions. Those adventurers later went to work for Ind and the Gran provided them with Republic blasters. During one of their first missions, the spacers rescued a Valarian's compound guard who was carrying a rill casserole for Lady Valarian from a Jabba's henchman. Later, Ind was informed that a scientist specialized in beam weapons named Kaum had been recruited by Jabba. As the scientist was just arriving on Tatooine and did not know any of Jabba's men, Ind tasked a spacer with picking him up before Jabba's thugs. The spacer thus encountered Doctor Kaum upon his arrival in Mos Eisley and escorted him back to Ind at the Lucky Despot. Unaware that he had been deceived, the scientist began to work for the Valarian syndicate rather than for Jabba's organization. A short time later, Ind discovered that the assassin Roden Venthrall had been hired to assassinate Lady Valarian. The Gran promptly dispatched a spacer to find and kill the assassin before he could murder Valarian. Later, Ind found out that Jabba was attempting to poison the water supplies of the Lucky Despot. Fortunately, the spacers killed the three Jabba's enforcers and recovered the toxic rations. Thereafter, Lady Valarian tasked Ind with stealing an expensive avian egg that had been ordered by Jabba himself to be cooked by his chef Porcellus. After the spacers succeeded in stealing the egg from Jabba's enforcers, Lady Valarian was so pleased that she requested Ind to have the spacers working personally for her.\nInd was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Ind was present in the original release of the game, being part of Lady Valarian's Quest Series.\nWith \"Publish 20\" released on July 19, 2005, it was announced that the \"Valarian Quest Series\" would be phased out during \"Publish 22\" to make way for a revamped questline during \"Publish 23.\" The story of this new Valarian Themepark was centered on the rivalry between Ind and Kavas Urdano. While the old Valarian Quest Series was fully deactivated by Publish 23 on August 31, 2005, the newly proposed questline was never fully implemented to replace it. Ind remained present in the game but was not involved in any quest anymore.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Valarian_Syndicate",
  "/wiki/Kavas_Urdano",
  "/wiki/Tatooine/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Valarian/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Lucky_Despot",
  "/wiki/Cantina/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Model_Q2_hold-out_blaster_pistol",
  "/wiki/Rill_(species)",
  "/wiki/Kaum",
  "/wiki/Doctor/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Roden_Venthrall",
  "/wiki/Bird/Legends",
  "/wiki/Egg/Legends",
  "/wiki/Chef/Legends",
  "/wiki/Porcellus/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/July_19",
  "/wiki/2005",
  "/wiki/August_31",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/CorSec_Database_H-Z",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}