{
 "name": "Indiana_Jones",
 "display_name": "Indiana Jones",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Earth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel-Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Doctor Indiana Jones was a Human male archaeologist on Earth.\nJones's native homeworld was Earth with many oceans and forests. The planet was very primitive compared to the rest of the galaxy, even being surprised at the common sight of a starship. Sometime later, he met a young pickpocket he dubbed Shorty. He also discovered a region on his planet known as Atlantis, along with other strange finds.\nOne day, while exploring ruins in a place called Mexico, Indiana Jones discovered an alien who abducted him to take him back to his home planet of Xantar. While on the planet he was discovered by Luke Skywalker, but was brought back home by the alien shortly after.\nOne of his many discoveries was the habitat of Chewbacca  and the crashed Millennium Falcon, which, as he admitted, was unlike anything he had seen before, even in Atlantis. Jones and his assistant, Shorty, started to explore the ship's wreckage but decided to leave it alone after encountering strangely disturbing remains of Han Solo within.\nA light-skinned man with brown hair and eyes, Jones bore an uncanny resemblance to Rebel Alliance hero Han Solo, which both he himself and fellow hero Luke Skywalker noticed. In the opinion of Bug-Eyes, he was lonely, depressed and cynical.\nJones wore the same clothes wherever he went, including a brown fedora. He also carried a whip and a primitive slugthrower pistol for self-defense.\nDr. Henry Walton Jones Jr., better known as \"Indiana Jones\" or \"Indy\" for short, was created by George Lucas for Raiders of the Lost Ark, and famously played by Harrison Ford . A total of four films have been made, which were co-written and produced by George Lucas and directed by Steven Spielberg. The character was also played by Corey Carrier , Sean Patrick Flanery , and George Hall  in George Lucas' The Young Indiana Jones Chronicles television series. He was also portrayed by the late River Phoenix  in the opening scenes of Indiana Jones and the Last Crusade.\nIn addition to being the inspiration for Chewbacca, George Lucas' late dog Indiana was the inspiration for the Indiana Jones character. Also, Lucas' middle name is \"Walton,\" which is revealed to be Indiana's middle name in The Young Indiana Jones Chronicles.\nMany cast and crew members, as well as authors, have been involved in both the Star Wars and Indiana Jones franchises:\nLEGO Star Wars II: The Original Trilogy features Indiana Jones's signature hat in the level where Han Solo and Chewbacca go to meet Luke Skywalker, Obi-Wan Kenobi, R2-D2 and C-3PO at Docking Bay 94 in Mos Eisley. Also featured is a baseball cap, a tall hat, and a witch's hat.\nLEGO Star Wars: The Complete Saga features a playable cameo by Dr. Jones, most likely due to the upcoming release LEGO Indiana Jones: The Original Adventures, and the ease of porting character files between compatible games. The game features him using a whip or a pistol. Also, like many other characters, he can jump, roll, and fire three shots rapidly. Previews of LEGO Indiana Jones show him with stubble on his face. However, his face here is the same as Han Solo's .\nIn The Paradise Snare, Han Solo has many aliases given by Garris Shrike. One of them is \"Jenos Idanian\", an anagram of \"Indiana Jones\". Also, the name of xenoarchaeologist Henrietya \"Corellia\" Antilles parallels that of Henry \"Indiana\" Jones; both are archaeologists, both have a place name as a nickname, and both have a last name considered common in their respective universes.\nJones makes an appearance in Star Wars: Yoda Stories , where Luke Skywalker comments on his similarity to Han Solo.\nIn the 2009 game Indiana Jones and the Staff of Kings, Han Solo is one of the unlockable skins for the PlayStation 2 and Wii versions.\nThe character of Doctor Chelli Lona Aphra, created by writer Kieron Gillen for Marvel Comics' series Star Wars: Darth Vader and Star Wars: Doctor Aphra, was conceived as the archaeological antithesis of Indiana Jones, according to Star Wars: Darth Vader Vol. 2. Her ship, the Ark Angel, is also named after the Ark of the Covenant, the MacGuffin which Jones sought out in Raiders.\nIn the Star Wars Rebels episode \"Through Imperial Eyes,\" the Holy Grail from Indiana Jones and the Last Crusade is displayed alongside other artifacts such as the helmet of Commander Gree in the office of Grand Admiral Thrawn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Indiana_Jones",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Earth/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Archaeologist/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Short_Round",
  "/wiki/Atlantis",
  "/wiki/Xantar",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Fedora",
  "/wiki/Slugthrower",
  "/wiki/Star_Wars:_Yoda_Stories",
  "/wiki/George_Lucas",
  "/wiki/Harrison_Ford",
  "/wiki/Steven_Spielberg",
  "/wiki/Indiana",
  "/wiki/Carrie_Fisher",
  "/wiki/James_Luceno",
  "/wiki/Rick_McCallum",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Jonathan_Hales",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars_Insider",
  "/wiki/Indy_Vault",
  "/wiki/Jonathan_W._Rinzler",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/Julian_Glover",
  "/wiki/Michael_Sheard",
  "/wiki/Anthony_Daniels",
  "/wiki/Ian_McDiarmid",
  "/wiki/William_Hootkins",
  "/wiki/Bruce_Boa",
  "/wiki/LEGO_Star_Wars_II:_The_Original_Trilogy",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Docking_Bay_94/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/LEGO_Star_Wars:_The_Complete_Saga",
  "/wiki/LEGO",
  "/wiki/The_Paradise_Snare",
  "/wiki/Garris_Shrike",
  "/wiki/Jenos_Idanian",
  "/wiki/Xenoarchaeology/Legends",
  "/wiki/Henrietya_Antilles",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Kieron_Gillen",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_Darth_Vader",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Star_Wars:_Darth_Vader_Vol._2",
  "/wiki/Ark_Angel_II",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Through_Imperial_Eyes",
  "/wiki/CC-1004",
  "/wiki/Thrawn%27s_Office",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/LEGO_Star_Wars:_The_Quest_for_R2-D2_(film)",
  "/wiki/LEGO_Star_Wars:_Bombad_Bounty",
  "/wiki/LEGO_Star_Wars:_Attack_of_the_Clones",
  "/wiki/Star_Wars:_The_Clone_Wars:_Republic_Heroes",
  "/wiki/Star_Wars_Galactic_Spy",
  "/wiki/Into_the_Great_Unknown",
  "/wiki/Star_Wars_Tales_19",
  "/wiki/LEGO_Star_Wars_III:_The_Clone_Wars",
  "/wiki/Star_Wars:_The_Roleplaying_Game_(first_edition)",
  "/wiki/George_Lucas:_The_Creative_Impulse",
  "/wiki/Star_Wars:_Panel_to_Panel_Volume_2:_Expanding_the_Universe",
  "/wiki/Star_Wars_Year_by_Year:_A_Visual_Chronicle",
  "/wiki/50_Great_Reasons_to_Rewatch_Star_Wars:_The_Clone_Wars_Season_Three",
  "/wiki/Star_Wars_Insider_125",
  "/wiki/Star_Wars:_The_Lightsaber_Collection"
 ]
}