{
 "name": "Indo_Zal",
 "display_name": "Indo Zal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zakuul"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eternal Empire",
      "Zakuulan rebels",
      "Eternal Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Indo Zal was a male Human citizen of the Eternal Empire of Zakuul. Losing his parents at young age, he was raised by his sister Kalya, a Scion of Zakuul, who was killed by High Justice Vaylin during the Scion massacre. Indo desired revenge and insulated himself into Vaylin's inner circle, becoming her Magistrate of Revelry, while secretly working to undermine her. In 3630 BBY he helped the Alliance Commander and Theron Shan to infiltrate the Grand Festival of Empress Vaylin, providing them with ion charges so that they could disable the shock collars on the captured Zakuulan rebels, allowing them to join the fight against Vaylin. His deception was discovered, and Indo was about to be executed along with the rebels, but was saved by the Alliance Commander. Escaping the destruction of the Palace of the Eternal Dragon, Indo later led the rebels to assist the Commander during the Battle of Zakuul.\nWhen Indo was six years old, his mother and father, both decorated Knights of Zakuul, died in the Battle of Scyva. Indo was raised by Kalya Zal, his older sister who was a member of the Scions of Zakuul. She instilled into him the value of patience and taught Indo how to influence people, act like the Zakuulan elite, and navigate the social labyrinth of the Eternal Empire. Indo became the Magistrate of Revelry, managing luxury cruisers, organizing planet-wide festivals and overall enjoying his career as Zakuul's premier entertainer. His high point was officiating the execution of High Justice Yuriem.\nAfter the assassination of Valkorion in 3636 BBY, his son Arcann took the Eternal Throne and initiated the Scion massacre, in which Indo's beloved sister was executed by Arcann's sister Vaylin. Striken by grief, Indo was eager for revenge, but decided to go about it the smart way, slowly insulating himself into Vaylin's employ, eventually becoming her personal attendant by the time she became Eternal Empress. All this time, Indo dreamt of bringing her down. In 3631 BBY he helped Lana Beniko's astromech droid T7-O1 infiltrate the Spire. Eventually, Indo found a way to contact the Alliance that was based on Odessen and actively worked to remove Vaylin from power. Indo informed Beniko, Theron Shan and the Alliance Commander about the upcoming Grand Festival of Empress Vaylin and suggested to use the rebels that Vaylin planned to execute as a means for the Alliance to get close to her. Indo provided the shuttle, Zakuul Knight disguises and security clearances that were used by Theron Shan and the Commander to infiltrate the Palace of the Eternal Dragon.\nAs the party started, Indo insured Vaylin that the party quests were toasting her name and that the rebels were adorned with shock collars. He then met his accomplices and explained the next part of his plan. He provided them with ion charges that needed to be attached to security relays throughout the Palace, so that they could be detonated at once and disable the rebels' shock collars. Leaving the task to the Alliance, Indo went back to Vaylin's side, however he was caught spying on her during a talk with Jarak, which blew his cover and earned him a collar of his own. Vaylin made speech, promising to execute Indo along with the rebels, but was interrupted by the first the Alliance Commander and then former Emperor Arcann. Indo and the rebels were tossed into the beast pit, but the Commander and Theron Shan managed to save them from a gruesome fate. The Commander then ordered Indo to bring Rebels to safety, which proved fortunate, as Vaylin ordered the Eternal Fleet to bomb the Palace into rubble, regardless of her supporters still inside.\nIndo eventually made it to a hideout and send a message to the Alliance relaying his current condition. Vaylin was soon killed during assault on Odessen, which led to Eternal Fleet GEMINI captains going rogue and initiating a blockade around Zakuul. When the Commander returned to Zakuul to claim the Eternal Throne, Indo and the rebels assisted them at the Garden of Izax by using Missile launchers to destroy several Eternal Empire Walkers. After the Commander took the Eternal Throne and proclaimed the era of the Eternal Alliance, Indo personally managed the party, which he considered his finest yet.\nDuring Knights of the Eternal Throne Chapter VI: The Dragon's Maw, player can make a Dark Side choice and order Indo to lead the rebels against the Knights, instead of leading them to safety. In this case Indo will sustain an injury, will send a message from a hospital instead of a hideout and during Chapter IX: The Eternal Throne will note that the Rebels have lost their faith in the Alliance.\nIf the player makes the Dark Side choice to addess the galaxy as a new Emperor at the very end of Knights of the Eternal Throne, \"The Nathema Conspiracy\" flashpoint will show that Indo came to regret his decision to trust the Commander, admitting it to be an error in judgement. Seeking to liberate his people from the Alliance control, Indo joins the Order of Zildrog led by former Horizon Guard Vinn Atrius, only to be sacrificed as fuel to awaken Zildrog by GEMINI 16 on Nathema. If the player makes the Light Side choice to address the galaxy as a peacekeeper, Zakuulans are left free to rule themselves and Indo Zal has no reason for revenge, his place as Zildrog's victim taken by Darth Mortis instead.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zakuul",
  "/wiki/Human/Legends",
  "/wiki/Zakuulan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Zakuulan_rebels",
  "/wiki/Eternal_Alliance",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Kalya_Zal",
  "/wiki/Scions_of_Zakuul",
  "/wiki/High_Justice",
  "/wiki/Vaylin",
  "/wiki/Scion_massacre",
  "/wiki/Magistrate_of_Revelry",
  "/wiki/3630_BBY",
  "/wiki/Alliance_Commander",
  "/wiki/Theron_Shan",
  "/wiki/Grand_Festival_of_Empress_Vaylin",
  "/wiki/Ion_charge/Legends",
  "/wiki/Palace_of_the_Eternal_Dragon",
  "/wiki/Battle_of_Zakuul",
  "/wiki/File:Magistrate_of_Revelry.png",
  "/wiki/Indo_Zal%27s_mother",
  "/wiki/Indo_Zal%27s_father",
  "/wiki/Knights_of_Zakuul",
  "/wiki/Battle_of_Scyva",
  "/wiki/Yuriem",
  "/wiki/Assassination_of_Valkorion",
  "/wiki/3636_BBY",
  "/wiki/Arcann",
  "/wiki/Eternal_Throne",
  "/wiki/3631_BBY",
  "/wiki/Lana_Beniko",
  "/wiki/Astromech_droid/Legends",
  "/wiki/T7-O1",
  "/wiki/Spire_(Zakuul)",
  "/wiki/Odessen",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/File:Indo_Zal_1.png",
  "/wiki/Slaving_collar",
  "/wiki/Jarak",
  "/wiki/Eternal_Fleet",
  "/wiki/Assault_on_Odessen",
  "/wiki/GEMINI",
  "/wiki/Garden_of_Izax",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Eternal_Empire_Walker",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Order_of_Zildrog",
  "/wiki/Horizon_Guard",
  "/wiki/Vinn_Atrius",
  "/wiki/Zildrog",
  "/wiki/GEMINI_16",
  "/wiki/Nathema",
  "/wiki/Darth_Mortis"
 ]
}