{
 "name": "Ingo Wavlud",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Byss"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith"
     ]
    }
   ]
  }
 ],
 "content": "Ingo Wavlud was a suspected Sith sympathizer from Byss. He was the author of the Wavlud Manuscript, which covered such elements of the Sith dynasties as the Darth title. Wavlud's heavily annotated work later fell into the hands of the Galactic Alliance, and was translated by agent Gannod Chant. It was later used by Jedi historian Tionne Solusar in her writings.\nA suspected Sith sympathizer, Ingo Wavlud hailed from the planet Byss. He was the author of the heavily annotated Wavlud Manuscript. In it, Wavlud covered the genesis of the Darth title, as well as elements of Darth Sidious' life. In his studies of the Darth title, Wavlud, going by the belief that Darth Revan and Darth Malak were the first to use the title, conjectured that the name may have been derived from the Rakatan word Daritha, which meant \"Emperor.\" Another theory he touched upon was that Darth came from the Rakatan darr tah, meaning \"victory over death.\" In trying to explain the origins of the name, Wavlud claimed that there was no definitive answer, as many other cultures and species could, and had, made claims to the etymology of the title.\nAlthough he did not go into details, Wavlud made further comments on subsequent users of the title, such as Darth Bandon, Darth Traya, Darth Nihilus, and Darth Sion. Furthermore, he had discovered that the Zelosian Darth Rivan had taken his name from a corrupted Sith manuscript that showed Revan's name as \"Rivan.\" The Wavlud Manuscript also covered Darth Bane and Darth Zannah, as well as Darth Cognus and Darth Millennial, the latter of whom founded the Prophets of the Dark Side. Wavlud also researched Darth Plagueis, who had been murdered by Sidious. The suspected Sith sympathizer also knew of Sidious' true identity: Palpatine, the man who had ruled the galaxy for over twenty years. In covering Sidious, Wavlud also mentioned the Dark Lord's three known Sith apprentices: Darth Maul, Darth Tyranus, and Darth Vader.\nAt some stage, Wavlud noted his opinion on the heralded Columus Data Card. The Data Card contained a recording of dying Jedi Padawan Danzigorro Potts, and was believed to have been made circa 24,500 BBY. Potts, who had fought in the First Great Schism, spoke out in the recording against the now-dead Dark Jedi Xendor, and called into question the teachings of the dark side of the Force. The Data Card had been the inspiration for at least three Coruscanti operas, but Wavlud believed that it was nothing more than Jedi propaganda.\nThe Wavlud Manuscript was later recovered from Wavlud's personal effects by the Galactic Alliance Council on Security and Intelligence, and was translated by special agent Gannod Chant. It was later passed on to the New Jedi Order. It was subsequently used in conjunction with Murk Lundi's The Lundi Series by Jedi historian Tionne Solusar to create what was thought to be a comprehensive collection of knowledge on the Sith.\nIngo Wavlud was deeply interested in the Sith, and compiled a heavily annotated history of their evolution. He was highly critical of the Columus Data Card, which had generally been revered enough to inspire several operatic adaptations. Wavlud believed that the contents had no validity as historical documents, passing them off as propaganda.\nIngo Wavlud was first mentioned and depicted in Ryder Windham's Jedi vs. Sith: The Essential Guide to the Force, which was published in 2007. For the drawing of Wavlud, Del Rey editor Keith Clayton and Erich Schoeneweiss based the depiction on author Windham. During Celebration IV, they, along with artist Chris Trevas, photographed Windham holding a waiter's serving tray. The photos served as inspiration for Trevas' final drawing of Wavlud.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ingo_(disambiguation)",
  "/wiki/Byss/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Wavlud_Manuscript",
  "/wiki/Darth/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Gannod_Chant",
  "/wiki/Tionne_Solusar",
  "/wiki/Planet/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Rakata/Legends",
  "/wiki/Daritha",
  "/wiki/Darr",
  "/wiki/Tah",
  "/wiki/Species/Legends",
  "/wiki/Darth_Bandon",
  "/wiki/Kreia",
  "/wiki/Darth_Nihilus",
  "/wiki/Darth_Sion",
  "/wiki/Zelosian",
  "/wiki/Darth_Rivan",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/Darth_Cognus",
  "/wiki/Darth_Millennial",
  "/wiki/Prophets_of_the_Dark_Side",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Columus_Data_Card",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Danzigorro_Potts",
  "/wiki/24,500_BBY",
  "/wiki/First_Great_Schism",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Xendor",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Council_on_Security_and_Intelligence",
  "/wiki/New_Jedi_Order",
  "/wiki/Murk_Lundi",
  "/wiki/The_Lundi_Series",
  "/wiki/Ryder_Windham",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/2007",
  "/wiki/Del_Rey",
  "/wiki/Erich_Schoeneweiss",
  "/wiki/Celebration_IV",
  "/wiki/Chris_Trevas",
  "/wiki/Book_of_Sith:_Secrets_from_the_Dark_Side",
  "/wiki/July_29",
  "/wiki/2010"
 ]
}