{
 "name": "Inkur",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ugnaught"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Irden tribe"
     ]
    }
   ]
  }
 ],
 "content": "Inkur was the dealmaker for the Irden tribe of Ugnaughts. He resided on Cloud City, located on Bespin.\nInkur acted as a dealmaker for the Irden tribe, constantly moving through the middle and lower levels of Cloud City, in particular Port Town, looking for information of interest to the Irden Council. He placed the interests of his tribe over his own personal profit and was completely honest in his dealings. Inkur never took a bribe and knew that making good deals was in the best interest of the Irden.\nThose wishing to avoid Cloud City's cumbersome bureaucracy often sought out Inkur as he could arrange for false identification and landing permits for the right price. His deals were worked out so they would not implicate the Irden if uncovered. The only practice that Inkur did not engage in was Tibanna gas smuggling since that could endanger the tribe and possibly the independence of Cloud City itself.\nDuring the Galactic Civil War, the Irden tribe tasked Inkur to procure several large repulsorlift generators. Inkur was not told the reason why, but he suspect that the tribe was planing to build mining platforms in the lower levels of Bespin's atmosphere.\nInkur was a male Ugnaught in his mid-thirties during the Galactic Civil War, and had light brown skin with a bright, pink snout.\nScrupulously honest, Inkur was also skeptical and long ago learned not to trust people at face value. However, he was known to help those genuinely down on their luck which resulted in a number of beings owing him favors across Cloud City.\n\"Inkur\" was also a common name in the Ugnaught.\nInkur carried a datapad and wore a faded red smock.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ugnaught/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Irden",
  "/wiki/Cloud_City/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Port_Town_(Cloud_City)/Legends",
  "/wiki/Irden_Council",
  "/wiki/Tibanna/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Ugnaught_(language)/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin_(Second_Edition)",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}