{
 "name": "Iolo_Arana",
 "display_name": "Iolo Arana",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Keshi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Keshian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Rapier Squadron",
      "Rapier Squadron",
      "Resistance",
      "Dagger Squadron",
      "Dagger Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Iolo Arana was a Keshian male starfighter pilot who served as a lieutenant in the New Republic Starfleet and as a member of Rapier Squadron. He ultimately joined the Resistance—along with fellow squadron members commander Poe Dameron and lieutenant Karé Kun—during its conflict with the First Order. As a member of the Resistance, he was promoted to the rank of captain and given command of Dagger Squadron.\nIolo Arana was a starfighter pilot who flew in the New Republic Defense Fleet's Rapier Squadron, which flew T-85 X-wings in the Mirrin sector. He answered to the callsign Rapier Three and his comrades included Commander Poe Dameron, Lieutenant Karé Kun, and Muran. During one of their routine patrols in the Mirrin sector, Iolo and his squadron responded to a distress message from the freighter Yissira Zyde near Suraz 4. Rapier Squadron were subsequently caught up in a dogfight with First Order TIE/fo space superiority fighters which ended with the death of Muran.\nDespite Major Lonno Deso's orders, Dameron was determined to avenge Muran and to track down the stolen freighter. While on a routine patrol, Dameron got Arana and Kun to upload all telemetry from the Suraz engagement into his droid BB-8. Arana and Kun agreed to cover for Dameron while he departed on his errant mission. Following the skirmish in OR-Kappa-2722, Dameron was recruited by General Leia Organa into the Resistance, a private paramilitary offshoot of the New Republic Defense Force that monitored the First Order's activities.\nWith Arana and Kun facing disciplinary action for helping Dameron, the two also joined the Resistance. Arana became the captain of Dagger Squadron, which was stationed aboard the Mon Calamari cruiser Echo of Hope. Due to their friendship with Dameron, Arana and Kun took part in Operation: Sabre Strike, a secret mission to steal the New Republic Senator Erudo Ro-Kiintor's yacht Hevurion Grace. Organa suspected that Ro-Kiintor was colluding with the First Order and wanted to access his ship's logs. For the mission, the three pilots posed as members of the Irving Boys and flew vintage Z-95 Headhunters. The Resistance pilots ambushed the Hevurion Grace in space. Arana managed to disable the yacht with modified concussion missiles, allowing Dameron to board the ship and drive Ro-Kiintor and his crew into the escape pod.\nBefore they could return to the Echo of Hope, the Resistance pilots were attacked by a large First Order fleet. Following a pursuit, Arana and his comrades managed to outrun their First Order pursuers including a Resurgent-class Star Destroyer and fled into hyperspace. Due to their successful mission, the Resistance obtained irrefutable evidence of Ro-Kiintor's treason and discovered that the explorer Lor San Tekka was still alive. Believing that Tekka held the key to finding her lost brother Luke Skywalker, Organa dispatched Dameron to find Tekka.\nIolo Arana was a male Keshian, a baseline humanoid species with large and oddly colored eyes, allowing them to detect a broad spectrum ranging from ultraviolet to infrared which gave Arana an advantage in dogfights. Arana was loyal to his friend Poe Dameron. He and Karé Kun followed Dameron into the Resistance and took part in Operation: Sabre Strike. While in New Republic service, Arana found the routine patrol flights in the Mirrin sector boring and longed for real combat. Arana was able to fly various starships including T-85 X-wings and vintage Z-95 Headhunters.\nIolo Arana first appeared in Greg Rucka's junior novel Before the Awakening, which was released on December 18, 2015 in conjunction with Star Wars: Episode VII The Force Awakens.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Age_of_Resistance_-_Poe_Dameron_1",
  "/wiki/Kidnapped!",
  "/wiki/Keshi",
  "/wiki/Keshian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/New_Republic",
  "/wiki/Rapier_Squadron",
  "/wiki/Resistance",
  "/wiki/Dagger_Squadron",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Lieutenant",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Squadron",
  "/wiki/Commander",
  "/wiki/Poe_Dameron",
  "/wiki/Kar%C3%A9_Kun",
  "/wiki/Cold_War",
  "/wiki/First_Order",
  "/wiki/Military_rank",
  "/wiki/Captain",
  "/wiki/T-85_X-wing",
  "/wiki/Mirrin_sector",
  "/wiki/Callsign",
  "/wiki/Rapier_Three",
  "/wiki/Muran",
  "/wiki/Sector",
  "/wiki/Distress_signal",
  "/wiki/Freighter",
  "/wiki/Yissira_Zyde",
  "/wiki/Suraz_4",
  "/wiki/Suraz_engagement",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Death",
  "/wiki/Major",
  "/wiki/Lonno_Deso",
  "/wiki/Droid",
  "/wiki/BB-8",
  "/wiki/Skirmish_in_OR-Kappa-2722",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/New_Republic_Defense_Force",
  "/wiki/MC80_Star_Cruiser",
  "/wiki/Echo_of_Hope",
  "/wiki/Operation:_Sabre_Strike",
  "/wiki/Senator",
  "/wiki/Erudo_Ro-Kiintor",
  "/wiki/Yacht",
  "/wiki/Hevurion_Grace",
  "/wiki/Starship",
  "/wiki/Irving_Boys",
  "/wiki/Z-95_Headhunter",
  "/wiki/Resistance_pilot",
  "/wiki/Realspace",
  "/wiki/Concussion_missile",
  "/wiki/Escape_pod",
  "/wiki/First_Order_Navy",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Hyperspace",
  "/wiki/Treason",
  "/wiki/Scout",
  "/wiki/Lor_San_Tekka",
  "/wiki/Luke_Skywalker",
  "/wiki/Hunt_for_Lor_San_Tekka",
  "/wiki/Humanoid",
  "/wiki/Species",
  "/wiki/Eye",
  "/wiki/Spectrum",
  "/wiki/Ultraviolet",
  "/wiki/Infrared",
  "/wiki/Greg_Rucka",
  "/wiki/Before_the_Awakening",
  "/wiki/December_18",
  "/wiki/2015",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_24",
  "/wiki/Poe_Dameron:_Flight_Log"
 ]
}