{
 "name": "Iona_Retter",
 "display_name": "Iona Retter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "17 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.68 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Iona Retter was once a loyal servant of the Galactic Empire who eventually grew to see her belief in it shattered and so became a spy for the Rebel Alliance and later the New Republic\nBorn to staunch military parents, Iona grew up a \"navy brat\" and followed her mother and father from one assignment to the next. As she was growing up, she was taught her of her families' illustrious naval history, as well as instilling a sense of duty to the Empire in her mind. It was only fitting that, when she came of age, she joined the Imperial ranks and eventually became an Imperial Intelligence agent. Iona grew to be a quietly idealistic woman who was professional but friendly, and was often accused of being too serious.\nHer belief in the Empire was shattered, however, when they arrested her brother and slaughtered his friends. She soon joined the growing Rebel Alliance and made it her mission to track down her brother or find any information related to him or what he was involved in; a task which she was still unable to perform as of the birth of the New Republic. Her task was made all the more difficult when Moff Arundel ousted her as a spy causing her to flee. Because of this, she made it her personal mission to get revenge against him.\nAlthough Iona Retter's date of birth is not explicitly stated, she is said to be 22 years old in InQuest Gamer 33. As this magazine also mentions her being ousted as a spy for the \"Rebel Alliance/New Republic\", it can be assumed that it is set during 5 ABY when the New Republic was formed. With that information, a date of birth of 17 BBY can be extrapolated.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/17_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Arundel",
  "/wiki/5_ABY/Legends"
 ]
}