{
 "name": "Iothene Jacontro",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kerestian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jacontro's gang"
     ]
    }
   ]
  }
 ],
 "content": "Iothene Jacontro was a Kerestian male who worked as a big game hunter during the reign of the Galactic Empire.\nJacontro visited Vandor yearly, usually to hunt for animals or treasure. Initially, he was searching for the Corubalni Hoard. While doing this, he released a group of Wampas on the planet and let people hunt them down as trophies. However, before the hunt began, his crew got into a brawl with a group of Selkath pirates known as the Valarine School. When Jacontro came down the next morning to start the hunt, he found most of his group dead or locked in jail. He was forced to hire most of the undependable regulars of The Lodge to fill out the party. He and his group left to search for the treasure. While they were gone, the wampas he had released made their way to Fort Ypso and started to attack the Kod'yok herds. The owner of The Lodge, Tibbs Ospe, was forced to put together a hunting party to kill them before they destroyed the settlement. Jacontro returned alone after losing his whole crew and with a severely frostbitten arm. As he was settling his debts, a bull wampa burst into The Lodge and began attacking everyone present. Opse returned in time to kill the beast. The arms were stuffed and mounted in a back room that was named Iothene's Den after the hunter who was responsible for the attack.\nHe later was part of a crew who were convinced that a vastadon lived in the mountains of the planet Vandor, and returned to the world each year to brave the wilderness and search for the beast, even after he lost his right arm to gangrene caused by exposure to the elements. In 10 BBY, Jacontro spent time in the Lodge on Vandor, where many thought his quest for the vastadon was foolish. While at the Lodge, Jacontro watched a game of sabacc being played in the back room\nHe wore a black climber's mask with oxygen concentrators, a brown cloak and a black tunic.\nIothene Jacontro first appeared in the 2018 film Solo: A Star Wars Story and was first identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kerestian",
  "/wiki/Gender",
  "/wiki/Big_game_hunter",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Vandor",
  "/wiki/Wampa",
  "/wiki/Selkath",
  "/wiki/Pirate",
  "/wiki/Valarine_School",
  "/wiki/Jail",
  "/wiki/The_Lodge",
  "/wiki/Fort_Ypso",
  "/wiki/Kod%27yok",
  "/wiki/Tibbs_Ospe",
  "/wiki/Limb",
  "/wiki/Mountain",
  "/wiki/Planet",
  "/wiki/Standard_year",
  "/wiki/Gangrene",
  "/wiki/10_BBY",
  "/wiki/Sabacc",
  "/wiki/Color",
  "/wiki/Oxygen",
  "/wiki/Cape",
  "/wiki/Clothing",
  "/wiki/2018",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_3",
  "/wiki/Lando_-_Double_or_Nothing_5",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}