{
 "name": "Iran_Ryad",
 "display_name": "Iran Ryad",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 5 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Countess Iran Ryad was a Human female Imperial politician and starfighter ace. A career in politics during the reign of Emperor Palpatine saw her become a wealthy and influential individual who could afford to take up starfighter pilot training as a hobby. After the the loss of many skilled Imperial pilots during the Battle of Endor in 4 ABY, Ryad gave up her political career to become a pilot. She used her influence to requisition an advanced TIE/D Defender as her personal starfighter and eventually gained command of Red Star Squadron. Under Ryad's command, the squadron began attacking any ships that ventured into Imperial space unannounced. After Ryad was accused of treason, she was hunted down and killed by the Imperial ace Baron Soontir Fel.\nA Human female, Countess Iran Ryad forged a career as a politician in the Galactic Empire, giving her a position of wealth and influence. Throughout her life, she developed a fascination not only for military politics, but also for the Imperial Navy and starfighters. The latter obsession encouraged Ryad to seek training as a starfighter pilot, a hobby enabled by her political connections and prodigious wealth.\nSometime following the Battle of Yavin, Iran Ryad partook in a skirmish against at least one Rebel pilot. Ryad was defeated in the fight, but managed to escape alive in her crippled TIE Oppressor.\nAround 3 ABY, the Empire developed the TIE/D Defender, a radical departure for the TIE Series which featured many systems absent from most Imperial starfighters, including both deflector shields and a hyperdrive. The high cost of the starfighter, together with its departure from standard Imperial tactics, made it unpopular and Ryad was one of the few experienced and influential politicians to argue in favor of the new starfighter.\nIn 4 ABY, the Galactic Empire suffered a major defeat at the Battle of Endor at the hands of the Alliance to Restore the Republic. Emperor Palpatine himself was killed, as was his apprentice, Darth Vader. Furthermore, the Imperial Navy suffered heavy losses, including the destruction of the second Death Star and many of its most skilled TIE pilots. The death of Palpatine saw the Empire begin to fragment, with rival military figures declaring themselves warlords and attempting to establish their own dominions.\nWith the Empire running short of skilled pilots, Ryad abandoned her career as a politician and became an Imperial pilot, in time utilizing her connections to requisition a TIE Defender to serve as her personal starfighter, the Red Star 1. Ryad had the ship modified at a cost of 62,500 credits, fitting it with an enhanced shield generator, an improved ion drive for greater maneuverability and advanced fire control systems.\nThe Countess spent over a year leading a flight group of four TIE Defenders on patrols of the Coreward borders of what remained of Imperial space. After a dozen successful patrols, Ryad had scored a high number of kills and became a starfighter ace. Her achievements resulted in her gaining command of her own squadron. Ryad filled Red Star Squadron with like-minded pilots who shared her idea of a zero-tolerance border policy. With Ryad leading the squadron from the Red Star 1, the Imperial pilots relentlessly pursued any starships that entered Imperial space without permission.\nThroughout her career, Ryad had gained rivals within the Empire, foremost among them being another notable Imperial pilot, Baron Soontir Fel, a veteran of the Galactic Civil War who had remained loyal to the Empire under the rule of Ysanne Isard, the former Director of Imperial Intelligence who served as the steward of the Empire following Palpatine's death. Around 5 ABY, Ryad's actions led her to be accused of treason and she was hunted down and killed by Fel.\nIran Ryad was an eccentric and influential politician and diplomat with a long-held interest in the military and spacer history. She was not afraid to use either her wealth or connections for personal gain. She used her influence to have herself trained as a starfighter pilot and later to acquire her personal TIE Defender. Although piloting was initially merely a hobby for her, she devoted herself to it and became a skilled pilot and commander who could inspire confidence from those serving under her. Ryad went against conventional ideas on military tactics, favoring the use of the TIE Defender over large waves of unshielded starfighters and advocating a strict border policy in which any unannounced intruders were destroyed. Her beliefs, however, had a high cost and ultimately led to her death.\nIran Ryad was created by Brian Campbell and Owen K.C. Stephens for the Starships of the Galaxy web supplement More Starships!, which was published on Wizards of the Coast's website on November 15, 2001.\nIn the MMORPG Star Wars Galaxies: An Empire Divided, Iran Ryad was added to the game as a non-player character  in Game Update 20. Rebel players who requested Tier 7 Duty Missions from certain space stations had a chance to battle an elite Imperial pilot during the mission's boss stage. One of these pilots could be Iran Ryad. If the player defeated Ryad, the Imperial was not destroyed. Instead, a message was displayed to the player, indicating that they successfully defeated the pilot. The player then received a collection icon which added up to award a badge if they succeeded in destroying all ten of the elite Imperial pilots. However, elite Imperial pilots could also be found flying in various space battles, which took place in the Naboo, Tatoo, and Corellian system. Because Ryad only appeared in the space portion of Star Wars Galaxies, originally added with the Jump to Lightspeed expansion pack, she could normally only be seen inside her respective TIE Oppressor. However, a comm display could appear during the battle, displaying Ryad's face. In addition, the collection icon depicted Ryad's physical appearance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ryad",
  "/wiki/Iran_Ryad",
  "/wiki/5_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Count/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Ace/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/TIE_pilot",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/TIE/D_Defender",
  "/wiki/Red_Star_1",
  "/wiki/Red_Star_Squadron",
  "/wiki/Squadron/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Death/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Soontir_Fel/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Canon",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/TIE_Oppressor",
  "/wiki/3_ABY/Legends",
  "/wiki/TIE_Series",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Ion_drive",
  "/wiki/Targeting_computer/Legends",
  "/wiki/Flight_group/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Ysanne_Isard",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Brian_Campbell",
  "/wiki/Owen_K.C._Stephens",
  "/wiki/Starships_of_the_Galaxy",
  "/wiki/More_Starships!",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Wizards.com",
  "/wiki/November_15",
  "/wiki/2001",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Video_game",
  "/wiki/Space_station/Legends",
  "/wiki/Naboo_system/Legends",
  "/wiki/Tatoo_system/Legends",
  "/wiki/Corellian_system",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/Imperial_Veterans_Expansion_Pack",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Galactic_Empire_Conversion_Kit",
  "/wiki/TIE/D_Defender_Expansion_Pack",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_TIE_Fighter",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/The_New_Essential_Guide_to_Characters"
 ]
}