{
 "name": "Iri Camas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Celen"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Special Operations Brigade",
      "Grand Army of the Republic",
      "Special Operations Brigade",
      "Special Operations Brigade"
     ]
    }
   ]
  }
 ],
 "content": "Iri Camas was a male Human Jedi Master who served the Jedi Order and the Galactic Republic as a General in the Grand Army of the Republic. Stationed on Coruscant, General Camas was placed in command of the Special Operations Brigade at the beginning of the Clone Wars; a conflict between the Republic and the Confederacy of Independent Systems.\nA Force-sensitive male Human, Iri Camas was raised by the Jedi Order from early childhood, learning the ways of the Force at the Jedi Temple on Coruscant. Eventually passing the Trials of Knighthood, Camas was made a Jedi Knight and, after further study and devotion to the Order, became a Jedi Master. Serving the Order throughout the Separatist Crisis, Master Camas dutifully took up the rank of General in the newly formed Grand Army of the Republic when the Confederacy of Independent Systems escalated the Separatist Crisis with the Republic.\nUnlike most of his brother and sister Jedi, Camas was placed in an office, serving as Director of Special Forces on Coruscant and was in command of one of the two Special Operations Brigade. Camas' primary concern was the effectiveness of clone troopers, and under his command, the troopers averaged a kill-ratio of 200 Battle Droids per trooper and clone commandos were trained to target droid manufacturing and raw material plants, destroying billions more.\nIn the days following the fateful first battle on Geonosis, Camas attempted to have the Null-class Advanced Recon Commandos put into stasis, hoping that he could use them only when needed as they were considered too independent and hard to control. However, the commandos resisted stasis and Camas demanded to speak with their trainer, Kal Skirata. By the time Skirata had arrived, the Null commandos had taken control of the Special Ops HQ barracks, and the Coruscant Security Force was called in to quell the standoff. Camas, refusing to allow the destruction of the barracks just to contain six unruly clones, ended the standoff by reversing the suspended animation order and appointed Skirata special adviser status to keep the Nulls in line. Soon after that, due to mass casualties, Master Camas' brigade was merged with that of Master Arligan Zey.\nServing the Republic dutifully throughout the rest of the war, Master Camas was able to flee Coruscant when the Grand Army was ordered to slaughter all Jedi by Supreme Chancellor Palpatine, alter-ego of Dark Lord of the Sith Darth Sidious. Going to ground, Camas worked with fellow Masters Plett, Vamilad and Djinn Altis to shuttle surviving Padawans out of the eye of the Galactic Empire. Part of a network that moved apprentices to the Well on Belsavis, Camas stationed himself in a safe house in the city of Chelpori on Celen. Assisted by the Antarian Ranger Jilam Kester, Camas was tracked by the Empire, which dispatched members of the 501st Legion to neutralize him. Squad 40 surrounded his position, being lured inside to confront him. Wielding a blaster, after having allowed Ranger Kester to escape, the war-weary Camas used his lightsaber to ignite the gas main and the building exploded. While three members of the squad escaped, Camas was able to kill one alongside himself. When the surviving troopers searched the rubble, they discovered Camas' remains as well as his lightsaber embedded in the wall opposite the explosion.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Celen",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Special_Operations_Brigade/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Director_of_Special_Forces",
  "/wiki/Battle_Droid",
  "/wiki/Clone_commando",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Null-class_Advanced_Recon_Commando",
  "/wiki/Kal_Skirata",
  "/wiki/Special_Operations_Brigade_Headquarters",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Arligan_Zey",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Plett",
  "/wiki/Vamilad",
  "/wiki/Djinn_Altis/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Plett%27s_Well",
  "/wiki/Belsavis/Legends",
  "/wiki/Chelpori",
  "/wiki/Antarian_Ranger",
  "/wiki/Jilam_Kester",
  "/wiki/501st_Legion/Legends",
  "/wiki/Squad_40",
  "/wiki/Blaster/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Republic_Commando:_Triple_Zero",
  "/wiki/Republic_Commando:_True_Colors",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/Star_Wars_Insider",
  "/wiki/Guide_to_the_Grand_Army_of_the_Republic",
  "/wiki/Star_Wars_Insider_84",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}