{
 "name": "Iris Snow",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light blond",
      "almost white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark violet"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian Slavers Guild"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Her father",
      "Her grandmother"
     ]
    }
   ]
  }
 ],
 "content": "Iris Snow, also called Lady Snow was the owner of the Corellian Slavers Guild.\nIris Snow grew up with the Corellian Slavers Guild knew the business of trading and owning slaves from an early age. Her father and grandmother trained her to one day take over the business. At the age of thirteen she was put in charge of training and punishing the Guild's child slaves, a duty she greatly enjoyed. Her duties increased when she got older until she eventually became the seventh-generation owner of the Guild.\nWith her at the top of the Guild, Iris Snow became known as \"Lady Snow\" by her subordinates. She planned to expand the guild, forging it into a financial empire, which meant she had to find new sources for slaves, but also create higher demands for them. That included expanding her territory, but Snow preferred to make planets that formed her regular market more slaver-friendly.\nIris Snow took an inordinate pleasure at her work. She was cold and calculating and only put on friendly behaviour when arranging deals or influencing other people. Everyone else was treated as potential merchandise and she made no effort to hide this. The Guild's employees were treated little better than the slaves, although they were better paid and protected.\nSnow believed in hands-on politics. She knew every slave of her Guild and had personally punished each one at least once. As a skilled martial artist she made use of her skills in audiences and to teach onlookers and object lesson.\nShe preferred white, blue and purple clothes and used to wear slim pants and boots, but she never wore skirts or a gown.\nSnow was well-trained in ranged and close-quarter combat and possessed good martial arts training. When encountering combat, she preferred to use her customized blaster pistol and reserved her martial arts skills for more personal situations.\nIris Snow was created for the Wizards of the Coast RPG sourcebook Ultimate Adversaries as one of many possible Villains in Chapter 1. She was not era-specific, but could be used in many different times. In the Rise of the Empire era Snow and her guild would mostly operate in the Outer Rim and avoid the Core Worlds. During the Rebellion era, she would support the Galactic Empire, while also opposing the Rebel Alliance. During the New Jedi Order era, she would fight the growing New Republic while trying to carve out her own sphere of influence.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Corellian_Slavers_Guild",
  "/wiki/Slavery/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Boot/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/RPG",
  "/wiki/Ultimate_Adversaries",
  "/wiki/Era",
  "/wiki/Rise_of_the_Empire_era",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Rebellion_era",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Jedi_Order_era",
  "/wiki/New_Republic/Legends"
 ]
}