{
 "name": "Irizi'stal'mustro",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Irizi family",
      "Chiss Syndicure",
      "Irizi family",
      "Chiss Syndicure"
     ]
    }
   ]
  }
 ],
 "content": "Irizi'stal'mustro, known as Zistalmu, was a Chiss male who served first as an Aristocra and later as a Syndic of the Irizi family within the Chiss Ascendancy's Syndicure.\nDespite the Irizi family rivalry with the Mitth family, Zistalmu covertly partnered with Syndic Mitth'urf'ianico to try to sabotage the career of Senior Captain Thrawn.\nLater he even became Syndic Prime and joined Patriarch Irizi'fife'rencpok to the Circle of Unity meeting with the other Patriarchs of the Nine Ruling Families.\nAt some point after the Lioaoin pirate campaign and before the Vagaari pirate operations, Aristocra Zistalmu was tasked with recruiting Senior Commander Mitth'raw'nuru, then a merit adoptive of the Mitth family, to join the Irizi family. Zistalmu understood why the Irizi wished to recruit the Commander, but wondered if they had gone mad. Zistalmu knew that Thrawn was a brilliant military strategist, but was also aware of the officer's potential for political embarrassment. Zistalmu offered Thrawn to join the Irizi as a Trial-born, meaning Thrawn would not have to perform the Trials. Thrawn later asked his friend Ar'alani for her advice on whether he should accept the offer. In the end he decided to stay with the Mitth instead.\nMuch like fellow Syndic Thurfian of the rival Mitth family, Syndic Zistalmu feared that Senior Captain Thrawn could cause lasting damage to the Chiss Ascendancy. He worked with Thurfian to monitor, impede, and eventually try to sabotage Thrawn. Nonetheless, Zistalmu insisted he did not hate Thrawn, but was wary of the Senior Captain's lack of political prowess.\nSyndic Zistalmu and his wife accompanied Admiral Ar'alani on a rescue mission to Primea, the homeworld of the Vak species, to try to ensure that Thrawn's plan would not blow up in the face of the Ascendancy. Nevertheless, Thrawn would end up temporarily stealing a Vak patrol boat with the potential to cause a major diplomatic incident. Ultimately, however, Thrawn and Ar'alani would liberate Primea from the yoke of the Nikardun Destiny , more than making up for it.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Irizi_family",
  "/wiki/Chiss_Syndicure",
  "/wiki/General",
  "/wiki/Ba%27kif",
  "/wiki/Aristocra",
  "/wiki/Syndic",
  "/wiki/Mitth_family",
  "/wiki/Mitth%27urf%27ianico",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Syndic_Prime",
  "/wiki/Patriarch",
  "/wiki/Irizi%27fife%27rencpok",
  "/wiki/Circle_of_Unity",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Lioaoin_pirate_campaign",
  "/wiki/Vagaari_pirate_operations",
  "/wiki/Rematching",
  "/wiki/Senior_Commander",
  "/wiki/Merit_adoptive",
  "/wiki/Trial-born",
  "/wiki/Trials",
  "/wiki/Ar%27alani",
  "/wiki/Politics",
  "/wiki/Nana_(Chiss)",
  "/wiki/Attack_at_Primea",
  "/wiki/Primea",
  "/wiki/Vak",
  "/wiki/Thief",
  "/wiki/Thrawn%27s_patrol_boat",
  "/wiki/Battle_over_Primea",
  "/wiki/Nikardun_Destiny",
  "/wiki/Patrol_boat",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)"
 ]
}