{
 "name": "Irizi'in'daro",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Picket Force Six",
      "Xodlak family",
      "Irizi family",
      "Picket Force Six",
      "Xodlak family",
      "Irizi family"
     ]
    }
   ]
  }
 ],
 "content": "Irizi'in'daro, known by her core name Ziinda, was a was a Chiss female who served as a Senior Captain in Picket Force Six of the Chiss Expansionary Defense Fleet. The commander of the warship Grayshrike, Ziinda was the most driven and focused officer in Admiral Ar'alani's fleet. She was a Trial-born of the Ruling Irizi family of the Chiss Ascendancy. Before her rematching into the Irizi family, she was a merit adoptive of the Great Xodlak family, known as Xodlak'in'daro, along with her core name Lakinda.\nTogether with Senior Captain Mitth'raw'nuruodo, Lakinda foiled a plot by the Grysk Jixtus and Haplif of the Agbui to draw the Chiss Ascendancy into a civil war in 18 BBY. The Grysk's plot involved tricking Chiss family officials such as Patriels and Councilors of rivaling Great Families into staking competing claims into a supposedly nyix–rich Agbui mining world and entering combat against one another. The three Great Families involved in Jixtus's plot were the Xodlak, Pommrio, and Erighal families; each allied with a Ruling Family that rivaled the other two Great Families' allied Ruling Family. As commander of the Xodlak task force, Lakinda was able to take influence on the outcome of the skirmish, preventing a civil war.\nWhen a Kilji warship was lurking inside the Chiss Ascendancy, Ziinda and her ship were tasked to stand guard over Jamiron, aiding Clarr ships in a battle with supposedly Chiss gunboats, which were in truth Grysk ships. Shortly after, Ziinda prevented the destruction of the Clarr light cruiser Orisson at Ornfra, and with that foiled another attempt to start a civil war among the Chiss. As one of Thrawn's few friends, Ziinda was also part of the final battle over Sunrise and did her part in defeating the Grysk fleet.\nLakinda, a female Chiss, was originally born into an obscure family of low prestige in an Oyokal farming community. She \"escaped\" the community to join the Chiss Expansionary Defense Fleet, where she was made a merit adoptive of the Xodlak family and given the name \"Xoldak'in'daro,\" with the core name \"Lakinda.\" Thankful that she was taken in by one of the Forty Great Families, she started climbing up the ranks both to her and her new family's honor, aiming to reestablish the Xodlak to the Ruling Families.\nBy the time the Nikardun threat was dealt with in the Battle over Primea around 19 BBY, Lakinda had been promoted to Senior Captain of the Chiss heavy cruiser Grayshrike. As part of Admiral Ar'alani's fleet, she joined the Nightdragon man-of-war Vigilant and the heavy cruiser Springhawk under the command of Senior Captain Thrawn to clean up the last known bases of the Nikardun in 18 BBY. During the skirmish on the third to last base, the resistance of the Nikardun was stronger than expected. The Grayshrike's thrusters were damaged by an unlucky hit, partially disabling its maneuverability. Thus Lakinda had to accept assistance from the Springhawk and needed to stay behind while the Vigilant searched the rest of the system. In retrospect, Lakinda believed that the Grayshrike should have been enough to defeat the enemy forces. While the Defense Fleet strictly forbid to let family politics have any influence on a commander's decision, Lakinda knew that she had missed a chance to bring honor to the Xodlak.\nAfter Thrawn and the Springhawk had left on a secret mission to the Rapacc system, Ar'alani and Lakinda continued their travels to the second to last Nikardun base they knew of, only to find a couple of destroyed Nikardun ships. While they were gathering data and wondering which force in that part of space could have obliterated the Nikardun, they both received a message from Supreme Admiral Ja'fosk, ordering Thrawn and the Springhawk to immediately return to Csilla. Since Thrawn was no longer with them and out of comm range, Lakinda offered to deliver the message personally, though she hated playing messenger, a task that would bring the Xodlak no honor at all. Ar'alani assured her that the Vigilant would be fully capable in handling the last Nikardun base, and the Grayshrike left for Rapacc.\nOn their way to the Rapacc system, Lakinda feared they might come too late and miss Thrawn. She tried to reduce their travel time by encouraging the Grayshrike's sky-walker Bet'nih with dark cheese to navigate the ship faster through hyperspace. To no avail. They arrived close to the Rapacc system twenty-nine hours after they had left the Vigilant, from which they sent a tight-beam transmission to Rapacc.\nWhile they waited for the Springhawk to respond, Bet'nih was fetched by her caregiver to return to her room. As she stood up, she had some problems with keeping her balance, suffering the aftermath effects of third sight. Commander Wikivv manning the helm station reacted quickly enough to catch her, already knowing about these problems. Later she told Lakinda that especially the younger sky-walkers often suffer those effects when spending more than six hours navigating. Lakinda, therefore, decided to have a talk with the Defense Hierarchy Council, which allowed to force sky-walkers to stay in third sight for up to nine hours, or even twelve hours in an emergency situation.\nAs the Springhawk didn't respond, Lakinda contacted the government of the Paccosh, reaching Uingali foar Marocsaa. He told her that Thrawn had left the Rapacc system seven hours prior, taking a person called the Magys to her homeworld. Lakinda, quite sure that Thrawn had no authorization to undertake such a trip, was surprised to learn that this seemed to be the only way to stop the Magys and her people to commit suicide. Because Uingali was not able to tell Lakinda the name of the Magys's people, nor the name of their homeworld, Lakinda and her first officer Mid Captain Apros questioned his trustworthiness. They still accepted the coordinates of Thrawn's destination given to them by Uingali. Knowing that Bet'nih would not be able to navigate the Grayshrike for some hours, they start their journey there via jump-by-jump.\nLakinda had her crew bridge on full alert when the Grayshrike arrived in the outer edges of the system specified by Uingali and that Thrawn had named Sunrise. Some members of the crew wondered if she was paranoid, but Lakinda knew Thrawn's history. True enough, scans indicated that the Springhawk was engaged in battle with fifteen gunboats of an unknown faction in high orbit of the planet. Hoping to gain some honor for her family, Lakinda decided to join the fight and reinforce Thrawn. Wikivv performed an in-system jump, bringing the Grayshrike directly to the planet, arriving at another angle than Thrawn had.\nFrom that position, they noticed a Battle Dreadnought class starship, the Grysk Shatter-class WarMaster HopeBreaker, orbiting the planet, which size outmatched the two Chiss heavy cruisers combined. The dreadnought at some point attacked the Grayshrike with three missiles, officially engaging the Chiss in battle. Thrawn quickly came up with a desperate, and in Lakinda's opinion insane plan. Since the Springhawk was taking the main risk of the plan, Lakinda agreed in seeing it through. Together they succeeded in destroying the port side sensors of the dreadnought and put it to route. The dreadnought in the end escaped to hyperspace, but destroyed all its surviving gunboats beforehand, leaving no information for the Chiss to collect.\nAfter the battle, Lakinda met with Thrawn and his first officer Mid Captain Samakro aboard the Springhawk to both discuss their victory and to deliver the message from Ja'fosk. She also told Thrawn that Ar'alani suspected the message was coming from the Syndicure, judging by the way it was written. Thrawn understood that he had to depart immediately, leaving him no time to investigate what the alien dreadnought had been doing here. Thrawn also mentioned that the sight of the destroyed surface of the planet had convinced the Magys that her people were lost and had ordered her companion to die, who had already complied. To keep her from killing herself, the Magys had then been put into an hybernation chamber. Lakinda promised to tell nobody about it unless she was being asked a direct question about it from a superior officer. The Springhawk and Grayshrike left the system together, the first on its way to Csilla, the second one back to the Vigilant.\nLater, the Vigilant and the Grayshrike returned to Sunrise to investigate. As they arrived on the nightside of the planet, they could not see any apparent enemy ships. However, the place the dreadnought had been guarding was on the other side of the planet and outside of their view. Soon after their arrival, the Chiss noticed an asteroid on an almost circular orbit around the planet, wondering whether it had been there before or if it was a similar weapon to what Ar'alani had found at the last Nikardun base.\nOn Ar'alani's order, the Grayshrike performed an in-system jump to a spot only a kilometer away from the asteroid, hiding behind it. In the meantime, the Vigilant waited in a higher orbit and soon encountered the same ship coming around the planet that had been chased from this system by Thrawn and Lakinda. After a short conversation between Ar'alani and the commander of the dreadnought, the asteroid began to rotate, confirming that it was indeed an artificial weapon. Lakinda and her bridge crew quickly came up with a plan to disable the missile launcher hidden inside the fake asteroid. Shortly before the battle between the Vigilant and the dreadnought was about to start and the asteroid was ready to fire, Lakinda ordered to open the asteroid shell with laser fire. The asteroid exploded, exposing a lattice holding the missile launcher, which was quickly disabled by the Grayshrike with plasma spheres.\nAr'alani ordered Lakinda to drag the launcher with a tractor beam and join the battle between the two other ships. Lakinda, not understanding that Ar'alani wanted to use the whole lattice with the launcher as a weapon against their enemy, considered she could fetch the launcher later and ordered the Grayshrike to aid the Vigilant immediately. Even without the launcher, the Chiss succeed to overcome the dreadnought, the Grayshrike sneaking up on it from the still blinded port side and destroying the enemy's hyperdrive and one reactor. The enemy commander, knowing he had lost and there was no way out, destroyed the asteroid missile platform and then engaged the self-destruct mechanism, leaving nothing behind but small pieces.\nLakinda apologized for misunderstanding Ar'alani's orders, having the feeling of once again failing to bring honor to her family. She also received another message from Ja'fosk ordering the Grayshrike to return to Csilla to rearm and then reinforce the Springhawk against the Vagaari Pirates. Ar'alani therefore confronted Lakinda that she had a problem with Thrawn. Lakinda denied the accusations, telling the Admiral that no personal opinion or family politics would influence her decisions. After transferring the remaining breachers and plasma fluid to the Vigilant, the Grashrike left for Csilla.\nAs the Grayshrike was almost finished rearming at Csilla, Lakinda got called from hyperdrive tech Lieutenant Commander Lakwurn of the Xodlak. She met with him in the chamber of hyperdrive two, where he told her he had a box that needed to be delivered to Thrawn, and that he could not do it himself because he had received a call about a family emergency declared by the Xodlak. Lakinda, checking her own messages, found out she had received the same message by Patriel Lakooni on the planet Celwis, ordering every Xodlak officers and warriors in the Chiss military to aid the family. Lakinda quickly waged the importance of her assignment on board the Grayshrike or this family emergency, and decided that Thrawn needed only her ship to help him, not her specifically. She gave the command over the Grayshrike to Apros, as well as the box for Thrawn containing a nyix brooch, and departured for Celwis.\nThere she met Senior Aide Lakjiip of Councilor Lakuviv, who was surprised that a Senior Captain had followed the call. She therefore made Lakinda the commander of the family taskforce to lay claim on a nyix mine on an almost uninhabited planet outside the Chiss Ascendancy, currently owned by the peaceful Agbui. With that mine in their possession, the Xodlak hoped to regain their status among the Ruling Families. When Lakinda asked about Patriel Lakooni, Lakjiip answered that she was consulting with Concilor Lakuviv in his offices. In truth, she was locked up there because she did not approve with Lakuviv's plan to claim the mine.\nLakinda took her new assignment as commander of the old family frigate Midsummer, staffed only with Xodlak family members. They were accompanied by the Xodlak cruiser Apogee. Before their departure, Councilor Lakuviv told them that he had instructed the comm officers to ignore every transmission that was not coming from him, fearing that somebody would try to stop the taskforce. Lakinda was not happy with this decision, since she intended to know if somebody was about to stop them. After they had left, she therefore told the comm officer to inform her about any incoming transmission, changing the standing order, which upset her first officer and the comm officer.\nThe comm officer called Lakinda as she was asleep, informing her about an incoming transmission from the Grayshrike. Lakinda, fearing something had happened to her ship in her absence, ordered the comm officer to open the channel. Apros, joined by Thrawn onboard the Springhawk, told her that not only the Xodlak had declared a family emergency, but also the Pommrio and the Erighal. Worse, they gathered in the same region on the rim of the Ascendancy. They also told her about the jewelry given out by the Agbui actually originating from Sunrise, leading to conclusion that the mine Lakinda was tasked to claim for the Xodlak was worthless.\nAssuming that the Erighal and Pommrio, both of the Great Families, were racing to the same destination, they realized that the Agbui were aiming to start a civil war among the Chiss, like they had probably done it with the people of Sunrise. Especially as the three families had three different allies among the Ruling Families. Thrawn quickly came up with an insane plan to prevent the three family task forces from attacking each other. Lakinda made it plain that if it was inevitable, she was prepared for her ships to be destroyed.\nAfter arriving at their destination, a planet called Hoxim, Lakinda's first and second officer demanded to know more about their mission. Because Lakinda only told them the minimum, the first officer threatened her that she might have been the commander of the ship, but he was Xodlak blood. Before Lakinda could say more, the Erighal and Pommrio task forces arrived, laying claim on the world and its resources. Quickly, the situation escalated and the families perpared for battle, when they noticed the Springhawk coming around the edge of the planet, apparently attacked by fourteen gunboats.\nAs the fighters broke off and raced towards the ships of the three family, they quickly decide to join forces under Lakinda's command as she was the highest ranking officer. The fighters, secretly piloted remotely by officers of the Springhawk, attacked the Chiss ships without dealing too much damage, while the Chiss tried to destroy all the fighters. When only eight fighters were left, Lakinda spotted the flaw in Thrawn's plan and retreated to the duty office to contact the Springhawk with a tight-beam transmission about it. She suggested that Thrawn had to find a way to destroy the fake mine so that the families wouldn't find out it to be a ruse and tried to find somebody to blame.\nShe returned to the bridge to find her first and second officer removing her from command under charges of crimes and offenses against the Xodlak family. Knowing that nobody on the bridge would help a merit adoptive against a Xodlak blood, she conceeded and was confined to quarters until after the battle when a proper investigation could be completed. Although Lakinda was no longer in command, Thrawn succeeded to destroy the fake mine and prevent the family task forces to attack each other with the help of the arriving Grayshrike.\nFuelled by the testimony of the first officer aboard the Midsummer, the Xodlak Patriarch was furious with Lakinda, accusing her of failing to secure the mine for the Xodlak. The fact that Patriel Lakooni had stated everything to be a setup and had punished Councilor Lakuviv already, didn't help Lakinda. She even wondered if the Xodlak would remove her from the family and she had to go back to her original minor family, as Syndic Zistalmu approached her, offering her a place in the Irizi family as a Trial-born. Lakinda was stunned by the offer, since the Irizi were one of the Ruling families and a Trial-born was much better than a merit adoptive. She assured Zistalmu to consider it and eventually took the offer.\nHer rematching to \"Irizi'in'daro,\" core name \"Ziinda,\" took place in Speaker Irizi'emo'lacfo's office, and was far less pompous than her rematching to the Xodlak had been. After the cerenomy, she met Speaker Xodlak'brov'omtivti in the Syndicure, who had just learned that Ziinda was to be rematched with the Irizi, and had hoped that she could get the chance to keep Ziinda with the Xodlak. Ziinda bluntly explained her that she knew her time with the Xodlak was over when the first officer of the Midsummer had relieved her of command and had gotten away with it only because he was blood. Lakbrovom assured her that she would bring him to justice, but Ziinda didn't care any longer about the family structure of the Xodlak.\nAfter an unknown alien warship had showed up inside Chiss space, many ships of the Expansionary Defense Fleet were redeployed to guard duty over Ascendancy planets, including the Grayshrike, which was tasked to take position over Jamiron. Upon arrival, Ziinda found herself and her crew facing a strange battle between a group of Clarr freighters and the family light cruiser Orisson versus a couple of Chiss patrol ships. While the Clarr vessels had transponders, there was no signal coming from either attacking patrol ship. The Orisson was damaged and the patrol ships were blocking communication, so Ziinda ordered the Grayshrike to intervene, sending out plasma spheres to disable the attackers.\nWhen the spheres were stopped by dibbers, Ziinda immediately remembered the battle dreadnaught over Sunrise using the same strategy against attacks from the Vigilant. Ziinda therefore assumed that the attackers were not Chiss at all but the same people who had fought them over Sunrise. The Grayshrike was able to disable two of the gunboats, but before they could do more, the Orisson was rejoining the fight and destroying the remaining attackers. The two disabled gunboats then self-destructed, leaving nothing behind for the analysts.\nZiinda, eager to aid the remaining Clarr freighters, was threatened by Captain Roscu from the Orisson to stay out of Clarr business or to face the consequences. The two commanders had an argument about whether the Grayshrike was authorized or even expected to offer aid to the freighters. Roscu made it plain that she would never allow an Irizi to get her hands on Clarr secrets, and told her that the attacking patrol ships had borne the symbols of the Xodlak and the Erighal family, stunning Ziinda for a moment. In the end, Roscu agreed to send the Grayshrike the data they had gathered from the attack, and Ziinda conceded to leave the freighters to the Orisson.\nThe analysts of the Grayshrike figured out that the symbolic patterns added to the suppisedly Erighal ships were completely identical, which marked them as fake as the patterns on real family ships were handcrafted. In a meeting with Supreme General Ba'kif and Admiral Ar'alani, and Senior Captain Wutroow, Ziinda pointed out their findings, and Ba'kif realized the ships had been constructed by the same species the Chiss had faced over Sunrise, acquiring images of the ships at Hoxim. Ziinda almost let out that Thrawn was the one coordinating the attack on the family warships at Hoxim, but caught herself just in time. In the end, the Grayshrike was given new orders by Ba'kif to follow Roscu to Ornfra and make sure the Dasklo would not destry the Orisson.\nThe Grayshrike arrived at Ornfra, a stronghold of the Dasklo family of the Nine Ruling Families and rivals to Roscu's family, before the Orisson. While the Expansionary Defense Fleet ship waited there, it was challenged by the Dasklo family ships. Ziinda knew, if they reacted that way to the Grayshrike, they would be even less happy about a Clarr warship appearing in the system. True enough, as the Orisson arrived, two Dasklo Destroyers moved to intercept.\nBefore Ziinda could warn Roscu that the message the Clarr had received by Jixtus, apparently warning them about the Dasklo gathering new allies, was a fraud, Roscu told her that she did not have time listening to Ziinda, since she was looking for a Mitth spy platform in the system. Roscu cut the comm, ignoring any warning from Ziinda, and aligned the Orisson to jump to the outer system. But the in-system jump overshot their destination by far, giving Ziinda the chance to get there first, after figuring out that Roscu had identified an asteroid as the supposed Mitth spy platform. She immediately realized that this was no Chiss made station, but a similar hidden missile launcher she had faced over Sunrise.\nArriving near the fake asteroid, the Grayshrike also spotted a freighter close to it, which had told System Patrol Command that they were undergoing repairs. Ziinda figured that they were the ones controlling the missile launcher. She ordered her bridge crew to destroy the lauchner platform, but in that moment, the Orisson came back, appearing directly in front of the asteroid, in perfect position to be destroyed. As Roscu still ignored Ziinda's attempt to hail her on the comm, Ziinda ordered the Grayshrike to fire across the Orisson's bow, which got her Roscu's attention. In the end, Ziinda succeeded to tell Roscu that the asteroid was an alien missile launcher platform and provided records from the one they faced over Sunrise, eventually convincing Roscu.\nBefore they could react to the situation though, the asteroid rotated and the missile launcher was alligned to fire at the Orisson. To their mutual surprise, the launcher did not fire when it had the chance. Ziinda, knowing that the aliens planned to start a civil war among the Chiss, eventually realized that their enemies would favor the Chiss to attack each other without their help. Ziinda decided to play their game and ordered Roscu to fire at the Grayshrike and to put up a good show while slowly getting out of reach of the missile launcher. After a short discussion, Roscu agreed to play her part and the fight began.\nAlerted by the laser shots, the two Daskly Destroyers showed up to engage the Orisson themselves, ignoring Ziinda's warning to stay out of the fight. In the end, Ziinda took advantage of them, shooting a plasma sphere at one of the destroyers, but aiming for the alien freighter behind it. The destroyer dodged and the freighter was disabled. Shortly after that, the freighter self-destructed, and seconds later, the missile launcher platform exploded thanks to a dead-man switch. Since no Chiss ship had been damaged, the civil war was averted once more.\nIn 18 BBY, Ziinda, considered as one of Thrawn's few friends, was chosen by Ar'alani to aid in Thrawn's plan to defeat the Grysk fleet over Sunrise. Ar'alani also told her that this was completely unofficial and was likely to have consequences in case they won. Nevertheless, both Ziinda and her first officer Apros agreed to help. Ziinda also suggested to ask Roscu and the Orisson to help and was later able to recruit her. Sensing that Apros had something on his mind, Ziinda confronted him with it and he told her that he would like to make a difference to earn honor for his Csap family.\nIn the final battle over Sunrise in 18 BBY, Apros was tasked to guard and use a secret alien weapon, a gravity well projector, while Ziinda stayed on board the Grayshrike, playing a vital part in the battle against the Grysk. First, the Grayshrike helped to take down a BattleChief and was then engaged in a fight with the StoneCrusher-class WarMaster Emery. Thanks to the gravity-well generator, the element of surprise, and Thrawn's insane plan, the Grayshrike was able to destroy the far larger Emery. After that, the Grayshrike helped the Orisson and the Springhawk to damage another StoneCrusher, the Armageddon, but was then called away to aid Apros in his gunboat, as Jixtus had realized he was a threat. In the end, the damaged Grayshrike put itself between the fleeing flag ship of the Grysks, the FateSpinner, shielding the gunboat with the gravity-well generator on board, which made sure the FateSpinner could not escape. It was eventually disabled by the Kilji warship WhetStone.\nBack on Csilla after the battle, Ziinda received commendation but was furious that Apros hadn't received any. Ba'kif told her that it was because commendation was family business and that the Irizi had sponsored hers, but the Csap hadn't done the same for Apros. Ziinda therefore then suggested promotion for Apros, since this was a decision of the military. Ba'kif asked her whether Apros was ready for it and if she would give up her command and turn the Grayshrike over to him. After hesitating for a moment, Ziinda said she would. Satisfied with her answer, Ba'kif decided to give Apros the Parala instead.\nZiinda was also part of the spectators' group when Thrawn was sentenced to exile by the military tribunal.\nLakinda was extremely loyal to her adoptive Xodlak family, seeking to prove herself worthy of the family and to earn glory for the family. While she was a very skilled tactician, she had a very bad memory for names, which led to the trouble between her and the officers on board the Midsummer. Lakinda considered family status very important, and was humbled and excited when Syndic Zistalmu offered her to become a Trial-born of the Ruling Irizi family.\nZiinda was always looking for adventure and a chance to proof herself, as she had joined the Expensionary Defense Fleet instead of the Defense Force to be able to look for threats in the Chaos rather than waiting for it to come to the Ascendency while on guard duty.\nZiinda commanded the Grayshrike, a Chiss heavy cruiser.\nZiinda appeared in the 2021 novel Thrawn Ascendancy: Greater Good, written by Timothy Zahn. The character was revealed prior to the book's release in an excerpt from the novel released on StarWars.com on March 4, 2021.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Irizi%27in%27daro",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Picket_Force_Six",
  "/wiki/Xodlak_family",
  "/wiki/Irizi_family",
  "/wiki/Core_name",
  "/wiki/Senior_Captain",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Warship",
  "/wiki/Grayshrike",
  "/wiki/Officer",
  "/wiki/Admiral",
  "/wiki/Ar%27alani",
  "/wiki/Fleet",
  "/wiki/Trial-born",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Rematching",
  "/wiki/Merit_adoptive",
  "/wiki/Great_Families",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Grysk",
  "/wiki/Jixtus",
  "/wiki/Haplif",
  "/wiki/Agbui",
  "/wiki/18_BBY",
  "/wiki/Chiss_family",
  "/wiki/Patriel",
  "/wiki/Councilor_(Chiss_Ascendancy)",
  "/wiki/Nyix",
  "/wiki/Hoxim",
  "/wiki/Pommrio_family",
  "/wiki/Erighal_family",
  "/wiki/Task_Force_Xodlak",
  "/wiki/Hoxim_incident",
  "/wiki/Kilji",
  "/wiki/Whetstone",
  "/wiki/Jamiron",
  "/wiki/Clarr_family",
  "/wiki/Gunboat",
  "/wiki/Light_cruiser",
  "/wiki/Orisson",
  "/wiki/Ornfra",
  "/wiki/Senior_Captain_Thrawn%27s_last_stand",
  "/wiki/Jixtus%27s_fleet",
  "/wiki/Irizi%27in%27daro%27s_original_family",
  "/wiki/Oyokal_farming_community",
  "/wiki/Nikardun",
  "/wiki/Battle_over_Primea",
  "/wiki/19_BBY",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Nightdragon_man-of-war",
  "/wiki/Vigilant_(Nightdragon_man-of-war)",
  "/wiki/Springhawk",
  "/wiki/Rapacc",
  "/wiki/Supreme_Admiral",
  "/wiki/Ja%27fosk",
  "/wiki/Csilla",
  "/wiki/Sky-walker",
  "/wiki/Bet%27nih",
  "/wiki/Unidentified_cheese",
  "/wiki/Hyperspace",
  "/wiki/Caregiver",
  "/wiki/The_Force",
  "/wiki/Wikivv",
  "/wiki/Defense_Hierarchy_Council",
  "/wiki/Paccosh",
  "/wiki/Uingali_foar_Marocsaa",
  "/wiki/Magys",
  "/wiki/Sunrise",
  "/wiki/Mid_Captain",
  "/wiki/Csap%27ro%27strob",
  "/wiki/Jump-by-jump",
  "/wiki/Battle_Dreadnought_class",
  "/wiki/HopeBreaker",
  "/wiki/Shatter-class_WarMaster",
  "/wiki/First_skirmish_over_Sunrise",
  "/wiki/Ufsa%27mak%27ro",
  "/wiki/Chiss_Syndicure",
  "/wiki/Alien",
  "/wiki/Asteroid_missile_platform",
  "/wiki/Second_skirmish_over_Sunrise",
  "/wiki/Laser",
  "/wiki/Plasma_sphere",
  "/wiki/Hyperdrive",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Vagaari",
  "/wiki/Pirate",
  "/wiki/Lieutenant_Commander",
  "/wiki/Lakwurn",
  "/wiki/Family_emergency",
  "/wiki/Xodlak%27oo%27nifis",
  "/wiki/Celwis",
  "/wiki/Nyix_brooch",
  "/wiki/Senior_Aide",
  "/wiki/Xodlak%27ji%27iprip",
  "/wiki/Xodlak%27uvi%27vil",
  "/wiki/Mine",
  "/wiki/Frigate",
  "/wiki/Midsummer",
  "/wiki/Xodlak_cruiser",
  "/wiki/Apogee",
  "/wiki/Blood_(rank)",
  "/wiki/Unidentified_Xodlak_Patriarch",
  "/wiki/Syndic",
  "/wiki/Irizi%27stal%27mustro",
  "/wiki/Speaker_(Chiss_Ascendancy)",
  "/wiki/Irizi%27emo%27lacfo",
  "/wiki/Xodlak%27brov%27omtivti",
  "/wiki/Freighter",
  "/wiki/Patrol_ship",
  "/wiki/Dibber",
  "/wiki/Clarr%27os%27culry",
  "/wiki/Supreme_General",
  "/wiki/Ba%27kif",
  "/wiki/Kiwu%27tro%27owmis",
  "/wiki/Dasklo_family",
  "/wiki/Dead-man_switch",
  "/wiki/Csap_family",
  "/wiki/Gravity_well_projector",
  "/wiki/BattleChief",
  "/wiki/StoneCrusher-class_WarMaster",
  "/wiki/Emery",
  "/wiki/Armageddon",
  "/wiki/FateSpinner",
  "/wiki/Commendation",
  "/wiki/Parala",
  "/wiki/Unknown_Regions",
  "/wiki/2021",
  "/wiki/Timothy_Zahn",
  "/wiki/StarWars.com",
  "/wiki/March_4",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Del_Rey",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Clone_Wars",
  "/wiki/Ahsoka_Tano",
  "/wiki/Jedi_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Attack_on_Csilla",
  "/wiki/Standard_year"
 ]
}