{
 "name": "Irlyn Resk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Storm commandos",
      "Dark Riders",
      "Dark Riders"
     ]
    }
   ]
  }
 ],
 "content": "Irlyn Resk was a Human male who served the Galactic Empire. He was the first lieutenant to lead the Dark Riders, a group of swoop mounted storm commandos that operated on the planet Stend VI to combat swoop gangs.\nIrlyn Resk was a famous speeder bike scout who was chosen to lead a new elite unit of storm commandos called the Dark Riders. The swoop gangs on the planet Stend VI had overwhelmed the local authorities and Imperial Army reinforcements, including a repulsorlift sled wing but they were also overwhelmed by the sheer number of swoop gangs that had taken over the planet. The main problem was that the gang swoops were too fast and the riders too skilled for regular troops and authorities so an elite unit was created to remedy that problem. Resk was a natural choice to be the units first commander and although he was a loyal officer he had a hidden agenda. He wanted Blizz Pinnix's prize swoop, the Black Raptor and would have done anything to link Pinnix to one of the swoop gangs so he could confiscate the prized vehicle.\nResk was a typical Imperial officer which meant that he was cruel, bigoted, and believed in the New Order above all else. He was honored to be selected as the elite units first leader and was driven to be successful with his command. His desire to serve was not immune to greed, however, and he was willing to use the Empire to further his own agenda which involved the famous Black Raptor swoop bike.\nLike all Army officers, Lieutenant Resk was well trained in combat however he was only well trained in a very specific set of skills, namely blasters and mounted weaponry. He had commando and scout training as well however again outside of the specific skills necessary to sneak around undetected or keep his equipment in order he was lacking. He was very skilled at piloting a swoop or speeder bike and had the talent and equipment to keep up with almost every swoop rider on the planet.\nThe Empire spared no expense when outfitting this elite unit. Resk was outfitted with Storm Commando armor, a blaster carbine, a blaster pistol, a survival kit and a standard utility belt. He rode a modified Ikas-Adno XR-10 Shadowhawk which was nearly 100 kph faster than almost any other swoop gang's vehicle.\nIrlyn Resk was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. He was illustrated by Greg Smith.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Storm_commando",
  "/wiki/Dark_Rider",
  "/wiki/Lieutenant/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Stend_VI",
  "/wiki/Swoop_gang/Legends",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Imperial_Scouts",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Hoversled/Legends",
  "/wiki/Fighter_wing/Legends",
  "/wiki/Blizz_Pinnix",
  "/wiki/Black_Raptor",
  "/wiki/New_Order/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Storm_Commando_armor",
  "/wiki/Blaster_carbine/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Survival_kit/Legends",
  "/wiki/Utility_belt/Legends",
  "/wiki/Ikas-Adno/Legends",
  "/wiki/XR-10_Shadowhawk",
  "/wiki/Kilometer_per_hour/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Greg_Smith"
 ]
}