{
 "name": "Ironarm",
 "display_name": "Ironarm",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Right arm"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ironarm was the nickname of a Human male veteran Imperial stormtrooper commander. He was one of the first recruits into the reformed Stormtrooper Corps after the Clone Wars, and served in a brutal but efficient manner without distinction until his squad was assigned to hunt a Jedi Order 66 survivor. The mission cost him his unit and his right arm. The stormtroopers speculated on whether the nickname was from his cybernetics or because he strangled the Jedi with the other arm. Whenever the Jedi was mentioned, Ironarm merely got a pitiless glint in his eye. He carried a vibrosword as his weapon.\nAfter the Battle of Yavin, he was placed in charge of a quick reaction force of cavetroopers to guard the deposits of rubat lightsaber crystals. His forces encountered a group of Force-sensitives there.\nIronarm appears in the 2015 roleplaying game adventure book Hidden Depths, by Fantasy Flight Games. His comments to the players change upon their success during the adventure, but he must be encountered. The book leaves his fate open-ended, allowing the players to defeat or kill him. If he is defeated, he may return as a recurring character seeking vengeance, or he may be reassigned by his superiors.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_commander/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Unidentified_Jedi_(Ironarm)",
  "/wiki/Cybernetics/Legends",
  "/wiki/Vibrosword/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Cavetrooper",
  "/wiki/Rubat",
  "/wiki/Lightsaber_crystal",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Ironarm",
  "/wiki/2015",
  "/wiki/Roleplaying_game",
  "/wiki/Hidden_Depths",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Force_and_Destiny_Game_Master%27s_Kit"
 ]
}