{
 "name": "Isaac",
 "display_name": "Isaac",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Isaac was a male Force-sensitive Human living during the Galactic War. In 3631 BBY he resided on Nar Shaddaa, where failed Jedi trainee Languss Tuno had been pestering Isaac to take him on as a Padawan and teach him the ways of the Force. Isaac instead used Guss as his errand boy, teaching him how to use the Force to get discounts on his drinks such as Tarisian ale. When Guss brought a visitor, the Outlander, to his apartment, Isaac made a wager with the Outlander: if the Outlander could teach Guss to perform a mind trick, Isaac would owe him a favor, otherwise the Outlander would owe Isaac a favor. After the Outlander took Guss to try out this challenge, the two met Isaac in the Promenade cantina, where Isaac allowed the Outlander to take Guss with him to join the Anti-Zakuul Alliance. Isaac admitted that he never completed his Padawan training during his youth and asked the Outlander to treat Guss well.\nIsaac appears in Star Wars: The Old Republic: Knights of the Fallen Empire during the Guss Tuno Alliance alert mission.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Galactic_War",
  "/wiki/3631_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Languss_Tuno",
  "/wiki/Padawan/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Tarisian_ale",
  "/wiki/Alliance_Commander",
  "/wiki/Mind_trick/Legends",
  "/wiki/Promenade",
  "/wiki/Eternal_Alliance",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire"
 ]
}