{
 "name": "Isabet_Reau",
 "display_name": "Isabet Reau",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Cuy'val Dar",
      "Death Watch"
     ]
    }
   ]
  }
 ],
 "content": "Isabet Reau, nicknamed \"Issy\" by Dred Priest, was a female Human who was one of the 75 Mandalorian warriors that were selected by Jango Fett to help train elite clones on Kamino, as part of the 100 members of the Cuy'val Dar.\nIsabet Reau was eager to train the clones in the ways of the Death Watch's ideal Mandalorian, from their battle tactics to their cultural beliefs, so that the greatness of the Mandalorian people could once again sweep across the galaxy with all its power and glory. Along with her boyfriend, Dred Priest, she hosted a fight club in secret on Kamino. When clones started dying, Jango Fett put an end to it by badly injuring Priest.\nThe Ba'jurne Kyr'tsad Mando'ad, a manifesto of the Death Watch Mandalorian splinter group, was supposedly written by the movement's leader, Tor Vizsla—although in one of his notes the Death Watch's opponent Jango Fett doubted its authenticity and suggested that Dred Priest or Isabet Reau wrote the manifesto—and was eventually included in the book The Bounty Hunter Code by Jango's son, the bounty hunter Boba Fett.\nIn 18 BBY, a year after the Galactic Republic was transformed into the Galactic Empire, Priest and Reau were stationed on Mandalore where they were seen aiding the Imperial garrison there. They were soon noticed by Kal Skirata and his clan. After noticing the Death Watch insignia on their armor, an enraged Mij Gilamar attacked Priest above the river outside Keldabe and severed his femoral artery. Knowing Reau would be looking for Priest, Gilamar tossed his body into the river, hoping to delay her wrath.\nReau was described as insane by Mij Gilamar and said to be worse than Priest by wanting the old days of a Mandalorian empire to be reborn.\nReau wore yellow-and-gray armor with a yellow kama.\nIsabet Reau was created for an exclusive Entertainment Earth 14 action figure pack. This figure shares some parts with the Rav Bralor figure, but features a new head, belt, rocket pack, and kama with a completely unique paint job. The featured picture is of a prototype. The final figure is colored nearly identical to Mirta Gev's gear. This was likely intentional, considering the colors of the Dred Priest figure  which closely mimic that of Mirta's spouse Ghes Orade.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Isabet_Reau",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Gray",
  "/wiki/Mandalorian/Legends",
  "/wiki/Cuy%27val_Dar",
  "/wiki/Death_Watch/Legends",
  "/wiki/Dred_Priest",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Ba%27jurne_Kyr%27tsad_Mando%27ad",
  "/wiki/Author/Legends",
  "/wiki/Secret_Mandalore",
  "/wiki/Tor_Vizsla",
  "/wiki/Book/Legends",
  "/wiki/The_Bounty_Hunter_Code",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Kal_Skirata",
  "/wiki/Clan_Skirata",
  "/wiki/Mij_Gilamar",
  "/wiki/Keldabe/Legends",
  "/wiki/Kama/Legends",
  "/wiki/Rav_Bralor",
  "/wiki/Mirta_Gev",
  "/wiki/Ghes_Orade",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_30th_Anniversary_Collection",
  "/wiki/The_Bounty_Hunter_Code:_From_the_Files_of_Boba_Fett"
 ]
}