{
 "name": "Isdam_Edian",
 "display_name": "Isdam Edian",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bespin Wing Guard"
     ]
    }
   ]
  }
 ],
 "content": "Isdam Edian was a human male who worked as a security officer in the Bespin Wing Guard, which was based in Cloud City on the gas giant Bespin. After the smuggler Han Solo was frozen in carbonite by Baron Administrator Lando Calrissian and the Galactic Empire, Edian and another security officer accompanied the bounty hunter Boba Fett, who had helped capture Solo, while transporting the frozen smuggler through the corridors of Cloud City to Fett's starship, Slave I.\nIsdam Edian was a human male who served as a security officer in the Bespin Wing Guard, a law enforcement agency based on Cloud City on the gas giant Bespin during the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire. In 3 ABY, the Galactic Empire arrived in the city and forced its Baron Administrator, Lando Calrissian, to help them capture the rebel smuggler Han Solo.\nAfter he was captured with the aid of bounty hunter Boba Fett, Solo was frozen in carbonite within Cloud City's carbon-freezing chamber. Once it had been confirmed that Solo survived the process, the carbonite block containing the smuggler was given to Fett, who had Edian and another security officer transport it through the corridors of Cloud City to his Firespray-31-class patrol and attack craft, Slave I, which was parked on the East Platform.\nEnroute, Edian and the other officer walked with Fett and two Imperial stormtroopers, although Fett briefly dropped back to open fire upon Luke Skywalker, an ally of Solo who the hunter had spotted lurking in one of the corridors. At the ship, the other officer pushed Solo up the ramp onto Slave I, after which Fett successfully launched from the platform while under fire from Solo's allies.\nIsdam Edian had dark skin, brown eyes, and black hair.\nEdian wore a Wing Guard uniform, which was blue with gold trim and including a cap, red bracers, a black holster, and black boots. He used a Relby K-23 blaster pistol.\nIsdam Edian was portrayed by Quentin Pierre in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. In the current Star Wars canon, Edian was first identified on an 2022 action figure released as part of the Star Wars Vintage Collection produced by Hasbro Inc.. The named originated in the Star Wars Legends continuity, where the character was initially identified as \"Sergeant Edian\" on a card in the 1998 \"Special Edition Limited\" set for the Star Wars Customizable Card Game by Decipher, Inc. Edian the recieved the first named Isdam in \"Rogues Gallery: The Cloud City Wing Guards\", an article written by Tim Veekhoven, Kevin Beentjes, and Sander de Lange published in Star Wars Insider 148 on March 11, 2014.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Isdam_Edian",
  "/wiki/Isdam_Edian/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bespin_Wing_Guard",
  "/wiki/Security_officer",
  "/wiki/Cloud_City",
  "/wiki/Gas_giant",
  "/wiki/Bespin",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Baron_Administrator",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Galactic_Empire",
  "/wiki/Officer",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Firespray-31-class_patrol_and_attack_craft",
  "/wiki/Slave_I",
  "/wiki/Law_enforcement_agency",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/3_ABY",
  "/wiki/City",
  "/wiki/Carbon-freezing_chamber",
  "/wiki/East_Platform",
  "/wiki/Stormtrooper",
  "/wiki/Luke_Skywalker",
  "/wiki/Starship",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Hat",
  "/wiki/Holster",
  "/wiki/Boot",
  "/wiki/Relby_K-23_blaster_pistol",
  "/wiki/Quentin_Pierre",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars",
  "/wiki/2022",
  "/wiki/Star_Wars_Vintage_Collection",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars_Legends",
  "/wiki/1998",
  "/wiki/Special_Edition_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Decipher,_Inc.",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Tim_Veekhoven",
  "/wiki/Kevin_Beentjes",
  "/wiki/Sander_de_Lange",
  "/wiki/Star_Wars_Insider_148",
  "/wiki/March_11",
  "/wiki/2014",
  "/wiki/Category:Images_of_Isdam_Edian",
  "/wiki/Star_Wars_(2015)_48",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/May_1",
  "/wiki/2010",
  "/wiki/March_19",
  "/wiki/Star_Wars_Insider",
  "/wiki/Titan_Magazines"
 ]
}