{
 "name": "Isin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Advozse"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  }
 ],
 "content": "Isin was a male Advozse who, along with Kan Be and Papa Toren, helped Agent Terex in an attempt to storm Grakkus the Hutt's fortress at the prison Megalox. Their attempt failed when Poe Dameron's astromech droid BB-8 deactivated the prison's gravity field.\nIsin worked with Cycyed Ock in the Gullet Gang where he operated as a financier and brawler. When Ock was putting together a team to go after some of Maz Kanata's hidden treasures, he pondered about reaching out to Isin, but the Advozse was working with Gar Jan Rue's Traveling Menagerie and was out of contact.\nIsin was imprisoned at Megalox prison on the high gravity world of Megalox Beta. The prison was protected from the planet's high gravity atmosphere by a gravity shield operated by an orbiting space station. Prisoners were given supplies and left to fend for themselves. Isin commanded a gang and was a rival of Grakkus the Hutt, who commanded a posse consisting of other Hutts.\nIn 34 ABY, Isin and two other crime lords the Kaminoan Kan Be and Papa Toren met with the First Order Agent Terex. Terex offered to help the three crime lords escape offworld on his ship Carrion Spike if they helped him to kill Grakkus' guards, the Resistance starfighter pilot Poe Dameron and his Black Squadron. Terex planned to kill Grakkus for reneging on an earlier deal after extracting the information from him. After Terex threw a knife on the table, Isin and his fellow crime lords agreed to the plan. Isin remarked that it was \"time to kill.\"\nIsin, his fellow crime lords and Terex watched the assault. When Terex reminded them that he wanted to kill Dameron personally, Isin responded that he could not make any promises since his men were killers driven by blood lust. Despite a ferocious assault, Dameron managed to outmaneuver Terex and his allies by getting Black Squadron's astromech droids including BB-8 to deactivate the gravity shield. While Black Squadron escaped with Grakkus, Isin and his fellow gangsters were pinned to the ground by the high gravity. When Isin heard Toren weeping, Be explained that one of his Ximpi had crashed to the ground when the grav field shut off. Terex managed to escape by summoning his ship. When Terex abandoned them to die for their failure, Isin cursed him and told him that he would die for this.\nIsin was a male Advozse crime lord who commanded a posse. He disliked Grakkus and regarded him as a rival. Warden Luta believed that Isin was terrifying. Isin liked to kill and commanded gangsters who shared his bloodlust.\nIsin first appeared in the 2016 comic issue Poe Dameron 5, written by Charles Soule and illustrated by Phil Noto. In the Star Wars: Smuggler's Guide, Isin is referred to as \"her\".",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Advozse",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Kan_Be",
  "/wiki/Toren",
  "/wiki/Agent",
  "/wiki/Terex",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Hutt",
  "/wiki/Fortress_of_Grakkus_the_Hutt",
  "/wiki/Prison",
  "/wiki/Megalox",
  "/wiki/Poe_Dameron",
  "/wiki/Astromech_droid",
  "/wiki/BB-8",
  "/wiki/Cycyed_Ock",
  "/wiki/Gullet_Gang",
  "/wiki/Maz_Kanata",
  "/wiki/Prisoner",
  "/wiki/Gravity",
  "/wiki/Planet",
  "/wiki/Megalox_Beta",
  "/wiki/Atmosphere",
  "/wiki/Megalox_space_station",
  "/wiki/Orbit",
  "/wiki/Space_station",
  "/wiki/Grakks",
  "/wiki/34_ABY",
  "/wiki/Lord",
  "/wiki/Kaminoan",
  "/wiki/Parent",
  "/wiki/First_Order",
  "/wiki/Starship",
  "/wiki/Carrion_Spike",
  "/wiki/Death",
  "/wiki/Resistance",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Mission_to_Megalox_Beta",
  "/wiki/Knife",
  "/wiki/Blood",
  "/wiki/Squadron",
  "/wiki/Gangster",
  "/wiki/Ximpi",
  "/wiki/Warden",
  "/wiki/Luta",
  "/wiki/2016",
  "/wiki/Marvel_Comics",
  "/wiki/Poe_Dameron_5",
  "/wiki/Charles_Soule",
  "/wiki/Phil_Noto",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Poe_Dameron_6",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/The_High_Republic"
 ]
}