{
 "name": "Isplourrdacartha Estillo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Eiattu 6"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red-brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New RepublicRogue Squadron",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Princess Isplourrdacartha Estillo of Eiattu 6, known as Plourr Ilo for short, was a Human female member of the royal family of her homeworld, the capital of Ado sector in the Mid Rim, who was exiled and became a warrior in the Alliance to Restore the Republic, before being called home to take up the reins of government among her people.\nPlourr grew up as one of the three daughters of the reigning monarch, Uthorrferrell Cartha, but under her father and grandfather, the monarchy was forced to concede much of its honor in their accommodation with the Galactic Empire, and when she was still a young girl, the royal family were overthrown by the Eiattuan aristocracy, who preferred to negotiate directly with the Empire on their own terms.\nThe initial coup was bloodless, but a faction of the nobility subsequently had the dynasty extinguished with savage, sadistic violence. In the chaos, Plourr was the only member of the royal house to escape; although in fact, it was Plourr herself, and not the Priamsta, who killed arguably the most important member of the ruling dynasty: her vicious, psychotic brother Prince Harran, who had become Darth Vader's protégé, and who attempted to stop her escaping so he could watch her die.\nNot much is known about the first years of Plourr's exile, except that she seems to have picked up a great deal of engineering knowledge and some piloting skills. The muscular, shaven-headed mechanic who eventually found her way into the Alliance to Restore the Republic was hardly recognizable as a princess of ancient lineage. By the time of the Battle of Endor, she was serving as a non-commissioned technician aboard Admiral Ackbar's flagship Home One, and after Endor, she transferred to fly X-wings; although her attitude caused her problems in her early units, her reputation as a tough, brilliant pilot led Wedge Antilles to bring her into Rogue Squadron, where she quickly earned a lieutenant's rank.\nHighly skilled in hand-to-hand combat, Plourr combined her great physical strength and athletic appearance with a rather short temper and an almost eternally suspicious attitude; especially towards incompetent starfighter mechanics, many of whom fell victim to the combination of strength and mood. She also excelled in black humor, not passing the opportunity to let go of a wry comment or two, even in the heat of battle. A warrior, she took great pride in military action and preferred head-to-head combat to covert operations, even though her service with the Rogues meant that she had to participate in more undercover missions than the average fighter pilot.\nUnderstandably, given her upbringing, Plourr hated the Galactic Empire and everything that it stood for. Some months into her service with the Rogues, however, she was recalled to her homeworld, where the ruling council of the nobility, the Priamsta, hoped that she could become the figurehead of a unity regime, ending both the tyranny of Moff Leonia Tavira and the terrorism of the People's Liberation Battalion, led by an impostor who claimed to be Prince Harran. With the help of the Rogues Plourr successfully exposed the false Harran as a fraud—and, moreover, an agent of Tavira's. Taking power as Princess of the Realm and Empress Apparent-Heir, Plourr subsequently remained on Eiattu to lead her people once the Imperials had been expelled, insisting on ruling with the cooperation of the people and not simply the Priamsta, and was reunited with her father's cousin, to whom she was betrothed to as a child, Count Rial Pernon.\nThis did not, however, end her association with the Rogues: she brought Eiattuan starfighter forces to support the Rogues on Malrev IV, and Wedge allowed her to return to serve with them when she was able to, as she did in helping to retrieve Imperial defector Baron Soontir Fel's family on Corellia from the clutches of Imperial agent Ilir Post. However, her duties on Eiattu demanded much of her time, and with Rial by her side, she grew rapidly into the role of planetary leader. She even began to grow her hair out again. Her instincts in conflict situations were still often for direct military intervention, however, as was seen not just at Malrev IV, but later when she offered to lead her fleet to rescue the captured Princess Leia Organa, actually a disguised Winter, who had been kidnapped by the pirate gang now led by the ousted Leonia Tavira.\nPlourr's story was based on the story of Anastasia, the Russian princess who several claimants falsely posed as after her death following the overthrow of the Czar. She was originally supposed to be Quarren, but Mike Baron overlooked that part of the outline given to him by Michael A. Stackpole. Nrin Vakil was later created to fill in the gap.\nPlourr is described in dialogue in The Warrior Princess as Uthorrferrell Cartha's youngest daughter, but a panel in the comic seems to show her as the middle daughter, with a younger sibling even younger than Prince Harran; it is possible that one sister is absent in the photo and the younger child is a brother not directly mentioned in the text. Alternatively, the woman beside her father might actually be Plourr's eldest sister rather than her mother, who is nowhere mentioned in the text . This would make the child sitting on her lap in fact a nephew or niece.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Isplourrdacartha_Estillo",
  "/wiki/Eiattu_6",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Ado_sector",
  "/wiki/Mid_Rim",
  "/wiki/Wes_Janson/Legends",
  "/wiki/Uthorrferrell_Cartha",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Priamsta",
  "/wiki/Harrandatha_Estillo",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Home_One/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Ibtisam",
  "/wiki/Moff/Legends",
  "/wiki/Leonia_Tavira",
  "/wiki/People%27s_Liberation_Battalion",
  "/wiki/Harrandatha_Estillo_(impostor)",
  "/wiki/Princess_of_the_Realm",
  "/wiki/Count/Legends",
  "/wiki/Rial_Pernon",
  "/wiki/Malrev_IV",
  "/wiki/Mission_to_Corellia_(Rogue_Squadron)",
  "/wiki/Baron/Legends",
  "/wiki/Soontir_Fel/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Ilir_Post",
  "/wiki/Battle_of_Malrev_IV_(Galactic_Civil_War)",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Winter_Celchu",
  "/wiki/Mission_to_Eiattu_6",
  "/wiki/Quarren/Legends",
  "/wiki/Mike_Baron",
  "/wiki/Michael_A._Stackpole",
  "/wiki/Nrin_Vakil",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_The_Warrior_Princess",
  "/wiki/Category:Images_of_Isplourrdacartha_Estillo",
  "/wiki/X-Wing:_Rogue_Leader_3",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_The_Rebel_Opposition",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_The_Phantom_Affair",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Battleground:_Tatooine",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Requiem_for_a_Rogue",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_In_the_Empire%27s_Service",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Family_Ties",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Masquerade",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_Mandatory_Retirement",
  "/wiki/I,_Jedi",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Handbook_1:_X-Wing_Rogue_Squadron",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Rogue_Squadron",
  "/wiki/Star_Wars_Insider_59",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/The_Essential_Atlas",
  "/wiki/Rogue_Eleven/Legends",
  "/wiki/Tenk_Lenso",
  "/wiki/4_ABY/Legends",
  "/wiki/Lujayne_Forge",
  "/wiki/X-Wing_Rogue_Squadron_9"
 ]
}