{
 "name": "Ithes_Olok",
 "display_name": "Ithes Olok",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Salmon"
     ]
    }
   ]
  }
 ],
 "content": "Ithes Olok was a male Mon Calamari xenoarchaeologist present at the Mensix Mining Facility on Mustafar during the Galactic Civil War in 1 ABY.\nIthes was on Mustafar that year, searching for the artifacts of Jedi Master Chu-Gon Dar, namely his cube, which was said to be infused with the Force and have special powers of combination to it. Ithes located the cube, but was upset to find that it did not work as expected. Ithes hired a spacer visiting the planet to investigate some local Jedi ruins. Ithes believed that the ruins held the information needed to activate the cube. The spacer traveled to the ruins and found several ancient tablets detailing the cube. After returning the tablets to Ithes, he was able to activate the cube, and as a reward, Ithes gave it to the spacer, on the condition that he would test it out for him by attempting to combine the various \"glowing\" items he found on Mustafar.\nIthes Olok was a non-playable character in the massively multiplayer online roleplaying game Star Wars Galaxies: An Empire Divided prior to the game's closure on December 15, 2011. He, along with the planet Mustafar, were added to the game in November of 2005 in the expansion pack Star Wars Galaxies: Trials of Obi-Wan.\nThe \"glowing\" items mentioned were various items that the player could loot on Mustafar, ranging from a comlink to a patch of hair, that were apparently infused with the Force, although the player was not required to be Force-sensitive to sense their Force signature. The player could use the cube to combine these items into various weapons, schematics, and decorations for the player's house.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Xenoarchaeology/Legends",
  "/wiki/Mensix_Mining_Facility",
  "/wiki/Mustafar/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Chu-Gon_Dar",
  "/wiki/Chu-Gon_Dar_cube",
  "/wiki/The_Force/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Trials_of_Obi-Wan",
  "/wiki/Comlink/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Sony",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}