{
 "name": "Ivan_Cronus",
 "display_name": "Ivan Cronus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "12 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Eriadu Authority",
      "United Warlord Fleets"
     ]
    }
   ]
  }
 ],
 "content": "Ivan Cronus was an officer in the military of the Galactic Empire, who had become second-in-command to the breakaway warlord Delvardus some eight years after the Battle of Endor.\nColonel Cronus served under self-styled Superior General Sander Delvardus, ruler of the Eriadu Authority, in the Deep Core after the assassination of Emperor Xandel Carivus and fall of the Imperial Interim Ruling Council. In 12 ABY, Admiral Natasi Daala and Vice Admiral Gilad Pellaeon summoned Delvardus and the twelve other warlords of the Deep Core at Tsoss Beacon to settle their disputes and organize a joint military campaign against the New Republic. However, the meeting turned into fighting and Daala was forced to assassinate the warlords.\nCronus was waiting for further orders on Kampe when Admiral Daala arrived at the warlord's base with his corpse displayed as macabre trophy. Cronus did not show the same distaste as some of his other troops. Rather than express his disgust, the glance he directed at his former commander's dead body could have been read as indicating quiet disdain. Cronus was apparently thorough in performing his duties under Delvardus and quickly aligned himself with Daala's United Warlord Fleets. To show his loyalty to his commander, Cronus presented Daala with Delvardus's secret weapon, a black-hulled Super Star Destroyer called the Night Hammer, which Daala would designate the Knight Hammer and use as her flagship in her campaign against the New Republic and New Jedi Order.\nFor his part, Cronus was given command of 112 Victory-class Star Destroyers—most of them from Treuten Teradoc's Crimson Command—which he led from the bridge of the 13X. Cronus led his massive armada throughout the New Republic, conducting hit-and-fade assaults and raids. The guerrilla attacks against Republic targets were diversionary tactics to lure the New Republic Defense Fleet from Daala's main target, which was Luke Skywalker's Jedi Academy on Yavin 4. Cronus's attacks devastated several New Republic member worlds, such as Khomm and Porus Vida. During his lightning campaign, Cronus led the Crimson Command in the Battle of the Chardaan Shipyards, destroying the shipyards, an ore freighter, and numerous starfighters. However, he lost two Victory-class Star Destroyers during the battle.\nShortly after, Cronus split his fleet, sending a flotilla of twenty Victory-class Star Destroyer to the Battle of Yavin 4. The rest of the fleet was ordered to continue raids against the New Republic. He personally led the Crimson Command to assist Daala over Yavin 4. He was engaged in combat with a New Republic fleet under Admiral Gial Ackbar's command, losing two more ships. Cronus was determined to continue battle, but a combat-wounded Corellian Gunship rammed the bridge of the 13X, annihilating the vessel and killing Cronus.\nCronus was a compact, physically powerful man, with a broad chest and well-muscled arms. He had dark, weathered skin, dark curls laced with silver, and alert brown eyes, and when he spoke, his tone was laconic and professional, but precise. To judge from his appearance, and his rank of colonel, he may have served with the Imperial Army or Stormtrooper Corps, but he was also a capable small craft pilot, and even an efficient capital ship and fleet commander.\nIn Greek mythology, Cronus, or Kronos, was the King of the Titans and the father of the Olympian Gods.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/12_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Eriadu_Authority",
  "/wiki/United_Warlord_Fleets",
  "/wiki/Warlord/Legends",
  "/wiki/Sander_Delvardus",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Superior_General",
  "/wiki/Deep_Core/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Xandel_Carivus",
  "/wiki/Imperial_Ruling_Council/Legends#The_\"Council_of_Blood\"",
  "/wiki/Admiral/Legends",
  "/wiki/Natasi_Daala",
  "/wiki/Vice_Admiral/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Tsoss_Beacon/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Kampe",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Knight_Hammer",
  "/wiki/New_Jedi_Order",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/Treuten_Teradoc",
  "/wiki/Crimson_Command",
  "/wiki/13X",
  "/wiki/New_Republic_Defense_Fleet/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yavin_4/Legends",
  "/wiki/Khomm/Legends",
  "/wiki/Porus_Vida",
  "/wiki/Battle_of_the_Chardaan_Shipyards",
  "/wiki/Starfighter/Legends",
  "/wiki/Assault_on_Yavin_4",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/DP20_frigate",
  "/wiki/Colonel/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Monarchy/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Darksaber_(novel)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire"
 ]
}