{
 "name": "Ivey",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Tall"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Red Moons"
     ]
    }
   ]
  }
 ],
 "content": "Ivey was a Human female with a troubled past who worked for the Rebel Alliance, and later the Red Moons, as a procurement specialist. She joined the Rebellion shortly after the destruction of the first Death Star. Among her specialties were code breaking and data slicing. She was also known to be adept at unarmed combat.\nShe met Andrephan Stormcaller when she was transferred to Red Alpha. During her service in Red Alpha, she learned how to handle energy weapons and also received training in piloting.\nAfter the destruction of the second Death Star, she left the Rebellion and, much to Airen Cracken's surprise, started working for the Red Moons mercenary group. She and Hugo Cutter worked together on a mission against Pentastar Trust and Safety Assurance Bank. They entered a branch of the bank and cuffed a clerk to his desk so they could get access to his terminal. Ivey deposited a million counterfeit credits and wiped the bank's inventory control program so the financial institute would have to shut down to clean up its records. She escaped with Cutter as he set off smoke bombs to cover them.\nIvey was on Entralla with the rest of the Red Moons. The group planned on disrupting the Lunar Night festivities. After saving Reina Gale and Rollo from the local authorities, Ivey used a portable computer and comlink to give false orders to the pursuing patrols and draw them away from the group. She later confirmed that the credits that Gale was carrying had been reported as stolen and were worthless until they had been electronically cleaned of their register codes.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Red_Moons",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Andrephan_Stormcaller",
  "/wiki/Red_Alpha",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Hugo_Cutter",
  "/wiki/Pentastar_Trust_and_Safety_Assurance_Bank",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Entralla/Legends",
  "/wiki/Lunar_Night",
  "/wiki/Reina_Gale",
  "/wiki/Rollo",
  "/wiki/Pentastar_Patrol",
  "/wiki/Comlink/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/It%27s_a_Gambler%27s_Life",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/Blasters_for_Hire",
  "/wiki/Star_Wars_Adventure_Journal_3",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}