{
 "name": "Ivory",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rattatak"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rattataki"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  }
 ],
 "content": "Ivory was a Male Rattataki crime lord and Rogun the Butcher's mentor during the Cold War. He was imprisoned on Belsavis by the Galactic Republic for selling children to the Hutts and while trying to escape Belsavis, had his life attempted on by Rogun the Butcher's best bounty hunter, Dust.\nIvory built up his criminal empire through diplomacy, bribes and extortion to bring lesser gangsters under his heel. At the height of his power, criminals referred to him as the \"Supreme Chancellor of the Underworld.\" He was a respected rival of Nok Drayen and Diago Hixan, both of whom negotiated a profitable peace with Ivory even as they battled each other. When Ivory was finally arrested and imprisoned by the Galactic Republic on Belsavis, it was his protege Rogun the Butcher who inherited Ivory's criminal empire. Rumors persist that Rogun himself arranged Ivory's capture.\nBy 3641 BBY, Ivory managed to find a Rakata transmitter, which he used to leak Belsavis' location to the Sith Empire. While the Imperials were occupied staging a mass-prison break, Ivory managed to escape his cell after discovering a natural tunnel adjacent to it and began to recruit his imprisoned loyalists.\nA smuggler later known as the Voidhound was sent on a mission by Senator Bevera Dodonna to free Ivory from his cell, in the Minimum Security Section soon after Ivory's escape. However, the captain learned that Ivory had already escaped and tried to get one of his still-imprisioned accomplices, Sraja, to tell the smuggler where Ivory was. However, Dust, an assassin sent by Rogun the Butcher, the smuggler's enemy, killed Sraja before she could tell anything valuable. After defeating Dust and a corrupt Republic officer named Legat, the captain contacted Marshall Kay Cavarat, who told the smuggler that Ivory was heading in to Cell 2018 in the Maximum Security Section. Upon reaching Cell 2018, the captain met his lackeys, Squarg and Buzz who were freeing Agrular the Mad. Ivory was observing via hologram and rwhen offered a deal by the captain for better prison privileges, he refused, boasting that he was seeking Rakata secrets within the prison to escape the planet. He then ordered his thugs to attack and signed off. The Voidhound managed to survive by tricking the two into fighting each other before blasting them and then killing Argular.\nIvory eventually made it to the Tomb, where he intended to commandeer a Rakata starship to get off planet. Ivory managed to make it to the starship's hangar, sacrificing his entire gang to the primeval guard droids to do so. As soon as he had activated the ship, he detected the Voidhound and his companion's approach and managed to capture them. But in turn, the three were confronted by Rogun's best and seemingly immortal bounty hunter, Dust, who was sent to kill Ivory. Cornered, Ivory and the Voidhound agreed to work together. Ivory also gave up Rogun's safehouses, shortly before detonating hidden explosives and catching the bounty hunter off guard before supposedly killing him. Ivory then offered to help the Voidhound take over Rogun's empire in exchange for escape.\nHowever, the Voidhound told him to return to his cell, promising that Rogun would join him soon. Reluctantly accepting that, Ivory agreed to return to his cell. The Voidhound then called their handler, Republic Marshall Kay Cavarat, who contacted General Skylast to send troops to collect Ivory, who later disclosed everything he knew.\nIn the Dark Side option, the smuggler can smuggle Ivory off Belsavis and has the choice to let him go on his own as Voidhound's new subordinate or order him to remain on the ship where smuggler's companions could keep a close eye on him. In the latter case, Ivory remains on the smuggler's ship until the end of the class story when he either pledges himself as the player's lieutenant or, if the Voidhound firmly allies with the Republic, departs from the ship.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rattatak/Legends",
  "/wiki/Rattataki/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Rogun_Matt%27rik",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Belsavis/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Dust_(Abyssin)",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Nok_Drayen",
  "/wiki/Diago_Hixan",
  "/wiki/3641_BBY",
  "/wiki/Rakata/Legends",
  "/wiki/Transmitter/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Smuggler/Legends",
  "/wiki/Voidhound",
  "/wiki/Senator/Legends",
  "/wiki/Bevera_Dodonna",
  "/wiki/Minimum_Security_Section",
  "/wiki/Sraja",
  "/wiki/Assassin/Legends",
  "/wiki/Legat",
  "/wiki/Kay_Cavarat",
  "/wiki/Maximum_Security_Section",
  "/wiki/Squarg",
  "/wiki/Buzz_(Geonosian)",
  "/wiki/Agrular",
  "/wiki/Hologram/Legends",
  "/wiki/The_Tomb",
  "/wiki/Starship/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Republic_Marshall",
  "/wiki/General/Legends",
  "/wiki/Skylast",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}