{
 "name": "Iwo Kulka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ho'Din"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Unidentified Padawan"
     ]
    }
   ]
  }
 ],
 "content": "Iwo Kulka was a male Ho'Din Jedi Knight serving the Jedi Order and the Galactic Republic in the waning days of the Republic Classic era. When the Clone Wars erupted across the galaxy, Kulka took up the rank of General within the Grand Army of the Republic and fought against the Separatist Droid Army alongside his Padawan. At the end of the war, the rise of the Galactic Empire saw Kulka branded as a traitor. In 19 BBY, Kulka confronted Lord Vader alongside several other Jedi, but was slain on Kashyyyk.\nIwo Kulka, a Force-sensitive male Ho'Din, was trained in the ways of the Force by the Jedi Order. After a time, Kulka passed his Trials of Knighthood and was made a Knight by the Jedi High Council.\nAs a Knight, Kulka took on a Padawan of his own, training them in the ways of the Jedi as he had been taught. At the outbreak of the Clone Wars, Kulka accepted the rank of General within the newly created Grand Army of the Republic to combat the Confederacy of Independent Systems' Droid Army. Fighting side-by-side with clone troopers over the course of the three years of war, Kulka and his apprentice were caught unawares when the Republic crumbled and its Supreme Chancellor issued Contingency Order 66 to the Grand Army, ordering them to kill their Jedi compatriots. Overrun by their troopers, Kulka's Padawan fell to the onslaught before Kulka was able to escape, disguised in the armor of a slain clone. Responding to fellow Knight Siadem Forte's emergency beacon on Dellalt, Kulka aided Forte in leading a group of eight other Jedi—including Deran Nalual, Klossi Anno, Jambe Lu, and Nam Poorf—in hijacking a SX troop shuttle. Fleeing the planet, the group was harried by ARC-170s and a light cruiser, which saw the death of two of the Jedi crew. Limping through space, the group met up with the Drunk Dancer and were given sanctuary by its captain, Jula Shryne.\nTraveling aboard Shryne's ship, the group soon grew with the arrival of Padawan Olee Starstone and her adopted Master and Jula Shryne's son, Roan Shryne. After a drawn out discussion on what their plan should be, Starstone convinced the Kulka and the other Jedi to go to Kashyyyk in order to find Grand Master Yoda. After arriving and speaking with the Wookiee chieftains there, the world was attacked by Sith Lord Darth Vader, who was hunting the fugitive Jedi. Paired with Forte, the two Knights attacked together but were no match for Vader. After receiving a jab in the abdomen and a slash across the face from Vader's lightsaber, Forte and Kulka were both decapitated by Vader as they attempted to rise. Dead, Kulka's memory was further slandered when images of his body were used as anti-Jedi propaganda on the HoloNet.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Ho%27Din/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Iwo_Kulka%27s_Padawan",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Clone_Wars/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Kashyyyk_(19_BBY)",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Knighting_ceremony/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Order_66/Legends",
  "/wiki/Siadem_Forte",
  "/wiki/Emergency_Code_Nine_Thirteen/Legends",
  "/wiki/Dellalt/Legends",
  "/wiki/Deran_Nalual",
  "/wiki/Klossi_Anno",
  "/wiki/Jambe_Lu",
  "/wiki/Nam_Poorf",
  "/wiki/SX_troop_transport",
  "/wiki/Aggressive_ReConnaissance-170_starfighter/Legends",
  "/wiki/Drunk_Dancer",
  "/wiki/Captain/Legends",
  "/wiki/Jula_Shryne",
  "/wiki/Olee_Starstone",
  "/wiki/Roan_Shryne",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Anti-Jedi_sentiment/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Dark_Lord:_The_Rise_of_Darth_Vader",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}