{
 "name": "Ixsthmus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 Imperial standard meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Reekeene's Roughnecks",
      "Reekeene's Roughnecks"
     ]
    }
   ]
  }
 ],
 "content": "Ixsthmus was a male Ithorian who served in the Alliance to Restore the Republic during the Galactic Civil War.\nIxsthmus was a dedicated member of the Alliance to Restore the Republic. He was part of Reekeene's Roughnecks, an Irregular group of Rebel fighters operating in the Fakir sector based from the modified Tsukkian water freighter, Home. He was the designated pilot of Green squad and flew the space transport Long Shot in several missions for the Roughnecks. His crew consisted of his Sullustan first mate Siene Symm, R2-V0, Four-Onebee and a changing number of Rebel irregulars that were assigned to Green squad according to the mission at hand.\nHe once flew a mission to the planet Masterhome, where Green squad had been tasked with opening diplomatic relations between the local Anointed People and the Rebel Alliance. After dealing with the pirate crew of the Martinette en route to Abonshee, Green squad made peaceful contact with the ruler of the planet, the Godking Trisstan. Ixsthmus remained with the ship for the most part of the negotiations, since his place was as a pilot, not as a would-be diplomat.\nAfter several covert and overt tests by the Godking, Green squad was well on its way to convincing the monarch and his people to join the Rebel Alliance. Unexpectedly, the Imperial Curich-class shuttle Resurgence appeared in the atmosphere, heading for the Godking's castle where the diplomatic talks were being held. Ixsthmus decided that he could not allow the Imperial ship to detect them, and if he and Symm were going to have a chance to slip away, they could not wait for the rest of Green squad which was still back at the Godking's castle. Siene Symm delivered the news to the rest of the squad, and the Long Shot took off into space, with the promise to come back with reinforcements, suggesting to the rest of the team to hide until they came back.\nAs soon as the ship was clear of Masterhome's orbit and out of communications reach of the Imperial vessel, Ixthmus contacted Home and informed the Alliance of the situation. The Rebel base quickly scrambled a couple of X-wings from Red squad to rendezvous with him. The X-wings immediately returned to Masterhome to provide air support for Green squad in the fight against the Imperials.\nIxsthmus served the Roughnecks in other missions, including shuttle service to the volcanic world Alabash and a long, boring watch of the communication center of Iyuta that also required dodging some custom officers. Also during this mission, Ixsthmus and the others in the Long Shot discovered that General Reekeene had been captured by Imperial forces and sent to the planet Flankers, whose sun would go nova in only hours. Ixsthmus captained the Long Shot during this time.\nIxsthmus was stern, intelligent, capable, extremely honest and had no sense of humor. He was however, considered to be quite good looking by his fellow Ithorians despite his serious demeanor. Ixsthmus tried to protect his starship the Long Shot as much as he could from unnecessary damage during battles, as he knew that for the Rebellion to succeed, it would need as much ships as it could get, and for the ship to be destroyed foolishly was not something he would allow. However, when the lives of fellow Alliance members were in jeopardy, he would then do anything in his power to safeguard their lives. A strong dislike for deceitfulness and underhandedness made Ixsthmus avoid any situation that had to do with lying and cheating, often relying on Siene Symm to handle this type of encounter. He was known to be very critical of mainstream Human culture, which he considered \"Frivolous and decadent.\"\nIxsthmus proved time and again to be a good leader, when commanding space transport crews. He was also a good pilot, navigator and a decent shot with a blaster.\nThe starship under his command during the Galactic Civil War was the Long Shot, a modified Lantillian ShipWrights GX1 Short Hauler. He was given command of the ship after the Roughnecks stole it from an Imperial Admiral at Callonia's spaceport.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Reekeene%27s_Roughnecks",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/The_Irregulars",
  "/wiki/Fakir_sector/Legends",
  "/wiki/Tsukkian_water_freighter",
  "/wiki/Home",
  "/wiki/Pilot/Legends",
  "/wiki/Green_squad",
  "/wiki/Long_Shot",
  "/wiki/Sullustan/Legends",
  "/wiki/Siene_Symm",
  "/wiki/R2-V0",
  "/wiki/Four-Onebee",
  "/wiki/Planet/Legends",
  "/wiki/Abonshee",
  "/wiki/Anointed_People",
  "/wiki/Pirate/Legends",
  "/wiki/Martinette",
  "/wiki/Godking",
  "/wiki/Trisstan",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Curich-class_shuttle",
  "/wiki/Resurgence_(Curich-class)",
  "/wiki/Godking%27s_castle",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Red_squad",
  "/wiki/Alabash",
  "/wiki/Iyuta",
  "/wiki/Flankers",
  "/wiki/Nova/Legends",
  "/wiki/Human/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Lantillian_ShipWrights/Legends",
  "/wiki/GX1_Short_Hauler",
  "/wiki/Callonia",
  "/wiki/West_End_Games",
  "/wiki/Tests_of_the_Godking",
  "/wiki/Star_Wars_Campaign_Pack",
  "/wiki/Classic_Campaigns",
  "/wiki/The_Heat_of_Freedom",
  "/wiki/The_Plant",
  "/wiki/Lens_Reekeene_Is_Missing",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}