{
 "name": "Iyon",
 "display_name": "Iyon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Munto Codru"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Codru-Ji"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Iyon  was the Chamberlain of the Codru-Ji species from the remote Outer Rim planet of Munto Codru in 14 ABY.\nWhen the New Republic Chief of State Leia Organa Solo toured Munto Crodu as part of her tour of remote member worlds in 14 ABY, her children Jaina, Jacen and Anakin were kidnapped by agents of Hethrir, leader of the Empire Reborn. His wyrwulf—a Codru-Ji child—was also kidnapped.\nUnaware of Hethrir's plot, Iyon tried to reassure a devastated Leia that the kidnapping was a \"coup abduction\"—ritualized kidnappings of the children of leading Codru-Ji families by political rivals which almost always ended with the payment of ransoms and the safe return of the children. Unconvinced, Leia left on her starship Alderaan to find her children, temporarily forsaking her duties as leader of the New Republic and disappearing.\nAfter defeating Hethrir at Crseih Station and having rescued her children along with other children Hethrir had kidnapped including Iyon's wyrwulf which was metamorphosing into a self aware Codru-Ji child, Leia and her companions brought the space city over to Munto Codru where local authorities and New Republic Intelligence detained Crseih's inhabitants for questioning over their role in the slave trade. The slaves kept there were also freed and returned home. After Iyon complained to sector authorities about the station, Crseih was moved into orbit over nearby Pakuuni where it remained.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Munto_Codru/Legends",
  "/wiki/Codru-Ji",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Chamberlain/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/14_ABY/Legends",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Darth_Caedus",
  "/wiki/Anakin_Solo",
  "/wiki/Hethrir",
  "/wiki/Empire_Reborn",
  "/wiki/Wyrwulf",
  "/wiki/Alderaan_(yacht)",
  "/wiki/Crseih_Station",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Slavery/Legends",
  "/wiki/Pakuuni/Legends",
  "/wiki/The_Crystal_Star",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}