{
 "name": "Izal Waz",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arcona"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Wild Knights",
      "New Jedi Order",
      "New Republic",
      "Galactic Federation of Free Alliances"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Kenth Hamner",
      "Eelysa"
     ]
    }
   ]
  }
 ],
 "content": "Izal Waz was a sharp-tongued salt-addicted Arcona Jedi Knight during the Yuuzhan Vong War.\nWhile training on Yavin 4 under Kenth Hamner, Waz developed a salt addiction after eating some nerfloaf that was served by Hamner. He then went on a salt binge, consuming months worth of salt in only a number of days. He fled the Praxeum after less than four months.\nWaz was trained by Jedi Master Eelysa, who eventually helped him overcome his salt addiction. Some two years into the war, he served as a member of Saba Sebatyne's Wild Knights squadron. While among them he learned to speak the Barabel and constructed his own lightsaber.\nPrior to the Battle of Coruscant, while Leia Organa Solo was recovering from her injuries received on Duro, Waz aided Han Solo in escaping from a Corellian medical station with Eelysa. Waz was captain of the YT-1300 freighter Sureshot, and flew his ship until it was sacrificed returning to Coruscant. The ship was destroyed by orbital mines.\nAs the conflict against the Yuuzhan Vong wore on, Waz participated in key battles at Froz, Reecee, Arkania, Talfaglio, Coruscant, Borleias, and Yuuzhan'tar. He made a key contribution to the Jedi with the invention of the glowball. Using the Force to gather light together, he created a globe within which the Jedi fighters could be protected. The technique required his concentration, but was vital in enabling the Wild Knights to gather data on how yammosks worked.\nSix years after the war, Waz was one of many Jedi siding with Kyp Durron during the Killik-Chiss conflict. He volunteered to fly a StealthX in a mission designed to rescue Jedi Master Luke Skywalker and Han Solo, who were being held prisoner by the Killiks. As the StealthX wing prepared to take off, acting head of the order Corran Horn and his allies entered the hanger to stop them. Waz watched as Horn cut through the landing gear on Durron's ship, preventing him from taking off. Waz was impressed with Horn's move, and commented that he had not thought Horn had that in him. Fellow Jedi Knight Jaina Solo told him to hold off on any zingers right now, lest they make the situation worse. Solo and Zekk suggested they join Durron in his argument with Horn and his followers, but leave their lightsabers behind in their cockpits to help sooth tensions and prevent any fights from breaking out. Waz joined the rest of the squadron in backing up Durron, and argued that the Jedi had a duty to choose peace over convenience, even if it meant going against the Galactic Alliance's interests.\nIn 44 ABY, Waz was one of several veteran Jedi pilots to help lead the StealthX wing to aid Luke Skywalker and Ben Skywalker in their fight against the Lost Tribe of Sith and Abeloth. Later he pronounced an eulogy during the funeral of his former master Kenth Hamner, who had been killed in a duel with Master Saba Sebatyne after being deposed as acting Grand Master by the rest of the Jedi Council. Waz was filled with sorrow over what had happened, and after he finished the eulogy, he lit the funeral pyre of his late master.\nA few months later, Waz infiltrated Coruscant, which had been secretly taken over by the Lost Tribe of Sith, alongside hundreds of other Jedi to begin liberating it. After Jedi Master Corran Horn assassinated Sith Master Jestat Vhool, Waz picked him up on a speeder bike and entered the busy Coruscant traffic lanes, heading towards their second target. After the assassinations were finished, Waz joined Master Sebatyne in leading a group of younger Jedi Knights in hunting down any remaining Sith that did not retreat into the captured Jedi Temple.\nWaz was known to make use of a technique that he called a \"Glowball\". It was a ball of light that he used to cover his and allied ships while in space combat. Used during the Yuuzhan Vong War, it helped the all Jedi squadron led by Saba Sebatyne. He also once used this technique to disguise a large block of durasteel.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Izal",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Izal_Waz",
  "/wiki/Arcona/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Wild_Knights",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Kenth_Hamner",
  "/wiki/Eelysa",
  "/wiki/Han_Solo/Legends",
  "/wiki/Salt/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Yavin_4/Legends",
  "/wiki/Nerfloaf",
  "/wiki/Jedi_Praxeum",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Saba_Sebatyne",
  "/wiki/Barabel_(language)",
  "/wiki/Lightsaber/Legends",
  "/wiki/Battle_of_Coruscant_(Yuuzhan_Vong_War)",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Duro/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Captain/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Sureshot",
  "/wiki/Coruscant/Legends",
  "/wiki/Space_mine",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Froz",
  "/wiki/Reecee/Legends",
  "/wiki/Arkania/Legends",
  "/wiki/Talfaglio",
  "/wiki/Borleias/Legends",
  "/wiki/Coruscant/Legends#Yuuzhan'tar",
  "/wiki/Jedi/Legends",
  "/wiki/Glowball",
  "/wiki/The_Force/Legends",
  "/wiki/Yammosk",
  "/wiki/Kyp_Durron",
  "/wiki/Killik/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/StealthX",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Corran_Horn",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Zekk",
  "/wiki/44_ABY",
  "/wiki/Ben_Skywalker",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Abeloth",
  "/wiki/Funeral_of_Kenth_Hamner",
  "/wiki/Skirmish_in_the_Operations_Hangar",
  "/wiki/Grand_Master/Legends",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/Sith_Master/Legends",
  "/wiki/Jestat_Vhool",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/The_New_Jedi_Order:_Recovery",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Dark_Nest_II:_The_Unseen_Queen",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/Wizards.com",
  "/wiki/Making_a_Full_Recovery",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}