{
 "name": "Izrina",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wistie"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Izrina was the queen of the Wisties, the glowing, fairy-folk of the forest moon of Endor, shortly before the Galactic Civil War.\nIzrina was a peaceful being. During a severe drought, however, the Tulgah witch Morag captured the queen. Using magic to change Izrina into a being of literal fire, Morag unleashed the queen on the Wistie folk. The spell proved contagious, and soon the flammable creatures caused a large section of forest to catch fire. As the flames encroached on the Ewoks of Bright Tree Village, threatening their Soul Trees, Wicket Wystri Warrick doused Izrina with water and discovered that this cured her of her fiery affliction. The Ewoks then doused the other infected Wisties and squelched the flames with a special foam made by the shaman Logray while Izrina volunteered her people to guide the airdropping gliders around the dangerous convection currents.\nA short while before the Battle of Endor, Izrina joined a party of Ewoks in their search for Catarine and Jeremitt Towani, who had crash landed on Endor and became separated from their children, Cindel and Mace.\nIzrina was attracted by a magical candle that Logray had presented to Cindel Towani. When the caravan discovered the adult Humans captured by a monstrous Gorax, Izrina distracted the creature and allowed the others to free the captives. After the Gorax had been killed by Mace, Izrina led her friends out of the fortress. Mace told Izrina that their mission couldn't have been a success without her, and after saying farewell to her, Queen Izrina flitted off into the night sky.\nIn keeping with Mace Towani's pronunciation of her name, the subtitles of the Caravan of Courage DVD, as well as the Disney+ subtitles, identify her as Ezerina.\nIzrina's face at time resembles a Givin, but Wisties and Givins are not intended to be genetically related.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Endor/Legends",
  "/wiki/Wistie/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Tulgah/Legends",
  "/wiki/Morag",
  "/wiki/Ewok/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Soul_Tree",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Logray/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Catarine_Towani",
  "/wiki/Jeremitt_Towani",
  "/wiki/Cindel_Towani",
  "/wiki/Mace_Towani",
  "/wiki/Candle_of_Pure_Light",
  "/wiki/Gorax/Legends",
  "/wiki/Disney%2B",
  "/wiki/Givin/Legends",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/The_Cries_of_the_Trees",
  "/wiki/Caravan_of_Courage:_An_Ewok_Adventure",
  "/wiki/Category:Images_of_Izrina",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/Drawing_from_the_Imagination:_Mythological_Creatures_in_Star_Wars"
 ]
}