{
 "name": "J'er Nahj",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "A group of Alderaanian refugees"
     ]
    }
   ]
  }
 ],
 "content": "J'er Nahj was a Human male and a native of the planet Alderaan.\nNahj had been at a trade conference on Delaya at the time Alderaan was destroyed by the first Death Star and, while on Delaya, Nahj and Halle Dray had looked after a young boy, Shell, who had been orphaned after the attack. Nahj also helped the Alderaanian survivors into communities to help avoid abuse from the native Delayans.\nWhen Princess Leia Organa arrived on Delaya to formally mourn her home planet, Nahj hoped to speak to her about the plight of the Alderaanian survivors and sent her a message to arrange a meeting. The Delayans intercepted the message and Nahj and his men planned to kidnap her. Instead of kidnapping Organa, Nahj kidnapped Luke Skywalker who advised him that Organa had never received Nahj's message and convinced Nahj that he could arrange with Organa.\nUpon meeting, Nahj was at first sure that Organa would assist the Alderaanian refugees, but he soon began to question if Organa's reason for being on Delaya was for the refugees or to garner support for the rebellion against the Empire.\nNahj joined Dray's group to orchestrate a plan to kidnap Organa and turn her over to the Empire in exchange for a new planet for the Alderaanian refugees. The Imperials, however, betrayed Nahj, Dray and Organa's other captors and all the abductors, save for Kiro Chen, were killed by the Imperial forces on Delaya who had been ordered to eliminate the captors.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alderaanian_faction",
  "/wiki/Planet/Legends",
  "/wiki/Delaya/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Halle_Dray",
  "/wiki/Shell_(Alderaanian)",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Kiro_Chen",
  "/wiki/Rebel_Force:_Hostage"
 ]
}