{
 "name": "J'Mikel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "30 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Anx"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow with purple stripes"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Xiaan Amersu"
     ]
    }
   ]
  }
 ],
 "content": "J'Mikel was a male Anx Jedi Knight serving the Jedi Order during the final years of the Republic Classic era. During his career, J'Mikel selected the Jedi Initiate Xiaan Amersu as his Padawan; however he was struck down by the bounty hunter Aurra Sing before he could complete her training.\nLike most Jedi of the era, J'Mikel was most likely discovered to be Force-sensitive at birth and delivered to the Jedi Order for training. Studying at the Coruscant Jedi Temple's academy, J'Mikel eventually graduated and was selected for training by a Jedi Master. Traveling the galaxy for many years with his tutor, J'Mikel was eventually ready to face the Trials of Knighthood. Passing, the Jedi High Council knighted him, making him a full-fledged member of the Order.\nAs a Jedi Knight, J'Mikel was permitted to take on a student of his own. Selecting the Twi'lek Initiate Xiaan Amersu from the academy, the pair began training together immediately. In 30 BBY, the pair was dispatched into the Coruscant underworld with Knight Peerce to search for the Jedi hunter, Aurra Sing. After trailing the ex-Jedi for some time, the group discovered a slain squad of Republic Peace Officers; obviously Sing's handiwork. Splitting up, J'Mikel eventually stumbled upon Peerce's dead body just as Sing leapt from the shadows and attacked. After a brief duel, J'Mikel was outmatched and impaled by the hunter's lightsaber. Taking the Anx's lightsaber as a souvenir, Sing left Amersu alive for a future hunt.\nWith J'Mikel's death, Xiaan Amersu was reassigned to another Master with hardened resolve and a strong desire to become a Knight so that she could confront her Master's murderer. Over a decade after the Anx Jedi was slain, Amersu had indeed become a Knight and General in the Grand Army of the Republic during the Clone Wars. Before leading her first solo mission, Amersu was hailed by fellow Twi'lek Knight Aayla Secura who had dueled Sing and retrieved J'Mikel's lightsaber. Giving Amersu the lost weapon, Secura closed the circle between Master and apprentice which Sing had once broken.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/30_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Anx/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Xiaan_Amersu",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Jedi_Master/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Knighting_ceremony/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Peerce",
  "/wiki/Jedi_hunter/Legends",
  "/wiki/Republic_Peace_Officer",
  "/wiki/Duel_on_Coruscant_(30_BBY)",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Category:Images_of_J%27Mikel",
  "/wiki/Star_Wars_(1998)_28",
  "/wiki/Heart_of_Fire_(comic)",
  "/wiki/Jedi:_Aayla_Secura",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}