{
 "name": "Jaanie",
 "display_name": "Jaanie",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo"
     ]
    }
   ]
  }
 ],
 "content": "Jaanie was a Human female handmaiden for Queen Kylantha of Naboo during the time of the Galactic Civil War. Sometime following the Battle of Yavin in 0 BBY, Jaanie was wanted by High Inquisitor Mal Sikander of the Galactic Empire, and was pursued by agents of the Imperial Security Bureau. To help the Queen and her handmaiden, Boss Rugor Nass of the Gungans tasked a spacer with rescuing Jaanie and bringing her back safely to the Gungan Sacred Place.\nA Human female handmaiden by the name of Jaanie served Queen Kylantha of the Royal House of Naboo during the time of the Galactic Civil War. By the time following the Battle of Yavin in 0 BBY, High Inquisitor Mal Sikander of the Galactic Empire's Inquisitorius and agents of the Imperial Security Bureau pursued Jaanie with the intent to punish her. The Ankura Gungan Boss Rugor Nass feared for Jaanie's welfare, and wished to see her brought to safety.\nAs a show of goodwill to the Naboo people and their Queen, Boss Rugor Nass enlisted a spacer to find the missing handmaiden and bring her back safely to the Gungan Sacred Place, a sacred monument in the Lasay Swamp of Naboo. In the search for Jaanie, the spacer was attacked by a stormtrooper squad leader and three other stormtroopers. However, the spacer successfully fought off and killed the four of them. When the spacer reached Jaanie, she thanked the individual, and warned that ISB agents were still after her. Nevertheless, no harm befell the endangered handmaiden. Thanks to the spacer's help, Jaanie was uneventfully escorted back to Boss Nass in the safe confines of the Sacred Place.\nJaanie had fair skin, brown hair, and brown colored eyes. Her lips were covered with blue colored makeup. As a wanted fugitive of the Galactic Empire, Jaanie expressed gratitude when a spacer came to rescue her. According to Boss Nass, she was a good friend of Kylantha, the ruling monarch of Naboo.\nWhile she was on the run from the Empire, Jaanie wore a light gray short sleeve shirt with a blue wrapped skirt and light gray waistband. She also wore gray dress shoes and silver colored bangles on her left forearm. Her personal arsenal consisted of multiple types of blaster pistols and a slugthrower, including a DH-17 blaster pistol, a DL-44 heavy blaster pistol, a Striker projectile pistol, and an SE-14 blaster pistol. Secondary weapons included two versions of the DH-17 carbine, as well as a snubnosed version known as the DH-17 short carbine.\nJaanie was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. She was included in the second quest given by Boss Nass, an NPC located at the Gungan Sacred Place on the planet Naboo. In the quest, players were instructed by Boss Nass to find Jaanie and escort her back safely. Completing the quest would earn the player 50 credits. Although the player could choose not to do Boss Nass' quests, this article assumes 100% game completion. Because Jaanie spawned under the generic \"mission_plainsfolk\" template, her graphical appearance was identical to other NPCs in the game, such as Deehan. At some point during the game's early lifespan, Boss Nass' quests were deactivated, effectively removing Jaanie from Star Wars Galaxies. Following the release of Publish 25's New Game Enhancements on November 15, 2005, Boss Nass' content was revamped to become a part of the expansive Legacy Quest series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Royal_House_of_Naboo/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Handmaiden/Legends",
  "/wiki/Monarch_of_Naboo/Legends",
  "/wiki/Kylantha",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/High_Inquisitor",
  "/wiki/Mal_Sikander",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Boss/Legends",
  "/wiki/Rugor_Nass/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Gungan_Sacred_Place/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Ankura/Legends",
  "/wiki/Canon",
  "/wiki/Naboo_(people)",
  "/wiki/Lasay_Swamp",
  "/wiki/Stormtrooper_commander/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Death/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Mouth/Legends",
  "/wiki/Shirt",
  "/wiki/Clothing/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Silver/Legends",
  "/wiki/Bracelet/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Slugthrower/Legends",
  "/wiki/DH-17_blaster_pistol/Legends",
  "/wiki/DL-44_heavy_blaster_pistol/Legends",
  "/wiki/Striker_projectile_pistol",
  "/wiki/SE-14_blaster_pistol",
  "/wiki/DH-17_carbine",
  "/wiki/DH-17_short_carbine",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Deehan",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/The_New_Essential_Chronology"
 ]
}