{
 "name": "Jabba_Desilijic_Tiure",
 "display_name": "Jabba Desilijic Tiure",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nal Hutta",
      "Tatooine"
     ]
    },
    {
     "name": "Born",
     "values": [
      "600 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3.9 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "1",
      "358 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green and tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Kajidic",
     "values": [
      "Desilijic"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan",
      "Grand Hutt Council",
      "Jabba's criminal empire",
      "Grand Hutt Council",
      "Jabba's criminal empire",
      "Crymorah Syndicate",
      "Shadow Collective"
     ]
    }
   ]
  }
 ],
 "content": "Jabba Desilijic Tiure, more commonly referred to as Jabba the Hutt or simply Jabba, and formally styled as His Excellency Jabba Desilijic Tiure of Nal Hutta, Eminence of Tatooine, was a Hutt gangster and crime lord, as well as a leading member of the Grand Hutt Council and influential leader of the Hutt Clan, who operated and led a criminal empire from his palace on the Outer Rim world of Tatooine. Jabba was a major figure on Tatooine, where he controlled the bulk of the piracy, slavery, and trafficking in illegal goods that generated most of the planet's wealth. He was also highly influential in the entire Outer Rim as one of its most powerful crime lords.\nDuring the Clone Wars, Jabba's influence and power over the Outer Rim, specifically its hyperlanes, was sought by both the Galactic Republic and the Confederacy of Independent Systems, who both courted Jabba's approval. When Rotta, Jabba's son, was kidnapped, the crime lord promised his support to whoever returned his son. When the Separatists were revealed to have orchestrated Rotta's kidnapping, Jabba pledged his support to the Republic.\nJabba continued to operate in the Outer Rim after the end of the Clone Wars and the rise of the Galactic Empire, preserving his power base, despite the interference of Darth Sidious, the Galactic Emperor. After the destruction of the Death Star by the Rebel Alliance, the Emperor sent Darth Vader to negotiate a deal with Jabba to secure raw materials for Imperial military production. Jabba's alliance with the Empire allowed him and the Hutts to resist the Imperial crackdown against criminal elements in the Outer Rim, as well as rid the Hutt of his competitors.\nAfter the smuggler Han Solo failed to repay him for lost cargo, Jabba placed a high price on his head. Solo was eventually delivered to him by one of his bounty hunters, Boba Fett, as a gift from Darth Vader. However, this capture brought him to the attention of Jedi Knight Luke Skywalker, who sought to rescue his friend from Jabba's imprisonment. As he attempted to execute the Jedi and his allies in the Great Pit of Carkoon, Jabba was choked to death by Leia Organa. With the Hutts unable to decide who would inherit Jabba's criminal ventures, many of his slaves, including the Niktos, were free, and his palace was occupied by his former Majordomo Bib Fortuna, who took his place as Daimyo of Tatooine until Fett killed and usurped him. Fett sought to rebuild Jabba's criminal empire in his own image, intending to rule with respect rather than the fear that the Hutt instilled in his followers.\nJabba Desilijic Tiure was a Hutt who hailed from Nal Hutta. He was born in 600 BBY. He was the grandson of Mama and Papa the Hutts, and the nephew of Ziro and Ebor, as they were the siblings of his father. His mother left enough of a mark on him that, years later, he would force the Askajian dancer Yarna d'al' Gargan to wear special makeup to make her look more like his genitrix. He also had a cousin named Crakka and a nephew named Gorga.\nSeveral centuries before the Galactic Civil War, he became the reigning crime lord in the Outer Rim, owning several criminal enterprises which included smuggling, glitterstim spice dealing, slave trading, assassination and piracy. At some point, Jabba became affiliated with the Crymorah Syndicate. As a result of his collaboration with the Crymorah, he gained a position on the Grand Hutt Council. As a crime lord, Jabba based his illicit operation out of his palace in the Northern Dune Sea of the desert world Tatooine, from where he spread his operations and influence across the Outer Rim by employing a network of smugglers who moved his goods across the galaxy.\nForming a powerful criminal empire, his operations grew to include slavery, arms dealing, spice smuggling, and gambling. Gambling was a prominent feature of the Mos Espa Grand Arena, where Jabba controlled the gambling and concessions during the popular podraces. The spice trade was a major part of Jabba's empire, becoming one of the primary ways the Hutt made money. To those who respected his authority, very few, he was formally styled as \"His Excellency Jabba Desilijic Tiure of Nal Hutta, Eminence of Tatooine.\"\nYears before the Great Disaster, Jabba, along with other Hutts, attended a banquet on Hynestia as part of a treaty negotiation between the Hynestian royal family and the Grand Hutt Council. The Hutts planted Povo Punch in the drink menu as a means of inciting a diplomatic incident. When Jedi Master Lynela Kabe-Oyu, Stellan Gios, and his padawan Vernestra Rwoh, noticed the Povo Punch and attempted to save the Hutts, the Hutts opened fire on the banquet, claiming that the incident was an insult that justified violent action against Hynestia.\nAfter the Jedi settled the situation, Jabba and his fellow Hutts attempted to escape, only to be stopped by the Jedi themselves. Queen Nyla, Ruler of Hynestia, stepped in to officially capture Jabba and his fellow Hutt conspirators for attempting to disrupt the treaty and to assassinate attendees of the diplomatic banquet, putting him for ransom to the Hutt Council.\nShortly after the start of the Invasion of Naboo in 32 BBY, Jabba presided over the Boonta Eve Classic podrace, where his entrance in the stands was greeted with cheers from the spectators who came to watch the race from all corners of the Outer Rim Territories. Jabba signaled the start of the race, and the podracers began their laps, at the end of which Anakin Skywalker, a young slave from Mos Espa, emerged victorious. Jabba had to be awoken after falling asleep during the race, as podracing did not entertain him—aside from the gambling involved.\nTen years after the Naboo Crisis, the galaxy was plunged into the chaos of the Clone Wars, a massive galactic conflict between the Grand Army of the Republic and the droid armies of the Confederacy of Independent Systems. Shortly after the outbreak of the war, Jabba's infant son, Rotta, was kidnapped. Though Jabba did not know who the kidnapper was, it was carried out by his uncle, Ziro, and the Separatist Alliance, both of whom had their own schemes at play. Jabba requested the assistance of anyone who could help, and the Republic and the Jedi Order answered the call. It was the hope of Supreme Chancellor Palpatine that the Republic would be able to negotiate an alliance with Jabba for use of Hutt hyperspace lanes in the Outer Rim, as the Separatists controlled the major lanes.\nThe Jedi sent General Anakin Skywalker, who had become a Jedi Knight in the years since his victory in the Boonta Eve Classic, and his Padawan, Ahsoka Tano, to the Teth system to find Rotta. Meanwhile, General Obi-Wan Kenobi traveled to Tatooine to personally negotiate a treaty with Jabba. While the Jedi Master was en route, Jabba was presented with the heads of bounty hunters he had sent to Teth to find his son. Infuriated by the lack of progress, Jabba contacted Chancellor Palpatine and, through his translator droid, TC-70, demanded to know why the Jedi were not searching for his son. The chancellor assured the crime lord that the Jedi were on their way, of which Jabba said the treaty with him depended on.\nKenobi soon arrived at Jabba's Palace and was taken before the Hutt's court. Kenobi told Jabba that Skywalker, who he described as one of the Order's most powerful Jedi, was on his way to Teth to rescue Rotta and that the Jedi would not let the Hutt down. Jabba attached one additional condition to the proposed treaty—that the Jedi deliver him the kidnapper as well, dead or alive. Jabba also leveled a threat against the Jedi: if they did not succeed, the Separatist leader Count Dooku and the Separatist Droid Army would—still not knowing that Dooku himself was behind the kidnapping, in a plot to turn the Hutt Clan into an enemy of the Republic. Kenobi departed the palace, which was followed by the arrival of Count Dooku himself. The Sith Lord claimed that it was the Jedi who kidnapped Rotta and that the Jedi were plotting to destroy Jabba. Jabba demanded proof, which Dooku delivered in the form of a manipulated holographic recording allegedly showing Skywalker and Tano, who had found Rotta on Teth, harming the child, when in reality they were caring for it after he had fallen ill. Dooku told the crime lord that the Separatist Droid Army was initiating a rescue mission and would soon deliver the Huttlet to his father. All Dooku asked in return was that Jabba join the Separatist cause.\nDooku's Sith acolyte, Asajj Ventress, contacted the count, who played her message in front of Jabba and his court. Ventress claimed that Skywalker killed Rotta and was on his way to Tatooine. Jabba questioned why the Jedi would come to Tatooine, to which Dooku said that the Jedi plot had become clear and that Skywalker would soon arrive to kill the crime lord and wipe out the entire Hutt Clan. Dooku promised Jabba that he would personally deal with Skywalker and, despite fighting the Jedi Knight in a lightsaber duel in the desert, Skywalker managed to reach Jabba's Palace. Once there, Skywalker found that Tano, who had Rotta and from whom he had become separated, had not yet reached the palace. Jabba's henchmen drew their weapons on Skywalker, so the Jedi Knight drew his lightsaber and pointed it at Jabba—seemingly confirming Dooku's claims. Jabba said that this was proof that Skywalker had arrived to kill him, but the Jedi said he had only come to negotiate. Just as Jabba's henchmen prepared to kill Skywalker, Tano arrived and delivered Rotta to his father.\nDespite the happy reunion with his son, Jabba ordered Skywalker and Tano's execution due to believing they kidnapped his son. They were saved, however, by a message from Senator Padmé Amidala of Naboo, who had discovered Ziro's involvement in the plot. Ziro entered the holographic transmission and admitted to conspiring with Dooku to kidnap Rotta and frame the Jedi, so Jabba told the senator that the Hutt Clan would severely punish Ziro. Amidala asked him if the hostilities between Jabba and the Jedi could cease and if he would open his hyperspace lanes to the Republic, to which Jabba agreed. The two sides signed a treaty allowing the Grand Army of the Republic through Jabba's territories, a decision Amidala assured him he would not regret. Grand Master Yoda and clone forces soon arrived at Jabba's Palace, signaling a new era of cooperation between the Republic and Jabba the Hutt.\nLater in the war, Jabba was visited by Baron Notluwiski Papanoida, the chairman of the moon Pantora, whose daughters, Che Amanwe Papanoida and Chi Eekway Papanoida, had been kidnapped by Greedo, a bounty hunter in Jabba's employ. The chairman was able to reason with the Hutt crime lord, who, like Papanoida, knew all too well what it was like to have his child taken from him. Greedo insisted that he was not responsible, but Jabba allowed a blood sample to be taken from his bounty hunter so it could be compared to blood found at the scene of the crime. Greedo admitted to kidnapping the chairman's daughters at the behest of the Separatists, who wanted leverage against the Pantorans, and Papanoida was soon reunited with his children.\nShortly thereafter, the Grand Hutt Council became concerned that Ziro, who was in Galactic Republic custody, was planning on turning over incriminating evidence about the council's illicit activity, as the imprisoned Hutt had a journal secretly hidden on Teth that contained the evidence. Jabba hired bounty hunter Cad Bane to free Ziro from prison, so he could be imprisoned by the Hutt Clan instead. Bane took members of the Galactic Senate hostage inside the Senate Building, offering their safety in return for Ziro's freedom. Chancellor Palpatine refused the demands, but Palpatine soon changed his mind and allowed Ziro to be freed. Bane brought Ziro to the Grand Hutt Council on Nal Hutta, where Ziro was imprisoned once more, though Jabba himself was not present. Gardulla Besadii the Elder instead acted as a representative.\nJabba instead planned Ziro's elimination. He hired Ziro's old girlfriend, the singer Sy Snootles, to find the records and eliminate Ziro. Snootles freed Ziro from his imprisonment and tricked him into believing that she was on his side, so he brought her to Teth where he planned to recover his records. Once there, however, Snootles killed the crime lord and brought the records to Jabba, who expressed his gratitude for her work.\nJabba Desilijic Tiure later found himself roped into the schemes of Maul, a renegade Sith Lord who hoped to regain the status he lost after his defeat during the Battle of Naboo over a decade earlier. As part of his plan, Maul formed the Shadow Collective, an alliance between the Mandalorian faction Death Watch and various elements from the criminal underworld, including Black Sun and the Pyke Syndicate. Their goal was to take over the planet Mandalore. Despite their combined might, the Shadow Collective still required additional resources, including muscle and supplies, to achieve their goal. To find these resources, they went before the Grand Hutt Council to negotiate an alliance between the Hutt Clan and the Shadow Collective. Maul, his brother Savage Opress, and Death Watch leader Pre Vizsla met with the Hutt leaders, where Maul negotiated the terms and conditions of the alliance with Jabba himself. The Hutts wanted to know what they could offer and how much their assistance was worth. Maul proposed an exchange: in return for Hutt Space and everything in its borders, he would spare their lives. Jabba and the Council were dismissive of Maul's threats, which resulted in a skirmish between the Shadow Collective and the Grand Hutt Council's forces. Maul, Opress, and Vizsla fought off various enforcers and bounty hunters, until their Death Watch reinforcements arrived. With the additional troops, Maul, Vizsla and Opress were able to rout the enemy forces and secure a victory.\nAlthough the Collective was triumphant, the ensuing conflict and chaos allowed all but one Hutt to escape—Oruba. Maul interrogated Oruba, threatening to kill him unless he revealed where the others had escaped to. Under duress, Oruba informed Maul that he could find Jabba in his palace on Tatooine. The Shadow Collective soon arrived, facing little resistance as they made their way into Jabba's court. Maul ordered Jabba and the council to submit to his demands and join the Shadow Collective, lest they suffer his wrath. With little choice in the matter, Jabba agreed to assist the Shadow Collective in its takeover of Mandalore. The resources the Hutt Clan provided aided the Shadow Collective in its successful takeover of Mandalore, with Maul declaring himself the new leader of Mandalore. However, the Sith Lord Darth Sidious—secretly Chancellor Palpatine himself—came to regard Maul as a threat and targeted the Shadow Collective. The group fractured under assault by the Sith and their Separatist puppets, and Maul's plan was resoundingly defeated by Darth Sidious.\nAt the end of the Clone Wars, the Republic was transformed into the Galactic Empire, and the chancellor declared himself Emperor. Jabba continued his illicit operations during the Age of the Empire, continuing to hold influence as a crime lord. Around one year into the Empire's reign, former Padawan Ahsoka Tano decided against going to Jabba for help while avoiding the Imperial Military, deciding the Hutt would not help her despite her role in saving his son during the Clone Wars.\nDuring a particularly bad drought on Tatooine, Jabba began collecting a hefty water tax from local moisture farmers. This earned his thugs an unpleasant encounter with Obi-Wan Kenobi, who was watching and protecting a young Luke Skywalker. When Skywalker attempted to steal the thugs' collections for the day, they caught and threatened to kill him. It was at that moment that Kenobi took down the thugs with the Force. Under cover of darkness, the gangsters were unable to identify Kenobi. Most displeased with his loss of tax revenue, Jabba hired the Wookiee bounty hunter Krrsantan to track down and identify the former Jedi Master.\nStreet orphan and later rebel Jedi Ezra Bridger identified himself as \"Jabba\" whenever he wanted to keep his real name secret, for example to Imperial officers.\nIn 10 BBY, the scoundrel Tobias Beckett came into contact with Jabba and intended to travel to Tatooine to work for him once he decided to leave Crimson Dawn, but he was killed by Han Solo at Savareen before that could come to be. As such, Jabba hired Solo for his operations, who became the best smuggler on Jabba's payroll. Solo's standing was jeopardized, however, when his ship, the Millennium Falcon, was boarded by Imperial authorities, forcing Solo to jettison his cargo. Jabba demanded compensation for the lost cargo and, when Solo could not pay, the crime lord sent bounty hunters after him. One such hunter was Greedo, who confronted Solo in a cantina in Mos Eisley, but Solo killed the Rodian bounty hunter before he could kill Solo. Jabba learned of this and found Solo in Docking Bay 94, where the smuggler said that he had no choice but to dump his cargo. Jabba agreed to give Solo an extension on the payment in exchange for fifteen percent interest. Solo accepted the offer, but he soon became involved in the Alliance to Restore the Republic and once again failed to pay Jabba. When Jabba learned that Solo had joined the Rebellion, Jabba placed a large bounty on the smuggler's head.\nShortly after the Battle of Yavin, in which the Alliance—with Solo's help—destroyed the Imperial, planet-destroying battle station known as the Death Star, the Empire was left in dire need of additional military resources. To increase its supply of weapons, the Empire planned to negotiate with an envoy in Jabba's employ on Cymoon 1, in the Corellian Industrial Cluster. The Sith Lord Darth Vader—formerly Anakin Skywalker—was tasked as the Imperial negotiator, with the intent of forcing Jabba's envoy in a deal favorable to the Empire. The envoy's vessel was hijacked by the Rebel Alliance, however, and a team of Rebels, including Solo, used it to assault and destroy Weapons Factory Alpha on Cymoon 1, leveling another critical defeat against the Empire.\nThe Emperor ordered Vader to travel to Tatooine and negotiate with Jabba personally. The Sith Lord arrived a day ahead of schedule, using his early arrival to carry out a personal mission in Jabba's Palace. Vader told Jabba that he would return on official Imperial business the next day, but, for that moment, he wanted to discuss his own mission. Jabba believed that Vader would attempt to use a mind trick to force him into doing the Dark Lord's will, but Vader said he would not, as mind tricks were not the way of the Sith. Jabba briefly considered collecting the bounty that the Rebel Alliance placed on Vader's head and throwing him into a rancor pit beneath his court, but he opted not to once he realized Vader was aware of the trap. Jabba continued his discussions with Vader and incorrectly referred to the Sith Lord as a Jedi, resulting in Vader igniting his lightsaber and becoming a target of Jabba's henchmen. The Dark Lord wiped many of the guards out before using the Force to choke Jabba, an attack that left the crime lord more amenable to Vader's demands. With Jabba ready to comply, Vader explained that he needed two of Jabba's best bounty hunters to work on a personal mission. Jabba agreed to the demands and provided him with Boba Fett and Black Krrsantan.\nAs promised, Vader returned to Jabba's court the next day to continue the official negotiations on behalf of the Empire. The negotiations concluded with Jabba agreeing to provide the Imperial war machine with whatever resources it required. Jabba requested only that the Emperor pay him well, to which Vader said that the Empire would pay him whatever they felt was appropriate. Additionally, as long as Jabba complied with Imperial demands, the Empire would allow Jabba to continue operating his criminal empire. Jabba convinced Vader to briefly stay on Tatooine for a feast and entertainment in the Sith Lord's honor, and the entertainment proved to be the hunting of wild bantha. Jabba hosted the Sith Lord on his sail barge, where Jabba inquired as to whether the two bounty hunters had proven themselves useful thus far. Vader stated that their missions would be simple enough: capture an Imperial agent working for the Emperor, and locate the pilot who destroyed the Death Star. Vader also demanded to know everything that Jabba knew about Obi-Wan Kenobi, who lived in exile on Tatooine for nearly two decades. Jabba told him only that Kenobi had proven to be a thorn in his side in those years.\nAfter the smuggler Sana Starros sold a crate of stolen Imperial blasters for 5,000 credits to a gang of Krawg pirates and the name and location of the blasters for 20,000 credits to an Imperial office on Coruscant with Lando Calrissian, they turned to Jabba to buy twelve boxes of blasters, since Starros had in fact just stolen one box and sold them to the pirates; the other twelve were stolen by Jabba's men from an abandoned Imperial ship over Tatooine. Jabba initially told them that he did not deal with such weapons, as this was prohibited by Imperial law. When Starros asked him about the twelve crates, Jabba said that perhaps Starros herself could be the thief, and referred to her relationship with Han Solo. Starros said that she had no relationship with Solo and then demanded 20,000 credits for the names of the thieves, who, according to her, were the Krawg pirates. At the same moment, a Krawg pirate appeared behind them and accused them of lying, but was shot dead by Starros. He carried one of the blasters, so Jabba believed and paid her. Starros on the other hand stole the Hutt the other twelve crates.\nAt one point, a Rodian male and a human male sought out Jabba in his palace to get some Tusken wine from him, after discovering that it was extremely popular within the high society of Canto Bight on Cantonica. There they saw several Tusken Raiders, who demanded that Jabba should prevent Jawas and Imperials from continuing to enter their dunes. However, Jabba did not care about their problems, made fun of them and eventually threatened them indirectly, but finally assured them that he would take care of the matter. When Cantonica's two traders put forth their requests, Jabba presented them a purchase, but refused to give it to them, emphasizing that this was the only quantity of desert wine on Tatooine and they should not come up with the idea of stealing the Tuskens' property during one of their night prayer at highmoon at the Great Dune, because then they would die.\nHowever, in a bar in Mos Eisley the traders decided to steal the desert wine, especially since the price had risen. They were overheard by a Jawa, who went immediately to his people to tell them about the expensive wine. However, they were watched by an Imperial droid, who in turn informed an Imperial captain about the wine. During the night, the two traders went to the Great Dune, where they discovered that there were no Tuskens. Soon after, a few Jawas with battle droids appeared as well as Imperial stormtroopers with their captain. They all demanded that each other lower their weapons. Before shots were fired, the Rodian tried to convince all parties that there desert wine and someone had planned for them to be there. At that moment, the Imperial captain was shot dead by Boba Fett, who was hiding in the dunes. Thereupon carnage broke out, which the Tuskens, who had pitched their camp a few yards away, noticed. The next day, the Tuskens rode their banthas to Jabba's palace, dragging corpses of stormtroopers behind them. At the palace, they were briefly stopped by Bib Fortuna and some Gamorrean guards, but Jabba ordered his people to lower their weapons and accepted the tribute of the Tuskens to him.\nShortly thereafter, he was informed by Fortuna that a Coruscant cartel had found a way to artificially produce the desert wine, and now the wine was worthless, according to Fortuna. Jabba told his majordomo that he was a fool, took a massive gulp of the wine, and dropped the empty container to the ground, proclaiming that it was priceless.\nThree years after the Battle of Yavin, Fett was once again hired by Darth Vader to track down the Millennium Falcon, which Vader used in his hunt for Luke Skywalker—who he had discovered was the pilot who destroyed the Death Star. The resulting capture of the Rebel vessel led to Solo's capture at Cloud City, Bespin, and he was frozen in carbonite as a test to ensure the process would work on Skywalker despite Fett's concerns that Solo could result killed. Despite Vader's promises to compensate him if Solo died, Solo survived with no harm and Fett was given the frozen smuggler to take him to Jabba so he could claim the bounty in exchange for his services to the Empire. Solo's friends tried to rescue him, but ultimately failed and Fett left with Solo aboard Slave I.\nShortly after the Empire's takeover of Cloud City, Lando Calrissian went to Tatooine alongside Chewbacca, Solo's Wookiee companion, aboard the Millennium Falcon to check if Fett had already delivered Solo to Jabba so in case he hadn't, they could look for leads on Fett. Tricking the Harlok Gang into escorting them to Jabba's Palace after they saved them from a group of TIE starfighters by saying them that as Baron Administrator of Cloud City he wanted to negotiate with Jabba a deal for shipments of tibanna gas, Calrissian was brought to Jabba's Palace. After waiting for a while, Calrissian was brought before Jabba by Biff Fortuna. For his relief, Calrissian learned that Solo hadn't been delivered yet, as Fett was nowhere to be seen and Jabba didn't know about Solo's capture.\nHowever, Jabba demanded to know why Calrissian had lied to the Harlok Gang, as no tibanna arrangement between them had taken place and he had lost his position as Baron Administrator since the Imperial takeover. Calrissian admitted his ruse and proposed Jabba to lend him some of his fighters to take back Cloud City and give him tibanna gas at a good price, only to learn that Jabba had already made a tibanna deal with the Empire. Acknowledging that the former Baron Administrator had arrived on Tatooine with the Millennium Falcon, Jabba decided to take the Falcon as a partial payment and feed Calrissian to his rancor unless he had something else useful to offer. Desperate, Calrissian offered Jabba the knowledge of who had Solo in possession, but Jabba required more. With nothing more to offer, Calrissian told Jabba that he was currently working with the Rebellion, so he could tip him off from any information he desired to know.\nDuring Bokku the Hutt's strike against the Empire, as Bokku was truly an agent of the reemerging Crimson Dawn syndicate, Vader boarded the War barge of the Hutt Council and butchered the council members aboard to end the attack. Vader's massacre left Jabba the only surviving member of the Hutt Council, thus giving him complete control over the Hutt Clans. Afterward, Fett brought Solo to Tatooine, where he collected the bounty Jabba placed on Solo's head. Solo was kept encased in carbonite and put on display in Jabba's court, as Jabba decided it was his favorite decoration. Unknown to Jabba at the time was that Solo's friends were plotting his rescue, and that one of his friends, Lando Calrissian, had already infiltrated Jabba's Palace and disguised himself as a guard.\nThe plan was put in place upon the arrival of the protocol droid C-3PO and astromech droid R2-D2. R2 carried with him a message from Skywalker, who declared himself a Jedi Knight and announced his intention to bargain for Solo's life. The young Jedi said he would arrive soon, and he offered the two droids as a gift for the crime lord. Jabba boasted that there would be no bargain, however, and conscripted the two droids into his service. 3PO became his new translator, while R2 would serve drinks on Jabba's sail barge.\nLater, during a performance of the song \"Jedi Rocks\" by the Max Rebo Band, Jabba's personal dancer, Oola, resisted his advances toward her, and the Hutt activated the trapdoor and sent her to her death in the rancor pit. The chaotic moment was followed by the arrival of Princess Leia Organa, who, as part of the rescue plan, came disguised as the bounty hunter Boushh and brought Chewbacca as her \"prisoner.\" Tipped off by Boba Fett, Jabba knew it was not really Boushh under the helmet, but he thought the impostor was just a short lowlife smuggler. The disguised Organa demanded the bounty on the Wookiee's head and insisted on 50,000 credits, which Jabba balked at. Organa threatened him with a detonator, leading Jabba to compliment Boushh, and the two agreed on 35,000 credits. Chewbacca was imprisoned in Jabba's dungeons, while Organa waited in the palace so she could free Solo after the court had gone to sleep.\nOrgana freed Solo from carbonite that evening, but Jabba and his court discovered them. Solo tried to bargain with the gangster, saying he was on his way to pay Jabba when Fett captured him, but Jabba said it was too late to pay him and imprisoned Solo. Now having seen Organa's real identity, Jabba ordered his guards to bring her to him. After exchanging threats, Jabba licked Organa's face and enslaved her, replacing the murdered Oola. He forced Organa to wear a dancer's outfit and had her collared and chained to his throne. Jabba and his court proceeded to celebrate late into the night.\nThe next morning, Jabba and his thugs were awoken by Skywalker's arrival at the palace. Skywalker was able to gain entry by using a mind trick on Fortuna, despite Jabba's strict orders not to admit the Jedi. Skywalker demanded that Jabba free Solo and his friends, or else face his destruction. Jabba refused, causing Skywalker to pull a blaster on him, at which point Jabba activated the trapdoor and sent Skywalker and a Gamorrean guard into the rancor pit. The rancor ate the guard, but Skywalker was able to kill the beast, infuriating the gangster. In his anger, Jabba choked Organa and demanded that Solo and Chewbacca be brought before him.\nAs punishment for the outrage, Jabba ordered that Skywalker, Solo, and Chewbacca were to be executed by being fed to the sarlacc, a creature that dwelled in the Great Pit of Carkoon. Jabba spared Organa from execution as she was his favorite slave at the time. Jabba and his court traveled to the Great Pit of Carkoon on his sail barge, while the prisoners were transported on a smaller skiff. On the way, Jabba briefly allowed Organa to leave his side so that she could watch her friends from a window, but later recalled her to his throne to inform her that she would soon learn to appreciate him. Jabba toasted his plans by sharing his drink with Organa.\nUpon arriving at Carkoon, Jabba gave his prisoners a chance to beg for mercy. Solo balked at the suggestion while Skywalker offered one last opportunity to free them and threatened to kill Jabba if he did not. The crime lord refused and ordered the prisoners into the pit, but R2 revealed Skywalker's hidden lightsaber, and the Jedi attacked Jabba's thugs. The growing battle led to chaos on Jabba's sail barge, as his enforcers attempted to kill the Jedi and the Rebels. In the ensuing panic, Organa wrapped the chain she was bound in around Jabba's neck and strangled him to death, bringing an end to the criminal reign of Jabba the Hutt. After his death, Solo and his friends escaped, and Jabba's corpse was blown up when his sail barge exploded over the sarlacc pit.\nAfter Jabba's demise, the Hutts were left to determine who would fill Jabba's seat and take reins of his criminal empire. Several months after Solo's rescue, a decision had yet to be made. Immediately following Jabba's demise, in order to determine the exact nature of the Hutt's death and settle the debate over the matter of his will, the Hutt Clan had the wreckage of the Khetanna examined. What they found was only a holorecording of Organa choking Jabba in his last moments. Most of the circulated copies of this footage and their vendors were hunted down by the Clan to prevent proof of their own vulnerability from circulating.\nMany of Jabba's slaves were freed after the battle at Carkoon, leading the prominently enslaved Niktos to admire Organa for choking the Hutt, earning her the nickname \"Huttslayer.\" Coupled with the Empire's collapse, Jabba's death left enormous power vacuums in the Kessel spice trade, leaving trade routes once guarded by Hutt-hired mercenaries vulnerable. Over the years following Jabba's death, a Huttese song known as \"Jabba Flow,\" composed by the Shag Kava band, was named after Jabba as was a non-alcoholic beverage known as \"Jabba Juice.\"\nBib Fortuna returned to the palace and took over Jabba's criminal operations. Around 9 ABY, Boba Fett, joined by his accomplice Fennec Shand, stormed the palace. Fett slayed Fortuna and took control of the remnants of Jabba's criminal empire.\nDuring his self-imposed exile on Ahch-To, the Jedi Master Luke Skywalker had a dream where he ignored Organa's message and never joined the Rebellion and never caused Jabba's death. In his dream, Jabba was still operating on Tatooine following Skywalker's marriage to Camie Marstrap and was still charging water taxes to moisture farmers.\nLeader of one of the most famous cartels in the galaxy, Jabba Desilijic Tiure technically controlled Tatooine's underworld. He was legendary for his vicious temper, endless greed, gruesome appetite and fondness for violent entertainment. Jabba had an affinity for young female humanoids, often enslaving them as dancers or companions. The Hutt was also known to collect various trophies that signified his power. One of the most prominent examples was when he hung Han Solo's carbonite-frozen body on the wall of his throne room as a decoration.\nJabba didn't tolerate liars. When Lando Calrissian was brought before him by the Harlok Gang by saying that he had arranged a deal with Jabba for tibanna gas, Jabba made him know that he perfectly knew that no such deal had ever taken place, leading the Hutt to threaten Calrissian to feed him to his rancor for daring to obtain an audience with him under false pretenses. Nor did he tolerate those who rebelled against him, placing severe punishments against them, as was the case of the Twi'lek slave he threw into the rancor pit for disobeying him during a dance.\nDespite his ruthless reputation and cruel personality, Jabba nevertheless had a caring side: he loved his son Rotta very much and became furious when he was kidnapped by the Separatists, willing to punish those responsible with death.\nJabba had a tattoo of the Desilijic kajidic symbol on his right arm.\nJabba the Hutt was first mentioned in the 1977 film Star Wars: Episode IV A New Hope and was mentioned again in the 1980 sequel Star Wars: Episode V The Empire Strikes Back. He first appeared in 1983 in the final film of the original trilogy, Star Wars: Episode VI Return of the Jedi, and he was later added to the Special Edition of Episode IV when a previously unfinished scene was restored to the film.\nDeclan Mulholland was cast as Jabba in the unfinished scene from the original Star Wars, in which he was a rotund human dressed in a shaggy fur coat, but the scene was cut as George Lucas wanted to depict Jabba as an alien creature, but the special-effects technology of the time was not up to the task of replacing Mulholland. For Return of the Jedi, Jabba was portrayed by puppeteers Toby Philpott, David Barclay, and Mike Edmonds, and voiced by Larry Ward. In Return of the Jedi, Jabba's slimy sound was primarily made using a bowl of melted cheese.\nIn 1999, he appeared in the first chapter of the prequel trilogy, Star Wars: Episode I The Phantom Menace, and made several appearances in the animated television series Star Wars: The Clone Wars and the film, where he was voiced by Kevin Michael Richardson. George Lucas originally placed off-limits the possibility of using Jabba in the series when writer Henry Gilroy was writing the show bible, but by the time of the next meeting, Lucas changed his mind, and Jabba was allowed to be used in both The Clone Wars film and the subsequent TV show.\nCrime lord Azmorigan was modelled after early concept art of Jabba the Hutt originally for Return of the Jedi.\nThe Databank entry for Jabba on StarWars.com lists \"Hutt, B'omarr Monk\" as his species.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Jabba_the_Hutt_(disambiguation)",
  "/wiki/First_Mission",
  "/wiki/The_High_Republic_Adventures_(2021)_6",
  "/wiki/The_High_Republic_Adventures_(2021)_7",
  "/wiki/The_Lost_Nightsister",
  "/wiki/Rampage_(episode)",
  "/wiki/Star_Wars_(2015)_7",
  "/wiki/Star_Wars_(2015)_20",
  "/wiki/Choose_Your_Destiny:_A_Podracer_Mission",
  "/wiki/Han_Solo_%26_Chewbacca_1",
  "/wiki/Han_Solo_%26_Chewbacca_2",
  "/wiki/Choose_Your_Destiny:_A_Han_%26_Chewie_Adventure",
  "/wiki/The_Hoojib_Menace",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars_(2015)_4",
  "/wiki/Doctor_Aphra_(2016)_9",
  "/wiki/Star_Wars_(2015)_34",
  "/wiki/Age_of_Rebellion_-_Jabba_the_Hutt_1",
  "/wiki/Rabbit_Hunt",
  "/wiki/A_Rebel_Bounty",
  "/wiki/Star_Wars_(2020)_10",
  "/wiki/Star_Wars_(2020)_11",
  "/wiki/Star_Wars:_War_of_the_Bounty_Hunters_(TPB)",
  "/wiki/Star_Wars:_War_of_the_Bounty_Hunters_Companion",
  "/wiki/Bounty_Hunters_12",
  "/wiki/Doctor_Aphra_(2020)_12",
  "/wiki/Star_Wars_(2020)_16",
  "/wiki/Crimson_Reign_1",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Life_Day_1",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_4",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Crime_and_Punishment",
  "/wiki/Nal_Hutta",
  "/wiki/Tatooine",
  "/wiki/600_BBY",
  "/wiki/4_ABY",
  "/wiki/Hutt",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Desilijic",
  "/wiki/Hutt_Clan",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Crymorah_Syndicate",
  "/wiki/Shadow_Collective",
  "/wiki/Crime_lord",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Pirate",
  "/wiki/Slavery",
  "/wiki/Clone_Wars",
  "/wiki/Hyperspace_route",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Rotta",
  "/wiki/Galactic_Empire",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Emperor",
  "/wiki/Battle_of_Yavin",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Anakin_Skywalker",
  "/wiki/Assault_on_Cymoon#Aftermath",
  "/wiki/Imperial_Military",
  "/wiki/Han_Solo",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Jedi_Knight",
  "/wiki/Luke_Skywalker",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Death",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Nikto",
  "/wiki/Daimyo",
  "/wiki/32_BBY",
  "/wiki/Mama",
  "/wiki/Papa",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Ebor",
  "/wiki/Jabba_Desilijic_Tiure%27s_father",
  "/wiki/Parent",
  "/wiki/Askajian",
  "/wiki/Yarna_d%27al%27_Gargan",
  "/wiki/Crakka",
  "/wiki/Gorga_Desilijic_Aarrpo",
  "/wiki/Standard_century",
  "/wiki/Galactic_Civil_War",
  "/wiki/Spice",
  "/wiki/Northern_Dune_Sea",
  "/wiki/Desert",
  "/wiki/Smuggler",
  "/wiki/The_galaxy",
  "/wiki/Mos_Espa_Grand_Arena",
  "/wiki/Podracing",
  "/wiki/Currency",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Hynestia_Prime",
  "/wiki/Hynestian_royal_family",
  "/wiki/Povo_Punch",
  "/wiki/Lynela_Kabe-Oyu",
  "/wiki/Stellan_Gios",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Nyla",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Mos_Espa",
  "/wiki/File:HuttTreaty-TCWf.ogg",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Separatist_Droid_Army",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Jedi_Order",
  "/wiki/Supreme_Chancellor",
  "/wiki/Hyperspace",
  "/wiki/Jedi_General",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Teth_system",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Master",
  "/wiki/TC-70",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Sith_Lord",
  "/wiki/Hologram",
  "/wiki/Sith",
  "/wiki/Asajj_Ventress",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Baron",
  "/wiki/Notluwiski_Papanoida",
  "/wiki/Chairman",
  "/wiki/Pantora",
  "/wiki/Che_Amanwe_Papanoida",
  "/wiki/Chi_Eekway_Papanoida",
  "/wiki/Greedo",
  "/wiki/Hutt_Council_records",
  "/wiki/Cad_Bane",
  "/wiki/Galactic_Senate",
  "/wiki/Senate_hostage_crisis",
  "/wiki/Galactic_Senate_Building",
  "/wiki/Gardulla_Besadii_the_Elder",
  "/wiki/Sy_Snootles",
  "/wiki/Unidentified_GL_vendor_droid_(Tatooine)",
  "/wiki/Maul",
  "/wiki/Battle_of_Naboo",
  "/wiki/Death_Watch",
  "/wiki/Black_Sun",
  "/wiki/Pyke_Syndicate",
  "/wiki/Takeover_of_Mandalore",
  "/wiki/Mandalore",
  "/wiki/Savage_Opress",
  "/wiki/Pre_Vizsla",
  "/wiki/Hutt_Space",
  "/wiki/Oruba",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Imperial_Era",
  "/wiki/Great_Drought",
  "/wiki/Water_tax",
  "/wiki/Moisture_farmer",
  "/wiki/The_Force",
  "/wiki/Wookiee",
  "/wiki/Krrsantan",
  "/wiki/Spectres",
  "/wiki/Ezra_Bridger",
  "/wiki/10_BBY",
  "/wiki/Tobias_Beckett",
  "/wiki/Crimson_Dawn",
  "/wiki/Savareen",
  "/wiki/Millennium_Falcon",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Mos_Eisley",
  "/wiki/Rodian",
  "/wiki/Docking_Bay_94",
  "/wiki/Battle_station",
  "/wiki/Cymoon_1",
  "/wiki/Corellian_Industrial_Cluster",
  "/wiki/Assault_on_Cymoon",
  "/wiki/Weapons_Factory_Alpha",
  "/wiki/Mind_trick",
  "/wiki/Rancor",
  "/wiki/Darth_Vader%27s_lightsaber",
  "/wiki/Force_choke",
  "/wiki/Bantha",
  "/wiki/Sail_barge",
  "/wiki/Cylo",
  "/wiki/Exile_(punishment)",
  "/wiki/Sana_Starros",
  "/wiki/Krawg_pirates",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Desert_wine",
  "/wiki/Canto_Bight",
  "/wiki/Cantonica",
  "/wiki/Tusken_Raider",
  "/wiki/Jawa",
  "/wiki/Captain",
  "/wiki/Stormtrooper",
  "/wiki/Bib_Fortuna",
  "/wiki/Gamorrean",
  "/wiki/3_ABY",
  "/wiki/Cloud_City",
  "/wiki/Bespin",
  "/wiki/Carbon-freezing",
  "/wiki/Carbonite",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Chewbacca",
  "/wiki/Harlok_Gang",
  "/wiki/TIE_line",
  "/wiki/Starfighter",
  "/wiki/Baron_Administrator",
  "/wiki/Tibanna",
  "/wiki/Bokku",
  "/wiki/Attack_on_the_Executor",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/C-3PO",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Jedi_Rocks",
  "/wiki/Max_Rebo_Band",
  "/wiki/Oola",
  "/wiki/Prince",
  "/wiki/Boushh",
  "/wiki/Credit",
  "/wiki/Thermal_detonator",
  "/wiki/Dancing-girl_costume",
  "/wiki/Sarlacc",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Jabba_Desilijic_Tiure%27s_will",
  "/wiki/Kessel",
  "/wiki/Huttese",
  "/wiki/Jabba_Flow",
  "/wiki/Shag_Kava",
  "/wiki/Band",
  "/wiki/Alcohol",
  "/wiki/Jabba_Juice",
  "/wiki/9_ABY",
  "/wiki/Fennec_Shand",
  "/wiki/Ahch-To",
  "/wiki/Dream",
  "/wiki/Marriage",
  "/wiki/Camie_Marstrap",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/Declan_Mulholland",
  "/wiki/George_Lucas",
  "/wiki/Alien",
  "/wiki/Toby_Philpott",
  "/wiki/David_Barclay",
  "/wiki/Mike_Edmonds",
  "/wiki/Larry_Ward",
  "/wiki/1999",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Kevin_Michael_Richardson",
  "/wiki/Henry_Gilroy",
  "/wiki/Azmorigan",
  "/wiki/Databank_(website)",
  "/wiki/StarWars.com",
  "/wiki/B%27omarr_Order",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/5-Minute_Star_Wars_Villain_Stories",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Ambush",
  "/wiki/Sphere_of_Influence",
  "/wiki/Evil_Plans",
  "/wiki/Hunt_for_Ziro",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Missing_in_Action",
  "/wiki/Eminence_(episode)",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Adventures_in_Wild_Space:_The_Cold",
  "/wiki/Adventures_in_Wild_Space:_Books_4%E2%80%936",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Ahsoka_(audiobook)",
  "/wiki/Lords_of_the_Sith",
  "/wiki/Lords_of_the_Sith_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_6",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_7",
  "/wiki/Star_Wars_(2015)_15",
  "/wiki/Han_Solo_%26_Chewbacca_3",
  "/wiki/Han_Solo_%26_Chewbacca_4",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/Han_Solo_%26_Chewbacca_6",
  "/wiki/Han_Solo_%26_Chewbacca_7",
  "/wiki/Han_Solo_%26_Chewbacca_8",
  "/wiki/Han_Solo_%26_Chewbacca_9",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion",
  "/wiki/Ezra%27s_Wookiee_Rescue",
  "/wiki/The_Rebellion_Begins",
  "/wiki/Droids_in_Distress_(book)",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Vision_of_Hope",
  "/wiki/Stealth_Strike",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/The_Line_of_Duty",
  "/wiki/Twilight_of_the_Apprentice",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_Adventures_Annual_2021",
  "/wiki/Paid_on_Delivery",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_Free_Comic_Book_Day_2019",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_1",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_5",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Princess_Leia_%E2%80%93_The_Rescue",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Episode_IV:_A_New_Hope_Read-Along_Storybook_and_CD",
  "/wiki/The_Adventures_of_Luke_Skywalker,_Jedi_Knight",
  "/wiki/A_Leader_Named_Leia",
  "/wiki/Star_Wars_Battlefront",
  "/wiki/Rites",
  "/wiki/The_Luckless_Rodian",
  "/wiki/Not_for_Nothing",
  "/wiki/We_Don%27t_Serve_Their_Kind_Here",
  "/wiki/The_Kloo_Horn_Cantina_Caper",
  "/wiki/Added_Muscle",
  "/wiki/You_Owe_Me_a_Ride",
  "/wiki/Time_of_Death",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Smuggler%27s_Run:_A_Han_Solo_%26_Chewbacca_Adventure",
  "/wiki/Smuggler%27s_Run:_A_Han_Solo_%26_Chewbacca_Adventure_(audiobook)",
  "/wiki/Han_and_the_Rebel_Rescue",
  "/wiki/Star_Wars_Adventures:_Smuggler%27s_Run_1",
  "/wiki/Age_of_Rebellion_-_Han_Solo_1",
  "/wiki/Heir_to_the_Jedi",
  "/wiki/Heir_to_the_Jedi_(audiobook)",
  "/wiki/Choose_Your_Destiny:_A_Luke_%26_Leia_Adventure",
  "/wiki/Han_Solo_1",
  "/wiki/Star_Wars_(2015)_1",
  "/wiki/Star_Wars_(2015)_3",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/Doctor_Aphra:_An_Audiobook_Original",
  "/wiki/Darth_Vader_(2015)_2",
  "/wiki/Star_Wars_(2015)_10",
  "/wiki/Star_Wars_(2015)_11",
  "/wiki/Darth_Vader_(2015)_7",
  "/wiki/Darth_Vader_(2015)_14",
  "/wiki/Doctor_Aphra_(2016)_13",
  "/wiki/Star_Wars_(2015)_35",
  "/wiki/Star_Wars_Annual_(2015)_3",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Star_Wars:_The_Last_Jedi_%E2%80%93_The_Storms_of_Crait_1",
  "/wiki/Star_Wars_(2015)_50",
  "/wiki/Star_Wars_(2015)_68",
  "/wiki/Doctor_Aphra_Annual_3",
  "/wiki/Tales_of_Villainy:_Done_Dirty",
  "/wiki/Star_Wars_Adventures_(2020)_11",
  "/wiki/Choose_Your_Destiny:_An_Escape_Mission",
  "/wiki/Star_Wars:_Commander",
  "/wiki/Star_Wars_Adventures_Annual_2020",
  "/wiki/Tales_from_Wild_Space:_Family_Affair,_Part_1",
  "/wiki/Star_Wars_Adventures_(2017)_10",
  "/wiki/Two_Sides_to_Every_Sortie",
  "/wiki/Empire_Ascendant_1",
  "/wiki/Boba_Fett_-_The_Bounty_Hunter",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Captured_on_Cloud_City",
  "/wiki/Ion_Control",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Wait_for_It",
  "/wiki/No_Time_for_Poetry",
  "/wiki/Right-Hand_Man",
  "/wiki/Star_Wars_(2020)_1",
  "/wiki/Star_Wars_(2020)_2",
  "/wiki/Bounty_Hunters_1",
  "/wiki/Bounty_Hunters_10",
  "/wiki/War_of_the_Bounty_Hunters_Alpha_1",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_Jabba_the_Hutt_1",
  "/wiki/Bounty_Hunters_11",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_4-LOM_%26_Zuckuss_1",
  "/wiki/Bounty_Hunters_13",
  "/wiki/Bounty_Hunters_14",
  "/wiki/Bounty_Hunters_15",
  "/wiki/Darth_Vader_(2020)_12",
  "/wiki/Darth_Vader_(2020)_14",
  "/wiki/Darth_Vader_(2020)_13",
  "/wiki/Darth_Vader_(2020)_15",
  "/wiki/Doctor_Aphra_(2020)_11",
  "/wiki/Star_Wars_(2020)_14",
  "/wiki/War_of_the_Bounty_Hunters_2",
  "/wiki/Bounty_Hunters_16",
  "/wiki/Doctor_Aphra_(2020)_13",
  "/wiki/War_of_the_Bounty_Hunters_3",
  "/wiki/War_of_the_Bounty_Hunters_4",
  "/wiki/Star_Wars_(2020)_17",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Darth_Vader_(2020)_17",
  "/wiki/Bounty_Hunters_17",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_IG-88_1",
  "/wiki/Star_Wars_(2020)_18",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Crimson_Reign_5",
  "/wiki/Star_Wars:_Tales_from_the_Rancor_Pit",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure_(audiobook)",
  "/wiki/Tales_from_Wild_Space:_The_Blue_Brothers",
  "/wiki/Star_Wars_Adventures_(2017)_13",
  "/wiki/Age_of_Rebellion_-_Princess_Leia_1",
  "/wiki/Jabba_the_Hutt_-_Galactic_Gangster",
  "/wiki/Luke_vs._the_Rancor_-_Wrath_of_the_Rancor",
  "/wiki/Luke_vs._Jabba_-_Sail_Barge_Escape",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Rescue_from_Jabba%27s_Palace_(World_of_Reading)",
  "/wiki/Rescue_from_Jabba%27s_Palace_(Star_Wars_Galactic_Adventures)",
  "/wiki/Star_Wars_Galactic_Adventures_(2015)",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/The_Book_of_Boba_Fett_Junior_Novel",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/The_Legends_of_Luke_Skywalker",
  "/wiki/The_Legends_of_Luke_Skywalker_(audiobook)",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/Join_the_Resistance:_Escape_from_Vodran",
  "/wiki/Join_the_Resistance:_Books_1-3",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars_Adventures_Ashcan",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Tales_from_Wild_Space:_Majordomo,_Major_Problems",
  "/wiki/Star_Wars_Adventures_(2017)_23",
  "/wiki/Whills_(short_story)",
  "/wiki/William_Shakespeare%27s_The_Phantom_of_Menace:_Star_Wars_Part_the_First",
  "/wiki/William_Shakespeare%27s_The_Jedi_Doth_Return:_Star_Wars_Part_the_Sixth",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/Star_Wars_Epic_Yarns:_Return_of_the_Jedi",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/The_Chase_with_Han/Escape_with_Chewbacca",
  "/wiki/Dealing_with_Lando/Han_and_Chewie_Strike_Back",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/The_Mines_of_Graballa",
  "/wiki/Race_on_Tatooine",
  "/wiki/The_Maker_of_Zoh",
  "/wiki/Return_of_the_Kyber_Saber",
  "/wiki/The_Embersteel_Blade",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Mission_to_Mos_Eisley_(episode)",
  "/wiki/Flight_of_the_Falcon_(episode)",
  "/wiki/Gambit_on_Geonosis",
  "/wiki/A_Vader_Family_Sithmas",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/From_Trenches_to_Wrenches:_The_Roger_Story_(episode)",
  "/wiki/What_Goes_Up..._(episode)",
  "/wiki/Scouting_for_Leia/A_Mission_with_Maz",
  "/wiki/Disney_Magic_Kingdoms",
  "/wiki/LEGO_Star_Wars_Terrifying_Tales",
  "/wiki/LEGO_Star_Wars_Summer_Vacation",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Tatooine_Rhapsody",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Jabba_Desilijic_Tiure",
  "/wiki/Category:Images_of_Jabba_Desilijic_Tiure",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Star_Wars_Insider",
  "/wiki/Hera:_A_New_Breed_of_Hero",
  "/wiki/Star_Wars_Insider_151",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_71",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_ABC-3PO",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Princess_Leia:_Royal_Rebel",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Databank_A-Z",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_6",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Star_Wars_Helmet_Collection_11",
  "/wiki/Star_Wars_Helmet_Collection_12",
  "/wiki/Star_Wars_Helmet_Collection_14",
  "/wiki/Star_Wars_Helmet_Collection_16",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Star_Wars_Helmet_Collection_23",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Star_Wars_Helmet_Collection_25",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_2",
  "/wiki/Droid_Directory",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_7",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Star_Wars_Helmet_Collection_32",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Star_Wars_Helmet_Collection_38",
  "/wiki/Star_Wars_Helmet_Collection_39",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars_Helmet_Collection_43",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Scum_and_Villainy_Conversion_Kit",
  "/wiki/Hound%27s_Tooth_Expansion_Pack_(X-Wing:_Second_Edition)",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Helmet_Collection_53",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/LEGO",
  "/wiki/LEGO_Classic_Star_Wars",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Practical",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2021",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_-_The_Official_Magazine",
  "/wiki/Star_Wars_-_The_Official_Magazine_101",
  "/wiki/Database",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Star_Wars_Inside_Intel:_Twi%27lek_Culture",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/The_Fett_Family%27s_Finest",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2023",
  "/wiki/Standard_year",
  "/wiki/Time",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Hostage_Crisis",
  "/wiki/Shades_of_Reason",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_Lawless",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_4",
  "/wiki/Amy_Ratcliffe",
  "/wiki/February_27",
  "/wiki/2019",
  "/wiki/February_28",
  "/wiki/The_Mandalorian",
  "/wiki/Chapter_15:_The_Believer",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/July_16",
  "/wiki/June_8",
  "/wiki/2020"
 ]
}