{
 "name": "Jaccoba",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Ginger"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jaccoba was a young Wookiee male who lived near the city of Kachirho on the planet Kashyyyk. In 19 BBY, during the Clone Wars, Jaccoba accompanied his father, Tarkov, on a grantaloupe hunt, during which the pair discovered a Separatist invasion army on Kashyyyk. Both Wookiees reported the Separatist presence to the nearby towns of Warralokk, Grunnrurr, and Rowrakruk. Later, when the Republic sent a detachment of their army to reinforce the Wookiees' defense of Kashyyyk, Jaccoba and Tarkov fought alongside the Republic's forces to defend Kachirho from the Separatists.\nJaccoba was a young Wookiee male native to the Wawaatt Archipelago near the city of Kachirho on the planet Kashyyyk. In 19 BBY, during the height of the Clone Wars between the Republic and the Confederacy of Independent Systems, Jaccoba and his father, Tarkov, went on a hunt for the four-legged herbivorous grantaloupe, which would elevate Jaccoba to adulthood. During their hunt, Jaccoba threw a spear that missed his grantaloupe target but hit a large piece of shrubbery, creating a loud metallic echo. Tarkov scrutinized the shubbery, trying to figure out why a plant would be making a metallic sound, and discovered that the \"plant\" was actually a Separatist landing craft. Jaccoba and Tarkov moved to a nearby tree for safety, and as they looked down at the landscape, they saw a large Confederate invasion army.\nThe two went to the city of Kahiyuk and alerted the nearby towns of Warralokk, Grunnrurr, and Rowrakruk to the approaching Separatist army. Soon after Jaccoba and Tarkov's discovery, the Republic sent a detachment of their army, under the command of High Jedi General Yoda, to help protect Kashyyyk. The two enlisted in the local military and were among the Wookiees who fought alongside the Republic army to repel the Confederacy's subsequent attack on Kachirho.\nJaccoba cared about Kashyyyk, wanting to warn the rest of the planet about the Confederate presence when he first discovered the approaching invasion army. He also was, along with his father, determined enough to defend Kachirho from the Separatist invaders. Jaccoba had black eyes, and his body was covered in ginger hair.\nJaccoba first appeared as an unidentified Wookiee in the twenty-second chapter of the Star Wars: Clone Wars animated television series. The chapter first aired on Cartoon Network on March 22, 2005 and was the second episode in the series' third season. Jaccoba's name was revealed in the audio commentary for Chapter 22 on the Star Wars: Clone Wars Volume Two DVD. Later, in the Tarkov StarWars.com Databank entry, his biography was expanded upon. He was later given an entry in The Complete Star Wars Encyclopedia.\nJaccoba was named after Jacob Tartakovsky, the son of Genndy Tartakovsky, the director of Star Wars: Clone Wars, as revealed in the Q\u0026A section of the Ask the Master department of Star Wars Insider 90.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/City/Legends",
  "/wiki/Kachirho/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Tarkov",
  "/wiki/Grantaloupe",
  "/wiki/Hunting/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Warralokk/Legends",
  "/wiki/Grunnrurr/Legends",
  "/wiki/Rowrakruk/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Battle_of_Kashyyyk/Legends",
  "/wiki/Wawaatt_Archipelago/Legends",
  "/wiki/Spear/Legends",
  "/wiki/Plant/Legends",
  "/wiki/C-9979_landing_craft/Legends",
  "/wiki/Kahiyuk/Legends",
  "/wiki/High_Jedi_General/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Clone_Wars_Chapter_22",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/Cartoon_Network",
  "/wiki/March_22",
  "/wiki/2005",
  "/wiki/Clone_Wars:_Season_Three",
  "/wiki/Star_Wars:_Clone_Wars_Volume_Two",
  "/wiki/Star_Wars_home_video_releases",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Jacob_Tartakovsky",
  "/wiki/Genndy_Tartakovsky",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_90",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_24"
 ]
}