{
 "name": "Jacen Syndulla",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lothal"
     ]
    },
    {
     "name": "Born",
     "values": [
      "0 BBY",
      "Lothal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human/Twi'lek hybrid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Teal"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Syndulla clan"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Spectres"
     ]
    }
   ]
  }
 ],
 "content": "Jacen Syndulla was a male human and Twi'lek hybrid who was born during the time of the Galactic Civil War. He was the son of General Hera Syndulla and the late Jedi Knight Kanan Jarrus, and the grandson of Twi'lek revolutionary leader Cham Syndulla.\nJacen Syndulla was born to General Hera Syndulla of the Rebel Alliance on the planet Lothal in 0 BBY. His father was Jedi Knight Kanan Jarrus, who was killed in combat before Syndulla was born against the Galactic Empire while saving Hera and their crew shortly before Lothal's liberation. He was the grandson of Twi'lek freedom fighter Cham Syndulla, a legendary veteran of the Clone Wars and the fight against the Empire.\nSyndulla grew up during the Galactic Civil War, which his mother fought in for the Rebel Alliance. By the time the Empire was shattered in 4 ABY, during the Battle of Endor, the young Syndulla was already considered a member of his mother's crew on the starship Ghost and was given the callsign Spectre 7. Although Syndulla grew up never knowing his father, he was nonetheless surrounded by love from the people he considered family, including the droid C1-10P or \"Chopper.\" Chopper, who was a companion to his mother since her childhood, became a close and constant companion to Syndulla. Despite the aged astromech's usually cantankerous personality, being around the young boy brought out his playful side.\nBy 5 ABY, Jacen and Hera were separated as his mother participated in the final stretch of the Galactic Civil War, including the Battle of Jakku where she had a near-death experience and thought of Jacen during what she believed to be her last moments.\nJacen Syndulla was a male hybrid, born to a human father and a Twi'lek mother. He had mostly human features, though his green hair was similar to his mother's green skin, as well as the tips of his ears and his eyelashes were also green. Even at a young age, the boy showed aptitude as a pilot, and Hera's old friend and crew member, Sabine Wren, recognized that Syndulla was born to fly, just like his mother. He also had blue eyes and light skin.\nJacen Syndulla was introduced in the epilogue of \"Family Reunion – and Farewell,\" the series finale of Star Wars Rebels. His first name, Jacen, was inspired by Jacen Solo, the son of Leia Organa Solo and Han Solo in the Star Wars Legends continuity.\nThe decision to introduce Jacen Syndulla in the series finale was one that executive producer Dave Filoni had been thinking of throughout production on the fourth season. He initially only shared his idea with Kiri Hart, the head of the Lucasfilm Story Group, who was supportive of the character's introduction. Filoni deliberately chose the name Jacen as a way of honoring the character of Jacen Solo and his importance in the stories of Star Wars Legends. Voice actress Vanessa Marshall, however, was unaware of Hera's pregnancy with Jacen when she recorded the final episode, only discovering it during a fan screening.\nAt Dragon Con 2018, when asked by StarWars.com writer Bria LaVorgna about when Jacen was conceived, Rebels writer Henry Gilroy stated that Jacen may have been conceived during the episode \"Kindred,\" describing the scene where Hera finds Kanan meditating out in the fields only for the scene to be cut short with a time cut. However, this has not been stated in any canon source.\nThough Filoni says he has not given much thought to where the character might go in future stories, many creatives within Lucasfilm have expressed interest in the future of the character since the Star Wars Rebels finale aired on March 5, 2018.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Syndulla",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Jacen_Syndulla",
  "/wiki/Lothal",
  "/wiki/0_BBY",
  "/wiki/Human",
  "/wiki/Twi%27lek",
  "/wiki/Hybrid",
  "/wiki/Lothalite",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Syndulla_clan",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Spectres",
  "/wiki/Reproduction",
  "/wiki/Galactic_Civil_War",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Jedi_Knight",
  "/wiki/Kanan_Jarrus",
  "/wiki/Cham_Syndulla",
  "/wiki/Nath_Tensent",
  "/wiki/Planet",
  "/wiki/Parent",
  "/wiki/Death",
  "/wiki/Galactic_Empire",
  "/wiki/Rescue_of_Hera_Syndulla_(Lothal)",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Clone_Wars",
  "/wiki/Ryloth_Insurgency",
  "/wiki/Time",
  "/wiki/4_ABY",
  "/wiki/Battle_of_Endor",
  "/wiki/Starship",
  "/wiki/Ghost",
  "/wiki/Callsign",
  "/wiki/Droid",
  "/wiki/C1-10P",
  "/wiki/Astromech_droid",
  "/wiki/5_ABY",
  "/wiki/Battle_of_Jakku",
  "/wiki/Hair",
  "/wiki/Ear",
  "/wiki/Pilot",
  "/wiki/Sabine_Wren",
  "/wiki/Eye",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Darth_Caedus",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Star_Wars_Legends",
  "/wiki/Dave_Filoni",
  "/wiki/Star_Wars_Rebels_Season_Four",
  "/wiki/Kiri_Hart",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Star_Wars",
  "/wiki/Vanessa_Marshall",
  "/wiki/2018",
  "/wiki/StarWars.com",
  "/wiki/Bria_LaVorgna",
  "/wiki/Henry_Gilroy",
  "/wiki/Kindred",
  "/wiki/March_5",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Battle_of_Scarif",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Jedi_Night",
  "/wiki/Homecoming",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/March_9",
  "/wiki/November_13",
  "/wiki/2022",
  "/wiki/March_1",
  "/wiki/File:Jacen_Syndulla_Star_Wars_Twitter.png",
  "/wiki/September_8",
  "/wiki/February_14",
  "/wiki/2020"
 ]
}