{
 "name": "Jace_Malcom",
 "display_name": "Jace Malcom",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Barcaria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Havoc Squad",
      "Havoc Squad"
     ]
    }
   ]
  }
 ],
 "content": "Jace Malcom was a Human male Republic trooper, who served in the Special Forces Division of the Republic Military during the Great Galactic War and Cold War, and as the military's Supreme Commander during the Galactic War. Malcom grew up on the Mid Rim world of Barcaria, but left at a young age to join the Galactic Republic's defense forces. By 3681 BBY, he was serving as a corporal aboard a Jedi-run space station in orbit above Korriban. In that year, the reconstituted Sith Empire returned to known space to reclaim their lost territory and exact revenge upon the Republic. During these early days of the ensuing Great Galactic War, the Empire launched a massive strike against the Jedi and Republic forces at Korriban in an effort to retake the world which had once been their holy capital. Malcom was caught in the battle, but managed to escape the onslaught alongside Jedi Padawan Satele Shan and incarcerated smuggler, Captain Nico Okarr.\nThe war continued on for nearly three decades, during which time Malcom was inducted into the Republic Army's Special Forces and granted command of the elite infantry unit 326. Under Malcom's leadership, the unit performed highly risky raids into enemy territory and earned the moniker of \"Havoc Squad.\" At the height of the war, the squad was stationed on the Core World of Alderaan while the bulk of the Republic Navy was elsewhere in the galaxy, combating the Sith. While he was stationed on the planet, Malcom and his troopers were swept up in the Battle of Alderaan, a massive Imperial invasion of the tranquil world. As the Sith forces led by Darth Malgus ravaged the planet, Malcom and his comrades took to the forests of Alderaan to wage a guerrilla campaign against the Imperials. When Darth Malgus turned his army toward the Alderaanian capital city, the commander and Havoc Squad positioned themselves to ambush the Sith Lord and halt his advance. In a pitched battle in the forests outside of the capital, Havoc Squad routed the Imperial Army and Malcom fought and defeated Malgus himself with the aid of then-Jedi Knight Satele Shan.\nMalcom's leadership during the battle earned him and Havoc Squad great prestige throughout the Republic and inspired continued resilience against the Sith. This fame attracted the attention of Colonel Elin Garza, with whom Malcom helped found a new, fully-fledged and independent Special Forces Division. Around the same time, Malcom fostered a secret relationship with Shan that ultimately culminated in a tense breakup. However, before their romantic relationship died, Malcom and Shan sired a son, Theron Shan. Malcom later received a promotion to the rank of colonel.\nFollowing the end of the war and the implementation of a controversial peace agreement, Malcom was asked to return to Alderaan to oversee the efforts of Republic combatants in the bloody civil war that had engulfed the planet. As the Strategic Advisor to Alderaan for the Republic Army, Malcom monitored troop deployments and tactical plans and maintained the military alliance between the Republic's armed forces and the noble House Organa. Under his supervision, the despotic King Bouris Ulgo was deposed and the Organas solidified their advantage in the war over the Imperial-backed House Thul. In 3640 BBY, Malcom was promoted to Supreme Commander of the Republic Military, during which time he aided then-Grand Master Satele Shan and Jedi Master Gnost-Dural in a battle against Darth Karrid and a renewed Sith offensive.\nJace Malcom was a Human male from the planet Barcaria who lived approximately three centuries after the Jedi Civil War. Malcom was a strong supporter of the Galactic Republic and joined the Republic Military as an Army officer around 3683 BBY. Within two years, Malcom had been accepted into the ranks of the army's elite troopers, and by 3681 BBY, Malcom had attained the rank of corporal and was serving the government while stationed in the Outer Rim Territories aboard a space station orbiting above the Republic's protectorate world of Korriban. There, Malcom served alongside fellow troopers and members of the Jedi Order to maintain a constant vigil over the planet that had once been home to the ancient Sith Empire. In that year, a reformed Empire of the Sith emerged from hiding in the Unknown Regions and launched a massive surprise assault against the Republic. The Imperials' early campaigns focused primarily in the galaxy's distant Tingel Arm region, and pulled the bulk of the Republic's navy away from their previous duties and into battle against the Sith.\nAs a result of the fighting, Korriban lost most of its naval defenses, and was left with only a small defense force consisting of the Republic troopers aboard the space station and the Jedi guardians who were watching over the Sith's holy world. While the battles elsewhere continued to rage, Malcom served under the Zabrak Jedi Master Kao Cen Darach and his Padawan learner, Satele Shan. Together, the three of them intercepted and arrested the smuggler captain Nico Okarr on the surface of the planet and ferried him back to be detained aboard the Korriban station. The smuggler captain had been caught while transporting Sith artifacts and was being taken into custody when the young Shan sensed a disturbance in the Force. At that moment, a fleet of over thirty Sith battlecruisers emerged from hyperspace above the Korriban and began to assault the space station with starfighters and boarding parties. Master Darach decided that their first priority in the battle must be to escape the system and inform the larger Republic that the Empire had returned to its ancient homeworld. Although he agreed, Malcom insisted that none of the Republic's NR2 gully jumper shuttles would be able to outrun the attacking Imperial interceptors. Okarr, who had been listening in on the conversation, offered his own XS stock light freighter the Redshifter as a means of escape, as it was allegedly the fastest ship in the Esstran sector.\nThe Jedi and troopers present accepted the offer and hastily fled towards the space station's hangar. While Shan and her Master ran ahead to clear the landing zone, the corporal and a fellow trooper covered their rear by remaining behind in one of the station's corridors to engage Imperial boarding parties. As the two rounded a corner towards the hangar, an Imperial soldier launched a missile at them. The resulting blast temporarily incapacitated Malcom and killed his comrade, which prompted Okarr to engage the Imperial troops himself. While he dispatched a number of approaching enemies, Malcom recovered and appropriated his fallen compatriot's laser chaingun to assist Okarr in destroying a pair of Imperial assault droids. Although they cleared the corridor of hostiles, the Imperials again pushed forward, forcing the Okarr and Malcom to fall back into the hangar and seal the entry behind them. As they regrouped with Shan and Darach, an Imperial Fury-class interceptor landed in the hangar and deposited the Sith Lord Vindican and his apprentice, Malgus, onto the landing bay floor.\nKao Cen Darach recognized the danger of the situation, and so ordered the corporal to join the smuggler in preparing his freighter for take-off while he and Shan dueled the intruders. With the assistance of the captain's astromech droid T7-O1, the two were able to get the ship running and lift off from the hangar floor. As they moved to flee the station, the captain maneuvered his ship into a hovering position so as to allow Shan and her Master an opportunity to board. Meanwhile, Malcom lowered the boarding ramp and fired a missile at the Pureblood Sith Lord, who was attempting to damage the vessel with blasts of Force lightning. The shot was ineffective, but allowed Okarr to move closer to the Jedi, the hangar airlock, and space beyond. Master Darach ultimately elected to stay on the station and hold the Sith back so that his Padawan might escape, thereby allowing Shan to run and attempt to jump into the departing craft. The corporal caught the Padawan mid-leap and pulled her into the freighter just before the ship slammed into the Imperial's interceptor and escaped into space. He and the young girl both operated the vessel's laser cannons in an effort to blast away attacking Sith interceptors while the smuggler made the jump to hyperspace. After narrowly avoiding collisions with a battlecruiser, the freighter jumped to hyperspace, escaping Korriban.\nThe war continued for a further twenty-eight years, by the height of which Jace Malcom found new responsibility as the captain of Infantry Squad 326—an elite special forces unit better known as Havoc Squad. Although the squad was attached to a larger infantry division within the army, it operated largely independently and specialized in irregular warfare. In 3667 BBY, Malcom and his squad-mates were stationed on the tranquil Core World of Alderaan—a planet seen by many as the embodiment of Republic ideals. There, the squad and many other Republic soldiers returning from tours on the front rested and recovered from exhaustion and injuries sustained on battlefields far away. However, Alderaan's reputation as the Republic's spiritual center made the world into an enticing military target for the Sith Empire, which launched a plan to destroy the world and capitalize on the damage it would cause to Republic morale.\nWhile Malcom and the rest of Havoc Squad remained on Alderaan's surface alongside other recovering Republic ground forces, the Republic Navy was called away from the planet in response to a diversionary feint set up by the recently-promoted Sith Lord Darth Malgus—the same Sith who had engaged the Republic defenders at Korriban. While the planet's naval defenses were occupied elsewhere in the galaxy, Alderaan was besieged by a massive Imperial invasion. Led by Malgus, the Sith obliterated the local defenses and seized the world. Despite these initial successes, the Sith forces were unaware that the Republic forces stationed on the world had fled into Alderaan's forests and mountains to launch a guerrilla campaign against the Imperial advance. Malcom and Havoc Squad were among those who had gone to ground, but upon learning that Malgus was leading his forces in a march on Alderaan's capital city and the home of the ancient Organa, Malcom mobilized his forces for an all-out assault. The troopers of Havoc Squad, many of whom were still wounded and recovering, positioned themselves on a ridge outside of Alderaan's capital in the Juran Mountains in hopes of preventing the attack on the city—a goal that was widely perceived as a suicide mission. Despite the obvious danger, when Darth Malgus led columns of war droids, Imperial soldiers, and Sith Warriors in the march through the mountains, Malcom ambushed him, firing a hand-held blaster cannon into the approaching forces. He and the rest of Havoc Squad proceeded to jump from the ridge down into the fray of battle, where they engaged an onslaught from the warriors and their troops. Malcom destroyed several more war droids before taking aim at Darth Malgus, who was able to deflect several of the cannon shots before being engulfed in the flames from one of the captain's projectiles. Seeing that Malgus survived the blast, Malcom rushed towards the Sith Lord to finish him off with a blade, but upon nearing the Sith Lord, he was assaulted with Force lightning before being thrown backwards across the battlefield.\nCaptain Malcom was rendered unconscious by the attack, and upon awakening, found himself at the mercy of two Sith as he watched his comrades get beaten by Malgus and his forces. The two Sith dragged Malcom to a third who prepared to execute the helpless soldier via lightsaber, but the three were instead thrown from the trooper by a repulsive blast from the Force, delivered by now-Jedi Knight Satele Shan, who had been tasked with defending Alderaan. The Jedi's timely arrival saved Malcom and allowed Havoc Squad to refocus their assault while she continued onwards to engage Malgus. Malcom was provided with a blaster rifle from one of his fellow soldiers, and together they returned to the battlefield. He later realized that Darth Malgus had gained the upper hand in his duel against Shan, and so rushed to aid her. Malcom tackled Malgus, and while they grappled, he activated a grenade. The blast threw the two combatants away from one another and grievously wounded both. Malcom was again rendered unconscious, awakening only after the battle had come to a close. Upon discovering that Malgus and his forces had been defeated, he fired a signal flare into the sky to indicate victory. The flare was matched by dozens of others fired by victorious Republic forces across the Alderaanian landscape, signaling the Empire's defeat on Alderaan. After the battle, Shan and Malcom confessed to each other their mutual feelings and conceived a son, Theron.\nThe battle catapulted Malcom and Havoc Squad to galactic fame and illustrated to military leaders the value of small, mobile units of elite soldiers. The victory on Alderaan also provided a temporary boon to Republic morale, which allowed the war effort to continue for over a decade. Malcom continued to serve the Republic through 3654 BBY, when the Empire's Dark Council stunned the galaxy by offering a peace initiative. The following year, Republic and Imperial delegates convened on Alderaan to discuss a treaty, but the negotiations ultimately proved to be little more than a ruse—the Sith launched an attack on the Republic capital of Coruscant and forced the negotiators to sign the Treaty of Coruscant. These final actions sealed the Empire's victory in the Great Galactic War and left the Republic broken, demoralized, and humbled. Despite this, Malcom remained a loyal member of the military and helped the Republic to rebuild its alliances and martial integrity during the following years.\nAlthough the Treaty of Coruscant dictated that the Republic Military stand down in its fight against the Empire and that all war zones were to be surrendered to their Imperial claimants, many within the Republic government refused to fully accept defeat. Proxy wars and small, unofficial resistance movements were fostered by military leaders, and during this period of conflicts known collectively as the interstellar Cold War, the Republic readied itself for new battles against the Sith. By this time, Malcom had been promoted out of Havoc Squad and was serving as an advisor to Republic military allies in his new role as a colonel.\nShortly after the signing of the Treaty of Coruscant, Alderaan was once again found embroiled in conflict. Because the world was so brutalized by the Empire during the invasion, its rulers were unwilling to accept the notion of peace with the Sith. Gaul Panteer, senator and crown prince of Alderaan, angrily withdrew his world from the Galactic Senate of the Republic and declared it an independent sovereignty. In the aftermath of this upheaval, both Panteer and his mother, Queen Silara Panteer, were killed under mysterious circumstances and the previously-banished House Thul returned from exile with Imperial support. These events led to the outbreak of a bloody civil war between the noble houses of Alderaan, all of whom were vying for the throne. Although the former Republic general and Alderaan native Bouris Ulgo of House Ulgo made a nearly successful bid for the crown, his reign of terror in an attempt to subjugate the planet lost him the backing of the Republic and many other houses. Instead, the Republic supported the efforts of House Organa, an ancient and noble lineage with strong ties to the galactic democracy. Colonel Jace Malcom was dispatched to Alderaan to fill the role of Strategic Advisor to Alderaan for the Republic Army and leader of the First Alderaan Support Division. There, he was stationed in Castle Organa and worked closely with his Nautolan aide, Major Brom, to ensure the safety and tactical superiority of House Organa's forces—a difficult task, given the Organas' inexperience in military affairs and traditional pacifism. Despite these shortfalls, many in house Organa, like Jeren Nolus Organa, were extremely loyal to Malcom out of respect for his sacrifices for the planet during the Great War.\nFollowing the defeat of Bouris Ulgo around 3643 BBY, Malcom continued to serve as a tactical advisor for the Organas as they rushed to capture land that was previously unavailable. Although the colonel attempted to temper their zeal, the Organas disregarded his advice and ultimately failed to secure their newly acquired territory. Malcom's investigations found that the King's Pass region was the most heinous instance of Organa oversight, and featured a large gap in defense. Knowing that House Organa would suffer heavy casualties from the splintering Ulgo forces, the upstarts in House Rist, and the violent and territorial species of Alderaanian insectoids known as the Killiks, the colonel arranged for a Republic combatant who had helped depose Ulgo to return to the planet. The two met with Major Brom in Malcom's offices in Castle Organa and began to discuss the importance of King's Pass and ways to seal the gap. While they spoke, they were interrupted by a communication from Lieutenant Ross, an officer stationed in the Pass. Ross and her forces were under attack from Killik raiders and House Ulgo soldiers, and were in need of immediate assistance. Colonel Malcom commanded the Republic combatant to go to King's Pass and relieve the fighters there while he worked with House Organa's leaders to refine their strategies. The combatant was ultimately successful, and their efforts overwhelmed House Organa's enemies and forced them to retreat from King's Pass. Colonel Malcom again met with the individual after the mission to debrief and thank them, noting that their efforts made peace on Alderaan a true possibility.\nFollowing the success of the Alderaan operation and renewed fighting on dozens of worlds, the Cold War came to a close and gave way to the Galactic War. The opening battles of this renewed conflict were devastating for both the Republic and Empire, and saw the deposition of the Republic's Supreme Chancellor Dorian Janarus and the supposed death of the Sith Emperor. During this upheaval, Malcom was again promoted, this time to serve as the successor to the human Rans in the position of Supreme Commander of the Republic Military. His tenure as the military's executive officer allowed him to work once more with Satele Shan, who now served as Grand Master of the Jedi Order. Together, the two of them fought against Darth Karrid's renewed Imperial offensive in 3640 BBY.\nIn 3638 BBY, Malcom appeared in a HoloNet broadcast following the conclusion of the Hutt Crisis on Makeb alongside Supreme Chancellor Leontyne Saresh and Satele Shan to announce the resolution of the Crisis, and the apparent death of the Sith Emperor. Following this, it was discovered that Regulator holdouts were still alive down on the surface with thousands of civilians who were believed to be dead, leading Malcom to devote Republic forces towards rescuing the people and securing the still-valuable world.\nMany years later, in 3629 BBY, following the War against Zakuul and the rise of the Eternal Alliance, Malcom sent Republic forces to the artificial world of Iokath in the hopes of securing a superweapon called Tyth for the Republic. While there his forces came into conflict with forces sent by Empress Acina, who was similarly after the superweapon. When the Alliance Commander heard of this, they traveled to Iokath to speak with Malcom and Acina about their trespassing of the world. Malcom sent Captain Elara Dorne as an emissary to broker an alliance with the Commander, and similarly, Acina sent Major Malavai Quinn for the same purpose. Ultimately, the Alliance Commander decided to work with Malcom and the Republic.\nThis prompted Acina to launch an attack on Republic held territory. With few other options, Malcom asked the Commander to assist in fighting off the Imperial soldiers, to which they agreed. The Alliance Commander, along with Theron Shan and Lana Beniko, met with Malcom, and discussed that in order to properly defeat Acina, they would need some of Iokath's weaponry. However, when the Commander and Shan left to find some, they discovered that the superweapon both sides were after had actually eradicated all life on Iokath when it was last used in the Iokath civil war, including their original creators. Returning to Malcom, they received a call from Acina, who had claimed to find a backdoor into the superweapon. Despite urging her to stop, Acina continued trying to access the superweapon to use it against the Republic. Because of this, Malcom presented the Commandeer with the Nova Strider, asking them to use it to go stop Acina.\nThe Alliance Commander then left, rushing to stop Acina from using the weapon. Unfortunately, they were too late to stop Acina from attempting to access it, which led to her sudden death, and the awakening of Tyth and the other Old Gods. The Alliance Commander used the Eternal Fleet to momentarily pacify Tyth, but this was only a temporary solution, and the Commander would later need to return to Iokath to destroy the Old Gods. Returning to the Republic base, Malcom told the Commander that the Imperial forces were still fighting, even after the death of Acina. He expressed that in order to keep them from claiming the superweapon, the Republic would need to continue hammering the Empire, day by day, hour by hour, until they won the war.\nJace Malcom was extremely loyal to the Republic, and was willing to give his life to defend his government and people. He believed that, despite the strength of the enemy, hope for peace could be restored to the Republic and the galaxy through simple acts of courage in the face of those overwhelming odds. These values were his motivation for work in the Republic Military—a career that spanned well over forty years and numerous battles and injuries.\nHis dedication and spirit lent to his ability as a soldier and facilitated his gradual ascent through the ranks of military hierarchy. As a corporal, Malcom served the Republic fiercely, and defended Korriban's orbital security station despite the simultaneous need to escape. He followed the orders issued by the Jedi, and was willing to work alongside a criminal who had been in Republic captivity only moments before the Sith assault began. At great personal risk, Malcom ensured Satele Shan's escape by descending the loading ramp of a freighter in-flight and pulling the Jedi aboard. As a captain of Havoc Squad, Malcom displayed extreme courage during the Battle of Alderaan, directly engaging the Sith forces despite his own forces being vastly outnumbered. Now in a command position, he led the charge against Malgus's troops, leaping from atop a high ridge directly into the heat of battle with the Sith. Throughout the battle he gunned for Malgus himself, and charged headlong into combat against the enemy commander several times. During his first attack, Malcom was assaulted by a barrage of Force lightning but managed to withstand its effects for a period of time while continuing to approach the Sith Lord. In the second instance, he activated a grenade while still holding it in his hand, nearly killing himself in order to successfully wound Darth Malgus. These actions engendered the people of Alderaan to Malcom personally and led to his promotion to colonel, at which point he shifted roles from frontline warrior to tactician and advisor. Even in his new capacity however, he worked to ensure the Republic's battlefield superiority in the hope that the wars might one day come to a close.\nOver the course of his career, Malcom established a strong relationship with the Jedi Satele Shan. The two fought together on Korriban and Alderaan, and again later during Darth Karrid's offensive. They saved each other's lives several times during these engagements and Shan remarked in an entry in the Jedi Archives on Tython that she trusted the soldier as much as she trusted any of her fellow Jedi. Likewise, Malcom enjoyed fighting alongside the Jedi, and those positive experiences made him eager to work with more Jedi in the future. This disposition put him at odds with many in the Republic government and military after the Sacking of Coruscant, as the Jedi were widely blamed for the Republic's loss of the war. Malcom similarly developed a strong connection to the planet Alderaan and its people. Despite the frustration he faced in advising the inexperienced House Organa, Malcom tackled the project with zeal in the hope that after a devastating invasion and a bloody civil war, the Alderaanian people could finally enjoy long-awaited peace.\nIn addition to moderate facial hair, he sported several facial scars prior to the Battle of Alderaan. After the conclusion of the conflict, the right side of his face was heavily disfigured as a result of the close quarters explosion from his grenade and the impact he suffered after being thrown by the force of the blast.\nJace Malcom was outfitted with the standard white-and-orange armor of a Republic trooper during the Great Galactic War. While fighting above Korriban, he made use of a blaster cannon, as well as a laser chaingun and a missile launcher. During the battle, the corporal lost his helmet, and on Alderaan he elected not to utilize one. He kept a combat knife in a sheath on his chest and in battle on the Core World he again wielded a portable blaster cannon. Malcom also made use of grenades and signal flares during the conflict on Alderaan. During the Cold War, Malcom eschewed the common garb of fabric uniforms that were favored by military leaders and instead continued to wear a suit of trooper armor, largely identical to that which he had worn throughout the Great War.\nJace Malcom first appeared, albeit unnamed, in Hope, the second cinematic trailer for the video game Star Wars: The Old Republic by BioWare and LucasArts. The trailer, released by BioWare on June 14 of 2010, depicts the trooper as the narrator, explaining events on Alderaan prior to the skirmish featured in the trailer. He later received a brief mention in Paul S. Kemp's short story \"The Old Republic: The Third Lesson\" and novel The Old Republic: Deceived. The character later appeared in Return, the third cinematic trailer for the game, released on June 6, 2011. Following these appearances and mentions, the character was commonly depicted in promotional work for The Old Republic to represent the Republic Trooper class and archetype in the game itself. The trooper was finally given his name in an interview with Charles Boyd, Bioware's Lead Writer for the Trooper class in The Old Republic.\nThe Old Republic was released on December 20 of 2011 and featured Malcom as a non-player character seen in cutscene conversations with Republic-aligned player characters on Alderaan. Malcom is the primary objective-giver in the extended mission called \"Alderaan: Bonus Series.\" In the game as well as the trailers, Malcom is voiced by veteran Star Wars voice actor Kevin Michael Richardson. Malcom appeared once again in 2012 within the pages of Drew Karpyshyn's novel The Old Republic: Annihilation.\nDuring the War on Iokath, the player must side with either the Empire or the Republic, possibly against their original faction, neither of which is a light or dark side choice. If the player sides with the Empire, and thus Acina instead of Malcom, Malcom will launch an all out attack on Imperial territory, and the Alliance Commander will be asked to aid the Empire. Following this, the story plays out almost exactly the same, but with Acina and Malcom's positions in the story swapped. This will eventually lead to Malcom's death when he tries to activate the superweapon. Malcom will die in the arms of his son, Theron Shan, asking him to tell Satele that he was sorry.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Jace_(disambiguation)",
  "/wiki/Malcom",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Last_Battle_of_Colonel_Jace_Malcom",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Barcaria",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Havoc_Squad",
  "/wiki/File:SparkOfCourage-TORHope.ogg",
  "/wiki/Republic_trooper",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Republic_Military/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Supreme_Commander_(Republic)",
  "/wiki/Galactic_War",
  "/wiki/Mid_Rim",
  "/wiki/Planet/Legends",
  "/wiki/3681_BBY",
  "/wiki/Corporal/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Korriban%27s_orbital_security_station",
  "/wiki/Orbit/Legends",
  "/wiki/Korriban",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Realspace/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Battle_of_Korriban",
  "/wiki/Capital/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Smuggler/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Nico_Okarr",
  "/wiki/Republic_Army",
  "/wiki/Commander/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Republic_Navy",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Battle_of_Alderaan",
  "/wiki/Darth_Malgus",
  "/wiki/Darth/Legends",
  "/wiki/Army/Legends",
  "/wiki/Alderaanian/Legends",
  "/wiki/City/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Elin_Garza",
  "/wiki/Theron_Shan",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Alderaan_Civil_War",
  "/wiki/Strategic_Advisor_to_Alderaan_for_the_Republic_Army",
  "/wiki/Troop/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/King/Legends",
  "/wiki/Bouris_Ulgo",
  "/wiki/House_of_Thul",
  "/wiki/3640_BBY",
  "/wiki/Grand_Master/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Gnost-Dural",
  "/wiki/Darth_Karrid",
  "/wiki/Return_(cinematic_trailer)",
  "/wiki/Jedi_Civil_War",
  "/wiki/Officer/Legends",
  "/wiki/3683_BBY",
  "/wiki/Standard_year/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Tingel_Arm_campaign",
  "/wiki/Tingel_Arm/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Kao_Cen_Darach",
  "/wiki/Sith_artifact/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Harrower-class_dreadnought",
  "/wiki/Hyperspace/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Horuset_system",
  "/wiki/Homeworld/Legends",
  "/wiki/NR2_gully_jumper",
  "/wiki/Shuttle/Legends",
  "/wiki/Mark_VI_Supremacy-class_starfighter",
  "/wiki/XS_stock_light_freighter/Legends",
  "/wiki/Redshifter",
  "/wiki/Esstran_sector/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Imperial_soldier",
  "/wiki/Missile/Legends",
  "/wiki/Death/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Chaingun",
  "/wiki/Sith_war_droid_Mark_I",
  "/wiki/Fury-class_Imperial_interceptor",
  "/wiki/Darth_Vindican",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/T7-O1",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Airlock/Legends",
  "/wiki/Force_Jump",
  "/wiki/Laser_cannon/Legends",
  "/wiki/Infantry/Legends",
  "/wiki/3667_BBY",
  "/wiki/Castle_Organa",
  "/wiki/Juran_Mountains/Legends",
  "/wiki/Suicide/Legends",
  "/wiki/Sith_Warrior",
  "/wiki/Blaster_cannon/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Flare/Legends",
  "/wiki/3654_BBY",
  "/wiki/Dark_Council",
  "/wiki/3653_BBY",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Coruscant/Legends",
  "/wiki/Advisor/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Gaul_Panteer",
  "/wiki/Senator/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Silara_Panteer",
  "/wiki/General/Legends",
  "/wiki/House_Ulgo",
  "/wiki/First_Alderaan_Support_Division",
  "/wiki/Nautolan/Legends",
  "/wiki/Major/Legends",
  "/wiki/Brom",
  "/wiki/Jeren_Nolus_Organa",
  "/wiki/3643_BBY",
  "/wiki/King%27s_Pass",
  "/wiki/House_Rist",
  "/wiki/Species/Legends",
  "/wiki/Insectoid/Legends",
  "/wiki/Killik/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Ross_(lieutenant)",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Dorian_Janarus",
  "/wiki/Tenebrae",
  "/wiki/Rans",
  "/wiki/3638_BBY",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Makeb",
  "/wiki/Leontyne_Saresh",
  "/wiki/Regulator",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/3629_BBY",
  "/wiki/War_against_Zakuul",
  "/wiki/Eternal_Alliance",
  "/wiki/Iokath",
  "/wiki/Superweapon/Legends",
  "/wiki/Tyth",
  "/wiki/Darth_Acina",
  "/wiki/Alliance_Commander",
  "/wiki/Elara_Dorne",
  "/wiki/Malavai_Quinn",
  "/wiki/Lana_Beniko",
  "/wiki/Iokath_civil_war",
  "/wiki/Iokath_species",
  "/wiki/Nova_Strider",
  "/wiki/Six_Gods",
  "/wiki/Eternal_Fleet",
  "/wiki/Machine_Gods_crisis",
  "/wiki/Jedi_Archives_(Tython)",
  "/wiki/Tython/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Hope_(cinematic_trailer)",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/June_14",
  "/wiki/2010",
  "/wiki/Paul_S._Kemp",
  "/wiki/The_Old_Republic:_The_Third_Lesson",
  "/wiki/The_Old_Republic:_Deceived",
  "/wiki/June_6",
  "/wiki/2011",
  "/wiki/Charles_Boyd",
  "/wiki/December_20",
  "/wiki/Star_Wars",
  "/wiki/Kevin_Michael_Richardson",
  "/wiki/2012",
  "/wiki/Drew_Karpyshyn",
  "/wiki/War_on_Iokath",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_124",
  "/wiki/The_Old_Republic:_Deceived_(audiobook)",
  "/wiki/Star_Wars_Insider_137",
  "/wiki/The_Old_Republic:_Annihilation_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Regrets",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Category:Audio_files_of_Jace_Malcom",
  "/wiki/Category:Images_of_Jace_Malcom",
  "/wiki/The_Art_and_Making_of_Star_Wars:_The_Old_Republic",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Revan/Legends",
  "/wiki/3962_BBY",
  "/wiki/3960_BBY",
  "/wiki/Stantorrs",
  "/wiki/Hoth_(Jedi_Lord)",
  "/wiki/1010_BBY",
  "/wiki/1000_BBY",
  "/wiki/Valenthyne_Farfalla",
  "/wiki/990_BBY",
  "/wiki/Palpatine/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Jek_Kardan",
  "/wiki/Daniel_Erickson",
  "/wiki/Timeline_6:_Onslaught_of_the_Sith_Empire",
  "/wiki/The_Essential_Atlas",
  "/wiki/Battle_of_Bothawui_(Second;_Great_Galactic_War)",
  "/wiki/Timeline_5:_The_Battle_of_Bothawui",
  "/wiki/3671_BBY",
  "/wiki/The_Holonet",
  "/wiki/Hunter_(individual)",
  "/wiki/Hero_of_Tython",
  "/wiki/Timeline_1:_Treaty_of_Coruscant",
  "/wiki/September_20",
  "/wiki/September_24",
  "/wiki/The_Essential_Guide_to_Warfare"
 ]
}