{
 "name": "Jace_Rucklin",
 "display_name": "Jace Rucklin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "35 ABY",
      "Thunderer",
      "Barabesh system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.80 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jace Rucklin's racing team",
      "First Order",
      "Galek's TIE fighter squadron",
      "Galek's TIE fighter squadron"
     ]
    }
   ]
  }
 ],
 "content": "Jace Rucklin, later designated DT-798, was a human male racer who lived during the era of the New Republic. Rucklin, who headed his own racing team, had coveted Jarek Yeager's hyperfuel for a long time, and saw Kazuda Xiono's arrival on the Colossus as an opportunity to acquire it. However, Rucklin's manipulation of Xiono to steal the fuel resulted in the loss of his racer, and thus all of the savings he had directed into it. Rucklin chose to ignore his own fault in the loss, and instead blamed Xiono, vowing to get back at him for it. After the loss of his racer, in order to earn the credits for a new one, Rucklin was forced to take a job working in Doza Tower, cleaning and serving food and drink to its residents.\nJace Rucklin, by 34 ABY, was a racer who lived on the Colossus platform on Castilon, where he had his own racing team, consisting of himself, fellow human Lin Gaava and Sullustan Gorrak Wiles. Rucklin had aspirations of being one of the top racers, but instead of trying to work hard to get to that position, preferred to cut corners, steal and cheat wherever possible. One of the ways he did this was by having all \"extraneous\" systems, including safety systems, removed from his racer to make it fly faster. He and his team knew that Jarek Yeager, a former racer on the station who owned his own repair shop, likely owned a supply of powerful hyperfuel, and wished to get their hands on it by any means necessary.\nRucklin saw the arrival of Kazuda Xiono, the newest member of Yeager's Team Fireball, as the perfect opportunity to acquire the hyperfuel. Xiono had acquired a deserved reputation for being naïve soon after his arrival on the platform, and Rucklin knew that Xiono was unlikely to have heard anything about his reputation for being a lazy prankster. Thus, he and his team waited for an opportunity to approach Xiono. They found one in Xiono's early weeks on the platform, when he had come down to Aunt Z's Tavern due to experiencing frustration with the heavy workload Yeager had put him under. Unbeknownst to Rucklin and his friends, Xiono's frustration stemmed in part from the fact that he was actually a spy for the Resistance, and his job as a mechanic was merely a cover.\nAfter a conversation in which Rucklin revealed Yeager's history as a racer to Xiono, Rucklin challenged Xiono to a friendly speeder bike race. Unbeknownst to Xiono, Rucklin had had Wiles sabotage the bike he was riding. This allowed Rucklin the opportunity to ingratiate himself with Xiono during the race by saving him from the \"accident.\" Thus, when Xiono came by Rucklin's hangar later, he was able to use the incident as leverage to pressure Xiono into sneaking him into Yeager's private hangar to see Yeager's racer, intending to use the opportunity to try and steal Yeager's hyperfuel. When the two entered the shop, they had to avoid Yeager, his astromech droid R1-J5 , and Xiono's coworker Tam Ryvora. They weren't caught, and Xiono told Rucklin they wouldn't be able to see the ship because the hangar door was locked. Rucklin stole a canister of hyperfuel behind Xiono's back, and quickly made his exit claiming that they would have to try another day.\nRucklin was signed up in a race for that day, and expected that with the hyperfuel he was bound to win it. When Xiono came by his hangar later, Rucklin and his team quickly blocked Xiono's view of the stolen hyperfuel and declined his offer of lunch. Rucklin, however, was unaware that more than a few drops of hyperfuel would turn a ship into a flying bomb, and thus added far too much while putting it in his racer. When Xiono learned of the theft and the danger, he realized that Rucklin was in trouble and rushed off to save his life. Rucklin's friends noticed something odd with the racer's engines when he started them, but they were interrupted by Xiono and BB-8 entering the hangar. Xiono jumped onto Rucklin's racer to get him to stop, and wound up ejecting the two of them. As the ejection seat's parachute had been removed, the two nearly fell into the ocean before being rescued by BB-8 and Yeager.\nRucklin, after being rescued, ignored his own fault in the loss of his ship and, angry about the loss of all the savings he had spent on it, chose to instead blame Xiono, claiming that no one would ever know he had stolen the hyperfuel. He did not know that Yeager was in earshot when he said that. Rucklin eventually vowed to get Xiono back for the incident before storming off with his teammates.\nDue to the loss of his racer, Rucklin was forced to get a new job, working as a servant in Doza Tower and the Aces' Lounge. There, he served drinks and cleaned for Captain Imanuel Doza and the members of the Ace Squadron. Rucklin encountered Xiono again when he was invited inside the tower by Doza's daughter Torra Doza, who was lonely and looking for a friend to spend some time with. When Rucklin encountered Xiono, he reaffirmed his intent to get revenge on him for the loss of the racer, before Xiono and Torra left the lounge area.\nRucklin later saw his chance when he witnessed Xiono sneaking into Doza's office. Xiono intended to download the contents of a datapad the First Order's Commander Pyre had given Doza with the details of the Order's proposal regarding Colossus security. Intent on getting revenge on Xiono, Rucklin interrupted Doza as he was seeing Pyre off the platform, which made Doza angry with him. After Pyre's departure, Doza finally heard Rucklin out about the intruder. Due to his own suspicions of Xiono, he headed back to his office with Rucklin.\nXiono was alerted to the threat of discovery by BB-8, and by the time Rucklin and Doza arrived at the office, had hidden in a closet near Doza's desk. Rucklin heard Xiono gasp in shock upon realizing Doza had an Imperial uniform stashed in the closet and attempted to open the door, but Doza prevented him, angrily stating that the closet's contents were private. Rucklin was sent off to dispose of the office's garbage.\nTorra's arrival in the office prevented Doza from looking in the closet himself, allowing Xiono to escape. Rucklin later accidentally saved Xiono's life when he and Torra were inside the trash incinerator, by throwing Doza's garbage in at just the right time for it to intercept one of the incinerator's blasts.\nDuring the \"Bibo incident,\" Jace along with the human Vic and the Theelin Jooks implored Neeku Vozo to give up his new pet Bibo in order to placate an angry rokkna sea monster. The sea monster turned out to be Bibo's mother, who was searching for her child.\nDuring the First Order's occupation of the Colossus, Tam and the First Order Security Bureau Agent Tierny crossed paths with Rucklin and Lin, who were being led away by stormtroopers.\nFollowing the Colossus' escape into hyperspace, Rucklin and fellow Colossus resident Tamara became First Order TIE Fighter Pilot cadets aboard the Resurgent-class Star Destroyer Thunderer. After discovering Ryvora listening to a comlink message from Xiono, Rucklin convinced a conflicted Tam to report the comlink to the First Order, warning that she would get into trouble if she was caught with it. He also claimed that Xiono and Yeager had taken advantage of Tam and endangered her life.\nA stormtrooper brought the pair to Commander Pyre and Agent Tierny on the Star Destroyer's bridge. Tam told the two senior officers that the Resistance spy Xiono had contacted her. Tierny convinced Pyre that the comlink could be used to track down the Colossus before dismissing the two cadets.\nRucklin and Tam were later in their barracks when Commander Pyre and Agent Tierny visited them, bring news that they had been able to track the Colossus to the Ileenium system. Tierny tried to exploit Tam's grievances with Xiono and claimed that she had made the right choice, inviting her to witness the destruction of her friends on the bridge. Before leaving, Rucklin elbowed her. Despite tracking down the Colossus, the refueling platform was able to escape into hyperspace after Team Fireball and Kragan Gorr's Warbird gang managed to salvage coaxium hyperdrive fuel.\nRucklin, Gaava, and Ryvora took part in training with other cadets to become TIE pilots under Lieutenant Galek. During a live fire exercise, Rucklin damaged his TIE and was going to crash into the star destroyer's hangar. However, he was saved by Ryvora when she slowed his TIE. Rucklin thanked her for saving his life.\nLater, Rucklin and Ryvora saw several stormtroopers escorting a prisoner that was flying an X-wing to meet up with the Colossus. When the prisoner, Commander Venisa Doza who was Torra's mother and Captain Doza's wife, escaped with Ryvora as a hostage, Rucklin snuck up on Doza. Rucklin held Doza at blaster point and ordered her to drop her blaster. Doza dared Rucklin to shoot her or Ryvora. Rucklin, despite his hesitation, vowed that Doza and the Resistance would lose. Doza tried to reason with him, and to open his eyes to see that killing innocent people was not winning. Rucklin, seeing Doza as an enemy of the First Order and the New Republic as corrupt. Doza let Ryvora go, but her astromech, Torch, sealed the blast door between her and Rucklin.\nRucklin was given the designation DT-798. He and Ryvora went with Commander Pyre aboard the Titan refueling station. On board the Titan, Rucklin found Xiono and Neeku in disguise and called in security. Despite Xiono's pleas to get a needed component back to the Colossus, Rucklin told him that he should have chosen the First Order. Rucklin was then ordered to lock down the area and seal the hyperdrive chamber. However, Xiono and Neeku escaped with the deflector. Rucklin asked Ryvora if she was glad to join the First Order; she said yes but still sympathized with her former friends.\nRucklin was pleased to hear that the First Order had taken over most of the major systems and was close to securing the galaxy. Rucklin and Ryvora boarded several TIEs when their star destroyer found the Colossus at Aeos Prime. Rucklin was ordered by Galek to disable the Colossus before it escapes. Rucklin saw the Aces taking on their star destroyer head on. Unfortunately, the Colossus escaped.\nAt Dantooine, Rucklin was ordered by Galek to destroy several resistance shuttles attempting to break through the First Order's blockade. After Galek went down, Rucklin told Ryvora she was in charge. Despite Ryvora's orders to let the shuttle go, Rucklin shot the shuttle down in triumph. Despite his success, the other shuttles were able to escape. Rucklin was jealous that Ryvora got promoted to squadron leader.\nAfter being accused of treason by Tam when she defected from the First Order, Rucklin was arrested, despite his protests. He revealed that the Colossus was in the Barabesh system, but it was too late to save his skin, as Pyre and Tierny did not trust him anymore.\nDuring the final battle against the Colossus resistance, Rucklin tried to stop Kaz, Tam and their friends when they were on board the Thunderer, so as to prove to his superiors that he was loyal to the First Order. However, he was knocked out by Tam and the Thunderer later exploded. He died in the explosion.\nRucklin was a human male with blond hair, green eyes, and light skin. He had no compunctions about stealing and cheating in order to win races, and was willing to put others in physical danger for the purpose of manipulating them. He also had all systems he considered extraneous, including safety systems such as the parachute of his ejection seat, removed from his racer in an attempt to make it as fast as possible.\nThough Xiono saved his life, Rucklin blamed him for destroying his racer and denied stealing Yeager's coaxium fuel. Rucklin remained bitter towards Xiono and attempted to get him into trouble with Captain Doza. However, his plot failed when Captain Doza refused to allow anyone to search his wardrobe. Rucklin later implored Neeku to surrender his \"pet\" Bibo to a rokkna sea monster in order to save the Colossus from destruction.\nAfter joining the First Order, Rucklin's bitterness towards Xiono led him to convince a conflicted Tam to report his comlink message to the First Order. Rucklin later playfully elbowed Tam after Agent Tierny praised her for her help and invited her to watch the destruction of her friends on the bridge of the Thunderer. Over his time serving the First Order, Rucklin became more ruthless and cold to the point he had no qualms on witnessing the destruction of an Aeosian village which helped the Resistance, considering the Aeosians \"subversives\" who got what they deserved, refuting Tam's claims that some of them were innocent by stating that they weren't innocent at all if they harbored \"criminals.\"\nHe became increasingly arrogant, evidenced when he assumed he'd be promoted to commander after revealing Kaz and Neeku's identities, only for them to jump away before being captured. He as well underestimated the resilience of the Colossus, taunting Yeager, Kaz, and Tam that they'd lost and that he'd revealed its location, after which he was knocked out by Tam. Later, the shields on the Thunderer were disabled and the Colossus residence fought back.\nRucklin was a competent but dishonest racer pilot who also knew how to fly swoop bikes. Due to his piloting skills, Rucklin was recruited as a TIE fighter pilot by the First Order.\nJace Rucklin is a character created and developed for Star Wars Resistance. He is voiced by Elijah Wood.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jace_(disambiguation)",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Live_Fire",
  "/wiki/Rendezvous_Point_(episode)",
  "/wiki/Station_to_Station",
  "/wiki/No_Place_Safe",
  "/wiki/Rebuilding_the_Resistance",
  "/wiki/The_Escape",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Ace_Squadron_(Star_Wars_Encyclopedia)",
  "/wiki/Special:Upload",
  "/wiki/35_ABY",
  "/wiki/Thunderer",
  "/wiki/Barabesh_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jace_Rucklin%27s_racing_team",
  "/wiki/First_Order",
  "/wiki/Galek%27s_TIE_fighter_squadron",
  "/wiki/Racer",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Jarek_Yeager",
  "/wiki/Coaxium",
  "/wiki/Kazuda_Xiono",
  "/wiki/Colossus",
  "/wiki/Jace_Rucklin%27s_racer",
  "/wiki/Doza_Tower",
  "/wiki/34_ABY",
  "/wiki/Castilon",
  "/wiki/Lin_Gaava",
  "/wiki/Sullustan",
  "/wiki/Gorrak_Wiles",
  "/wiki/Jarek_Yeager%27s_Repair_Station",
  "/wiki/Team_Fireball",
  "/wiki/Aunt_Z%27s_Tavern",
  "/wiki/Spy",
  "/wiki/Resistance",
  "/wiki/Technician",
  "/wiki/Speeder_bike",
  "/wiki/Astromech_droid",
  "/wiki/R1-J5",
  "/wiki/Tamara_Ryvora",
  "/wiki/Jace_Rucklin%27s_hangar",
  "/wiki/BB-8",
  "/wiki/Aces%27_Lounge",
  "/wiki/Captain",
  "/wiki/Imanuel_Doza",
  "/wiki/Ace_Squadron",
  "/wiki/Torra_Doza",
  "/wiki/Doza%27s_office",
  "/wiki/Datapad",
  "/wiki/Commander",
  "/wiki/Pyre",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Bibo_incident",
  "/wiki/Vic_(Colossus)",
  "/wiki/Theelin",
  "/wiki/Jooks",
  "/wiki/Neeku_Vozo",
  "/wiki/Bibo",
  "/wiki/Rokkna",
  "/wiki/Bibo%27s_mother",
  "/wiki/Occupation_of_the_Colossus",
  "/wiki/First_Order_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Tierny",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Battle_of_Castilon",
  "/wiki/Hyperspace",
  "/wiki/First_Order_TIE_Fighter_Pilot",
  "/wiki/Cadet",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Comlink",
  "/wiki/Ileenium_system",
  "/wiki/Kragan_Gorr",
  "/wiki/Warbird_gang",
  "/wiki/Skirmish_over_D%27Qar",
  "/wiki/Galek",
  "/wiki/Venisa_Doza%27s_X-wing",
  "/wiki/Venisa_Doza",
  "/wiki/Torch",
  "/wiki/Titan",
  "/wiki/Aeos_Prime",
  "/wiki/Dantooine",
  "/wiki/Blockade_of_Dantooine",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Elijah_Wood",
  "/wiki/Fuel_for_the_Fire",
  "/wiki/Synara%27s_Score",
  "/wiki/Secrets_and_Holograms",
  "/wiki/Bibo_(episode)",
  "/wiki/No_Escape:_Part_1",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/Resistance_To_The_End",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_First_Order",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Fury_of_the_First_Order_Squadron_Pack",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/September_25",
  "/wiki/2018"
 ]
}