{
 "name": "Jackar Bowmani",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Abyssin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Jackar Bowmani was a male Abyssin who worked in the Jedi Temple as a munitions expert. He was married to Letta Turmond during the Clone Wars. On the request of Jedi Barriss Offee, Turmond fed her husband nano-droids, turning him into a living bomb that exploded inside the Temple's hangar.\nAn Abyssin male, Jackar Bowmani was a munitions expert that worked as a foreman of all of the gunships in the Jedi Temple hangar on Coruscant, and was married to Letta Turmond, a human female. According to Turmond, it was Bowmani's dream to work for the Jedi and he had worked tirelessly to pass the numerous entry tests, eventually doing so with flying colors.\nTurmond became disgruntled by the Jedi Order's role in the Clone Wars, and, under the guidance of the disillusioned Jedi Padawan Barriss Offee, secretly fed modified explosive NM-K reconstitutor nano-droids to Bowmani in order to use him as a bomb against the Jedi. Offee and Turmond's plot was executed successfully, with Bowmani detonating in the Jedi Temple hangar, killing six Jedi, numerous Republic clone troopers, and other hangar workers in the process and destroying all but one of his arms. Twenty-six people were killed, including Bowmani, while dozens more were injured and numerous starships were destroyed in addition to the extensive damage done to the hangar itself.\nJedi Knight Anakin Skywalker and Padawan Ahsoka Tano, called in to investigate the bombing, were tipped off to Bowmani's potential involvement by a Pantoran worker who had been injured in the bombing and suspected his colleague. Once the SP-4 ISC analysis droid Russo-ISC located Bowmani's hand, all that was left of his body, and found it riddled with nano-droids, Skywalker and Tano initially suspected the late technician of having been a suicide bomber. However, a search of his apartment led to the discovery that Turmond had fed him the droids, for which she was placed under arrest. The full extent of the plot in which Bowmani was an unwitting part was eventually realized, including the involvement of Barriss Offee. However, Tano, whom Offee had nearly successfully framed for the bombing and her murder of Turmond, left the Jedi Order as a result after growing disillusioned since the Jedi High Council had not stood by her during the ordeal.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jackar_Bowmani",
  "/wiki/Jackar_Bowmani/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/19_BBY",
  "/wiki/Coruscant",
  "/wiki/Abyssin",
  "/wiki/Gender",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Order",
  "/wiki/Imperial_Palace",
  "/wiki/Marriage",
  "/wiki/Letta_Turmond",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Barriss_Offee",
  "/wiki/NM-K_reconstitutor",
  "/wiki/Bomb",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Hangar",
  "/wiki/Human",
  "/wiki/Padawan",
  "/wiki/Droid",
  "/wiki/Death",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_trooper",
  "/wiki/Limb",
  "/wiki/Starship",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Ahsoka_Tano",
  "/wiki/Unidentified_Pantoran_witness",
  "/wiki/SP-4_ISC",
  "/wiki/Russo-ISC",
  "/wiki/Suicide",
  "/wiki/Jedi_High_Council",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Sabotage_(episode)",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Wrong_Jedi"
 ]
}