{
 "name": "Jacynith",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Jacynith was a female Twi'lek who lived at The Enclave, on Ryloth, in the years prior to and during the Clone Wars.\nJacynith grew up on the planet Ryloth and was the sister of the Jedi Master Vhiin Thorla. The two siblings were separated at a young age when Vhiin was selected for training as a Jedi youngling. The two were, however, reunited when Vhiin later went into self-imposed exile on their homeworld, eventually establishing The Enclave. Vhiin asked Jacynith to accompany him at his new Mission, and she readily agreed.\nJacynith was one of the few Enclave residents who was not a former slave. When she was not helping her brother, Jacynith worked at her job as a waitress at the Fungus Pit, a popular cantina in the local town of Bashka.\nWhen two Jedi from the Almas Academy arrived in Bashka looking for Master Thorla, Jacynith agreed to help them by taking them to him at The Enclave. Unknown to either of the Jedi or Jacynith, however, a group of slavers tracked the trio and launched an assault on the unsuspecting Enclave. Master Thorla, along with the Jedi agents and The Enclave's meager security force, managed to repel the slaver attack and protect the integrity of The Enclave's secret location.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/The_Enclave",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Vhiin_Thorla",
  "/wiki/Jedi/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Fungus_Pit",
  "/wiki/Cantina/Legends",
  "/wiki/Bashka",
  "/wiki/Almas_Academy",
  "/wiki/Twi%27light_Storm",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}