{
 "name": "Jadonna_Veloz",
 "display_name": "Jadonna Veloz",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "Jadonna Veloz was a dark-skinned Human female who captained the starship Wayward Girl during the reign of the Galactic Empire. Around 2 BBY, Veloz was hired to haul a shipment of nerf tenderloin steaks from the planet Alderaan to the Yarith Bespin hotel on the world of Bespin but was left unable to fly her ship after she broke her arm in an accident with a malfunctioning anti-grav loader. Determined to deliver her cargo on schedule, Veloz engaged the smuggler Han Solo to fly the Wayward Girl to Bespin for her. Solo hurried over to Alderaan on a fast shuttle and successfully piloted Veloz and her ship to the Yarith Bespin, which allowed her to make her delivery on time.\nJadonna Veloz was a Human female who worked as a starship pilot during the reign of the Galactic Empire. Veloz operated the vessel Wayward Girl, and her work took her through the world of Bespin many times during her career. Circa 2 BBY, Veloz was hired to haul a shipment of prime nerf tenderloin steaks from the planet Alderaan to the Yarith Bespin, a luxury hotel situated in Cloud City on Bespin. However, she was struck by a malfunctioning repulsorsled anti-grav loader before leaving Alderaan with her cargo, which tore the cartilage and ligaments in her right arm and left her in great pain.\nVeloz had a tight deadline to meet for delivery of the nerf tenderloins and so chose not to seek immediate medical treatment for her arm in order not to risk her cargo arriving late. Instead, as a temporary measure, she donned a sling to hold her arm in place. Her injury left her unable to pilot the Wayward Girl unaided, so she advertised on the spacer nets for a spacer to help her pilot the ship to Cloud City. The aspiring smuggler Han Solo responded to the ad, and Veloz paid for him to take a fast shuttle from the planet Corellia to join her on Alderaan.\nSolo and Veloz departed on the Wayward Girl, with Solo flying the ship supported by Veloz as co-pilot. After a journey lasting two days, they arrived at Bespin and set a course through the atmosphere of the planet to Cloud City. By this stage, Veloz was weary of the pain from her injury and was keen to get to their destination as soon as possible to seek medical attention and have bacta applied to her arm. On their approach to Cloud City, the ship passed a beldon, a rare species of giant flying creature, much to Veloz's excitement. The Wayward Girl then docked at the Yarith Bespin hotel, and Veloz delivered her cargo on time; she paid Solo for his services, and they said their farewells. Solo used the credits that he received from the trip to pay for a room and meals while he competed in the Cloud City Sabacc Tournament, a major sabacc competition hosted at the Yarith Bespin.\nJadonna Veloz was dark-skinned, with a short, stocky build and long, straight, black hair. When Veloz was hired to haul tenderloin steaks to Cloud City and injured her right arm, she was willing to prioritize the delivery of her cargo on schedule over her personal well-being, even though that meant enduring the pain in her arm for the two days that it took to travel to Bespin. Veloz was thrilled when she spotted a beldon while approaching Cloud City, as she had never seen one before in all her years passing through Bespin.\nJadonna Veloz was created by author A. C. Crispin and appeared in the 1998 novel Rebel Dawn, the final installment of The Han Solo Trilogy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Rebel_Dawn",
  "/wiki/Captain/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Wayward_Girl",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Nerf_steak/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Yarith_Bespin/Legends",
  "/wiki/Hotel/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Anti-grav_loader",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Time/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Hoversled/Legends",
  "/wiki/Nerf/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/City/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Beldon/Legends",
  "/wiki/Species/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Cloud_City_Sabacc_Tournament",
  "/wiki/Sabacc/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/A._C._Crispin",
  "/wiki/1998",
  "/wiki/The_Han_Solo_Trilogy",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/0_BBY/Legends",
  "/wiki/Galactic_Standard_Calendar"
 ]
}