{
 "name": "Jae_Neb",
 "display_name": "Jae Neb",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Data Seekers"
     ]
    }
   ]
  }
 ],
 "content": "Jae Neb was a male Sullustan and a member of the Data Seekers, a secretive organization that sought to unravel the mysteries of the Anoat sector's shrouded history during the reign of the Galactic Empire. Caught behind the Iron Blockade enacted by Imperial Governor Ubrik Adelhard in the wake of the second Death Star's destruction, Neb took to operating on worlds such as Bespin and Burnin Konn. Jae Neb despised the oppressive ways of the Empire, preferring the simplicity of its predecessor state, the Galactic Republic.\nAmidst a period of rebellious unrest in the sector, the Sullustan Data Seeker came into contact with an up-and-coming young smuggler with whom Neb formed a working relationship. On a number of occasions, Neb passed along information and tips leading to opportunities for work to the smuggler, growing to care for their well-being over time. Neb worried about his associate's often serious disposition, encouraging the smuggler to take time to enjoy themselves, and offered his counsel should they ever need someone to talk to.\nJae Neb first appeared in Star Wars canon in the multiplayer mobile game Star Wars: Uprising, created by the Kabam company and released on September 10, 2015 for iOS and Android platforms. Within the scope of the game, Neb acts as one of several quest givers for the player character.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sullustan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Data_Seekers",
  "/wiki/Anoat_sector",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Iron_Blockade",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_of_Endor",
  "/wiki/Planet",
  "/wiki/Bespin",
  "/wiki/Burnin_Konn",
  "/wiki/Galactic_Republic",
  "/wiki/Uprising",
  "/wiki/Sector",
  "/wiki/The_Smuggler",
  "/wiki/Smuggler",
  "/wiki/Time",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Kabam",
  "/wiki/September_10",
  "/wiki/2015",
  "/wiki/IPhone",
  "/wiki/Android_(operating_system)"
 ]
}