{
 "name": "Jael_Ganton_Farvash",
 "display_name": "Jael Ganton Farvash",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Guiteica"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bitthævrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "m'Yalfor'ac Order"
     ]
    }
   ]
  }
 ],
 "content": "Major Jael Ganton Farvash was a Bitthævrian, a member of m'Yalfor'ac Order and a would-be usurper.\nFarvash attempted against the life of then-leader of the Order, Colonel Quaal Tavier Catharius. However, he only managed to injure Catharius before being captured and sentenced for execution.\nFarvash demanded his right of challenge by personal combate instead of summary execution: He was to fight Catharius with ceremonial dematoils, under the supervision of a neutral Succession Judge, and with each of the fighter choosing a Defender to avoid any uninvited interruptions.\nCatharius was still injured, but was honor-bonded to accept. Favash's Defender identity is unclear, but Catharius chose his bodyguard, Aul Tarrus Vishav. However, the Succession Judge was not neutral, but aligned with Favash. Favash had also hidden three Guardians with dematoils to help him during the fight - which went against the rules, but he knew the Judge would approve it.\nDuring the fight, both Catharius and Favash were injured before the Guardians appeared. Vishav tried to protest, but the Judge ignored him. Thus, barehanded Vishav fought and killed the three Guardians, being injured while doing so. Afterwards, Catharius killed Farvash and Vishav killed the Judge.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Guiteica/Legends",
  "/wiki/Bitth%C3%A6vrian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/M%27Yalfor%27ac_Order",
  "/wiki/Colonel/Legends",
  "/wiki/Quaal_Tavier_Catharius",
  "/wiki/Dematoil",
  "/wiki/Succession_Judge",
  "/wiki/Defender_(role)",
  "/wiki/Aul_Tarrus_Vishav",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}