{
 "name": "Jafer_Torles",
 "display_name": "Jafer Torles",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "94 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jafer Torles was a male Human Jedi Knight serving the Jedi Order and the Galactic Republic during the last decades of the Republic Classic era. A Jedi Watchman, Torles resided on Cartao as he watched over the Prackla sector for thirty standard years.\nDiscovered to be Force-sensitive sometime after his birth in 94 BBY, Jafer Torles was taken to the Coruscant Jedi Temple's academy for training in the ways of the Force. After years of study at the academy and later as a Padawan, Torles constructed for himself a blue-bladed lightsaber and passed his Trials of Knighthood. A fully ranking Jedi Knight, Torles pursued the path of the Jedi Sentinel, and after years of independent study was appointed as Watchman of the Prackla sector in 51 BBY.\nResiding on Cartao, Jedi Torles watched over the sector and interacting with its people in order to assure that he provided for them in the best way he could to suit their needs. A mediator and local arbiter, Torles was revered by the people of the region as the ultimate Jedi, a reputation Torles disliked and tried to discourage. One such admirer, the young Corf Binalie, idolized the Jedi all through his childhood. When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, the Separatist leaders targeted Cartao. Invading the world, Torles led the opposition forces to defend the world's Spaarti Creations facility. When the Grand Army of the Republic reinforced Jedi Torles, he joined Commander Roshton and the double agent Kinman Doriana in trying to repel the Separatists. Tragically, in the aftermath of the battle a Republic gunship crashed into the main Spaarti Creations facility, destroying it and condemning the planet to economical death. When it was later learned that the Jedi Knights had apparently ordered the suicide mission, Torles found himself exiled and shunned by his old friends, including young Binalie. The old Jedi left the planet to return to Coruscant, vowing to identify and track down the Jedi who had ordered the strike.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/94_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Jedi_Watchman/Legends",
  "/wiki/Cartao/Legends",
  "/wiki/Prackla_sector",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Sentinel/Legends",
  "/wiki/51_BBY/Legends",
  "/wiki/Battle_of_Cartao_(Clone_Wars)",
  "/wiki/Corf_Binalie",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Spaarti_Creations",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Roshton",
  "/wiki/Kinman_Doriana",
  "/wiki/Low_Altitude_Assault_Transport/Legends",
  "/wiki/Hero_of_Cartao",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}