{
 "name": "Jagi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3956 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Mandalorian Neo-Crusaders",
      "Mandalorian Neo-Crusaders"
     ]
    }
   ]
  }
 ],
 "content": "Jagi was a Human male Mandalorian that was a subordinate of Canderous Ordo before the outbreak of the Mandalorian Wars. In 3976 BBY, Jagi served under Ordo during the Mandalorian's capture of the planet Althir. During the battle, Jagi and his comrades were abandoned by Ordo while he sought a quick end to the engagement, which resulted in the deaths of Jagi's fellow Mandalorians. He swore to take his vengeance on Ordo for what he believed was the Mandalorian's cowardice.\nIn 3956 BBY, the final year of the Jedi Civil War, Jagi encountered Ordo as the former was assisting the Jedi Padawan Revan in his search for the Star Forge, an ancient Rakatan superweapon that was fueling the Sith Empire's war effort. During the encounter, Jagi challenged Ordo to a duel in the Dune Sea on the planet Tatooine. Eventually, he and two thugs met Ordo and Revan near a broken sandcrawler owned by Czerka Corporation.\nWhile fighting a battle over the world of Althir, Ordo saw an opening in the Althiri fleet and decided to turn his attack force on the exposed area, leaving his other men and Jagi to die. Most of the Mandalorians under Jagi's command died and Jagi himself believed Ordo abandoned them all without good reason, though Ordo would later state that he did it to save the lives of more of his warriors.\nAfter having spent several years tracking his former commander, Jagi finally found him on one of the planets where there was a Star Map, and challenged him to a duel in the Dune Sea of Tatooine, threatening him to lose all honor in the eyes of Mandalorians. To ensure this, he claimed to have informed every surviving clan about what he was up to.\nThough he brought with him two Rodian thugs, Jagi waited for Ordo on Tatooine and the two of them met in the shade of a damaged Czerka Sandcrawler. Actually, thanks to Revan's intervention, Ordo was able to explain his behavior at the battle over Althir, making Jagi understand that his choice saved the lives of many Mandalorians, and moreover complied to Mandalore's teachings about opportunism and flexibility in combat.\nRealizing that he has been wrong to call Ordo's integrity into question, and that he had no other means to cleanse his after such accusations, he finally took his own life to die in honor. Afterwards, Revan and Ordo defeated the other two Rodian thugs. Ordo then realized that he was affected by this in more ways than he had anticipated, he thanked Revan for whatever his intentions were, and said that he needed time to think over what had just happened.\nJagi was featured in the 2003 Xbox and PC video game Star Wars: Knights of the Old Republic, developed by BioWare. He was also mentioned in the official strategy guide for Knights of the Old Republic, where his name is spelled 'Jagy'. The character received an entry in The Complete Star Wars Encyclopedia.\nIn the game, there are multiple paths the player can pursue in order to complete the sidequest centered on the character. If the player fails to convince Jagi to see Ordo's viewpoint, the character and his men attack and are killed. However, if the player attempts to use Force Persuasion to convince Jagi not to fight, Canderous will say he does not want the player to do so, and Jagi attacks anyway. Regardless of the action taken, Canderous will have the same response after the skirmish, and neither option affects the player's alignment.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3956_BBY",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Canderous_Ordo",
  "/wiki/Mandalorian_Wars",
  "/wiki/3976_BBY",
  "/wiki/Battle_of_Althir_(first)",
  "/wiki/Planet/Legends",
  "/wiki/Althir_III",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Star_Forge",
  "/wiki/Rakata/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Dune_Sea/Legends",
  "/wiki/Sandcrawler/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Star_Map",
  "/wiki/Rodian/Legends",
  "/wiki/Mandalore_(title)",
  "/wiki/Suicide/Legends",
  "/wiki/2003",
  "/wiki/Xbox",
  "/wiki/Personal_computer",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/BioWare",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Mind_trick/Legends",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide"
 ]
}