{
 "name": "Jai Maruk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Druckenwell"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Phindar Spaceport"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Tallisibeth Enwandung-Esterhazy"
     ]
    }
   ]
  }
 ],
 "content": "Jai Maruk was a Human male from the planet Druckenwell who served as a Jedi Master during the Clone Wars. Around 19 BBY, he was patrolling the Outer Rim and followed a suspicious transport into the planet Vjun, where he was captured by the Separatist-aligned Dark Jedi Asajj Ventress after a short duel. Maruk was brought to Count Dooku, the Head of State of the Confederacy, who promptly released him in order to deliver a message to Grand Master Yoda in the Jedi Temple.\nWhile recuperating from his injuries, the annual Apprentice Tournament was held, and Maruk was among the many spectators. He made a comment to Yoda about one of the apprentices, Tallisibeth Enwandung-Esterhazy, regarding her weak connection to the the Force as a liability for a Jedi Knight. Enwandung-Esterhazy eventually emerged as the tournament champion, and Maruk grudgingly accepted her as his Padawan as a consequnce of a wager with Yoda. Weeks later, Maruk and Enwandung-Esterhazy accompanied Yoda on a mission to Vjun along with Master Maks Leem and her Padawan, Whie Malreaux. The group stopped at Phindar Spaceport and was ambushed by Ventress and a platoon of assassin droids. Ventress engaged Maruk in another lightsaber duel and dealt a mortal blow to Maruk with a slash to his chest, killing the Jedi.\nJai Maruk was a Human male native to the planet Druckenwell. In his early years he underwent Jedi training at the Jedi Temple on Coruscant, earning the nickname \"the Hawk-bat\" for his penchant of winning staring contests against other Jedi Apprentices. Maruk had attained the rank of Jedi Master by 22 BBY, the year the Clone Wars broke out between the Galactic Republic and the Confederacy of Independent Systems.\nIn 19 BBY, Maruk served as a Jedi General in the Grand Army of the Republic. While leading clone troopers as they ran reconnaissance in the Outer Rim, he noticed small, drab transports that kept traveling in from unusual coordinates. Deciding to investigate further, he tracked one of the transports to its rendezvous on the planet Vjun. Despite carefully making landfall, he was still discovered by the Separatist-aligned Dark Jedi Asajj Ventress, who engaged him in a lightsaber duel.\nMaruk made the mistake of underestimating Ventress, and the latter overpowered him with her relentless attacks, wounding him with a lightsaber burn on his cheek. His lightsaber disarmed, Ventress took Maruk as her prisoner and transported him to Château Malreaux, where Count Dooku, the Confederacy Head of State, was residing. In spite of protests from Ventress, who wanted to kill Maruk and add him to her growing tally of slain Jedi, Dooku allowed him to go free in order to deliver a private message to Grand Master Yoda. Maruk flew back to Coruscant and into the Jedi Temple, calling all available members of the High Council to deliver Dooku's message.\nWeeks later, Maruk was recuperating from the injuries Ventress dealt him but was able to spectate the annual Apprentice Tournament held in the temple. After the first half of the competition was completed, Maruk received a tip from Master Ilena Xan, the tournament's host: the second part would be held in the refectory as a surprise. Maruk made his way to the dining room and was called by Yoda to join his and Master Maks Leem's table. Discussing the tournament between themselves, Maruk expressed his negative feelings on one certain participant: Apprentice Tallisibeth Enwandung-Esterhazy.\nMaruk felt that she would be a liability as a Jedi Knight due to her weak connection to the Force as well as her penchant of using too much trickery, which he felt was not in keeping with the ideals of the Jedi. Maruk concluded that the best path for her would be to the Agricultural Corps, where she could do much good for many years as opposed to being dead in mere months on a battlefield.\nTo counter Maruk's opinion, Yoda made a bet with him; Enwandung-Esterhazy would be sent to the Agricultural Corps if she finished in the lower half of the tournament. If she came in second, third, or fourth, she would remain as an apprentice, and if she won the tournament, Maruk would take her as his Padawan learner. Maruk reluctantly accepted the wager, and after Enwandung-Esterhazy defeated all other competition, Maruk was forced to keep his word and take her as his Padawan.\nShortly after the tournament, Yoda selected Maruk, Enwandung-Esterhazy, Leem, and her Padawan, the Vjun native Whie Malreaux, to accompany him on a secret mission to Vjun in order to bring Count Dooku back to the Jedi fold. Their trip started in the Chancellor Palpatine Spaceport, where, while undercover, they boarded the starship Reasonable Doubt to travel to the Outer Rim. During the journey, Maruk found himself starting to like Enwandung-Esterhazy despite his strict reservations in forming attachments. In a private conversation with Malreaux, Maruk expressed his admiration of Enwandung-Esterhazy's commitment to living with honor despite her limitations, including not succumbing to the temptation of cheating her way through life.\nOn the second leg of their journey, their group arrived at Phindar Spaceport, the gateway to the Outer Rim, where they were ambushed by Ventress and a platoon of assassin droids. A group of six droids attacked Maruk and Leem, with two of the droids each brandishing a hard-sound gun, incapacitating the two Jedi Masters with their stupefying loud noise. Leem managed to battle through the excruciating pain in her head and destroy one of the hard-noise projector dishes using the Force, giving Maruk the chance to recover and demolish the remaining droid bearing the other hard-sound gun. Surrounded by the mayhem caused by the fleeing civilians, Maruk gleefully fought with a rage dangerously close to the dark side and destroyed two more droids, with Leem dispatching the remainder.\nBattered and injured, Maruk then faced off against Ventress in a rematch of their previous duel. Despite mentally preparing for the fight, having selected the best opening stances and attacks to use, Maruk realized that she simply was his better in lightsaber dueling. He switched tactics and used the Force to throw a piece of a broken droid behind her back only for her to sense it and evade the projectile easily, hitting him hard in his right leg instead. As his loathing of her slowly fueled his attacks, Maruk fell into a black fury half blinded with hate as he drove her back with his flurry.\nVentress, toying with him, continued to seduce him into the dark side of the Force. Leem, too incapacitated from her own injuries to assist Maruk against Ventress, pleaded wordlessly with her eyes for him not to fall to the dark side. Maruk realized how close he actually came to losing himself and made the decision to die as a Jedi. He was smiling at the moment Ventress eventually dealt a fatal slash to his chest. When his Padawan finally reached his side, she begged him not to leave her, and with his last breath before dying, Maruk promised that he never would and would be with her in spirit.\nJai Maruk was fair-skinned with brown hair and bearded by the time of the Clone Wars. His appearance was typical enough of a Druckenwellian that a spaceport security guard was able to correctly guess his homeworld. After his first duel with Asajj Ventress on Vjun, he suffered a lightsaber burn on his cheek that left him a white scar that ran from his jaw to ear.\nMaruk was strong-willed even as a seven year old child in the Temple. He won staring contests against other apprentices by simply refusing to close his eyes, even though they burned and ran with tears, and by outlasting his opponent who could not take the pain. Because of his fierce, wild stare, he earned the nickname \"the Hawk-bat.\" In his teenage years, he developed an attraction toward fellow Jedi apprentice Politrix and remembered her fondly after her death two months after the Battle of Geonosis. Maruk was a gaunt and fierce Jedi who rarely smiled. He thought of himself as a private man and someone who hated being in a crowd at the best of times, acknowledging his flaws of having a temper, quick condemnation, and slow forgiveness toward others. He believed in being honorable and was put off by Tallisibeth Enwandung-Esterhazy's excessive use of trickery during the Apprentice Tournament.\nAlthough having attained the rank of Jedi Master, he felt that he was not ready to take his own Padawan, feeling that he was more of a doer than a teacher. He dedicated his entire life to the principles of justice, truth, and knowledge. Maruk was a firm believer of the light side, stating plainly that he would have no problem killing a Jedi who fell to the dark side. However, Maruk almost succumbed to the dark side's power himself while battling Ventress for the second time; his desperation and hatred bubbled as he realized he was going to die at her hands. When he successfully resisted the pull and stayed within the light, it meant everything for Maruk, and he died smiling.\nTrained as a Jedi since his youth at the Jedi Temple on Coruscant, Jai Maruk was fully capable of utilizing the Force in many ways, particularly Telekinesis and Force jumping. He was also proficient at lightsaber combat, able to win against formidable assassin droids despite being injured. In addition to these talents, Maruk was also an accomplished pilot, managing to fly the Seltaya-class fast courier Limit of Vision in spite of his injuries from his first duel with Ventress.\nJai Maruk owned a lightsaber containing a crystal.\nJai Maruk first appeared in Yoda: Dark Rendezvous, a novel written by Sean Stewart and published in 2004. Maruk was first visually depicted in Star Wars: Battle for the Republic, a mobile game released in 2005 by Amplified Games. He is among the available heroes featured in the game that add combat modifiers to units, which can be used for attacking and defending.\nMaruk has conflicting versions of his capture by Asajj Ventress. In The Complete Star Wars Encyclopedia, published in 2008, it is stated that he and his force were on patrol near the planet Vjun when they were intercepted by Ventress and brought to the planet. In Dark Rendezvous, however, he was actually patrolling in the Outer Rim and snuck onto Vjun alone before Ventress defeated him in a duel and captured him.\nAnother contradiction appears in the 2012 reference book The Essential Reader's Companion, which establishes that Maruk escaped capture from Ventress and delivered a message from Count Dooku to Grand Master Yoda. However, in the novel, Ventress delivered Maruk as a prisoner to Dooku, who promptly released him in order to deliver his message to Yoda.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Featured_article_nominations/Jai_Maruk_(second_nomination)",
  "/wiki/Druckenwell/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Phindar_Spaceport",
  "/wiki/Human/Legends",
  "/wiki/Druckenwellian",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Tallisibeth_Enwandung-Esterhazy",
  "/wiki/Planet/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Vjun/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Duel_on_Vjun_(Clone_Wars)",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Head_of_State/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Temple_Apprentice_Tournament",
  "/wiki/Padawan/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Vjun_(Clone_Wars)",
  "/wiki/Maks_Leem",
  "/wiki/Whie_Malreaux/Legends",
  "/wiki/A-series_assassin_droid",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Death/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Hawk-bat/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Galactic_coordinates/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Ch%C3%A2teau_Malreaux",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Ilena_Xan",
  "/wiki/Agricultural_Corps/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Chancellor_Palpatine_Spaceport",
  "/wiki/Starship/Legends",
  "/wiki/Reasonable_Doubt",
  "/wiki/Platoon/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Hard-sound_gun",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Time/Legends",
  "/wiki/Ear/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Politrix",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Force_Jump",
  "/wiki/Pilot/Legends",
  "/wiki/Seltaya-class_fast_courier",
  "/wiki/Limit_of_Vision",
  "/wiki/Lightsaber_crystal",
  "/wiki/Yoda:_Dark_Rendezvous",
  "/wiki/Sean_Stewart",
  "/wiki/2004",
  "/wiki/Star_Wars:_Battle_for_the_Republic",
  "/wiki/2005",
  "/wiki/Amplified_Games",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/2012",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Yoda:_Dark_Rendezvous_(audiobook)",
  "/wiki/The_New_Essential_Chronology"
 ]
}