{
 "name": "Jaiyna_Sibinth",
 "display_name": "Jaiyna Sibinth",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Jaiyna Sibinth was a human female xenolinguist. She regularly attended the Aki-Aki Festival of the Ancestors on Pasaana, studying the Aki-Aki's ancient language. Sibinth noted recurring themes and symbols found in cultures native to other desert worlds, including Cona, Klatooine, Sriluur, and Tatooine.\nJaiyna Sibinth first appeared in the 2019 Star Wars film Star Wars: Episode IX The Rise of Skywalker. She was first identified in Star Wars: The Rise of Skywalker: The Visual Dictionary, a reference book for the film written by Pablo Hidalgo. Although Sibinth's first name is spelled Jaiyna in the main text, the book's index spelled her name as \"Jaina.\" When questioned on the proper spelling of the character's name, Lucasfilm Story Group member Matt Martin recommended to give precedence to the name used in the character's entry in the book over the index and noted the spelling distinguished Sibinth from the Star Wars Legends character Jaina Solo.\nSibinth was played by Raiyah bint Hussein, a Princess of the royal family of Jordan, where the Pasaana scenes were filmed in the country's Wadi Rum desert. Like her character, Raiyah bint Hussein is an academic and is currently a PhD candidate at the University of California, Los Angeles as of November 2019. The character's name is based on the princess' name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Xenolinguist",
  "/wiki/Aki-Aki",
  "/wiki/Festival_of_the_Ancestors",
  "/wiki/Pasaana",
  "/wiki/Language",
  "/wiki/Desert",
  "/wiki/Cona",
  "/wiki/Klatooine",
  "/wiki/Sriluur",
  "/wiki/Tatooine",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Jaiyna_Sibinth",
  "/wiki/2019",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Matt_Martin",
  "/wiki/Star_Wars_Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Raiyah_bint_Hussein",
  "/wiki/File:MattMartin_JaiynaSibinth_tweet.png",
  "/wiki/File:JaiynaSibinth_RaiyahbintHussein_tweet.png",
  "/wiki/November_5",
  "/wiki/December_25",
  "/wiki/May_22",
  "/wiki/December_23"
 ]
}