{
 "name": "Jak'zin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 32 BBY and 22 BBY",
      "Sullust"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Orange and white",
      "with black stripes"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jak'zin was a Togorian male Jedi Knight who traveled to the planet Sullust to investigate the Kaldana Syndicate, a criminal organization that had made inroads on the planet, sometime between 32 BBY and 22 BBY. While on Sullust, he crossed paths with former Jedi Master Dooku, whom Jak'zin had seen when he was younger. Dooku, secretly a Sith Lord, gained Jak'zin's trust and offered to help him on his mission.\nLocalizing the Kaldana Syndicate, the organization's guards surrounded the duo, and Dooku used his red lightsaber to fight them. Although surprised by Dooku's lightsaber color, Jak'zin fought by his side against the criminals. After surviving the fight, Jak'zin still felt distrustful of Dooku and his red lightsaber, being the color of a Sith's. Dooku revealed his true allegiance and used the Force to manipulate a blaster, fatally shooting Jak'zin through the back.\nA Togorian male, Jak'zin joined the Jedi Order sometime before 42 BBY. As a youngling, he watched dueling demonstrations by Jedi Grand Master Yoda and his former Padawan Dooku, which he found inspirational. Jak'zin came to know Dooku's apprentice, Qui-Gon Jinn, as well.\nHowever, Dooku became disillusioned with the Order and left in 42 BBY, returning to take up his legacy in becoming the Count of Serenno, a planet in the Outer Rim Territories. In his absence, Jinn was killed by the Sith Darth Maul, in 32 BBY. Jak'zin soon heard rumors circulating among the Jedi about Dooku, the most common being that Dooku was starting his own Order of Force-sensitives.\nJak'zin eventually ascended to the title of Jedi Knight in the Order. Sometime between 32 BBY and 22 BBY, he was sent to the planet Sullust to investigate the Kaldana Syndicate, which had made inroads on the planet and proved itself to be a problem to the Galactic Republic. While on Sullust, he crossed paths with Count Dooku, who was there to undergo contract negotiations with Representative Kap Klyp of the SoroSuub Corporation and also secretly to seek out the Kaldana Syndicate for Darth Sidious, his Sith Master. Jak'zin commended Dooku's Jedi days and mentioned knowing his apprentice, Jinn. Even though Klyp was eager to get back to business, Dooku invited Jak'zin to join them for dinner. Over dinner, Dooku and Jak'zin discussed the rumor of Dooku starting his own Order. Dooku dismissed it, explaining he was looking after his family interests on Serenno. When he asked Jak'zin why he was on Sullust, the Togorian told him it was private business for the Jedi High Council, and Dooku decided not to insist on the matter.\nThat evening, Dooku approached Jak'zin, wanting to take a walk with him. The count asked him about how dangerous his mission was, at which he remarked that the Jedi had sent him for a reason. Dooku then brought up his apprentice, Jinn; the two spoke highly of the late Jedi Master, with Dooku wondering whether his death could have been prevented if he had still been around, adding that the presence of Jinn's own apprentice, Obi-Wan Kenobi, had not been enough to save him. As Dooku finished, he convinced Jak'zin to reveal his mission by comparing Jinn's death without a Master with the Togorian's mission, which he was completing alone. As Jak'zin finished explaining his mission to investigate the Kaldana Syndicate, Dooku offered to go with him. Jak'zin was skeptical at first, but Dooku convinced him by pointing out his investment in Sullust.\nAllowing Dooku to join him, Jak'zin immediately began jumping across the roofs of the city with Dooku behind him. They soon reached a location where Jak'zin had tracked the Kaldana Syndicate to, but the Togorian did not know their numbers. Dooku suggested a more diplomatic approach to the Kaldana, and they both went up to the door of the building. As Jak'zin knocked on the door, a hatch opened to his right, and a blaster fired at him. Dooku Force pushed the Jedi out of the way, saving his life. Using his lightsaber, Jak'zin cut through the door and began deflecting blaster shots from members of the Kaldana Syndicate.\nAs he fended off several more of the Kaldana, the Jedi discovered crates of weapons, deducing that the syndicate was smuggling arms. The pair were then surrounded by several criminals. While Jak'zin processed their situation, Dooku revealed his lightsaber. Much to the Togorian's surprise, it was red in color, symbolizing Dooku's true allegiance to the Sith. The Kaldana then opened fire, and Dooku and Jak'zin proceeded to kill them. After finishing off the criminals, Jak'zin questioned where Dooku had gotten his red lightsaber. Dooku claimed that he had made it and used the Force to lift a blaster and shoot Jak'zin through the back, killing him. After Jak'zin death, Dooku claimed authority over the Kaldana Syndicate, delivering it into the hands of Darth Sidious.\nJak'zin idolized Dooku even after the count had left the Jedi Order. It clouded his judgment of the count when they conversed, and he was manipulated into revealing his mission to Dooku, as well as bringing him along, although he was wary of it. Jak'zin saw no fault in his decisions until Dooku revealed his red lightsaber, and even then, he did not immediately assume the count was a Sith. Jak'zin was a Togorian male with yellow eyes, orange and white fur, and black stripes that occupied his orange fur.\nJak'zin, being Force-sensitive, was able to Force jump and could sense danger, although he was not able to perceive or dodge the blaster bolt fired through a hatch in the wall. He wielded a lightsaber and was capable of deflecting blaster bolts with it.\nJak'zin wore brown and yellow Jedi robes and utilized a blue lightsaber during combat.\nJak'zin appeared in the one-shot comic Age of Republic - Count Dooku 1, published by Marvel Comics on February 13, 2019. The comic was written by Jody Houser and illustrated by Luke Ross and Java Tartaglia.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/32_BBY",
  "/wiki/22_BBY",
  "/wiki/Sullust",
  "/wiki/Togorian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Knight",
  "/wiki/Mission_on_Sullust",
  "/wiki/Planet",
  "/wiki/Kaldana_Syndicate",
  "/wiki/Jedi_Master",
  "/wiki/Dooku",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Dooku%27s_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Sith",
  "/wiki/The_Force",
  "/wiki/Blaster",
  "/wiki/42_BBY",
  "/wiki/Youngling",
  "/wiki/Jedi",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Padawan",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Invasion_of_Serenno",
  "/wiki/Count_of_Serenno",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Death",
  "/wiki/Maul",
  "/wiki/Force-sensitive",
  "/wiki/Count",
  "/wiki/Kap_Klyp",
  "/wiki/SoroSuub_Corporation",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_Master",
  "/wiki/Standard_day",
  "/wiki/Serenno",
  "/wiki/Jedi_High_Council",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Force_jump",
  "/wiki/City",
  "/wiki/Diplomat",
  "/wiki/Force_push",
  "/wiki/Living_Force",
  "/wiki/Weapon",
  "/wiki/Smuggler",
  "/wiki/Darth",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Jedi_robes",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Age_of_Republic_-_Count_Dooku_1",
  "/wiki/Marvel_Comics",
  "/wiki/February_13",
  "/wiki/2019",
  "/wiki/Jody_Houser",
  "/wiki/Luke_Ross",
  "/wiki/Java_Tartaglia",
  "/wiki/Category:Images_of_Jak%27zin",
  "/wiki/Battle_of_Naboo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_BBY",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Dark_Disciple",
  "/wiki/Tarkin_(novel)",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace"
 ]
}