{
 "name": "Jak  (Nautolan)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rik's Cantina"
     ]
    }
   ]
  }
 ],
 "content": "Jak was a male Nautolan who grew up in the Coruscant underworld, where he befriended the Jedi Padawan Cade Skywalker, a frequent visitor of the planet's underlevels. By 137 ABY, Jak had become the personal bodyguard of the Hutt Queen Jool and worked as an enforcer at Rik's Cantina, which she owned. His loyalty to Jool was unflinching, and he would rid the establishment of anyone who caused her trouble if she commanded it. Skywalker visited the cantina in 137 ABY but was soon after taken captive by Coruscant's ruling Sith; Jak later witnessed a hologram that Skywalker had placed inside of his astromech droid, R2-D2. After the hologram concluded, a group of Skywalker's allies began planning a rescue of him from the clutches of the Sith, but Jak left the mission in their hands and exited the cantina.\nThe male Nautolan Jak lived in the underworld of the galactic capital of Coruscant during the Sith–Imperial War of 127–130 ABY. During his youth, Jak often encountered and eventually befriended the Jedi Padawan Cade Skywalker, who visited the planet's underlevels to escape from his rigorous Jedi training. By 137 ABY, Jak was working as the personal bodyguard of Queen Jool, the Hutt owner of Rik's Cantina, a well-known bar and meeting place in the Coruscant underworld. Jak also served as the cantina's enforcer and had become a regular fixture in the establishment to the point that his presence was often nearly forgotten by its denizens.\nIn 137 ABY, Skywalker returned to the cantina. Jak was surprised to see his old friend, as the Jedi Order had been decimated by Darth Krayt's Sith Order seven years prior, and Krayt had usurped the galactic throne on Coruscant. Nevertheless, the two nonchalantly greeted each other at the door. Skywalker, who was on his way to the Temple of the Sith to rescue the captive Jedi Hosk Trey'lis, left the access codes to his starship, the Mynock, with Jool in case he should not return. His co-pilot Jariah Syn and mechanic Deliah Blue arrived shortly thereafter and retrieved the codes. Jak and Jool joined them inside the cantina as they watched a hologram Skywalker had placed inside of his astromech droid R2-D2, telling them not to attempt to rescue him. Soon to arrive were the bounty hunters Chak and Kee, who had their own reasons for wanting Skywalker rescued, and Morrigan Corde, the mother of Skywalker. At Jool's word, Jak escorted her to her home while the motley crew remained in the bar and discussed how they could best retrieve Skywalker from the temple.\nAs Jool's bodyguard, Jak was completely loyal to the Hutt. His first priority was to protect her, and he dealt with troublemakers in Rik's Cantina at her command by tossing them out the bar's front door. The strong and silent type, Jak's presence was often nearly forgotten by patrons of the bar as he kept watch over the entire room; he was particularly vigilant when it was visited by someone he did not recognize. Despite being surprised to see Cade Skywalker in 137 ABY, Jak gave his old friend only a one-word greeting when Skywalker arrived at the cantina. He was content in the knowledge that he was hired muscle who was not required to think very much, and had no objections to not participating in the rescue of Skywalker from the Temple of the Sith.\nJak was created by John Ostrander and Jan Duursema for the comic book series Star Wars: Legacy and appeared briefly in the series' fourteenth and sixteenth issues. More information about the character was revealed in 2008's The Complete Star Wars Encyclopedia and 2009's Legacy Era Campaign Guide.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Jak",
  "/wiki/Nautolan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Rik%27s_Cantina/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Planet/Legends",
  "/wiki/137_ABY",
  "/wiki/Bodyguard/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Jool",
  "/wiki/Cantina/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/One_Sith",
  "/wiki/Hologram/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Sith/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/127_ABY",
  "/wiki/130_ABY",
  "/wiki/Jedi_training/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Massacre_at_Ossus",
  "/wiki/Darth_Krayt",
  "/wiki/Standard_year/Legends",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Temple_of_the_Sith",
  "/wiki/Hosk_Trey%27lis",
  "/wiki/Starship/Legends",
  "/wiki/Mynock_(Helot-class)",
  "/wiki/Pilot/Legends",
  "/wiki/Jariah_Syn",
  "/wiki/Technician/Legends",
  "/wiki/Deliah_Blue",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Chak_(Wookiee)",
  "/wiki/Kee",
  "/wiki/Grinning_Liar",
  "/wiki/Morrigan_Corde",
  "/wiki/Parent/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Legacy_(2006)_14",
  "/wiki/Legacy_(2006)_16",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2009",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Category:Images_of_Jak_(Nautolan)",
  "/wiki/Legacy_(2006)_0",
  "/wiki/Legacy_(2006)_1"
 ]
}