{
 "name": "Jake_Fenn",
 "display_name": "Jake Fenn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order",
      "Je'daii Council",
      "Je'daii Council"
     ]
    }
   ]
  }
 ],
 "content": "Jake Fenn was a male Human Je'daii Temple Master serving the Je'daii Order on Tython at the height of the Infinite Empire's reign. When the Rakata attacked the Tython system in what came to be known as the Force Wars, Fenn served as a general and fought to prevent the Empire from taking control of the Settled Worlds.\nA Force-sensitive Human, Jake Fenn was trained in the ways of the Force by the Je'daii Order on the planet Tython, one of nine planets in the Tython system which made up the Settled Worlds. Born into a family strong in the Force, Fenn's sister Rori was a Je'daii Ranger. Appointed as a Je'daii Temple Master sometime prior to 25,808 BBY, Fenn governed the Great Temple of the Arts, Bodhi. Carrying a single Force-imbued blade, Fenn and the other Temple Masters formed the Je'daii Council, meeting via holocommunication at the Temple of Balance, Akar Kesh.\nA friend of Je'daii Master Brock, Brock's son Dalien suspected the Temple Master praised his work only due to his respect for his father. In 25,793 BBY Fenn communicated with the rest of the Masters' Council when the Devourer crashed on Tython, causing a massive and devastating Force Storm. Joining the other Temple Masters in meditation, Fenn and his colleagues helped to disperse the Force Storm and prevent it from completely devastating the planet. Later, following the escape of the Force Hound Xesh and exiled Je'daii Daegen Lok from the moon of Bogan, Fenn and his sister led a team of Je'daii in pursuit of the pair. Flying two Peacemaker-class cruisers in chase, Fenn and his team of Je'daii including Journeyer Sek'nos Rath and Ranger Bel Zana investigated the cells on Bogan only to discover it filled with terenta. Tracking him to Krev Coeur, Fenn and his fellow Je'daii engaged the pair within the crystal mines. Dueling with Lok, Fenn remarked on Lok's arrogance before the exile slashed him across the chest. Seeking out Fenn's darkest fear, Lok realized that Fenn cared for Ranger Zana and used the Force to toss her over the cliff and twisting her mind to make her think she was on fire. As Lok and Xesh fled, Rath sacrificed himself to save Zana so that Fenn could rush her to a medical facility. Rushing her to Kalimahr, Fenn contacted the other Je'daii to let them know of Zana's condition and the fact Rath may be dead.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jake",
  "/wiki/Tython/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Je%27daii_Council",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Infinite_Empire",
  "/wiki/Rakata/Legends",
  "/wiki/Tython_system/Legends",
  "/wiki/Force_Wars",
  "/wiki/Settled_Worlds",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Rori_Fenn",
  "/wiki/Je%27daii_Ranger",
  "/wiki/Bodhi",
  "/wiki/Force-imbued_blade",
  "/wiki/Holocomm/Legends",
  "/wiki/Akar_Kesh",
  "/wiki/Lanoree_Brock%27s_father",
  "/wiki/Dalien_Brock",
  "/wiki/25,793_BBY",
  "/wiki/Devourer_(Rakatan_ship)",
  "/wiki/Force_Storm",
  "/wiki/Force_Hound",
  "/wiki/Tau_(individual)",
  "/wiki/Daegen_Lok",
  "/wiki/Bogan",
  "/wiki/Peacemaker-class_cruiser",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Sek%27nos_Rath",
  "/wiki/Bel_Zana",
  "/wiki/Terenta",
  "/wiki/Krev_Coeur",
  "/wiki/Kalimahr",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_4",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_5",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_2",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_3",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_4",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_5",
  "/wiki/Dawn_of_the_Jedi:_Force_War_3",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi_0"
 ]
}