{
 "name": "Jal Te Gniev",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Jazbina system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Red Squadron",
      "Red Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Jal Te Gniev was an experienced but argumentative Human male pilot for the Rebel Alliance.\nA veteran pilot, Jal had flown 31 missions and destroyed 80 TIE Fighters by the time of the Battle of Yavin.\nHowever, he did not participate in the Battle of Yavin due to measles. His X-wing was borrowed by Luke Skywalker, while his place in Red Squadron was taken by Red Eight Bren Quersey, who was killed in action. Gniev felt great hatred towards Skywalker because he felt as though he had been denied his rightful glory in destroying the first Death Star, especially considering his extensive flight record with the Rebel Alliance.\nWhile nearly getting into an argument with Wedge Antilles at the Alliance's Massassi Base, a false alarm went off. Jal jumped the gun, rushed to his fighter while drunk and opened the S-foils too quickly, scraping the wings on the hangar wall, and crashed the fighter into a nearby tree. He was then brought before the Alliance High Command. General Jan Dodonna tried to get Gniev to explain his actions, but Gniev was uncooperative and angrily accepted the council's decision of reassignment to Dubrava as a recruiter.\nWhile on Dubrava, Gniev made his way to the local cantina and its array of intoxicating drinks. A young Dubravan named Bobek found the cantina and requested to join the Alliance. Gniev, drunk, blindfolded Bobek and had him walk into a trap door in the boardwalk, falling into the swampy water below. Humiliated and disillusioned, Bobek left. Also while drunk, Gniev mentioned the name \"Skywalker\" to Nevana, who, in turn, mentioned it to Sarma. Soon enough, Imperial forces heard of the name and began to seek its source: Gniev. A squad of stormtroopers attacked the cantina and set it ablaze, burning dozens of Dubravans alive.\nGniev was barely able to escape, but reappeared some distance away, only to encounter a pair of stormtroopers. By chance, Bobek was nearby and killed one of the troopers. The second trooper shot Bobek and was then drowned by Gniev. Bobek admitted to purchasing the blaster with the intent to kill Gniev, but used it against the Galactic Empire when the chance arose. With Bobek's death, Gniev reevaluated himself and set out to save Luke Skywalker, whose life he had placed in extreme jeopardy.\nGniev then acquired a Z-95 Headhunter which he flew to Jazbina to save Skywalker. Skywalker, meanwhile, had become entangled with Lord Prepredenko and Princess Syayna. Upon the arrival of Darth Vader and an Interdictor-class Star Destroyer that prevented anyone from fleeing the planet, the situation on Jazbina looked grim. Gniev landed on the planet and joined the efforts of Skywalker and Syayna to save the planet. Using Skywalker's X-wing, Gniev flew into space to attack the Interdictor. Amused, the Imperial captain ordered his crew to lower the shields and release the squadron of TIE fighters, believing the lone fighter was attempting to flee. But Gniev, who intended only to protect his comrades below, simply rushed onward through the emerging TIEs and entered the Interdictor's hangar bay before its crew could raise the shields again. There he released his entire supply of proton torpedoes into the heart of the warship. He was consumed by the massive explosion of the Interdictor, which crippled the Imperial effort to subdue Jazbina. Gniev's sacrifice, however tragic, saved the day on Jazbina.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jal",
  "/wiki/0_ABY/Legends",
  "/wiki/Jazbina_system",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Red_Squadron_(Rebel_Alliance)/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Measles",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Red_Eight/Legends",
  "/wiki/Bren_Quersey/Legends",
  "/wiki/Death/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Great_Temple/Legends",
  "/wiki/S-foils/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/General/Legends",
  "/wiki/Jan_Dodonna/Legends",
  "/wiki/Dubrava/Legends",
  "/wiki/Unidentified_bar_(Dubrava)",
  "/wiki/Alcohol/Legends",
  "/wiki/Dubravan",
  "/wiki/Bobek",
  "/wiki/Nevana",
  "/wiki/Sarma",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Jazbina/Legends",
  "/wiki/Mission_to_Jazbina",
  "/wiki/Prepredenko",
  "/wiki/Prince/Legends",
  "/wiki/Syayna",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Interdictor-class_Star_Destroyer/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Proton_torpedo/Legends",
  "/wiki/Vader%27s_Quest_1",
  "/wiki/Vader%27s_Quest_2",
  "/wiki/Vader%27s_Quest_3",
  "/wiki/Vader%27s_Quest_4",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_16",
  "/wiki/The_Official_Star_Wars_Fact_File_21",
  "/wiki/The_Official_Star_Wars_Fact_File_67",
  "/wiki/The_Official_Star_Wars_Fact_File_136",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Vader%27s_Quest"
 ]
}