{
 "name": "Jambe Lu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order",
      "Agricultural Corps",
      "Agricultural Corps"
     ]
    }
   ]
  }
 ],
 "content": "Jambe Lu was a Human male serving the Jedi Order during the final years of the Republic Classic era. Holding no official rank within the Order, Lu had failed out of the Jedi Temple's academy and been placed within the Agricultural Corps. Following the rise of the Galactic Empire, Lu went into hiding with fellow surviving Jedi during the Great Jedi Purge.\nDiscovered to be Force-sensitive near birth, Lu studied at the Coruscant Jedi Temple's academy for several years before trying, and failing, to graduate. With this failure, the Council of Reassignment placed Lu in the Jedi Service Corps, assigning him to the Agricultural Corps. Stationed on the stripped-mined world of Bonadan, Lu worked to help restore the world's ruined landscape with other AgriCorps members, such as Jedi Nam Poorf.\nAs the Clone Wars tore across the galaxy, Lu remained out of the Grand Army of the Republic and had little interaction with the clone troopers that fought for the Republic. At the end of the war, Supreme Chancellor Palpatine betrayed the Jedi Order, issuing Contingency Order 66 commanding all clone units open fire on their Jedi Generals. At the time, Lu and Poorf were on their way back to Coruscant when word reached them of the catastrophe happening throughout the galaxy. Fleeing, the pair eventually met up with eight fellow survivors who had hijacked a SX troop shuttle on Dellalt. While departing Dellalt, four of the other Jedi were killed when the group came under fire from a group of the Galactic Empire's ARC-170s and a light cruiser that gave pursuit. Limping between the stars, the Jedi were eventually rescued by the Drunk Dancer.\nAboard smuggler Jula Shryne's ship, the Jedi were kept safe for a time as they traveled through space avoiding the Empire. When Captain Shyrne's son, Jedi Master Roan Shryne was rescued and joined the crew, the Jedi became reinvigorated and ready to confront the Dark Lords of the Sith who controlled the Empire. Landing on Kashyyyk in search of Grand Master Yoda, the Jedi were trapped on the world when the Empire launched an attack on the world, led by Darth Vader. When Vader confronted the Jedi, Lu attempted to kill the Sith Lord but lost his right arm to Vader's lightsaber. Saved from death by his comrades, the surviving Jedi were able to escape the planet, committing their lives to subtly sabotage the Empire from the inside until someone stronger came along and overthrew the Sith. Lu in particular, planned on joining a flight school where he could eventually lead a group of dissenters in an uprising.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Agricultural_Corps/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_academy",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Council_of_Reassignment/Legends",
  "/wiki/Jedi_Service_Corps/Legends",
  "/wiki/Bonadan/Legends",
  "/wiki/Nam_Poorf",
  "/wiki/Clone_Wars/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Order_66/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/SX_troop_transport",
  "/wiki/Dellalt/Legends",
  "/wiki/Aggressive_ReConnaissance-170_starfighter/Legends",
  "/wiki/Drunk_Dancer",
  "/wiki/Smuggler/Legends",
  "/wiki/Jula_Shryne",
  "/wiki/Captain/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Roan_Shryne",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Battle_of_Kashyyyk_(19_BBY)",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Dark_Lord:_The_Rise_of_Darth_Vader"
 ]
}