{
 "name": "Jan_Ors",
 "display_name": "Jan Ors",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 24 BBY",
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic right hand"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Justice Action Network",
      "Alliance to Restore the Republic",
      "Alliance Intelligence",
      "Alliance Intelligence",
      "New Republic",
      "New Republic Intelligence Service",
      "New Republic Intelligence Service",
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Jan Ors was a Human female Alderaanian intelligence operative who began her work as an agent for the terrorist organization Justice Action Network. As the undercover agent Jan Strange, she then shifted to helping the Alliance to Restore the Republic, becoming one of their trusted operatives.\nOrs was instrumental in recruiting Kyle Katarn to the Alliance and together they worked on many missions for the Alliance and later the New Republic. The two would later become romantically involved. Ors continued her work for the New Republic by joining Alpha Blue, a secret intelligence organization, that she eventually took over from Hiram Drayson. There she worked for the Galactic Federation of Free Alliances against the Yuuzhan Vong.\nJan Ors' mother was a choreographer for Alderaan's premier ballet company, and her father was an aerospace engineer; Ors learned both of these arts, although her mother could be with her only when she wasn't rehearsing. She learned from her mother, one of the few remaining believers in the Force, that the Force worked in mysterious ways. Since when she was four years old, her mother noticed that she preferred doing things alone and never asked for help. Her parents also were instrumental in Earnst Kamiel's establishing of the Justice Action Network, an anti-Imperial terrorist organization whose initials  were partly chosen to honor the Ors' daughter. However, Ors did not stay with the JAN, instead striking out on her own path.\nShe began her career by infiltrating Imperial Intelligence under the pseudonym Jan Strange. Once she was well placed in the Surveillance section of Intell, she contacted the Alliance Intelligence, providing them with invaluable counterintelligence and performing sabotage and covert extractions. She first encountered the Imperial cadet Kyle Katarn while working in Intell, though neither left an impression on the other at the time.\nShe maintained a very delicate balance of providing intelligence to the Alliance while simultaneously performing her duties as an Imperial Intelligence officer. Surveillance section came to value her ability to pinpoint the right subjects for observation, and often sent her to the Core Worlds where corruption was rampant. This \"talent\" was the result of Ors arranging to have targets planted by the Alliance, whom she would then observe, capture, and interrogate; they would then be set free, and she would fake a \"termination during interrogation\" to cover their escape.\nUnfortunately for the Alliance, her cover required her to sometimes act against them, even sometimes going so far as to sacrifice clumsy and careless agents. Despite having never worn the uniform of the Alliance to Restore the Republic, her difficult assignment earned her a Captain's rank and a Nebula for Bravery in absentia, along with an almost legendary stature among other Rebels.\nOrs did not remain in her Jan Strange guise for long, and was soon performing missions as part of the Rebel Alliance itself. In 1 BBY, she participated in a mission to steal prime-grade fuel slugs from Imperial forces in the jungles of Oulanne. In the course of the mission, her leg was injured, and it became infected. Her teammates fled with her to Pellezara station in the Duro system, where they hid her beneath the deckplates of their freighter while they all disembarked in search of medical supplies. Tarrin Datch, a seventeen-year old son of the owners of the station, found her while replacing the ship's gravity disks during routine restocking. In a delirium brought on by the strange alien infection, Ors told the boy her name and the cargo the ship was carrying.\nSometime between her service as Jan Strange and 1 BBY, Ors lost the use of her right hand and had it replaced with a cybernetic prosthesis.\nWhen Imperial forces entered the Duro system, Datch, an accomplished pilot, took action to save the strikingly beautiful woman, undocking the ship, and proceeding to fly it in a manner more befitting a starfighter than a freighter, outmaneuvering the Gamma-class assault shuttle that was pursuing them. When he made it to open space, he hypered to an outer-system station that was equipped with a well-equipped medicenter, where he stabilized Ors. Unable to return to Pellezara station, and knowing the fuel slugs needed to be delivered to the Alliance, Ors disclosed the location of the Dantooine base to Datch, who took them both there. There, Datch joined the Rebellion and began training to become a fighter pilot, while Ors went on to other missions.\nOne of her missions was at a Rebel relay station on the asteroid AX-456.\nIt was not long before the Empire located the AX-456 base and invaded; coincidentally, Kyle Katarn was the cadet commander in charge of the mission. At one point, Ors and Katarn saw each other, and though neither remembered their brief past encounters, both felt a spark of distant recognition. Katarn spared the lives of the Rebel group she was in, which fled the asteroid. It would not be their last encounter.\nAfter her experience in the battle of AX-456, Ors desired to take revenge and fight the Imperials in the tranches; however orders came right from \"the top\" for a simple recruiting trip onboard the luxury liner Star of Empire with Rosco Ross; Ors complained to Ross that she didn't need a \"vacation on a space cruiser\" but Ross persuaded her that after her trauma, she would need to cool down with such a mission. She was assigned the Truly Sorry and boarded the Star with Ross, Ris Waller and the droid A-Cee, who brought documentation from the Subjugation of Sulon. As the Haj family were sympathetic to the Alliance, Ors and A-Cee were given a quite comfortable cabin.\nOrs operated with Waller and Ross in an off-limits section of the ship; then Ors again encountered Katarn in the Corellia Room and exchanged looks. Seeing him, she coordinated on the fly his capture with the others: he fell into the hands of Rosco and was shoved into their storeroom. Ors told her comrades that in their previous encounter he had let them live, and despite their scepticism, she decided to repay that debt, for the moment. Katarn however wanted some answers and she agreed to meet again.\nJan waited for Katarn at the library and used the virtual reality service that put her in a ballet, practicing the art she learned from her mother, and Katarn who showed up then, was genuinely impressed. Exchanging some words about their past and upgringing in the cafeteria, Katarn asked why the Rebels killed his father, and gained her interest mentioning the name Sulon, and his surname. Ors brought him to her cabin where A-Cee was; at that moment she had to override A-Cee's mechanism, who was programmed to self-destruct in the presence of an Imperial Officer. She revealed to him that the Empire that he is serving, is actually doing atrocities, and her job as a Rebel agent has to divulge them to the citizens; showing footage from A-Cee's memory, it was revealed to him that his father was actually a Rebel, and proved that the Empire was lying about him. Katarn demanded to know what happened to him and how she died, and she allowed A-Cee to show him the footage of his severed head. Katarn thanked her for showing him the painful truth and before walking away, he removed his decoration; a gesture that Jan never forgot.\nTwo days before their scheduled departure, Jan moved to the liner's hangar to do some maintenance on the Truly Sorry, as its hyperspace motivator displayed false readings. Two hours of a long and boring job of removing a plate, disconnecting and removing the lower motivator housing, the 100-kilos casing dropped into her hands. She realised her mistake for not using a floor jack; for some moments she was unable to move or let it drop, when Katarn showed up, and helped her with gently lowering it to the floor. He then offered to help with her work; Jan already nervous, wanted to chase him away but accepted out of pity; she would work on the wiring harness while Kyle ran the diagnostic checks. Jan couldn't but admire Kyle's knowledge and instinct, quickly determining the problem while she would need hours to determine. She was entering the ship to find a replacement for the damaged sensor package when Kyle finally expressed his desire to join the Alliance, proved by the commitment that Jan read in his eyes. She offered to take him to people who had the authority to recruit him.\nJan never realised that her movements and actions, including her meeting with Katarn, were followed and recorded by a bounty hunter who was making his living on that very ship, and sold this information to an Imperial official. Indeed, soon her sleep was interrupted by a call from Katarn, telling her that someone, perhaps even Governor Dol Donar II himself, who was onboard, knew about them, and they would be caught at any moment. Jan buried her surprise and told him to meet on the hangar deck, as did Ross and Waller. She took A-Cee with her and exited the hatch to a hallway when they were apprehended by the bounty hunter Slyder, Nathan Donar II and Imperial military personnel. Jan returned fire and started running, but A-Cee stayed behind and was shot. Jan managed to reach the airlock; her pursuers opened fire but Rosco covered her, as did Waller from the Sorry's turret, while Kyle, handled the ship. The deck was losing oxygen, as Kyle had forced the Hangar Controller to open the pressure doors, and Jan collapsed. She was picked up by Rosco who managed to move into the ramp, and both were lifted up into the Sorry.\nSoon Jan, still pale, came and sat at the copilot's position. Waller notified her that one ship was after them. She maxed the thrust, and started updating the navcomp with the beacons, as Kyle failed to do so, as the ship was gaining. Although the Sorry was lightly armed, Jan made a tight turn to confront their pursuers, and right when her laser shot hit the larger vessel, it unexpectedly blew up. It was however clearly an internal explosion; they realised that A-Cee was loaded in that ship, and his self-destruct mechanism was activated, killing himself and the Imperials. The Sorry thus made it safely to the New Hope.\nJan Ors met with Mon Mothma and persuaded her to hire Kyle Katarn as a mercenary and commando, going so far as to lie in her reports to give credence to her faith in Katarn's trustworthiness. Jan introduced Kyle to their impressive flagship and led him to their leader, Mon Mothma; Kyle sensed that Jan mentioned her name with filial affection. While Kyle was being interviewed, Jan was spying him through small vid cams; she was surprised that Kyle admitted that his motivation was pure revenge, and that Mothma didn't dismiss him. Needing his assistance, Mothma revealed to him the existence of a massive Imperial battle station whose schematics were located in an Imperial facility on Danuta. During the briefing Kyle recognised an Imperial officer, Meck Odom, on a video, serving on the Facility, but he denied knowing him. After the meeting, she entered Mothma's cabin through a secret hatch and was asked about her opinion; she expressed her worry that the mission seemed like a suicide, and admitted she cared about him, although she refused that they had a relationship; Jan reassured that she would kill him if he betrayed them. Mothma revealed that Katarn lied about Meck, who had been his friend. Jan supported Kyle's honesty mentioned his good deeds, but Mothma pointed out that everything might had been orchestrated by the Empire to put a spy among them. Mothma explained why she chose Kyle instead of Ors: he knew Imperial tactics and would be unnoticeable in an all-male facility; and she admitted that he was expendable, like everyone else.\nThe next days Katarn was preparing for his mission, and Jan had sent him an e-mail with her wishes for good luck, as she claimed to be in another mission. While Kyle equipped his ship, the Moldy Crow, he \"borrowed\" some parts from storerooms and other ships; he thought he went undetected but Jan monitored him, and asked the Dek Master to tolerate his movements.\nWhen Kyle departed for Danuta, Jan took a courier ship piloted by the sassy young pilot Jes; equipped with a bag of energy cells, grenades, knives, plitex, a garrotte, a lock pick, electrobinoculars, and a couple of comlinks  they left with the mission to spy on him and kill him in case he was a double agent. Jes reached the planet within four days, a day before Katarn. Jan immediately hired an appartment facing the Trid spaceport in a lodging facility owned by a seedy-looking Kubazian landlord, and waited for Kyle's arrival. She monitored the passage of at least fifty ships before spotting the Crow, interrupting her half-sleep. She spied on Katarn with her electrobinoculars, recognising her liking of him and considering the objective of her mission and the possibility to execute him if needed. Spying on his check by the local Imperial customs agent, she was impressed by how he improvised and bribed him so as to \"forget\" his face, claiming a hasty schedule, and she decided he would be a great Rebel. Armed with her bags and a wanted portrait of Katarn she stalked him during his recon walk around Trid up to the security zone of the Danuta research facility; Kyle had felt that he was being shadowed and sat in a cafe, and Jan just in time hid her face behind a paper, wondering if he recognised her. After the recon, Kyle returned to the Crow.\nShe had an uneasy sleep in her miserable apartment but once Kyle emerged from the Crow, Jan was forced to follow; she entered an eatery whence Kyle exited and bought a tea for breakfast. Kyle searched and reached a building with a dilapidated door and a strange carving over it, while Jan pretended to be staring into a shop window. She was puzzled about the familiar symbol and the nature of the building, while she bought a sweet roll. Kyle then exited and left, and rather than following him, Jan preferred to enter the building and see what it was; she was surprised and puzzled to find out that it was a temple, and was greeted by an Ortolan monk. She wondered whether Kyle knew he was stalked and tried to disorient her. She started running after him but lost him. Eventually he found him returning to the Crow.\nDespite her hopes, it seemed that Mothma's suspicions were justified, and she followed Katarn into the Blue Moon club where he met Meck Odom, the Imperial Officer Mothma warned her about. She entered the back door, shoving a drunk who lurched towards her, and entered from the restroom. She saw Kyle and Meck sitting in a booth and made for the adjoining one, lying to the hostess that she was expecting a larger company. Trying to spy on their conversation she understood they were setting up something and was convinced that Kyle was up to something suspicious. Jan was ready to assassinate him but she took too long, and Katarn noticed her. He persuaded her that he was not conspiring with Meck, but he was trying to protect him from Mothma, and that was going to help their cause. Regretting her doubts for him, she offered to buy him dinner.\nThey planned to cause an explosion to create a diversion for Kyle while he was inside; for this she made a makeshift bomb with the objects she brought with her, and planted it on the northen fence. Kyle let Jan to pilot the Moldy Crow and land it on the top of the Danuta research facility and pick him up after retrieving the plans for the first Death Star. However when Jan was entering the Crow, she saw the official, holding a paper, shouting at her, and several Stormtroopers running at her. She retracted the ramp before they reached her, and started shooting against the ship while it was starting up. Jan eliminated the soldiers with the ship's belly gun, and then, gaining some height, she shot at the TIE pilots who were running towards the TIE fighters, including one TIE who managed to take off, and the other pursuit ships inscluding X-Ray 291.\nRight then Ors contacted Kyle to notify that she was coming, and wished him to get out safely. Soon after she contacted him again, when Kyle related a strange feeling that guided his movements and helped him kill his adversaries unharmed; Jan said he wasn't a madman, but that the Force was with him, and said that she should be there in three minutes. However Kyle called her, right after his encounter with Keycard, informing that he had the code key; Jan remarked that should Kyle be dead, he should tell her to save her the trouble. He also warned her that they sent armored reinforcements her way. Right then Jan evaded fire from an Imperial walker; Jan ignored Kyle, who warned her that the Crows blasters were not much for its armor, and she should break off; she insisted that she should take the beast out before it destroyed her. During the skirmish the contact was cut.\nAround 22:00 she reached the location of the facility where her bomb had detonated, attracting several forces to investigate; the Crow made short work of the AT-ST and the armored car with Major Horst. She then moved to the roof and picked Kyle up who completed his mission successfully.\nBy that time she became one of the few people Katarn trusted, and also one of the few people he could count on to help him get out of sticky situations; hearing about the massacre on Talay, Katarn requested to Mon Mothma that Ors accompany him for the mission. Ors provided briefings from Alliance Command to Katarn and served as pilot of their ship, in their pivotal missions to thwart the Dark Trooper Project.\nOrs, providing the intelligence for Katarn and guiding him during his missions, traced Moff Rebus based on an Imperial repeater rifle found by Katarn on Talay. She later found out that phrik that Katarn found on Fest originated from the Gromas Mines. Ors flew Katarn to Gromas 16 where he managed to destroy the facility.\nAfter a brief delay, having to drop Katarn to Orinackra in order to free Crix Madine from the prison, Ors was informed that the Dark Trooper project was financed by smugglers and an unidentified kingpin who was no other than Jabba the Hutt. Ors suggested to Katarn that he should put a tracking device on a smuggler ship on Cal-Seti, which led them to Anteevy. There Katarn destroyed the robotics facility.\nOrs investigated flights to and from Gromas 16 and Anteevy and found that they were all led to Nar Shaddaa. Ors thought that there would be found some Imperial Navigational devices or charts that the smugglers hired by the Empire used, which would help Katarn and her find the location of the Arc Hammer.\nDuring his adventures on Nar Shaddaa, Katarn found a nava card but upon leaving, the Crow was captured and both were brought onto the Star Jewel. Ors was held as a bargaining chip against the Alliance by Jabba, until she was again rescued by Katarn, who had to go through many extremes to save her, including defeating a Kell dragon with his bare hands.\nOnce free, Jan Ors realized that only the Imperial Security Operations building in Imperial City hosted a reader that could interpret the nava card Katarn obtained. Jan Ors approached with the Crow in a plaza where she left Katarn. While Katarn managed to reach the ISO building Jan Ors was spotted and attacked by TIE Fighters. A distress call reached Katarn's comlink on his way back and ran to see what happened. Ors was gone when Katarn returned to the place he was landed, instead finding Boba Fett waiting for him. After both Katarn and Ors were finished with their, encounters, Ors approached Katarn and the two left Coruscant.\nJan Ors, based on the output of the nava card, understood that only Executor knew the Arc Hammer's location at each given time since it was making leaps to hyperspace to keep its status secret. The only way to reach the factory was via the Executor which was supplied from Ergo. Ors's final part on the campaign was to leave Katarn on Ergo, and from that point, Katarn single-handedly finished his mission, boarding Executor, the Arc Hammer and putting an end to the Dark Trooper threat.\nAlthough Katarn often worked independently as a mercenary, they often partnered for the Allied cause. Ors couldn't cope with Katarn's inability to work as part of a team, usually trying to save him whenever he got himself into trouble; she often found him in the midst of disaster, only to hear, instead of thanks, that she shouldn't worry about him in the first place.\nIn 5 ABY Katarn was invited for some obscure business on Nar Shaddaa; Ors tried to persuade him off, but when Kyle seemed he would mind his own business, he left the Rebel headquarters and went alone without any notice. Ors took the Crow and felt again obliged to follow his trail to the Smuggler's Moon and rescue him if needed, as usual.\nIndeed, following traces and TIEs gathering somewhere, she struggled her way among the Vertical City's narrow \"canyons\" of building spires, and was harassed by a trio of TIEs for flying too slow; Ors defiantly refused to say her registration, reminding the TIE pilot that they had no jurisdiction on the moon; ignoring his threats, she followed LG3-18 to a public landing platform. Right then she found Kyle nearby, with a TIE Bomber aiming at him, but Jan shot the Crow{{{'}}}s cannons, striking it form behind. Kyle refused to be rescued, as he needed to retrieve some \"disk\" as he said, and asked instead to meet later at the top deck.\nJan complied and moved away to intercept more coming ships. After a long pursuit by a pair of TIEs among the city's spires, she used a building still in construction to hide the Crow to lose them, but when they returned, she took advantage of her hideout to ambush and surprise the TIEs. Jan reached a platform waiting for Kyle but because of the high fees, and the arrival of other ships, she had to leave; for the following three hours she returned attempting to spot Kyle and in vain to contact him over the radio. When she was again approaching the platform she spotted lights; Jan used the scanners to determine that several beings, some dead, around a human. Seeing a concussion grenade exploding she moved on, activating the Crow's weapons. The Crow evaded the shots from the bounty hunters and returned fire, killing them. Armed with two blasters, Ors exited and approached Kyle, determining that he was still alive. She dragged him from the armpits up the ramp, and secured him in one of the ship's bunks.\nOrs brought Katarn to the Mercy in the Alliance fleet above Milagro and visited the New Hope. She managed, with the help of Xiong Wong and Wires to decrypt the holodisc, playing it back in very bad quality to Luke Skywalker, Leia Organa, and Mon Mothma. Following Skywalker's advice, she never told Katarn that she knew the content of the holodisc. Katarn and Ors then set off to the Katarn homestead on Sulon to find a way of decrypting the disc and learning more of Morgan Katarn's killers.\nOrs and Katarn's relationship continued to deepen, but Ors feared allowing Katarn to get too close. This changed as she accompanied Katarn on their quest for the Valley of the Jedi on Ruusan, where she was captured by the Dark Jedi Jerec. Jerec asked Katarn  to execute her. He refused, defeating Jerec and sealing the Valley. Ors and Katarn then declared their love for one another. She later continued to turn down Katarn's proposals of marriage, however, not wanting to get married simply because of the fear that each day could be their last.\nOn Mon Mothma's recommendation, Ors joined Admiral Hiram Drayson's secret Alpha Blue organization. There, she helped expose the Yevethans and kept tabs on the Order of the Canted Circle, the Azurite Society of Lords, and Grand Admiral Octavian Grant, who was allegedly retired on Rathalay. She also accompanied Katarn, who had returned to his mercenary ways after slipping to the dark side on Dromund Kaas, on a number of off-the-record missions against the Imperial Remnant in their new ship, the Raven's Claw.\nWhile following up a lead on the Reborn, a deadly Dark Jedi force of the Empire Reborn faction, Ors was captured by a failed student of Luke Skywalker's Jedi Praxeum, Desann, and his apprentice Tavion Axmis. They pretended to kill her, and Katarn heard the lightsaber sound without being able to help her. Grieved by her apparent loss, he returned to the Valley of the Jedi to regain his Jedi powers, allowing Desann to find the Valley's location and use its powers to fuel the Reborn. It was only much later that Axmis confessed to Katarn that they only feigned Ors' execution, and the couple was ultimately reunited before Desann met his doom.\nEventually, Admiral Drayson retired, and Ors took over Alpha Blue just before the Yuuzhan Vong War. In the desperate circumstances the invasion engendered, Ors looked back to her terrorist roots and, with the help of the Chiss, Lurrian genetic engineers, and others, concocted the genocidal bioagent Alpha Red. Fortunately, the invasion was halted before Alpha Red had to be put to widespread use.\nIn addition to her work with intelligence, Ors still performed some field missions during the war. On one such occasion on Ord Sedra, Ors and Katarn teamed up with a local Imperial stormtrooper unit under the command of Lieutenant Pallin. A force of Yuuzhan Vong warriors and Peace Brigadiers had captured an entire village and taken them as slaves. While being transported, Katarn infiltrated them, while Ors and Pallin orchestrated an ambush of the patrol. The ambush was successful and resulted in the freeing of the slaves and the capture of the enemy forces which were left under the guard of the Imperial troops. They proved unable to contain them, however, and in her rush to aid them, Ors was captured by the Yuuzhan Vong. Only the timely arrival of Katarn saved her life. After that, Katarn asked her to marry him, but she refused.\nFollowing the end of the invasion, Katarn disappeared while investigating rumors of Sith activity. Ors, along with Katarn's former apprentice Jaden Korr, used every free moment to track him down. Eventually, she teamed up with Jedi Master Mara Jade Skywalker in forming an elite team of Alpha Blue agents and Jedi Knights to find him. The trail led to the Cloak of the Sith, where the cyborg Jedi Daye Azur-Jamin held Katarn captive. Katarn was freed and Azur-Jamin, redeemed from the dark side of the Force, revealed the existence of a Force-strong female Yuuzhan Vong.\nOne of the first traits of her personality displayed, was her tendency to do things by herself, without asking others for help, something that her mother noticed when Jan was already four. Growing up within the two separate arts of her parents, engineering and dance, she practiced both; for her both principles expressed the same impulse or need for her: to generate motion. The process of working on  machines was for her a kinesthetic experience.\nJan Ors was a brave woman. Even from a young age she would not let the Empire intimidate her into submission. As an Intelligence officer she was thorough, and had a plan every step of the way for her double agent operations. Indeed, when Katarn saw her eyes, obviously connected through the Force, was calmness and determination, having experienced fear, responsibilities and also disasters. In the same time, her pure artistic talent as inherited by her mother, was an essential part of her nature.\nWhen she worked with Katarn, Ors' detailed oriented nature and ability to gather intelligence greatly aided Katarn on his missions, although they came into conflict on occasion due to Katarn's more chaotic, straightforward approach. Despite their differences, they maintained a friendly and playful relationship, and Ors was quick to crack a joke or sarcastic remark at Katarn's expense.\nShe was extremely dedicated to both the Rebellion and the New Republic being one of their first members and continuing to serve for over thirty years. Although she had caused deaths in the trenches, she never had to assassinate an unarmed person from behind, especially someone she knew, and her loyalty came to test when she thought that Katarn was a double agent, back on Trid; the thought made her wonder whether she was really a patriot or a fanatic, but nonetheless her hesitation allowed for Kyle to notice and stop her. She was also very loyal to her friends willing to face extreme danger in order to help Katarn on his personal mission.\nJan Ors was created as a supporting character for the game Star Wars: Dark Forces, and reappeared in its sequels, excluding Star Wars: Jedi Knight: Jedi Academy . Jedi Knight comes with an alternate ending where Kyle Katarn fell to the dark side and, when prompted by Jerec, killed Ors. The light side ending has been deemed by Lucasfilm Ltd. to be the canonical ending, and is reflected in later products.\nThe Dark Forces Saga, Part 2: Unsung Heroes of the Light retconned her into the same character as Cracken's Rebel Operatives mysterious Jan Strange, who was created four years before Dark Forces.\nIn Star Wars: Dark Forces, Jan Ors is voiced by Julie Eccles, who also plays Ru Murleen in Star Wars: Rebel Assault II. She appears only in stills. In Star Wars: Jedi Knight: Dark Forces II, she is played by model Angela Harry, whose likeness has been used in subsequent portrayals of Ors. In Star Wars: Jedi Knight II: Jedi Outcast, she is voiced by Vanessa Marshall. In the Dark Forces audio dramatizations she is portrayed by actress and comedian Mo Collins, best known for her work on MADtv.\nJan Ors is also a playable character in the multi-player modes of all of the games in the Jedi Knight series. It is interesting to note that the unused female Jedi model in Jedi Outcast is just a jacketless Ors with a lightsaber and Force powers. Though it does not appear in the main game, it is accessible using the cheat \"npc spawn jedif\". In addition, Jan, like almost every non-Force user in the Jedi Knight series, can utilize the lightsaber as a primary melee weapon if she is called to a multiplayer game as CPU-controlled bot.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Jan_(disambiguation)",
  "/wiki/Alderaan/Legends",
  "/wiki/24_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Justice_Action_Network",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Kyle_Katarn",
  "/wiki/Alpha_Blue",
  "/wiki/Hiram_Drayson",
  "/wiki/Yuuzhan_Vong",
  "/wiki/The_Force/Legends",
  "/wiki/Earnst_Kamiel",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/File:Jan_Strange.jpg",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Cadet/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Nebula_Award",
  "/wiki/File:ContentOldMan-JKDF2.ogg",
  "/wiki/1_BBY/Legends",
  "/wiki/Fuel/Legends",
  "/wiki/Slug/Legends",
  "/wiki/Oulanne/Legends",
  "/wiki/Pellezara_station",
  "/wiki/Duro_system",
  "/wiki/Freighter/Legends",
  "/wiki/Tarrin_Datch",
  "/wiki/Datch_family",
  "/wiki/Gravity_disk",
  "/wiki/Hand",
  "/wiki/Pilot/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Gamma-class_assault_shuttle/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Relay_station",
  "/wiki/Asteroid/Legends",
  "/wiki/AX-456",
  "/wiki/File:JanOrs1_DFSftE.jpg",
  "/wiki/Battle_of_AX-456",
  "/wiki/Luxury_liner/Legends",
  "/wiki/Star_of_Empire",
  "/wiki/Rosco_Ross",
  "/wiki/Space_cruiser",
  "/wiki/Truly_Sorry",
  "/wiki/Ris_Waller",
  "/wiki/A-Cee",
  "/wiki/Subjugation_of_Sulon",
  "/wiki/Haj_family",
  "/wiki/Corellia_Room",
  "/wiki/Virtual_reality",
  "/wiki/Morgan_Katarn",
  "/wiki/Sulon",
  "/wiki/Standard_day/Legends",
  "/wiki/Hyperdrive_motivator/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Dol_Donar_II",
  "/wiki/Slyder",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Oxygen/Legends",
  "/wiki/Dol_Donar%27s_yacht",
  "/wiki/Navcomp",
  "/wiki/Hyperspace_beacon/Legends",
  "/wiki/Laser/Legends",
  "/wiki/New_Hope",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Commando/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Chief_of_State_(Alliance)",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/Danuta",
  "/wiki/Meck_Odom",
  "/wiki/Mission_to_Danuta",
  "/wiki/E-mail",
  "/wiki/Moldy_Crow/Legends",
  "/wiki/Deck_Master_(New_Hope)",
  "/wiki/Courier/Legends",
  "/wiki/Jes_(courier)",
  "/wiki/Trid_spaceport",
  "/wiki/Kubazian_landlord",
  "/wiki/Electrobinoculars/Legends",
  "/wiki/Danuta_research_facility",
  "/wiki/Cafe",
  "/wiki/File:Jan_Ors_-_Rebellion_Era_Campaign_Guide.jpg",
  "/wiki/Tea/Legends",
  "/wiki/Ortolan/Legends",
  "/wiki/Blue_Moon",
  "/wiki/TIE_pilot",
  "/wiki/X-Ray_291",
  "/wiki/Standard_minute/Legends",
  "/wiki/Horst_(Keycard)",
  "/wiki/Walker/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Major/Legends",
  "/wiki/Horst",
  "/wiki/File:Jan_Ors.png",
  "/wiki/Attack_on_Tak_Base",
  "/wiki/Talay/Legends",
  "/wiki/Mission_to_Talay",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Dark_Trooper_Project",
  "/wiki/Moff/Legends",
  "/wiki/Rebus_(Galactic_Empire)",
  "/wiki/Imperial_repeater_rifle",
  "/wiki/Phrik/Legends",
  "/wiki/Mission_to_Fest_(Galactic_Civil_War)",
  "/wiki/Fest/Legends",
  "/wiki/Gromas_Mines",
  "/wiki/Gromas_16",
  "/wiki/Mission_to_Gromas",
  "/wiki/Orinackra",
  "/wiki/Mission_to_Orinackra",
  "/wiki/Crix_Madine/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Cal-Seti/Legends",
  "/wiki/Anteevy/Legends",
  "/wiki/Mission_to_Anteevy",
  "/wiki/Imperial_Robotics_Construction_Facility_Ice_Station_Beta",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Arc_Hammer",
  "/wiki/Mission_to_Nar_Shaddaa_(Dark_Trooper_campaign)",
  "/wiki/Nava_card",
  "/wiki/Star_Jewel/Legends",
  "/wiki/Kell_dragon/Legends",
  "/wiki/Imperial_Security_Operations",
  "/wiki/Galactic_City",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Fuel_Station_Ergo/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(5_ABY)",
  "/wiki/LG3-18",
  "/wiki/TIE/sa_bomber/Legends",
  "/wiki/Holodisk",
  "/wiki/Concussion_grenade/Legends",
  "/wiki/Mercy_(hospital_ship)",
  "/wiki/Milagro/Legends",
  "/wiki/Xiong_Wong",
  "/wiki/Wires",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Katarn_homestead",
  "/wiki/File:Janandboc.jpg",
  "/wiki/Seven_Dark_Jedi",
  "/wiki/Valley_of_the_Jedi",
  "/wiki/Ruusan/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Jerec_(Inquisitor)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/File:Jantavion.jpg",
  "/wiki/Admiral/Legends",
  "/wiki/Yevetha",
  "/wiki/Order_of_the_Canted_Circle",
  "/wiki/Azurite_Society_of_Lords",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Octavian_Grant",
  "/wiki/Rathalay",
  "/wiki/Dromund_Kaas",
  "/wiki/Imperial_Remnant",
  "/wiki/Raven%27s_Claw",
  "/wiki/Reborn",
  "/wiki/Empire_Reborn",
  "/wiki/Jedi_Praxeum",
  "/wiki/Desann",
  "/wiki/Tavion_Axmis",
  "/wiki/Lightsaber/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Chiss/Legends",
  "/wiki/Lurrian",
  "/wiki/Alpha_Red_(pathogen)",
  "/wiki/File:Jan_Ors_tales.jpg",
  "/wiki/Ord_Sedra",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Pallin",
  "/wiki/Warrior_caste",
  "/wiki/Peace_Brigade",
  "/wiki/Sith/Legends",
  "/wiki/Jaden_Korr",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/The_Cloak_of_the_Sith",
  "/wiki/Cyborg/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Daye_Azur-Jamin",
  "/wiki/Vongerella",
  "/wiki/File:Kylejan.jpg",
  "/wiki/File:Jan_Ors_DFII_concept_art.jpg",
  "/wiki/Star_Wars:_Dark_Forces",
  "/wiki/Star_Wars:_Jedi_Knight:_Jedi_Academy",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Canon",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Julie_Eccles",
  "/wiki/Ru_Murleen",
  "/wiki/Star_Wars:_Rebel_Assault_II:_The_Hidden_Empire",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/Angela_Harry",
  "/wiki/Star_Wars:_Jedi_Knight_II:_Jedi_Outcast",
  "/wiki/Vanessa_Marshall",
  "/wiki/Force_power/Legends",
  "/wiki/File:Jan_ors.jpg",
  "/wiki/Mission_to_Kejim",
  "/wiki/Kejim",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire_audio_drama",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Dark_Forces:_Rebel_Agent",
  "/wiki/Dark_Forces:_Rebel_Agent_audio_drama",
  "/wiki/Dark_Forces:_Jedi_Knight",
  "/wiki/Dark_Forces:_Jedi_Knight_audio_drama",
  "/wiki/N.R.I._Reports",
  "/wiki/Star_Wars:_Jedi_Knight_II:_Jedi_Outcast_demo",
  "/wiki/Equals_%26_Opposites",
  "/wiki/Star_Wars_Tales_21",
  "/wiki/Category:Audio_files_of_Jan_Ors",
  "/wiki/Category:Images_of_Jan_Ors",
  "/wiki/File:JanOrsSWG.jpg",
  "/wiki/Retcon",
  "/wiki/Dark_Forces_Manual:_Coded_Transmissions",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Building_a_Better_Jedi:_Justin_Chin_on_Dark_Forces_II",
  "/wiki/Star_Wars_Insider_31",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Jedi_Knight_II:_Jedi_Outcast_(article)",
  "/wiki/Star_Wars_Gamer_9",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/Wizards.com",
  "/wiki/Kyle_Katarn%27s_Tale",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_124",
  "/wiki/The_Official_Star_Wars_Fact_File_140",
  "/wiki/Star_Wars:_Empire_at_War:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars:_Empire_at_War:_Forces_of_Corruption_Expansion:_Prima_Official_Game_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Rebellion_Era_Campaign_Guide",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_30",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Game_On!",
  "/wiki/Star_Wars_Insider_135",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/HWK-290_Expansion_Pack",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_146",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/Heroes_and_Legends",
  "/wiki/Rebel_Aces_Expansion_Pack",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Rebel_Alliance_Conversion_Kit",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Who%27s_Who:_Imperial_Grand_Admirals",
  "/wiki/Star_Wars:_Jedi_Knight:_Mysteries_of_the_Sith",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/0_BBY/Legends",
  "/wiki/29_BBY/Legends"
 ]
}