{
 "name": "Jana_Lorso",
 "display_name": "Jana Lorso",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Czerka Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Jana Lorso was a female Mirialan Czerka Corporation executive who worked for the Telos IV Citadel Station Czerka branch during the Jedi Civil War. In 3951 BBY, Lorso oversaw Czerka's involvement in the Telosian Restoration Project after Saul Karath bombarded the planet. She was highly disliked by her own employees and the mercenaries that she hired for protection of her office, which eventually led to one of them giving up credentials to the Ithorians on the station so they could steal B-4D4-GE3.\nLorso's interference with the Telos project was not looked upon kindly by the Ithorians who ran the project. Initially, Lorso contacted Meetra Surik shortly after she arrived on Citadel Station, requesting a meeting to discuss a job opportunity. After meeting with Lorso, Surik rejected Lorso's offer, and instead decided to work for the Ithorians. The Ithorian leader, Chodo Habat, hired Surik to deal with Czerka three times. The first time, Surik dealt with Czerka mercenaries inside the docking bay, securing an information droid to replace one that had mysteriously vanished. The second time, she stole B-4D4 and essential Czerka documents from the mainframe, right under Lorso's nose. Finally, Surik and her companions helped the Ithorians when Lorso sent her mercenaries to invade the Ithorian compound.\nLorso would also be responsible for the luring in of three bounties. One was a man named Batono, a former Czerka employee who wanted to expose her and Czerka's crimes to the Telosian Council, though Lorso threatened to silence him if he spoke. When she told Surik that he spent time with the Ithorians, Surik brought Batono in to the station authorities. Batono helped expose Lorso and Czerka's crimes. Before Batono was brought in, she hired two wanted fugitives—a Devaronian and a Rodian—to the surface of Telos where Surik would confront and kill them later when she was forced to the surface in search of the Ebon Hawk. After Surik left the station finally, Lorso and Czerka were forced to leave as well.\nOn a lighter note, her employees on Citadel Station, imply that she was sending some of her supplies to Dantooine, to fund Azkul's mercenaries, with their Exchange allies, in order to take down the local government. This changed in 3951 BBY, when Azkul's mercenaries were defeated at the Battle of Khoonda and the local Exchange thugs and the local Czerka employees, were driven off the planet, in the aftermath of the battle.\nShe was voiced by Elizabeth Conboy.\nThe Exile can side with Czerka and Jana Lorso if the player wishes to play on a darker path. This alternate story includes missions for Jana Lorso, such as stealing the Ithorians' protocol droid and rescuing Lorso from her own mercenaries.\nLater in the game's \"dark side\" path, Lorso was supposed to take control of the station thanks to Surik's actions on the station and Onderon. Time constraints forced Obsidian to remove this event from the game.\nIn other cut content, during the attack on Telos by Darth Nihilus, Lorso was supposed to panic and flee from Sith troopers, only to be gunned down by a defense turret.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Jana_Lorso",
  "/wiki/Mirialan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Telos_IV",
  "/wiki/Citadel_Station",
  "/wiki/Jedi_Civil_War",
  "/wiki/3951_BBY",
  "/wiki/Telosian_Restoration_Project",
  "/wiki/Saul_Karath",
  "/wiki/Mercenary/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/B-4D4-GE3",
  "/wiki/Meetra_Surik",
  "/wiki/Chodo_Habat",
  "/wiki/Skirmishes_on_Citadel_Station",
  "/wiki/G0-T0",
  "/wiki/Skirmish_in_the_Ithorian_Compound",
  "/wiki/Batono",
  "/wiki/Telosian_Council",
  "/wiki/Devaronian/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Skirmish_on_Telos",
  "/wiki/Ebon_Hawk",
  "/wiki/Dantooine/Legends",
  "/wiki/Azkul",
  "/wiki/Azkul%27s_mercenaries",
  "/wiki/Exchange",
  "/wiki/Khoonda",
  "/wiki/Battle_of_Khoonda",
  "/wiki/Elizabeth_Conboy",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Onderon/Legends",
  "/wiki/Darth_Nihilus",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}