{
 "name": "Janard",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mandalore"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 BBY",
      "Quila"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Academy of Mandalore",
      "Imperial Academy of Mandalore"
     ]
    }
   ]
  }
 ],
 "content": "Janard was a male human who lived on Mandalore during the Age of the Empire.\nDuring the reign of the Galactic Empire, he once saw a cadet attempting to desert the local Imperial Academy, and he turned them in. However, after hearing the horrible choices Imperial cadets were forced to make, Janard decided never to repeat that mistake. Consequently, he helped the next fleeing cadet he saw, a girl named Sabine Wren. While Imperials pursued her, Janard knocked over a pack of freight containers to block their path, allowing Wren to escape. Thanks to that, the two became friends. Even after Wren joined the Spectres, a group of anti-Empire insurgents, Janard would sometimes give her intelligence on Imperial activity in the years that followed.\nAt some point in the fourth year before the Battle of Yavin, Janard was captured by the Imperials, who kept him prisoner aboard a Gozanti-class cruiser. However, the cruiser crashed in the waters of the planet Quila. While the ship sank, most of the Imperials on board were killed by monster eels, but Janard managed to take shelter in the front section of the vessel, the last part that would go underwater. Despite his efforts, Janard ended up being cornered by two surviving Imperial stormtroopers.\nFortunately for him, that moment coincided with the arrival of Sabine Wren and Ahsoka Tano, a former Jedi Padawan, who had received the ship's distress call and had come to rescue him. As Janvard, Wren and Tano were about the embark the Spectres' starship, the Ghost, the commander of the sunken Gozanti made a sudden reappearance, announcing that an Imperial evac ship had arrived. While the Ghost got rid of the evac ship, Janard and his saviors fought the commander and his two soldiers. When it seemed that the Imperials were defeated, the rebels prepared to leave the sinking Gozanti and board the Ghost. However, a wounded stormtrooper still managed to shoot Janard in the back. The man died in the arms of his friend Sabine, expressing deep remorse for having turned in a cadet once, and encouraging the rebels to keep fighting.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mandalore",
  "/wiki/4_BBY",
  "/wiki/Quila",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Academy_of_Mandalore",
  "/wiki/Imperial_Era",
  "/wiki/Cadet",
  "/wiki/Imperial_Academy",
  "/wiki/Imperial_cadet",
  "/wiki/Sabine_Wren",
  "/wiki/Spectres",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Prisoner",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Water",
  "/wiki/Planet",
  "/wiki/Eel",
  "/wiki/Stormtrooper",
  "/wiki/Mission_to_rescue_Janard",
  "/wiki/Ahsoka_Tano",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Distress_signal",
  "/wiki/Ghost",
  "/wiki/Commander",
  "/wiki/Death",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/Ocean_Rescue",
  "/wiki/Star_Wars_Rebels_Magazine_12"
 ]
}