{
 "name": "Jana_T%27bayr",
 "display_name": "Jana T'bayr",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Bluish green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "GeneTech Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "Jana T'bayr was a Human female scientist who lived on Talus during the time of the Galactic Civil War.\nAfter the Battle of Yavin, Jana T'bayr worked for the GeneTech Syndicate in a laboratory located outside the city of Dearic. The lab was listed towards Talusian authorities as engaging in legitimate genetic manipulation on animals. In fact, Jana T'bayr was involved in the the Parasophic Arachne program, an illegal and dangerous bioengineering project conducted by the GeneTech Syndicate. The objective of the program was to create an intelligent and powerful form of arachnes for the use of the Galactic Empire. The project was led by Doctor Vigh, the chief scientist of the GeneTech Syndicate. The Parasophic Arachne program could be considered as a success since the GeneTech Syndicate scientists eventually managed to create deadly and intelligent creatures. Jana T'bayr was involved in the development of the queen's mate, the largest and strongest arachne of the Parasophic Arachne program.\nHowever, In 1 ABY, the bioengineered arachnes had become so smart and ferocious that they finally managed to overwhelm their creators and slaughtered most of the staff of the lab. All the surviving scientists quickly fled to avoid being arrested and charged with illegal biological experiments. Jana T'bayr was the sole scientist to stay behind and remain in the lab. She initially wanted to save the project but she then realized that she had to find a way to prevent the parasophic arachnes from destroying the planet Talus.\nWhen the CorSec finally became aware of what was happening in the GeneTech Syndicate Lab, Agent Taarna dispatched a CorSec crew to clean the lab. The CorSec targeted the arachne queen, the arachne responsible for breeding the parasophic arachnes, and the arachne eggs in order to prevent the spread of the species. The CorSec forces also met Jana T'bayr who warned them about the queen's mate. This powerful arachne, entirely devoted to combat, was designed with adaptive biology. If the queen's mate was the only arachne left, he could morph into a breeder and could repopulate the species by himself. A group of spacers therefore found the creature the lab and, after an intense fight, managed to kill the dreadful creature. The CorSec thought that the destruction of all the breeding arachnes and eggs definitively eliminated the Parasophic Arachne threat. However, Jana T'bayr had managed to save a brood egg from the arachne queen. This egg was still alive but dormant, with the potential to restart the entire project. The scientist eventually gave the egg to one of the spacers who destroyed the queen's mate because she did not want neither to keep it nor to destroy it.\nJana T'bayr was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Jana T'bayr was added to the game as part of the \"Deifying Decisions\" arc with the release of \"Chapter 2: The Talus Incident\", on August 1, 2006.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/GeneTech_Syndicate",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Talus/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/GeneTech_Syndicate_Lab",
  "/wiki/Dearic/Legends",
  "/wiki/Parasophic_Arachne",
  "/wiki/Bioengineering/Legends",
  "/wiki/Arachne",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Vigh",
  "/wiki/Chief_Scientist",
  "/wiki/1_ABY/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Agent/Legends",
  "/wiki/Taarna",
  "/wiki/Egg/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_1",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Galactic_Hunters",
  "/wiki/Template:SWGTCG",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}