{
 "name": "Janis_Pol",
 "display_name": "Janis Pol",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alderaan Flotilla"
     ]
    }
   ]
  }
 ],
 "content": "Janis Pol was an elderly, human female who served as a diplomat on board the Alderaan Flotilla, a group of starships carrying the surviving natives of her homeworld Alderaan. In the year 5 ABY, she was part of a meeting on board the flotilla Alderaanian escort frigate Sunspire to discuss the future of the flotilla and witnessed the delivery of the Death Star superweapon's remains by the New Republic to the Alderaanians.\nJanis Pol was a female human from the planet Alderaan who survived the destruction of her homeworld by the Galactic Empire's Death Star superweapon in the year 0 BBY. Following the loss of her homeworld, Pol at some point joined up with the Alderaan Flotilla, a group of starships carrying surviving Alderaanians that had been initially established by Princess Leia Organa and the Rebel pilot Evaan Verlaine.\nIn the year 5 ABY, Pol was serving as a diplomat on the flotilla, which was floating amongst the remains of Alderaan in the Alderaan system. She attended a meeting with the Regent Administrator Eglyn Valmor on board the Alderaanian frigate Sunspire where they and several other leading members of the flotilla discussed their people's future. Valmor wished to remain in the Alderaan system, but Pol and others like the former teacher Icar Orliss wished for the surviving Alderaanians to re-settle a new world. When Orliss produced a list of suitable planets they might choose from, Argus Tanzer interjected, arguing that re-settling a new world was not as simple as picking from a list, since they would need to follow the process put in place by the New Republic. Orliss and Pol both then argued that they were not part of the Republic and so need not follow the government's rules.\nThe arguing within the meeting continued until it was interrupted by reports of several large vessels approaching the flotilla. Pol and the others were then shocked to see a number of New Republic vessels hauling the remains of the Death Star toward the flotilla, which fellow flotilla member Teven Gale then revealed he had worked with Organa and Verlaine to acquire for the flotilla as a resource. Valmor and Gale then suggested building a new space station from the superweapon's remains, and Pol accepted the idea but stated that they still needed representation in the New Republic Senate and that resettlement was still on the table for discussion.\nJanis Pol was a small, elderly woman by 5 ABY, and was as sharp and pale as a broken tooth. She steepled her fingers and stared at the others over them during the meeting.\nJanis Pol first appeared in the novel Aftermath: Life Debt, which was written by Chuck Wendig and released released on July 12, 2016.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Alderaan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Alderaan_Flotilla",
  "/wiki/Diplomat",
  "/wiki/Starship",
  "/wiki/Homeworld",
  "/wiki/Standard_year",
  "/wiki/5_ABY",
  "/wiki/Alderaanian_escort_frigate",
  "/wiki/Sunspire",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/New_Republic",
  "/wiki/Planet",
  "/wiki/The_Disaster",
  "/wiki/Galactic_Empire",
  "/wiki/0_BBY",
  "/wiki/Alderaanian",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Rebel_pilot",
  "/wiki/Evaan_Verlaine",
  "/wiki/Flotilla",
  "/wiki/Alderaanian_Graveyard",
  "/wiki/Alderaan_system",
  "/wiki/Regent_Administrator",
  "/wiki/Eglyn_Valmor",
  "/wiki/Frigate",
  "/wiki/Star_system",
  "/wiki/Teacher",
  "/wiki/Icar_Orliss",
  "/wiki/Argus_Tanzer",
  "/wiki/Teven_Gale",
  "/wiki/Space_station",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Tooth",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Chuck_Wendig",
  "/wiki/July_12",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall"
 ]
}