{
 "name": "Jannik  (Human)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jannik was a Human male who served as an Ambassador of the Galactic Republic during the Galactic War.\nDuring the Galactic War, Jannik was the Republic ambassador to the Voss. His efforts to secure an alliance with the Voss were difficult at best, mostly due to the smooth charm of the Imperial emissary, Lord Beldiss.\nA Republic hero later arrived on the planet Voss to assist Jannik in his diplomatic endeavors. Jannik assigned the strike team to expose Beldiss for the evil Sith Lord he was by hacking defunct Voss comm relays which he used to communicate with his spies in Voss-Ka. After the hero completed their mission, Beldiss called on their actions, though the Voss saw no harm, as no Voss was injured.\nKnowing that Beldiss would move to eliminate his spies, Jannik assigned the strike team to rescue an Imperial Intelligence agent Malcom Terrax and offer him amnesty. Once the hero managed to rescue the spy, Jannik discovered that Beldiss had been recruiting failed Voss Mystics to become Sith. He sent the hero into a Voss ruins in search of Beldiss, but the Sith Lord invited the hero to his location himself instead. However, when his Voss acolytes considered joining the Jedi, Beldiss showed his true colors and lashed out at the hero, only to be defeated and killed.\nLater, when the hero returned to base, Jannik was receiving worry from a Jedi Master Delsa who believed that the Voss acolytes were too dangerous to train and underestimate the dangers of the dark side. After the Jedi signed off, a Voss emissary Laryn-Ki arrived to announce that the hero has been foreseen to end the threat of the Gormak.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Galactic_War",
  "/wiki/Voss_(species)",
  "/wiki/Beldiss",
  "/wiki/Voss",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Voss-Ka",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Malcom_Terrax",
  "/wiki/Voss_Mystics",
  "/wiki/Sith/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Delsa",
  "/wiki/Laryn-Ki",
  "/wiki/Gormak/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}