{
 "name": "Jannah",
 "display_name": "Jannah",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Between 12 ABY–15 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.68 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "Resistance",
      "Company 77",
      "Company 77"
     ]
    }
   ]
  }
 ],
 "content": "Jannah, formerly known as TZ-1719, was a human female and former First Order stormtrooper who lived on Kef Bir after deserting. She was a freedom fighter who, by the time of the First Order-Resistance War, led a tribe of warriors on the ocean moon. Sometime later she became an ally of the Resistance. She used an energy bow. Finn was pleasantly surprised by her story, as prior to meeting her he was unaware that there were others like him who had defected from the First Order. Jannah and her crew assisted Finn and the Resistance in taking down the Sith Eternal's fleet, the Final Order, during the Battle of Exegol.\nAt some point, Jannah was taken from her family at a young age by the First Order and trained by Captain Phasma where she developed skills in archery.\nDuring the Battle of Ansett Island, Jannah and her crew of stormtroopers were ordered to shoot civilians. However, Jannah and her crew refused and defected from the First Order and exiled themselves on the planet Kef Bir.\nIn 35 ABY, Resistance operatives Rey, Finn, Poe Dameron, Chewbacca, BB-8, C-3PO, and D-O arrived on Kef Bir in search of the Emperor's wayfinder. Being informed by Babu Frik about their mission, Jannah agreed to help them. Jannah helped Finn and Dameron fixed the badly-crashed Millennium Falcon. While fixing the Falcon, Jannah handed Finn a gadget which Finn recognized as a piece used by the First Order. Realizing that he had a history with the First Order, Jannah revealed she and her whole crew were once stormtroopers who refused to fire on civilians much like what Finn did during the Attack on Tuanul. Jannah explained how it didn't even feel like a decision but more like an instinct to which Finn replied that it was the Force the probably brought him to her. Shocked by this, Jannah said that Finn said this like it is real to which he replied it is. Just then BB-8 interrupted them and told them that Rey was not with them. Leaving the Falcon, Finn realized in horror that Rey had impatiently took one of the sea skiffs and headed to the ruins of the second Death Star. Seeing the danger, Jannah offered Finn another sea skiff to help Rey. Using the sea skiff, Jannah and Finn explored the corridors of the wreckage in search of Rey. Hearing lightsabers clash, they ran out to trench and saw her fighting Supreme Leader Kylo Ren. Trying to interfere, Finn called out her name but was pushed back by the Force. As Finn tried to interfere again, Jannah told him that they couldn't follow them.\nStranded on the ruins, Finn called Poe and told them to come rescue them. Jannah along with Company 77 boarded the Millennium Falcon and flew back to the Resistance base on Ajan Kloss where they learned of Leia's passing. Poe was named General of Resistance. Just then, they were informed that Kijimi had been completely destroyed by the Sith Eternal. With some advice from Lando Calrissian and Finn as his co-general, Poe devised a plan to take out the Xyston-class Star Destroyers of the Final Order. As Lando and Chewbacca used the Falcon rallied up any free worlds to help aid them, Jannah and her crew gathered up their orbaks and boarded the Fortitude and headed to Exegol thanks to Rey using Kylo Ren's wayfinder to transmit the map to the Resistance.\nArriving on Exegol, the Resistance was immediately attacked by the Sith Eternal forces. While the Exegol air team tried to protect the ground team, the fleet's navigation tower suddenly switched off. Knowing that the disabling the tower was the only way to prevent the Sith Star Destroyers from leaving Exegol, the Resistance opted retreat. However, Finn sensed from the Force that the navigation signal was coming from the Resurgent-class Star Destroyer Steadfast. Jannah asked how he knew to which Finn replied a \"feeling\". Landing on the hull of the ship, Jannah, Finn, and the rest of the Resistance team used the orbaks to ride across the ship as they were confronted by Sith troopers. Jannah threw and detonator to distract the troopers and gave them enough time for BB-8 to open the hatch, during which she shot down a Sith Jetpack Trooper. When BB-8 got the hatch open, they threw down a bandolier of grenades which destroyed the hatch and temporarily shut down the navigation signal.\nWhen everybody was retreating, Finn realized that the Sith Eternal was planning on rebooting the system. He decided to stay and destroy the Resurgent Star Destroyer. Jannah chose to stay with him and help him destroy it. Turning one of the destroyer's turbolasers on its bridge, Jannah and Finn witnessed the arrival of a Citizens' Fleet from across the galaxy commanded by Lando to help them, the arrival caused a great turn of tide in the battle. However, down below in the Sith Citadel, Darth Sidious, now fully revived by absorbing Rey and Ben Solo's Force dyad, used a vast amount of Force lightning at the fleet, temporarily disabling them. Rey, guided by the spirit of past Jedi, used both the Skywalker lightsaber and Leia's lightsaber to destroy the Sith Lord. With Sidious dead and the Force lightning stopped, Jannah and Finn were able to use the turbolaser to destroy the command ship, killing Enric Pryde. The Steadfast began falling toward the surface with Jannah and Finn still on it, but they were saved by Lando and Chewbacca onboard the Millennium Falcon. With the Sith fleet destroyed and Sidious dead, the Resistance and their civilian fleet won the battle and retreated back to Ajan Kloss.\nBack on Ajan Kloss, the Resistance and their allies celebrated their victory and the defeat of Sidious and the Sith Eternal. Seeing Lando, Jannah sat beside him and asked him where he was from, to which he replied the Gold system. Turning around, Lando asked Jannah where she was from with the latter saying she did not know. Smiling, Lando offered to help Jannah travel across the galaxy to help find her home.\nJannah was an extremely competent engineer who created her energy bow with recycled parts from blaster rifles. She possessed a natural ability to make her comrades trust and follow her.\nJannah was a character portrayed by Naomi Ackie in the 2019 film Star Wars: Episode IX The Rise of Skywalker, the third and final installment of the Star Wars sequel trilogy. Jannah's name and appearance were first revealed during the \"Star Wars: Episode IX\" panel at Celebration Chicago on April 12, 2019. For her character, Ackie was required to train for seven months to learn horseback riding.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Jannah",
  "/wiki/Special:Upload",
  "/wiki/12_ABY",
  "/wiki/15_ABY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Company_77",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Kef_Bir",
  "/wiki/Time",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Soldier",
  "/wiki/Ocean",
  "/wiki/Moon",
  "/wiki/Jannah%27s_energy_bow",
  "/wiki/Finn",
  "/wiki/Sith_Eternal",
  "/wiki/Final_Order",
  "/wiki/Battle_of_Exegol",
  "/wiki/Battle_of_Ansett_Island",
  "/wiki/35_ABY",
  "/wiki/Rey_Skywalker",
  "/wiki/Poe_Dameron",
  "/wiki/Chewbacca",
  "/wiki/BB-8",
  "/wiki/C-3PO",
  "/wiki/D-O",
  "/wiki/Darth_Sidious",
  "/wiki/Wayfinder",
  "/wiki/Millennium_Falcon",
  "/wiki/Attack_on_Tuanul",
  "/wiki/The_Force",
  "/wiki/Sea_skiff",
  "/wiki/Death_Star_ruins",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Supreme_Leader",
  "/wiki/Ben_Solo",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Ajan_Kloss",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/General",
  "/wiki/Kijimi",
  "/wiki/Destruction_of_Kijimi",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Orbak",
  "/wiki/Fortitude",
  "/wiki/Exegol",
  "/wiki/Sith_Eternal_military",
  "/wiki/Exegol_air_team",
  "/wiki/Exegol_landing_team",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Sith_trooper",
  "/wiki/Sith_Jetpack_Trooper",
  "/wiki/Bandolier",
  "/wiki/Turbolaser",
  "/wiki/Bridge_(starship)",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Darth",
  "/wiki/Force_dyad",
  "/wiki/Jedi",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Leia%27s_lightsaber",
  "/wiki/Enric_Pryde",
  "/wiki/Gold_system",
  "/wiki/Galaxy",
  "/wiki/Engineer",
  "/wiki/Blaster_rifle",
  "/wiki/Naomi_Ackie",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/Celebration_Chicago",
  "/wiki/April_12",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/Resistance_Heroes",
  "/wiki/The_LEGO_Star_Wars_Holiday_Special",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Amazing_Sticker_Adventures",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Book_and_Magnetic_Playset",
  "/wiki/Star_Wars:_We_Are_the_Resistance",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Episode_IX:_The_Rise_of_Skywalker",
  "/wiki/StarWars.com",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2021",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2023",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/Reproduction",
  "/wiki/October_15",
  "/wiki/January_7",
  "/wiki/2020"
 ]
}