{
 "name": "Jann_Tosh",
 "display_name": "Jann Tosh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "35 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Julpa",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Jann Tosh was a young miner living on the backwater world of Tyne's Horky. He was about twenty years old when he met the droids C-3PO and R2-D2.\nJann Tosh was born on Naboo to his parents Gar and Plena Tosh. His parents would bear two more children, the twins Gessle and Trif. All four would eventually perish in a speeder crash in 19 BBY, orphaning Jann.\nWith no living family, Jann Tosh went to live under the care of his father's best friend, Putch Gundarian, who asked Jann to call him \"Uncle Gundy,\" on a dusty Mid Rim mining world called Tyne's Horky. Living the grueling life of a miner searching for Keschels, but dreaming of becoming a pilot, Jann's fortunes took an unexpected turn for the better when he happened to meet with a frightened protocol droid and his astromech counterpart at the local droid auction.\nAfter purchasing a much needed Mining droid to help at his uncle's mine, Jann took pity on the protocol droid and R2 unit after witnessing the rough treatment that their new master Yorpo Mog inflicted on a lanky looking Android. After trading his mining droid to Mog in exchange for R2-D2, C-3PO and the barely functioning android, Jann loaded the droids into his 48 Roller wheel bike and prepared to make his way home. But before he could even start the wheel bike, he caught sight of an angry Yorpo Mog charging towards him. Jan quickly started up the bike and sped away, but not before Yorpo leaped aboard. After a wildly careening ride through the desert, Jann was able to throw Mog from the vehicle and reach the safety of home.\nAfter witnessing his uncle's fury over the new droids, Jann soon discovered that the android was not really a droid at all, but was in reality a weak and delirious alien. In time, the alien, who Jann had named Kez-Iban , became a great help at the mine, on one occasion even rescuing Gundy from a mine cave-in.\nAs Jann, Kez-Iban and the droids were taking Gundy to the nearest medical center to have his injuries treated, they were spotted by Yorpo Mog and his master Kleb Zellock. Zellock had been hired to find the lost prince of Tammuz-an Mon Julpa, and feeling certain that Jann's purple skinned companion was the bounty he had been looking for, he sent Yorpo to capture him. After being informed by R2-D2 of the capture, Jann went straightaway to Doodnik's Café, Kleb's favorite hangout, to confront the kidnappers. Upon arriving at the café, Jann found Kleb and Yorpo roughing up the Tammuz-an Sollag Den, a friend of Mon Julpa who had hired Kleb to find the prince. A brawl ensued, and Jann only narrowly escaped injury due to the intervention of a female freighter captain named Jessica Meade. But as Jann and the droids exited Doodnik's, they were immediately captured by Yorpo Mog and two of his droids and brought as prisoners to Kleb Zellock's Nergon-14 mine.\nShackled deep in the mine, Jann was reunited with Kez-Iban, who was also being held prisoner. Due to the resourcefulness of Jann's droids, were soon free from their restraints and able to defeat one of the mining droid guards who had just thrown Sollag into the cell. After reuniting Kez-Iban with his royal scepter, which had been concealed under Sollag's robes, the Tammuz-an prince regained his memory and was now able to communicate.\nJann and his comrades set out to escape, battling the armed mining droids that stood in their way, eventually reaching the office of Kleb and his henchman Yorpo. Debilitating Jann, Mon Julpa and Sollag with a piercing siren wail, Kleb fled the room as the Nergon-14 deposits in the mine began to erupt. Just as he was about to flee on the only available skiff with a stash of Keschels, Kleb turned on his accomplice Yorpo, deciding to leave him behind to die in the\nexplosion. But to a disturbance caused by C-3PO, who had just come upon the seen, Yorpo was able to blast Kleb with a stunner. Seconds later, Jann and the rest of his companions arrived, boarded Kleb Zellock's custom skiff along with Yorpo and the unconscious gangster, and fled the mine just before the Nergon-14 erupted in a gigantic explosion.\nUpon arriving home at his uncle's claim, Jann discovered that Gundy has found a Keschel vein in his mine as a result of the cave in. Now that his uncle had become rich, Jann decided to leave Tyne's Horky and accompany Mon Julpa and Sollag back to Tammuz-an to help the Prince gain his throne.\nAboard the freighter bound for Tammuz-an, Jann discovered that their pilot was none other than Jessica Meade, the woman who had come to his rescue at Doodnik's Café. Soon after their meeting, the ship came under attack by the pirate crew of Captain Gir Kybo Ren-Cha. All of Jessica's freighter was destroyed in the attack, save for a small portion including the cockpit, which was able to disengage from the main craft and fly under it's own power. As the pirates moved\nin for the kill, Jann and his friends were unexpectedly saved when the bounty hunter 24.177.244.92IG-88, who had been hired to collect a bounty on Mon Jupla, fired on\nthe pirates from his starfighter.\nAfter their night-time arrival on Tammuz-an, Jann helped Mon Julpa and Sollag orchestrate a plan to evade capture by the power hungry vizier Ko Zatec-Cha, make their way to the Keeper of the Tower, and present the Tammuz-an Royal Scepter to the Keeper before the first sun of the equinox. Only then could Julpa assume the role of King. But before they could put their plan in motion, Julpa was captured by IG-88 and the Royal Scepter was handed over to Zatec-Cha.\nJann and his droids now had no choice but to hastily put together a rescue mission to free the Prince and Jessica, who had also been captured, and retrieve the Scepter from Zatec-Cha befor the vizier could use it for his own coronation. With the help of his droids, Jann's mission was a success. He rescued Mon Julpa from being fed to a Durkii, saved Jessica from her captors and helped Julpa regain the Scepter during an air battle fought with small one-man Repulsorcrafts. Immediately after his coronation, Mon Julpa appointed Jann a captain in the space navy of Tammuz-an.\nOn one of his first missions for King Julpa, Jann was flying escort in a R-22 Spearhead for a supply ship carrying a load of fuel when the ship came under attack by Kybo Ren-Cha's pirates. When the supply ship and it's captain Jessica Meade were taken by the pirates, Jann was forced to surrender rather than risk harm coming to Jessica, R2-D2 and C-3PO. With his fighter caught in the pirate's tractor beam, Jan and the fuel tanker were taken to Kybo Ren-Cha's\nheadquarters on the planet Tarnoonga. While being held by the pirates, Jann was informed by the pirate captain of his plan to conquer Tammuz-an. Without the fuel from the supply ship, Tammuz-an's space navy would be unable to put up a fight against Kybo's captured Imperial Star Destroyer, the Demolisher.\nJann and his friends were then transported by a Bantha-II cargo skiff to an area of the sea known to be inhabited by a Miridon. After being thrown into the water, Jann was rescued from the beast by R2-D2, who had jumped into the ocean taking C-3PO with him, and brought to the safety of a cavern underneath the pirates headquarters. Infiltrating the pirate hideout, Jann and the droids were able to meet up with Jessica, make their way to their spacecraft and flee.\nBefore Jann could make his way back to Tammuz-an, he and the droids were captured by the tractor beam of the Demolisher. While Jann was held prisoner aboard the pirate Star Destroyer, Kybo destroyed the fuel tanker moments after Jessica jettisoned in an escape pod. Upon seeing that the ruptured tanker contained no fuel, Jann revealed that his escort mission was actually a decoy and that the real supply ship had safely arrived at Tammuz-an. At that moment Mon Julpa's fighters launched their attack on the Demolisher as R2-D2 sabotaged the vessel by causing its torpedoes to backfire. Racing to the Star Destroyer's hangar, Jann and his droids were able to reach the captured R-22 Spearhead and escape the pirates.\nFollowing the capture of the pirates, Jann served as an advisor to Mon Julpa in peace negotiations with with the warrior chieftain Lord Toda. The negotiations\nwere hampered, however, when Kybo escaped from Julpa's dungeon and fled aboard an R-22 Spearhead with Toda's daughter Gerin as hostage. Jann and Jessica were given the task of rescuing Gerin while Julpa placed himself in Toda's custody as a sign of his goodwill. After C-3PO and R2-D2 learned of Kybo Ren's destination from the imprisoned pirate Jyn Obah, Jann, Jessica and the droids set off for the bog moon of Bogden. Their rescue mission was successful and the pirates were finally defeated by Lord Toda's forces. Following the mission, Jann bid farewell to Jessica as she departed for Tyne's Horky.\nAfter Jessica Meade's return to Tyne's Horky, Jann decided to pursue his dream of joining the Imperial Space Academy. While he waited for his acceptance notification, he continued to serve Mon Julpa and Lord Toda, volunteering to escort Toda's strong-willed son Coby to the Imperial Academy's retraining program. But during a stopover at the Zallakesh spaceport on the world of Chuzalla, Coby became separated from Jann after the young Prince purchased a starfighter and set off with Jann's droids in pursuit of the Starhunter's Intergalactic Menagerie and Coby's stolen pet. Receiving an SOS from Coby, Jann was able to catch up with the boy on the planet Dandelo and put an end to the Starhunters illegal operation. It was there that Jann revealed to the droids that he had finally been granted acceptance into the Academy. Unfortunately, trainees were not permitted to bring their droids with them, so Jann reluctantly parted ways with C-3PO and R2-D2, leaving them behind with the Fuzzums on Dandelo.\nJann graduated from the Academy and was quickly posted on Carfoom. Just one week after his graduation, the outpost was attacked by Rebels. Jann was shot in the back and paralyzed from the waist down. After being fitted into a hoverchair, Jann was honorably discharged and sent back to Tyne's Horky.\nWhen Gundy passed away ten years later, Jann took over the Gundarian Mining Company.\nTosh was frequently seen driving his 48 Roller wheel bike, a vehicle similar to the one used by General Grievous.\nA capable fighter, pilot and inventive strategist, Jann was able to rise from being a peasant on an insignificant world to being a royal adviser and military leader on Tammuz-an.\nJann Tosh was released as an action figure in 1985 as part of Kenner's Star Wars Droids line. These action figures were size-compatible with the other Kenner Star Wars action figures, but design-wise, they represented a completely different toy line.\nJann was voiced by Don Francks, father of Cree Summer  on Star Wars Droids.\nIn the episode \"The New King\", which takes place before the Battle of Yavin, Jann Tosh supposedly pilots an A-wing fighter, and at least one B-wing is seen in the hangar on Tammuz-an. However, neither starfighter was built until afterward. These vessels have, however, been retconned as R-22 Spearheads and H-60 Tempest bombers respectively.\nAccording to the brief character biographies on the card backs from the Droids action figure line, Jann is described as being a teenager, while his current Databank entry at StarWars.com states that he is about 20 years old. The cardback also indicates that Gundy and Jann have traveled to several worlds in search of treasure. If this information is considered canon, then Tyne's Horky is probably not Jann's planet of birth.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/35_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mon_Julpa",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tyne%27s_Horky",
  "/wiki/Standard_year/Legends",
  "/wiki/Droid/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Gar_Tosh",
  "/wiki/Plena_Tosh",
  "/wiki/Gessle_Tosh",
  "/wiki/Trif_Tosh",
  "/wiki/19_BBY/Legends",
  "/wiki/Putch_Gundarian",
  "/wiki/Mid_Rim",
  "/wiki/Keschel",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/Mining_droid",
  "/wiki/Yorpo_Mog",
  "/wiki/Android",
  "/wiki/48_Roller_wheel_bike",
  "/wiki/Kez-Iban",
  "/wiki/Bocce/Legends",
  "/wiki/Kleb_Zellock",
  "/wiki/Tammuz-an/Legends",
  "/wiki/Doodnik%27s_Caf%C3%A9",
  "/wiki/Sollag_Den",
  "/wiki/Jessica_Meade",
  "/wiki/Nergon-14/Legends",
  "/wiki/Gyrocopter",
  "/wiki/Gir_Kybo_Ren-Cha",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Vizier/Legends",
  "/wiki/Ko_Zatec-Cha",
  "/wiki/Keeper_of_the_Tower",
  "/wiki/Tammuz-an_Royal_Scepter",
  "/wiki/Durkii",
  "/wiki/Repulsorcraft/Legends",
  "/wiki/R-22_Spearhead_starfighter",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Tarnoonga",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Demolisher",
  "/wiki/Bantha-II_cargo_skiff/Legends",
  "/wiki/Miridon",
  "/wiki/Escape_pod/Legends",
  "/wiki/Malameu_Toda",
  "/wiki/Gerin",
  "/wiki/Jyn_Obah",
  "/wiki/Bogden/Legends",
  "/wiki/Imperial_Space_Academy",
  "/wiki/Coby",
  "/wiki/Zallakesh",
  "/wiki/Chuzalla",
  "/wiki/Starhunter%27s_Intergalactic_Menagerie",
  "/wiki/Dandelo",
  "/wiki/Fuzzum",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Power_chair",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/1985",
  "/wiki/Kenner_Products",
  "/wiki/Star_Wars:_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/Star_Wars",
  "/wiki/Don_Francks",
  "/wiki/Cree_Summer",
  "/wiki/Prince/Legends",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Retcon",
  "/wiki/H-60_Tempest_bomber/Legends",
  "/wiki/Databank_(original)",
  "/wiki/StarWars.com",
  "/wiki/The_Lost_Prince",
  "/wiki/The_Lost_Prince:_A_Droid_Adventure",
  "/wiki/The_Pirates_and_the_Prince",
  "/wiki/The_New_King",
  "/wiki/The_Pirates_of_Tarnoonga",
  "/wiki/The_Pirates_of_Tarnoonga:_A_Droid_Adventure",
  "/wiki/The_Revenge_of_Kybo_Ren",
  "/wiki/Coby_and_the_Starhunters",
  "/wiki/Sabotaged_Droid",
  "/wiki/Troublesome_Outing",
  "/wiki/Star_Wars:_Droids_(toy_line)",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_The_Action_Figure_Archive",
  "/wiki/C-3PO:_Tales_of_the_Golden_Droid",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_159",
  "/wiki/The_Droids_Re-Animated"
 ]
}