{
 "name": "Janos_Wertka",
 "display_name": "Janos Wertka",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray-green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Czerka Corporation"
     ]
    }
   ]
  }
 ],
 "content": "Janos Wertka was an Ithorian male who was the administrator of the Czerka Corporation outpost on Kashyyyk near Rwookrrorro in 3956 BBY. Unlike most of his species, he seemed to have little regard for life, and was more than willing to exploit Kashyyyk and the Wookiees.\nWhen the amnesiac Revan visited Kashyyyk, looking for the Star Map on the planet, Janos greeted him and his party on the landing pad and demanded credits for Czerka's docking fee. Revan paid the fee and Janos gave a short introduction to Kashyyyk, or as he called it, Edean. Janos again welcomed the new arrivals to the planet and informed them that should they have any more questions, to see him at the Czerka offices further along the tree-top path.\nFollowing the events of the Rebellion on Kashyyyk, Janos was forced off the planet along with all of Czerka's other employees and operations.\nJanos Wertka is a non-playable character in Star Wars: Knights of the Old Republic. The player first meets Janos when he greets Revan and his party after their initial landing on Kashyyyk.\nIn the non-canon dark side path of the game, Chuundar continues to be the leader of the Wookiees, and Czerka's operations on Kashyyyk continue uninterrupted.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Czerka_Arms/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Rwookrrorro/Legends",
  "/wiki/3956_BBY",
  "/wiki/Species/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Star_Map",
  "/wiki/Planet/Legends",
  "/wiki/Rebellion_on_Kashyyyk",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Chuundar"
 ]
}