{
 "name": "Jano Brayson",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Baroli"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Barolian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Firebird Squadron",
      "Firebird Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Jano Brayson was a Barolian male Galactic Republic pilot in the Republic Defense Coalition. Flying a Z-29 Skyhawk, he was transferred into Firebird Squadron, where he met Teff, an old friend of his who had been assigned to the same squadron. Jano was deployed with the rest of Firebird Squadron at the Battle of Galov against Tempest Runner Lourna Dee of the Nihil marauder organization. He and several other pilots accompanied Jedi Knight Nib Assek and her Padawan Burryaga Agaburry in boarding Dee's flagship, the Lourna Dee. Jano, Tef, and the two Jedi made it to the flight deck of the vessel, where they encountered what appeared to be Dee herself; Dee, however, had made an escape, leaving behind the droid H7-09 clad in her armor and mask. Jano, believing H7-09 to be Dee, shot the droid, but was reprimanded by Assek for seemingly killing Dee. Before the group could unmask \"Dee,\" an explosive hidden within the armor went off. Though the Jedi attempted to protect the pilots, Tef was killed in the explosion.\nAngered by the death of his friend, Jano later attempted to kill captured Nihil who were being treated aboard Starlight Beacon. As he attacked the Nihil Tasia, he was incapacitated by Dee herself, who had been taken into custody with the Jedi unaware of her identity. The Jedi, having learned what Jano was about to do, entered the ward shortly afterward.\nJano Brayson was voiced by Neil Hellegers in the 2021 audio drama The High Republic: Tempest Runner, written by Cavan Scott.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Baroli",
  "/wiki/Barolian",
  "/wiki/Gender",
  "/wiki/Galactic_Republic",
  "/wiki/Firebird_Squadron",
  "/wiki/Pilot",
  "/wiki/Republic_Defense_Coalition",
  "/wiki/Z-29_Skyhawk",
  "/wiki/Teff",
  "/wiki/Squadron",
  "/wiki/Battle_of_Galov",
  "/wiki/Tempest_Runner",
  "/wiki/Lourna_Dee",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Jedi_Knight",
  "/wiki/Nib_Assek",
  "/wiki/Padawan",
  "/wiki/Burryaga_Agaburry",
  "/wiki/Flagship",
  "/wiki/Lourna_Dee_(cruiser)",
  "/wiki/Jedi",
  "/wiki/Starship",
  "/wiki/Droid",
  "/wiki/H7-09",
  "/wiki/Armor",
  "/wiki/Death",
  "/wiki/Starlight_Beacon",
  "/wiki/Tasia",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Jano_Brayson",
  "/wiki/Neil_Hellegers",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Cavan_Scott",
  "/wiki/The_High_Republic:_Tempest_Runner_(script)",
  "/wiki/StarWars.com"
 ]
}