{
 "name": "Janse",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ukio"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "BlasTech Industries",
      "Alliance to Restore the Republic",
      "Endor strike team",
      "Endor strike team"
     ]
    }
   ]
  }
 ],
 "content": "Janse was a Human male native of the planet Ukio who worked as a weapons design evaluator with BlasTech Industries during the Galactic Civil War. At some point, Janse became a sharpshooter. He eventually left BlasTech, taking a cache of A280 blaster rifles with him, and joined the Alliance to Restore the Republic shortly before the Battle of Endor in 4 ABY, becoming a corporal in Alliance Special Forces. Janse served as a scout on hunting expeditions. That year, Janse attended a briefing held on the Alliance Fleet's flagship, the Mon Calamari Star Cruiser Home One, where the Alliance discussed its plans to attack the Galactic Empire's second Death Star battlestation orbiting the Forest Moon of Endor. Janse served as a sharpshooter in the strike team organized to infiltrate the moon and deactivate the Imperial shield generator that protected the Death Star. The strike team successfully disabled the generator, allowing Alliance starfighters to destroy the Death Star.\nJanse, a Human male who lived during the Galactic Civil War, was a native of the planet Ukio. At some point, he became a sharpshooter. He worked as a weapons design evaluator for the arms manufacturer BlasTech Industries. Eventually, Janse left BlasTech, taking with him a cache of A280 blaster rifles.\nShortly before the Battle of Endor in the year 4 ABY, Janse joined the Alliance to Restore the Republic and eventually became a corporal in Alliance Special Forces. By that time, he was a former sharpshooter who served as a scout during hunting expeditions.\nIn 4 ABY, Janse attended a briefing held on the Alliance Fleet's flagship, the MC80 Home One type Star Cruiser Home One, during which Mon Mothma, the Alliance's Supreme Commander, discussed plans to attack the Galactic Empire's second Death Star battlestation in orbit over the Forest Moon of Endor. General Crix Madine, the Alliance commander in charge of planning the attack, explained that members of a strike team led by General Han Solo would be sent to Endor to deactivate the SLD-26 planetary shield generator on the moon protecting the Death Star from frontal assault, which would allow Alliance starfighters to destroy the station's main reactor. Janse was among the members of the strike team, serving alongside Lieutenant Greeve as a reactivated sharpshooter.\nJanse and the rest of the strike team traveled to the Endor system aboard the stolen Imperial Lambda-class T-4a shuttle Tydirium, piloted by Solo. Queried by the Super Star Destroyer Executor in defensive orbit over Endor, Solo gave a stolen Imperial code, and the Executor provided the shuttle clearance to land on the Forest Moon. Shortly after landing on the moon's surface, the strike team waited while Solo and the team's command crew—Luke Skywalker, Leia Organa, and the Wookiee Chewbacca—scouted the area ahead to make sure it was clear. In the process, Solo alerted a scout trooper patrol to the strike team's presence, resulting in a speeder bike chase between Skywalker, Organa, and several of the Imperial scouts.\nJanse and the rest of the squad waited until only Skywalker returned. When it became evident that Organa was missing, Solo took the rest of the command crew to search for her, ordering the squad to continue on and to rendezvous at the deflector shield generator at 0300 hours. Major Bren Derlin, the strike team's commanding officer, led the squad toward the shield generator. Several times along the way, the squad encountered Imperial patrols and managed to hide. However, Corporal Delevar, the team's medic, almost compromised their position by preparing to take a potshot at a speeder bike; he was consequently stopped and reprimanded by Derlin.\nAt nightfall, Janse and the squad made camp in a camouflaged shallow ravine, where they posted two sentries and set up a blanket grid with their scanning equipment. Shortly after the squad members started their first sleeping shift, the scanners picked up an All Terrain Scout Transport walker moving toward them. Derlin ordered the team to take cover, but when it became clear that the walker would not pass them by, Corporal Dansra Beezer jammed its transmissions. Lieutenant Greeve destroyed both of the walker's spotlights with precise shots from his A280 blaster rifle, and the squad circled the walker in order to keep it off balance. When the AT-ST began to fire randomly into the trees and foliage, Delevar fired a smoke canister into its cockpit window. The resulting explosion forced the walker pilots to abandon the vehicle and surrender to the strike team. The squad captured the pilots and forced them to make a comm check-in at blasterpoint.\nThe squad continued on to the rendezvous point, forcing the walker pilot to make several more check-ins on the way to explain the scout walker's absence. By the time the strike team reunited, Solo and the rest of the command crew had allied with the moon's native Ewok tribe from Bright Tree Village, who showed the strike team a path to the shield generator bunker's back door. The strike team then infiltrated the bunker in order to destroy it with 7-PrG proton grenades; however, they were subsequently ambushed and led outside the bunker by Tempest Force, the Imperial Army legion stationed on the moon.\nThe strike team's capture was only temporary, however, as the Ewoks attacked the Imperial troops and the strike team fought back, with the tide of the battle eventually turning in the Rebels' favor. The surviving members of the strike team ultimately destroyed the shield generator bunker with their proton grenades, allowing the Alliance Fleet to destroy the Death Star as planned.\nJanse was a sharpshooter and served the Rebel Alliance in that capacity. Using his skills from his time as a weapons design evaluator, Janse aided the Alliance as a scout and hunter. Janse had gray hair and fair skin.\nJanse and the rest of the Endor strike team were equipped with basic commando gear, which included a standard comlink, a low-feedback scanner, a sensor scrambler, a heavily muffled blaster, and full-forest-camouflage fatigues. As one of the strike team's sharpshooters, Janse, along with Greeve, used the A280 blaster rifles he had taken with him from BlasTech during the Battle of Endor.\nJanse first appeared as a background Rebel character during the Home One briefing in 1983's Star Wars: Episode VI Return of the Jedi, portrayed by an uncredited Tony O'Leary according to actor Kenneth Coombs. In June 1999, Janse was given a name and brief backstory in the Endor Limited expansion set of Decipher, Inc.'s Star Wars Customizable Card Game.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Ukio/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/BlasTech_Industries/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Endor_strike_team/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Sniper/Legends",
  "/wiki/A280_blaster_rifle/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Corporal/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Flagship/Legends",
  "/wiki/MC80_Home_One_type_Star_Cruiser",
  "/wiki/Home_One/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Battlestation",
  "/wiki/Orbit/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Moon/Legends",
  "/wiki/SLD-26_planetary_shield_generator/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Time/Legends",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Supreme_Commander_(Alliance/Republic)",
  "/wiki/General/Legends",
  "/wiki/Crix_Madine/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Hypermatter_annihilator",
  "/wiki/Lieutenant/Legends",
  "/wiki/Greeve_(Human)",
  "/wiki/Endor_system/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Tydirium/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Wookiee/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Scout_trooper/Legends",
  "/wiki/74-Z_speeder_bike/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Major/Legends",
  "/wiki/Bren_Derlin/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Delevar",
  "/wiki/Medic/Legends",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Blanket_grid",
  "/wiki/Scanner",
  "/wiki/Sleep/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Dansra_Beezer",
  "/wiki/Jammer",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Smoke_canister/Legends",
  "/wiki/Cockpit/Legends",
  "/wiki/Window/Legends",
  "/wiki/Comm_unit/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Endor_shield_generator_bunker",
  "/wiki/7-PrG_proton_grenade",
  "/wiki/Tempest_Force",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Legion/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Proton_grenade/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Sensor_scrambler_(equipment)",
  "/wiki/Sound_suppressor",
  "/wiki/Forest/Legends",
  "/wiki/Alliance_military_uniform/Legends",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Tony_O%27Leary",
  "/wiki/Kenneth_Coombs",
  "/wiki/June",
  "/wiki/1999",
  "/wiki/Endor_Limited",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi_(PhotoComic)",
  "/wiki/Return_of_the_Jedi_Storybook",
  "/wiki/Star_Wars_Technical_Journal_of_the_Rebel_Forces",
  "/wiki/Kenner_Products",
  "/wiki/Star_Wars:_The_Power_of_the_Force_(1995_toy_line)",
  "/wiki/Star_Wars:_Chronicles",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars:_The_Action_Figure_Archive",
  "/wiki/Death_Star_II_Limited",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_Power_of_the_Jedi",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_23",
  "/wiki/The_Official_Star_Wars_Fact_File_44",
  "/wiki/The_Complete_Star_Wars_Trilogy_Scrapbook",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Special_Edition",
  "/wiki/The_Art_of_Ralph_McQuarrie",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Militaries_of_Star_Wars",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_29",
  "/wiki/West_End_Games",
  "/wiki/Night_Attack",
  "/wiki/Galaxy_Guide_5:_Return_of_the_Jedi",
  "/wiki/The_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/Galaxy_Guide_5:_Return_of_the_Jedi_(Second_Edition)",
  "/wiki/File:OLearyConfirmationFromKenCoombs..png",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Leland_Chee",
  "/wiki/StarWars.com"
 ]
}