{
 "name": "Janus_Kasmir",
 "display_name": "Janus Kasmir",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kaller"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kalleran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Janus Kasmir's crew"
     ]
    }
   ]
  }
 ],
 "content": "Janus Kasmir was a Kalleran male who lived as a scoundrel on the planet Kaller around the time of Order 66.\nShortly before Order 66, Kasmir was present when Separatist general Kleeve evacuated Kaller, leaving it to the Republic. When Jedi General Depa Billaba and her Padawan Caleb Dume reached his village, he explained that the Kallerans didn't see the difference between one general and another, which enraged Dume and two clone officers.\nKasmir found Dume several days after Order 66 was issued, hiding in Plateau City. He gave Dume a meiloorun fruit. Dume devoured it immediately. He then asked Janus to give him somewhere to sleep. Janus agreed to let him stay the night on his ship, the Kasmiri. While aboard, Dume received a message calling him back to the Jedi Temple. Kasmir refused to bring him there, as he would not venture beyond the Outer Rim. Eventually, Kasmir left the Kasmiri to stop clone troopers from inspecting his craft. Seeing an opportunity, Caleb stole the Kasmiri and departed for Coruscant.\nArriving at the capital, Dume discovered the beacon to be a trap and returned to Kaller. Upon being reunited with his ship, Kasmir banished the boy and threatened to kill Dume if he ever saw him again.\nSeveral weeks later, Kasmir was in an alleyway being confronted by a group of criminals, who were led by a fellow Kalleran, Tápusk. Kasmir had conned the group, and they were looking for payback. He planned to negotiate with them, while also cheating them out of more money. However, Tápusk and his men were suddenly ambushed by Caleb Dume, who had been roaming the streets in the time since he last saw Kasmir. The Jedi and Kasmir subdued the gang and let Tápusk go.\nDragging Dume back to the Kasmiri, Kasmir chastised him for ruining his negotiations and losing a potential crew for his next job. As payback, Kasmir had Dume \"volunteer\" in their place. With the Jedi Knights being the most wanted people in the galaxy, Kasmir helped Dume change his appearance and told him to relinquish all that made him a Jedi -- even his name.\nThe duo's first job together was the theft of a cache of IG-RM droids from the estate of Gamut Key, a wealthy Kalleran who had previously encountered Kasmir shortly before Order 66. During the heist, Kasmir and Dume were caught by Key and his men, one of whom was Tápusk. Attempting to negotiate his way out of trouble, Kasmir gave up Dume, revealing him to be a Jedi. Making a deal with Key, Kasmir let him and Tápusk keep Dume and claim the bounty on the boy, in exchange for the IG-RM droids. Using the droids, Kasmir later broke Dume out of his cell, and the two escaped.\nOver the next few months, Kasmir and Dume made a great team, flying from world to world, completing jobs while also remaining one step ahead of Commander Grey and Captain Styles, who previously fought alongside Dume during the Clone Wars. During the time they spent together, Kasmir and Dume formed a true friendship and even considered buying a second ship, to allow them to split up in the event of one of them being captured.\nMonths after leaving Kaller, Kasmir had a new job lined up on the planet Lahn. The job was to be a trade of stolen goods with Kasmir's contact, Jondo who, unbeknownst to them, was the former Separatist General Kleeve, now also in hiding from the Empire. Kasmir would provide spice, and in return Kleeve would give him a ship called Farbrooke's Hope, that the Kalleran planned to rename the Kasmiri II. However, the duo had not yet stolen the spice that they would be trading. Kasmir sent Dume to meet with Kleeve to confirm the trade, while he went off to obtain their half of the deal. While loading the stolen cargo aboard the Kasmiri II, Kasmir was found by Commander Grey. Grey interrogated him as to the whereabouts of Dume, but the Kalleran feigned ignorance. Grey then arrested him.\nAfter Grey received confirmation from Styles that Dume had been apprehended, Kasmir mockingly congratulated him for the successful murder of Dume. Grey responded that it was only about their duty to the Empire but slipped and almost said Republic. Kasmir castigated him about his ignorance for his cause and Grey countered that he only had to follow orders. He left Kasmir and rendezvoused back at the freighter. Later, Kasmir and Kleeve managed to escape and intercept the freighter in the Kasmiri and Farbrooke's Hope. Dume, who was still alive, managed to undo his bonds and eject himself out of an airlock, floating unconscious in space. Unsure of whether Dume was dead, Kasmir pulled him into his ship. Dume was alive, and Kleeve volunteered to run interference while he recovered. Low on shields and unable to outrun or outgun the freighter, Dume suggested a coordinated strike to create an opening for an escape. Meanwhile in the freighter, Grey was having doubts about Order 66 and the supposed treason of Jedi General Billaba. Styles berated him for even considering such a thought. Grey saw the trio turn back as he reached for a blaster and shot the freighter's control panel which disabled their shields, allowing the freighter to be destroyed. Kasmir and Kleeve, surprised at the effectiveness of their attack, were unaware of what just transpired.\nThey landed back on Kaller for repairs, where Dume suggested Kasmir establish a partnership with Kleeve as he had decided to discontinue theirs. Kasmir attempted to dissuade Dume and in the process called him \"kid.\" Dume reacted violently, kneeing him the stomach and throwing him against some rocks. Grasping Dume's conviction, he conceded and watched Dume climb aboard the Farbrooke's Hope, which he had renamed the Escape, finally addressing him as Caleb Dume.\nFifteen years later, Kasmir was still working with Kleeve. While on Lahn, he helped a kid get away from stormtroopers, being reminded of Dume. Unknown to him, the kid was Ezra Bridger, the apprentice of his former partner and friend Caleb Dume, now known as Kanan Jarrus. Kasmir returned to the Kasmiri, and departed Lahn with Kleeve.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kaller",
  "/wiki/Kalleran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Janus_Kasmir%27s_crew",
  "/wiki/Planet",
  "/wiki/Order_66",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/General",
  "/wiki/Kleeve",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_General",
  "/wiki/Depa_Billaba",
  "/wiki/Padawan",
  "/wiki/Kanan_Jarrus",
  "/wiki/Clone_trooper",
  "/wiki/Officer",
  "/wiki/Plateau_City",
  "/wiki/Meiloorun_fruit",
  "/wiki/Kasmiri",
  "/wiki/Jedi_beacon",
  "/wiki/Imperial_Palace",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Coruscant",
  "/wiki/T%C3%A1pusk",
  "/wiki/Jedi_Knight",
  "/wiki/IG-RM_bodyguard_and_enforcer_droid",
  "/wiki/Gamut_Key",
  "/wiki/Commander",
  "/wiki/CC-10/994",
  "/wiki/Styles",
  "/wiki/Clone_Wars",
  "/wiki/Lahn",
  "/wiki/Spice",
  "/wiki/Escape",
  "/wiki/Stormtrooper",
  "/wiki/Ezra_Bridger",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Janus_Kasmir",
  "/wiki/Kanan_1",
  "/wiki/Kanan_2",
  "/wiki/Kanan_3",
  "/wiki/Kanan_4",
  "/wiki/Kanan_5",
  "/wiki/Kanan_6",
  "/wiki/Kanan_7",
  "/wiki/Kanan_12",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_158",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_15",
  "/wiki/Databank_A-Z",
  "/wiki/No_Disintegrations_(Fantasy_Flight_Games)",
  "/wiki/Star_Wars_Helmet_Collection_69",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}