{
 "name": "Janus_Bonn",
 "display_name": "Janus Bonn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corulag"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Asteroid 7785",
      "Alderaan system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Military",
      "Imperial Military"
     ]
    }
   ]
  }
 ],
 "content": "Janus Bonn was a Human male captain of the Imperial Military of the Galactic Empire and a native of the planet Corulag. He was the son of a wealthy noble, attending the best schools and eventually volunteering for service to the New Order upon graduation. Rising through the ranks, he became an adjutant to the Lord Darth Vader.\nJanus Bonn was born on the Core World Corulag, the son of a wealthy noble. Immersed in the Human High Culture philosophy espoused by the Galactic Empire, he attended the best university available to him, graduating with honors. Upon graduation, he volunteered to serve in the Imperial Military. As a young officer, Bonn was assigned as an adjutant to the Lord Darth Vader, and his ascension through the ranks of the Imperial Military bore similarities to the Supreme Commander's own rise; he utilized displays of power, deceit, and even murder to distinguish himself in a relatively short career. Bonn was promoted to the rank of captain around the same time that Lord Vader was assigned to assist Grand Moff Wilhuff Tarkin and the Death Star project.\nFollowing the disastrous Battle of Yavin, Lord Vader's commission was expanded and he found himself at the helm of Death Squadron, an armada charged with tracking down the elusive Rebel Fleet. During this time, Lord Vader instructed Captain Bonn to prepare a trap for the Heroes of Yavin in the Alderaan system, using rumors that the Aldera Royal Palace had been found intact in the debris field of the planet Yavin, and that Bail Prestor Organa was also alive within. With two platoons of stormtroopers at his beck and call, Bonn waited at Mining Outpost 11 in the Alderaan system for the Heroes of Yavin to arrive, knowing that Vader would follow in pursuit. The captain's endgame was simple; when the Rebels arrived, he was to ensure that they did not leave until his master made his inevitable appearance.\nBonn was a Human male, who stood 1.8 meters tall. He maintained a thick goatee beard, and was possessed of cold, dead eyes that intimidated his underlings. His stare, combined with his efficient and emotionless attitude, earned him the nickname of \"The Dead Man\" from his soldiers. His cold, unemotional behavior was a façade, however; inside, Bonn was a seething pit of evil, fear, hatred and violence. When pressed, his composure would slip. The revelation of his true nature was enough for doubt to be cast on his sanity.\nCaptain Bnn was a fanatical supporter of Emperor Palpatine and his New Order, and was doggedly loyal to Lord Vader. Despite his allegiance to Vader, Bonn did not believe in, or respect, the notion of the Force. He respected results, something his master excelled at, the defeat at Yavin 4 notwithstanding. When given a mission objective, Bonn treated it as the most important thing. To fail in his assignment would invalidate any meaning in his life. Captain Bonn was one of the few officers, along with Commander Daine Jir and Admiral Firmus Piett, who Lord Vader respected.\nBonn wore a standard Imperial officer's uniform, carried a comlink, and was armed with a blaster and grenades.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corulag/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Asteroid_7785",
  "/wiki/Alderaan_system/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Military",
  "/wiki/Captain/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Noble/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Human_High_Culture",
  "/wiki/University/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Death/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Death_Squadron/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Operation_Yavin_Kill_Two",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/Aldera_Royal_Palace",
  "/wiki/The_Graveyard",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Platoon/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Mining_Outpost_11",
  "/wiki/Soldier/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Daine_Jir/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Firmus_Piett/Legends",
  "/wiki/Imperial_officer%27s_uniform/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Graveyard_of_Alderaan",
  "/wiki/West_End_Games",
  "/wiki/Classic_Adventures:_Volume_Two",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Empire%27s_Finest:_Who%27s_Who_in_the_Imperial_Military",
  "/wiki/Star_Wars_Insider_96",
  "/wiki/Alderaan/Legends",
  "/wiki/Destruction_of_Alderaan"
 ]
}