{
 "name": "Jar%27ga",
 "display_name": "Jar'ga",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Jar'ga was a male Hutt casino owner. Jar'ga the Hutt pioneered the development of Holo-Sabacc, a variation of the card game sabacc that was played entirely through hologram without physical cards.\nJar'ga first commissioned Holo-Sabacc in a casino on the moon Nar Shaddaa in order to combat longtime rampant cheating in both amateur and professional sabacc games, as he did not tolerate such profit-gouging like his fellow casino owners. Jar'ga's invention quickly became popular across the galaxy, and by 3630 BBY, every casino in known space had installed at least one Holo-Sabacc table. Slicers, however, quickly adapted, stacking holo-decks and altering card algorithms. The sliced Holo-Sabacc systems were obtainable on every major world's black market. Jar'ga himself hid a sliced Holo-Sabacc table in his casino stacked in the dealer's favor.\nJar'ga was mentioned in the Codex entry for Holo-Sabacc in the 2015 expansion Knights of the Fallen Empire to the 2011 massively multiplayer online role-playing game Star Wars: The Old Republic, released by BioWare.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Casino/Legends",
  "/wiki/Holo-Sabacc",
  "/wiki/Sabacc/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/3630_BBY",
  "/wiki/Realspace/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Black_market/Legends",
  "/wiki/2015",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/The_Essential_Atlas",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Standard_year/Legends"
 ]
}