{
 "name": "Jar Jar Binks's father",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "The father of the Otolla Gungan Jar Jar Binks was a Gungan male. The memory of his father would eventually sadden Binks.\nGeorge R. Binks was born in Otoh Gunga on the planet Naboo to a family of whalers. The Binks family had practiced the whaler profession for centuries, so as a mere youth, he commanded his own gang of fishermen in his home town. At some point, he decided to join the family business, the Binks \u0026 Son Whaling Company. In his capacity as a professional whaler, Binks often went on long sea voyages, even sailing across the entire planet of Naboo on more than one occasion.\nAt one point, he fell in love with the warrior-woman Sheebla and planned on marrying her, but when he learned of Sheebla's infertility, Binks broke off his wedding plans and left her; to him a child was more important than love. He eventually married another woman, not out of love but because she had the ability to bear him an heir.\nThe Gungan male's wife gave birth to his son, Jar Jar Binks, in 52 BBY.\nStarting when his son was a child, Binks attempted to teach Jar Jar the whaler profession and involve him in the family company, but much to his chagrin, Jar Jar was uninterested and prone to clumsiness. As a result of these qualities, Binks began resenting his son.\nOn a whaling trip with his wife and son in the southernmost seas of Naboo during the era of the Galactic Republic, Binks happened upon a large whale. His initial attempt at harpooning the creature was unsuccessful, and in the ensuing fight, the whale was caught in the rigging of Binks's ship. He issued a series of commands to Jar Jar to take the wheel and maneuver clear of the situation, but his son was unable to comply. As a result, the ship sank, and the Binks family was forced to seek refuge on a barren island.\nA month later, Binks and his family were still stranded on the island, which he named \"Binks's Woe.\" He grew increasingly annoyed by his son's antics, including picking up a creature that painfully pinched the boy's face. George took out his anger on his son and was admonished by his wife; he complained that when he was Jar Jar's age, he was already far more successful. It came to the point that when Jar Jar offered to swim for help—a suicidal task due to the treacherous seas as well as the distance involved—Binks encouraged the boy. However, this attempt at getting Jar Jar killed was cut short when his wife intervened. Overcome with feelings, he drew a gun and turned it on himself. His wife tried to stop him but only ended up encouraging him into pulling the trigger by telling him to think of their son. The shot merely grazed his skull, knocking him unconscious. When he awoke a short while later, he lowered his head in sadness.\nBinks was eventually expelled from all schools in Otoh Gunga and was unable to turn to his parents for guidance; as such, he was forced to take on many odd jobs during his youth. By 32 BBY, Jar Jar was punished by Boss Rugor Nass for an accident that had been caused by Binks's clumsiness; if not for Nass's respect for his parents, the punishment would have been more severe. The mention of his mother and father saddened Binks, but he was thankful that he would not receive a beating.\nGeorge R. Binks took great pride in his profession, as well as in his family. So concerned was he with securing a male heir to the Binks name that he left the woman he loved because she was infertile. When he finally received a son, Jar Jar, he worked hard to teach the youngster the whaling profession. His son's repeated failures at living up to his expectations became a source of discontent for Binks. The loss of the love of his life and his seemingly incompetent son caused him to grow violent and angry, culminating in an unsuccessful attempt at killing himself. He was an Otolla Gungan male with light brown skin.\nGeorge R. Binks was an experienced whaler and sailor but was a terrible marksman.\nBinks wore a green jacket.\nThe father of Jar Jar Binks was first mentioned in the 2000 junior novel Episode I Adventures 9: Rescue in the Core, written by Ryder Windham as part of the Star Wars: Episode I Adventures series. The name George R. Binks was created by Tony Millionaire as the main character of the ambiguously canon comic story \"George R. Binks,\" which was published in Star Wars Tales' twentieth issue on June 30, 2004. Millionaire also illustrated the comic.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Canon",
  "/wiki/George_R._Binks_(comic)",
  "/wiki/Wookieepedia:AgriCorps",
  "/wiki/Category:Wookieepedia_Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations",
  "/wiki/Wookieepedia:Good_article_nominations/Jar_Jar_Binks%27s_father_(Redux_review)",
  "/wiki/Wookieepedia:AC/Jar_Jar_Binks%27s_father",
  "/wiki/Gungan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Otolla/Legends",
  "/wiki/Jar_Jar_Binks/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Star_Wars_Tales",
  "/wiki/Star_Wars_Tales_1",
  "/wiki/Star_Wars_Tales_20",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Reproduction/Legends",
  "/wiki/Otoh_Gunga/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Binks_family",
  "/wiki/Standard_century/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Fisherman",
  "/wiki/City/Legends",
  "/wiki/Binks_%26_Son_Whaling_Company",
  "/wiki/Ocean/Legends",
  "/wiki/Sheebla",
  "/wiki/Marriage/Legends",
  "/wiki/George_R._Binks%27s_wife",
  "/wiki/52_BBY/Legends",
  "/wiki/Great_Peace_of_the_Republic",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Binks%27s_Woe",
  "/wiki/Suicide/Legends",
  "/wiki/Death/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Boss/Legends",
  "/wiki/Rugor_Nass/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jacket/Legends",
  "/wiki/2000",
  "/wiki/Episode_I_Adventures_9:_Rescue_in_the_Core",
  "/wiki/Ryder_Windham",
  "/wiki/Star_Wars:_Episode_I_Adventures",
  "/wiki/Tony_Millionaire",
  "/wiki/Star_Wars_comic_books",
  "/wiki/June_30",
  "/wiki/2004",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Insider",
  "/wiki/We_Need_to_Talk_About_Jar_Jar",
  "/wiki/Star_Wars_Insider_131",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Marvel_Comics"
 ]
}