{
 "name": "Jarek Yeager",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yeager family",
      "Alliance to Restore the Republic",
      "New Republic",
      "New Republic Starfighter Corps",
      "New Republic Starfighter Corps",
      "Team Fireball",
      "Resistance",
      "Team Colossus",
      "Team Colossus",
      "Ace Squadron",
      "Citizens' Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Jarek Yeager was a human male mechanic who owned a repair shop on the Colossus during the era of the New Republic. A former rebel pilot, commander, and veteran of the Galactic Civil War, Yeager once served with the Alliance to Restore the Republic. After the war, he sought a quiet, peaceful life and, therefore, retired to a refueling installation located on the ocean planet Castilon in the galaxy's Outer Rim Territories.\nIn addition to his occupation as a mechanic and shopkeeper, Yeager was the leader of a racing team known as Team Fireball, which consisted of a younger generation of starship pilots. During the Cold War, his team accepted the New Republic pilot Kazuda Xiono as the newest addition to their ranks. Although Yeager permitted Xiono to work as a member of his crew, he knew the young pilot was, in fact, a spy for the Resistance and wanted no part in their conflict with the First Order.\nDuring the Galactic Civil War, Jarek Yeager served as a Rebel pilot in the Alliance to Restore the Republic, and later with the New Republic when he participated in the Battle of Jakku. At the end of the battle, Yeager was photographed alongside his victorious X-wing squadron in front of the wreckage of a downed Star Destroyer. During Yeager's service as a rebel pilot, he served as a commander.\nFollowing the defeat of the Galactic Empire and subsequent rise of the New Republic, Yeager started a family; marrying a woman and having a daughter with her. At one point, Yeager was photographed with his family on the planet Batuu. Yeager also became a successful racer, earning the envy of his younger brother, Marcus Speedstar. During one such racing event around 24 ABY, that both Yeager and Speedstar were competing in, Speedstar used large amounts of coaxium to fuel his ship in an effort to beat Yeager. However, Speedstar's ship crashed, killing Yeager's wife and daughter, who were attending the event at the time. Furious at Speedstar's actions, Yeager ceased contact with him for many years.\nAt some point following the deaths of his wife and daughter, Yeager retired to the Outer Rim Territories, where he settled on the ocean planet of Castilon as a member of the Colossus community. While living on the refueling station, Yeager established himself as a starship mechanic, a repair shop owner, and the leader of Team Fireball — a racing team composed of a younger generation of mechanics and pilots, including Neeku Vozo and Tamara Ryvora. In addition to its organic members, Yeager's team was served by his droid R1-J5, a decrepit and obsolete astromech commonly referred to as \"Bucket.\" Yeager also at one point competed in the station's races, often winning, but by 34 ABY he no longer did so. He owned a supply of hyperfuel which he occasionally used as a boost when racing.\nAt the height of the Cold War, the Resistance planted a spy on the Colossus in the hopes of gathering intelligence on the rising threat of the First Order. Resistance Commander Poe Dameron, who was an old friend of Yeager's, asked him to hire the spy, former New Republic pilot Kazuda Xiono, as a worker at his shop as cover. Yeager had misgivings, especially after Xiono was embroiled in a bar brawl less than an hour after arriving, but acquiesced, although he wanted nothing to do with the conflict between the Resistance and the secretive First Order.\nYeager and his team had to quickly to fix up an old racing ship, the decrepit Fireball, for Xiono to use in a solo race he had been unwillingly signed up for by the overly-eager Vozo. Ryvora was displeased, as Yeager had promised her the ship, and he told her he was doing it as a favor for a friend. Yeager was unimpressed with the used parts Xiono acquired for the ship, who hadn't had enough credits to pay for new parts. In the race the next day, Yeager warned Xiono not to fly too fast or he would cause the ship's engines to flame out. Xiono flew well, and eventually ignored the advice due to sensing victory, causing him to crash. After Xiono came to in the repair shop afterward, Yeager took him aside and told Xiono that, although he could work on Team Fireball, Yeager had no interest in getting involved in his mission.\nA short time later, Yeager and Team Fireball were hired to work on a shuttle belonging to Hallion Nark, a Neimoidian who claimed to be in a hurry. He was not impressed by Xiono taking an unnecessarily long time to fetch a part, and after Xiono accidentally made Nark lose his comlink, he promised to deduct the cost for it from Xiono's pay. Yeager was unaware that Nark was spying on the Colossus for pirate leader Kragan Gorr and his gang. During the pirates' subsequent attack, which coincided with a \"triple dark\" storm, Yeager took shelter with Ryvora, Vozo, and Bucket in one of the platform's designated safe areas. When they returned to the repair shop, they found Xiono working on the Fireball, which he claimed to have been doing for the entire time. Yeager didn't believe Xiono when he was told that the spy had helped drive off the pirate attack.\nDue to Xiono's lack of mechanical skills and experience, he struggled to adjust to life at Yeager's repair station. When Xiono failed to repair an engine, Yeager did not allow the youth to go to the races and ordered him to finish the engine by the end of the day. When a careless Xiono allowed the hoversled carrying the engine to fall overboard, Yeager chastised Xiono for being distracted by the races and warned him not to blow his cover as a spy.\nDuring his break time, Xiono went to Aunt Z's Tavern where he was befriended by the racer Jace Rucklin and his associates Lin Gaava and Gorrak Wiles, who lived seemingly carefree lives. Rucklin, who wanted to steal a canister of hyperfuel from Yeager, sought to gain Xiono's trust by inviting him out for a speeder bike race. Rucklin managed to gain Xiono's trust by staging an accident and rescuing him.\nWhen Xiono failed to return from his break, Yeager confronted him and chastised Xiono for being two hours late. Back at the garage, Yeager chastised Xiono for his tardiness and reiterated his order to fix the engine. Later, Rucklin convinced Xiono to let him into Yeager's trophy room under the pretext of wanting to see Yeager's racer. While there, he took the opportunity to steal a canister of hyperfuel. The two also narrowly avoided being detected by Bucket, who was fetching a macro-fuser for Yeager.\nLater, Bucket discovered that the hyperfuel canister was missing and alerted Yeager. When Xiono learned of the volatile nature of hyperfuel from Vozo, he rushed to Rucklin's hangar and tried to warn him. Xiono managed to save Rucklin but Jace's racer was destroyed in the process. Yeager helped BB-8 to rescue Xiono and Rucklin from the sea.\nWhile Yeager was angry at Kaz for letting Rucklin take advantage of him, Yeager decided to give Xiono a second chance. While accepting Kaz was not a skilled mechanical or spy, he told Kaz that he was a good person and that Rucklin was lucky to have him as a friend. Yeager told Xiono to improve his skills as a mechanic and allowed him to repair the engine while watching the race above.\nBefore leaving the repair shop, Yeager warned Kaz to be careful not to damage the casing while he, Ryvora, and Vozo were installing an acceleration compensator aboard the Fireball. Despite his warnings, Kaz damaged the compensator. While searching for funds to procure a new compensator, Xiono, Ryvora, and BB-8 were caught up in a plot to locate two child refugees named Kel and Eila, who had survived a First Order massacre on Tehar. Xiono and his friends managed to hide and protect the children from the First Order with the help of the Chelidae engineers and mechanics who lived in the engineering deck.\nLater, Yeager woke up Xiono early in the morning for a \"salvaging job\" off-platform. Yeager flew Xiono on a Star Commuter 2000 to rendezvous with Captain Dameron for a training flight aboard a T-70 X-wing starfighter. While flying, the two responded to a distress call from a Darius G-class freighter in the Castilon system's sector six. After braving several Kowakian monkey-lizards and a Kowakian ape-lizard, the two managed to rescue the pirate Synara San, who posed as a crew member. While Yeager was reluctant to take a stranger aboard, he allowed Xiono to bring the unconscious Synara for medical treatment. As a result, the Warbirds gained a spy aboard the Colossus.\nFollowing Xiono's adventures in Sector six, Yeager sent BB-8 to find Xiono because he wanted to show him how to operate a targeting computer. BB-8 visited the Colossus marketplace and Aunt Z's Tavern only to find Xiono working on the targeting computer. Xiono asked BB-8 to find Yeager, causing the droid to bow his head in exasperation.\nLater, Yeager and his Team Fireball received a contract from Captain Doza to service the station's aerial defense system's tracking computer. Since Ace Squadron was escorting an important supply mission, Captain Doza told Yeager to have the cannons ready within three hours as the Colossus platform was otherwise defenseless.\nAfter learning that the tracking computer needed a CoMar Tri-Tracker chip, Yeager ordered Xiono and Ryvora to obtain a new one and kept Vozo in the garage due to his tendency to blurt out secrets. With the help of Synara San, Kaz and Tam managed to obtain a new tri-tracker chip. Yeager was pleased and ordered Neeku to keep it a secret. Neeku took his command literally and muffled his speech.\nYeager then met with Captain Doza to discuss the threat posed by the pirates. Yeager claimed they had all the necessary parts but that installation was problematic. Captain Doza was concerned about leaving the station defenseless due to the growing effectiveness of the pirate raids. Yeager promised to have the aerial defense system operational within the hour.\nMeanwhile, Ryvora befriending Synara San in the marketplace. She was unaware that Synara San was a pirate and had informed Kragan Gorr about the Colossus' lack of defenses. When Tam returned, Yeager expressed disappointment that they were behind schedule. Shortly later, the Warbirds attacked the Colossus. While Tam went to find her new friend Synara, Yeager enlisted Xiono's help in installing the tracking computer.\nThe two transported the tracking computer on a repulsorlift to the anti-aircraft cannons but were harried by Kragan Gorr and his pirates. Following a fierce fight, Yeager and Xiono managed to install the computer into the anti-air defense system. This allowed Captain Doza to open fire on the pirate ships. Yeager was impressed by Xiono's courage and complimented the young man.\nFollowing the attack, Yeager met with Neeku, who told him that he and Bucket had taken shelter during the raid. Yeager told Kaz that it was no coincidence that the pirates had chosen to attack the Colossus when the Aces were away. He rightfully speculated that the pirates had a spy on the Colossus.\nLater, Captain Doza invited Yeager to participate in the upcoming Platform Classic against his estranged younger brother, Speedstar. While Yeager's employees particularly Kaz and Tam were excited about the upcoming race and Speedstar, Yeager was unhappy to see his younger brother, whom he still blamed for the deaths of his wife and daughter. Yeager refused to speak to his brother and stormed out of the meeting.\nWhen Speedstar visited Yeager's garage, Yeager refused to speak with his younger brother, spurning Speedstar's efforts at reconciliation. When Kaz and Tam pressed Yeager on his reasons for refusing to race Speedstar, Yeager refused to discuss his past and motives. After Tam insinuated that Speedstar was the better pilot, Yeager went to confront Speedstar at Aunt Z's Tavern.\nUnknown to Yeager, Speedstar was heavily in debt to the Guavian Death Gang and had signed up for the Platform Classic to pay off his debts. Yeager stumbled on a distraught Speedstar after Guavian enforcers took his friend Oplock hostage to ensure that he would pay his debts. Still bitter towards Speedstar, Yeager tried to bully his brother into pulling out of the race. Determined to save his friend, Speedstar refused to pull out of the race and challenged Yeager to race him. In response, Aunt Z and her customers began placing bets on Yeager and Speedstar.\nAnnoyed at Kaz for admiring Speedstar, Yeager \"loaned\" Xiono as a mechanic. Yeager and Bucket then went to prepare Yeager's ship for the race. When Neeku asked why he had fallen out with his brother, Yeager replied that Speedstar had not been there for him but avoided talking about his family. Meanwhile, Kaz learned about Speedstar's role in a tragic racing accident that claimed the lives of Yeager's family.\nThe following day, Yeager and Speedstar traded barbs over comlink prior to the race. During the Platform Classic, Yeager remained in the lead with Speedstar close behind. The two brothers cleared through the obstacle course hoops, the atmospheric climb, and the re-entry phases. During the final leg of the race, Speedstar reached out to his brother and apologized for causing the deaths of Yeager's family. He told Yeager that he was racing not for fame and money but to save his friend. Taking pity on his brother, Yeager pulled his racer out of the race, allowing Speedstar to reach the finish line first.\nBy winning the race, Speedstar was able to pay back his debts to the Guavian Death Gang and free his friend Oplock. The two brothers subsequently embraced each other. Yeager told Speedstar that it was good to have him back. While Yeager had still not fully reconciled with Speedstar, he promised that their relationship would be good one day.\nYeager allowed Xiono to \"borrow\" the Fireball for an offworld mission with Poe Dameron. When Bucket asked if Yeager had lent the ship to Xiono, Yeager quipped that he did not have much choice and said that Tam would find out soon. Shortly later, an angry Ryvora confronted Yeager over letting Xiono fly \"her ship.\" Yeager responded that the Fireball was still technically his ship. However, Ryvora countered that she had \"forgotten\" to install a new stabilizer on the fighter.\nTo reward Neeku for his hard work, Yeager treated him for a meal. Vozo got Yeager to purchase him a gorg from Bolza Grool's stand as a meal. However, the gorg escaped and led Neeku on a wild chase through the Colossus market. Vozo managed to recapture the gorg but decided to have bantha milk instead. While Grool returned the gorg to its tank, Yeager told BB-8 that Neeku could have easily gotten a droid instead.\nYeager reacted with hostility to Neeku's new pet baby rokkna Bibo, which had a foul smell and wreaked havoc on Yeager's garage. Despite his \"no pet\" policy, Yeager reluctantly allowed Neeku to keep Bibo on the condition that he kept him under control. Despite Neeku's efforts to keep Bibo contained in a stack of crates, the rokkna broke lose and wrought more havoc in the garage, disturbing Tam and Bucket.\nHaving had enough of Bibo's trouble, Yeager ordered Neeku to get rid of his pet. Yeager's words hurt Neeku, who responded that that he would also leave. When Yeager expressed shock, Neeku told Yeager that he had asked nothing from him in all his years of service but that if he rejected his precious Bibo he would resign. After Bibo fled, Neeku went in search of him. Yeager warned Tam not to follow Neeku but she chastised him for his perceived double standards towards Kaz and Neeku.\nYeager later softened his stance towards Neeku and informed Tam of a \"disturbance\" in the engineering deck. Tam and Neeku found Bibo with the human orphans Kel and Eila and the Chelidae engineers. Shortly later, Bibo's mother attacked the Colossus, seeking to reclaim her child. Despite efforts by Ace Squadron and Kaz to fight off the sea creature, they were unable to drive it away. After realizing that the creature was after Bibo, Neeku returned Bibo to his mother, ending the siege.\nYeager had his team continue working on the Fireball. He was surprised when Kaz found new parts for the Fireball by agreeing to help Flix and Orka watch their shop. Yeager was also impressed with Kaz's improved mechanical skills. He allowed Kaz to look after Flix and Orka's shop, the Office of Acquisitions. Kaz subsequently foiled a First Order plot to steal a phase connector.\nFollowing the abduction of Captain Doza's daughter, the First Order was allowed to bring storm troopers to help with the Platform's security. Yeager did not want Kaz to send a message, knowing the First Order would arrest him, Kaz, and the rest of their team. He told Kaz to wait until Dameron contacted him or Kaz would revealed as a spy. When stormtroopers started to question Kaz, Yeager told them that he was no pirate, let alone a spy. After the stormtroopers left, Yeager told Kaz to keep his head down till things cool down.\nYeager spoke with his team about the First Order's presence on the platform. Yeager said that the First Order is just like the Galactic Empire. He said that they have curtailed their freedom in exchange for \"protection.\" Kaz agreed with him, much to chagrin of Tam. Yeager warned Kaz not to get caught, due to the First Order making people \"disappear.\" After Kaz's charade as a stormtrooper, Yeager was told by Kaz that the First Order cataloging and identifying everyone on the platform. He was then shown a starmap that displayed First Order fleets. Yeager knew that the Colossus was important to the First Order's military supply line.\nYeager stood by and watched as the First Order's TIE's flew patrols around the platform. He checked on Kaz who was attempting to build a transmitter to contact the Resistance. Yeager knew the transmitter could not get past the First Order's communication blanket. Despite the setback, Yeager and Kaz met up with Dameron after he got past the First Order's TIE and stormtrooper patrols. Yeager and Kaz showed Dameron the star map, and told him that the First Order was moving lots of fuel through the platform. Yeager then had Kaz show Dameron the latest intelligence about something in the Unknown Regions. Yeager allowed Kaz to take the Fireball to investigate the location with Dameron despite the risk of the Widowmaker maneuver.\nAfter Kaz's mission, Kaz told Yeager that the First Order is capable of way worse things than they thought. Yeager told Tam that Kaz's whereabouts were not her concern much to her chagrin. As the First Order continued to exercise more control over the platform, Yeager worked with Captain Doza in contacting the resistance. Kaz and Torra discovered this after the First Order started to round up dissidents such Hype Fazon, Aunt Z, and others. Yeager allowed Kaz and Torra to free the others before the First Order take them offworld. Unfortunately, Yeager was confronted by several stormtroopers after the prisoners escaped to Takodana.\nYeager denied Commander Pyre's accusations that the Fireball had been to Sector Epsilon 51-3. Unfortunately, they had visual confirmation that Yeager and his team were lying about the Fireball's involvement with the Resistance. As the stormtroopers attempted to take Yeager and his team into custody, Bucket distracted the troopers. Yeager was able to knock out several of the stormtroopers off the platform. Yeager, Kaz, and Neeku made their way to his office. However, Tam chose to stay and surrender to the First Order. Yeager watched as the stormtroopers shot Bucket off the platform.\nYeager, Kaz, and Neeku made their way through the grates past the stormtroopers. They met up with Kel and Eilao who led them down to the engineering room where they met up withthe Chelidae. There, Kaz revealed himself to Neeku and the children as a Resistance spy. Yeager also found that Bucket had been saved and repaired by the Chelidae. With Kaz, they worked on a way to contact the resistance. Yeager agreed with Kaz's plan to partially sink the platform in order to reach the Jammer. After sending CB-23 to ask Doza to seal all the hatches.\nAfter Yeager shutdown the platform's turbines, he, Kaz and CB-23 swam up to the jammer. There, CB-23 was able to send a message to the Resistance. However, several stormtroopers attacked them. Yeager then pushed Kaz back into the water with CB-23. He was captured and arrested by the stormtroopers. Yeager was interrogated where he confess that he was the one fly into the Sector Epsilon 51-3 and was the Resistance spy much to Tam's shock. He also said that he attempted to recruit Kaz into the Resistance.\nYeager tried to explain, but Tam was angry at him for lying to her after the First Order showed her his confession. He was placed in a cell with Captain Doza and continued his attempt to escape.\nFollowing the destruction of Hosnian Prime by Starkiller Base, Yeager and Doza were freed by Torra and Kaz. He informed Yeager of Hosnian Prime's destruction and his plan to get the Colossus into space and make for the Resistance base. Yeager and Doza were able stun the stormtroopers and return to Doza's office. Yeager, despite the need to get the platform airborne, decided to get Tam before the First Order takes her offworld. Kaz, who was a friend of Tam, decided to come with Yeager.\nWhile Kaz, Torra and CB-23 watched from the top of Doza Tower, Yeager attempted to reason with Tam, who was walking with Agent Tierny and Commander Pyre towards a waiting Upsilon-class command shuttle. Kaz called out to Tam but she rebuffed him, angry that he had lied to her about his work with the Resistance. Yeager supported Kaz's words, telling Tam that he was telling the truth.\nTam accused Yeager of exploiting her and betraying her trust as a fatherly figure. Yeager responded that the First Order were lying and manipulating her but Agent Tierny claimed that the First Order was offering Tam protection and a higher purpose and denounced Yeager as a danger to those around him. Two stormtroopers surrounded Yeager while four converged on Kaz, Torra, and CB-23. Commander Pyre ordered Yeager and his comrades to surrender.\nHowever, Neeku and his team had powered up the Colossus's engines, causing the station to rise. The two stormtroopers flanking Yeager fell into the sea while CB-23 squirted oil, causing the stormtroopers on the tower to fall. Amidst a gun battle, Yeager pleaded with Tam to stay but she chose to follow Tierny and Pyre aboard their shuttle, angry at Yeager and Kaz for their secrecy.\nAs the Colossus ascended into space, Yeager along with Kaz and Torra freed the other Aces from their cell and climbed into their fighters. Yeager flew in his racer with Bucket. Joined by Aunt Z who had returned in a stolen Atmospheric Assault Lander and the Warbird gang, Yeager, Kaz and the Aces fought against Major Elrik Vonreg and his squadron. They shot down several TIEs with Kaz taking out Major Vonreg.\nAfter Yeager and his fellow flyers had returned the Colossus, the station fled into hyperspace, escaping the Thunderer. While traveling through hyperspace bound for the Resistance base on D'Qar, Yeager praised Kaz for his courage and leadership. They and the other Colossus resistance members watched the hyperspace tunnel.\nWhen the Colossus dropped out of hyperspace three parsecs away D'Qar, Yeager went to command deck. There, he informed Doza that the platform's cannons, deflector shields and engines had malfunctions. Yeager had 4D-M1N send a transmission to D'Qar's Resistance base, but discovered that long-range communication were not operational. Yeager sent Torra and Xiono to check the communications system. They discovered that MB-13A was attempting to contact the Thunderer. Fortunately, Torra, Xiono and CB-23 were able to jettison MB-13A into space.\nUpon the Colossus's arrival at D'Qar, Yeager allowed Xiono to receive a message from his father, Senator Hamato Xiono. Later, Yeager, Doza, and Xiono saw debris left behind from the Resistance's retreat. Despite this, Yeager knew that General Organa and Commander Dameron were on the other side of the galaxy by now. Yeager also supported Xiono's plan to have him and the warbirds salvage coaxium from the wreckage of the Fulminatrix. During the salvage mission, the Thunderer arrived. However, the Colossus was able to escape.\nFollowing the Battle of Castilon and the Skirmish over D'Qar, Yeager joined the Ace Squadron along with Kaz and became their new instructor and squadron leader. Yeager assured the Aces that he was teaching them how to defend their home, not join the Resistance. Yeager brought the aces to his hangar to discuss a training mission at Celsor 3.\nOn the ice moon, Yeager and Kaz had the aces partner up for a mock skirmish. He and Kaz were able to stun all the aces. He chastised Fazon for being more of a racer than a combat pilot. Despit Fazon's lack of interest, Yeager decided to pair Kaz up with Fazon to help him. During the second exercise, Yeager watched the aces take each other on. Unfortunately, the aces came under attack by a Jakoosk. Yeager helped Fazon in breaking free from the creature, but was caught by it. He was saved when the other aces were able to trap the Jakoosk and force it to free Yeager.\nFollowing the exercise, Yeager spoke with Captain Doza about allowing people to leave due to the First Order's continuous hunt for the station. He knew that if people left the station, the First Order would eliminate them. Yeager then agreed to allow Kaz and Torra to assist the pirates in hunting the Jakoosk before Doza had mutiny on his hands. Following a failed attempt by the Warbirds to hunt the Jakoosk, Kaz and Torra Doza managed to hunt down and kill the creature, which provided enough meet for the inhabitants of the Colossus.\nYeager had Neeku work on fixing the long-range scanners in order to detect the First Order. When the station received a distress from a female Nikto, Yeager believed it was First Order trap. He allowed Kaz and Neeku to go and investigate. The Nikto, Nenavakasa Nalor, met Yeager when she and her ship were brought aboard the station. He became impressed with abilities as a mechanic and engineer. Yeager and Doza believed her when she told that the Warbird pirates were siphoning power from the station. However, Kaz with the help of Synara San discovered that Nalor hired by the First Order. Though Nalor escaped, Yeager worked with Kaz, Neeku, Synara and the Warbirds to reverse her sabotage so that the Colossus could escape into hyperspace.\nYeager was present when Captain Doza dispatched Xiono, Torra, CB-23, and the Ace pilot Freya Fenris on a mission to salvage supplies on the terrestrial world of Ashas Rees. Yeager told Kaz prior to the mission that Ashas Rees was the only civilization in this part of space and to prepare the shuttle. He told Captain Doza not to worry. The orphans Kel and Eila stowed aboard for the mission. During the mission on Ashas Rees, Kaz and his team discovered an ancient Sith temple and rescued the archaeologist Mika Grey, who helped them escape from several First Order Raiders.\nDuring an attempt by Captain Doza to rendezvous with his wife Resistance fighter pilot Commander Venisa Doza, the Colossus came under attack from First Order TIE fighters. Yeager commanded the defense of the station alongside Captain Doza while Ace Squadron fought the First Order fighters. Though the Colossus managed to flee into hyperspace, they were unable to rendezvous with Venisa. This upset Torra Doza, who missed her mother. Fortunately for Torra, Kaz and Ace Squadron managed to cheer her up by baking a birthday cake for her.\nIn 35 ABY, a couple of months after rescuing Tam from the First Order, Yeager and the rest of his friends on the Colossus picked up a distress call from General Lando Calrissian as Dameron, who had just become the Acting General of the Resistance after Organa passed away, sent him to gather a Citizens' Fleet that could help pull a victory in the Battle of Exegol after it was revealed that Darth Sidious brought himself back to life and was going to combine his fleet with the First Order to regain his evil Empire so he could rule the galaxy again. Yeager and the Colossus resistance joined General Calrissian and led the aces including Kaz and Torra to destroy the axial superlasers of the Xyston-class Star Destroyers after learning that was their weak spots. Once Sidious and his fleet faced a permanent defeat, Yeager and the Colossus resistance flew away with the Citizens' Fleet from Exegol and to the Resistance's new base on Ajan Kloss so they could celebrate with General Dameron and what's left of his forces since there was a galactic wide uprising against the First Order that was going on causing the First Order-Resistance War to end up as a victory for the Resistance.\nJarek Yeager was a human male with brown eyes and dark skin. By the time of the cold war, approximately three decades after the Battle of Endor, his black hair had begun to turn gray.\nHaving survived the Galactic Civil War, Yeager enjoyed his retirement on the Colossus, which kept him far removed from the central systems of the galaxy. Possessing a life's worth of experience, Yeager was noted for his quiet and hardworking attitude, as well as the wisdom that came with age. Yeager could be a demanding employer who expected high standards from his employees. However, he respected Xiono's willingness to save his friends from danger.\nYeager was deeply affected by the loss of his wife and daughter during a racing accident caused by his younger brother Marcus Speedstar. Yeager severed his relationship with Speedstar and turned his back on his racing career. Yeager's bitterness towards Speedstar led him to reject his younger brother's efforts at reconciling with him. Yeager's feelings towards Speedstar softened after realizing that Speedstar did care for his friend Oplock, who had been held for ransom by the Guavian Death Gang. While Yeager was still unable to forgive Speedstar for the moment, he allowed him to win so that Speedstar could save his friend Oplock.\nAs a veteran of the Galactic Civil War, Yeager recognized the totalitarian and military danger that the First Order posed to the galaxy, a view that was shared by Kazuda Xiono. During the First Order occupation of the Colossus, Yeager worked with Kaz and Commander Doza to prepare a resistance against the occupiers. After Kaz's cover was blown, he put his military experience to good use in guiding Xiono and Neeku as they sank the Colossus in order to send a transmission to the Resistance. Though captured by the First Order, Yeager remained defiant and tried to protect Xiono.\nYeager was an old friend of Resistance ace pilot Poe Dameron and agreed to look after the young Resistance spy Kazuda Xiono as a favor to Poe.\nYeager regarded Tamara Ryvora as one of his most reliable mechanics and placed her in a supervisory role over Xiono. In return for working for him, Yeager promised Ryvora the starfighter Fireball if she repaired the ship. Ryvora was protective of the Fireball and objected to Yeager's decision to allow Xiono to ride the starship. As a precaution, Ryvora once disabled the ship's stabilizer to express her opposition to others flying the Fireball.\nYeager and Ryvora also disagreed about the Galactic Empire and the First Order. While Ryvora welcomed the employment opportunities the Empire brought her grandfather, Yeager recognized that the Empire took advantage of the vulnerable. While Ryvora welcomed the protection that the First Order brought the Colossus, Yeager feared that the First Order was taking away liberty under the guise of protection.\nRyvora grew to resent Yeager for his perceived leniency towards Xiono and for keeping secrets from her. After First Order forces raided Yeager's garage, Ryvora came to resent Yeager for his secrecy and perceived exploitation. Her anger towards Yeager and Xiono for their secrecy led her to join the First Order.\nJarek Yeager and his younger brother Marcus Speedstar were once close, having both being New Republic pilots and racers. The two brothers fell out after Speedstar's negligence caused the deaths of Yeager's wife and daughter during a race. A bitter Yeager cut Speedstar out of his life and refused to speak with him. Yeager forgave Speedstar after realizing that Speedstar was racing in the Platform Classic in order to save his friend Oplock, who was being held hostage by the Guavian Death Gang.\nJarek Yeager regarded Neeku Vozo as a loyal and hardworking employee who was willing to work for little. Yeager did not understand Neeku's love for his \"pet\" rokkna Bibo and was annoyed when Bibo wrecked havoc at his garage. When Yeager ordered Neeku to get rid of Bibo, Neeku was hurt and took that as a rejection of his hard work. Yeager's harsh response to Neeku led Tam to criticize his perceived leniency towards Xiono.\nThough a father figure to the young members of Team Fireball, Yeager found Kazuda Xiono to be a source of both trouble and grief due to the latter's spying activities. Knowing Xiono's ties to the Resistance, the former pilot declared that he had no intention of getting involved in their fight against the First Order.\nYeager was frustrated by Xiono's lack of mechanical savvy and tardiness. However, he recognized that Xiono was a good person and gave him a second chance after he saved Rucklin's life during a racing accident. As Xiono's mechanical abilities improved, he earned the praise of Yeager and the other Team Fireball members Tam and Neeku.\nPossessing a lifetime of experience, Jarek Yeager's skills included piloting and repairing starships. He was also experienced at running a local business through his occupation as a repair-shop owner on the Colossus installation. Yeager knew how to handle a blaster, easily helping stun a pair of First Order stormtroopers after being rescued by Kazuda Xiono. Yeager also put his skills as a fighter pilot to good use during the Colossus's escape from the First Order, shooting down TIE fighters.\nJarek Yeager is a character created and developed for the Star Wars Resistance animated series. He first appeared in \"The Recruit,\" the first episode of the series. He is voiced by Scott Lawrence, who was the official voice of Darth Vader in all Star Wars games from 1994 to 2006 when Matthew Sloan became the official voice of Vader in spin-off material.\nLucasfilm Story Group member Pablo Hidalgo has noted that Yeager's racer participates in the Battle of Exegol in the 2019 film Star Wars: Episode IX The Rise of Skywalker, though he does not state that Yeager himself was flying the vessel.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars_Resistance_Season_Two",
  "/wiki/Ace_Squadron_(Star_Wars_Encyclopedia)",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Yeager_family",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Starfighter_Corps",
  "/wiki/Team_Fireball",
  "/wiki/Resistance",
  "/wiki/Team_Colossus",
  "/wiki/Ace_Squadron",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Technician",
  "/wiki/Jarek_Yeager%27s_Repair_Station",
  "/wiki/Colossus",
  "/wiki/New_Republic_Era",
  "/wiki/Rebel_pilot",
  "/wiki/Commander",
  "/wiki/Galactic_Civil_War",
  "/wiki/Fuel",
  "/wiki/Ocean",
  "/wiki/Planet",
  "/wiki/Castilon",
  "/wiki/The_galaxy",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Starship",
  "/wiki/Pilot",
  "/wiki/Cold_War",
  "/wiki/New_Republic_pilot",
  "/wiki/Kazuda_Xiono",
  "/wiki/Spy",
  "/wiki/First_Order",
  "/wiki/Battle_of_Jakku",
  "/wiki/Star_Destroyer",
  "/wiki/Galactic_Empire",
  "/wiki/Jarek_Yeager%27s_wife",
  "/wiki/Jarek_Yeager%27s_daughter",
  "/wiki/Batuu",
  "/wiki/Marcus_Speedstar",
  "/wiki/24_ABY",
  "/wiki/Coaxium",
  "/wiki/Neeku_Vozo",
  "/wiki/Tamara_Ryvora",
  "/wiki/Species",
  "/wiki/Droid",
  "/wiki/R1-J5",
  "/wiki/Astromech_droid",
  "/wiki/34_ABY",
  "/wiki/Poe_Dameron",
  "/wiki/Fireball",
  "/wiki/Race_between_Kazuda_Xiono_and_Torra_Doza",
  "/wiki/Mission_on_the_Colossus_platform",
  "/wiki/Hallion_Nark",
  "/wiki/Neimoidian",
  "/wiki/Comlink",
  "/wiki/Pirate",
  "/wiki/Kragan_Gorr",
  "/wiki/Warbird_gang",
  "/wiki/Raid_on_the_Colossus",
  "/wiki/Triple_dark",
  "/wiki/Hoversled",
  "/wiki/Aunt_Z%27s_Tavern",
  "/wiki/Jace_Rucklin",
  "/wiki/Lin_Gaava",
  "/wiki/Gorrak_Wiles",
  "/wiki/Speeder_bike",
  "/wiki/Jace_Rucklin%27s_hangar",
  "/wiki/Jace_Rucklin%27s_racer",
  "/wiki/Acceleration_compensator",
  "/wiki/Kel",
  "/wiki/Eila",
  "/wiki/Tehar",
  "/wiki/Chelidae",
  "/wiki/Star_Commuter_2000",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Investigation_of_a_G-class_freighter",
  "/wiki/Darius_G-class_freighter",
  "/wiki/Castilon_system",
  "/wiki/Sector_six_(Castilon_system)",
  "/wiki/Kowakian_monkey-lizard",
  "/wiki/Kowakian_ape-lizard",
  "/wiki/Synara_San",
  "/wiki/Targeting_computer",
  "/wiki/Colossus_marketplace",
  "/wiki/CoMar_Tri-Tracker_chip",
  "/wiki/Repulsorlift",
  "/wiki/Platform_Classic",
  "/wiki/Guavian_Death_Gang",
  "/wiki/Oplock",
  "/wiki/Yeager%27s_ship",
  "/wiki/Mission_to_Station_Theta_Black",
  "/wiki/Stabilizer",
  "/wiki/Gorg",
  "/wiki/Bolza_Grool",
  "/wiki/Bantha",
  "/wiki/Milk",
  "/wiki/Rokkna",
  "/wiki/Bibo",
  "/wiki/Bibo%27s_mother",
  "/wiki/Bibo_incident",
  "/wiki/Office_of_Acquisitions",
  "/wiki/Theft_of_the_phase_connector",
  "/wiki/Phase_connector",
  "/wiki/Unknown_Regions",
  "/wiki/Widowmaker_(maneuver)",
  "/wiki/Hype_Fazon",
  "/wiki/Z%27Vk%27Thkrkza",
  "/wiki/Takodana",
  "/wiki/Sector_Epsilon_51-3",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Hosnian_Prime",
  "/wiki/Starkiller_Base",
  "/wiki/Doza%27s_office",
  "/wiki/Agent",
  "/wiki/Tierny",
  "/wiki/Upsilon-class_command_shuttle",
  "/wiki/AAL-1971/9.1_Troop_Transport",
  "/wiki/Elrik_Vonreg",
  "/wiki/Elrik_Vonreg%27s_squadron",
  "/wiki/Thunderer",
  "/wiki/Resistance_base",
  "/wiki/D%27Qar",
  "/wiki/4D-M1N",
  "/wiki/MB-13A",
  "/wiki/Hamato_Xiono",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/Fulminatrix",
  "/wiki/Battle_of_Castilon",
  "/wiki/Skirmish_over_D%27Qar",
  "/wiki/Celsor_3",
  "/wiki/Jakoosk",
  "/wiki/Nenavakasa_Nalor",
  "/wiki/Freya_Fenris",
  "/wiki/Mission_to_Ashas_Ree",
  "/wiki/Sith_Temple_(Ashas_Ree)",
  "/wiki/Archaeologist",
  "/wiki/Mika_Grey",
  "/wiki/First_Order_Raider",
  "/wiki/Venisa_Doza",
  "/wiki/35_ABY",
  "/wiki/Rescue_of_Tamara_Ryvora",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Battle_of_Exegol",
  "/wiki/Darth_Sidious",
  "/wiki/Final_Order",
  "/wiki/Axial_superlaser",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Exegol",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Ajan_Kloss",
  "/wiki/Uprising_against_the_First_Order",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Eye",
  "/wiki/Time",
  "/wiki/Standard_decade",
  "/wiki/Battle_of_Endor",
  "/wiki/Hair",
  "/wiki/Galaxy",
  "/wiki/Core_Worlds",
  "/wiki/Star_system",
  "/wiki/Tamara_Ryvora%27s_grandfather",
  "/wiki/Parent",
  "/wiki/Brandon_Auman",
  "/wiki/Dave_Filoni",
  "/wiki/Justin_Ridge",
  "/wiki/Star_Wars_Resistance",
  "/wiki/The_Recruit",
  "/wiki/Scott_Lawrence",
  "/wiki/Anakin_Skywalker",
  "/wiki/Matthew_Sloan",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/The_Triple_Dark",
  "/wiki/Fuel_for_the_Fire",
  "/wiki/The_High_Tower",
  "/wiki/The_Children_from_Tehar",
  "/wiki/Signal_from_Sector_Six",
  "/wiki/The_Search_for_Kaz",
  "/wiki/Synara%27s_Score",
  "/wiki/The_Platform_Classic",
  "/wiki/Station_Theta_Black_(episode)",
  "/wiki/Neeku%27s_Reward",
  "/wiki/Bibo_(episode)",
  "/wiki/Dangerous_Business",
  "/wiki/The_Doza_Dilemma",
  "/wiki/The_First_Order_Occupation",
  "/wiki/The_New_Trooper",
  "/wiki/The_Core_Problem",
  "/wiki/The_Disappeared",
  "/wiki/Descent_(episode)",
  "/wiki/No_Escape:_Part_1",
  "/wiki/No_Escape:_Part_2",
  "/wiki/Into_the_Unknown",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/Live_Fire",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/The_Engineer",
  "/wiki/From_Beneath",
  "/wiki/The_Relic_Raiders",
  "/wiki/Rendezvous_Point_(episode)",
  "/wiki/The_Voxx_Vortex_5000",
  "/wiki/Kaz%27s_Curse",
  "/wiki/Station_to_Station",
  "/wiki/The_Missing_Agent",
  "/wiki/Breakout",
  "/wiki/The_Mutiny",
  "/wiki/The_New_World",
  "/wiki/No_Place_Safe",
  "/wiki/Rebuilding_the_Resistance",
  "/wiki/The_Escape",
  "/wiki/Star_Wars_Resistance_Racer",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Resistance:_Meet_the_Pilots",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2019_Topps_Star_Wars_Resistance_Surprise_Packs",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_191",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Fireball_Expansion_Pack",
  "/wiki/Resistance_To_The_End",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Jarek_Yeager",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/August_17",
  "/wiki/2018",
  "/wiki/August_6",
  "/wiki/2020"
 ]
}