{
 "name": "Jarea_Kaela",
 "display_name": "Jarea Kaela",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quermian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Apprentices",
     "values": [
      "Harlon Grer"
     ]
    }
   ]
  }
 ],
 "content": "Jarea Kaela was a Force-sensitive female beast master active during the reign of the Galactic Empire.\nA Force-sensitive Quermian, Jarea Kaela was a beast master who used her connection to the Force to bond with a nexu she called Hassi. During the Galactic Civil War Kaela had attracted the attention of the Inquisitorius, a guild of hunters intent on capturing or destroying Forceful individuals. Fleeing her home to protect those around her, she was tracked from world to world by agents of the Galactic Empire. The first bounty hunter took her unawares, which cost her the use of her eyes. Successfully killing each successive attacker with her lightsaber, Kaela moved from world to world in a heavy robe and signature wide-brimmed hat, gaining a reputation as a witch of great power and evil.\nHiding in the swamps of the planet Karalle, Kaela used a mannequin of herself to distract her latest hunter, Harlon Grer. Catching Grer by surprise after he thought he had killed her, Kaela demanded to know why Grer wished her dead. While Grer initially hoped to outsmart her because of her blindness, he was seduced by her kindness, and her offer to train him. He only agreed to be trained by the saber-wielder when his employer, an Imperial Inquisitor, stepped out of the forest with a squad of stormtroopers ready to kill them both. Recognizing his fate lay in the hands of Kaela, Grer raised his blaster and opened fire on the Imperials",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Quermian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Harlon_Grer",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Beast_master",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Animal_bond",
  "/wiki/Nexu/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Savage_Spirits"
 ]
}