{
 "name": "Jarik",
 "display_name": "Jarik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Biewa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "StarForge Station"
     ]
    }
   ]
  }
 ],
 "content": "\"Skoot\" Jarik was an educated Human male droid engineer who unsuccessfully attempted to earn a living first as a droid technician, and then an information broker on his Outer Rim homeworld of Biewa. Eventually finding himself nearly destitute, Jarik used his skills as a droid slicer to illegally modify a droid for a smuggler. Soon afterward, word of his abilities spread, and Jarik had a profitable business as an outlaw tech.\nSometime later, Jarik relocated to the shadowport StarForge Station, where he was one of a select few individuals who specialized in droid modification. Jarik's workmanship developed a reputation as being reliable, and he was a favorite among smugglers who were owners of droids. At some point, StarForge was subject to an Imperial raid, and the evidence implicated Jarik as the informant. To aid him in clearing his name and uncovering the true traitor, Jarik offered his services to a group of recent arrivals to the space station.\n\"Skoot\" Jarik was a Human male droid engineer, who, upon graduating from the CSA Institute of Technology—an institute of learning associated with the governing body of the free enterprise Corporate Sector—returned to his homeworld of Biewa and struggled to earn a living as a droid technician, though he was unsuccessful. The citizens of his planet were not wealthy, and they spent what little credits they had available on their necessities, rather than droids. Jarik next attempted to support himself as an information broker, but was met with the same problem he had encountered as a droid tech—on a backwater world such as Biewa, few individuals were to be found who needed his services. Eventually, an impoverished Jarik gladly performed a number of illegal droid modifications for a smuggler, and soon after, word of his abilities as a droid slicer spread throughout the Fringe. Within a short period of time, Jarik had built a profitable business as an outlaw tech.\nSome time later, Jarik relocated to StarForge Station—a shadowport known for illicit repair and modification operations—and was one of the few individuals onboard the space station who specialized in droid modification. As such, he soon came to be the station's primary droid repair and maintenance technician. His workmanship was considered to be particularly reliable, and therefore the high prices Jarik commanded for his expertise were generally thought to be justified by those individuals who took advantage of his services. He was a favorite among those smugglers who were owners of droids.\nAt some point, the station was subject to an Imperial raid, although the station's inhabitants managed to dispose of the small patrol. Nevertheless, everyone was aware that it was likely additional Imperial ships would soon arrive. Apparently, someone had leaked information of the station's location to the Empire, and the evidence implicated Jarik as the informant, as he had recently repaired a probe droid of some kind. Jarik enlisted the aid of a group of individuals who had arrived on the station shortly before the raid to help him clear his name and find the individual who some believed to be the true traitor—a pirate who frequently visited StarForge station. Jarik offered the group his services in exchange for their help.\n\"Skoot\" Jarik was an educated droid engineer who was proficient in not only programming and repairing droids, but he also had the infrequently-encountered ability to build a droid from scratch. His competency and skills in his trade were exemplified by his workmanship being considered highly reliable by the individuals who took advantage of his expertise at StarForge. Jarik was also a shrewd individual, knowing that the quality of his work, and his reputation, allowed him to command a high price for his services. As an individual whose livelihood centered around droids, Jarik was quite often found carrying a droid toolkit. Furthermore, not only did he carry a regular blaster for protection but also a DEMP gun—an ion weapon designed to neutralize droids.\nAlthough he attempted to begin his career as a legitimate businessman, Jarik had soon found himself cash-strapped, and he did not hesitate—and was in fact more than happy—to venture beyond the law in order to earn a living. Having found that employing his skills as a droid slicer made him prosperous, Jarik welcomed the illegal nature of his career while working on StarForge Station.\n\"Skoot\" Jarik made his first appearance in Cynabar's Fantastic Technology: Droids, a West End Games sourcebook published in 1997 for Star Wars: The Roleplaying Game. His background was later detailed in The Complete Star Wars Encyclopedia, published in 2008.\nThe quest to aid Jarik in clearing his name of the implication that he is an informant is a scenario hook for gamemasters. As such, the reward for helping him can come in the form of Jarik either offering to modify the player characters' droid or building the group a droid from scratch, if they do not already possess one.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Droid/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Jarik_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Biewa",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/StarForge_Station",
  "/wiki/Engineer/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Outlaw_tech/Legends",
  "/wiki/Shadowport/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Corporate_Sector_Authority_Institute_of_Technology",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Starship/Legends",
  "/wiki/Probe_droid/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/DEMP_Ion_Pistol",
  "/wiki/Ion_blaster/Legends",
  "/wiki/Cynabar%27s_Fantastic_Technology:_Droids",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008"
 ]
}