{
 "name": "Jarid_DeBell",
 "display_name": "Jarid DeBell",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Jarid DeBell was a male Human Jedi Knight who served the Jedi Order and the Galactic Republic in the final decades of the Republic Classic era. After serving the Order as a Knight for a few years, DeBell turned in his lightsaber and retired his rank, becoming an adviser within the Republic government. Working with Senator Lavina Durada-Vashne Wren of the Cularin system in the Galactic Senate, he eventually married her, and they gave birth to a daughter, Night Forael Wren.\nDiscovered to be Force-sensitive during his childhood, Jarid DeBell did not study at the Coruscant Jedi Temple as did the vast majority of the Order's Initiates. Instead, DeBell was stationed at the experimental academy on Almas, overseen by the headmaster, Jedi Master Lanius Qel-Bertuk. Within the Cularin system, DeBell's training was conducted first at the academy, then abroad during an apprenticeship with a Master. Eventually passing his Trials of Knighthood, DeBell was declared a Jedi Knight and given assignments by the Almas Council.\nWhile he served in this capacity for a few years, DeBell eventually concluded that the Jedi path was not for him after all. Turning in his lightsaber and robes to Master Qel-Bertuk, DeBell left the Order and traveled to Coruscant, where he began working as an envoy and adviser within the Galactic Senate. Hired by the newly elected Senator Lavina Durada-Vashne Wren of the Cularin system, DeBell traveled between the stars on diplomatic errands, including a few brief forays into Hutt Space, which earned him the hatred of the Hutts. Following the Trade Federation's invasion of Naboo, DeBell was assigned by the Senate to act as an investigative envoy to the democratic monarchy as the government reestablished control over the world.\nAfter years of work together, the relationship between Envoy DeBell and Senator Wren evolved, and the two eventually were to be wed. Before the wedding, DeBell partook in a stag night, during which he consumed large quantities of Ithorian brandy and Rodian ale. During the wedding, the assassin Melo Centris, who had been hired by the Hutts, attempted to kill DeBell with a poisoned cake. However, the Heroes of Cularin were able to prevent this from happening. Surviving the assassination attempt, DeBell and Wren went on to have a daughter, whom they named Night Forael Wren.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Lightsaber/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Lavina_Durada-Vashne_Wren",
  "/wiki/Cularin_system",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Night_Forael_Wren",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Jedi_academy",
  "/wiki/Almas",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Almas_Council",
  "/wiki/Hutt_Space/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Ithorian_brandy",
  "/wiki/Rodian_ale",
  "/wiki/Melo_Centris",
  "/wiki/Heroes_of_Cularin",
  "/wiki/An_Official_Engagement",
  "/wiki/Belly_of_the_Beaast",
  "/wiki/Night%27s_Friend",
  "/wiki/Night%27s_Homecoming",
  "/wiki/Wizards.com",
  "/wiki/Senator_Wren%27s_Social_Calendar"
 ]
}