{
 "name": "Jarl",
 "display_name": "Jarl",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Weequay"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jarl's crew"
     ]
    }
   ]
  }
 ],
 "content": "Jarl was a Weequay male who led a crew on Coruscant. When the Mirialan Servit asked Jarl about what price a family droid of his would fetch, Jarl, knowing that the droid was connected to the legend of the moon Shara'Tam, tried to take it from Servit. The Mirialan refused and escaped to the eatery Dex's Diner but was followed by Jarl, who held up the entire restaurant to convince Servit to hand the droid over.\nShortly after, Jarl was knocked unconscious by Servit's friend and the diner's owner, Dexter Jettster, and following a firefight, Jarl had come to and held his blaster to Servit's neck to force him to reveal the droid's secrets. After the droid played a message that revealed Shara'Tam's coordinates, Jettster laughed, claiming that it had been destroyed. Jarl did not carefully check the coordinates and walked out of the diner, believing Jettster and grumbling at his lost fortune.\nJarl was a Weequay male who headed a crew on the planet Coruscant that consisted of a human, a Togruta, and a protocol droid, T7. At some point during the era of the Galactic Republic, a Mirialan named Servit asked Jarl about a family EX droid whose legend had been passed down with it, wondering its worth. As the legend was actually a well-known story about a great treasure on the moon Shara'Tam, Jarl tried to take the droid from Servit. The Mirialan refused, fled, and thought he had shaken them off, taking the droid to his Besalisk friend Dexter Jettster's restaurant, Dex's Diner. However, Jarl and his crew caught up to Servit and rounded up the diner's customers at blaster point. Jarl waved his own blaster when he saw Servit, greeting him; Servit cringed and continued to maintain that he would not give up the droid. Jarl threatened to ruin lunch for the diners if he continued to do so, but Jettster then tried to help out, informing Jarl that Servit would be keeping the droid and that no one's lunch would be spoiled.\nJettster's presence broke Jarl's confidence, but he stood his ground and suggested that Servit consider his options over a bowl of brakkenback stew. Although Servit did not think he even had any options due to the hostages that Jarl's crew was holding, Jettster agreed and went to get the stew from the kitchen, with Servit following. When they returned, Jarl picked up a spoon, began to compliment the dish, and was knocked unconscious by a frying pan that Jettster struck his head with. As the rest of the crew began firing at Jettster and Servit, diners tried to escape, and the Besalisk owner was able to fend off attackers until they surrendered. It was then that Jarl re-entered the fight, poking his blaster in Servit's neck and forcing him into the kitchen. Once there, the droid, which had been rebooting all the while, began playing a holorecording of the Jedi Sturm Umbrik, who was famous for his expedition to Shara'Tam centuries prior.\nThe message confirmed that there was treasure on the moon—a statue—and provided Shara'Tam's coordinates. Once the message had ended, following a silence, Jettster began guffawing loudly, angering Jarl, who proclaimed that the statue would provide a fortune for him. Fighting back laughter, Jettser agreed that the statue would have indeed been worth a fortune, explaining that the coordinates pointed to the Ishram system, which had been destroyed fifty years prior when its sun went supernova. Unbeknownst to the Weequay, Shara'Tam was actually located in the still-existing Arath system, and Jettster had been lying. After Jarl confirmed with his Togruta crewmate that the Ishram system was really gone but without rechecking the coordinates, he grumbled that Servit could keep the droid and that he had better get T7 fixed, for stew had gotten into his circuits. As they walked out of the kitchen, the Togruta mumbled something about a missing bounty hunter on the planet Batuu.\nWilling to hold up an entire diner just to acquire a clue for treasure, Jarl also had no qualms about holding Servit at blaster point. He looked menacing when he entered Dex's Diner, speaking with a thin and reedy voice and giving a toothy grin. He considered himself reasonable for giving Servit time to consider his options even though the alternative included death. He became very excited at the prospect of treasure and was downtrodden when he was led to believe it no longer existed, giving Servit a murderous look. An old injury caused the flesh around one of his eyes to be puckered and scarred, leaving the eye itself milky and white.\nJarl carried a blaster pistol and dressed in a battered leather waistcoat and shirt.\nJarl appeared as the main antagonist in \"Galactic Tales: Inheritance,\" an installment of the Galactic Tales series of short stories. The story was written by George Mann and was published in the Star Wars Insider magazine's 211th issue on June 7, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jarl_(disambiguation)",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Jarl",
  "/wiki/Weequay",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jarl%27s_crew",
  "/wiki/Coruscant",
  "/wiki/Mirialan",
  "/wiki/Servit",
  "/wiki/EX_droid",
  "/wiki/Droid",
  "/wiki/Moon",
  "/wiki/Shara%27Tam",
  "/wiki/Restaurant",
  "/wiki/Dex%27s_Diner",
  "/wiki/Dexter_Jettster",
  "/wiki/Blaster",
  "/wiki/Planet",
  "/wiki/Human",
  "/wiki/Unidentified_Togruta_(Jarl)",
  "/wiki/Protocol_droid",
  "/wiki/T7",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Besalisk",
  "/wiki/Brakkenback_stew",
  "/wiki/Stew",
  "/wiki/Spoon",
  "/wiki/Foodstuff",
  "/wiki/Frying_pan",
  "/wiki/Holorecorder",
  "/wiki/Jedi",
  "/wiki/Sturm_Umbrik",
  "/wiki/Outer_Rim_expedition_oh-four-seven",
  "/wiki/Standard_century",
  "/wiki/Unidentified_statue",
  "/wiki/Ishram_system",
  "/wiki/Standard_year",
  "/wiki/Ishram_system_sun",
  "/wiki/Supernova",
  "/wiki/Arath_system",
  "/wiki/Togruta",
  "/wiki/Star_system",
  "/wiki/Unidentified_bounty_hunter_(Batuu)",
  "/wiki/Batuu",
  "/wiki/Tooth",
  "/wiki/Time",
  "/wiki/Death",
  "/wiki/Eye",
  "/wiki/Blaster_pistol",
  "/wiki/Leather",
  "/wiki/Galactic_Tales:_Inheritance",
  "/wiki/Galactic_Tales",
  "/wiki/George_Mann",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/June_7",
  "/wiki/2022",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/StarWars.com",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)",
  "/wiki/Titan_Magazines"
 ]
}