{
 "name": "Jarm_Brock",
 "display_name": "Jarm Brock",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Sometime before between 3 ABY and 4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "Jarm Brock was a Zabrak male who at one point was romantically involved with the Shani Deva Lompop, though they eventually broke up and Brock began working for the criminal syndicate Crimson Dawn. As Crimson Dawn began to plan big moves, they had Brock infiltrate the operations of Hutt crime lord Jabba Desilijic Tiure in Mos Entha on the planet Tatooine as part of a ruse to send Jabba after the Hutt Council. The plan worked as Jabba believed that Bokku, a fellow Council member, had been behind Brock's infiltration. In response he sent several teams to kill Brock and his enforcers, though these attempts failed, leading Jabba to send Lompop, now an information broker, alongside the bounty hunter Boba Fett to complete the job.\nThe pair traveled to a cantina in Mos Entha where they were ambushed by Brock. Fett pursued Brock who escaped in a landspeeder, whilst Lompop dealt with Brock's enforcers. Fett caught up with the speeder and threw Brock off the vehicle, before he tied up the Zabrak as he waited for Lompop to arrive. When she arrived, Lompop misled Brock into thinking she had arrived to help him as she stabbed Fett with a poisoned knife. Lompop then questioned Brock about what he was doing on Tatooine, Brock revealed that he was not working for the Hutt Council, as Jabba had been led to believe, but Crimson Dawn instead. When Lompop asked where the residents of Mos Entha were, Brock informed her that they had killed those who refused to joined them, and that the rest except a bartender had left Mos Entha instead of joining. Lompop replied that it was unfortunate, as she hated cold food, before she began to eat Brock, though she was unable to eat Brock's horns and left his head. She took the head back to Jabba, as well as the poisoned Fett, and explained that the job had not gone as planned.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Zabrak",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Crimson_Dawn",
  "/wiki/Shani",
  "/wiki/Deva_Lompop",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Mos_Entha",
  "/wiki/Planet",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Bokku",
  "/wiki/Death",
  "/wiki/Information_broker",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Cantina",
  "/wiki/Landspeeder",
  "/wiki/Poison",
  "/wiki/Knife",
  "/wiki/Unidentified_human_bartender",
  "/wiki/Foodstuff",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Jarm_Brock",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_Jabba_the_Hutt_1",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/Databank_(website)"
 ]
}