{
 "name": "Jaro Tapal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Albedo Brave",
      "Bracca system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lasat"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "13th Battalion",
      "13th Battalion"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Cal Kestis"
     ]
    }
   ]
  }
 ],
 "content": "Jaro Tapal, a Force-sensitive Lasat male, was a Jedi Master who, during the Clone Wars, served the Galactic Republic with distinction as a Jedi General in the Grand Army of the Republic. Adhering to a firm and disciplined doctrine, Tapal mentored his Padawan, Cal Kestis, in the ways of the Force. In the aftermath of the Bracca Invasion, Tapal and his apprentice were betrayed by their clone troopers of the 13th Battalion during Order 66. Although he was mortally wounded while attempting to escape to Bracca, Tapal managed to get Kestis to safety. Before dying, he urged Kestis to hold the line, await the Jedi High Council's signal, and to trust only in the Force.\nTapal's death haunted his former Padawan for years. Kestis, who kept Jaro Tapal's lightsaber, vowed to honor his Master's teaching and sacrifice as he set out to restore the Jedi Order during the reign of the Galactic Empire.\nDuring the final years of the Galactic Republic, Jedi Master Jaro Tapal served in the Grand Army of the Republic—holding the military rank of Jedi General—as commanding officer of the 13th Battalion. After the onset of the Clone Wars, Tapal spoke briefly to Anakin Skywalker as the youngling Cal Kestis trailed behind him, following Skywalker's knighting ceremony, as well as news regarding a bombing on Cato Neimoidia. In addition to his military responsibilities, Tapal found time to continue the training of Kestis, who had by that point become his Padawan, while away from the Jedi Temple on Coruscant. At some point in his life, Tapal befriended Jedi Knight Cere Junda, who regarded him as a true guardian of the Republic.\nTapal and Kestis served together in the Clone Wars until 19 BBY when, in the aftermath of the Bracca Invasion as they set out on the Albedo Brave to Mygeeto to assist Ki-Adi-Mundi and the 21st Nova Corps, Order 66 was communicated to the clone troopers by the Sith Lord Darth Sidious, who declared that all Jedi were enemies of the state. However, Tapal sensed the impending betrayal and was able to kill the Clone Commander by his side, protecting both himself and his apprentice. Realizing the other clones had turned against them as well, Tapal decided to evacuate his Venator-class Star Destroyer with Kestis.\nTapal quickly devised a plan to escape the warship by separating from his apprentice as they made their way to the escape pods. He instructed Kestis to use the maintenance halls to avoid the clone troopers whilst Tapal himself confronted his former soldiers, killing multiple squads and also rescuing his Padawan from being shot by two troopers in the turbolift shaft. Along the way, Tapal took the opportunity to sabotage the Star Destroyer's reactor, ensuring that the destruction of the Albedo Brave would cover their escape.\nTapal and Kestis reached the escape pod bay at the same time but the remaining clones managed to overwhelm and mortally wound the general. Nevertheless, Tapal was able to save his apprentice's life before they escaped in one of the pods. Tapal gave his damaged lightsaber to Kestis, who lost his own lightsaber during their escape, before telling him to wait for a signal from the Jedi High Council, unaware that it was nearly defunct, and to trust only in the Force. The Albedo Brave's reactor subsequently exploded, destroying the vessel as Kestis returned to Bracca.\nTapal was remembered years after his death. Though traumatized by the horrifying experience of Order 66 and haunted by the memory of his slain Master, Kestis regarded Tapal as a hero.\nBy 14 BBY, both the Jedi Order and the Republic that Tapal served had fallen, replaced by the rule of the Sith through the Galactic Empire. Although Kestis kept his deceased Master's lightsaber, he hid his true identity in order to avoid becoming another victim of the Great Jedi Purge. With the help of his new master, Cere Junda, Kestis was able to move on from his self-imposed exile on Bracca, embarking on a secret mission to restore the Jedi Order.\nOver the course of Kestis' journey, memories of his time as Tapal's pupil began to resurface, helping Kestis to remember various techniques as he re-awakened his connection to the Force. During his mission on Dathomir, an apparition of Tapal appeared to Kestis, calling the former Padawan a weak and failed apprentice. But after forging a new lightsaber on Ilum, Kestis confronted his fears in the form of his dead Master, and finally managed to put the tragedy of his past behind him. Yet he also vowed to never forget Jaro Tapal, whose teachings Kestis would honor as he moved forward to find his own destiny.\nJaro Tapal was an imposing Lasat male with gray hair, green eyes, and purple skin. Having served as a member of the Jedi Order, Tapal adhered to a firm and disciplined doctrine, the tenets of which he imparted to his apprentice Cal Kestis through their training sessions together. He participated in the Clone Wars as a general and defender of the Republic, noting that while the Jedi did not seek aggression, they would stand against it. He also trusted in the will of the Force; with his dying breath, he told Kestis to trust the Force also.\nAmong his troops at least, Tapal was not known for his patience. Shortly before Order 66, the clones that Kestis passed on his way to the training area advised the Padawan to not keep his Master waiting for long. During their sessions together, Tapal was not displeased by Kestis' mistakes, even when Kestis himself began to feel discouraged. Instead, he taught his apprentice to embrace his failure and learn from it, and to not be weighed down by ego or pretense. Persistence was a trait that Tapal valued, and as such, he encouraged Kestis to keep persisting until he achieved success in his trials. Although Tapal was demanding with Kestis in his training, he was concerned for the safety of his apprentice, so much so that even though wounded, he continued to resist as much as he could against the clones when they betrayed them and tried to kill them. As a Jedi, he believed it was important to let go of what one feared to lose in order to rise above their fear.\nAs a Force-sensitive, Jaro Tapal was skilled in the use of various Force powers, particularly telekinesis. During the execution of Order 66, Tapal relied heavily on his telekinetic abilities, using the Force to levitate and incapacitate multiple clone troopers at the same time. Even when wounded by several blaster shots to the torso, he was still able to call on the power of the Force, lifting three clones and slamming them into the ceiling hard enough to kill all three on impact. His connection to that mysterious energy field allowed him to sense a great disturbance in the Force, enabling Tapal to kill the clone commander that attempted to shoot the Jedi Master from behind.\nAs a Lasat, Tapal was also physically strong and durable, managing to subdue several of his former troops with simple kicks or headbutts and was not killed immediately after being struck by an albeit-fatal barrage of blaster shots, notably shrugging off the first of these wounds like it was nothing.\nIn addition, he was well trained in the art of lightsaber combat, particularly the use of a double-bladed lightsaber. He used his lightsaber with deadly purpose while defending himself and his apprentice, and succeeded in killing numerous troopers on his own before a group of clones managed to overwhelm him with blaster fire.\nJaro Tapal was introduced in the 2019 video game Star Wars Jedi: Fallen Order. He is played by Travis Willingham. Concept art for Jaro Tapal was done by artist Jose Daniel Cabrera Peña.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Brotherhood",
  "/wiki/The_Art_of_Star_Wars_Jedi:_Fallen_Order",
  "/wiki/19_BBY",
  "/wiki/Albedo_Brave",
  "/wiki/Bracca_system",
  "/wiki/Lasat",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/13th_Battalion",
  "/wiki/Cal_Kestis",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Master",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_General",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi_Code",
  "/wiki/Jedi_training",
  "/wiki/Padawan",
  "/wiki/The_Force",
  "/wiki/Bracca_Invasion",
  "/wiki/Clone_trooper",
  "/wiki/Order_66",
  "/wiki/Skirmish_aboard_the_Albedo_Brave",
  "/wiki/Bracca",
  "/wiki/Jedi_High_Council",
  "/wiki/Death",
  "/wiki/Standard_year",
  "/wiki/Jaro_Tapal%27s_lightsaber",
  "/wiki/Secret_mission_to_rebuild_the_Jedi_Order",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Republic_Era",
  "/wiki/Military_rank",
  "/wiki/Commanding_officer",
  "/wiki/Anakin_Skywalker",
  "/wiki/Youngling",
  "/wiki/Anakin_Skywalker%27s_knighting_ceremony",
  "/wiki/Cadesura_disaster",
  "/wiki/Cato_Neimoidia",
  "/wiki/Republic_Military",
  "/wiki/Time",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Jedi_Knight",
  "/wiki/Cere_Junda",
  "/wiki/Cloning",
  "/wiki/Mygeeto",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/21st_Nova_Corps",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Sidious",
  "/wiki/Jedi",
  "/wiki/Treason",
  "/wiki/Unidentified_Clone_Commander_(13th_Battalion)",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Warship",
  "/wiki/Escape_pod",
  "/wiki/Trooper",
  "/wiki/Soldier",
  "/wiki/Squad",
  "/wiki/Turbolift",
  "/wiki/Star_Destroyer",
  "/wiki/Reactor",
  "/wiki/General",
  "/wiki/Cal_Kestis%27_first_lightsaber",
  "/wiki/14_BBY",
  "/wiki/Sith",
  "/wiki/Lightsaber",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Exile_(punishment)",
  "/wiki/Force_power",
  "/wiki/Mission_to_Dathomir_(Cal_Kestis)",
  "/wiki/Dathomir",
  "/wiki/Force_vision",
  "/wiki/Cal_Kestis%27_second_lightsaber",
  "/wiki/Ilum",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Troop",
  "/wiki/Telekinesis",
  "/wiki/Blaster",
  "/wiki/Disturbance_in_the_Force",
  "/wiki/Commander",
  "/wiki/Lightsaber_combat",
  "/wiki/Double-bladed_lightsaber",
  "/wiki/2019",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Travis_Willingham",
  "/wiki/Jose_Daniel_Cabrera_Pe%C3%B1a",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/Star_Wars_Rebels_(webcomic)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Exegol,_the_Unknown_Regions,_and_Wild_Space",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/StarWars.com"
 ]
}