{
 "name": "Jarred Sneel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellian system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mechanical Liberation Front"
     ]
    }
   ]
  }
 ],
 "content": "Jarred Sneel was a male Human who was the leader of the Mechanical Liberation Front, or MLF, who conducted hit-and-run terrorist strikes against droid manufacturers during the New Order.\nSneel was a shadowy figure. A native of the Corellian system, he was apparently obsessed with droids, writing lengthy tracts and missives about organics rising up and freeing droids \"from their cruel servitude.\" The MLF had already been in operation for several years when he advanced to a position of leadership, but he stepped up their activities, inflicting severe damage on the facilities of Industrial Automaton, MerenData, and Sienar Intelligence Systems, typically using detonite explosive devices. Sneel was an expert droid programmer, droid technician, and demolitions expert.\nCorSec agents suspected Jarred Sneel may have been running the MLF as a front organization for the Black Sun. Corporate Sector Authority Espos treated them as common criminals, perhaps working for competing business interests. Imperial agents simply regarded them as terrorist fanatics. Sneel's true motivation was never clear.\nOne tactic used by the Empire and the Espos to discourage the MLF was to instruct the HoloNet news networks to report on MLF bombings as if the MLF were a fanatical anti-droid group rather than a droid's rights group. Imperial agents suspected the Corporate Sector Authority of running illegal Espo operations against the MLF from within Imperial territory.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellian_system",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mechanical_Liberation_Front",
  "/wiki/Droid/Legends",
  "/wiki/Rebellion_era",
  "/wiki/Industrial_Automaton/Legends",
  "/wiki/MerenData/Legends",
  "/wiki/Sienar_Intelligence_Systems/Legends",
  "/wiki/Detonite/Legends",
  "/wiki/Corellian_Security_Force",
  "/wiki/Black_Sun/Legends",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Security_Police",
  "/wiki/HoloNet/Legends",
  "/wiki/Cynabar%27s_Fantastic_Technology:_Droids"
 ]
}