{
 "name": "Jart Eyan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "7.5 ABY",
      "aboard Home One"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jart Eyan was a male Twi'lek lieutenant in the New Republic Defense Fleet.\nEyan was part of Admiral Ackbar's security detail, stationed on the Home One. While the Home One was in drydock in 7 ABY, Eyan went on leave on Coruscant and was kidnapped by agents of Warlord Zsinj along with his family. During the few days his family was missing, Eyan was brainwashed as part of Zsinj's Project Funeral.\nAs soon as he returned to the Home One, Eyan received an urgent message from his wife. She was forced to speak his trigger phrase: \"Jart, those Wookiees are dancing in the parlor again.\"\nThis activated Eyan's programming, and he immediately erased the message with a slicing skill he didn't know he possessed. In order to eliminate the dancing Wookiees of his delusion, he set out to assassinate Ackbar. The admiral was meeting with Wraith Squadron member Voort \"Piggy\" saBinring, and as the Gamorrean pilot rose to salute Lieutenant Eyan, Eyan fired a blaster into saBinring's stomach.\nMost beings would have frozen with shock and fear as they died, but Eyan failed to realize that saBinring was not like most beings. The emotional control with which he had been engineered allowed him to defend the admiral's life. Piggy drew a vibroblade from his sleeve, which was not standard equipment for most New Republic pilots but was a usual part of the Wraith's gear. He threw the blade at Eyan, cutting the Twi'lek's blaster in half.\nAckbar used the distraction to attack Eyan, but Eyan freed himself from Ackbar's grip and began to strangle the admiral. Piggy forced himself to stand, and picked up Ackbar's desk. The Gamorrean charged at Eyan while carrying the desk, and hit him so hard that the wall in the lounge next to Ackbar's office bowed inward, knocking out a female Human ensign.\nVoort saBinring and Ackbar survived the encounter, but Jart Eyan's head was smashed flat.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Home_One/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/New_Republic_Defense_Fleet/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/Time/Legends",
  "/wiki/Project_Funeral",
  "/wiki/Wookiee/Legends",
  "/wiki/Wraith_Squadron",
  "/wiki/Voort_saBinring",
  "/wiki/Gamorrean/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Human/Legends",
  "/wiki/Ensign/Legends",
  "/wiki/X-Wing:_Solo_Command",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}