{
 "name": "Jasha",
 "display_name": "Jasha",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Jasha was a male Human officer of the Galactic Empire who lived during the Galactic Civil War.\nAfter the Battle of Yavin, Captain Jasha was stationed in the Bestine Imperial garrison on Tatooine. He was a friend of Escara Frei, an old woman living in Mos Eisley.\nIn 1 ABY, Captain Jasha employed an Imperial spacer to complete a number of tasks for him. He was worried that Rebels were using banthas to transport supplies, as this made it harder for the Imperials to track their smuggling operations. He had his Imperial operative kill as many banthas as possible, so that the Rebel's would have to resort to using speeders. The Imperial successfully killed banthas in the surrounding area, and was awarded 3,750 credits for his part in the job. Fortunately for Jasha, killing the banthas yielded positive results. The Rebels in Bestine began using speeders, making them easier to locate.\nJasha had more problems, however. The Rebel cause was growing significantly on Tatooine with each passing day. He grew concerned with the number of families providing supplies to new Rebel recruits. Jasha had his Imperial operative locate a terrorist encampment in the nearby hills surrounding Bestine. The spacer successfully located the camp, and began taking out the insurgents, one by one. He searched their bodies for ID Cards, which would help provide insight as to which families were aiding the Rebellion. After finding five ID Cards, the Imperial reported back to Captain Jasha who then compiled a list of the suspected suppliers. He reported this information to Imperial Intelligence so that they could begin survaillence on the suspected families. For carrying out this dangerous task, Jasha awarded his operative with 3,700 credits.\nJasha had one more mission for his Imperial operative. He learned that the Valarians recently recovered an X-wing starfighter, which they planned to sell back to the Rebels. Jasha sent the Imperial operative to infiltrate the Valarian Depot, and plant a transmitter on the X-Wing. This would allow Imperial Intelligence to track the X-Wing to the the new Rebel base. The spacer once again succeeded, and was awarded with another 3,750 credits for his hard work.\nCaptain Jasha was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Captain Jasha was added to the game upon the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005. In the game, players could speak to him to do a series of quests.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Imperial_garrison_(Bestine)",
  "/wiki/Tatooine/Legends",
  "/wiki/Escara_Frei",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Bantha/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Terrorist/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Valarian_Syndicate",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Valarian_Depot",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}