{
 "name": "Jasso Toryn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Jasso Toryn was a Human male who served as a senator within the Galactic Senate, the governing body of the Galactic Republic. During the Clone Wars, a conflict between the Republic and the breakaway Confederacy of Independent Systems, Toryn feared for the safety of his daughter, Korlana, and he sent her into hiding on the moon Nar Shaddaa. He later wrote to his friend Jedi Master Lanius Qel-Bertuk in about 20 BBY and asked that Korlana be placed under the direct protection of the Jedi Order on the planet Almas, and Qel-Bertuk agreed to Toryn's request.\nJasso Toryn was a Human male who lived during the waning years of the Galactic Republic. As a child, Toryn was good friends with the Force-sensitive Human Lanius Qel-Bertuk, and, after Qel'Bertuk was accepted into the Jedi Order, the pair remained closely acquainted. Toryn went on to become a senator in the Galactic Senate—the governing body of the Galactic Republic—which operated from the Senate Building on the planet Coruscant. At some point he fathered a child, Korlana Toryn, on whom he doted, and he gave her a privileged upbringing.\nBy time of the outbreak of the Clone Wars, a conflict between the Republic and the separatist Confederacy of Independent Systems, Toryn had became a long-serving and respected member of the Senate who was well-known as a staunch supporter of the Jedi. However, he gained some influential enemies among the Separatists, and, fearing for his daughter's safety, he sent Korlana and his valet droid, E-3PO, to go into hiding on the moon Nar Shaddaa, far from the influence of both the Republic and the Confederacy. The war continued to develop, and, in about 20 BBY, Toryn heard rumors of Separatist supporters gathering on Coruscant, in the heart of the Republic. Concerned that Korlana might not be safe from the Separatists even on Nar Shaddaa, Toryn wrote to Qel-Bertuk and requested that Korlana be placed under the direct protection of the Jedi on Almas, a world in the Expansion Region on which Qel-Bertuk served as the headmaster of a Jedi academy. Qel-Bertuk agreed to the Senator's request, and the Jedi Master dispatched the Heroes of Cularin, a renowned team of freelance agents from the Cularin system, to retrieve Korlana from Nar Shaddaa and transport her to Almas.\nThe agents successfully located Korlana and brought her to the academy, and Toryn asked Qel-Bertuk to thank them on his behalf. The Senator also offered to aid the agents in the future, by using his influence to reduce bureaucratic paperwork for the operatives if they ever needed to have official dealings with the Republic.\nAs a child, Toryn wanted to be a Jedi, and he later became regarded as a strong supporter of the Order within the Senate. He also cared deeply for his daughter, Korlana, and he spoiled and mollycoddled her, which led her to develop a very naive outlook on life. Following the eruption of the Clone Wars, Toryn became concerned for Korlana's safety, so he sent her into hiding on Nar Shaddaa, but he continued to worry about her well-being and was very grateful when the Heroes of Cularin escorted her to the Jedi on Almas.\nJasso Toryn was mentioned in Contract AA23, a 2004 roleplaying adventure written by Russell Foubert and Sean Yo that formed part of the Living Force campaign. During the adventure the player-characters roleplay as the Heroes of Cularin, and, if they successfully retrieve Korlana Toryn from Nar Shadaaa, they are each awarded a \"Gratitude of Senator Jasso Toryn\" certificate, which can be redeemed for various in-game roleplaying benefits.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Contract_AA23_(roleplaying_adventure)",
  "/wiki/Senator/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Korlana_Toryn",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/20_BBY/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Almas",
  "/wiki/Standard_year/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Senate_Building",
  "/wiki/Coruscant/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Time/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Valet_droid",
  "/wiki/E-3PO_(Clone_Wars)",
  "/wiki/Expansion_Region/Legends",
  "/wiki/Headmaster/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Agent/Legends",
  "/wiki/Cularin_system",
  "/wiki/Canon",
  "/wiki/Jedi_academy",
  "/wiki/Paper/Legends",
  "/wiki/2004",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Russell_Foubert",
  "/wiki/Sean_Yo",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Roleplaying_game",
  "/wiki/Inside_the_Worlds_of_Star_Wars:_Episode_I",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/Night%27s_Homecoming"
 ]
}