{
 "name": "Jat%27ho",
 "display_name": "Jat'ho",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arcona"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Alliance",
      "Coruscant Security Force",
      "Coruscant Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Jat'ho was an Arconan male living on the planet Coruscant during the Second Galactic Civil War between the Galactic Federation of Free Alliances and the Confederation. He served as a police officer with the Coruscant Security Force along with his partner, Tobyl. In 41 ABY, they were part of an operation to capture Galactic Alliance Guard Captain Lon Shevu and Jedi Ben Skywalker.\nJat'ho was an older Arconan male police officer serving in the Coruscant Security Force during the Second Galactic Civil War between the Galactic Federation of Free Alliances and the Confederation. In 41 ABY, Jat'ho and his partner, Tobyl, were part of an operation to capture Galactic Alliance Guard Captain Lon Shevu and Jedi Ben Skywalker. After the fight, the two officers were conducting crowd control and guarding a medwagon with two wounded GAG agents when they were approached by Jedi Knights Jaina Solo and Leia Organa Solo. Needing the medwagon to pursue the GAG doomsled carrying Skywalker, Jaina told Jat'ho and his partner she was investigating their sergeant, Qade, and needed the medwagon to conduct her investigation. She also insisted that no report be written; when Tobyl was initially hesitant, Solo utilized a mind trick to convince the cops of her story. Believing her, they let her pass, and she took the medwagon. Jat'ho and Tobyl, meanwhile, returned to their crowd control duties.\nJat'ho had gray skin and green eyes surrounded by deep cracks. Noticing that both Jat'ho and his partner were weak-minded, Jaina Solo was easily able to use mind tricks on both to convince them she was part of the Galactic Alliance Guard. Believing her story, Jat'ho stayed back, allowing Tobyl to do the talking.\nJat'ho first appeared in the novel Invincible, written by Troy Denning and released on May 13, 2008 as part of the Star Wars: Legacy of the Force series. The entry for Jat'ho in The Complete Star Wars Encyclopedia, which was published on December 9, 2008, incorrectly lists Jat'ho as a member of the Galactic Alliance Guard instead of the Coruscant Security Force.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Arcona/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Confederation",
  "/wiki/Police_officer/Legends",
  "/wiki/Tobyl",
  "/wiki/41_ABY",
  "/wiki/Skirmish_on_Coruscant_(Second_Galactic_Civil_War)",
  "/wiki/Galactic_Alliance_Guard",
  "/wiki/Captain/Legends",
  "/wiki/Lon_Shevu",
  "/wiki/Jedi/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Officer/Legends",
  "/wiki/Medwagon",
  "/wiki/Agent/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Doomsled",
  "/wiki/Sergeant/Legends",
  "/wiki/Qade",
  "/wiki/Mind_trick/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Legacy_of_the_Force:_Invincible",
  "/wiki/Troy_Denning",
  "/wiki/May_13",
  "/wiki/2008",
  "/wiki/Star_Wars:_Legacy_of_the_Force",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/December_9"
 ]
}