{
 "name": "Jav Patrell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "5 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic",
      "New Republic Defense Fleet",
      "New Republic Defense Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Jav Patrell was a male Human and a captain in the New Republic Navy following the death of Emperor Palpatine at the Battle of Endor.\nA Human from Corellia, Jav Patrell lived on his homeworld and served the Galactic Republic as part of a military unit until joining the Alliance to Restore the Republic following the rise of the Galactic Empire at the end of the Clone Wars. Serving the Alliance aboard Corellian-made interdictors throughout the Galactic Civil War, Patrell was elevated to the rank of captain and when the New Republic came to power, placed in command of the Wait a Minute, a CC-7700/E interdiction cruiser that was part of the Rapid Response Task Force. Patrell brought with him thirty-five years of service and was considered a veteran of warfare by his peers and colleagues.\nIn 5 ABY, Patrell was wary of the Republic's plans to attack Imperial Lord Shadowspan's headquarters on the planet of Mindor in part because of the planet's natural defense in the form of the Big Crush. A field of debris and wreckage left over from a failed Imperial experiment, the Big Crush would be perilous and costly to cross by the calculation of Patrell and his officers. None the less, Patrell would be commanded to participate in the Battle of Mindor and were relieved to be reinforced by Lando Calrissian when the opening of the battle went sour. When the Imperials unveiled their gravity weapons, Patrell and his men were thrown off balance until Calrissian suggested using their gravity well projectors to deflect the Imperial arsenal away from Republic ships. While this tactic caused mass damage to the surface of Mindor and the destruction of the Hold 'Em, Shadowspawn's forces recovered and ordered several waves of TIE Interceptors to drive at full velocity into the hull of the Wait a Minute. As the ship broke apart from the devastating assault, Patrell and all aboard the ship perished.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Defense_Fleet/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Death/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Interdictor",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Wait_a_Minute",
  "/wiki/CC-7700/E_interdiction_cruiser",
  "/wiki/Rapid_Response_Task_Force",
  "/wiki/Lord/Legends",
  "/wiki/Cronal",
  "/wiki/Planet/Legends",
  "/wiki/Mindor/Legends",
  "/wiki/Big_Crush",
  "/wiki/Battle_of_Mindor",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Gravity_well_projector/Legends",
  "/wiki/Hold_%27Em",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Luke_Skywalker_and_the_Shadows_of_Mindor"
 ]
}