{
 "name": "Jax Lerrian",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Customs"
     ]
    }
   ]
  }
 ],
 "content": "Jax Lerrian was an Imperial Customs inspector, who had held that job for nearly a decade as of the Galactic Civil War.\nLerrian believed in the rule of law, and that without firm rules, others would take advantage of a situation. He prided Imperial Customs law as central to knowing exactly what he was supposed to do in the course of his duties. The regulations did give him some amount of discretion, and though he paid lip service to always following the letter of the law, he did allow some minor infractions to slip by with only a warning. However, when someone gave him difficulty or attitude, he would employ the full force of the law, charging that individual with as many infractions as possible.\nIn Star Wars: The Roleplaying Game, Second Edition, Revised and Expanded Lerrian appears along with Platt Okeefe, Tirog, and various other characters in order to introduce the rules of the game to players. Though Lerrian and the other characters remain in character, they \"break the fourth wall\" by addressing the readers directly and discussing the rules of the game. Lerrian makes a cameo appearance in Chapter 3  before being the guide for Chapter 4 .",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Office_of_Customs/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Platt_Okeefe/Legends",
  "/wiki/Tirog"
 ]
}