{
 "name": "Jaxson",
 "display_name": "Jaxson",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Jaxson was a Human male who lived on Tatooine around the same time as Luke Skywalker. Jaxson had Imperial sympathies, but failed his entrance exam to the academy.\nIn 0 ABY, he and Skywalker had a Skyhopper race due to Jaxson's Imperial beliefs and Skywalker's Rebel ones. In the race, Jaxson fell behind Skywalker. Just before Skywalker was about to attempt to go through the Stone Needle, both of their skyhopper's electrical systems were wiped out by a pulse generator put in the area by the bounty hunter Bossk, who was capturing Skywalker for Jabba the Hutt. Bossk took them into a cave in the Jundland Wastes to spend the night. There, Luke freed Jaxson and himself with his lightsaber. They attempted to escape in Bossk's speeder, but Bossk woke up and attacked Luke. In the fight, Bossk lost an arm and a leg. Luke tried to get to the speeder to escape with Jaxson, but Bossk threw a Fragmentation grenade into the speeder. Jaxson and Luke survived the explosion, and Bossk declared that they would die together. Jaxson and Luke escaped into the Jundland Wastes. There, Jaxson and Luke encountered a Tusken Raider tribe, but Luke scared them away with a Krayt dragon call. Jaxson later saved Luke from falling off a cliff. Once they were rescued by Leia Organa, who was on Tatooine with Luke, they were no longer enemies due to the fact that they had both saved each others life. They later participated in a cantina shootout.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Jaxson",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Skyhopper/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Stone_Needle/Legends",
  "/wiki/Active_sensor_pulse_generator",
  "/wiki/Bossk/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Jundland_Wastes/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Fragmentation_grenade/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Krayt_dragon/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Cantina/Legends",
  "/wiki/Rebel_Force:_Renegade",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}