{
 "name": "Jaxxon T. Tumperakki",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coachelle Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lepi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Tumperakki Haulage Company",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Jaxxon T. Tumperakki, nicknamed Jax, was a male Lepi smuggler and captain of the Rabbit's Foot. He was an acquaintance of Han Solo, a fellow smuggler turned hero of the Rebel Alliance, whom he regarded as an inferior pilot.\nJaxxon T. Tumperakki was a male Lepi from Coachelle Prime. As was typical of his species, he had a very large family. He was blessed with 167 aunts and uncles, and his cousins numbered in the hundreds—at least 300, and perhaps even 400. Five of them were named Reegor, Peeta, Arvi, Benji, and Maxx.\nEventually, Tumperakki came to work as a smuggler, traveling the galaxy aboard a dilapidated WUD-500 star yacht christened Rabbit's Foot in the company of an antiquated maintenance droid, Mel. During his career, he became acquainted with such notorious figures as the Corellian smuggler Han Solo, the Socorran gambler Lando Calrissian, and the bounty hunter Dengar. Tumperakki and Calrissian went through several adventures together. On one occasion, Tumperakki ratted Calrissian out to Renza the Hutt—although the Lepi claimed that he had only meant it as a jest. On another, the Lepi told the legendary pirate queen Maz Kanata that it was Calrissian who had stolen the hypercoils from her starship Corsair. In fact, the real culprit was the pirate Amaiza Foxtrain, Tumperakki's partner at the time, and the stolen hypercoils had somehow found their way in the Rabbit's Foot's power core.\nAt some point after the Battle of Yavin, Tumperakki and Foxtrain were hired by Prizzi, Queen of Livorno, to safely deliver the last eggs of her kind to Princess Leia Organa of the Rebel Alliance. Once aboard the Rabbit's Foot, Tumperakki and the queen realized that the eggs were not hers when they hatched, revealing hostile flying creatures. It turned out that Foxtrain had double-crossed him, slipping away with the real eggs.\nNevertheless, Tumperakki managed to track her to the space-bound casino known as the Wheel, where the pirate was trying to sell the purloined eggs to the highest bidder. There followed a three-sided scuffle between Tumperakki, Foxtrain, and an agent of the Galactic Empire. Having released the flying pests from earlier on his former associate, the long-eared smuggler got away with the eggs. He then brought the precious cargo to Organa and Han Solo.\nUpon receiving Organa's thanks, Tumperakki asked his droid Mel to bring forth the precious eggs, which the robot accidentally dropped. While all reacted in shock, Tumperakki knew that he had been sent on a wild goose chase and that those eggs were fake as well. The Rebels then admitted that knowing the Empire were closing in on the eggs, they used Tumperakki's mission as a decoy while Solo smuggled the genuine articles in his own ship, the Millennium Falcon. Nevertheless, Tumperakki was glad to learn that not only the Alliance would pay him what he was owed, but that Solo himself would have to repair his ship.\nSome time after his fall out with Amaiza Foxtrain, Tumperakki traveled to the planet Rekelos, where he attempted to con the Gloovan gangster Scram at a game of sabacc. However, the Lepi was caught cheating, and try to flee the cantina where the game took place, first from Scram and his gang and then Dengar, who stated Jaxxon had a bounty on his head.\nOnce he was able to get out on the street, Tumperakki stumbled upon the heroes of the Rebellion, Han Solo, Chewbacca and Luke Skywalker, who took him aboard the Millennium Falcon.\nAs it turned out, the Rebels had a holorecording of Amaiza Foxtrain stealing Imperial transit chips with the help of a Lepi associate. Tumperakki promptly denied any involvement, and identified the Lepi in question as his cousin Reegor, who looked almost exactly like him apart from a distinctive scar. Since the Rebels were intent on acquiring the stolen chips, Skywalker convinced Tumperakki to take part in a ruse. The Lepi smuggler confronted his cousin and, with the help of Chewbacca, forced him to divulge Foxtrain's hiding place.\nUsing face paint to make it like he had his cousin's scar, Tumperakki pretended to be Reegor as he entered Foxtrain's hideout. While she wasn't fooled by Tumperakki disguise, having heard about his ship making planet fall, he revealed that he was wearing a tracker, bringing Imperial forces as well as Dengar to attack the place. In the confusion, he grabbed the chips. When Foxtrain points out that won't help him as the Empire will just target him, he revealed his final distraction, the rest of his cousins running around the place with the Imperial not knowing which Lepi to shoot. With that Tumparakki escaped while Foxtrain had to deal with a pissed off Dengar, who intended to collect a bounty on her her instead.\nAfter taking down his cousin, he was able to retrieve the chips, and was able to use his other cousin to confuse his pursuers and delivers the chips to the rebellion. When Skywalker asked how Jaxxon was able to convince his cousin into helping them, he explained that he offered the services of Han Solo and the legendary Millennium Falcon for as many jobs as they needed, much to Solo's anger.\nAround 3 ABY, inspired by the example of Lando Calrissian—who had become baron administrator of Cloud City—Tumperakki decided to become a legitimate businessbeing. His plan was to create the Tumperakki Haulage Company, whose fleet of freighters would ferry goods legally across the galaxy. Because he needed starting funds, the Lepi traveled to Cloud City in hopes of convincing his old friend Calrissian to invest. Wearing cheap replicas of luxury clothing, Tumperakki arrived at the baron administrator's office, only to find out that he was one hour late for his appointment, due to a miscommunication between Mel and Calrissian's aide, the cyborg Lobot.\nAlthough Calrissian was busy with another visitor, a Troglof named Corovene Manakor, the Lepi was allowed to see him, but his proposal was only met with derision and dismissal. When Tumperakki tried to insist one last time, Calrissian had a sudden, very uncharacteristic outburst of anger. Tumperakki saw himself out, but not before overhearing the baron administrator mutter into his comlink what he was going to do next.\nBelieving Calrissian was a part of a heist, he sneaked towards a meeting room only to find a bunch of stormtroopers and Darth Vader waiting. Upon seeing Vader, he quickly shut the door and began to run away from the dining room with stormtroopers in pursuit and while he did escape, he accidentally tripped and knocked himself out. When he woke up, Lando was ordering the people to evacuate from Cloud City. Not wanting to leave without some measure of payback, he broke into Calrissian's office and stole the suitcase full of ingots. After stealing the ingots and hiding in a maintenance closet, he met Corovene and his family. That was where he learned Corovene was part of the group that cause the heist on Scipio but only so he can get the funds to liberate their homeworld of Najiba from the empire but was left empty handed. With Lando promising to help move Corovene and his family to somewhere safe  so they can start a new life on Lysatra. Feeling guilty, Tumperakki got rid of the ingots and hid the family in the suitcase and made a breakaway to the Rabbit's Foot. Once inside his ship, he let the Troglof family out of the suitcase and promised to take them to Lysatra.\nFollowing the Battle of Endor, Tumperakki was hired to free Rekk's Chancellor, Asera, on Rekkana. Unfortunately, he was captured by Commodore Visler Korda and his troops. Tumperakki was placed in prison but was able to send out a distress signal. He was then freed from the prison by New Republic General Lando Calrissian. Together, they freed Chancellor Asera. She told them that they needed to retrieve the Totem of Saglanost in order to restore the Rekk's hop. Tumperakki and Calrissian took Asera to the Millennium Falcon, but came under attack by several stormtroopers. Despite that, Tumperakki was convinced by Calrissian to steal one of the Empire's new Scuttlers. He used it to fight Korda and his troops until the scuttler fell apart. Tumperakki, Calrissian, and Asera were able to reach the Falcon, but chose to take the Rabbit's Foot to Hanna City on Chandrila.\nIn Hanna City, Tumperakki took part in a meeting with Han Solo, Leia Organa, Lando Calrissian, C-3PO, and R2-D2 about the Totem's location at the Palpatine Archive in the Coruscant system. There, Tumperakki volunteered himself and his ship for the mission.\nWith Calrissian and Asera, Tumperakki took the Rabbit's Foot to the Archive. Having landed his ship in one the station's hangars, the Lepi, dressed in the uniform of an Imperial officer, pretended to have come to deliver a precious sculpture, actually a jumble of droid parts and other pieces of scrap metal. Although the analysis droid that greeted him was skeptical from the outset, it did not raise the alarm until the thinly-disguised smuggler attempted to steal an artifact known as the Golden Agrooba of Metlok IV.\nTumperakki then came under attack by several Imperial Guards, who gave him chase. It was, however, all part of the plan, since the Lepi was only supposed to act as a distraction, allowing Calrissian and Asera to emerge from the so-called sculpture. He somehow managed to incapacitate one of the guards and steal his or her uniform without any of the others noticing. Tumperakki and his \"fellow\" guards then returned to the hangar, where Calrissian and Asera were ready to board the Rabbit's Foot, having retrieved the totem. Ending the charade, Tumperakki called for Mel, who knocked over the Imperial guards and the curator droid, and the Rebel strike team were able to escape the Archive with the totem.\nTumperakki, Calrissian, and Asera were able to return to Rekkana. There, Tumperakki, Calrissian and the Rekks were able to sabotage Korda's computer-controlled TIEs and force his troops to surrender. Tumperakki was given his credits but was forced to give up the artifact he stole from the Archive to Calrissian. Tumperakki was convinced by Calrissian to consider joining the New Republic.\nOn Emita, Tumperakki was approached New Republic Captain Lina Graf after having a nightmare about Kashyyyk's Festival of Bounty. He told the bar's patrons and Graf about the nightmare and was told that she and her brother Milo had similar nightmares. He agreed to help her get to Mustafar and use the Rabbit's Foot to pick up Thom Hudd and Skritt on Karken. En route, the Rabit's Foot came under attack by several TIEs. After taking care of the TIEs, Tumperakki landed on Mustafar outside of Fortress Vader. He and Hudd woke Graf up from her nightmare and proceeded to approach the Fortress. As they entered the Fortress, Tumperakki and the others were contacted by Milo. Tumperakki came under attack by an apparition of Darth Vader. The apparition was revealed to be Crater who revealed that he was Vaneé's control.\nThey discovered that Vaneé was attempting was to ressurrect Vader by using Milo's body in Vader's bacta tank. Tumperakki and the others were stunned by Vaneé.\nAt one point, Tumperakki traveled to the rocky world of Enujut. There, he got into a fight with an Ugnaught merchant, due to the influence of a group of Zemerin travelers who provoked quarrels between others to feed on the negative energy. The argument was settled by the intervention of the local peacekeeper Evor Haris.\nWith his long ears, large pair of buck teeth, and short green fur, the Lepi Tumperakki resembled a common green rabbit, which owed him epithets such as \"cottontail\" or \"green-ears.\" He was lanky and tall, measuring 1.83 meters. He was fond of dewback steaks.\nAlthough he carried an air of confidence, dubbing himself \"the galaxy's greatest smuggler,\" Tumperakki had his share of insecurities, believing he could not keep up with the likes of Amaiza Foxtrain, whom he called a \"class act.\" He also resented the fact that Han Solo's fame overshadowed his own. In fact, the merest mention of Solo irritated him, and could prompt him to take action.\nIn regards to fighting technique, Tumperakki was capable of firing two blasters at the same time. He also used brawling moves, such as inflicting a powerful kick to his opponent's chest. He was nimble, capable of performing various gymnastic manoeuvres over or on various obstacles, such as walls and buildings.\nTumperakki wore a red jumpsuit with yellow stripes down the front, armored shoulders, white gloves and tall white boots. He carried two blaster pistols at his hips.\nJaxxon first appeared in Star Wars canon in \"The Lost Eggs of Livorno,\" a comic penned by Cavan Scott and illustrated by Alain Mauricet that was published as the secondary story of Star Wars Adventures Annual 2018 on April 18, 2018. Jaxxon was originally created for the Star Wars Legends Star Wars 8, a 1977 comic written by Roy Thomas and illustrated by Howard Chaykin.\nIn the 2012 The Clone Wars episode \"A Sunny Day in the Void,\" the skeleton found in a crashed shuttle wears a suit similar to Jaxxon's. The skull even has long incisors. This is acknowledged in the Legends reference book Star Wars: The Clone Wars: Episode Guide.\nAs early as 2014, Marvel Comics' Star Wars writer Jason Aaron mentioned the \"giant bunny rabbit\" as the Legends character he would most like to canonize. Jaxxon was also featured on several variant covers, including one of Star Wars  1, produced by artist John Tyler Christopher, one of Vader Down 1, made by Chip Zdarsky, and one of Poe Dameron 1, illustrated by David Nakayama. Cavan Scott campaigned to bring back Jaxxon since he was hired to write Adventures, Jaxxon being one of his favorite characters.\nOn March 19, 2018, a character resembling Jaxxon was seen on Ord Mantell in \"Bounty Hunted,\" the sixth episode of the canon animated micro-series Star Wars: Forces of Destiny's second season. The same model was used again in the episode \"Triplecross.\"\nJaxxon's full name was revealed in the short story \"Fake It Till You Make It,\" written by Cavan Scott for the 2020 anthology book From a Certain Point of View: The Empire Strikes Back.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jaxxon_T._Tumperakki",
  "/wiki/Jaxxon",
  "/wiki/Template:Cleanup",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/Star_Wars_Adventures:_Ghosts_of_Vader%27s_Castle",
  "/wiki/Talk:Jaxxon_T._Tumperakki",
  "/wiki/Coachelle_Prime",
  "/wiki/Lepi",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/New_Republic",
  "/wiki/Smuggler",
  "/wiki/Rabbit%27s_Foot",
  "/wiki/Han_Solo",
  "/wiki/Pilot",
  "/wiki/Reegor",
  "/wiki/Peeta",
  "/wiki/Arvi",
  "/wiki/Benji",
  "/wiki/Maxx",
  "/wiki/The_galaxy",
  "/wiki/WUD-500_star_yacht",
  "/wiki/Repair_droid",
  "/wiki/ML-08",
  "/wiki/Corellian",
  "/wiki/Socorro",
  "/wiki/Gambler",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Bounty_hunter",
  "/wiki/Dengar",
  "/wiki/Renza",
  "/wiki/Hutt",
  "/wiki/Pirate_king",
  "/wiki/Maz_Kanata",
  "/wiki/Hypercoil",
  "/wiki/Corsair",
  "/wiki/Pirate",
  "/wiki/Amaiza_Foxtrain",
  "/wiki/Power_core",
  "/wiki/Battle_of_Yavin",
  "/wiki/Prizzi",
  "/wiki/Queen",
  "/wiki/Livorno",
  "/wiki/Egg",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Realspace",
  "/wiki/Casino",
  "/wiki/The_Wheel",
  "/wiki/Agent",
  "/wiki/Galactic_Empire",
  "/wiki/Ear",
  "/wiki/Millennium_Falcon",
  "/wiki/Rekelos",
  "/wiki/Gloovan",
  "/wiki/Gangster",
  "/wiki/Scram",
  "/wiki/Sabacc",
  "/wiki/Transit_chip",
  "/wiki/3_ABY",
  "/wiki/Baron_Administrator",
  "/wiki/Cloud_City",
  "/wiki/Cyborg",
  "/wiki/Lobot",
  "/wiki/Troglof",
  "/wiki/Corovene_Manakor",
  "/wiki/Stormtrooper",
  "/wiki/Anakin_Skywalker",
  "/wiki/Scipio",
  "/wiki/Najiba/Legends",
  "/wiki/Lysatra",
  "/wiki/Battle_of_Endor",
  "/wiki/Endor",
  "/wiki/Rekk",
  "/wiki/Chancellor",
  "/wiki/Asera",
  "/wiki/Rekkana",
  "/wiki/Commodore",
  "/wiki/Visler_Korda",
  "/wiki/Liberation_of_Rekkana",
  "/wiki/Totem_of_Saglanost",
  "/wiki/Scuttler",
  "/wiki/Hanna_City",
  "/wiki/Chandrila",
  "/wiki/C-3PO",
  "/wiki/Palpatine_Archive",
  "/wiki/Coruscant",
  "/wiki/Coruscant_system",
  "/wiki/Hangar",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Imperial_officer",
  "/wiki/Analysis_droid",
  "/wiki/Golden_Agrooba_of_Metlok_IV",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/Emita",
  "/wiki/Lina_Graf",
  "/wiki/Kashyyyk",
  "/wiki/Festival_of_Bounty",
  "/wiki/Milo_Graf",
  "/wiki/Mustafar",
  "/wiki/Thom_Hudd",
  "/wiki/Skritt",
  "/wiki/Fortress_Vader",
  "/wiki/CR-8R",
  "/wiki/Vane%C3%A9",
  "/wiki/Enujut",
  "/wiki/Ugnaught",
  "/wiki/Merchant",
  "/wiki/Zemerin",
  "/wiki/Diet",
  "/wiki/Evor_Haris",
  "/wiki/Tooth",
  "/wiki/Hair",
  "/wiki/Rabbit",
  "/wiki/Dewback",
  "/wiki/Dewback_steak",
  "/wiki/Flight_suit",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Blaster_pistol",
  "/wiki/Star_Wars",
  "/wiki/The_Lost_Eggs_of_Livorno",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Cavan_Scott",
  "/wiki/Alain_Mauricet",
  "/wiki/Star_Wars_Adventures_Annual_2018",
  "/wiki/April_18",
  "/wiki/2018",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_(1977)_8",
  "/wiki/1977",
  "/wiki/Roy_Thomas",
  "/wiki/Howard_Chaykin",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/A_Sunny_Day_in_the_Void",
  "/wiki/Skeleton",
  "/wiki/Shuttle",
  "/wiki/Star_Wars:_The_Clone_Wars:_Episode_Guide",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_2015)",
  "/wiki/Jason_Aaron",
  "/wiki/Star_Wars_(2015)_1",
  "/wiki/John_Tyler_Christopher",
  "/wiki/Vader_Down_1",
  "/wiki/Chip_Zdarsky",
  "/wiki/Poe_Dameron_1",
  "/wiki/David_Nakayama",
  "/wiki/March_19",
  "/wiki/Ord_Mantell",
  "/wiki/Bounty_Hunted",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Triplecross",
  "/wiki/Fake_It_Till_You_Make_It",
  "/wiki/2020",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Category:Images_of_Jaxxon",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/The_Hoojib_Menace",
  "/wiki/Star_Wars_Adventures_Annual_2021",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Choose_Your_Destiny:_A_Luke_%26_Leia_Adventure",
  "/wiki/Rabbit_Hunt",
  "/wiki/Star_Wars_Adventures_Annual_2020",
  "/wiki/Star_Wars_(2020)_1",
  "/wiki/Hare-Brained_Heist",
  "/wiki/Star_Wars_Adventures_Annual_2019",
  "/wiki/Star_Wars_Adventures:_Ghosts_of_Vader%27s_Castle_2",
  "/wiki/Star_Wars_Adventures:_Ghosts_of_Vader%27s_Castle_3",
  "/wiki/Star_Wars_Adventures:_Ghosts_of_Vader%27s_Castle_4",
  "/wiki/Star_Wars_Adventures:_Ghosts_of_Vader%27s_Castle_5",
  "/wiki/The_Lost_Stories,_Part_3",
  "/wiki/Star_Wars_Adventures_(2017)_32",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Jedi_Temple_Challenge",
  "/wiki/Star_Wars:_Jedi_Temple_Challenge_-_Episode_2",
  "/wiki/October_20",
  "/wiki/2015",
  "/wiki/May_18",
  "/wiki/March_1",
  "/wiki/2016",
  "/wiki/March_6",
  "/wiki/November_27",
  "/wiki/2019",
  "/wiki/May_8"
 ]
}