{
 "name": "Jay",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue-gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Musical information",
   "attributes": [
    {
     "name": "Instruments/parts",
     "values": [
      "Guitar",
      "Microphone"
     ]
    },
    {
     "name": "Songs",
     "values": [
      "Galactic Dreamer"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic",
      "Star Waver"
     ]
    }
   ]
  }
 ],
 "content": "Jay was a Force-sensitive human male former Jedi Padawan and singer following the Clone Wars. After escaping Order 66 during a Clone Wars battle, he was found by Hutt guitarist Geezer Odajion. Jay subsequently joined Odajion's band, Star Waver, serving as its lead singer.\nAt some point in the Imperial Era, Jabba the Hutt placed a bounty on Odajion for refusing to join his crime syndicate, with the bounty hunter Boba Fett capturing the guitarist for execution for his perceived transgression. In response, Jay came up with a plan to rescue Odajion by performing a song to wide acclaim at the Mos Espa Grand Arena, thereby convincing Jabba not to execute his friend.\nJay was a Force-sensitive human male who became a Padawan of the Jedi Order. With the dawn of the Clone Wars between the Galactic Republic and Confederacy of Independent Systems, Jay was made a Jedi Commander in the Grand Army of the Republic. In 19 BBY, Jay was present for a battle between the Republic forces and the Separatist Droid Army. Upon the issuance of Order 66, which required all clone troopers to kill the Jedi they had served under, Jay fled the carnage of the battle with his lightsaber in hand, falling into a vehicle which had a Hutt named Geezer Odajion aboard. The Hutt asked the Padawan what he was, and Jay looked around the vehicle to see musical instruments and other devices used by musicians and bands.\nJay became the lead vocalist of Odajion's band, Star Waver. In the band, Odajion played the flaming rumble bass guitar, a three-torsoed individual named Lan played the versatile cluster drums, the droid K-344 \"Kurti\" played electrified dual guitars, and the droid V-5 mixed electronic sounds for their music. Throughout that time, Jay retained his lightsaber.\nAt some point during the Imperial Era, Jabba the Hutt put out a bounty on Odajion over the latter's refusal to join his crime syndicate. Star Waver was performing their song \"Galactic Dreamer\" at a concert when a group of bounty hunters led by Boba Fett interrupted the performance, seeking to collect the bounty. Jay sought to calm the situation and resume the band's performance. Fett commanded the Hutt to come along to be delivered to Jabba and told Odajion that if he were to resist, he would disintegrate the guitarist's friends. Odajion reacted nonchalantly before attacking Fett using the flamethrower functionality of his flaming rumble bass, starting a skirmish between the band and the bounty hunters.\nThe Star Waver members sought to retreat to their starship, The Rolling Gales, and the band members engaged Fett and his companions in combat using their instruments as weapons to cover their retreat. A Nikto member of Fett's squad tackled Jay, who sought to draw his lightsaber in defense, but the Nikto drew a blaster pistol on Jay until the band's droid V-5 pushed the Nikto off Jay. After Star Waver escaped the concert venue to their ship, Fett pursued the fleeing band aboard his own ship, Slave I, and shot down The Rolling Gales. The bounty hunter took Odajion with him to Jabba at blaster-point, and Odajion was to be executed for his perceived transgressions.\nJay was distraught to see his friend taken away by a bounty hunter after all they had been through together. The former Padawan took his lightsaber in hand and rushed out of The Rolling Gales to rescue Odajion from Fett. Jay shook in fear, trying to ignite his blade to attack Fett. However, instead of activating, Jay's lightsaber produced electrical sparks, distressing Jay. Fett took Odajion away as Jay retreated to the ship, where V-5 played a recording of Star Waver's first rehearsal as a band. Jay ran out of the ship and cried that in the end, Star Waver was just a band. At that time, Jay thought of a plan by which the band could rescue Odajion from execution.\nJay, Kurti, Lan, and V-5 negotiated a deal with Jabba to perform one song with Odajion before his execution at the Mos Espa Grand Arena, located on the desert planet Tatooine. The band members greeted the Hutt guitarist, who was held in stuncuffs by Bib Fortuna, the majordomo of Jabba the Hutt. Released from his binders by Fortuna, Odajion asked in confusion what his friends were doing there, to which Jay and Lan explained that the band had made a deal with Jabba to allow them to perform one last song before Odajion's execution. Star Waver would perform with their instruments for a packed audience that would include Jabba himself at the arena, making it their largest audience thus far. Jay asked Odajion whether he would agree to perform; indeed, the Hutt agreed, and Jay passed his friend his flaming rumble bass guitar.\nAs guards, including Gamorreans, ushered the reunified band toward the platform on which they would perform, one Gamorrean guard saw and heard the definitive sound of Jay's lightsaber and stopped the singer before he could join the rest of the band on stage. The former Jedi told the guard to calm down, as his former weapon was now only a microphone. The guard then allowed Jay to join his bandmates in front of the crowd.\nThe band played \"Galactic Dreamer,\" which was recorded by Hologlide J57 cam droids and broadcast far and wide on Tatooine. The crowd roared with delight, desiring an encore, and even Jabba and his entourage reacted positively. Jay boldly gave Jabba an offer, claiming Star Waver would become the most popular band in the galaxy and giving him the chance to be their first investor. The roar of the crowd convinced the Hutt crime lord to allow the band an encore instead of executing Odajion. The Hutt guitarist, Jay, and K-344 smiled upon hearing the news that Odajion would live.\nJay was a male human with light skin and gray eyes. He had brown hair during the Clone Wars. Later, as the lead singer of Star Waver, Jay grew his hair longer and shaggy and changed its color to blue-gray.\nAs a Padawan, Jay fled a battle of the Clone Wars in fear. After being taken in by Odajion and joining Star Waver, Jay grew to be close friends with the Hutt and the other members of their band. During his time with Star Waver, Jay remained more fearful of combat than his fellow band members. When Boba Fett came to seize Odajion; the Hutt guitarist, Lan, and K-344 were quick to engage Fett's crew; skillfully using their instruments as weapons. In contrast, Jay quivered and hesitated to draw his lightsaber against the attackers.\nIn spite of Jay's fear of fighting, he was willing to fight to defend his friends. When Boba Fett brought Odajion to Slave I, Jay confronted the bounty hunter with his lightsaber. Jay trembled in the rain afraid to engage Boba in combat, but nevertheless attempted to activate his Jedi weapon to defend Odajion. When his saber failed to activate, Jay became solemn and distraught. However, after reflecting on his friendship with Odajion, the singer thought of a plan to negotiate with Jabba to save his friend's life. Jay appealed to Jabba's desire for money and power, ultimately saving Odajion by convincing the crime lord that Star Waver would be more profitable to Jabba with all its members alive.\nAs a member of the Jedi Order, Jay was Force-sensitive. Jay used the Force to leap high in the air as part of his performance at the Mos Espa Grand Arena. He was also a talented singer and guitarist, and was charismatic enough to work up a crowd. Jay utilized his ability to entertain and excite his audience to convince Jabba the Hutt not to execute Odajion.\nJay was capable of brandishing a lightsaber as a weapon. K-344 found him helpful at performing repairs on The Rolling Gales.\nAs a Padawan, Jay wielded a blue-bladed lightsaber in the Clone Wars. His lightsaber was damaged when he fell into Odajion's vehicle, after which he used it as a microphone. Jay attempted to fight off the bounty hunter Boba Fett with his lightsaber when Fett kidnapped Odajion, but his saber only produced sparks of electricity rather than activating its plasma blade, rendering Jay unable to rescue his friend in that way. Later at the Mos Espa Grand Arena, some of Jabba's Gamorrean guards mistook Jay's lightsaber for a functioning weapon, leading the singer to assure them that it was merely a microphone.\nJay was created for \"Tatooine Rhapsody,\" a short film in the Star Wars: Visions series written by Yasumi Atarashi and directed by Taku Kimura of Studio Colorido, and released for streaming on Disney+ on September 22, 2021. The character was first revealed in a trailer uploaded to the official Star Wars YouTube channel on August 17, 2021 and was identified as Jay in a post on StarWars.com the same day.\nJay was voiced by Hiroyuki Yoshino in Japanese and by Joseph Gordon-Levitt in the English dub. In an interview for Disney+, Kimura said he had the inspiration to create the characters Jay and Odajion to express the power of music. While Odajion was a Hutt, he did not want to become a crime lord; loving his music and having the strength of will to leave his family. Similarly, Jay breaks free from the restraint of his Jedi past, wishing to \"rock together\" with his Hutt friend. Kimura recognized that music is central to Star Wars and wanted to change the genre to rock and roll while staying true to the series' theme and values. His studio wanted to convey the message of doing what you want and not being caught up in the past; having both Jay and Odajion escape their past to build a brighter future together.\nTo Gordon-Levitt, creativity means finding a centered place in oneself where you feel powerful by creating something. The character Jay has such moments in the short film, and Gordon-Levitt loved voicing Jay as a character with the combination of music, creativity, and the Force. Lucasfilm executive producer Josh Rimes believes Star Waver exemplifies Star Wars' core theme of a \"found family.\"\nThe original soundtrack for \"Tatooine Rhapsody,\" released digitally on October 15, 2021, identified the title of the song that played during Jay's Clone Wars battle as \"Order 66.\" As a result, it established that Jay was running from his own clone troopers.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Jay_(disambiguation)",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Guitar",
  "/wiki/Microphone",
  "/wiki/Galactic_Dreamer",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Star_Waver",
  "/wiki/File:LoseYourselfEverybody.ogg",
  "/wiki/Force-sensitive",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Musician",
  "/wiki/Clone_Wars",
  "/wiki/Order_66",
  "/wiki/Unidentified_battle_(Jay)",
  "/wiki/Hutt",
  "/wiki/Geezer_Odajion",
  "/wiki/Band",
  "/wiki/Imperial_Era",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Bounty",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Death_penalty",
  "/wiki/Mos_Espa_Grand_Arena",
  "/wiki/File:WhatAreYou.ogg",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Jedi_Commander",
  "/wiki/19_BBY",
  "/wiki/Republic_Military",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Clone_trooper",
  "/wiki/Death",
  "/wiki/Jay%27s_lightsaber",
  "/wiki/Music",
  "/wiki/Flaming_rumble_bass",
  "/wiki/Lan",
  "/wiki/Versatile_cluster_drums",
  "/wiki/K-344",
  "/wiki/Electrified_dual_guitars",
  "/wiki/V-5",
  "/wiki/Time",
  "/wiki/Lightsaber",
  "/wiki/File:ICantAbadonHim.ogg",
  "/wiki/Flamethrower",
  "/wiki/Starship",
  "/wiki/The_Rolling_Gales",
  "/wiki/Nikto",
  "/wiki/Blaster_pistol",
  "/wiki/Slave_I",
  "/wiki/EE-3_carbine_rifle",
  "/wiki/File:BeforeHeExecutesYou.ogg",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Stuncuffs",
  "/wiki/Bib_Fortuna",
  "/wiki/Majordomo",
  "/wiki/Gamorrean",
  "/wiki/Hologlide_J57_cam_droid",
  "/wiki/The_galaxy",
  "/wiki/Crime_lord",
  "/wiki/File:OurFirstSponsor.ogg",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Water",
  "/wiki/Currency",
  "/wiki/File:FixThingsToo.ogg",
  "/wiki/The_Force",
  "/wiki/Force_jump",
  "/wiki/File:JustAMic.ogg",
  "/wiki/Plasma",
  "/wiki/Tatooine_Rhapsody",
  "/wiki/Yasumi_Atarashi",
  "/wiki/Taku_Kimura",
  "/wiki/Studio_Colorido",
  "/wiki/Disney%2B",
  "/wiki/September_22",
  "/wiki/2021",
  "/wiki/August_17",
  "/wiki/StarWars.com",
  "/wiki/Hiroyuki_Yoshino",
  "/wiki/Joseph_Gordon-Levitt",
  "/wiki/Star_Wars:_Visions_Filmmaker_Focus",
  "/wiki/Kajidic",
  "/wiki/Josh_Rimes",
  "/wiki/Star_Wars:_Visions_%E2%80%93_Tatooine_Rhapsody_(Original_Soundtrack)",
  "/wiki/October_15",
  "/wiki/Order_66_(song)",
  "/wiki/Category:Audio_files_of_Jay",
  "/wiki/Category:Images_of_Jay",
  "/wiki/Star_Wars:_Visions_Filmmaker_Focus#Tatooine_Rhapsody",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_Visions_Season_One_Companion",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/Padawan_braid",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Unknown",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi"
 ]
}