{
 "name": "Jayhawk",
 "display_name": "Jayhawk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Between 45 BBY – 40 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Jayhawk was a pirate captain, commanding the freighter Martinette. He pretended to be a privateer of the Alliance to Restore the Republic as a mean to obtain a profit.\nJayhawk was a ruthless pirate and the captain of the Martinette, a modified YT-1300 light freighter with a crew of eight, including himself. Jayhawk promoted the Quarren pirate Mirthen as his second-in-command.\nJayhawk commonly pretended to be a privateer with a letter of marque and reprisal from the Alliance to Restore the Republic, also known as the Rebel Alliance, when raiding an enemy ship, assuming that it would impress them. The Alliance, however, was unfamiliar with Jayhawk. In this guise, Jayhawk successfully robbed several light freighters.\nC. 1 ABY, Jayhawk visited the planet Abonshee and met with Godking Trisstan of the native Anointed People. Jayhawk again pretended to be a member of the Alliance on a diplomatic mission. However, once he had the trust of Trisstan, Jayhawk stole part of his treasure and escaped the planet.\nSoon afterward, Jayhawk and the Martinette attacked a pleasure yacht, the Long Shot. At that point, Jayhawk did not know that the Long Shot really belonged to the Alliance.\nJayhawk was a sadistic individual who killed without remorse. He was too pragmatic to murder without a reason and he did not deal in slaves; thus, whenever he captured a crew or those surrendered, Jayhawk abandoned those people wherever they could not be an immediate threat, such as a non-technological planet or an escape pod.\nJayhawk promoted Mirthen, a drug-addict pirate, as his second-in-command because Mirthen was unambitious and would not conspire against him, not because of Mirthen's skills.\nJayhawk was a thin man who favored black pants, white shirts and red vests. He had a pencil-thin moustache. He commonly carried a blaster pistol and a saber, and he knew how to use both.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/45_BBY/Legends",
  "/wiki/40_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Martinette",
  "/wiki/Privateer/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Mirthen",
  "/wiki/Letter_of_marque_and_reprisal",
  "/wiki/1_ABY/Legends",
  "/wiki/Abonshee",
  "/wiki/Godking",
  "/wiki/Trisstan",
  "/wiki/Anointed_People",
  "/wiki/Long_Shot",
  "/wiki/Saber",
  "/wiki/West_End_Games",
  "/wiki/Tests_of_the_Godking",
  "/wiki/Star_Wars_Campaign_Pack",
  "/wiki/Classic_Campaigns",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/0_ABY/Legends"
 ]
}