{
 "name": "Jayhold_Beehaz",
 "display_name": "Jayhold Beehaz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 BBY",
      "Aldhani"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jayhold Beehaz's family",
      "Galactic Empire",
      "Imperial Army",
      "Aldhani Garrison",
      "Imperial Army",
      "Aldhani Garrison"
     ]
    }
   ]
  }
 ],
 "content": "Jayhold Beehaz was an Imperial Military officer who served the Galactic Empire as the commandant of the Aldhani Garrison, headquartered on the Aldhani dam and Alkenzi Air Base on the planet Aldhani.\nJayhold Beehaz served the Galactic Empire during its reign, and by 5 BBY, had been stationed on Aldhani for some time as the Aldhani Garrison's commandant. During a rebel mission on Aldhani, Commandant Beehaz hosted Colonel Petigar, an Imperial engineer from Coruscant, as the garrison sought to relocate the Alkenzi Air Base closer to the Imperial headquarters on the dam. Beehaz had a family, consisting of his wife Roboda Beehaz, and his son Leonart Beehaz, who accompanied him in the base. Shortly prior to the Eye of Aldhani, Beehaz, his family, and Petigar were taken hostage by the Aldhani rebel infiltration team, resulting in the deaths of Petigar and eventually Beehaz after he succumbed to a heart attack while loading stolen credits aboard the Max-7 Rono freighter at gunpoint.\nJayhold was a human male with fair skin, dark eyes, and by 5 BBY, had graying black hair that was balding. Jayhold believed that the Dhanis were a simple people with a sad combination of traits that the Empire could take advantage of through manipulation. He also considered the Dhanis to be a prideful people. He was stern with his family and expected them to adhere to the traditions and formalities of the Empire, even if it led to their own discomfort. However, he still cared for them, as he cooperated with the rebel infiltration team out of fear for their safety.\nUnlike other Imperial officer uniforms, Beehaz wore a modified double-breasted tunic with a pair of black boots, a belt, and a kepi cap. The tunic had an extended skirt, black epaulets, and a black collar. The sleeves were also black rather than the standard cloth until slightly past the wrist. During the day of the Eye of Aldhani, Beehaz outfitted his uniform with ceremonial garments, including a ceremonial belt and sash with black and white stripes, as well as a black cape with silver collar pins and silver epaulets. He had two kepi caps, one of which had a black visor with two white horizontal stripes. As a commandant in the Imperial Military, he used a single-rowed rank insignia plaque with four blue tiles followed by two red tiles.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/5_BBY",
  "/wiki/Aldhani",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/Aldhani_Garrison",
  "/wiki/Imperial_Military",
  "/wiki/Imperial_officer",
  "/wiki/Commandant",
  "/wiki/Aldhani_dam",
  "/wiki/Alkenzi_Air_Base",
  "/wiki/Imperial_Era",
  "/wiki/Time",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Colonel",
  "/wiki/Petigar",
  "/wiki/Engineer",
  "/wiki/Coruscant",
  "/wiki/Garrison",
  "/wiki/Roboda_Beehaz",
  "/wiki/Leonart_Beehaz",
  "/wiki/Eye_of_Aldhani",
  "/wiki/Aldhani_rebel_infiltration_team",
  "/wiki/Credit",
  "/wiki/Max-7_Rono_freighter",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Dhani",
  "/wiki/Gorn",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Color",
  "/wiki/Epaulet",
  "/wiki/Rank_insignia_plaque",
  "/wiki/The_Axe_Forgets",
  "/wiki/The_Eye",
  "/wiki/Death",
  "/wiki/Kassa_(episode)"
 ]
}